000100 IDENTIFICATION DIVISION.                                                 
000200                                                                          
000300 PROGRAM-ID.    MLKRP224.                                                 
000400 AUTHOR.        DAVE METZGER.                                             
000500 INSTALLATION.  KOHLS DEPARTMENT STORES.                                  
000600 DATE-WRITTEN.  02/07/00.                                                 
000700 DATE-COMPILED.                                                           
000800                                                                          
000900******************************************************************        
001000*     MLKRP224 - MERCHANDISE STATISTICS REPORT                            
001100*                                                                         
001200* THIS PROGRAM READS EXTRACTS FROM THE DEPARTMENT-LEVEL MONTHLY           
001300* OTB, PLANNING, M/L AND WEEKLY M/L AND WEEKLY PLANNING TABLES            
001400* TO PRODUCE 2 REPORTS:                                                   
001500*    1) DEPT-LEVEL MERCHADISE STATISTICS REPORT WEEKLY & MTD              
001600*       (CONSISTING OF 2 OR MORE PAGES FOR EACH GMM)                      
001700*    2) DEPT-LEVEL MERCHADISE STATISTICS REPORT YTD                       
001800*                                                                         
001900* TOTALS ARE REPORTED FOR THE FOLLOWING LEVELS:                           
002000*       MANAGER  (DMM)                                            00200000
002100*       DIVISION (GMM)                                            00210000
002200*       COMPANY                                                   00220000
002300*                                                                 00230000
002400* TOTALS ARE ACCUMULATED FROM THE BUYER LEVEL TO THE DMM/GMM      00240000
002500* LEVELS DUE TO THE TABLE FORMATS IN THE INPUT RECORDS.           00250000
002600*                                                                 00260000
002700* CHANGED BY                                                      00270000
002800* DAVE METZGER - 06/23/00 - REQUEST #99999                        00280089
002900* CORRECTED THE GROSS RECEIPTS RETAIL PERCENTAGES FOR FORECAST,   00290089
003000* PLAN, AND LAST YEAR TO BE PERCENTAGES BASED ON GROSS RECEIPTS   00300089
003100* FOR THE ENTIRE MONTH.                                           00310089
003200*                                                                 00320089
002800* DAVE METZGER - 06/29/00 - REQUEST #99999                        00321091
002900* CHANGED PLAN GROSS RECEIPTS HEADING TO PLAN-NET FOR DMM/GMM/CMPY00322093
003200* LEVELS.                                                         00325093
003300*                                                                 00330000
21517 * V. LEE YANG  - 09/26/00 - REQUEST #21517                        00321091
21517 * CHANGED TO ADD PURCHASE ADJUSTMENT TO WEEKLY PLANNING TABLE     00322093
21517 * AND EOM INVENTORY TO MONTHLY PLANNING TABLE FOR COMBINED LEDGER 00325093
21517 * PHASE 6                                                                 
21517 *                                                                 00330000
W26603******************************************************************        
W26603* CHG ID   DATE        DESCRIPTION                               *        
W26603* ------   ----------  ----------------------------------------- *        
W26603* W26603   03-22-2004  STORE EXPANSION.  EXPANDED LRECL OF       *        
W26603*                      INP01, INP02, INP03 FILE BECAUSE OF       *        
W26603*                      CHANGES TO MLRD122, MLRD128, MLRD140.     *        
W26603*                      EXPANDED WORKING STORAGE                  *        
W26603*                      VARIABLES.  AT THIS TIME WE ARE NOT       *        
W26603*                      EXPANDING THE REPORT FIELDS.              *        
W26603*                      ADDED 'WITH UR' TO DB2 SELECTS.           *        
W26603*                      - RONNA MCDONALD                          *        
L1010 * P809929  10-10-2005  DIVISION BY ZERO ISSUE.                   *        
003400******************************************************************00340000
003500                                                                  00350000
003600 ENVIRONMENT DIVISION.                                            00360000
003700                                                                  00370000
003800                                                                  00380000
003900 CONFIGURATION SECTION.                                           00390000
004000                                                                  00400000
004100 SOURCE-COMPUTER.        IBM-3090.                                00410000
004200 OBJECT-COMPUTER.        IBM-3090.                                00420000
004300                                                                  00430000
004400                                                                  00440000
004500 INPUT-OUTPUT SECTION.                                            00450000
004600                                                                  00460000
004700 FILE-CONTROL.                                                    00470000
004800                                                                  00480000
004900     SELECT LEDGER-EXTRACT-WK-FILE                                00490000
005000         ASSIGN TO INP01.                                         00500000
005100                                                                  00510000
005200     SELECT LEDGER-EXTRACT-MN-FILE                                00520000
005300         ASSIGN TO INP02.                                         00530000
005400                                                                  00540000
005500     SELECT LEDGER-EXTRACT-EOW-FILE                               00550000
005600         ASSIGN TO INP03.                                         00560000
005700                                                                  00570000
005800     SELECT LEDGER-EXTRACT-DATE-FILE                              00580000
005900         ASSIGN TO INP04.                                         00590000
006000                                                                  00600000
006100     SELECT WKLY-LEDGER-REPORT-FILE                               00610075
006200         ASSIGN RPT01.                                            00620000
006300                                                                  00630000
006100     SELECT YTD-LEDGER-REPORT-FILE                                00631075
006200         ASSIGN RPT02.                                            00632075
006300                                                                  00633075
006400                                                                  00640000
006500                                                                  00650000
006600 DATA DIVISION.                                                   00660000
006700                                                                  00670000
006800                                                                  00680000
006900 FILE SECTION.                                                    00690000
007000                                                                  00700000
007100 FD  LEDGER-EXTRACT-DATE-FILE                                     00710000
007200     RECORDING MODE IS F                                          00720000
007300     LABEL RECORDS ARE STANDARD                                   00730000
007400     BLOCK CONTAINS 0 RECORDS.                                    00740000
007500                                                                  00750000
007600 01  LEDGER-EXTRACT-DATE-RECORD       PIC X(80).                  00760000
007700                                                                  00770000
007800 FD  LEDGER-EXTRACT-WK-FILE                                       00780000
007900     RECORDING MODE IS F                                          00790000
008000     LABEL RECORDS ARE STANDARD                                   00800000
008100     BLOCK CONTAINS 0 RECORDS.                                    00810000
008200                                                                  00820000
W26603*01  LEDGER-EXTRACT-WK-RECORD         PIC  X(1449).               00830000
W26603 01  LEDGER-EXTRACT-WK-RECORD         PIC  X(1638).               00830000
008500                                                                  00840000
008600 FD  LEDGER-EXTRACT-EOW-FILE                                      00850000
008700     RECORDING MODE IS F                                          00860000
008800     LABEL RECORDS ARE STANDARD                                   00870000
008900     BLOCK CONTAINS 0 RECORDS.                                    00880000
009000                                                                  00890000
W26603*01  LEDGER-EXTRACT-EOW-RECORD        PIC X(964).                 00900000
W26603 01  LEDGER-EXTRACT-EOW-RECORD        PIC X(1123).                00900000
009200                                                                  00910000
009300 FD  LEDGER-EXTRACT-MN-FILE                                       00920000
009400     RECORDING MODE IS F                                          00930000
009500     LABEL RECORDS ARE STANDARD                                   00940000
009600     BLOCK CONTAINS 0 RECORDS.                                    00950000
009700                                                                  00960000
W26603*01  LEDGER-EXTRACT-MN-RECORD         PIC  X(4432).               00970000
W26603 01  LEDGER-EXTRACT-MN-RECORD         PIC  X(5131).               00970000
009900                                                                  00980000
010000 FD  WKLY-LEDGER-REPORT-FILE                                      00990075
010100     RECORDING MODE IS F                                          01000000
010200     LABEL RECORDS ARE STANDARD                                   01010000
010300     BLOCK CONTAINS 0 RECORDS.                                    01020000
010400                                                                  01030000
010500 01  WKLY-LEDGER-REPORT-RECORD        PIC  X(200).                01040075
009900                                                                  01041075
010000 FD  YTD-LEDGER-REPORT-FILE                                       01042075
010100     RECORDING MODE IS F                                          01043075
010200     LABEL RECORDS ARE STANDARD                                   01044075
010300     BLOCK CONTAINS 0 RECORDS.                                    01045075
010400                                                                  01046075
010500 01  YTD-LEDGER-REPORT-RECORD        PIC  X(200).                 01047075
010600                                                                  01050000
010700                                                                  01060000
010800 WORKING-STORAGE SECTION.                                         01070000
010900                                                                  01080000
011000****************************************************************  01090000
011100* RECORD LAYOUT FOR LEDGER EXTRACT WEEKLY RECORD                  01100000
011200****************************************************************  01110000
011300                                                                  01120000
011400******************************************************************01130000
011500*  MLRD122 - WEEKLY DATA EXTRACT FOR COMBINATION LEDGER REPORT    01140000
011600******************************************************************01150000
21517      COPY MLRD122.                                                01160000
011800                                                                  01170000
011900****************************************************************  01180000
012000* RECORD LAYOUT FOR LEDGER EXTRACT MONTHLY RECORD                 01190000
012100****************************************************************  01200000
012200     COPY MLRD128.                                                01210000
012300                                                                  01220000
012400************************************************************      01230000
012500* RECORD LAYOUT FOR EOW INVENTORY.                                01240000
012600************************************************************      01250000
012700     COPY MLRD140.                                                01260000
012800                                                                  01270000
012900****************************************************************  01280000
013000* RECORD LAYOUT FOR LEDGER EXTRACT DATE RECORD                    01290000
013100****************************************************************  01300000
013200     COPY MLRD114.                                                01310000
013300                                                                  01320000
013400***************************************************************** 01330000
013500* 200 CHARACTER REPORT LAYOUT                                     01340000
013600***************************************************************** 01350000
013700     COPY DPWS200O.                                               01360000
013800                                                                  01370000
013900******************************************************************01380000
014000*  VARIABLES REQUIRED FOR THE FORMAT SQLCA ROUTINE DPPD004        01390000
014100******************************************************************01400000
014200     COPY DPWS004.                                                01410000
014300                                                                  01420000
014400 01  PC-PROGRAM-CONSTANTS.                                        01430000
014500     05  PC-PAGE-MAX-LINES            PIC S9(04)     COMP SYNC    01440000
014600                                                     VALUE +70.   01450000
014610     05  PC-PAGE-MAX-LINES-PLUS-1     PIC S9(04)     COMP SYNC    01460000
014620                                                     VALUE +71.   01461000
014700     05  PC-D                         PIC  X(03)     VALUE 'D'.   01462000
014700     05  PC-YTD                       PIC  X(03)     VALUE 'YTD'. 01462148
014800     05  PC-MDSELV-GMA                PIC  X(03)     VALUE 'GMA'. 01463000
014900     05  PC-MDSELV-DMA                PIC  X(03)     VALUE 'DMA'. 01464000
015000     05  PC-RSPLVL-CDE-GMM            PIC  X(03)     VALUE 'GMM'. 01465000
015100     05  PC-RSPLVL-CDE-DMM            PIC  X(03)     VALUE 'DMM'. 01466000
015100     05  PC-GMM-TOTAL                 PIC  X(09)     VALUE        01467000
                                                        'GMM TOTAL'.    01468000
015100     05  PC-TOTAL-KOHLS               PIC  X(11)     VALUE        01469000
                                                        'TOTAL KOHLS'.  01470000
015100     05  PC-ACTUAL                    PIC  X(08)     VALUE        01480000
                                                        'ACTUAL  '.     01490000
015100     05  PC-FCST                      PIC  X(08)     VALUE        01500000
                                                        'FCST    '.     01510000
015100     05  PC-PLAN                      PIC  X(08)     VALUE        01511000
                                                        'PLAN    '.     01512000
015100     05  PC-PLAN-NET                  PIC  X(08)     VALUE        01512190
                                                        'PLAN-NET'.     01512290
015100     05  PC-VAR-FCST                  PIC  X(08)     VALUE        01513000
                                                        'VAR FCST'.     01514000
015100     05  PC-VAR-PL                    PIC  X(08)     VALUE        01515000
                                                        'VAR PL  '.     01516000
015100     05  PC-PVARFCST                  PIC  X(08)     VALUE        01517000
                                                        '%VARFCST'.     01518000
015100     05  PC-PVARPL                    PIC  X(08)     VALUE        01519000
                                                        '%VARPL  '.     01519100
015100     05  PC-PVARLY                    PIC  X(08)     VALUE        01519200
                                                        '%VARLY  '.     01519300
015100     05  PC-PMNTH                     PIC  X(08)     VALUE        01519400
                                                        '%MNTH   '.     01519500
015100     05  PC-LYPMNTH                   PIC  X(08)     VALUE        01519600
                                                        'LY%MNTH '.     01519700
015200     05  PC-PCT-OVER                  PIC  X(08)     VALUE        01519800
015300           '******* '.                                            01519900
015510     05  PC-THOUSAND                  PIC S9(04)V99  COMP-3       01520000
015520                                                     VALUE +1000. 01530000
015600     05  PC-HUNDRED                   PIC S9(04)V99  COMP-3       01540000
015700                                                     VALUE +100.  01550000
015800     05  PC-DEPT-NBR-000              PIC  X(03)     VALUE '000'. 01560000
015900     05  PC-OPERCO-NBR                PIC  X(02)     VALUE '03'.  01570000
016000     05  PC-APLSYS-CDE                PIC  X(02)     VALUE 'ML'.  01580000
016100     05  PC-MAX-MN                    PIC S9(04)     COMP SYNC    01590000
016200                                                     VALUE 12.    01600000
016300     05  PS-WK-IDX                    PIC  9(03)     VALUE 0.     01610000
016400     05  PS-MN-IDX                    PIC  9(03)     VALUE 0.     01620000
016500     05  PS-IDX-1                     PIC  9(03)     VALUE 0.     01630000
016600     05  PS-IDX-2                     PIC  9(03)     VALUE 0.     01640000
016700     05  PS-GMMS-LOADED               PIC  9(03)     VALUE 0.     01650000
016800     05  PS-DMMS-LOADED               PIC  9(03)     VALUE 0.     01660000
016900                                                                  01670000
017000 01  PS-PROGRAM-SWITCHES.                                         01680000
017100     05  PS-END-OF-FSCL-MN-NM-CSR-SW    PIC X    VALUE 'N'.       01690000
017200         88 PS-END-OF-FSCL-MN-NM-CSR             VALUE 'Y'.       01700000
017300     05  PS-END-OF-LEDGER-EXTRACT-WK-SW PIC X    VALUE 'N'.       01710000
017400         88 PS-END-OF-LEDGER-EXTRACT-WK          VALUE 'Y'.       01720000
017500     05  PS-END-OF-LEDGER-EXTRACT-MN-SW PIC X    VALUE 'N'.       01730000
017600         88 PS-END-OF-LEDGER-EXTRACT-MN          VALUE 'Y'.       01740000
017700     05  PS-END-OF-LEDGER-EOW-FILE-SW   PIC X    VALUE 'N'.       01750000
017800         88 PS-END-OF-LEDGER-EOW-FILE            VALUE 'Y'.       01760000
017900     05  PS-END-OF-LEDGER-DATE-FILE-SW  PIC X    VALUE 'N'.       01770000
018000         88 PS-END-OF-LEDGER-DATE-FILE           VALUE 'Y'.       01780000
017900     05  PS-WEEKLY-REPORT-SW            PIC X    VALUE 'Y'.       01781075
018000         88 WEEKLY-REPORT                        VALUE 'Y'.       01782075
018000         88 YTD-REPORT                           VALUE 'N'.       01783075
018100                                                                  01790000
018200 01  PV-PROGRAM-VARIABLES.                                        01800000
018300     05  PV-LINE-COUNTER-1            PIC S9(03)V99  COMP-3       01810000
018400                                                     VALUE 71.    01820000
018500     05  PV-LINE-COUNTER-2            PIC S9(03)V99  COMP-3       01830000
018600                                                     VALUE 71.    01840000
018700     05  PV-LINE-COUNTER-3            PIC S9(03)V99  COMP-3       01850000
018800                                                     VALUE 71.    01860000
018900     05  PV-PCT                       PIC S9(03)V9999 COMP-3      01870000
019000                                                     VALUE ZERO.  01880000
019100     05  PV-DEPT-NBR                  PIC  X(03)     VALUE SPACE. 01890000
019200     05  PV-GMA-NBR                   PIC  X(02)     VALUE SPACE. 01900000
019300     05  PV-DMA-NBR                   PIC  X(02)     VALUE SPACE. 01910000
019400     05  PV-BYR-NBR                   PIC  X(03)     VALUE SPACE. 01920000
019500     05  PV-MDSELV-CDE                PIC  X(03)     VALUE SPACE. 01930000
019600     05  PV-FIRST-INIT-LAST-NAME.                                 01940000
019700         10  PV-FIRST-INIT            PIC  X(01)     VALUE SPACE. 01950000
019800         10  FILLER                   PIC  X(02)     VALUE '. '.  01960000
019900         10  PV-LAST-NAME             PIC  X(12)     VALUE SPACE. 01970000
020000     05  PV-TY-LAST-WK-IN-MN          PIC S9(04)     COMP-3       01980000
020100                                                     VALUE ZERO.  01990000
020200     05  PV-LY-LAST-WK-IN-MN          PIC S9(04)     COMP-3       02000000
020300                                                     VALUE ZERO.  02010000
020400     05  TY-LAST-WK-IN-MN             PIC  X(01)     VALUE SPACE. 02020000
020500     05  LY-LAST-WK-IN-MN             PIC  X(01)     VALUE SPACE. 02030000
020600     05  PV-PAGE-CNT                  PIC S9(05)     COMP-3       02040000
020700                                                     VALUE ZERO.  02050000
020800     05  PV-INV-MONTHS                PIC S9(05)     COMP-3       02060000
020900                                                     VALUE ZERO.  02070000
021000     05  PV-PARAGRAPH-NAME            PIC  X(30)     VALUE SPACE. 02080000
021100     05  PV-DB2-OPER-ATTEMPTED        PIC  X(30)     VALUE SPACE. 02090000
021200     05  PV-ABEND-CODE                PIC S9(04)     COMP         02100000
021300                                                     VALUE ZERO.  02110000
021400 01  SS-SUBSCRIPTS.                                               02120000
021500     05  SS-OPEN-MN                   PIC S9(04)     COMP SYNC    02130000
021600                                                     VALUE ZERO.  02140000
021700     05  SS-CURR-MN                   PIC S9(04)     COMP SYNC    02150000
021800                                                     VALUE ZERO.  02160000
021900     05  SS-OPEN-WK                   PIC S9(04)     COMP SYNC    02170000
022000                                                     VALUE ZERO.  02180000
022100     05  SS-CURR-WK                   PIC S9(04)     COMP SYNC    02190000
022200                                                     VALUE ZERO.  02200000
022300     05  SS-OPEN-FSCL-WK              PIC S9(04)     COMP SYNC    02210000
022400                                                     VALUE ZERO.  02220000
022410     05  PV-MONTH1-SALES          PIC S9(11)V99  COMP-3 VALUE +0. 02230000
022411     05  PV-MONTH2-SALES          PIC S9(11)V99  COMP-3 VALUE +0. 02240000
022420                                                                  02241000
022500 01  PV-TOTALS.                                                   02242000
022600     05  PV-SALES-ACCUM           PIC S9(11)V99  COMP-3.          02243000
022700     05  PV-FC-MKDN-ACCUM         PIC S9(11)V99  COMP-3.          02244000
022800     05  PV-PL-MKDN-ACCUM         PIC S9(11)V99  COMP-3.          02245000
022900*                                                                 02246000
023000******************************************************************02247000
023100* THIS TABLE CONTAINS GMM REPORT TOTALS FOR PAGE 1 AND 2          02248000
023200******************************************************************02249000
023300 01  AT-GMMS-TABLE.                                               02250000
023400***  PAGE 1 REPORT TOTALS                                         02260000
023500     05  AT-GMMS-PG1    OCCURS 99 TIMES INDEXED BY GMM-IDX1.      02270000
023600         10  AT-GMM-NBR-PG1                PIC X(02).             02280000
023700         10  AT-GMM-NAME-PG1               PIC X(18).             02290000
023800         10  AT-GMM-DESC-PG1               PIC X(25).             02300000
023900         10  AT-GMM-TY-PG1-TOTS.                                  02310000
024000             15  AT-GMM-TY-SLS-WK1         PIC S9(11)V99  COMP-3. 02320000
024100             15  AT-GMM-TY-SLS-WK2         PIC S9(11)V99  COMP-3. 02330000
024200             15  AT-GMM-TY-SLS-WK3         PIC S9(11)V99  COMP-3. 02340000
024300             15  AT-GMM-TY-SLS-WK4         PIC S9(11)V99  COMP-3. 02350000
024400             15  AT-GMM-TY-SLS-WK5         PIC S9(11)V99  COMP-3. 02360000
024500             15  AT-GMM-TY-SLS-MTD         PIC S9(11)V99  COMP-3. 02370000
024600             15  AT-GMM-TY-SLS-MONTH       PIC S9(11)V99  COMP-3. 02380000
024700             15  AT-GMM-TY-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 02390062
024800             15  AT-GMM-TY-GM-MTD          PIC S9(11)V99  COMP-3. 02400000
024900             15  AT-GMM-TY-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 02410000
025000             15  AT-GMM-TY-INV-EOW         PIC S9(11)V99  COMP-3. 02420000
025100             15  AT-GMM-TY-MKDN-MTD        PIC S9(11)V99  COMP-3. 02430000
025200             15  AT-GMM-TY-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 02440000
025300             15  AT-GMM-TY-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 02450000
025400             15  AT-GMM-TY-PRCH-RTL        PIC S9(11)V99  COMP-3. 02460000
025500             15  AT-GMM-TY-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 02470000
025600         10  AT-GMM-FC-PG1-TOTS.                                  02480000
025700             15  AT-GMM-FC-SLS-WK1         PIC S9(11)V99  COMP-3. 02490000
025800             15  AT-GMM-FC-SLS-WK2         PIC S9(11)V99  COMP-3. 02500000
025900             15  AT-GMM-FC-SLS-WK3         PIC S9(11)V99  COMP-3. 02510000
026000             15  AT-GMM-FC-SLS-WK4         PIC S9(11)V99  COMP-3. 02520000
026100             15  AT-GMM-FC-SLS-WK5         PIC S9(11)V99  COMP-3. 02530000
026200             15  AT-GMM-FC-SLS-MTD         PIC S9(11)V99  COMP-3. 02540000
026300             15  AT-GMM-FC-SLS-MONTH       PIC S9(11)V99  COMP-3. 02550000
026400             15  AT-GMM-FC-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 02560062
026500             15  AT-GMM-FC-GM-MTD          PIC S9(11)V99  COMP-3. 02570000
026600             15  AT-GMM-FC-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 02580000
026700             15  AT-GMM-FC-INV-EOW         PIC S9(11)V99  COMP-3. 02590000
026800             15  AT-GMM-FC-MKDN-MTD        PIC S9(11)V99  COMP-3. 02600000
026900             15  AT-GMM-FC-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 02610000
027000             15  AT-GMM-FC-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 02620000
027100             15  AT-GMM-FC-PRCH-RTL        PIC S9(11)V99  COMP-3. 02630000
027200             15  AT-GMM-FC-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 02640000
027300         10  AT-GMM-PL-PG1-TOTS.                                  02650000
027400             15  AT-GMM-PL-SLS-WK1         PIC S9(11)V99  COMP-3. 02660000
027500             15  AT-GMM-PL-SLS-WK2         PIC S9(11)V99  COMP-3. 02670000
027600             15  AT-GMM-PL-SLS-WK3         PIC S9(11)V99  COMP-3. 02680000
027700             15  AT-GMM-PL-SLS-WK4         PIC S9(11)V99  COMP-3. 02690000
027800             15  AT-GMM-PL-SLS-WK5         PIC S9(11)V99  COMP-3. 02700000
027900             15  AT-GMM-PL-SLS-MTD         PIC S9(11)V99  COMP-3. 02710000
028000             15  AT-GMM-PL-SLS-MONTH       PIC S9(11)V99  COMP-3. 02720000
028100             15  AT-GMM-PL-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 02730062
028200             15  AT-GMM-PL-GM-MTD          PIC S9(11)V99  COMP-3. 02740000
028300             15  AT-GMM-PL-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 02750000
028400             15  AT-GMM-PL-INV-EOW         PIC S9(11)V99  COMP-3. 02760000
028500             15  AT-GMM-PL-MKDN-MTD        PIC S9(11)V99  COMP-3. 02770000
028600             15  AT-GMM-PL-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 02780000
028700             15  AT-GMM-PL-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 02790000
028800             15  AT-GMM-PL-PRCH-RTL        PIC S9(11)V99  COMP-3. 02800000
028900             15  AT-GMM-PL-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 02810000
029000             15  AT-GMM-PL-RCPT-RTL        PIC S9(11)V99  COMP-3. 02820000
029100             15  AT-GMM-PL-PADJ-RTL        PIC S9(11)V99  COMP-3. 02830000
029200             15  AT-GMM-PL-RCPT-NET-CST    PIC S9(11)V99  COMP-3. 02840000
029300             15  AT-GMM-PL-PADJ-NET-CST    PIC S9(11)V99  COMP-3. 02850000
029400         10  AT-GMM-PCT-VAR-LY-PG1-TOTS.                          02860000
029500             15  AT-GMM-PVLY-SLS-WK1       PIC S9(11)V99  COMP-3. 02870000
029600             15  AT-GMM-PVLY-SLS-WK2       PIC S9(11)V99  COMP-3. 02880000
029700             15  AT-GMM-PVLY-SLS-WK3       PIC S9(11)V99  COMP-3. 02890000
029800             15  AT-GMM-PVLY-SLS-WK4       PIC S9(11)V99  COMP-3. 02900000
029900             15  AT-GMM-PVLY-SLS-WK5       PIC S9(11)V99  COMP-3. 02910000
030000             15  AT-GMM-PVLY-SLS-MTD       PIC S9(11)V99  COMP-3. 02920000
030100             15  AT-GMM-PVLY-SLS-MONTH     PIC S9(11)V99  COMP-3. 02930000
030200             15  AT-GMM-PVLY-COMP-SLS-MTD  PIC S9(11)V99  COMP-3. 02940062
030300             15  AT-GMM-PVLY-GM-MTD        PIC S9(11)V99  COMP-3. 02950000
030400             15  AT-GMM-PVLY-GM-MTD-PCT    PIC S9(03)V9   COMP-3. 02960000
030500             15  AT-GMM-PVLY-INV-EOW       PIC S9(11)V99  COMP-3. 02970000
030600             15  AT-GMM-PVLY-MKDN-MTD      PIC S9(11)V99  COMP-3. 02980000
030700             15  AT-GMM-PVLY-MKDN-MTD-PCT  PIC S9(03)V9   COMP-3. 02990000
030800             15  AT-GMM-PVLY-MKON-PRCH-PCT PIC S9(03)V9 COMP-3.   03000000
030900             15  AT-GMM-PVLY-PRCH-RTL      PIC S9(11)V99  COMP-3. 03010000
031000             15  AT-GMM-PVLY-PRCH-NET-CST  PIC S9(11)V99  COMP-3. 03020000
031100***  PAGE 2 REPORT TOTALS                                         03030000
031200     05  AT-GMMS-PG2    OCCURS 99 TIMES INDEXED BY GMM-IDX2.      03040000
031300         10  AT-GMM-NBR-PG2               PIC X(02).              03050000
031400         10  AT-GMM-NAME-PG2              PIC X(18).              03060000
031500         10  AT-GMM-DESC-PG2              PIC X(25).              03070000
031600         10  AT-GMM-TY-PG2-TOTS.                                  03080000
031700             15  AT-GMM-TY-GR-WK1          PIC S9(11)V99  COMP-3. 03090000
031800             15  AT-GMM-TY-GR-WK2          PIC S9(11)V99  COMP-3. 03100000
031900             15  AT-GMM-TY-GR-WK3          PIC S9(11)V99  COMP-3. 03110000
032000             15  AT-GMM-TY-GR-WK4          PIC S9(11)V99  COMP-3. 03120000
032100             15  AT-GMM-TY-GR-WK5          PIC S9(11)V99  COMP-3. 03130000
032200             15  AT-GMM-TY-GR-MTD          PIC S9(11)V99  COMP-3. 03140000
032300             15  AT-GMM-TY-PADJ-WK1        PIC S9(11)V99  COMP-3. 03150000
032400             15  AT-GMM-TY-PADJ-WK2        PIC S9(11)V99  COMP-3. 03160000
032500             15  AT-GMM-TY-PADJ-WK3        PIC S9(11)V99  COMP-3. 03170000
032600             15  AT-GMM-TY-PADJ-WK4        PIC S9(11)V99  COMP-3. 03180000
032700             15  AT-GMM-TY-PADJ-WK5        PIC S9(11)V99  COMP-3. 03190000
032800             15  AT-GMM-TY-PADJ-MTD        PIC S9(11)V99  COMP-3. 03200000
032900         10  AT-GMM-FC-PG2-TOTS.                                  03210000
033000             15  AT-GMM-FC-GR-WK1          PIC S9(11)V99  COMP-3. 03220000
033100             15  AT-GMM-FC-GR-WK2          PIC S9(11)V99  COMP-3. 03230000
033200             15  AT-GMM-FC-GR-WK3          PIC S9(11)V99  COMP-3. 03240000
033300             15  AT-GMM-FC-GR-WK4          PIC S9(11)V99  COMP-3. 03250000
033400             15  AT-GMM-FC-GR-WK5          PIC S9(11)V99  COMP-3. 03260000
033500             15  AT-GMM-FC-GR-MTD          PIC S9(11)V99  COMP-3. 03270000
033500             15  AT-GMM-FC-GR-MONTH        PIC S9(11)V99  COMP-3. 03271052
033600             15  AT-GMM-FC-PADJ-WK1        PIC S9(11)V99  COMP-3. 03280000
033700             15  AT-GMM-FC-PADJ-WK2        PIC S9(11)V99  COMP-3. 03290000
033800             15  AT-GMM-FC-PADJ-WK3        PIC S9(11)V99  COMP-3. 03300000
033900             15  AT-GMM-FC-PADJ-WK4        PIC S9(11)V99  COMP-3. 03310000
034000             15  AT-GMM-FC-PADJ-WK5        PIC S9(11)V99  COMP-3. 03320000
034100             15  AT-GMM-FC-PADJ-MTD        PIC S9(11)V99  COMP-3. 03330000
034200         10  AT-GMM-PL-PG2-TOTS.                                  03340000
034300             15  AT-GMM-PL-GR-WK1          PIC S9(11)V99  COMP-3. 03350000
034400             15  AT-GMM-PL-GR-WK2          PIC S9(11)V99  COMP-3. 03360000
034500             15  AT-GMM-PL-GR-WK3          PIC S9(11)V99  COMP-3. 03370000
034600             15  AT-GMM-PL-GR-WK4          PIC S9(11)V99  COMP-3. 03380000
034700             15  AT-GMM-PL-GR-WK5          PIC S9(11)V99  COMP-3. 03390000
034800             15  AT-GMM-PL-GR-MTD          PIC S9(11)V99  COMP-3. 03400000
033500             15  AT-GMM-PL-GR-MONTH        PIC S9(11)V99  COMP-3. 03401052
034900             15  AT-GMM-PL-PADJ-WK1        PIC S9(11)V99  COMP-3. 03410000
035000             15  AT-GMM-PL-PADJ-WK2        PIC S9(11)V99  COMP-3. 03420000
035100             15  AT-GMM-PL-PADJ-WK3        PIC S9(11)V99  COMP-3. 03430000
035200             15  AT-GMM-PL-PADJ-WK4        PIC S9(11)V99  COMP-3. 03440000
035300             15  AT-GMM-PL-PADJ-WK5        PIC S9(11)V99  COMP-3. 03450000
035400             15  AT-GMM-PL-PADJ-MTD        PIC S9(11)V99  COMP-3. 03460000
035500         10  AT-GMM-LY-PG2-TOTS.                                  03470000
035600             15  AT-GMM-LY-GR-WK1          PIC S9(11)V99  COMP-3. 03480000
035700             15  AT-GMM-LY-GR-WK2          PIC S9(11)V99  COMP-3. 03490000
035800             15  AT-GMM-LY-GR-WK3          PIC S9(11)V99  COMP-3. 03500000
035900             15  AT-GMM-LY-GR-WK4          PIC S9(11)V99  COMP-3. 03510000
036000             15  AT-GMM-LY-GR-WK5          PIC S9(11)V99  COMP-3. 03520000
036100             15  AT-GMM-LY-GR-MTD          PIC S9(11)V99  COMP-3. 03530000
033500             15  AT-GMM-LY-GR-MONTH        PIC S9(11)V99  COMP-3. 03531052
036200             15  AT-GMM-LY-PADJ-WK1        PIC S9(11)V99  COMP-3. 03540000
036300             15  AT-GMM-LY-PADJ-WK2        PIC S9(11)V99  COMP-3. 03550000
036400             15  AT-GMM-LY-PADJ-WK3        PIC S9(11)V99  COMP-3. 03560000
036500             15  AT-GMM-LY-PADJ-WK4        PIC S9(11)V99  COMP-3. 03570000
036600             15  AT-GMM-LY-PADJ-WK5        PIC S9(11)V99  COMP-3. 03580000
036700             15  AT-GMM-LY-PADJ-MTD        PIC S9(11)V99  COMP-3. 03590000
036800     05  AT-GMMS-PG3    OCCURS 99 TIMES INDEXED BY GMM-IDX3.      03600000
036900         10  AT-GMM-NBR-PG3                PIC X(02).             03610000
037000         10  AT-GMM-NAME-PG3               PIC X(18).             03620000
037100         10  AT-GMM-DESC-PG3               PIC X(15).             03630000
037200         10  AT-GMM-TY-PG3-TOTS.                                  03640000
037300             15  AT-GMM-TY-SLS-YTD         PIC S9(11)V99  COMP-3. 03650000
037300             15  AT-GMM-TY-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 03651063
037400             15  AT-GMM-TY-GM-YTD          PIC S9(11)V99  COMP-3. 03660000
037500             15  AT-GMM-TY-EOM-YTD         PIC S9(11)V99  COMP-3. 03670000
037600             15  AT-GMM-TY-INV-YTD         PIC S9(11)V99  COMP-3. 03680000
037700             15  AT-GMM-TY-MKDN-YTD        PIC S9(11)V99  COMP-3. 03690000
037900             15  AT-GMM-TY-PRCH-RTL-YTD    PIC S9(11)V99  COMP-3. 03700000
038000             15  AT-GMM-TY-PRCH-CST-YTD    PIC S9(11)V99  COMP-3. 03710000
038100*                                                                 03720000
038200         10  AT-GMM-FC-PG3-TOTS.                                  03730000
038300             15  AT-GMM-FC-SLS-YTD         PIC S9(11)V99  COMP-3. 03740000
037300             15  AT-GMM-FC-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 03741063
038400             15  AT-GMM-FC-GM-YTD          PIC S9(11)V99  COMP-3. 03750000
038500             15  AT-GMM-FC-EOM-YTD         PIC S9(11)V99  COMP-3. 03760000
038600             15  AT-GMM-FC-INV-YTD         PIC S9(11)V99  COMP-3. 03770000
038700             15  AT-GMM-FC-MKDN-YTD        PIC S9(11)V99  COMP-3. 03780000
038800         10  AT-GMM-PL-PG3-TOTS.                                  03790000
038900             15  AT-GMM-PL-SLS-YTD         PIC S9(11)V99  COMP-3. 03800000
037300             15  AT-GMM-PL-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 03801063
039000             15  AT-GMM-PL-GM-YTD          PIC S9(11)V99  COMP-3. 03810000
039100             15  AT-GMM-PL-EOM-YTD         PIC S9(11)V99  COMP-3. 03820000
039200             15  AT-GMM-PL-INV-YTD         PIC S9(11)V99  COMP-3. 03830000
039300             15  AT-GMM-PL-MKDN-YTD        PIC S9(11)V99  COMP-3. 03840000
039400         10  AT-GMM-LY-PG3-TOTS.                                  03850000
039500             15  AT-GMM-LY-SLS-YTD         PIC S9(11)V99  COMP-3. 03860000
037300             15  AT-GMM-LY-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 03861063
039600             15  AT-GMM-LY-GM-YTD          PIC S9(11)V99  COMP-3. 03870000
039700             15  AT-GMM-LY-EOM-YTD         PIC S9(11)V99  COMP-3. 03880000
039800             15  AT-GMM-LY-INV-YTD         PIC S9(11)V99  COMP-3. 03890000
039900             15  AT-GMM-LY-MKDN-YTD        PIC S9(11)V99  COMP-3. 03900000
040100             15  AT-GMM-LY-PRCH-RTL-YTD    PIC S9(11)V99  COMP-3. 03910000
040200             15  AT-GMM-LY-PRCH-CST-YTD    PIC S9(11)V99  COMP-3. 03920000
040300*                                                                 03930000
040400                                                                  03940000
040500******************************************************************03950000
040600* THIS TABLE CONTAINS DMM REPORT TOTALS FOR PAGE1 AND 2           03960000
040700******************************************************************03970000
040800 01  AT-DMMS-TABLE.                                               03980000
040900***  PAGE 1 REPORT TOTALS                                         03990000
041000     05  AT-DMMS-PG1    OCCURS 999 TIMES INDEXED BY DMM-IDX1.     04000000
041100         10  AT-DMM-GMM-NBR-PG1            PIC X(02).             04010000
041200         10  AT-DMM-NBR-PG1                PIC X(02).             04020000
041300         10  AT-DMM-NAME-PG1               PIC X(18).             04030000
041400         10  AT-DMM-DESC-PG1               PIC X(15).             04040000
041500         10  AT-DMM-TY-PG1-TOTS.                                  04050000
041600             15  AT-DMM-TY-SLS-WK1         PIC S9(11)V99  COMP-3. 04060000
041700             15  AT-DMM-TY-SLS-WK2         PIC S9(11)V99  COMP-3. 04070000
041800             15  AT-DMM-TY-SLS-WK3         PIC S9(11)V99  COMP-3. 04080000
041900             15  AT-DMM-TY-SLS-WK4         PIC S9(11)V99  COMP-3. 04090000
042000             15  AT-DMM-TY-SLS-WK5         PIC S9(11)V99  COMP-3. 04100000
042100             15  AT-DMM-TY-SLS-MTD         PIC S9(11)V99  COMP-3. 04110000
042200             15  AT-DMM-TY-SLS-MONTH       PIC S9(11)V99  COMP-3. 04120000
042300             15  AT-DMM-TY-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 04130062
042400             15  AT-DMM-TY-GM-MTD          PIC S9(11)V99  COMP-3. 04140000
042500             15  AT-DMM-TY-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 04150000
042600             15  AT-DMM-TY-INV-EOW         PIC S9(11)V99  COMP-3. 04160000
042700             15  AT-DMM-TY-MKDN-MTD        PIC S9(11)V99  COMP-3. 04170000
042800             15  AT-DMM-TY-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 04180000
042900             15  AT-DMM-TY-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 04190000
043000             15  AT-DMM-TY-PRCH-RTL        PIC S9(11)V99  COMP-3. 04200000
043100             15  AT-DMM-TY-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 04210000
043200         10  AT-DMM-FC-PG1-TOTS.                                  04220000
043300             15  AT-DMM-FC-SLS-WK1         PIC S9(11)V99  COMP-3. 04230000
043400             15  AT-DMM-FC-SLS-WK2         PIC S9(11)V99  COMP-3. 04240000
043500             15  AT-DMM-FC-SLS-WK3         PIC S9(11)V99  COMP-3. 04250000
043600             15  AT-DMM-FC-SLS-WK4         PIC S9(11)V99  COMP-3. 04260000
043700             15  AT-DMM-FC-SLS-WK5         PIC S9(11)V99  COMP-3. 04270000
043800             15  AT-DMM-FC-SLS-MTD         PIC S9(11)V99  COMP-3. 04280000
043900             15  AT-DMM-FC-SLS-MONTH       PIC S9(11)V99  COMP-3. 04290000
044000             15  AT-DMM-FC-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 04300062
044100             15  AT-DMM-FC-GM-MTD          PIC S9(11)V99  COMP-3. 04310000
044200             15  AT-DMM-FC-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 04320000
044300             15  AT-DMM-FC-INV-EOW         PIC S9(11)V99  COMP-3. 04330000
044400             15  AT-DMM-FC-MKDN-MTD        PIC S9(11)V99  COMP-3. 04340000
044500             15  AT-DMM-FC-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 04350000
044600             15  AT-DMM-FC-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 04360000
044700             15  AT-DMM-FC-PRCH-RTL        PIC S9(11)V99  COMP-3. 04370000
044800             15  AT-DMM-FC-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 04380000
044900         10  AT-DMM-PL-PG1-TOTS.                                  04390000
045000             15  AT-DMM-PL-SLS-WK1         PIC S9(11)V99  COMP-3. 04400000
045100             15  AT-DMM-PL-SLS-WK2         PIC S9(11)V99  COMP-3. 04410000
045200             15  AT-DMM-PL-SLS-WK3         PIC S9(11)V99  COMP-3. 04420000
045300             15  AT-DMM-PL-SLS-WK4         PIC S9(11)V99  COMP-3. 04430000
045400             15  AT-DMM-PL-SLS-WK5         PIC S9(11)V99  COMP-3. 04440000
045500             15  AT-DMM-PL-SLS-MTD         PIC S9(11)V99  COMP-3. 04450000
045600             15  AT-DMM-PL-SLS-MONTH       PIC S9(11)V99  COMP-3. 04460000
045700             15  AT-DMM-PL-COMP-SLS-MTD    PIC S9(11)V99  COMP-3. 04470062
045800             15  AT-DMM-PL-GM-MTD          PIC S9(11)V99  COMP-3. 04480000
045900             15  AT-DMM-PL-GM-MTD-PCT      PIC S9(03)V9   COMP-3. 04490000
046000             15  AT-DMM-PL-INV-EOW         PIC S9(11)V99  COMP-3. 04500000
046100             15  AT-DMM-PL-MKDN-MTD        PIC S9(11)V99  COMP-3. 04510000
046200             15  AT-DMM-PL-MKDN-MTD-PCT    PIC S9(03)V9   COMP-3. 04520000
046300             15  AT-DMM-PL-MKON-PRCH-PCT   PIC S9(03)V9   COMP-3. 04530000
046400             15  AT-DMM-PL-PRCH-RTL        PIC S9(11)V99  COMP-3. 04540000
046500             15  AT-DMM-PL-PRCH-NET-CST    PIC S9(11)V99  COMP-3. 04550000
046600         10  AT-DMM-PCT-VAR-LY-PG1-TOTS.                          04560000
046700             15  AT-DMM-PVLY-SLS-WK1       PIC S9(11)V99  COMP-3. 04570000
046800             15  AT-DMM-PVLY-SLS-WK2       PIC S9(11)V99  COMP-3. 04580000
046900             15  AT-DMM-PVLY-SLS-WK3       PIC S9(11)V99  COMP-3. 04590000
047000             15  AT-DMM-PVLY-SLS-WK4       PIC S9(11)V99  COMP-3. 04600000
047100             15  AT-DMM-PVLY-SLS-WK5       PIC S9(11)V99  COMP-3. 04610000
047200             15  AT-DMM-PVLY-SLS-MTD       PIC S9(11)V99  COMP-3. 04620000
047300             15  AT-DMM-PVLY-SLS-MONTH     PIC S9(11)V99  COMP-3. 04630000
047400             15  AT-DMM-PVLY-COMP-SLS-MTD  PIC S9(11)V99  COMP-3. 04640062
047500             15  AT-DMM-PVLY-GM-MTD        PIC S9(11)V99  COMP-3. 04650000
047600             15  AT-DMM-PVLY-GM-MTD-PCT    PIC S9(03)V9   COMP-3. 04660000
047700             15  AT-DMM-PVLY-INV-EOW       PIC S9(11)V99  COMP-3. 04670000
047800             15  AT-DMM-PVLY-MKDN-MTD      PIC S9(11)V99  COMP-3. 04680000
047900             15  AT-DMM-PVLY-MKDN-MTD-PCT  PIC S9(03)V9   COMP-3. 04690000
048000             15  AT-DMM-PVLY-MKON-PRCH-PCT PIC S9(03)V9  COMP-3.  04700000
048100             15  AT-DMM-PVLY-PRCH-RTL      PIC S9(11)V99  COMP-3. 04710000
048200             15  AT-DMM-PVLY-PRCH-NET-CST  PIC S9(11)V99  COMP-3. 04720000
048300***  PAGE 2 REPORT TOTALS                                         04730000
048400     05  AT-DMMS-PG2    OCCURS 999 TIMES INDEXED BY DMM-IDX2.     04740000
048500         10  AT-DMM-GMM-NBR-PG2            PIC X(02).             04750000
048600         10  AT-DMM-NBR-PG2                PIC X(02).             04760000
048700         10  AT-DMM-NAME-PG2               PIC X(18).             04770000
048800         10  AT-DMM-DESC-PG2               PIC X(15).             04780000
048900         10  AT-DMM-TY-PG2-TOTS.                                  04790000
049000             15  AT-DMM-TY-GR-WK1          PIC S9(11)V99  COMP-3. 04800000
049100             15  AT-DMM-TY-GR-WK2          PIC S9(11)V99  COMP-3. 04810000
049200             15  AT-DMM-TY-GR-WK3          PIC S9(11)V99  COMP-3. 04820000
049300             15  AT-DMM-TY-GR-WK4          PIC S9(11)V99  COMP-3. 04830000
049400             15  AT-DMM-TY-GR-WK5          PIC S9(11)V99  COMP-3. 04840000
049500             15  AT-DMM-TY-GR-MTD          PIC S9(11)V99  COMP-3. 04850000
049600             15  AT-DMM-TY-PADJ-WK1        PIC S9(11)V99  COMP-3. 04860000
049700             15  AT-DMM-TY-PADJ-WK2        PIC S9(11)V99  COMP-3. 04870000
049800             15  AT-DMM-TY-PADJ-WK3        PIC S9(11)V99  COMP-3. 04880000
049900             15  AT-DMM-TY-PADJ-WK4        PIC S9(11)V99  COMP-3. 04890000
050000             15  AT-DMM-TY-PADJ-WK5        PIC S9(11)V99  COMP-3. 04900000
050100             15  AT-DMM-TY-PADJ-MTD        PIC S9(11)V99  COMP-3. 04910000
050200         10  AT-DMM-FC-PG2-TOTS.                                  04920000
050300             15  AT-DMM-FC-GR-WK1          PIC S9(11)V99  COMP-3. 04930000
050400             15  AT-DMM-FC-GR-WK2          PIC S9(11)V99  COMP-3. 04940000
050500             15  AT-DMM-FC-GR-WK3          PIC S9(11)V99  COMP-3. 04950000
050600             15  AT-DMM-FC-GR-WK4          PIC S9(11)V99  COMP-3. 04960000
050700             15  AT-DMM-FC-GR-WK5          PIC S9(11)V99  COMP-3. 04970000
050800             15  AT-DMM-FC-GR-MTD          PIC S9(11)V99  COMP-3. 04980000
033500             15  AT-DMM-FC-GR-MONTH        PIC S9(11)V99  COMP-3. 04981053
050900             15  AT-DMM-FC-PADJ-WK1        PIC S9(11)V99  COMP-3. 04990000
051000             15  AT-DMM-FC-PADJ-WK2        PIC S9(11)V99  COMP-3. 05000000
051100             15  AT-DMM-FC-PADJ-WK3        PIC S9(11)V99  COMP-3. 05010000
051200             15  AT-DMM-FC-PADJ-WK4        PIC S9(11)V99  COMP-3. 05020000
051300             15  AT-DMM-FC-PADJ-WK5        PIC S9(11)V99  COMP-3. 05030000
051400             15  AT-DMM-FC-PADJ-MTD        PIC S9(11)V99  COMP-3. 05040000
051500         10  AT-DMM-PL-PG2-TOTS.                                  05050000
051600             15  AT-DMM-PL-GR-WK1          PIC S9(11)V99  COMP-3. 05060000
051700             15  AT-DMM-PL-GR-WK2          PIC S9(11)V99  COMP-3. 05070000
051800             15  AT-DMM-PL-GR-WK3          PIC S9(11)V99  COMP-3. 05080000
051900             15  AT-DMM-PL-GR-WK4          PIC S9(11)V99  COMP-3. 05090000
052000             15  AT-DMM-PL-GR-WK5          PIC S9(11)V99  COMP-3. 05100000
052100             15  AT-DMM-PL-GR-MTD          PIC S9(11)V99  COMP-3. 05110000
033500             15  AT-DMM-PL-GR-MONTH        PIC S9(11)V99  COMP-3. 05111054
052200             15  AT-DMM-PL-PADJ-WK1        PIC S9(11)V99  COMP-3. 05120000
052300             15  AT-DMM-PL-PADJ-WK2        PIC S9(11)V99  COMP-3. 05130000
052400             15  AT-DMM-PL-PADJ-WK3        PIC S9(11)V99  COMP-3. 05140000
052500             15  AT-DMM-PL-PADJ-WK4        PIC S9(11)V99  COMP-3. 05150000
052600             15  AT-DMM-PL-PADJ-WK5        PIC S9(11)V99  COMP-3. 05160000
052700             15  AT-DMM-PL-PADJ-MTD        PIC S9(11)V99  COMP-3. 05170000
052800         10  AT-DMM-LY-PG2-TOTS.                                  05180000
052900             15  AT-DMM-LY-GR-WK1          PIC S9(11)V99  COMP-3. 05190000
053000             15  AT-DMM-LY-GR-WK2          PIC S9(11)V99  COMP-3. 05200000
053100             15  AT-DMM-LY-GR-WK3          PIC S9(11)V99  COMP-3. 05210000
053200             15  AT-DMM-LY-GR-WK4          PIC S9(11)V99  COMP-3. 05220000
053300             15  AT-DMM-LY-GR-WK5          PIC S9(11)V99  COMP-3. 05230000
053400             15  AT-DMM-LY-GR-MTD          PIC S9(11)V99  COMP-3. 05240000
033500             15  AT-DMM-LY-GR-MONTH        PIC S9(11)V99  COMP-3. 05241054
053500             15  AT-DMM-LY-PADJ-WK1        PIC S9(11)V99  COMP-3. 05250000
053600             15  AT-DMM-LY-PADJ-WK2        PIC S9(11)V99  COMP-3. 05260000
053700             15  AT-DMM-LY-PADJ-WK3        PIC S9(11)V99  COMP-3. 05270000
053800             15  AT-DMM-LY-PADJ-WK4        PIC S9(11)V99  COMP-3. 05280000
053900             15  AT-DMM-LY-PADJ-WK5        PIC S9(11)V99  COMP-3. 05290000
054000             15  AT-DMM-LY-PADJ-MTD        PIC S9(11)V99  COMP-3. 05300000
054100***  PAGE 3 REPORT YTD TOTALS                                     05310000
054200     05  AT-DMMS-PG3    OCCURS 999 TIMES INDEXED BY DMM-IDX3.     05320000
054300         10  AT-DMM-GMM-NBR-PG3            PIC X(02).             05330000
054400         10  AT-DMM-NBR-PG3                PIC X(02).             05340000
054500         10  AT-DMM-NAME-PG3               PIC X(18).             05350000
054600         10  AT-DMM-DESC-PG3               PIC X(15).             05360000
054700         10  AT-DMM-TY-PG3-TOTS.                                  05370000
054800             15  AT-DMM-TY-SLS-YTD         PIC S9(11)V99  COMP-3. 05380000
054800             15  AT-DMM-TY-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 05381063
054900             15  AT-DMM-TY-GM-YTD          PIC S9(11)V99  COMP-3. 05390000
055000             15  AT-DMM-TY-EOM-YTD         PIC S9(11)V99  COMP-3. 05400000
055100             15  AT-DMM-TY-INV-YTD         PIC S9(11)V99  COMP-3. 05410000
055200             15  AT-DMM-TY-MKDN-YTD        PIC S9(11)V99  COMP-3. 05420000
055400             15  AT-DMM-TY-PRCH-RTL-YTD    PIC S9(11)V99  COMP-3. 05430000
055500             15  AT-DMM-TY-PRCH-CST-YTD    PIC S9(11)V99  COMP-3. 05440000
055600*                                                                 05450000
055700         10  AT-DMM-FC-PG3-TOTS.                                  05460000
055800             15  AT-DMM-FC-SLS-YTD         PIC S9(11)V99  COMP-3. 05470000
054800             15  AT-DMM-FC-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 05471063
055900             15  AT-DMM-FC-GM-YTD          PIC S9(11)V99  COMP-3. 05480000
056000             15  AT-DMM-FC-EOM-YTD         PIC S9(11)V99  COMP-3. 05490000
056100             15  AT-DMM-FC-INV-YTD         PIC S9(11)V99  COMP-3. 05500000
056200             15  AT-DMM-FC-MKDN-YTD        PIC S9(11)V99  COMP-3. 05510000
056300         10  AT-DMM-PL-PG3-TOTS.                                  05520000
056400             15  AT-DMM-PL-SLS-YTD         PIC S9(11)V99  COMP-3. 05530000
054800             15  AT-DMM-PL-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 05531063
056500             15  AT-DMM-PL-GM-YTD          PIC S9(11)V99  COMP-3. 05540000
056600             15  AT-DMM-PL-EOM-YTD         PIC S9(11)V99  COMP-3. 05550000
056700             15  AT-DMM-PL-INV-YTD         PIC S9(11)V99  COMP-3. 05560000
056800             15  AT-DMM-PL-MKDN-YTD        PIC S9(11)V99  COMP-3. 05570000
056900         10  AT-DMM-LY-PG3-TOTS.                                  05580000
057000             15  AT-DMM-LY-SLS-YTD         PIC S9(11)V99  COMP-3. 05590000
054800             15  AT-DMM-LY-COMP-SLS-YTD    PIC S9(11)V99  COMP-3. 05591063
057100             15  AT-DMM-LY-GM-YTD          PIC S9(11)V99  COMP-3. 05600000
057200             15  AT-DMM-LY-EOM-YTD         PIC S9(11)V99  COMP-3. 05610000
057300             15  AT-DMM-LY-INV-YTD         PIC S9(11)V99  COMP-3. 05620000
057400             15  AT-DMM-LY-MKDN-YTD        PIC S9(11)V99  COMP-3. 05630000
057600             15  AT-DMM-LY-PRCH-RTL-YTD    PIC S9(11)V99  COMP-3. 05640000
057700             15  AT-DMM-LY-PRCH-CST-YTD    PIC S9(11)V99  COMP-3. 05650000
057800*                                                                 05660000
057900******************************************************************05670000
058000* THIS TABLE CONTAINS COMPANY TOTALS FOR PAGE 1 AND 2             05680000
058100******************************************************************05690000
058200 01  AT-CMPY-TOTALS.                                              05700000
058300*    COMPANY TOTALS PAGE 1                                        05710000
058400     05  AT-CMPY-PG1-TOTS.                                        05720000
058500         10  AT-CMPY-TY-SLS-WK1            PIC S9(11)V99 COMP-3.  05730000
058600         10  AT-CMPY-TY-SLS-WK2            PIC S9(11)V99 COMP-3.  05740000
058700         10  AT-CMPY-TY-SLS-WK3            PIC S9(11)V99 COMP-3.  05750000
058800         10  AT-CMPY-TY-SLS-WK4            PIC S9(11)V99 COMP-3.  05760000
058900         10  AT-CMPY-TY-SLS-WK5            PIC S9(11)V99 COMP-3.  05770000
059000         10  AT-CMPY-TY-SLS-MTD            PIC S9(11)V99 COMP-3.  05780000
059100         10  AT-CMPY-TY-SLS-MONTH          PIC S9(11)V99 COMP-3.  05790000
059200         10  AT-CMPY-TY-COMP-SLS-MTD       PIC S9(11)V99 COMP-3.  05800062
059300         10  AT-CMPY-TY-GM-MTD             PIC S9(11)V99 COMP-3.  05810000
059400         10  AT-CMPY-TY-GM-MTD-PCT         PIC S9(03)V9 COMP-3.   05820000
059500         10  AT-CMPY-TY-INV-EOW            PIC S9(11)V99 COMP-3.  05830000
059600         10  AT-CMPY-TY-MKDN-MTD           PIC S9(11)V99 COMP-3.  05840000
059700         10  AT-CMPY-TY-MKDN-MTD-PCT       PIC S9(03)V9 COMP-3.   05850000
059800         10  AT-CMPY-TY-MKON-PRCH-PCT      PIC S9(03)V9 COMP-3.   05860000
059900         10  AT-CMPY-TY-PRCH-RTL           PIC S9(11)V99 COMP-3.  05870000
060000         10  AT-CMPY-TY-PRCH-NET-CST       PIC S9(11)V99 COMP-3.  05880000
060100     05  AT-CMPY-FC-PG1-TOTS.                                     05890000
060200         10  AT-CMPY-FC-SLS-WK1            PIC S9(11)V99 COMP-3.  05900000
060300         10  AT-CMPY-FC-SLS-WK2            PIC S9(11)V99 COMP-3.  05910000
060400         10  AT-CMPY-FC-SLS-WK3            PIC S9(11)V99 COMP-3.  05920000
060500         10  AT-CMPY-FC-SLS-WK4            PIC S9(11)V99 COMP-3.  05930000
060600         10  AT-CMPY-FC-SLS-WK5            PIC S9(11)V99 COMP-3.  05940000
060700         10  AT-CMPY-FC-SLS-MTD            PIC S9(11)V99 COMP-3.  05950000
060800         10  AT-CMPY-FC-SLS-MONTH          PIC S9(11)V99 COMP-3.  05960000
060900         10  AT-CMPY-FC-COMP-SLS-MTD       PIC S9(11)V99 COMP-3.  05970062
061000         10  AT-CMPY-FC-GM-MTD             PIC S9(11)V99 COMP-3.  05980000
061100         10  AT-CMPY-FC-GM-MTD-PCT         PIC S9(03)V9 COMP-3.   05990000
061200         10  AT-CMPY-FC-INV-EOW            PIC S9(11)V99 COMP-3.  06000000
061300         10  AT-CMPY-FC-MKDN-MTD           PIC S9(11)V99 COMP-3.  06010000
061400         10  AT-CMPY-FC-MKDN-MTD-PCT       PIC S9(03)V9 COMP-3.   06020000
061500         10  AT-CMPY-FC-MKON-PRCH-PCT      PIC S9(03)V9 COMP-3.   06030000
061600         10  AT-CMPY-FC-PRCH-RTL           PIC S9(11)V99 COMP-3.  06040000
061700         10  AT-CMPY-FC-PRCH-NET-CST       PIC S9(11)V99 COMP-3.  06050000
061800     05  AT-CMPY-PL-PG1-TOTS.                                     06060000
061900         10  AT-CMPY-PL-SLS-WK1            PIC S9(11)V99 COMP-3.  06070000
062000         10  AT-CMPY-PL-SLS-WK2            PIC S9(11)V99 COMP-3.  06080000
062100         10  AT-CMPY-PL-SLS-WK3            PIC S9(11)V99 COMP-3.  06090000
062200         10  AT-CMPY-PL-SLS-WK4            PIC S9(11)V99 COMP-3.  06100000
062300         10  AT-CMPY-PL-SLS-WK5            PIC S9(11)V99 COMP-3.  06110000
062400         10  AT-CMPY-PL-SLS-MTD            PIC S9(11)V99 COMP-3.  06120000
062500         10  AT-CMPY-PL-SLS-MONTH          PIC S9(11)V99 COMP-3.  06130000
062600         10  AT-CMPY-PL-COMP-SLS-MTD       PIC S9(11)V99 COMP-3.  06140062
062700         10  AT-CMPY-PL-GM-MTD             PIC S9(11)V99 COMP-3.  06150000
062800         10  AT-CMPY-PL-GM-MTD-PCT         PIC S9(03)V9 COMP-3.   06160000
062900         10  AT-CMPY-PL-INV-EOW            PIC S9(11)V99 COMP-3.  06170000
063000         10  AT-CMPY-PL-MKDN-MTD           PIC S9(11)V99 COMP-3.  06180000
063100         10  AT-CMPY-PL-MKDN-MTD-PCT       PIC S9(03)V9 COMP-3.   06190000
063200         10  AT-CMPY-PL-MKON-PRCH-PCT      PIC S9(03)V9 COMP-3.   06200000
063300         10  AT-CMPY-PL-PRCH-RTL           PIC S9(11)V99 COMP-3.  06210000
063400         10  AT-CMPY-PL-PRCH-NET-CST       PIC S9(11)V99 COMP-3.  06220000
063500     05  AT-CMPY-PCT-VAR-LY-PG1-TOTS.                             06230000
063600         10  AT-CMPY-PVLY-SLS-WK1          PIC S9(11)V99 COMP-3.  06240000
063700         10  AT-CMPY-PVLY-SLS-WK2          PIC S9(11)V99 COMP-3.  06250000
063800         10  AT-CMPY-PVLY-SLS-WK3          PIC S9(11)V99 COMP-3.  06260000
063900         10  AT-CMPY-PVLY-SLS-WK4          PIC S9(11)V99 COMP-3.  06270000
064000         10  AT-CMPY-PVLY-SLS-WK5          PIC S9(11)V99 COMP-3.  06280000
064100         10  AT-CMPY-PVLY-SLS-MTD          PIC S9(11)V99 COMP-3.  06290000
064200         10  AT-CMPY-PVLY-SLS-MONTH        PIC S9(11)V99 COMP-3.  06300000
064300         10  AT-CMPY-PVLY-COMP-SLS-MTD     PIC S9(11)V99 COMP-3.  06310062
064400         10  AT-CMPY-PVLY-GM-MTD           PIC S9(11)V99 COMP-3.  06320000
064500         10  AT-CMPY-PVLY-GM-MTD-PCT       PIC S9(03)V9 COMP-3.   06330000
064600         10  AT-CMPY-PVLY-INV-EOW          PIC S9(11)V99 COMP-3.  06340000
064700         10  AT-CMPY-PVLY-MKDN-MTD         PIC S9(11)V99 COMP-3.  06350000
064800         10  AT-CMPY-PVLY-MKDN-MTD-PCT     PIC S9(03)V9 COMP-3.   06360000
064900         10  AT-CMPY-PVLY-MKON-PRCH-PCT    PIC S9(03)V9 COMP-3.   06370000
065000         10  AT-CMPY-PVLY-PRCH-RTL         PIC S9(11)V99 COMP-3.  06380000
065100         10  AT-CMPY-PVLY-PRCH-NET-CST     PIC S9(11)V99 COMP-3.  06390000
065200*    COMPANY TOTALS PAGE 2                                        06400000
065300     05  AT-CMPY-TY-PG2-TOTS.                                     06410000
065400         10  AT-CMPY-TY-GR-WK1             PIC S9(11)V99 COMP-3.  06420000
065500         10  AT-CMPY-TY-GR-WK2             PIC S9(11)V99 COMP-3.  06430000
065600         10  AT-CMPY-TY-GR-WK3             PIC S9(11)V99 COMP-3.  06440000
065700         10  AT-CMPY-TY-GR-WK4             PIC S9(11)V99 COMP-3.  06450000
065800         10  AT-CMPY-TY-GR-WK5             PIC S9(11)V99 COMP-3.  06460000
065900         10  AT-CMPY-TY-GR-MTD             PIC S9(11)V99 COMP-3.  06470000
066000         10  AT-CMPY-TY-PADJ-WK1           PIC S9(11)V99 COMP-3.  06480000
066100         10  AT-CMPY-TY-PADJ-WK2           PIC S9(11)V99 COMP-3.  06490000
066200         10  AT-CMPY-TY-PADJ-WK3           PIC S9(11)V99 COMP-3.  06500000
066300         10  AT-CMPY-TY-PADJ-WK4           PIC S9(11)V99 COMP-3.  06510000
066400         10  AT-CMPY-TY-PADJ-WK5           PIC S9(11)V99 COMP-3.  06520000
066500         10  AT-CMPY-TY-PADJ-MTD           PIC S9(11)V99 COMP-3.  06530000
066600     05  AT-CMPY-FC-PG2-TOTS.                                     06540000
066700         10  AT-CMPY-FC-GR-WK1             PIC S9(11)V99 COMP-3.  06550000
066800         10  AT-CMPY-FC-GR-WK2             PIC S9(11)V99 COMP-3.  06560000
066900         10  AT-CMPY-FC-GR-WK3             PIC S9(11)V99 COMP-3.  06570000
067000         10  AT-CMPY-FC-GR-WK4             PIC S9(11)V99 COMP-3.  06580000
067100         10  AT-CMPY-FC-GR-WK5             PIC S9(11)V99 COMP-3.  06590000
067200         10  AT-CMPY-FC-GR-MTD             PIC S9(11)V99 COMP-3.  06600000
067200         10  AT-CMPY-FC-GR-MONTH           PIC S9(11)V99 COMP-3.  06601052
067300         10  AT-CMPY-FC-PADJ-WK1           PIC S9(11)V99 COMP-3.  06610000
067400         10  AT-CMPY-FC-PADJ-WK2           PIC S9(11)V99 COMP-3.  06620000
067500         10  AT-CMPY-FC-PADJ-WK3           PIC S9(11)V99 COMP-3.  06630000
067600         10  AT-CMPY-FC-PADJ-WK4           PIC S9(11)V99 COMP-3.  06640000
067700         10  AT-CMPY-FC-PADJ-WK5           PIC S9(11)V99 COMP-3.  06650000
067800         10  AT-CMPY-FC-PADJ-MTD           PIC S9(11)V99 COMP-3.  06660000
067900     05  AT-CMPY-PL-PG2-TOTS.                                     06670000
068000         10  AT-CMPY-PL-GR-WK1             PIC S9(11)V99 COMP-3.  06680000
068100         10  AT-CMPY-PL-GR-WK2             PIC S9(11)V99 COMP-3.  06690000
068200         10  AT-CMPY-PL-GR-WK3             PIC S9(11)V99 COMP-3.  06700000
068300         10  AT-CMPY-PL-GR-WK4             PIC S9(11)V99 COMP-3.  06710000
068400         10  AT-CMPY-PL-GR-WK5             PIC S9(11)V99 COMP-3.  06720000
068500         10  AT-CMPY-PL-GR-MTD             PIC S9(11)V99 COMP-3.  06730000
067200         10  AT-CMPY-PL-GR-MONTH           PIC S9(11)V99 COMP-3.  06731052
068600         10  AT-CMPY-PL-PADJ-WK1           PIC S9(11)V99 COMP-3.  06740000
068700         10  AT-CMPY-PL-PADJ-WK2           PIC S9(11)V99 COMP-3.  06750000
068800         10  AT-CMPY-PL-PADJ-WK3           PIC S9(11)V99 COMP-3.  06760000
068900         10  AT-CMPY-PL-PADJ-WK4           PIC S9(11)V99 COMP-3.  06770000
069000         10  AT-CMPY-PL-PADJ-WK5           PIC S9(11)V99 COMP-3.  06780000
069100         10  AT-CMPY-PL-PADJ-MTD           PIC S9(11)V99 COMP-3.  06790000
069200     05  AT-CMPY-LY-PG2-TOTS.                                     06800000
069300         10  AT-CMPY-LY-GR-WK1             PIC S9(11)V99 COMP-3.  06810000
069400         10  AT-CMPY-LY-GR-WK2             PIC S9(11)V99 COMP-3.  06820000
069500         10  AT-CMPY-LY-GR-WK3             PIC S9(11)V99 COMP-3.  06830000
069600         10  AT-CMPY-LY-GR-WK4             PIC S9(11)V99 COMP-3.  06840000
069700         10  AT-CMPY-LY-GR-WK5             PIC S9(11)V99 COMP-3.  06850000
069800         10  AT-CMPY-LY-GR-MTD             PIC S9(11)V99 COMP-3.  06860000
067200         10  AT-CMPY-LY-GR-MONTH           PIC S9(11)V99 COMP-3.  06861052
069900         10  AT-CMPY-LY-PADJ-WK1           PIC S9(11)V99 COMP-3.  06870000
070000         10  AT-CMPY-LY-PADJ-WK2           PIC S9(11)V99 COMP-3.  06880000
070100         10  AT-CMPY-LY-PADJ-WK3           PIC S9(11)V99 COMP-3.  06890000
070200         10  AT-CMPY-LY-PADJ-WK4           PIC S9(11)V99 COMP-3.  06900000
070300         10  AT-CMPY-LY-PADJ-WK5           PIC S9(11)V99 COMP-3.  06910000
070400         10  AT-CMPY-LY-PADJ-MTD           PIC S9(11)V99 COMP-3.  06920000
070500*    COMPANY TOTALS PAGE 3                                        06930000
070600     05  AT-CMPY-TY-PG3-TOTS.                                     06940000
070700         10  AT-CMPY-TY-SLS-YTD            PIC S9(11)V99 COMP-3.  06950000
070700         10  AT-CMPY-TY-COMP-SLS-YTD       PIC S9(11)V99 COMP-3.  06951062
070800         10  AT-CMPY-TY-GM-YTD             PIC S9(11)V99 COMP-3.  06960000
070900         10  AT-CMPY-TY-EOM-YTD            PIC S9(11)V99 COMP-3.  06970000
071000         10  AT-CMPY-TY-INV-YTD            PIC S9(11)V99 COMP-3.  06980000
071100         10  AT-CMPY-TY-MKDN-YTD           PIC S9(11)V99 COMP-3.  06990000
071300         10  AT-CMPY-TY-PRCH-RTL-YTD       PIC S9(11)V99  COMP-3. 07000000
071400         10  AT-CMPY-TY-PRCH-CST-YTD       PIC S9(11)V99  COMP-3. 07010000
071500*                                                                 07020000
071600     05  AT-CMPY-FC-PG3-TOTS.                                     07030000
071700         10  AT-CMPY-FC-SLS-YTD            PIC S9(11)V99 COMP-3.  07040000
070700         10  AT-CMPY-FC-COMP-SLS-YTD       PIC S9(11)V99 COMP-3.  07041062
071800         10  AT-CMPY-FC-GM-YTD             PIC S9(11)V99 COMP-3.  07050000
071900         10  AT-CMPY-FC-EOM-YTD            PIC S9(11)V99 COMP-3.  07060000
072000         10  AT-CMPY-FC-INV-YTD            PIC S9(11)V99 COMP-3.  07070000
072100         10  AT-CMPY-FC-MKDN-YTD           PIC S9(11)V99 COMP-3.  07080000
072200     05  AT-CMPY-PL-PG3-TOTS.                                     07090000
072300         10  AT-CMPY-PL-SLS-YTD            PIC S9(11)V99 COMP-3.  07100000
070700         10  AT-CMPY-PL-COMP-SLS-YTD       PIC S9(11)V99 COMP-3.  07101063
072400         10  AT-CMPY-PL-GM-YTD             PIC S9(11)V99 COMP-3.  07110000
072500         10  AT-CMPY-PL-EOM-YTD            PIC S9(11)V99 COMP-3.  07120000
072600         10  AT-CMPY-PL-INV-YTD            PIC S9(11)V99 COMP-3.  07130000
072700         10  AT-CMPY-PL-MKDN-YTD           PIC S9(11)V99 COMP-3.  07140000
072800     05  AT-CMPY-LY-PG3-TOTS.                                     07150000
072900         10  AT-CMPY-LY-SLS-YTD            PIC S9(11)V99 COMP-3.  07160000
070700         10  AT-CMPY-LY-COMP-SLS-YTD       PIC S9(11)V99 COMP-3.  07161062
073000         10  AT-CMPY-LY-GM-YTD             PIC S9(11)V99 COMP-3.  07170000
073100         10  AT-CMPY-LY-EOM-YTD            PIC S9(11)V99 COMP-3.  07180000
073200         10  AT-CMPY-LY-INV-YTD            PIC S9(11)V99 COMP-3.  07190000
073300         10  AT-CMPY-LY-MKDN-YTD           PIC S9(11)V99 COMP-3.  07200000
073500         10  AT-CMPY-LY-PRCH-RTL-YTD       PIC S9(11)V99  COMP-3. 07210000
073600         10  AT-CMPY-LY-PRCH-CST-YTD       PIC S9(11)V99  COMP-3. 07220000
073700*                                                                 07230000
073800                                                                  07240000
073900                                                                  07250000
074000******************************************************************07260000
074100* THIS TABLE CONTAINS YTD REPORT TOTALS                           07270000
074200******************************************************************07280000
074300*01  AT-YTD-TABLE.                                                07290000
074400                                                                  07300000
074500 01  MT-MONTH-NAME-TABLE.                                         07310000
074600     05  MT-FSCL-MN-NM-ENTRY          OCCURS 12.                  07320000
074700         10  MT-FSCL-MN-NM.                                       07330000
074800             15  MT-FSCL-MN-NM-ABBREV PIC  X(03)     VALUE SPACE. 07340000
074900             15  FILLER               PIC  X(06)     VALUE SPACE. 07350000
075000                                                                  07360000
075100 01  HN-HOLD-NUMBERS.                                             07370000
075200     05  HN-GMA-NBR                   PIC  X(02)     VALUE ZERO.  07380000
075300     05  HN-DMA-NBR                   PIC  X(02)     VALUE ZERO.  07390000
075400                                                                  07400000
075500 01  LC-LASER-CONTROL-SWITCHES.                                   07410000
075600     05  LC-LASER-CONTROL-FF.                                     07420000
075700         10  FILLER                   PIC S9(04)     COMP         07430000
075800                                                     VALUE -1.    07440000
075900     05  LC-LASER-CONTROL-FD.                                     07450000
076000         10  FILLER                   PIC S9(04)     COMP         07460000
076100                                                     VALUE -513.  07470000
076200         10  FILLER                   PIC  X(79)     VALUE SPACE. 07480000
076300                                                                  07490000
076400 01  TD-TODAYS-DATE.                                              07500000
076500     05  TD-YEAR                      PIC  9(02)     VALUE ZERO.  07510000
076600     05  TD-MONTH                     PIC  9(02)     VALUE ZERO.  07520000
076700     05  TD-DAY                       PIC  9(02)     VALUE ZERO.  07530000
076800                                                                  07540000
076900 01  TT-TODAYS-TIME.                                              07550000
077000     05  TT-HOUR                      PIC  9(02)     VALUE ZERO.  07560000
077100     05  TT-MINUTE                    PIC  9(02)     VALUE ZERO.  07570000
077200     05  FILLER                       PIC  9(04)     VALUE ZERO.  07580000
077300                                                                  07590000
077400******************************************************************07600000
077500* REPORT PAGE HEADING 2                                           07610000
077600******************************************************************07620000
077700 01  PH2-PAGE-HEADING-2.                                          07630000
077800     05  FILLER                       PIC X(72) VALUE SPACE.      07640078
078500     05  PH2-YTD-FOR-YTD-RPT          PIC X(03) VALUE SPACES.     07641048
077900     05  FILLER                       PIC X(24) VALUE             07651078
078000                                      ' MERCHANDISE STATISTICS '. 07660078
078300     05  FILLER                       PIC X(11) VALUE             07690000
078400                                                   'REPORT FOR '. 07700000
078500     05  PH2-FSCL-MN-NM               PIC X(09) VALUE SPACE.      07710000
078600     05  PH2-FSCL-YR-NBR              PIC X(04) VALUE SPACE.      07720000
078700     05  FILLER                       PIC X(06) VALUE ' WEEK '.   07730000
078800     05  PH2-WEEK-NBR                 PIC X(01) VALUE SPACE.      07740000
078900     05  FILLER                       PIC X(75) VALUE SPACE.      07750048
079000                                                                  07760000
079100******************************************************************07770000
079200* REPORT PAGE HEADING 3                                           07780000
079300******************************************************************07790000
079400 01  PH3-PAGE-HEADING-3.                                          07800000
079500     05  FILLER                       PIC X(88) VALUE SPACE.      07810000
079600     05  FILLER                       PIC X(20) VALUE             07820000
079700                                       '(IN THOUSANDS - $000'.    07830000
079800     05  FILLER                       PIC X(01) VALUE QUOTE.      07840000
079900     05  FILLER                       PIC X(02) VALUE 'S)'.       07850000
080000     05  FILLER                       PIC X(89) VALUE SPACE.      07860000
080100                                                                  07870000
080200******************************************************************07880000
080300* REPORT PAGE 1 COLUMN HEADINGS LINE 1                            07890000
080400******************************************************************07900000
080500 01  WH1-WKLY-PG1-HEADER-1A.                                      07910000
080600     05  FILLER                       PIC X(25) VALUE SPACES.     07920000
080700     05  FILLER                       PIC X(01) VALUE '<'.        07930000
080800     05  FILLER                       PIC X(41) VALUE ALL '-'.    07940000
080900     05  FILLER                       PIC X(13) VALUE             07950000
081000                                      ' TOTAL SALES '.            07960000
081100     05  FILLER                       PIC X(41) VALUE ALL '-'.    07970000
081200     05  FILLER                       PIC X(03) VALUE '>  '.      07980000
081300     05  FILLER                       PIC X(17) VALUE             07990000
081400                                      ' COMP SALES      '.        08000000
081500     05  FILLER                       PIC X(21) VALUE             08010000
081600                                      ' GROSS MARGIN       '.     08020000
081700     05  FILLER                       PIC X(14) VALUE             08030000
081800                                      ' INV          '.           08040000
081900     05  FILLER                       PIC X(12) VALUE             08050000
082000                                      '   MARKDOWN '.             08060000
082100     05  FILLER                       PIC X(11) VALUE             08070000
082200                                     '     MARKON'.               08080000
082300                                                                  08090000
082400******************************************************************08100000
082500* REPORT PAGE 1 COLUMN HEADINGS LINE 2                            08110000
082600******************************************************************08120000
082700 01  WH1-WKLY-PG1-HEADER-1B.                                      08130000
082800     05  FILLER                       PIC X(25) VALUE SPACES.     08140000
082900     05  FILLER                       PIC X(14) VALUE             08150000
083000                                      '     WK1      '.           08160000
083100     05  FILLER                       PIC X(14) VALUE             08170000
083200                                      '     WK2      '.           08180000
083300     05  FILLER                       PIC X(14) VALUE             08190000
083400                                      '     WK3      '.           08200000
083500     05  FILLER                       PIC X(14) VALUE             08210000
083600                                      '     WK4      '.           08220000
083700     05  FILLER                       PIC X(14) VALUE             08230000
083800                                      '     WK5      '.           08240000
083900     05  FILLER                       PIC X(14) VALUE             08250000
084000                                      '     MTD      '.           08260000
084100     05  FILLER                       PIC X(14) VALUE             08270000
084200                                      '  MONTH PL    '.           08280000
084300     05  FILLER                       PIC X(14) VALUE             08290000
084400                                      '     MTD      '.           08300000
084500     05  FILLER                       PIC X(14) VALUE             08310000
084600                                      '     MTD $    '.           08320000
084700     05  FILLER                       PIC X(05) VALUE             08330000
084800                                      'MTD %'.                    08340000
084900     05  FILLER                       PIC X(14) VALUE             08350000
085000                                      '       EOW    '.           08360000
085100     05  FILLER                       PIC X(14) VALUE             08370000
085200                                      '       MTD $  '.           08380000
085300     05  FILLER                       PIC X(07) VALUE             08390000
085400                                      '  MTD %'.                  08400000
085500     05  FILLER                       PIC X(07) VALUE             08410000
085600                                      '  PURCH'.                  08420000
085700                                                                  08430000
085800******************************************************************08440000
085900* REPORT PAGE 1 COLUMN HEADINGS UNDERLINE                         08450000
086000******************************************************************08460000
086100 01  UL1-UNDER-LINE-1.                                            08470000
086200     05  FILLER                       PIC X(25) VALUE SPACES.     08480000
086300     05  FILLER                       PIC X(13) VALUE ALL '-'.    08490000
086400     05  FILLER                       PIC X(01) VALUE SPACES.     08500000
086500     05  FILLER                       PIC X(13) VALUE ALL '-'.    08510000
086600     05  FILLER                       PIC X(01) VALUE SPACES.     08520000
086700     05  FILLER                       PIC X(13) VALUE ALL '-'.    08530000
086800     05  FILLER                       PIC X(01) VALUE SPACES.     08540000
086900     05  FILLER                       PIC X(13) VALUE ALL '-'.    08550000
087000     05  FILLER                       PIC X(01) VALUE SPACES.     08560000
087100     05  FILLER                       PIC X(13) VALUE ALL '-'.    08570000
087200     05  FILLER                       PIC X(01) VALUE SPACES.     08580000
087300     05  FILLER                       PIC X(13) VALUE ALL '-'.    08590000
087400     05  FILLER                       PIC X(01) VALUE SPACES.     08600000
087500     05  FILLER                       PIC X(13) VALUE ALL '-'.    08610000
087600     05  FILLER                       PIC X(01) VALUE SPACES.     08620000
087700     05  FILLER                       PIC X(13) VALUE ALL '-'.    08630000
087800     05  FILLER                       PIC X(01) VALUE SPACES.     08640000
087900     05  FILLER                       PIC X(13) VALUE ALL '-'.    08650000
088000     05  FILLER                       PIC X(01) VALUE SPACES.     08660000
088100     05  FILLER                       PIC X(06) VALUE ALL '-'.    08670000
088200     05  FILLER                       PIC X(01) VALUE SPACES.     08680000
088300     05  FILLER                       PIC X(13) VALUE ALL '-'.    08690000
088400     05  FILLER                       PIC X(01) VALUE SPACES.     08700000
088500     05  FILLER                       PIC X(13) VALUE ALL '-'.    08710000
088600     05  FILLER                       PIC X(01) VALUE SPACES.     08720000
088700     05  FILLER                       PIC X(06) VALUE ALL '-'.    08730000
088800     05  FILLER                       PIC X(01) VALUE SPACES.     08740000
088900     05  FILLER                       PIC X(06) VALUE ALL '-'.    08750000
089000                                                                  08760000
089100******************************************************************08770000
089200* REPORT PAGE 1 DETAIL LINE                                       08780000
089300******************************************************************08790000
089400 01  DWL1-DETAIL-WK-LINE-1.                                       08800000
089500     05  DWL1-HEADING                 PIC X(15) VALUE SPACES.     08810000
089600     05  FILLER                       PIC X(01) VALUE SPACES.     08820000
089700     05  DWL1-TOTAL-DESC              PIC X(08) VALUE SPACES.     08830000
089800     05  FILLER                       PIC X(01) VALUE SPACES.     08840000
089900     05  DWL1-SLS-WK1-AMT             PIC ZZ,ZZZ,ZZZ.Z-           08850000
090000                                                VALUE ZEROES.     08860000
090100     05  FILLER                       PIC X(01) VALUE SPACES.     08870000
090200     05  DWL1-SLS-WK2-AMT             PIC ZZ,ZZZ,ZZZ.Z-           08880000
090300                                                VALUE ZEROES.     08890000
090400     05  FILLER                       PIC X(01) VALUE SPACES.     08900000
090500     05  DWL1-SLS-WK3-AMT             PIC ZZ,ZZZ,ZZZ.Z-           08910000
090600                                                VALUE ZEROES.     08920000
090700     05  FILLER                       PIC X(01) VALUE SPACES.     08930000
090800     05  DWL1-SLS-WK4-AMT             PIC ZZ,ZZZ,ZZZ.Z-           08940000
090900                                                VALUE ZEROES.     08950000
091000     05  FILLER                       PIC X(01) VALUE SPACES.     08960000
091100     05  DWL1-SLS-WK5-AMT             PIC ZZ,ZZZ,ZZZ.Z-           08970000
091200                                                VALUE ZEROES.     08980000
091300     05  FILLER                       PIC X(01) VALUE SPACES.     08990000
091400     05  DWL1-SLS-MTD-AMT             PIC ZZ,ZZZ,ZZZ.Z-           09000000
091500                                                VALUE ZEROES.     09010000
091600     05  FILLER                       PIC X(01) VALUE SPACES.     09020000
091700     05  DWL1-SLS-MONTHLY             PIC ZZ,ZZZ,ZZZ.Z-           09030000
091800                                                VALUE ZEROES.     09040000
091900     05  FILLER                       PIC X(01) VALUE SPACES.     09050000
092000     05  DWL1-COMP-SLS-MTD-AMT        PIC ZZ,ZZZ,ZZZ.Z-           09060062
092100                                                VALUE ZEROES.     09070000
092200     05  FILLER                       PIC X(01) VALUE SPACES.     09080000
092300     05  DWL1-GM-MTD-AMT              PIC ZZ,ZZZ,ZZZ.Z-           09090000
092400                                                VALUE ZEROES.     09100000
092500     05  FILLER                       PIC X(01) VALUE SPACES.     09110000
092600     05  DWL1-GM-MTD-PCT              PIC ZZZ.Z-                  09120000
092700                                                VALUE ZEROES.     09130000
092800     05  FILLER                       PIC X(01) VALUE SPACES.     09140000
092900     05  DWL1-INV-EOW-AMT             PIC ZZ,ZZZ,ZZZ.Z-           09150000
093000                                                VALUE ZEROES.     09160000
093100     05  FILLER                       PIC X(01) VALUE SPACES.     09170000
093200     05  DWL1-MKDN-MTD-AMT            PIC ZZ,ZZZ,ZZZ.Z-           09180000
093300                                                VALUE ZEROES.     09190000
093400     05  FILLER                       PIC X(01) VALUE SPACES.     09200000
093500     05  DWL1-MKDN-MTD-PCT            PIC ZZZ.Z-                  09210000
093600                                                VALUE ZEROES.     09220000
093700     05  FILLER                       PIC X(01) VALUE SPACES.     09230000
093800     05  DWL1-MKON-PURCH-PCT          PIC ZZZ.Z-.                 09240000
093900                                                                  09250000
094000******************************************************************09260000
094100* REPORT PAGE 2 COLUMN HEADINGS LINE 1                            09270000
094200******************************************************************09280000
094300 01  WH2-WKLY-PG2-HEADER-1A.                                      09290000
094400     05  FILLER                       PIC X(25) VALUE SPACES.     09300000
094500     05  FILLER                       PIC X(01) VALUE '<'.        09310000
094600     05  FILLER                       PIC X(34) VALUE ALL '-'.    09320000
094700     05  FILLER                       PIC X(16) VALUE             09330000
094800                                      ' GROSS RECEIPTS '.         09340000
094900     05  FILLER                       PIC X(31) VALUE ALL '-'.    09350000
095000     05  FILLER                       PIC X(03) VALUE '> <'.      09360000
095100     05  FILLER                       PIC X(30) VALUE ALL '-'.    09370000
095200     05  FILLER                       PIC X(22) VALUE             09380000
095300                                      ' PURCHASE ADJUSTMENTS '.   09390000
095400     05  FILLER                       PIC X(29) VALUE ALL '-'.    09400000
095500     05  FILLER                       PIC X(01) VALUE '>'.        09410000
095600                                                                  09420000
095700******************************************************************09430000
095800* REPORT PAGE 2 COLUMN HEADINGS LINE 2                            09440000
095900******************************************************************09450000
096000 01  WH2-WKLY-PG2-HEADER-1B.                                      09460000
096100     05  FILLER                       PIC X(25) VALUE SPACES.     09470000
096200     05  FILLER                       PIC X(14) VALUE             09480000
096300                                      '     WK1      '.           09490000
096400     05  FILLER                       PIC X(14) VALUE             09500000
096500                                      '     WK2      '.           09510000
096600     05  FILLER                       PIC X(14) VALUE             09520000
096700                                      '     WK3      '.           09530000
096800     05  FILLER                       PIC X(14) VALUE             09540000
096900                                      '     WK4      '.           09550000
097000     05  FILLER                       PIC X(14) VALUE             09560000
097100                                      '     WK5      '.           09570000
097200     05  FILLER                       PIC X(14) VALUE             09580000
097300                                      '     MTD      '.           09590000
097400     05  FILLER                       PIC X(14) VALUE             09600000
097500                                      '     WK1      '.           09610000
097600     05  FILLER                       PIC X(14) VALUE             09620000
097700                                      '     WK2      '.           09630000
097800     05  FILLER                       PIC X(14) VALUE             09640000
097900                                      '     WK3      '.           09650000
098000     05  FILLER                       PIC X(14) VALUE             09660000
098100                                      '     WK4      '.           09670000
098200     05  FILLER                       PIC X(14) VALUE             09680000
098300                                      '     WK5      '.           09690000
098400     05  FILLER                       PIC X(14) VALUE             09700000
098500                                      '     MTD      '.           09710000
098600                                                                  09720000
098700******************************************************************09730000
098800* REPORT PAGE 1 COLUMN HEADINGS UNDERLINE                         09740000
098900******************************************************************09750000
099000 01  UL2-UNDER-LINE-1.                                            09760000
099100     05  FILLER                       PIC X(25) VALUE SPACES.     09770000
099200     05  FILLER                       PIC X(13) VALUE ALL '-'.    09780000
099300     05  FILLER                       PIC X(01) VALUE SPACES.     09790000
099400     05  FILLER                       PIC X(13) VALUE ALL '-'.    09800000
099500     05  FILLER                       PIC X(01) VALUE SPACES.     09810000
099600     05  FILLER                       PIC X(13) VALUE ALL '-'.    09820000
099700     05  FILLER                       PIC X(01) VALUE SPACES.     09830000
099800     05  FILLER                       PIC X(13) VALUE ALL '-'.    09840000
099900     05  FILLER                       PIC X(01) VALUE SPACES.     09850000
100000     05  FILLER                       PIC X(13) VALUE ALL '-'.    09860000
100100     05  FILLER                       PIC X(01) VALUE SPACES.     09870000
100200     05  FILLER                       PIC X(13) VALUE ALL '-'.    09880000
100300     05  FILLER                       PIC X(01) VALUE SPACES.     09890000
100400     05  FILLER                       PIC X(13) VALUE ALL '-'.    09900000
100500     05  FILLER                       PIC X(01) VALUE SPACES.     09910000
100600     05  FILLER                       PIC X(13) VALUE ALL '-'.    09920000
100700     05  FILLER                       PIC X(01) VALUE SPACES.     09930000
100800     05  FILLER                       PIC X(13) VALUE ALL '-'.    09940000
100900     05  FILLER                       PIC X(01) VALUE SPACES.     09950000
101000     05  FILLER                       PIC X(13) VALUE ALL '-'.    09960000
101100     05  FILLER                       PIC X(01) VALUE SPACES.     09970000
101200     05  FILLER                       PIC X(13) VALUE ALL '-'.    09980000
101300     05  FILLER                       PIC X(01) VALUE SPACES.     09990000
101400     05  FILLER                       PIC X(13) VALUE ALL '-'.    10000000
101500     05  FILLER                       PIC X(01) VALUE SPACES.     10010000
101600                                                                  10020000
101700******************************************************************10030000
101800* REPORT PAGE 2 DETAIL LINE                                       10040000
101900******************************************************************10050000
102000 01  DWL2-DETAIL-WK-LINE-1.                                       10060000
102100     05  DWL2-HEADING                 PIC X(15) VALUE SPACES.     10070000
102200     05  FILLER                       PIC X(01) VALUE SPACES.     10080000
102300     05  DWL2-TOTAL-DESC              PIC X(08) VALUE SPACES.     10090000
102400     05  FILLER                       PIC X(01) VALUE SPACES.     10100000
102500     05  DWL2-GR-WK1-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10110000
102600                                                VALUE ZEROES.     10120000
102700     05  FILLER                       PIC X(01) VALUE SPACES.     10130000
102800     05  DWL2-GR-WK2-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10140000
102900                                                VALUE ZEROES.     10150000
103000     05  FILLER                       PIC X(01) VALUE SPACES.     10160000
103100     05  DWL2-GR-WK3-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10170000
103200                                                VALUE ZEROES.     10180000
103300     05  FILLER                       PIC X(01) VALUE SPACES.     10190000
103400     05  DWL2-GR-WK4-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10200000
103500                                                VALUE ZEROES.     10210000
103600     05  FILLER                       PIC X(01) VALUE SPACES.     10220000
103700     05  DWL2-GR-WK5-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10230000
103800                                                VALUE ZEROES.     10240000
103900     05  FILLER                       PIC X(01) VALUE SPACES.     10250000
104000     05  DWL2-GR-MTD-AMT              PIC ZZ,ZZZ,ZZZ.Z-           10260000
104100                                                VALUE ZEROES.     10270000
104200     05  FILLER                       PIC X(01) VALUE SPACES.     10280000
104300     05  DWL2-PADJ-WK1-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10290000
104400                                                VALUE ZEROES.     10300000
104500     05  FILLER                       PIC X(01) VALUE SPACES.     10310000
104600     05  DWL2-PADJ-WK2-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10320000
104700                                                VALUE ZEROES.     10330000
104800     05  FILLER                       PIC X(01) VALUE SPACES.     10340000
104900     05  DWL2-PADJ-WK3-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10350000
105000                                                VALUE ZEROES.     10360000
105100     05  FILLER                       PIC X(01) VALUE SPACES.     10370000
105200     05  DWL2-PADJ-WK4-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10380000
105300                                                VALUE ZEROES.     10390000
105400     05  FILLER                       PIC X(01) VALUE SPACES.     10400000
105500     05  DWL2-PADJ-WK5-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10410000
105600                                                VALUE ZEROES.     10420000
105700     05  FILLER                       PIC X(01) VALUE SPACES.     10430000
105800     05  DWL2-PADJ-MTD-AMT            PIC ZZ,ZZZ,ZZZ.Z-           10440000
105900                                                VALUE ZEROES.     10450000
106000                                                                  10460000
106100******************************************************************10470000
106200* REPORT PAGE 3 YTD COLUMN HEADINGS LINE 1                        10480000
106300******************************************************************10490000
106400 01  YH3-YTD-PG3-HEADER-1A.                                       10500000
106500     05  FILLER                       PIC X(25) VALUE SPACES.     10510000
106600     05  FILLER                       PIC X(07) VALUE SPACES.     10520060
106700     05  FILLER                       PIC X(11) VALUE             10530000
106800                                      'TOTAL SALES'.              10540000
106600     05  FILLER                       PIC X(08) VALUE SPACES.     10541060
106700     05  FILLER                       PIC X(11) VALUE             10542058
106800                                      ' COMP SALES'.              10543058
106900     05  FILLER                       PIC X(16) VALUE SPACES.     10550060
107000     05  FILLER                       PIC X(12) VALUE             10560000
107100                                      'GROSS MARGIN'.             10570000
107200     05  FILLER                       PIC X(11) VALUE SPACES.     10580061
107300     05  FILLER                       PIC X(01) VALUE '<'.        10590000
107400     05  FILLER                       PIC X(14) VALUE ALL '-'.    10600000
107500     05  FILLER                       PIC X(11) VALUE             10610000
107600                                      ' INVENTORY '.              10620000
107700     05  FILLER                       PIC X(13) VALUE ALL '-'.    10630000
107800     05  FILLER                       PIC X(01) VALUE '>'.        10640000
107900     05  FILLER                       PIC X(07) VALUE SPACES.     10650000
108000     05  FILLER                       PIC X(06) VALUE             10660000
108100                                      'MARKON'.                   10670000
108200     05  FILLER                       PIC X(17) VALUE SPACES.     10680000
108300     05  FILLER                       PIC X(08) VALUE             10690000
108400                                      'MARKDOWN'.                 10700000
108500                                                                  10710000
108600******************************************************************10720000
108700* REPORT PAGE 3 YTD COLUMN HEADINGS LINE 2                        10730000
108800******************************************************************10740000
108900 01  YH3-YTD-PG3-HEADER-1B.                                       10750000
109000     05  FILLER                       PIC X(25) VALUE SPACES.     10760000
109100     05  FILLER                       PIC X(07) VALUE SPACES.     10770060
109200     05  FILLER                       PIC X(11) VALUE             10780000
109300                                      '    YTD    '.              10790000
109100     05  FILLER                       PIC X(09) VALUE SPACES.     10791060
109200     05  FILLER                       PIC X(11) VALUE             10792058
109300                                      '    YTD    '.              10793058
109400     05  FILLER                       PIC X(12) VALUE SPACES.     10800060
109500     05  FILLER                       PIC X(05) VALUE             10810000
109600                                      'YTD $'.                    10820000
109700     05  FILLER                       PIC X(08) VALUE SPACES.     10830000
109800     05  FILLER                       PIC X(05) VALUE             10840000
109900                                      'YTD %'.                    10850000
110000     05  FILLER                       PIC X(13) VALUE SPACES.     10860061
110100     05  FILLER                       PIC X(03) VALUE             10870000
110200                                      'EOM'.                      10880000
110300     05  FILLER                       PIC X(14) VALUE SPACES.     10890000
110400     05  FILLER                       PIC X(03) VALUE             10900000
110500                                      'AVG'.                      10910000
110600     05  FILLER                       PIC X(10) VALUE SPACES.     10920000
110700     05  FILLER                       PIC X(04) VALUE             10930000
110800                                      'TURN'.                     10940000
110900     05  FILLER                       PIC X(09) VALUE SPACES.     10950000
111000     05  FILLER                       PIC X(04) VALUE             10960000
111100                                      'CUMM'.                     10970000
111200     05  FILLER                       PIC X(12) VALUE SPACES.     10980000
111300     05  FILLER                       PIC X(05) VALUE             10990000
111400                                      'YTD $'.                    11000000
111500     05  FILLER                       PIC X(08) VALUE SPACES.     11010061
111600     05  FILLER                       PIC X(05) VALUE             11020000
111700                                      'YTD %'.                    11030000
111800                                                                  11040000
111900                                                                  11050000
112000******************************************************************11060000
112100* REPORT PAGE 3 YTD COLUMN HEADINGS UNDERLINE                     11070000
112200******************************************************************11080000
112300 01  UL3-UNDER-LINE-1.                                            11090000
112400     05  FILLER                       PIC X(31) VALUE SPACES.     11100000
112500     05  FILLER                       PIC X(13) VALUE ALL '-'.    11110000
112600     05  FILLER                       PIC X(07) VALUE SPACES.     11120000
112500     05  FILLER                       PIC X(13) VALUE ALL '-'.    11121058
112600     05  FILLER                       PIC X(07) VALUE SPACES.     11122058
112700     05  FILLER                       PIC X(13) VALUE ALL '-'.    11130000
112800     05  FILLER                       PIC X(04) VALUE SPACES.     11140000
112900     05  FILLER                       PIC X(06) VALUE ALL '-'.    11150000
113000     05  FILLER                       PIC X(07) VALUE SPACES.     11160000
113100     05  FILLER                       PIC X(13) VALUE ALL '-'.    11170000
113200     05  FILLER                       PIC X(04) VALUE SPACES.     11180000
113300     05  FILLER                       PIC X(13) VALUE ALL '-'.    11190000
113400     05  FILLER                       PIC X(04) VALUE SPACES.     11200000
113500     05  FILLER                       PIC X(06) VALUE ALL '-'.    11210000
113600     05  FILLER                       PIC X(07) VALUE SPACES.     11220000
113700     05  FILLER                       PIC X(06) VALUE ALL '-'.    11230000
113800     05  FILLER                       PIC X(07) VALUE SPACES.     11240000
113900     05  FILLER                       PIC X(13) VALUE ALL '-'.    11250000
114000     05  FILLER                       PIC X(04) VALUE SPACES.     11260000
114100     05  FILLER                       PIC X(06) VALUE ALL '-'.    11270000
114200                                                                  11280000
114300******************************************************************11290000
114400* REPORT PAGE 3 YTD DETAIL LINE                                   11300000
114500******************************************************************11310000
114600 01  DYL3-DETAIL-YTD-LINE-1.                                      11320000
114700     05  DYL3-HEADING                 PIC X(15) VALUE SPACES.     11330000
114800     05  FILLER                       PIC X(01) VALUE SPACES.     11340000
114900     05  DYL3-TOTAL-DESC              PIC X(08) VALUE SPACES.     11350000
115000     05  FILLER                       PIC X(07) VALUE SPACES.     11360000
115100     05  DYL3-SLS-YTD                 PIC ZZ,ZZZ,ZZZ.Z-           11370000
115200                                                VALUE ZEROS.      11380000
115000     05  FILLER                       PIC X(07) VALUE SPACES.     11380158
115100     05  DYL3-COMP-SLS-YTD            PIC ZZ,ZZZ,ZZZ.Z-           11380258
115200                                                VALUE ZEROS.      11380358
115000     05  FILLER                       PIC X(07) VALUE SPACES.     11381058
115400     05  DYL3-GM-YTD                  PIC ZZ,ZZZ,ZZZ.Z-           11400000
115500                                                VALUE ZEROS.      11410000
115600     05  FILLER                       PIC X(04) VALUE SPACES.     11420000
115700     05  DYL3-GM-PCT-YTD              PIC ZZZ.Z-                  11430000
115800                                                VALUE ZEROS.      11440000
115900     05  FILLER                       PIC X(07) VALUE SPACES.     11450000
116000     05  DYL3-INV-EOM-YTD             PIC ZZ,ZZZ,ZZZ.Z-           11460000
116100                                                VALUE ZEROS.      11470000
116200     05  FILLER                       PIC X(04) VALUE SPACES.     11480000
116300     05  DYL3-INV-AVG-YTD             PIC ZZ,ZZZ,ZZZ.Z-           11490000
116400                                                VALUE ZEROS.      11500000
116500     05  FILLER                       PIC X(03) VALUE SPACES.     11510000
116600     05  DYL3-INV-TURN-YTD            PIC ZZZ.ZZ-                 11520000
116700                                                VALUE ZEROS.      11530000
116800     05  FILLER                       PIC X(07) VALUE SPACES.     11540000
116900     05  DYL3-MKON-CUMM-YTD           PIC ZZZ.Z-                  11550000
117000                                                VALUE ZEROS.      11560000
117100     05  FILLER                       PIC X(07) VALUE SPACES.     11570000
117200     05  DYL3-MKDN-YTD                PIC ZZ,ZZZ,ZZZ.Z-           11580000
117300                                                VALUE ZEROS.      11590000
117400     05  FILLER                       PIC X(04) VALUE SPACES.     11600000
117500     05  DYL3-MKDN-PCT-YTD            PIC ZZZ.Z-                  11610000
117600                                                VALUE ZEROS.      11620000
114300******************************************************************11630148
114400* REPORT PAGE 3 YTD DETAIL LINE                                   11630248
114500******************************************************************11630348
114600 01  DYL2-DETAIL-SEPARATOR-LINE.                                  11630456
100600     05  FILLER                       PIC X(16)  VALUE SPACES.    11631056
100600     05  FILLER                       PIC X(184) VALUE ALL '= '.  11631156
                                                                        11632048
117800****************************************************************  11640000
117900* DATE ATTRIBUTE TABLE                                            11650000
118000****************************************************************  11660000
118100                                                                  11670000
118200     EXEC SQL                                                     11680000
118300         INCLUDE TDTATTR                                          11690000
118400     END-EXEC.                                                    11700000
118500                                                                  11710000
118600******************************************************************11720000
118700*  MERCHANDISE AREA TABLE (TMDSEAR)                               11730000
118800******************************************************************11740000
118900                                                                  11750000
119000     EXEC SQL                                                     11760000
119100         INCLUDE TMDSEAR                                          11770000
119200     END-EXEC.                                                    11780000
119300                                                                  11790000
119400******************************************************************11800000
119500*  APPLICATION AVAILABILITY TABLE (TAPLAVL)                       11810000
119600******************************************************************11820000
119700                                                                  11830000
119800     EXEC SQL                                                     11840000
119900         INCLUDE TAPLAVL                                          11850000
120000     END-EXEC.                                                    11860000
120100                                                                  11870000
120200******************************************************************11880000
120300*  RESPONSIBILITY AREA TABLE (TRSPBAR)                           *11890000
120400******************************************************************11900000
120500                                                                  11910000
120600     EXEC SQL                                                     11920000
120700         INCLUDE TRSPBAR                                          11930000
120800     END-EXEC.                                                    11940000
120900                                                                  11950000
121000                                                                  11960000
121100******************************************************************11970000
121200*    DB2 COMMUNICATION AREA                                       11980000
121300******************************************************************11990000
121400                                                                  12000000
121500     EXEC SQL                                                     12010000
121600         INCLUDE SQLCA                                            12020000
121700     END-EXEC.                                                    12030000
121800                                                                  12040000
121900****************************************************************  12050000
122000*  FISCAL MONTH NAME CURSOR                                       12060000
122100****************************************************************  12070000
122200                                                                  12080000
122300     EXEC SQL                                                     12090000
122400         DECLARE FSCL-MN-NM-CSR CURSOR FOR                        12100000
122500             SELECT DISTINCT                                      12110000
122600                  FSCL_MN_NBR                                     12120000
122700                 ,FSCL_MN_NM                                      12130000
122800             FROM                                                 12140000
122900                  TDTATTR                                         12150000
123000             WHERE KY_DTE BETWEEN :DTATTR-FSCL-YR-BEG-DTE         12160000
123100                              AND :DTATTR-FSCL-YR-END-DTE         12170000
W26603             WITH UR                                                      
123200     END-EXEC.                                                    12180000
123300                                                                  12190000
123400 LINKAGE SECTION.                                                 12200000
123500                                                                  12210000
123600 PROCEDURE DIVISION.                                              12220000
123700                                                                  12230000
123800******************************************************************12240000
123900* PROGRAM MAIN MODULE                                             12250000
124000******************************************************************12260000
124100 1000-MAIN-MODULE.                                                12270000
124200                                                                  12280000
124300     OPEN INPUT  LEDGER-EXTRACT-WK-FILE                           12290000
124400                 LEDGER-EXTRACT-MN-FILE                           12300000
124500                 LEDGER-EXTRACT-EOW-FILE                          12310000
124600                 LEDGER-EXTRACT-DATE-FILE.                        12320000
124700     OPEN OUTPUT WKLY-LEDGER-REPORT-FILE                          12330075
124700                 YTD-LEDGER-REPORT-FILE.                          12331075
124800                                                                  12340000
124900     PERFORM 1150-INIT.                                           12350000
125000                                                                  12360000
125100     PERFORM 7000-READ-LEDGER-EXTRACT-WK.                         12370000
125200     PERFORM 7050-READ-LEDGER-EXTRACT-MN.                         12380000
125300     PERFORM 7060-READ-LEDGER-EXTRACT-EOW.                        12390000
125400                                                                  12400000
125500     PERFORM 3000-FILL-GMM-HEADINGS.                              12410000
125600                                                                  12420000
125700     PERFORM 3010-FILL-DMM-HEADINGS.                              12430000
125800                                                                  12440000
125900     PERFORM 2000-PROCESS-EXTRACT                                 12450000
126000         UNTIL (PS-END-OF-LEDGER-EXTRACT-MN                       12460000
126100           AND  PS-END-OF-LEDGER-EXTRACT-WK).                     12470000
126200                                                                  12480000
126300     PERFORM 4000-CREATE-REPORTS.                                 12490000
126400                                                                  12500000
126500     CLOSE LEDGER-EXTRACT-WK-FILE                                 12510000
126600           LEDGER-EXTRACT-MN-FILE                                 12520000
126700           LEDGER-EXTRACT-EOW-FILE                                12530000
126800           LEDGER-EXTRACT-DATE-FILE                               12540000
126900           WKLY-LEDGER-REPORT-FILE                                12550075
126900           YTD-LEDGER-REPORT-FILE.                                12551075
127000                                                                  12560000
127100     STOP RUN.                                                    12570000
127200                                                                  12580000
127300******************************************************************12590000
127400* INITIALIZE FIELDS AND READ FIRST RECS                           12600000
127500******************************************************************12610000
127600 1150-INIT.                                                       12620000
127700                                                                  12630000
127800     PERFORM 7100-READ-LEDGER-EXTRACT-DATE.                       12640000
127900                                                                  12650000
128000     IF PS-END-OF-LEDGER-DATE-FILE                                12660000
128100         DISPLAY '** ABEND **'                                    12670000
128200         DISPLAY '** PROGRAM MLKRP215 **'                         12680000
128300         DISPLAY '** PARAGRAPH 1150-INIT'                         12690000
128400         DISPLAY '** LEDGER EXTRACT DATE FILE IS EMPTY.'          12700000
128500         MOVE +4003 TO PV-ABEND-CODE                              12710000
128600         PERFORM 9999-ABEND                                       12720000
128700     END-IF.                                                      12730000
128800                                                                  12740000
128900     MOVE ML114-EXTRACT-MN-NBR       TO SS-OPEN-MN.               12750000
129000     MOVE ML114-EXTRACT-DTE          TO DTATTR-KY-DTE.            12760000
129100                                                                  12770000
129200     PERFORM 8000-GET-DATE-ATTRIBUTES.                            12780000
129300                                                                  12790000
129400     MOVE DTATTR-FSCL-YR-NBR         TO PH2-FSCL-YR-NBR.          12800000
129500     MOVE DTATTR-FSCL-MN-NM          TO PH2-FSCL-MN-NM.           12810000
129600     MOVE DTATTR-WK-IN-MN-NBR        TO PH2-WEEK-NBR              12820000
129700                                        SS-OPEN-WK.               12830000
129800     MOVE TY-LAST-WK-IN-MN           TO PV-TY-LAST-WK-IN-MN       12840000
129900     MOVE LY-LAST-WK-IN-MN           TO PV-LY-LAST-WK-IN-MN       12850000
130000     MOVE DTATTR-FSCL-WK-NBR         TO SS-OPEN-FSCL-WK.          12860000
130100                                                                  12870000
130200*    TABLE THE MONTH NAMES OF THE MONTHS IN THE OPEN FISCAL YEAR  12880064
130500     PERFORM 8500-OPEN-FSCL-MN-NM-CSR.                            12910000
130700     PERFORM 8600-FETCH-FSCL-MN-NM-CSR.                           12930000
130900     PERFORM UNTIL PS-END-OF-FSCL-MN-NM-CSR                       12950000
131000         MOVE DTATTR-FSCL-MN-NBR TO SS-CURR-MN                    12960000
131100         MOVE DTATTR-FSCL-MN-NM  TO MT-FSCL-MN-NM (SS-CURR-MN)    12970000
131200         PERFORM 8600-FETCH-FSCL-MN-NM-CSR                        12980000
131300     END-PERFORM.                                                 12990000
131400                                                                  13000000
131500     PERFORM 8700-CLOSE-FSCL-MN-NM-CSR.                           13010000
131600                                                                  13020000
131700*    BUILD STANDARD REPORT HEADING.                               13030000
131800                                                                  13040000
131900     ACCEPT TD-TODAYS-DATE FROM DATE.                             13050000
132000     MOVE TD-YEAR    TO DP200O-RUN-YEAR.                          13060000
132100     MOVE TD-MONTH   TO DP200O-RUN-MONTH.                         13070000
132200     MOVE TD-DAY     TO DP200O-RUN-DAY.                           13080000
132300                                                                  13090000
132400     ACCEPT TT-TODAYS-TIME FROM TIME.                             13100000
132500     MOVE TT-HOUR    TO DP200O-RUN-HOUR.                          13110000
132600     MOVE TT-MINUTE  TO DP200O-RUN-MINUTE.                        13120000
132700                                                                  13130000
132800     MOVE 'MLKRP224' TO DP200O-PROGRAM-NAME.                      13140000
133000                                                                  13150000
133100*    INITIALIZE ACCUMULATION TABLES AND INDEXES                   13160000
133200     INITIALIZE      AT-GMMS-TABLE                                13170000
133300                     AT-DMMS-TABLE                                13180000
133400                     AT-CMPY-TOTALS.                              13190000
133500                                                                  13200000
133900     SET DMM-IDX1    TO 1.                                        13240000
134000     SET DMM-IDX2    TO 1.                                        13250000
134100     SET DMM-IDX3    TO 1.                                        13260000
133600     SET GMM-IDX1    TO 1.                                        13261064
133700     SET GMM-IDX2    TO 1.                                        13262064
133800     SET GMM-IDX3    TO 1.                                        13263064
134200                                                                  13270000
134300*    SET NUMBER OF INVENTORY MONTHS                               13280000
134400     COMPUTE PV-INV-MONTHS = SS-OPEN-FSCL-WK + 1.                 13290064
134500                                                                  13300000
134600                                                                  13310000
134700******************************************************************13320000
134800*    PROCESS ALL GMAS INPUTS RECORDS.  WHEN A NEW GMA IS          13330000
134900*    ENCOUNTERED, INCREASE GMM TABLE INDEXES                      13340000
135000*                                                                 13350000
135100*    THIS ALLOWS TABLE VALUES TO BE ACCUMULATED AT THE GMM LEVEL  13360000
135200*                                                                 13370000
135300******************************************************************13380000
135400 2000-PROCESS-EXTRACT.                                            13390000
135500                                                                  13400000
135600     MOVE ML122-GMA-NBR   TO HN-GMA-NBR.                          13410000
135700     MOVE HN-GMA-NBR      TO AT-GMM-NBR-PG1(GMM-IDX1)             13420000
135800                             AT-GMM-NBR-PG2(GMM-IDX2)             13430000
135900                             AT-GMM-NBR-PG3(GMM-IDX3).            13440000
136000                                                                  13450000
136100     PERFORM 2100-PROCESS-GMA                                     13460000
136200         UNTIL (ML122-GMA-NBR NOT = HN-GMA-NBR)                   13470000
136300            OR (PS-END-OF-LEDGER-EXTRACT-MN                       13480000
136400           AND  PS-END-OF-LEDGER-EXTRACT-WK).                     13490000
136500                                                                  13500000
136600     SET GMM-IDX1 UP BY 1.                                        13510000
136700     SET GMM-IDX2 UP BY 1.                                        13520000
136800     SET GMM-IDX3 UP BY 1.                                        13530000
136900     PERFORM 3000-FILL-GMM-HEADINGS.                              13540000
137000                                                                  13550000
137100******************************************************************13560000
137200*    PROCESS ALL DMAS.  WHEN A NEW DMA OR GMA IS                  13570000
137300*    ENCOUNTERED, INCREASE DMM TABLE INDEXES                      13580000
137400*                                                                 13590000
137500*    THIS ALLOWS TABLE VALUES TO BE ACCUMULATED AT THE DMM LEVEL  13600000
137600*                                                                 13610000
137700******************************************************************13620000
137800 2100-PROCESS-GMA.                                                13630000
137900                                                                  13640000
138000     MOVE ML122-DMA-NBR   TO HN-DMA-NBR.                          13650000
138100     MOVE HN-GMA-NBR      TO AT-DMM-GMM-NBR-PG1(DMM-IDX1)         13660000
138200                             AT-DMM-GMM-NBR-PG2(DMM-IDX2)         13670000
138300                             AT-DMM-GMM-NBR-PG3(DMM-IDX3).        13680000
138400     MOVE HN-DMA-NBR      TO AT-DMM-NBR-PG1(DMM-IDX1)             13690000
138500                             AT-DMM-NBR-PG2(DMM-IDX2)             13700000
138600                             AT-DMM-NBR-PG3(DMM-IDX3).            13710000
138700                                                                  13720000
138800     PERFORM 2200-PROCESS-DMA                                     13730000
138900         UNTIL (ML122-GMA-NBR NOT = HN-GMA-NBR)                   13740000
139000            OR (ML122-DMA-NBR NOT = HN-DMA-NBR)                   13750000
139100            OR (PS-END-OF-LEDGER-EXTRACT-MN                       13760000
139200           AND  PS-END-OF-LEDGER-EXTRACT-WK).                     13770000
139300                                                                  13780000
139400     IF (PS-END-OF-LEDGER-EXTRACT-MN AND                          13790000
139500         PS-END-OF-LEDGER-EXTRACT-WK)                             13800000
139600         NEXT SENTENCE                                            13810000
139700     ELSE                                                         13820000
139800        SET DMM-IDX1 UP BY 1                                      13830000
139900        SET DMM-IDX2 UP BY 1                                      13840000
140000        SET DMM-IDX3 UP BY 1                                      13850000
140100        PERFORM 3010-FILL-DMM-HEADINGS                            13860000
140200     END-IF.                                                      13870000
140300                                                                  13880000
140400                                                                  13890000
140500******************************************************************13900000
140600*  ACCUMULATE ALL THE REQUIRED REPORT VALUES FOR DMMS, GMM,       13910000
140700*  COMPANY AND YTD TOTALS UNTIL THE GMA OR OR DMA CHANGES         13920000
140800******************************************************************13930000
140900 2200-PROCESS-DMA.                                                13940000
141000                                                                  13950000
141100**********************************************                    13960000
141200****  LOAD INFORMATION FOR REPORT PAGE 1  ****                    13970000
141300**********************************************                    13980000
141400                                                                  13990000
141500***   ACTUAL SALES  ***                                           14000084
141600*     EACH WEEK SALES                                             14010000
141700      ADD ML122-TY-SLS-RTL-AMT         (1)                        14020000
141800          TO AT-DMM-TY-SLS-WK1         (DMM-IDX1)                 14030000
141900             AT-GMM-TY-SLS-WK1         (GMM-IDX1)                 14040000
142000             AT-CMPY-TY-SLS-WK1.                                  14050000
142100      ADD ML122-TY-SLS-RTL-AMT         (2)                        14060000
142200          TO AT-DMM-TY-SLS-WK2         (DMM-IDX1)                 14070000
142300             AT-GMM-TY-SLS-WK2         (GMM-IDX1)                 14080000
142400             AT-CMPY-TY-SLS-WK2.                                  14090000
142500      ADD ML122-TY-SLS-RTL-AMT         (3)                        14100000
142600          TO AT-DMM-TY-SLS-WK3         (DMM-IDX1)                 14110000
142700             AT-GMM-TY-SLS-WK3         (GMM-IDX1)                 14120000
142800             AT-CMPY-TY-SLS-WK3.                                  14130000
142900      ADD ML122-TY-SLS-RTL-AMT         (4)                        14140000
143000          TO AT-DMM-TY-SLS-WK4         (DMM-IDX1)                 14150000
143100             AT-GMM-TY-SLS-WK4         (GMM-IDX1)                 14160000
143200             AT-CMPY-TY-SLS-WK4.                                  14170000
143300      ADD ML122-TY-SLS-RTL-AMT         (5)                        14180000
143400          TO AT-DMM-TY-SLS-WK5         (DMM-IDX1)                 14190000
143500             AT-GMM-TY-SLS-WK5         (GMM-IDX1)                 14200000
143600             AT-CMPY-TY-SLS-WK5.                                  14210000
143700*     MTD SALES                                                   14220000
143800      ADD ML128-TY-SLS-RTL-AMT         (SS-OPEN-MN)               14230000
143900          TO AT-DMM-TY-SLS-MTD         (DMM-IDX1)                 14240000
144000             AT-GMM-TY-SLS-MTD         (GMM-IDX1)                 14250000
144100             AT-CMPY-TY-SLS-MTD.                                  14260000
144200*      MONTH SALES                                                14270000
144300       MOVE ZEROS                                                 14280000
144400          TO AT-DMM-TY-SLS-MONTH       (DMM-IDX1)                 14290000
144500             AT-GMM-TY-SLS-MONTH       (GMM-IDX1)                 14300000
144600             AT-CMPY-TY-SLS-MONTH.                                14310000
144700*      MTD COMP SALES                                             14320000
144800       ADD ML128-TY-COMP-SLS-RTL-AMT   (SS-OPEN-MN)               14330000
144900           TO AT-DMM-TY-COMP-SLS-MTD   (DMM-IDX1)                 14340062
145000              AT-GMM-TY-COMP-SLS-MTD   (GMM-IDX1)                 14350062
145100              AT-CMPY-TY-COMP-SLS-MTD.                            14360062
145200*      MTD GROSS MARGIN                                           14370000
145300       ADD ML128-TY-GRO-MRGN-AMT       (SS-OPEN-MN)               14380000
145400           TO AT-DMM-TY-GM-MTD         (DMM-IDX1)                 14390000
145500              AT-GMM-TY-GM-MTD         (GMM-IDX1)                 14400000
145600              AT-CMPY-TY-GM-MTD.                                  14410000
145700*      INV END OF WEEK                                            14420000
145800       ADD ML122-TY-END-INV-RTL-AMT    (SS-OPEN-WK)               14430000
145900           TO AT-DMM-TY-INV-EOW        (DMM-IDX1)                 14440000
146000              AT-GMM-TY-INV-EOW        (GMM-IDX1)                 14450000
146100              AT-CMPY-TY-INV-EOW.                                 14460000
146200*      MARKDOWN MTD                                               14470000
146300       ADD ML128-TY-MKDN-RTL-AMT       (SS-OPEN-MN)               14480000
146400           TO AT-DMM-TY-MKDN-MTD       (DMM-IDX1)                 14490000
146500              AT-GMM-TY-MKDN-MTD       (GMM-IDX1)                 14500000
146600              AT-CMPY-TY-MKDN-MTD.                                14510000
146800*      PURCHASE RETAIL                                            14520000
146900       COMPUTE PV-SALES-ACCUM =                                   14530000
147000             ML128-TY-RCPT-RTL-AMT     (SS-OPEN-MN)               14540000
147100           + ML128-TY-PADJ-RTL-AMT     (SS-OPEN-MN)               14550000
147200           + ML128-TY-MKUP-RTL-AMT     (SS-OPEN-MN)               14560000
147300           + ML128-TY-XFER-IN-RTL-AMT  (SS-OPEN-MN)               14570000
147400           - ML128-TY-XFER-OUT-RTL-AMT (SS-OPEN-MN).              14580000
147500       ADD PV-SALES-ACCUM                                         14590000
147600           TO AT-DMM-TY-PRCH-RTL       (DMM-IDX1)                 14600000
147700              AT-GMM-TY-PRCH-RTL       (GMM-IDX1)                 14610000
147800              AT-CMPY-TY-PRCH-RTL.                                14620000
147900*      PURCHASES COST                                             14630000
148000       COMPUTE PV-SALES-ACCUM =                                   14640000
148100             ML128-TY-RCPT-NET-COST-AMT(SS-OPEN-MN)               14650000
148200           + ML128-TY-PADJ-NET-COST-AMT(SS-OPEN-MN).              14660000
148300       ADD PV-SALES-ACCUM                                         14670000
148400           TO AT-DMM-TY-PRCH-NET-CST   (DMM-IDX1)                 14680000
148500              AT-GMM-TY-PRCH-NET-CST   (GMM-IDX1)                 14690000
148600              AT-CMPY-TY-PRCH-NET-CST.                            14700000
148700***    FORECAST SALES   ***                                       14710084
148800*      EACH WEEK SALES                                            14720000
148900       ADD ML122-FC-SLS-RTL-AMT        (1)                        14730000
149000           TO AT-DMM-FC-SLS-WK1        (DMM-IDX1)                 14740000
149100              AT-GMM-FC-SLS-WK1        (GMM-IDX1)                 14750000
149200              AT-CMPY-FC-SLS-WK1.                                 14760000
149300       ADD ML122-FC-SLS-RTL-AMT        (2)                        14770000
149400           TO AT-DMM-FC-SLS-WK2        (DMM-IDX1)                 14780000
149500              AT-GMM-FC-SLS-WK2        (GMM-IDX1)                 14790000
149600              AT-CMPY-FC-SLS-WK2.                                 14800000
149700       ADD ML122-FC-SLS-RTL-AMT        (3)                        14810000
149800           TO AT-DMM-FC-SLS-WK3        (DMM-IDX1)                 14820000
149900              AT-GMM-FC-SLS-WK3        (GMM-IDX1)                 14830000
150000              AT-CMPY-FC-SLS-WK3.                                 14840000
150100       ADD ML122-FC-SLS-RTL-AMT        (4)                        14850000
150200           TO AT-DMM-FC-SLS-WK4        (DMM-IDX1)                 14860000
150300              AT-GMM-FC-SLS-WK4        (GMM-IDX1)                 14870000
150400              AT-CMPY-FC-SLS-WK4.                                 14880000
150500       ADD ML122-FC-SLS-RTL-AMT        (5)                        14890000
150600           TO AT-DMM-FC-SLS-WK5        (DMM-IDX1)                 14900000
150700              AT-GMM-FC-SLS-WK5        (GMM-IDX1)                 14910000
150800              AT-CMPY-FC-SLS-WK5.                                 14920000
150900*      MTD SALES                                                  14930000
151000       PERFORM                                                    14940000
151100          VARYING PS-WK-IDX FROM 1 BY 1                           14950000
151200          UNTIL PS-WK-IDX > SS-OPEN-WK                            14960000
151300          ADD ML122-FC-SLS-RTL-AMT     (PS-WK-IDX)                14970000
151400              TO AT-DMM-FC-SLS-MTD     (DMM-IDX1)                 14980000
151500                 AT-GMM-FC-SLS-MTD     (GMM-IDX1)                 14990000
151600                 AT-CMPY-FC-SLS-MTD                               15000000
151700       END-PERFORM.                                               15010000
151800*      MONTH SALES                                                15020000
151900       ADD ML128-FC-SLS-RTL-AMT        (SS-OPEN-MN)               15030000
152000           TO AT-DMM-FC-SLS-MONTH      (DMM-IDX1)                 15040000
152100              AT-GMM-FC-SLS-MONTH      (GMM-IDX1)                 15050000
152200              AT-CMPY-FC-SLS-MONTH.                               15060000
152300*      MTD COMP SALES                                             15070000
152400       MOVE ZEROS                                                 15080000
152500           TO AT-DMM-FC-COMP-SLS-MTD   (DMM-IDX1)                 15090062
152600              AT-GMM-FC-COMP-SLS-MTD   (GMM-IDX1)                 15100062
152700              AT-CMPY-FC-COMP-SLS-MTD.                            15110062
152800*      MTD GROSS MARGIN                                           15120000
152900       ADD ML128-FC-GRO-MRGN-AMT       (SS-OPEN-MN)               15130000
153000           TO AT-DMM-FC-GM-MTD         (DMM-IDX1)                 15140000
153100              AT-GMM-FC-GM-MTD         (GMM-IDX1)                 15150000
153200              AT-CMPY-FC-GM-MTD.                                  15160000
153300*      INV END OF WEEK                                            15170000
153400       ADD ML128-FC-END-INV-RTL-AMT    (SS-OPEN-MN)               15180000
153500           TO AT-DMM-FC-INV-EOW        (DMM-IDX1)                 15190000
153600              AT-GMM-FC-INV-EOW        (GMM-IDX1)                 15200000
153700              AT-CMPY-FC-INV-EOW.                                 15210000
153800*      MARKDOWN MTD                                               15220000
153900       PERFORM                                                    15230000
154000         VARYING PS-WK-IDX FROM 1 BY 1                            15240000
154100         UNTIL PS-WK-IDX > SS-OPEN-WK                             15250000
154200         ADD ML122-FC-MKDN-RTL-AMT     (PS-WK-IDX)                15260000
154300               TO AT-DMM-FC-MKDN-MTD   (DMM-IDX1)                 15270000
154400                  AT-GMM-FC-MKDN-MTD   (GMM-IDX1)                 15280000
154500                  AT-CMPY-FC-MKDN-MTD                             15290000
154600       END-PERFORM.                                               15300000
154700                                                                  15310000
154800*      PURCHASE RETAIL                                            15320000
154900       COMPUTE PV-SALES-ACCUM =                                   15330000
155000             ML128-FC-RCPT-RTL-AMT     (SS-OPEN-MN)               15340000
155100           + ML128-FC-PADJ-RTL-AMT     (SS-OPEN-MN)               15350000
155500       ADD PV-SALES-ACCUM                                         15360000
155600           TO AT-DMM-FC-PRCH-RTL       (DMM-IDX1)                 15370000
155700              AT-GMM-FC-PRCH-RTL       (GMM-IDX1)                 15380000
155800              AT-CMPY-FC-PRCH-RTL.                                15390000
155900*      PURCHASES COST                                             15400000
156000       COMPUTE PV-SALES-ACCUM =                                   15410000
156100             ML128-FC-RCPT-NET-COST-AMT(SS-OPEN-MN)               15420000
156200           + ML128-FC-PADJ-NET-COST-AMT(SS-OPEN-MN).              15430000
156300       ADD PV-SALES-ACCUM                                         15440000
156400           TO AT-DMM-FC-PRCH-NET-CST    (DMM-IDX1)                15450000
156500              AT-GMM-FC-PRCH-NET-CST    (GMM-IDX1)                15460000
156600              AT-CMPY-FC-PRCH-NET-CST.                            15470000
156700                                                                  15480000
156800***    PLANNED SALES   ***                                        15490084
156900*      EACH WEEK SALES                                            15500000
157000       ADD ML122-PL-SLS-RTL-AMT        (1)                        15510000
157100           TO AT-DMM-PL-SLS-WK1        (DMM-IDX1)                 15520000
157200              AT-GMM-PL-SLS-WK1        (GMM-IDX1)                 15530000
157300              AT-CMPY-PL-SLS-WK1.                                 15540000
157400       ADD ML122-PL-SLS-RTL-AMT        (2)                        15550000
157500           TO AT-DMM-PL-SLS-WK2        (DMM-IDX1)                 15560000
157600              AT-GMM-PL-SLS-WK2        (GMM-IDX1)                 15570000
157700              AT-CMPY-PL-SLS-WK2.                                 15580000
157800       ADD ML122-PL-SLS-RTL-AMT        (3)                        15590000
157900           TO AT-DMM-PL-SLS-WK3        (DMM-IDX1)                 15600000
158000              AT-GMM-PL-SLS-WK3        (GMM-IDX1)                 15610000
158100              AT-CMPY-PL-SLS-WK3.                                 15620000
158200       ADD ML122-PL-SLS-RTL-AMT        (4)                        15630000
158300           TO AT-DMM-PL-SLS-WK4        (DMM-IDX1)                 15640000
158400              AT-GMM-PL-SLS-WK4        (GMM-IDX1)                 15650000
158500              AT-CMPY-PL-SLS-WK4.                                 15660000
158600       ADD ML122-PL-SLS-RTL-AMT        (5)                        15670000
158700           TO AT-DMM-PL-SLS-WK5        (DMM-IDX1)                 15680000
158800              AT-GMM-PL-SLS-WK5        (GMM-IDX1)                 15690000
158900              AT-CMPY-PL-SLS-WK5.                                 15700000
159000*      MTD SALES                                                  15710000
159100       PERFORM                                                    15720000
159200          VARYING PS-WK-IDX FROM 1 BY 1                           15730000
159300          UNTIL PS-WK-IDX > SS-OPEN-WK                            15740000
159400          ADD ML122-PL-SLS-RTL-AMT     (PS-WK-IDX)                15750000
159500              TO AT-DMM-PL-SLS-MTD     (DMM-IDX1)                 15760000
159600                 AT-GMM-PL-SLS-MTD     (GMM-IDX1)                 15770000
159700                 AT-CMPY-PL-SLS-MTD                               15780000
159800       END-PERFORM.                                               15790000
159900*      MONTH SALES                                                15800000
159100       PERFORM                                                    15810000
159200          VARYING PS-WK-IDX FROM 1 BY 1                           15820000
159300          UNTIL PS-WK-IDX > 5                                     15830000
159400          ADD ML122-PL-SLS-RTL-AMT     (PS-WK-IDX)                15840000
159500              TO AT-DMM-PL-SLS-MONTH   (DMM-IDX1)                 15850000
159600                 AT-GMM-PL-SLS-MONTH   (GMM-IDX1)                 15860000
159700                 AT-CMPY-PL-SLS-MONTH                             15870000
159800       END-PERFORM.                                               15880000
160400*      MTD COMP SALES                                             15890000
160500       ADD ML128-PL-COMP-SLS-RTL-AMT   (SS-OPEN-MN)               15900000
160600           TO AT-DMM-PL-COMP-SLS-MTD   (DMM-IDX1)                 15910062
160700              AT-GMM-PL-COMP-SLS-MTD   (GMM-IDX1)                 15920062
160800              AT-CMPY-PL-COMP-SLS-MTD.                            15930062
160900*     MTD GROSS MARGIN                                            15940000
161000      ADD ML128-PL-GRO-MRGN-AMT       (SS-OPEN-MN)                15950000
161100          TO AT-DMM-PL-GM-MTD         (DMM-IDX1)                  15960000
161200             AT-GMM-PL-GM-MTD         (GMM-IDX1)                  15970000
161300             AT-CMPY-PL-GM-MTD.                                   15980000
161400*     INV END OF WEEK                                             15990000
161500      ADD ML122-PL-END-INV-RTL-AMT    (SS-OPEN-WK)                16000000
161600          TO AT-DMM-PL-INV-EOW        (DMM-IDX1)                  16010000
161700             AT-GMM-PL-INV-EOW        (GMM-IDX1)                  16020000
161800             AT-CMPY-PL-INV-EOW.                                  16030000
161900*     MARKDOWN MTD                                                16040000
162000      PERFORM                                                     16050000
162100         VARYING PS-WK-IDX FROM 1 BY 1                            16060000
162200         UNTIL PS-WK-IDX > SS-OPEN-WK                             16070000
162300         ADD ML122-PL-MKDN-RTL-AMT    (PS-WK-IDX)                 16080000
162400             TO AT-DMM-PL-MKDN-MTD    (DMM-IDX1)                  16090000
162500                AT-GMM-PL-MKDN-MTD    (GMM-IDX1)                  16100000
162600                AT-CMPY-PL-MKDN-MTD                               16110000
162700      END-PERFORM.                                                16120000
162800*     PURCHASE RETAIL                                             16130000
162900      COMPUTE PV-SALES-ACCUM =                                    16140000
163000            ML128-PL-RCPT-RTL-AMT     (SS-OPEN-MN)                16150000
163100          + ML128-PL-PADJ-RTL-AMT     (SS-OPEN-MN).               16160000
163600      ADD PV-SALES-ACCUM                                          16170000
163700          TO AT-DMM-PL-PRCH-RTL       (DMM-IDX1)                  16180000
163800             AT-GMM-PL-PRCH-RTL       (GMM-IDX1)                  16190000
163900             AT-CMPY-PL-PRCH-RTL.                                 16200000
164000*     PURCHASES COST                                              16210000
164100      COMPUTE PV-SALES-ACCUM =                                    16220000
164200            ML128-PL-RCPT-NET-COST-AMT(SS-OPEN-MN)                16230000
164300          + ML128-PL-PADJ-NET-COST-AMT(SS-OPEN-MN).               16240000
164400      ADD PV-SALES-ACCUM                                          16250000
164500          TO AT-DMM-PL-PRCH-NET-CST    (DMM-IDX1)                 16260000
164600             AT-GMM-PL-PRCH-NET-CST    (GMM-IDX1)                 16270000
164700             AT-CMPY-PL-PRCH-NET-CST.                             16280000
164800*                                                                 16290000
164900***  LAST YEAR SALES VARIANCE PERCENT                             16300000
165000*    *** EACH WEEK SALES (ONLY ACCUM THRU OPEN WEEK)              16310000
165100     PERFORM VARYING PS-WK-IDX                                    16320000
165200        FROM 1 BY 1                                               16330000
165300        UNTIL PS-WK-IDX > 5                                       16340000
165400                                                                  16350000
165500         EVALUATE TRUE                                            16360000
165600           WHEN PS-WK-IDX = 1                                     16370000
165700               IF PS-WK-IDX > SS-OPEN-WK                          16380000
165800                  NEXT SENTENCE                                   16390000
165900               ELSE                                               16400000
166000                  ADD ML122-LY-SLS-RTL-AMT     (PS-WK-IDX)        16410000
166100                      TO AT-DMM-PVLY-SLS-WK1   (DMM-IDX1)         16420000
166200                         AT-GMM-PVLY-SLS-WK1   (GMM-IDX1)         16430000
166300                         AT-CMPY-PVLY-SLS-WK1                     16440000
166400                         AT-DMM-PVLY-SLS-MTD   (DMM-IDX1)         16450000
166500                         AT-GMM-PVLY-SLS-MTD   (GMM-IDX1)         16460000
166600                         AT-CMPY-PVLY-SLS-MTD                     16470000
166700               END-IF                                             16480000
166800           WHEN PS-WK-IDX = 2                                     16490000
166900               IF PS-WK-IDX > SS-OPEN-WK                          16500000
167000                  NEXT SENTENCE                                   16510000
167100               ELSE                                               16520000
167200                  ADD ML122-LY-SLS-RTL-AMT     (PS-WK-IDX)        16530000
167300                      TO AT-DMM-PVLY-SLS-WK2   (DMM-IDX1)         16540000
167400                         AT-GMM-PVLY-SLS-WK2   (GMM-IDX1)         16550000
167500                         AT-CMPY-PVLY-SLS-WK2                     16560000
167600                         AT-DMM-PVLY-SLS-MTD   (DMM-IDX1)         16570000
167700                         AT-GMM-PVLY-SLS-MTD   (GMM-IDX1)         16580000
167800                         AT-CMPY-PVLY-SLS-MTD                     16590000
167900               END-IF                                             16600000
168000           WHEN PS-WK-IDX = 3                                     16610000
168100               IF PS-WK-IDX > SS-OPEN-WK                          16620000
168200                  NEXT SENTENCE                                   16630000
168300               ELSE                                               16640000
168400                  ADD ML122-LY-SLS-RTL-AMT     (PS-WK-IDX)        16650000
168500                      TO AT-DMM-PVLY-SLS-WK3   (DMM-IDX1)         16660000
168600                         AT-GMM-PVLY-SLS-WK3   (GMM-IDX1)         16670000
168700                         AT-CMPY-PVLY-SLS-WK3                     16680000
168800                         AT-DMM-PVLY-SLS-MTD   (DMM-IDX1)         16690000
168900                         AT-GMM-PVLY-SLS-MTD   (GMM-IDX1)         16700000
169000                         AT-CMPY-PVLY-SLS-MTD                     16710000
169100               END-IF                                             16720000
169200           WHEN PS-WK-IDX = 4                                     16730000
169300               IF PS-WK-IDX > SS-OPEN-WK                          16740000
169400                  NEXT SENTENCE                                   16750000
169500               ELSE                                               16760000
169600                  ADD ML122-LY-SLS-RTL-AMT     (PS-WK-IDX)        16770000
169700                      TO AT-DMM-PVLY-SLS-WK4   (DMM-IDX1)         16780000
169800                         AT-GMM-PVLY-SLS-WK4   (GMM-IDX1)         16790000
169900                         AT-CMPY-PVLY-SLS-WK4                     16800000
170000                         AT-DMM-PVLY-SLS-MTD   (DMM-IDX1)         16810000
170100                         AT-GMM-PVLY-SLS-MTD   (GMM-IDX1)         16820000
170200                         AT-CMPY-PVLY-SLS-MTD                     16830000
170300               END-IF                                             16840000
170400           WHEN PS-WK-IDX = 5                                     16850000
170500               IF PS-WK-IDX > SS-OPEN-WK                          16860000
170600                  NEXT SENTENCE                                   16870000
170700               ELSE                                               16880000
170800                  ADD ML122-LY-SLS-RTL-AMT     (PS-WK-IDX)        16890000
170900                      TO AT-DMM-PVLY-SLS-WK5   (DMM-IDX1)         16900000
171000                         AT-GMM-PVLY-SLS-WK5   (GMM-IDX1)         16910000
171100                         AT-CMPY-PVLY-SLS-WK5                     16920000
171200                         AT-DMM-PVLY-SLS-MTD   (DMM-IDX1)         16930000
171300                         AT-GMM-PVLY-SLS-MTD   (GMM-IDX1)         16940000
171400                         AT-CMPY-PVLY-SLS-MTD                     16950000
171500               END-IF                                             16960000
171600           END-EVALUATE                                           16970000
171700      END-PERFORM.                                                16980000
171800                                                                  16990000
171900*     MONTHLY  SALES                                              17000000
172000      ADD ML128-LY-SLS-RTL-AMT          (SS-OPEN-MN)              17010000
172100          TO AT-DMM-PVLY-SLS-MONTH      (DMM-IDX1)                17020000
172200             AT-GMM-PVLY-SLS-MONTH      (GMM-IDX1)                17030000
172300             AT-CMPY-PVLY-SLS-MONTH.                              17040000
172400                                                                  17050000
172500*     INV END OF WEEK                                             17060000
172600      ADD ML122-LY-END-INV-RTL-AMT      (SS-OPEN-WK)              17070000
172700          TO AT-DMM-PVLY-INV-EOW        (DMM-IDX1)                17080000
172800             AT-GMM-PVLY-INV-EOW        (GMM-IDX1)                17090000
172900             AT-CMPY-PVLY-INV-EOW.                                17100000
173000                                                                  17110000
173100***   MTD ACCUMULATIONS  ***                                      17120084
173200      PERFORM                                                     17130000
173300        VARYING PS-WK-IDX FROM 1 BY 1                             17140000
173400        UNTIL PS-WK-IDX > SS-OPEN-WK                              17150000
173500*        MTD COMP SALES                                           17160000
173600         ADD ML122-LY-COMP-SLS-AMT      (PS-WK-IDX)               17170000
173700             TO AT-DMM-PVLY-COMP-SLS-MTD (DMM-IDX1)               17180062
173800                AT-GMM-PVLY-COMP-SLS-MTD (GMM-IDX1)               17190062
173900                AT-CMPY-PVLY-COMP-SLS-MTD                         17200062
174000*        MTD GROSS MARGIN                                         17210000
174100         ADD ML122-LY-GRO-MRGN-AMT      (PS-WK-IDX)               17220000
174200             TO AT-DMM-PVLY-GM-MTD      (DMM-IDX1)                17230000
174300                AT-GMM-PVLY-GM-MTD      (GMM-IDX1)                17240000
174400                AT-CMPY-PVLY-GM-MTD                               17250000
174500*        MTD MARKDOWN                                             17260000
174600         ADD ML122-LY-MKDN-RTL-AMT      (PS-WK-IDX)               17270000
174700             TO AT-DMM-PVLY-MKDN-MTD    (DMM-IDX1)                17280000
174800                AT-GMM-PVLY-MKDN-MTD    (GMM-IDX1)                17290000
174900                AT-CMPY-PVLY-MKDN-MTD                             17300000
175000*        PURCHASE RETAIL                                          17310000
175100         COMPUTE PV-SALES-ACCUM =                                 17320000
175200               ML122-LY-RCPT-RTL-AMT     (PS-WK-IDX)              17330000
175300             + ML122-LY-PADJ-RTL-AMT     (PS-WK-IDX)              17340000
175400             + ML122-LY-MKUP-RTL-AMT     (PS-WK-IDX)              17350000
175500             + ML122-LY-XFER-IN-RTL-AMT  (PS-WK-IDX)              17360000
175600             - ML122-LY-XFER-OUT-RTL-AMT (PS-WK-IDX)              17370000
175700         ADD PV-SALES-ACCUM                                       17380000
175800             TO AT-DMM-PVLY-PRCH-RTL     (DMM-IDX1)               17390000
175900                AT-GMM-PVLY-PRCH-RTL     (GMM-IDX1)               17400000
176000                AT-CMPY-PVLY-PRCH-RTL                             17410000
176100*        PURCHASES COST                                           17420000
176200         COMPUTE PV-SALES-ACCUM =                                 17430000
176300               ML122-LY-RCPT-NET-COST-AMT(PS-WK-IDX)              17440000
176400             + ML122-LY-PADJ-NET-COST-AMT(PS-WK-IDX)              17450000
176500         ADD PV-SALES-ACCUM                                       17460000
176600             TO AT-DMM-PVLY-PRCH-NET-CST (DMM-IDX1)               17470000
176700                AT-GMM-PVLY-PRCH-NET-CST (GMM-IDX1)               17480000
176800                AT-CMPY-PVLY-PRCH-NET-CST                         17490000
176900      END-PERFORM.                                                17500000
177000                                                                  17510000
177100*********************************************                     17520000
177200****  LOAD INFORMATION FOR REPORT PAGE 2 ****                     17530000
177300*********************************************                     17540000
177400*                                                                 17550000
177500***   ACTUALS  ***                                                17560084
177600*     EACH WEEK RECEIPTS AND MTD                                  17570000
177700      ADD ML122-TY-RCPT-RTL-AMT      (1)                          17580000
177800          TO AT-DMM-TY-GR-WK1        (DMM-IDX2)                   17590000
177900             AT-GMM-TY-GR-WK1        (GMM-IDX2)                   17600000
178000             AT-CMPY-TY-GR-WK1                                    17610000
178010             AT-DMM-TY-GR-MTD        (DMM-IDX2)                   17620000
178020             AT-GMM-TY-GR-MTD        (GMM-IDX2)                   17630000
178030             AT-CMPY-TY-GR-MTD.                                   17640000
178100      ADD ML122-TY-RCPT-RTL-AMT      (2)                          17650000
178200          TO AT-DMM-TY-GR-WK2        (DMM-IDX2)                   17660000
178300             AT-GMM-TY-GR-WK2        (GMM-IDX2)                   17670000
178400             AT-CMPY-TY-GR-WK2                                    17680000
178410             AT-DMM-TY-GR-MTD        (DMM-IDX2)                   17690000
178420             AT-GMM-TY-GR-MTD        (GMM-IDX2)                   17700000
178430             AT-CMPY-TY-GR-MTD.                                   17710000
178500      ADD ML122-TY-RCPT-RTL-AMT      (3)                          17720000
178600          TO AT-DMM-TY-GR-WK3        (DMM-IDX2)                   17730000
178700             AT-GMM-TY-GR-WK3        (GMM-IDX2)                   17740000
178800             AT-CMPY-TY-GR-WK3                                    17750000
178810             AT-DMM-TY-GR-MTD        (DMM-IDX2)                   17760000
178820             AT-GMM-TY-GR-MTD        (GMM-IDX2)                   17770000
178830             AT-CMPY-TY-GR-MTD.                                   17780000
178900      ADD ML122-TY-RCPT-RTL-AMT      (4)                          17790000
179000          TO AT-DMM-TY-GR-WK4        (DMM-IDX2)                   17800000
179100             AT-GMM-TY-GR-WK4        (GMM-IDX2)                   17810000
179200             AT-CMPY-TY-GR-WK4                                    17820000
179210             AT-DMM-TY-GR-MTD        (DMM-IDX2)                   17830000
179220             AT-GMM-TY-GR-MTD        (GMM-IDX2)                   17840000
179230             AT-CMPY-TY-GR-MTD.                                   17850000
179300      ADD ML122-TY-RCPT-RTL-AMT      (5)                          17860000
179400          TO AT-DMM-TY-GR-WK5        (DMM-IDX2)                   17870000
179500             AT-GMM-TY-GR-WK5        (GMM-IDX2)                   17880000
179600             AT-CMPY-TY-GR-WK5                                    17890000
179610             AT-DMM-TY-GR-MTD        (DMM-IDX2)                   17900000
179620             AT-GMM-TY-GR-MTD        (GMM-IDX2)                   17910000
179630             AT-CMPY-TY-GR-MTD.                                   17920000
179700                                                                  17930000
180400*     WEEKLY AND MTD PURCHASE ADJUSTMENTS                         17940000
180500      COMPUTE PV-SALES-ACCUM =                                    17950000
180600            ML122-TY-PADJ-RTL-AMT    (1)                          17960000
180700          + ML122-TY-MKUP-RTL-AMT    (1)                          17970000
180800          + ML122-TY-XFER-IN-RTL-AMT (1)                          17980000
180900          - ML122-TY-XFER-OUT-RTL-AMT(1).                         17990000
181000      ADD PV-SALES-ACCUM                                          18000000
181100          TO AT-DMM-TY-PADJ-WK1      (DMM-IDX2)                   18010000
181200             AT-GMM-TY-PADJ-WK1      (GMM-IDX2)                   18020000
181300             AT-CMPY-TY-PADJ-WK1                                  18030000
181310             AT-DMM-TY-PADJ-MTD     (DMM-IDX2)                    18040000
181320             AT-GMM-TY-PADJ-MTD     (GMM-IDX2)                    18050000
181330             AT-CMPY-TY-PADJ-MTD.                                 18060000
181400                                                                  18070000
181500      COMPUTE PV-SALES-ACCUM =                                    18080000
181600            ML122-TY-PADJ-RTL-AMT    (2)                          18090000
181700          + ML122-TY-MKUP-RTL-AMT    (2)                          18100000
181800          + ML122-TY-XFER-IN-RTL-AMT (2)                          18110000
181900          - ML122-TY-XFER-OUT-RTL-AMT(2).                         18120000
182000      ADD PV-SALES-ACCUM                                          18130000
182100          TO AT-DMM-TY-PADJ-WK2      (DMM-IDX2)                   18140000
182200             AT-GMM-TY-PADJ-WK2      (GMM-IDX2)                   18150000
182300             AT-CMPY-TY-PADJ-WK2                                  18160000
182310             AT-DMM-TY-PADJ-MTD     (DMM-IDX2)                    18170000
182320             AT-GMM-TY-PADJ-MTD     (GMM-IDX2)                    18180000
182330             AT-CMPY-TY-PADJ-MTD.                                 18190000
182400                                                                  18200000
182500      COMPUTE PV-SALES-ACCUM =                                    18210000
182600            ML122-TY-PADJ-RTL-AMT    (3)                          18220000
182700          + ML122-TY-MKUP-RTL-AMT    (3)                          18230000
182800          + ML122-TY-XFER-IN-RTL-AMT (3)                          18240000
182900          - ML122-TY-XFER-OUT-RTL-AMT(3).                         18250000
183000      ADD PV-SALES-ACCUM                                          18260000
183100          TO AT-DMM-TY-PADJ-WK3      (DMM-IDX2)                   18270000
183200             AT-GMM-TY-PADJ-WK3      (GMM-IDX2)                   18280000
183300             AT-CMPY-TY-PADJ-WK3                                  18290000
183310             AT-DMM-TY-PADJ-MTD     (DMM-IDX2)                    18300000
183320             AT-GMM-TY-PADJ-MTD     (GMM-IDX2)                    18310000
183330             AT-CMPY-TY-PADJ-MTD.                                 18320000
183400                                                                  18330000
183500      COMPUTE PV-SALES-ACCUM =                                    18340000
183600            ML122-TY-PADJ-RTL-AMT    (4)                          18350000
183700          + ML122-TY-MKUP-RTL-AMT    (4)                          18360000
183800          + ML122-TY-XFER-IN-RTL-AMT (4)                          18370000
183900          - ML122-TY-XFER-OUT-RTL-AMT(4).                         18380000
184000      ADD PV-SALES-ACCUM                                          18390000
184100          TO AT-DMM-TY-PADJ-WK4      (DMM-IDX2)                   18400000
184200             AT-GMM-TY-PADJ-WK4      (GMM-IDX2)                   18410000
184300             AT-CMPY-TY-PADJ-WK4                                  18420000
184310             AT-DMM-TY-PADJ-MTD     (DMM-IDX2)                    18430000
184320             AT-GMM-TY-PADJ-MTD     (GMM-IDX2)                    18431000
184330             AT-CMPY-TY-PADJ-MTD.                                 18432000
184400                                                                  18433000
184500      COMPUTE PV-SALES-ACCUM =                                    18434000
184600            ML122-TY-PADJ-RTL-AMT    (5)                          18435000
184700          + ML122-TY-MKUP-RTL-AMT    (5)                          18436000
184800          + ML122-TY-XFER-IN-RTL-AMT (5)                          18437000
184900          - ML122-TY-XFER-OUT-RTL-AMT(5).                         18438000
185000      ADD PV-SALES-ACCUM                                          18439000
185100          TO AT-DMM-TY-PADJ-WK5      (DMM-IDX2)                   18440000
185200             AT-GMM-TY-PADJ-WK5      (GMM-IDX2)                   18450000
185300             AT-CMPY-TY-PADJ-WK5                                  18460000
185301             AT-DMM-TY-PADJ-MTD     (DMM-IDX2)                    18470000
185302             AT-GMM-TY-PADJ-MTD     (GMM-IDX2)                    18480000
185303             AT-CMPY-TY-PADJ-MTD.                                 18490000
185310                                                                  18500000
186600***   FORECAST  ***                                               18510084
186700*     EACH WEEK AND MTD RECEIPTS                                  18520000
186800      ADD ML122-FC-TOT-ORD-RTL-AMT  (1)                           18530035
186900          TO AT-DMM-FC-GR-WK1       (DMM-IDX2)                    18540035
187000             AT-GMM-FC-GR-WK1       (GMM-IDX2)                    18550035
187100             AT-CMPY-FC-GR-WK1                                    18560052
187110             AT-DMM-FC-GR-MONTH     (DMM-IDX2)                    18570052
187120             AT-GMM-FC-GR-MONTH     (GMM-IDX2)                    18580052
187130             AT-CMPY-FC-GR-MONTH.                                 18590052
187200      ADD ML122-FC-TOT-ORD-RTL-AMT  (2)                           18600035
187300          TO AT-DMM-FC-GR-WK2       (DMM-IDX2)                    18610035
187400             AT-GMM-FC-GR-WK2       (GMM-IDX2)                    18620035
187500             AT-CMPY-FC-GR-WK2                                    18630052
187510             AT-DMM-FC-GR-MONTH     (DMM-IDX2)                    18640052
187520             AT-GMM-FC-GR-MONTH     (GMM-IDX2)                    18650052
187530             AT-CMPY-FC-GR-MONTH.                                 18660052
187600      ADD ML122-FC-TOT-ORD-RTL-AMT  (3)                           18670035
187700          TO AT-DMM-FC-GR-WK3       (DMM-IDX2)                    18680035
187800             AT-GMM-FC-GR-WK3       (GMM-IDX2)                    18690035
187900             AT-CMPY-FC-GR-WK3                                    18700052
187910             AT-DMM-FC-GR-MONTH     (DMM-IDX2)                    18710052
187920             AT-GMM-FC-GR-MONTH     (GMM-IDX2)                    18720052
187930             AT-CMPY-FC-GR-MONTH.                                 18730052
188000      ADD ML122-FC-TOT-ORD-RTL-AMT  (4)                           18740035
188100          TO AT-DMM-FC-GR-WK4       (DMM-IDX2)                    18750035
188200             AT-GMM-FC-GR-WK4       (GMM-IDX2)                    18760035
188300             AT-CMPY-FC-GR-WK4                                    18770052
187910             AT-DMM-FC-GR-MONTH     (DMM-IDX2)                    18771052
187920             AT-GMM-FC-GR-MONTH     (GMM-IDX2)                    18772052
187930             AT-CMPY-FC-GR-MONTH.                                 18773052
188400      ADD ML122-FC-TOT-ORD-RTL-AMT  (5)                           18810035
188500          TO AT-DMM-FC-GR-WK5       (DMM-IDX2)                    18820035
188600             AT-GMM-FC-GR-WK5       (GMM-IDX2)                    18830035
188700             AT-CMPY-FC-GR-WK5                                    18840052
187910             AT-DMM-FC-GR-MONTH     (DMM-IDX2)                    18841052
187920             AT-GMM-FC-GR-MONTH     (GMM-IDX2)                    18842052
187930             AT-CMPY-FC-GR-MONTH.                                 18843052
                                                                        18870135
161900*     FORECAST GROSS RECEIPTS MTD                                 18871047
162000      PERFORM                                                     18872035
162100         VARYING PS-WK-IDX FROM 1 BY 1                            18873035
162200         UNTIL PS-WK-IDX > SS-OPEN-WK                             18874035
162300         ADD ML122-FC-TOT-ORD-RTL-AMT(PS-WK-IDX)                  18875035
162400             TO AT-DMM-FC-GR-MTD     (DMM-IDX2)                   18876035
162500                AT-GMM-FC-GR-MTD     (GMM-IDX2)                   18877035
162600                AT-CMPY-FC-GR-MTD                                 18878035
162700      END-PERFORM.                                                18879035
188800                                                                  18880000
189400*     EACH WEEK PURCH ADJS (FCS CURRENTLY NOT AVAILABLE)          18890000
189500      MOVE ZEROS                                                  18900000
189600            TO AT-DMM-FC-PADJ-WK1    (DMM-IDX2)                   18910000
189700                AT-GMM-FC-PADJ-WK1   (GMM-IDX2)                   18920000
189800                AT-CMPY-FC-PADJ-WK1                               18930000
189900                AT-DMM-FC-PADJ-WK2   (DMM-IDX2)                   18940000
190000                AT-GMM-FC-PADJ-WK2   (GMM-IDX2)                   18950000
190100                AT-CMPY-FC-PADJ-WK2                               18960000
190200                AT-DMM-FC-PADJ-WK3   (DMM-IDX2)                   18970000
190300                AT-GMM-FC-PADJ-WK3   (GMM-IDX2)                   18980000
190400                AT-CMPY-FC-PADJ-WK3                               18990000
190500                AT-DMM-FC-PADJ-WK4   (DMM-IDX2)                   19000000
190600                AT-GMM-FC-PADJ-WK4   (GMM-IDX2)                   19010000
190700                AT-CMPY-FC-PADJ-WK4                               19020000
190800                AT-DMM-FC-PADJ-WK5   (DMM-IDX2)                   19030000
190900                AT-GMM-FC-PADJ-WK5   (GMM-IDX2)                   19040000
191000                AT-CMPY-FC-PADJ-WK5                               19050000
191100*               ADJ MTD                                           19060000
191200                AT-DMM-FC-PADJ-MTD   (DMM-IDX2)                   19070000
191300                AT-GMM-FC-PADJ-MTD   (GMM-IDX2)                   19080000
191400                AT-CMPY-FC-PADJ-MTD.                              19090000
191410                                                                  19100000
191500*********************************************************         19110000
191600*          WHEN AVAIL FCS FOR ADJ                                 19120084
191700*********************************************************         19130000
191800*          ADD ML122-FC-PADJ-RTL-AMT      (1)                     19140000
191900*              TO AT-DMM-FC-PADJ-WK1      (DMM-IDX1)              19150000
192000*                 AT-GMM-FC-PADJ-WK1      (GMM-IDX1)              19160000
192100*                 AT-CMPY-FC-PADJ-WK1                             19170000
192200*          ADD ML122-FC-PADJ-RTL-AMT      (2)                     19180000
192300*              TO AT-DMM-FC-PADJ-WK2      (DMM-IDX1)              19190000
192400*                 AT-GMM-FC-PADJ-WK2      (GMM-IDX1)              19200000
192500*                 AT-CMPY-FC-PADJ-WK2                             19210000
192600*          ADD ML122-FC-PADJ-RTL-AMT      (3)                     19220000
192700*              TO AT-DMM-FC-PADJ-WK3      (DMM-IDX1)              19230000
192800*                 AT-GMM-FC-PADJ-WK3      (GMM-IDX1)              19240000
192900*                 AT-CMPY-FC-PADJ-WK3                             19250000
193000*          ADD ML122-FC-PADJ-RTL-AMT      (4)                     19260000
193100*              TO AT-DMM-FC-PADJ-WK4      (DMM-IDX1)              19270000
193200*                 AT-GMM-FC-PADJ-WK4      (GMM-IDX1)              19280000
193300*                 AT-CMPY-FC-PADJ-WK4                             19290000
193400*          ADD ML122-FC-PADJ-RTL-AMT      (5)                     19300000
193500*              TO AT-DMM-FC-PADJ-WK5      (DMM-IDX1)              19310000
193600*                 AT-GMM-FC-PADJ-WK5      (GMM-IDX1)              19320000
193700*                 AT-CMPY-FC-PADJ-WK5                             19330000
194700                                                                  19340000
195000***   PLAN  ***                                                   19350084
195100*     EACH WEEK RECEIPTS                                          19360000
195200      ADD ML122-PL-RCPT-RTL-AMT      (1)                          19370000
195300          TO AT-DMM-PL-GR-WK1        (DMM-IDX2)                   19380000
195400             AT-GMM-PL-GR-WK1        (GMM-IDX2)                   19390000
195500             AT-CMPY-PL-GR-WK1                                    19400052
195510             AT-DMM-PL-GR-MONTH      (DMM-IDX2)                   19410052
195520             AT-GMM-PL-GR-MONTH      (GMM-IDX2)                   19420052
195530             AT-CMPY-PL-GR-MONTH.                                 19430052
195600      ADD ML122-PL-RCPT-RTL-AMT      (2)                          19440000
195700          TO AT-DMM-PL-GR-WK2        (DMM-IDX2)                   19450000
195800             AT-GMM-PL-GR-WK2        (GMM-IDX2)                   19460000
195900             AT-CMPY-PL-GR-WK2                                    19470052
195510             AT-DMM-PL-GR-MONTH      (DMM-IDX2)                   19471052
195520             AT-GMM-PL-GR-MONTH      (GMM-IDX2)                   19472052
195530             AT-CMPY-PL-GR-MONTH.                                 19473052
196000      ADD ML122-PL-RCPT-RTL-AMT      (3)                          19510000
196100          TO AT-DMM-PL-GR-WK3        (DMM-IDX2)                   19520000
196200             AT-GMM-PL-GR-WK3        (GMM-IDX2)                   19530000
196300             AT-CMPY-PL-GR-WK3                                    19540052
195510             AT-DMM-PL-GR-MONTH      (DMM-IDX2)                   19541052
195520             AT-GMM-PL-GR-MONTH      (GMM-IDX2)                   19542052
195530             AT-CMPY-PL-GR-MONTH.                                 19543052
196400      ADD ML122-PL-RCPT-RTL-AMT      (4)                          19580000
196500          TO AT-DMM-PL-GR-WK4        (DMM-IDX2)                   19590000
196600             AT-GMM-PL-GR-WK4        (GMM-IDX2)                   19600000
196700             AT-CMPY-PL-GR-WK4                                    19610052
195510             AT-DMM-PL-GR-MONTH      (DMM-IDX2)                   19611052
195520             AT-GMM-PL-GR-MONTH      (GMM-IDX2)                   19612052
195530             AT-CMPY-PL-GR-MONTH.                                 19613052
196800      ADD ML122-PL-RCPT-RTL-AMT      (5)                          19650000
196900          TO AT-DMM-PL-GR-WK5        (DMM-IDX2)                   19660000
197000             AT-GMM-PL-GR-WK5        (GMM-IDX2)                   19670000
197100             AT-CMPY-PL-GR-WK5                                    19680052
195510             AT-DMM-PL-GR-MONTH      (DMM-IDX2)                   19681052
195520             AT-GMM-PL-GR-MONTH      (GMM-IDX2)                   19682052
195530             AT-CMPY-PL-GR-MONTH.                                 19683052
                                                                        19710135
161900*     PLAN GROSS RECEIPTS MTD                                     19711047
162000      PERFORM                                                     19712035
162100         VARYING PS-WK-IDX FROM 1 BY 1                            19713035
162200         UNTIL PS-WK-IDX > SS-OPEN-WK                             19714035
162300         ADD ML122-PL-RCPT-RTL-AMT   (PS-WK-IDX)                  19715035
162400             TO AT-DMM-PL-GR-MTD     (DMM-IDX2)                   19716035
162500                AT-GMM-PL-GR-MTD     (GMM-IDX2)                   19717035
162600                AT-CMPY-PL-GR-MTD                                 19718035
162700      END-PERFORM.                                                19719035
                                                                        19720000
21517 *     WEEK PURCH ADJS                                                     
21517       ADD ML122-PL-PADJ-RTL-AMT      (1)                                  
21517           TO AT-DMM-PL-PADJ-WK1      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-WK1      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-WK1                                          
21517              AT-DMM-PL-PADJ-MTD      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-MTD      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-MTD.                                         
21517       ADD ML122-PL-PADJ-RTL-AMT      (2)                                  
21517           TO AT-DMM-PL-PADJ-WK2      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-WK2      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-WK2                                          
21517              AT-DMM-PL-PADJ-MTD      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-MTD      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-MTD.                                         
21517       ADD ML122-PL-PADJ-RTL-AMT      (3)                                  
21517           TO AT-DMM-PL-PADJ-WK3      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-WK3      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-WK3                                          
21517              AT-DMM-PL-PADJ-MTD      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-MTD      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-MTD.                                         
21517       ADD ML122-PL-PADJ-RTL-AMT      (4)                                  
21517           TO AT-DMM-PL-PADJ-WK4      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-WK4      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-WK4                                          
21517              AT-DMM-PL-PADJ-MTD      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-MTD      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-MTD.                                         
21517       ADD ML122-PL-PADJ-RTL-AMT      (5)                                  
21517           TO AT-DMM-PL-PADJ-WK5      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-WK5      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-WK5                                          
21517              AT-DMM-PL-PADJ-MTD      (DMM-IDX2)                           
21517              AT-GMM-PL-PADJ-MTD      (GMM-IDX2)                           
21517              AT-CMPY-PL-PADJ-MTD.                                         
200210                                                                  19980000
200300*     MTD PURCHASE ADJS                                           19990000
200400      ADD ML128-PL-PADJ-RTL-AMT    (SS-OPEN-MN)                   20000000
200500          TO AT-DMM-PL-PADJ-MTD    (DMM-IDX2)                     20010000
200600             AT-GMM-PL-PADJ-MTD    (GMM-IDX2)                     20020000
200700             AT-CMPY-PL-PADJ-MTD.                                 20030000
200800                                                                  20040000
201100***   LAST YEAR PLAN PCT FOR MONTH                                20050000
201200*     EACH WEEK RECEIPTS                                          20060000
201300      ADD ML122-LY-RCPT-RTL-AMT      (1)                          20070000
201400          TO AT-DMM-LY-GR-WK1        (DMM-IDX2)                   20080000
201500             AT-GMM-LY-GR-WK1        (GMM-IDX2)                   20090000
201600             AT-CMPY-LY-GR-WK1                                    20100000
201610             AT-DMM-LY-GR-MONTH      (DMM-IDX2)                   20110052
201620             AT-GMM-LY-GR-MONTH      (GMM-IDX2)                   20120052
201630             AT-CMPY-LY-GR-MONTH.                                 20130052
201700      ADD ML122-LY-RCPT-RTL-AMT      (2)                          20140000
201800          TO AT-DMM-LY-GR-WK2        (DMM-IDX2)                   20150000
201900             AT-GMM-LY-GR-WK2        (GMM-IDX2)                   20160000
202000             AT-CMPY-LY-GR-WK2                                    20170000
202010             AT-DMM-LY-GR-MONTH      (DMM-IDX2)                   20180052
202020             AT-GMM-LY-GR-MONTH      (GMM-IDX2)                   20190052
202030             AT-CMPY-LY-GR-MONTH.                                 20200052
202100      ADD ML122-LY-RCPT-RTL-AMT      (3)                          20210000
202200          TO AT-DMM-LY-GR-WK3        (DMM-IDX2)                   20220000
202300             AT-GMM-LY-GR-WK3        (GMM-IDX2)                   20230000
202400             AT-CMPY-LY-GR-WK3                                    20240000
202410             AT-DMM-LY-GR-MONTH      (DMM-IDX2)                   20241052
202420             AT-GMM-LY-GR-MONTH      (GMM-IDX2)                   20242052
202430             AT-CMPY-LY-GR-MONTH.                                 20243052
202500      ADD ML122-LY-RCPT-RTL-AMT      (4)                          20244000
202600          TO AT-DMM-LY-GR-WK4        (DMM-IDX2)                   20245000
202700             AT-GMM-LY-GR-WK4        (GMM-IDX2)                   20246000
202800             AT-CMPY-LY-GR-WK4                                    20247000
202810             AT-DMM-LY-GR-MONTH      (DMM-IDX2)                   20248052
202820             AT-GMM-LY-GR-MONTH      (GMM-IDX2)                   20249052
202830             AT-CMPY-LY-GR-MONTH.                                 20250052
202900      ADD ML122-LY-RCPT-RTL-AMT      (5)                          20260000
203000          TO AT-DMM-LY-GR-WK5        (DMM-IDX2)                   20270000
203100             AT-GMM-LY-GR-WK5        (GMM-IDX2)                   20280000
203200             AT-CMPY-LY-GR-WK5                                    20290000
203210             AT-DMM-LY-GR-MONTH      (DMM-IDX2)                   20300052
203220             AT-GMM-LY-GR-MONTH      (GMM-IDX2)                   20310052
203230             AT-CMPY-LY-GR-MONTH.                                 20320052
203300                                                                  20330000
161900*     LAST YEAR GROSS RECEIPTS MTD                                20331052
162000      PERFORM                                                     20332052
162100         VARYING PS-WK-IDX FROM 1 BY 1                            20333052
162200         UNTIL PS-WK-IDX > SS-OPEN-WK                             20334052
162300         ADD ML122-LY-RCPT-RTL-AMT   (PS-WK-IDX)                  20335052
162400             TO AT-DMM-LY-GR-MTD     (DMM-IDX2)                   20336052
162500                AT-GMM-LY-GR-MTD     (GMM-IDX2)                   20337052
162600                AT-CMPY-LY-GR-MTD                                 20338052
162700      END-PERFORM.                                                20339052
                                                                        20339152
204000*     EACH WEEK PURCH ADJS                                        20340000
204100      COMPUTE PV-SALES-ACCUM =                                    20350000
204200            ML122-LY-PADJ-RTL-AMT    (1)                          20360000
204300          + ML122-LY-MKUP-RTL-AMT    (1)                          20370000
204400          + ML122-LY-XFER-IN-RTL-AMT (1)                          20380000
204500          - ML122-LY-XFER-OUT-RTL-AMT(1).                         20390000
204600      ADD PV-SALES-ACCUM                                          20400000
204700          TO AT-DMM-LY-PADJ-WK1      (DMM-IDX2)                   20410000
204800             AT-GMM-LY-PADJ-WK1      (GMM-IDX2)                   20420000
204900             AT-CMPY-LY-PADJ-WK1                                  20430000
204910             AT-DMM-LY-PADJ-MTD      (DMM-IDX2)                   20440000
204920             AT-GMM-LY-PADJ-MTD      (GMM-IDX2)                   20450000
204930             AT-CMPY-LY-PADJ-MTD.                                 20460000
205000                                                                  20470000
205100      COMPUTE PV-SALES-ACCUM =                                    20480000
205200            ML122-LY-PADJ-RTL-AMT    (2)                          20490000
205300          + ML122-LY-MKUP-RTL-AMT    (2)                          20500000
205400          + ML122-LY-XFER-IN-RTL-AMT (2)                          20510000
205500          - ML122-LY-XFER-OUT-RTL-AMT(2).                         20520000
205600      ADD PV-SALES-ACCUM                                          20530000
205700          TO AT-DMM-LY-PADJ-WK2      (DMM-IDX2)                   20540000
205800             AT-GMM-LY-PADJ-WK2      (GMM-IDX2)                   20550000
205900             AT-CMPY-LY-PADJ-WK2                                  20560000
205910             AT-DMM-LY-PADJ-MTD      (DMM-IDX2)                   20570000
205920             AT-GMM-LY-PADJ-MTD      (GMM-IDX2)                   20580000
205930             AT-CMPY-LY-PADJ-MTD.                                 20590000
206000                                                                  20600000
206100      COMPUTE PV-SALES-ACCUM =                                    20610000
206200            ML122-LY-PADJ-RTL-AMT    (3)                          20620000
206300          + ML122-LY-MKUP-RTL-AMT    (3)                          20630000
206400          + ML122-LY-XFER-IN-RTL-AMT (3)                          20640000
206500          - ML122-LY-XFER-OUT-RTL-AMT(3).                         20650000
206600      ADD PV-SALES-ACCUM                                          20660000
206700          TO AT-DMM-LY-PADJ-WK3      (DMM-IDX2)                   20670000
206800             AT-GMM-LY-PADJ-WK3      (GMM-IDX2)                   20680000
206900             AT-CMPY-LY-PADJ-WK3                                  20690000
206910             AT-DMM-LY-PADJ-MTD      (DMM-IDX2)                   20691000
206920             AT-GMM-LY-PADJ-MTD      (GMM-IDX2)                   20692000
206930             AT-CMPY-LY-PADJ-MTD.                                 20693000
207000                                                                  20694000
207100      COMPUTE PV-SALES-ACCUM =                                    20695000
207200            ML122-LY-PADJ-RTL-AMT    (4)                          20696000
207300          + ML122-LY-MKUP-RTL-AMT    (4)                          20697000
207400          + ML122-LY-XFER-IN-RTL-AMT (4)                          20698000
207500          - ML122-LY-XFER-OUT-RTL-AMT(4).                         20699000
207600      ADD PV-SALES-ACCUM                                          20700000
207700          TO AT-DMM-LY-PADJ-WK4      (DMM-IDX2)                   20710000
207800             AT-GMM-LY-PADJ-WK4      (GMM-IDX2)                   20720000
207900             AT-CMPY-LY-PADJ-WK4                                  20730000
207910             AT-DMM-LY-PADJ-MTD      (DMM-IDX2)                   20740000
207920             AT-GMM-LY-PADJ-MTD      (GMM-IDX2)                   20750000
207930             AT-CMPY-LY-PADJ-MTD.                                 20760000
208000                                                                  20770000
208100      COMPUTE PV-SALES-ACCUM =                                    20780000
208200            ML122-LY-PADJ-RTL-AMT    (5)                          20790000
208300          + ML122-LY-MKUP-RTL-AMT    (5)                          20800000
208400          + ML122-LY-XFER-IN-RTL-AMT (5)                          20810000
208500          - ML122-LY-XFER-OUT-RTL-AMT(5).                         20820000
208600      ADD PV-SALES-ACCUM                                          20830000
208700          TO AT-DMM-LY-PADJ-WK5      (DMM-IDX2)                   20840000
208800             AT-GMM-LY-PADJ-WK5      (GMM-IDX2)                   20850000
208900             AT-CMPY-LY-PADJ-WK5                                  20860000
208901             AT-DMM-LY-PADJ-MTD      (DMM-IDX2)                   20870000
208902             AT-GMM-LY-PADJ-MTD      (GMM-IDX2)                   20880000
208903             AT-CMPY-LY-PADJ-MTD.                                 20890000
209000                                                                  20900000
210200************************************************                  20910000
210300****  LOAD INFORMATION FOR REPORT PAGE 3 YTD ***                  20920000
210400************************************************                  20930000
210500*                                                                 20940000
210600***   ACTUALS YTD ***                                             20950084
210700*                                                                 20960000
210800      PERFORM                                                     20970000
210900        VARYING PS-MN-IDX FROM 1 BY 1                             20980000
211000          UNTIL PS-MN-IDX > SS-OPEN-MN                            20990000
211100***       SALES YTD                                               21000000
211200          ADD ML128-TY-SLS-RTL-AMT   (PS-MN-IDX)                  21010000
211300              TO AT-DMM-TY-SLS-YTD   (DMM-IDX3)                   21020000
211400                 AT-GMM-TY-SLS-YTD   (GMM-IDX3)                   21030000
211500                 AT-CMPY-TY-SLS-YTD                               21040000
211100***       COMP SALES YTD                                          21041062
211200          ADD ML128-TY-COMP-SLS-RTL-AMT(PS-MN-IDX)                21042062
211300              TO AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3)                 21043062
211400                 AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3)                 21044062
211500                 AT-CMPY-TY-COMP-SLS-YTD                          21045062
211600***       LAST YEAR SALES YTD                                     21050000
211700          ADD ML128-LY-SLS-RTL-AMT   (PS-MN-IDX)                  21060000
211800              TO AT-DMM-LY-SLS-YTD   (DMM-IDX3)                   21070000
211900                 AT-GMM-LY-SLS-YTD   (GMM-IDX3)                   21080000
212000                 AT-CMPY-LY-SLS-YTD                               21090000
212100*         GROSS MARGIN YTD                                        21100000
212200          ADD ML128-TY-GRO-MRGN-AMT  (PS-MN-IDX)                  21110000
212300              TO AT-DMM-TY-GM-YTD    (DMM-IDX3)                   21120000
212400                 AT-GMM-TY-GM-YTD    (GMM-IDX3)                   21130000
212500                 AT-CMPY-TY-GM-YTD                                21140000
212600*         LAST YEAR GROSS MARGIN YTD                              21150000
212700          ADD ML128-LY-GRO-MRGN-AMT  (PS-MN-IDX)                  21160000
212800              TO AT-DMM-LY-GM-YTD    (DMM-IDX3)                   21170000
212900                 AT-GMM-LY-GM-YTD    (GMM-IDX3)                   21180000
213000                 AT-CMPY-LY-GM-YTD                                21190000
213100      END-PERFORM.                                                21200000
213200                                                                  21210000
213300*     EOM INVENTORY YTD                                           21220000
213400      ADD ML128-TY-END-INV-RTL-AMT(SS-OPEN-MN)                    21230000
213500          TO AT-DMM-TY-EOM-YTD    (DMM-IDX3)                      21240000
213600             AT-GMM-TY-EOM-YTD    (GMM-IDX3)                      21250000
213700             AT-CMPY-TY-EOM-YTD.                                  21260000
213900                                                                  21270000
214000*     INVENTORY TOTAL ACCUMULATED WEEKLY FOR INV AVG AND TURN     21280000
214100*     THIS YEAR, LAST YEAR AND PLANNING YTD                       21290000
214200      PERFORM                                                     21300000
214300        VARYING PS-WK-IDX FROM 1 BY 1                             21310000
214400          UNTIL PS-WK-IDX > SS-OPEN-FSCL-WK                       21320000
214500            IF PS-WK-IDX = 1                                      21330000
214600*              ADD BEG INV ONLY IF 1ST WEEK                       21340000
214700               ADD ML128-TY-BEG-INV-RTL-AMT                       21350000
214800                   TO AT-DMM-TY-INV-YTD    (DMM-IDX3)             21360000
214900                      AT-GMM-TY-INV-YTD    (GMM-IDX3)             21370000
215000                      AT-CMPY-TY-INV-YTD                          21380000
215100               ADD ML128-LY-BEG-INV-RTL-AMT                       21390000
215200                   TO AT-DMM-LY-INV-YTD    (DMM-IDX3)             21400000
215300                      AT-GMM-LY-INV-YTD    (GMM-IDX3)             21410000
215400                      AT-CMPY-LY-INV-YTD                          21420000
215500               ADD ML128-PL-BEG-INV-RTL-AMT(PS-WK-IDX)            21430000
215600                   TO AT-DMM-PL-INV-YTD    (DMM-IDX3)             21440000
215700                      AT-GMM-PL-INV-YTD    (GMM-IDX3)             21450000
215800                      AT-CMPY-PL-INV-YTD                          21460000
215900            END-IF                                                21470000
216000            ADD ML140-TY-END-INV-RTL-AMT(PS-WK-IDX)               21480000
216100                TO AT-DMM-TY-INV-YTD    (DMM-IDX3)                21490000
216200                   AT-GMM-TY-INV-YTD    (GMM-IDX3)                21500000
216300                   AT-CMPY-TY-INV-YTD                             21510000
216400            ADD ML140-LY-END-INV-RTL-AMT(PS-WK-IDX)               21520000
216500                TO AT-DMM-LY-INV-YTD    (DMM-IDX3)                21530000
216600                   AT-GMM-LY-INV-YTD    (GMM-IDX3)                21540000
216700                   AT-CMPY-LY-INV-YTD                             21550000
216800            ADD ML140-PL-END-INV-RTL-AMT(PS-WK-IDX)               21560000
216900                TO AT-DMM-PL-INV-YTD    (DMM-IDX3)                21570000
217000                   AT-GMM-PL-INV-YTD    (GMM-IDX3)                21580000
217100                   AT-CMPY-PL-INV-YTD                             21590000
217200      END-PERFORM.                                                21600000
217300                                                                  21610000
217400*     LAST YEAR EOM INVENTORY YTD                                 21620000
217500      ADD ML128-LY-END-INV-RTL-AMT(SS-OPEN-MN)                    21630000
217600          TO AT-DMM-LY-EOM-YTD   (DMM-IDX3)                       21640000
217700             AT-GMM-LY-EOM-YTD   (GMM-IDX3)                       21650000
217800             AT-CMPY-LY-EOM-YTD.                                  21660000
217900                                                                  21670000
218000      PERFORM                                                     21680000
218100        VARYING PS-MN-IDX FROM 1 BY 1                             21690000
218200          UNTIL PS-MN-IDX > SS-OPEN-MN                            21700000
218300*           THIS YEAR MARKDOWN YTD                                21710000
218400            ADD ML128-TY-MKDN-RTL-AMT   (PS-MN-IDX)               21720000
218500                TO AT-DMM-TY-MKDN-YTD   (DMM-IDX3)                21730000
218600                   AT-GMM-TY-MKDN-YTD   (GMM-IDX3)                21740000
218700                   AT-CMPY-TY-MKDN-YTD                            21750000
218800*           LAST YEAR MARKDOWN YTD                                21760000
218900            ADD ML128-LY-MKDN-RTL-AMT   (PS-MN-IDX)               21770000
219000                TO AT-DMM-LY-MKDN-YTD   (DMM-IDX3)                21780000
219100                   AT-GMM-LY-MKDN-YTD   (GMM-IDX3)                21790000
219200                   AT-CMPY-LY-MKDN-YTD                            21800000
211100***         LAST YEAR COMP SALES YTD                              21801062
211200            ADD ML128-LY-COMP-SLS-RTL-AMT(PS-MN-IDX)              21802062
211300                TO AT-DMM-LY-COMP-SLS-YTD(DMM-IDX3)               21803062
211400                   AT-GMM-LY-COMP-SLS-YTD(GMM-IDX3)               21804062
211500                   AT-CMPY-LY-COMP-SLS-YTD                        21805062
219300*           FORECAST SALES YTD                                    21810000
219400            ADD ML128-FC-SLS-RTL-AMT    (PS-MN-IDX)               21820000
219500                TO AT-DMM-FC-SLS-YTD    (DMM-IDX3)                21830000
219600                   AT-GMM-FC-SLS-YTD    (GMM-IDX3)                21840000
219700                   AT-CMPY-FC-SLS-YTD                             21850000
211100*** N/A     FORECAST COMP SALES YTD                               21851062
211200*           ADD ML128-FC-COMP-SLS-RTL-AMT(PS-MN-IDX)              21852062
211300*               TO AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3)               21853062
211400*                  AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3)               21854062
211500*                  AT-CMPY-FC-COMP-SLS-YTD                        21855062
219800*           FORECAST GROSS MARGIN YTD                             21860000
219900            ADD ML128-FC-GRO-MRGN-AMT   (PS-MN-IDX)               21870000
220000                TO AT-DMM-FC-GM-YTD     (DMM-IDX3)                21880000
220100                   AT-GMM-FC-GM-YTD     (GMM-IDX3)                21890000
220200                   AT-CMPY-FC-GM-YTD                              21900000
220300*           FORECAST MARKDOWN YTD                                 21910000
220400            ADD ML128-FC-MKDN-RTL-AMT   (PS-MN-IDX)               21920000
220500                TO AT-DMM-FC-MKDN-YTD   (DMM-IDX3)                21930000
220600                   AT-GMM-FC-MKDN-YTD   (GMM-IDX3)                21940000
220700                   AT-CMPY-FC-MKDN-YTD                            21950000
220800*           PLAN SALES YTD                                        21960000
220900            ADD ML128-PL-SLS-RTL-AMT    (PS-MN-IDX)               21970000
221000                TO AT-DMM-PL-SLS-YTD    (DMM-IDX3)                21980000
221100                   AT-GMM-PL-SLS-YTD    (GMM-IDX3)                21990000
221200                   AT-CMPY-PL-SLS-YTD                             22000000
211100***         PLAN COMP SALES YTD                                   22001062
211200            ADD ML128-PL-COMP-SLS-RTL-AMT(PS-MN-IDX)              22002062
211300                TO AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3)               22003062
211400                   AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3)               22004062
211500                   AT-CMPY-PL-COMP-SLS-YTD                        22005062
221300*           PLAN GROSS MARGIN YTD                                 22010000
221400            ADD ML128-PL-GRO-MRGN-AMT   (PS-MN-IDX)               22020000
221500                TO AT-DMM-PL-GM-YTD     (DMM-IDX3)                22030000
221600                   AT-GMM-PL-GM-YTD     (GMM-IDX3)                22040000
221700                   AT-CMPY-PL-GM-YTD                              22050000
221800*           PLAN MARKDOWN YTD                                     22060000
221900            ADD ML128-PL-MKDN-RTL-AMT   (PS-MN-IDX)               22070000
222000                TO AT-DMM-PL-MKDN-YTD   (DMM-IDX3)                22080000
222100                   AT-GMM-PL-MKDN-YTD   (GMM-IDX3)                22090000
222200                   AT-CMPY-PL-MKDN-YTD                            22100000
222300      END-PERFORM.                                                22110000
222400                                                                  22120000
222500*     EOM INVENTORY FORECAST YTD                                  22130000
222600      ADD ML128-FC-END-INV-RTL-AMT(SS-OPEN-MN)                    22140000
222700          TO AT-DMM-FC-EOM-YTD    (DMM-IDX3)                      22150000
222800             AT-GMM-FC-EOM-YTD    (GMM-IDX3)                      22160000
222900             AT-CMPY-FC-EOM-YTD.                                  22170000
223000                                                                  22180000
223100*     EOM INVENTORY PLAN YTD                                      22190000
223200      ADD ML128-PL-END-INV-RTL-AMT(SS-OPEN-MN)                    22200000
223300          TO AT-DMM-PL-EOM-YTD    (DMM-IDX3)                      22210000
223400             AT-GMM-PL-EOM-YTD    (GMM-IDX3)                      22220000
223500             AT-CMPY-PL-EOM-YTD.                                  22230000
223600*     ADD BEG INV RETAIL AND COST TO YTD PRCH RETAIL AND COST     22240000
223700*     FOR THE YTD CUMM MKON PERCENT CALCUALATION                  22250000
223800*     *** THIS YEAR ***                                           22260000
223900      ADD ML128-TY-BEG-INV-RTL-AMT                                22270000
224000          TO AT-DMM-TY-PRCH-RTL-YTD   (DMM-IDX3)                  22280000
224100             AT-GMM-TY-PRCH-RTL-YTD   (GMM-IDX3)                  22290000
224200             AT-CMPY-TY-PRCH-RTL-YTD.                             22300000
224300      ADD ML128-TY-BEG-INV-COST-AMT                               22310000
224400          TO AT-DMM-TY-PRCH-CST-YTD   (DMM-IDX3)                  22320000
224500             AT-GMM-TY-PRCH-CST-YTD   (GMM-IDX3)                  22330000
224600             AT-CMPY-TY-PRCH-CST-YTD.                             22340000
224700*     *** LAST YEAR ***                                           22350000
224800      ADD ML128-LY-BEG-INV-RTL-AMT                                22360000
224900          TO AT-DMM-LY-PRCH-RTL-YTD   (DMM-IDX3)                  22370000
225000             AT-GMM-LY-PRCH-RTL-YTD   (GMM-IDX3)                  22380000
225100             AT-CMPY-LY-PRCH-RTL-YTD.                             22390000
225200      ADD ML128-LY-BEG-INV-COST-AMT                               22400000
225300          TO AT-DMM-LY-PRCH-CST-YTD   (DMM-IDX3)                  22410000
225400             AT-GMM-LY-PRCH-CST-YTD   (GMM-IDX3)                  22420000
225500             AT-CMPY-LY-PRCH-CST-YTD.                             22430000
225600      PERFORM                                                     22440000
225700        VARYING PS-MN-IDX FROM 1 BY 1                             22450000
225800          UNTIL PS-MN-IDX > SS-OPEN-MN                            22460000
225900*      *** THIS YEAR ***                                          22470000
226000*          PURCHASE RETAIL YTD                                    22480000
226100           COMPUTE PV-SALES-ACCUM =                               22490000
226200                 ML128-TY-RCPT-RTL-AMT     (PS-MN-IDX)            22500000
226300               + ML128-TY-PADJ-RTL-AMT     (PS-MN-IDX)            22510000
226400               + ML128-TY-MKUP-RTL-AMT     (PS-MN-IDX)            22520000
226500               + ML128-TY-XFER-IN-RTL-AMT  (PS-MN-IDX)            22530000
226600               - ML128-TY-XFER-OUT-RTL-AMT (PS-MN-IDX)            22540000
226700           ADD PV-SALES-ACCUM                                     22550000
226800               TO AT-DMM-TY-PRCH-RTL-YTD   (DMM-IDX3)             22560000
226900                  AT-GMM-TY-PRCH-RTL-YTD   (GMM-IDX3)             22570000
227000                  AT-CMPY-TY-PRCH-RTL-YTD                         22580000
227100*          PURCHASES COST YTD                                     22590000
227200           COMPUTE PV-SALES-ACCUM =                               22600000
227300                 ML128-TY-RCPT-NET-COST-AMT(PS-MN-IDX)            22610000
227400               + ML128-TY-PADJ-NET-COST-AMT(PS-MN-IDX)            22620000
227500           ADD PV-SALES-ACCUM                                     22630000
227600               TO AT-DMM-TY-PRCH-CST-YTD   (DMM-IDX3)             22640000
227700                  AT-GMM-TY-PRCH-CST-YTD   (GMM-IDX3)             22650000
227800                  AT-CMPY-TY-PRCH-CST-YTD                         22660000
227900*      *** LAST YEAR ***                                          22670000
228000*          PURCHASE RETAIL YTD                                    22680000
228100           COMPUTE PV-SALES-ACCUM =                               22690000
228200                 ML128-LY-RCPT-RTL-AMT     (PS-MN-IDX)            22700000
228300               + ML128-LY-PADJ-RTL-AMT     (PS-MN-IDX)            22710000
228400               + ML128-LY-MKUP-RTL-AMT     (PS-MN-IDX)            22720000
228500               + ML128-LY-XFER-IN-RTL-AMT  (PS-MN-IDX)            22730000
228600               - ML128-LY-XFER-OUT-RTL-AMT (PS-MN-IDX)            22740000
228700           ADD PV-SALES-ACCUM                                     22750000
228800               TO AT-DMM-LY-PRCH-RTL-YTD   (DMM-IDX3)             22760000
228900                  AT-GMM-LY-PRCH-RTL-YTD   (GMM-IDX3)             22770000
229000                  AT-CMPY-LY-PRCH-RTL-YTD                         22780000
229100*        PURCHASES COST YTD                                       22790000
229200           COMPUTE PV-SALES-ACCUM =                               22800000
229300                 ML128-LY-RCPT-NET-COST-AMT(PS-MN-IDX)            22810000
229400               + ML128-LY-PADJ-NET-COST-AMT(PS-MN-IDX)            22820000
229500           ADD PV-SALES-ACCUM                                     22830000
229600               TO AT-DMM-LY-PRCH-CST-YTD   (DMM-IDX3)             22840000
229700                  AT-GMM-LY-PRCH-CST-YTD   (GMM-IDX3)             22850000
229800                  AT-CMPY-LY-PRCH-CST-YTD                         22860000
229900      END-PERFORM.                                                22870000
230000                                                                  22880000
230100*     *** READ FILES ***                                          22890000
230200      PERFORM 7000-READ-LEDGER-EXTRACT-WK.                        22900000
230300      PERFORM 7050-READ-LEDGER-EXTRACT-MN.                        22910000
230400      PERFORM 7060-READ-LEDGER-EXTRACT-EOW.                       22920000
230500                                                                  22930000
230600******************************************************************22940000
230700*    FILL IN THE GMM SUB HEADING INFORMATION.                     22950000
230800******************************************************************22960000
230900 3000-FILL-GMM-HEADINGS.                                          22970000
231000                                                                  22980000
231100*    GET GMM NAME                                                 22990000
231200     MOVE ML122-GMA-NBR           TO PV-GMA-NBR.                  23000000
231300     PERFORM 8100-GET-GMM-NAME.                                   23010000
231400*    GET GMA DESCRIPTION                                          23020000
231500     MOVE '??'                    TO PV-DMA-NBR                   23030000
231600                                     PV-BYR-NBR.                  23040000
231700     MOVE PC-DEPT-NBR-000         TO PV-DEPT-NBR.                 23050000
231800     MOVE PC-MDSELV-GMA           TO PV-MDSELV-CDE.               23060000
231900     PERFORM 8400-GET-MDSEAR-DESC.                                23070000
232000                                                                  23080000
232100     MOVE MDSEAR-DESC             TO AT-GMM-DESC-PG1(GMM-IDX1)    23090000
232200                                     AT-GMM-DESC-PG2(GMM-IDX2)    23100000
232300                                     AT-GMM-DESC-PG3(GMM-IDX3).   23110000
232400                                                                  23120000
232500     MOVE RSPBAR-WORKER-FIR-NAME  TO PV-FIRST-INIT.               23130000
232600     MOVE RSPBAR-WORKER-LAST-NAME TO PV-LAST-NAME.                23140000
232700                                                                  23150000
232800     IF PV-FIRST-INIT = SPACES                                    23160000
232900        MOVE RSPBAR-WORKER-LAST-NAME TO AT-GMM-NAME-PG1(GMM-IDX1) 23170000
233000                                        AT-GMM-NAME-PG2(GMM-IDX2) 23180000
233100                                        AT-GMM-NAME-PG3(GMM-IDX3) 23190000
233200     ELSE                                                         23200000
233300        MOVE PV-FIRST-INIT-LAST-NAME TO AT-GMM-NAME-PG1(GMM-IDX1) 23210000
233400                                        AT-GMM-NAME-PG2(GMM-IDX2) 23220000
233500                                        AT-GMM-NAME-PG3(GMM-IDX3) 23230000
233600     END-IF.                                                      23240000
233700                                                                  23250000
233800******************************************************************23260000
233900*    FILL IN THE DMM SUB HEADING INFORMATION.                     23270000
234000******************************************************************23280000
234100 3010-FILL-DMM-HEADINGS.                                          23290000
234200                                                                  23300000
234300*    GET DMM NAME                                                 23310000
234400     MOVE ML122-DMA-NBR           TO PV-DMA-NBR.                  23320000
234500     PERFORM 8200-GET-DMM-NAME.                                   23330000
234600                                                                  23340000
234700*    GET DMA DESCRIPTION                                          23350000
234800     MOVE '??'                    TO  PV-GMA-NBR                  23360000
234900                                      PV-BYR-NBR.                 23370000
235000     MOVE PC-DEPT-NBR-000         TO  PV-DEPT-NBR.                23380000
235100     MOVE PC-MDSELV-DMA           TO  PV-MDSELV-CDE.              23390000
235200     PERFORM 8400-GET-MDSEAR-DESC.                                23400000
235300                                                                  23410000
235400     MOVE MDSEAR-DESC             TO AT-DMM-DESC-PG1(DMM-IDX1)    23420000
235500                                     AT-DMM-DESC-PG2(DMM-IDX2)    23430000
235600                                     AT-DMM-DESC-PG3(DMM-IDX3).   23440000
235700                                                                  23450000
235800     MOVE RSPBAR-WORKER-FIR-NAME  TO PV-FIRST-INIT.               23460000
235900     MOVE RSPBAR-WORKER-LAST-NAME TO PV-LAST-NAME.                23470000
236000                                                                  23480000
236100     IF PV-FIRST-INIT = SPACES                                    23490000
236200        MOVE RSPBAR-WORKER-LAST-NAME TO AT-DMM-NAME-PG1(DMM-IDX1) 23500000
236300                                        AT-DMM-NAME-PG2(DMM-IDX2) 23510000
236400                                        AT-DMM-NAME-PG3(DMM-IDX3) 23520000
236500     ELSE                                                         23530000
236600        MOVE PV-FIRST-INIT-LAST-NAME TO AT-DMM-NAME-PG1(DMM-IDX1) 23540000
236700                                        AT-DMM-NAME-PG2(DMM-IDX2) 23550000
236800                                        AT-DMM-NAME-PG3(DMM-IDX3) 23560000
236900     END-IF.                                                      23570000
237000                                                                  23580000
237100******************************************************************23590000
237200*  CREATE THE MULTIPLE PAGE REPORTS BY DMM, GMM, COMPANY, AND YTD 23600000
237300******************************************************************23610000
237400 4000-CREATE-REPORTS.                                             23620000
237500*     SET THE NUMBER OF GMM/DMM LOADED INTO TABLES.               23630000
237600      SET PS-GMMS-LOADED TO GMM-IDX1.                             23640000
237700      SET PS-DMMS-LOADED TO DMM-IDX1.                             23650000
237800                                                                  23660000
237900*     SET GMM/DMM INDEXES TO 1 TO BEGIN BUILDING REPORTS          23670000
238000      SET GMM-IDX1 TO 1.                                          23680000
238100      SET GMM-IDX2 TO 1.                                          23690000
238200      SET GMM-IDX3 TO 1.                                          23700000
238300      SET DMM-IDX1 TO 1.                                          23710000
238400      SET DMM-IDX2 TO 1.                                          23720000
238500      SET DMM-IDX3 TO 1.                                          23730000
238600                                                                  23740000
238700      MOVE AT-DMM-GMM-NBR-PG1(1) TO HN-GMA-NBR.                   23750000
238800                                                                  23760000
238900****  PRINT DMM TOTAL - PAGE1 ****                                23770000
239000      PERFORM 4100-PROCESS-DMM-PAGE1                              23780000
239100         VARYING DMM-IDX1 FROM 1 BY 1                             23790000
239200           UNTIL DMM-IDX1 > PS-DMMS-LOADED.                       23800029
239300*     PRINT LAST GMM TOTAL - PAGE1                                23810000
            PERFORM 7630-PRINT-SEPARATOR-LINE.                          23811150
239400      PERFORM 4200-PROCESS-GMM-PAGE1.                             23820000
239500*     PRINT COMPANY TOTAL  - PAGE1                                23830000
            PERFORM 7630-PRINT-SEPARATOR-LINE.                          23830150
239600      PERFORM 4300-PROCESS-CMPY-PG1-TOTS.                         23840000
239700                                                                  23850000
239800****  PRINT LAST DMM TOTAL - PAGE2 ****                           23860000
239900      MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-2.         23870000
240000      PERFORM 4400-PROCESS-DMM-PAGE2                              23880000
240100         VARYING DMM-IDX2 FROM DMM-IDX2 BY 1                      23890000
240200           UNTIL AT-DMM-GMM-NBR-PG2(DMM-IDX2) NOT = HN-GMA-NBR    23900000
240300              OR DMM-IDX2 > PS-DMMS-LOADED.                       23910000
240400*     PRINT LAST GMM TOTALS     - PAGE2                           23920068
            PERFORM 7630-PRINT-SEPARATOR-LINE.                          23920169
240500      PERFORM 4500-PROCESS-GMM-PAGE2.                             23930069
240600*     PRINT LAST COMPANY TOTALS - PAGE2                           23940068
            PERFORM 7630-PRINT-SEPARATOR-LINE.                          23940169
240700      PERFORM 4600-PROCESS-CMPY-PG2-TOTS.                         23950069
240800                                                                  23960000
240900**** PRINT YTD REPORT TOTALS  ****                                23970065
240900**** ** ONLY IF LAST WEEK OF THE MONTH **                         23970125
            IF SS-OPEN-WK = PV-TY-LAST-WK-IN-MN                         23971070
               SET YTD-REPORT                TO TRUE                    23971175
758400         MOVE ZEROS                    TO PV-PAGE-CNT             23972074
241000         MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-3       23980070
238700         MOVE AT-DMM-GMM-NBR-PG1(1)    TO HN-GMA-NBR              23980173
241100         PERFORM 4700-CREATE-YTD-REPORT                           23990070
241400            UNTIL DMM-IDX3 > PS-DMMS-LOADED                       24020070
            END-IF.                                                     24061070
241900                                                                  24070000
242300******************************************************************24080000
242400*  PRINT REPORT PAGE 1 DMM TOTALS.                                24090000
242500******************************************************************24100000
242600 4100-PROCESS-DMM-PAGE1.                                          24110000
242700                                                                  24120000
      *    MOVE SPACES          TO  PH2-YTD-FOR-YTD-RPT.                24121048
                                                                        24122048
242800     IF AT-DMM-GMM-NBR-PG1(DMM-IDX1) = HN-GMA-NBR                 24130000
242900        NEXT SENTENCE                                             24140000
243000     ELSE                                                         24150000
      *       GMM PAGE1                                                 24160000
              PERFORM 7630-PRINT-SEPARATOR-LINE                         24161050
243100        PERFORM 4200-PROCESS-GMM-PAGE1                            24170000
243200        MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-2        24180000
239500*       PRINT COMPANY TOTAL  - PAGE1                              24181085
              PERFORM 7630-PRINT-SEPARATOR-LINE                         24182080
239600        PERFORM 4300-PROCESS-CMPY-PG1-TOTS                        24183080
      *       DMM PAGE2                                                 24190000
243300        PERFORM 4400-PROCESS-DMM-PAGE2                            24200000
243400         VARYING DMM-IDX2 FROM DMM-IDX2 BY 1                      24210000
243500           UNTIL AT-DMM-GMM-NBR-PG2(DMM-IDX2) NOT = HN-GMA-NBR    24220000
243600              OR DMM-IDX2 > PS-DMMS-LOADED                        24230000
      *       GMM PAGE2                                                 24240000
              PERFORM 7630-PRINT-SEPARATOR-LINE                         24240150
243700        PERFORM 4500-PROCESS-GMM-PAGE2                            24250000
244500        MOVE AT-DMM-GMM-NBR-PG1(DMM-IDX1) TO HN-GMA-NBR           24350030
240600*       PRINT COMPANY TOTALS - PAGE2                              24360085
              PERFORM 7630-PRINT-SEPARATOR-LINE                         24361081
240700        PERFORM 4600-PROCESS-CMPY-PG2-TOTS                        24362081
244600     END-IF.                                                      24370025
                                                                        24374000
244800     IF PV-LINE-COUNTER-1 > PC-PAGE-MAX-LINES                     24380000
              MOVE SPACES     TO  PH2-YTD-FOR-YTD-RPT                   24381048
132900        MOVE 1          TO DP200O-REPORT-NUMBER                   24390000
244900        MOVE 7          TO PV-LINE-COUNTER-1                      24400048
245000        PERFORM 7200-PRINT-PAGE-HEADINGS                          24410000
245100        PERFORM 7300-PRINT-COL-PG1-HEADINGS                       24420000
245200     END-IF.                                                      24430000
245300                                                                  24440000
245400*** MOVE EACH TYPE OF DMM TOTAL TO DETAIL LINE                    24450000
245500                                                                  24460000
245600*   *** ACTUALS ***                                               24470000
245700     MOVE AT-DMM-DESC-PG1(DMM-IDX1)      TO DWL1-HEADING.         24480000
245800     MOVE PC-ACTUAL                      TO DWL1-TOTAL-DESC.      24490000
245900                                                                  24500000
246000*    WEEKLY SALES                                                 24510000
246100     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       24520000
246200                AT-DMM-TY-SLS-WK1(DMM-IDX1) /                     24530000
246300                PC-THOUSAND.                                      24540000
246400     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       24550000
246500                AT-DMM-TY-SLS-WK2(DMM-IDX1) /                     24560000
246600                PC-THOUSAND.                                      24570000
246700     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       24580000
246800                AT-DMM-TY-SLS-WK3(DMM-IDX1) /                     24590000
246900                PC-THOUSAND.                                      24600000
247000     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       24610000
247100                AT-DMM-TY-SLS-WK4(DMM-IDX1) /                     24620000
247200                PC-THOUSAND.                                      24630000
247300     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       24640000
247400                AT-DMM-TY-SLS-WK5(DMM-IDX1) /                     24650000
247500                PC-THOUSAND.                                      24660000
247600*    MTD AMTS                                                     24670000
247700     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       24680000
247800                AT-DMM-TY-SLS-MTD(DMM-IDX1) /                     24690000
247900                PC-THOUSAND.                                      24700000
248000                                                                  24710000
248100*    MOVE AT-DMM-TY-SLS-MONTH(DMM-IDX1)                           24720000
248200     MOVE ZEROS                      TO DWL1-SLS-MONTHLY.         24730000
248300                                                                  24740000
248400     COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                      24750062
248500                AT-DMM-TY-COMP-SLS-MTD(DMM-IDX1) /                24760062
248600                PC-THOUSAND.                                      24770000
248700                                                                  24780000
248800     COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                       24790000
248900                AT-DMM-TY-GM-MTD(DMM-IDX1) /                      24800000
249000                PC-THOUSAND.                                      24810000
249100                                                                  24820000
249200     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       24830000
249300                AT-DMM-TY-INV-EOW(DMM-IDX1) /                     24840000
249400                PC-THOUSAND.                                      24850000
249500                                                                  24860000
249600     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       24870000
249700                AT-DMM-TY-MKDN-MTD(DMM-IDX1) /                    24880000
249800                PC-THOUSAND.                                      24890000
249900                                                                  24900000
250000*    GM MTD %                                                     24910000
250100     IF AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS                       24920000
250200        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         24930000
250300     ELSE                                                         24940000
250400        COMPUTE PV-PCT =                                          24950000
250500        (AT-DMM-TY-GM-MTD(DMM-IDX1) * PC-HUNDRED) /               24960000
250600         AT-DMM-TY-SLS-MTD(DMM-IDX1)                              24970000
250700        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  24980000
250800     END-IF.                                                      24990000
250900                                                                  25000000
251000*    MKDN MTD %                                                   25010000
251100     IF AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS                       25020000
251200        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       25030000
251300     ELSE                                                         25040000
251400        COMPUTE PV-PCT =                                          25050000
251500        (AT-DMM-TY-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /             25060000
251600         AT-DMM-TY-SLS-MTD(DMM-IDX1)                              25070000
251700        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                25080000
251800     END-IF.                                                      25090000
251900                                                                  25100000
252000*    MKON PURCH %                                                 25110000
252100     IF AT-DMM-TY-PRCH-RTL(DMM-IDX1) = ZEROS                      25120000
252200        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     25130000
252300     ELSE                                                         25140000
252400        COMPUTE PV-PCT =                                          25150000
252500        ((AT-DMM-TY-PRCH-RTL(DMM-IDX1) -                          25160000
252600          AT-DMM-TY-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       25170000
252700          AT-DMM-TY-PRCH-RTL(DMM-IDX1)                            25180000
252800        COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT              25190000
252900     END-IF.                                                      25200000
253000                                                                  25210000
253100     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          25220000
253200                                                                  25230000
253300*   *** FORECAST ***                                              25240000
253400     MOVE AT-DMM-NAME-PG1(DMM-IDX1)    TO DWL1-HEADING.           25250000
253500     MOVE PC-FCST                      TO DWL1-TOTAL-DESC.        25260000
253600                                                                  25270000
253700*    WEEKLY SALES                                                 25280000
253800     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       25290000
253900          AT-DMM-FC-SLS-WK1(DMM-IDX1).                            25300000
254000     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       25310000
254100          AT-DMM-FC-SLS-WK2(DMM-IDX1).                            25320000
254200     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       25330000
254300          AT-DMM-FC-SLS-WK3(DMM-IDX1).                            25340000
254400     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       25350000
254500          AT-DMM-FC-SLS-WK4(DMM-IDX1).                            25360000
254600     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       25370000
254700          AT-DMM-FC-SLS-WK5(DMM-IDX1).                            25380000
254800*    MTD AMTS                                                     25390000
254900     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       25400000
255000          AT-DMM-FC-SLS-MTD(DMM-IDX1).                            25410000
                                                                        25420000
      *    ZERO FC SALES FOR MONTH                                      25430000
255100     MOVE ZEROS                TO AT-DMM-FC-SLS-MONTH(DMM-IDX1).  25440000
                                                                        25450000
      *    SHOW FC MTD COMP SLS AND GM AT MONTH END ONLY                25451038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      25452039
              MOVE ZEROS           TO DWL1-COMP-SLS-MTD-AMT             25453062
                                      DWL1-GM-MTD-AMT                   25454039
           ELSE                                                         25455039
255300        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   25460062
255400             AT-DMM-FC-COMP-SLS-MTD(DMM-IDX1)                     25470062
255500        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    25480038
255600             AT-DMM-FC-GM-MTD(DMM-IDX1)                           25490038
           END-IF.                                                      25491038
                                                                        25492038
      *    ZERO FC EOW INVENTORY                                        25493079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               25494087
255700     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       25500087
255800          AT-DMM-FC-INV-EOW(DMM-IDX1).                            25510087
                                                                        25511079
255900     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       25520000
256000          AT-DMM-FC-MKDN-MTD(DMM-IDX1).                           25530000
256100                                                                  25540000
256200*    GM MTD %                                                     25550000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   25551042
256300        AT-DMM-FC-SLS-MTD(DMM-IDX1) = ZEROS                       25560042
256400        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         25570000
256500     ELSE                                                         25580000
256600        COMPUTE PV-PCT =                                          25590000
256700        (AT-DMM-FC-GM-MTD(DMM-IDX1) * PC-HUNDRED) /               25600000
256800         AT-DMM-FC-SLS-MTD(DMM-IDX1)                              25610000
256900        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  25620000
257000     END-IF.                                                      25630000
257100                                                                  25640000
257200*    MKDN MTD %                                                   25650000
257300     IF AT-DMM-FC-SLS-MTD(DMM-IDX1) = ZEROS                       25660000
257400        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       25670000
257500     ELSE                                                         25680000
257600        COMPUTE PV-PCT =                                          25690000
257700        (AT-DMM-FC-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /             25700000
257800         AT-DMM-FC-SLS-MTD(DMM-IDX1)                              25710000
257900        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                25720000
258000     END-IF.                                                      25730000
258100                                                                  25740000
258200*    MKON PURCH %                                                 25750000
258300     MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT.       25760000
258400*                                                                 25770000
258500* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           25780000
258600* =====================================================           25790000
258700*    IF AT-DMM-FC-PRCH-RTL(DMM-IDX1) = ZEROS                      25800000
258800*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     25810000
258900*    ELSE                                                         25820000
259000*       COMPUTE PV-PCT =                                          25830000
259100*       ((AT-DMM-FC-PRCH-RTL(DMM-IDX1) -                          25840000
259200*         AT-DMM-FC-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       25850000
259300*         AT-DMM-FC-PRCH-RTL(DMM-IDX1)                            25860000
259400*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            25870000
259500*    END-IF.                                                      25880000
259600*                                                                 25890000
259700     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          25900000
259800                                                                  25910000
259900*   *** PLAN ***                                                  25920000
260000     MOVE SPACES                       TO DWL1-HEADING.           25930000
260100     MOVE PC-PLAN                      TO DWL1-TOTAL-DESC.        25940000
260200                                                                  25950000
260300*    WEEKLY SALES                                                 25960000
260400     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       25970000
260500          AT-DMM-PL-SLS-WK1(DMM-IDX1).                            25980000
260600     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       25990000
260700          AT-DMM-PL-SLS-WK2(DMM-IDX1).                            26000000
260800     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       26010000
260900          AT-DMM-PL-SLS-WK3(DMM-IDX1).                            26020000
261000     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       26030000
261100          AT-DMM-PL-SLS-WK4(DMM-IDX1).                            26040000
261200     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       26050000
261300          AT-DMM-PL-SLS-WK5(DMM-IDX1).                            26060000
261400*    MTD AMTS                                                     26070000
261500     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       26080000
261600          AT-DMM-PL-SLS-MTD(DMM-IDX1).                            26090000
261700     COMPUTE DWL1-SLS-MONTHLY     ROUNDED =                       26100000
261800          AT-DMM-PL-SLS-MONTH(DMM-IDX1).                          26110000
      *    SHOW PLAN MTD COMP SLS AND GM AT MONTH END ONLY              26111039
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      26111139
              MOVE ZEROS           TO DWL1-COMP-SLS-MTD-AMT             26111262
                                      DWL1-GM-MTD-AMT                   26111339
           ELSE                                                         26111439
261900        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   26120062
262000             AT-DMM-PL-COMP-SLS-MTD(DMM-IDX1)                     26130062
262100        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    26140038
262200             AT-DMM-PL-GM-MTD(DMM-IDX1)                           26150038
           END-IF.                                                      26150138
                                                                        26151038
262300     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       26160000
262400          AT-DMM-PL-INV-EOW(DMM-IDX1).                            26170000
262500     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       26180000
262600          AT-DMM-PL-MKDN-MTD(DMM-IDX1).                           26190000
262700                                                                  26200000
262800*    GM MTD %                                                     26210000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   26211042
262900        AT-DMM-PL-SLS-MTD(DMM-IDX1) = ZEROS                       26220042
263000        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         26230000
263100     ELSE                                                         26240000
263200        COMPUTE PV-PCT =                                          26250000
263300        (AT-DMM-PL-GM-MTD(DMM-IDX1) * PC-HUNDRED) /               26260000
263400         AT-DMM-PL-SLS-MTD(DMM-IDX1)                              26270000
263500        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  26280000
263600     END-IF.                                                      26290000
263700                                                                  26300000
263800*    MKDN MTD %                                                   26310000
263900     IF AT-DMM-PL-SLS-MTD(DMM-IDX1) = ZEROS                       26320000
264000        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       26330000
264100     ELSE                                                         26340000
264200        COMPUTE PV-PCT =                                          26350000
264300        (AT-DMM-PL-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /             26360000
264400         AT-DMM-PL-SLS-MTD(DMM-IDX1)                              26370000
264500        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                26380000
264600     END-IF.                                                      26390000
264700                                                                  26400000
264800*    MKON PURCH %                                                 26410000
265000     IF AT-DMM-PL-PRCH-RTL(DMM-IDX1) = ZEROS                      26420000
265100        MOVE ZEROS                  TO DWL1-MKON-PURCH-PCT        26430000
265200     ELSE                                                         26440000
265300        COMPUTE PV-PCT =                                          26450000
265400        ((AT-DMM-PL-PRCH-RTL(DMM-IDX1) -                          26460000
265500          AT-DMM-PL-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       26470000
265600          AT-DMM-PL-PRCH-RTL(DMM-IDX1)                            26480000
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            26490000
265800     END-IF.                                                      26500000
265900*                                                                 26510000
266000* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           26520000
266100* =====================================================           26530000
266200*                                                                 26540000
266300*    IF AT-DMM-PL-PRCH-RTL(DMM-IDX1) = ZEROS                      26550000
266400*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     26560000
266500*    ELSE                                                         26570000
266600*       COMPUTE PV-PCT =                                          26580000
266700*       ((AT-DMM-PL-PRCH-RTL(DMM-IDX1) -                          26590000
266800*         AT-DMM-PL-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       26600000
266900*         AT-DMM-PL-PRCH-RTL(DMM-IDX1)                            26610000
267000*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            26620000
267100*    END-IF.                                                      26630000
267200*                                                                 26640000
267300     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          26650000
267400                                                                  26660000
267500*   *** VARIANCE FORECAST ***                                     26670000
267600     MOVE SPACES                       TO DWL1-HEADING.           26680000
267700     MOVE PC-VAR-FCST                  TO DWL1-TOTAL-DESC.        26690000
267800                                                                  26700000
267900*    WEEKLY SALES - ONLY SHOW THRU OPEN WEEK                      26710037
268000     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       26720000
268100         (AT-DMM-TY-SLS-WK1(DMM-IDX1) / PC-THOUSAND) -            26730000
268200          AT-DMM-FC-SLS-WK1(DMM-IDX1).                            26740000
                                                                        26740137
           IF SS-OPEN-WK < 2                                            26741037
268300        MOVE ZEROS      TO DWL1-SLS-WK2-AMT                       26741137
           ELSE                                                         26742037
268300        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    26750037
268400            (AT-DMM-TY-SLS-WK2(DMM-IDX1) / PC-THOUSAND) -         26760037
268500             AT-DMM-FC-SLS-WK2(DMM-IDX1)                          26770037
           END-IF.                                                      26771037
                                                                        26772037
           IF SS-OPEN-WK < 3                                            26773037
268300        MOVE ZEROS      TO DWL1-SLS-WK3-AMT                       26774037
           ELSE                                                         26775037
268300        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    26776037
268400            (AT-DMM-TY-SLS-WK3(DMM-IDX1) / PC-THOUSAND) -         26777037
268500             AT-DMM-FC-SLS-WK3(DMM-IDX1)                          26778037
           END-IF.                                                      26779037
                                                                        26780037
           IF SS-OPEN-WK < 4                                            26790037
268300        MOVE ZEROS      TO DWL1-SLS-WK4-AMT                       26800037
           ELSE                                                         26810037
268300        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    26820037
268400            (AT-DMM-TY-SLS-WK4(DMM-IDX1) / PC-THOUSAND) -         26830037
268500             AT-DMM-FC-SLS-WK4(DMM-IDX1)                          26840037
           END-IF.                                                      26850037
                                                                        26860037
           IF SS-OPEN-WK < 5                                            26861037
268300        MOVE ZEROS      TO DWL1-SLS-WK5-AMT                       26862037
           ELSE                                                         26863037
268300        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    26864037
268400            (AT-DMM-TY-SLS-WK5(DMM-IDX1) / PC-THOUSAND) -         26865037
268500             AT-DMM-FC-SLS-WK5(DMM-IDX1)                          26866037
           END-IF.                                                      26867037
269900                                                                  26870000
270000     MOVE ZEROS                 TO DWL1-SLS-MONTHLY.              26880000
269600     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       26890000
269700         (AT-DMM-TY-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -            26900000
269800          AT-DMM-FC-SLS-MTD(DMM-IDX1).                            26910000
                                                                        26920000
      *    ZERO COMP SALES MTD                                          26930000
270000     MOVE ZEROS                 TO DWL1-COMP-SLS-MTD-AMT.         26940062
                                                                        26950000
      *    SHOW FC MTD GM AT MONTH END ONLY                             26951038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      26951239
              MOVE ZEROS           TO DWL1-GM-MTD-AMT                   26951339
           ELSE                                                         26951539
270700        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    26960038
270800            (AT-DMM-TY-GM-MTD(DMM-IDX1) / PC-THOUSAND) -          26970038
270900             AT-DMM-FC-GM-MTD(DMM-IDX1)                           26980038
           END-IF.                                                      26981038
                                                                        26981179
                                                                        26982079
      *    ZERO VAR FC EOW INVENTORY                                    26983079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               26984087
271000     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       26990087
271100         (AT-DMM-TY-INV-EOW(DMM-IDX1) / PC-THOUSAND) -            27000087
271200          AT-DMM-FC-INV-EOW(DMM-IDX1).                            27010087
                                                                        27011079
271300     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       27020000
271400         (AT-DMM-TY-MKDN-MTD(DMM-IDX1) / PC-THOUSAND) -           27030000
271500          AT-DMM-FC-MKDN-MTD(DMM-IDX1).                           27040000
271600                                                                  27050000
271700*    GM MTD %                                                     27060000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   27061042
271800        AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS  OR                   27070042
271900        AT-DMM-FC-SLS-MTD(DMM-IDX1) = ZEROS                       27080000
272000        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         27090000
272100     ELSE                                                         27100000
272200        COMPUTE PV-PCT =                                          27110000
272300        ((AT-DMM-TY-GM-MTD(DMM-IDX1) * PC-HUNDRED) /              27120000
272400          AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                          27130000
272500        ((AT-DMM-FC-GM-MTD(DMM-IDX1) * PC-HUNDRED) /              27140000
272600          AT-DMM-FC-SLS-MTD(DMM-IDX1))                            27150000
272700        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  27160000
272800     END-IF.                                                      27170000
272900                                                                  27180000
273000*    MKDN MTD %                                                   27190000
273100     IF AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS OR                    27200000
273200        AT-DMM-FC-SLS-MTD(DMM-IDX1) = ZEROS                       27210000
273300        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       27220000
273400     ELSE                                                         27230000
273500        COMPUTE PV-PCT =                                          27240000
273600        ((AT-DMM-TY-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /            27250000
273700          AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                          27260000
273800        ((AT-DMM-FC-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /            27270000
273900          AT-DMM-FC-SLS-MTD(DMM-IDX1))                            27280000
274000        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                27290000
274100     END-IF.                                                      27300000
274200                                                                  27310000
274300*    MKON PURCH %                                                 27320000
274400     MOVE ZEROS                        TO DWL1-MKON-PURCH-PCT.    27330000
274500                                                                  27340000
274600     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          27350000
274700                                                                  27360000
274800*   *** VARIANCE PLAN ***                                         27370000
274900     MOVE SPACES                       TO DWL1-HEADING.           27380000
275000     MOVE PC-VAR-PL                    TO DWL1-TOTAL-DESC.        27390000
267900*    WEEKLY SALES - ONLY SHOW THRU OPEN WEEK                      27401037
275200     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       27410000
275300         (AT-DMM-TY-SLS-WK1(DMM-IDX1) / PC-THOUSAND) -            27420000
275400          AT-DMM-PL-SLS-WK1(DMM-IDX1).                            27430000
                                                                        27430137
           IF SS-OPEN-WK < 2                                            27431037
268300        MOVE ZEROS      TO DWL1-SLS-WK2-AMT                       27432037
           ELSE                                                         27433037
268300        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    27434037
268400            (AT-DMM-TY-SLS-WK2(DMM-IDX1) / PC-THOUSAND) -         27435037
268500             AT-DMM-PL-SLS-WK2(DMM-IDX1)                          27436037
           END-IF.                                                      27437037
                                                                        27438037
           IF SS-OPEN-WK < 3                                            27439037
268300        MOVE ZEROS      TO DWL1-SLS-WK3-AMT                       27439137
           ELSE                                                         27439237
268300        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    27439337
268400            (AT-DMM-TY-SLS-WK3(DMM-IDX1) / PC-THOUSAND) -         27439437
268500             AT-DMM-PL-SLS-WK3(DMM-IDX1)                          27439537
           END-IF.                                                      27439637
                                                                        27439737
           IF SS-OPEN-WK < 4                                            27439837
268300        MOVE ZEROS      TO DWL1-SLS-WK4-AMT                       27439937
           ELSE                                                         27440037
268300        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    27440137
268400            (AT-DMM-TY-SLS-WK4(DMM-IDX1) / PC-THOUSAND) -         27440237
268500             AT-DMM-PL-SLS-WK4(DMM-IDX1)                          27440337
           END-IF.                                                      27440437
                                                                        27440537
           IF SS-OPEN-WK < 5                                            27440637
268300        MOVE ZEROS      TO DWL1-SLS-WK5-AMT                       27440737
           ELSE                                                         27440837
268300        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    27440937
268400            (AT-DMM-TY-SLS-WK5(DMM-IDX1) / PC-THOUSAND) -         27441037
268500             AT-DMM-PL-SLS-WK5(DMM-IDX1)                          27441137
           END-IF.                                                      27441237
                                                                        27441337
276700*    MTD AMTS                                                     27560000
276800     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       27570000
276900         (AT-DMM-TY-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -            27580000
277000          AT-DMM-PL-SLS-MTD(DMM-IDX1).                            27590000
277100*    ZERO MONTHLY SALES                                           27600000
277200     MOVE ZEROS                 TO DWL1-SLS-MONTHLY.              27610000
                                                                        27620000
      *    SHOW PLAN MTD COMP SLS AND GM AT MONTH END ONLY              27621039
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      27621139
              MOVE ZEROS           TO DWL1-COMP-SLS-MTD-AMT             27621262
                                      DWL1-GM-MTD-AMT                   27621339
           ELSE                                                         27621439
277600        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   27630062
277700            (AT-DMM-TY-COMP-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -    27640062
277800             AT-DMM-PL-COMP-SLS-MTD(DMM-IDX1)                     27650062
277900        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    27650139
278000            (AT-DMM-TY-GM-MTD(DMM-IDX1) / PC-THOUSAND) -          27650239
278100             AT-DMM-PL-GM-MTD(DMM-IDX1)                           27650339
           END-IF.                                                      27651038
                                                                        27652038
278200     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       27690000
278300         (AT-DMM-TY-INV-EOW(DMM-IDX1) / PC-THOUSAND) -            27700000
278400          AT-DMM-PL-INV-EOW(DMM-IDX1).                            27710000
278500     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       27720000
278600         (AT-DMM-TY-MKDN-MTD(DMM-IDX1) / PC-THOUSAND) -           27730000
278700          AT-DMM-PL-MKDN-MTD(DMM-IDX1).                           27740000
278800                                                                  27750000
278900*    GM MTD %                                                     27760000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   27761042
L1010         AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS   OR                  27770042
L1010         AT-DMM-PL-SLS-MTD(DMM-IDX1) = ZEROS                       27780000
279200        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         27790000
279300     ELSE                                                         27800000
279400        COMPUTE PV-PCT =                                          27810000
279500        ((AT-DMM-TY-GM-MTD(DMM-IDX1) * PC-HUNDRED) /              27820000
279600          AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                          27830000
279700        ((AT-DMM-PL-GM-MTD(DMM-IDX1) * PC-HUNDRED) /              27840000
279800          AT-DMM-PL-SLS-MTD(DMM-IDX1))                            27850000
279900        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  27860000
280000     END-IF.                                                      27870000
280100                                                                  27880000
280200*    MKDN MTD %                                                   27890000
280300     IF AT-DMM-TY-SLS-MTD(DMM-IDX1) = ZEROS OR                    27900000
280400        AT-DMM-PL-SLS-MTD(DMM-IDX1) = ZEROS                       27910000
280500        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       27920000
280600     ELSE                                                         27930000
280700        COMPUTE PV-PCT =                                          27940000
280800        ((AT-DMM-TY-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /            27950000
280900          AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                          27960000
281000        ((AT-DMM-PL-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /            27970000
281100          AT-DMM-PL-SLS-MTD(DMM-IDX1))                            27980000
281200        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                27990000
281300     END-IF.                                                      28000000
281400                                                                  28010000
281500*    MKON PURCH %                                                 28020047
252100     IF AT-DMM-TY-PRCH-RTL(DMM-IDX1) = ZEROS OR                   28030143
265000        AT-DMM-PL-PRCH-RTL(DMM-IDX1) = ZEROS                      28030243
281600        MOVE ZEROS                   TO DWL1-MKON-PURCH-PCT       28030343
           ELSE                                                         28030443
252400        COMPUTE PV-PCT =                                          28030543
252500       (((AT-DMM-TY-PRCH-RTL(DMM-IDX1) -                          28030643
252600          AT-DMM-TY-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       28030743
252700          AT-DMM-TY-PRCH-RTL(DMM-IDX1)) -                         28030843
265400       (((AT-DMM-PL-PRCH-RTL(DMM-IDX1) -                          28035043
265500          AT-DMM-PL-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       28036043
265600          AT-DMM-PL-PRCH-RTL(DMM-IDX1))                           28037043
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            28038043
265800     END-IF.                                                      28039043
281700                                                                  28040000
281800     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          28050000
281900                                                                  28060000
282000*   *** PCT VARIANCE FORECAST ***                                 28070000
282100     MOVE SPACES                       TO DWL1-HEADING.           28080000
282200     MOVE PC-PVARFCST                  TO DWL1-TOTAL-DESC.        28090000
282300                                                                  28100000
282400*    WEEKLY SALES                                                 28110000
282500     IF AT-DMM-FC-SLS-WK1(DMM-IDX1) = ZEROS                       28120000
282600        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        28130000
282700     ELSE                                                         28140000
282800        COMPUTE PV-PCT =                                          28150000
282900        (((AT-DMM-TY-SLS-WK1(DMM-IDX1) / PC-THOUSAND) -           28160000
283000           AT-DMM-FC-SLS-WK1(DMM-IDX1)) /                         28170000
283100           AT-DMM-FC-SLS-WK1(DMM-IDX1)) * PC-HUNDRED              28180000
283200        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 28190000
283300     END-IF.                                                      28200000
283400                                                                  28210000
           IF SS-OPEN-WK < 2 OR                                         28211031
283500        AT-DMM-FC-SLS-WK2(DMM-IDX1) = ZEROS                       28220031
283600        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        28230000
283700     ELSE                                                         28240000
283800        COMPUTE PV-PCT =                                          28250000
283900        (((AT-DMM-TY-SLS-WK2(DMM-IDX1) / PC-THOUSAND) -           28260000
284000           AT-DMM-FC-SLS-WK2(DMM-IDX1)) /                         28270000
284100           AT-DMM-FC-SLS-WK2(DMM-IDX1)) * PC-HUNDRED              28280000
284200        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 28290000
284300     END-IF.                                                      28300000
284400                                                                  28310000
           IF SS-OPEN-WK < 3 OR                                         28311031
284500        AT-DMM-FC-SLS-WK3(DMM-IDX1) = ZEROS                       28320031
284600        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        28330000
284700     ELSE                                                         28340000
284800        COMPUTE PV-PCT =                                          28350000
284900        (((AT-DMM-TY-SLS-WK3(DMM-IDX1) / PC-THOUSAND) -           28360000
285000           AT-DMM-FC-SLS-WK3(DMM-IDX1)) /                         28370000
285100           AT-DMM-FC-SLS-WK3(DMM-IDX1)) * PC-HUNDRED              28380000
285200        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 28390000
285300     END-IF.                                                      28400000
285400                                                                  28410000
           IF SS-OPEN-WK < 4 OR                                         28411031
285500        AT-DMM-FC-SLS-WK4(DMM-IDX1) = ZEROS                       28420031
285600        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        28430000
285700     ELSE                                                         28440000
285800        COMPUTE PV-PCT =                                          28450000
285900        (((AT-DMM-TY-SLS-WK4(DMM-IDX1) / PC-THOUSAND) -           28460000
286000           AT-DMM-FC-SLS-WK4(DMM-IDX1)) /                         28470000
286100           AT-DMM-FC-SLS-WK4(DMM-IDX1)) * PC-HUNDRED              28480000
286200        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 28490000
286300     END-IF.                                                      28500000
286400                                                                  28510000
           IF SS-OPEN-WK < 5 OR                                         28511031
286500        AT-DMM-FC-SLS-WK5(DMM-IDX1) = ZEROS                       28520031
286600        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        28530000
286700     ELSE                                                         28540000
286800        COMPUTE PV-PCT =                                          28550000
286900        (((AT-DMM-TY-SLS-WK5(DMM-IDX1) / PC-THOUSAND) -           28560000
287000           AT-DMM-FC-SLS-WK5(DMM-IDX1)) /                         28570000
287100           AT-DMM-FC-SLS-WK5(DMM-IDX1)) * PC-HUNDRED              28580000
287200        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 28590000
287300     END-IF.                                                      28600000
287400                                                                  28610000
287500*    MTD AMTS                                                     28620000
287600     IF AT-DMM-FC-SLS-MTD(DMM-IDX1) = ZEROS                       28630000
287700        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        28640000
287800     ELSE                                                         28650000
287900        COMPUTE PV-PCT =                                          28660000
288000        (((AT-DMM-TY-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -           28670000
288100           AT-DMM-FC-SLS-MTD(DMM-IDX1)) /                         28680000
288200           AT-DMM-FC-SLS-MTD(DMM-IDX1)) * PC-HUNDRED              28690000
288300        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 28700000
288400     END-IF.                                                      28710000
288500                                                                  28720000
277100*    ZERO MONTHLY SALES                                           28730000
288600     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       28740000
288700                                                                  28750000
      *    SHOW FC MTD CMP SLS AT MONTH END ONLY                        28751038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   28752038
288800        AT-DMM-FC-COMP-SLS-MTD(DMM-IDX1) = ZEROS                  28760062
288900        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   28770062
289000     ELSE                                                         28780000
289100        COMPUTE PV-PCT =                                          28790000
289200        (((AT-DMM-TY-COMP-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -      28800062
289300           AT-DMM-FC-COMP-SLS-MTD(DMM-IDX1)) /                    28810062
289400           AT-DMM-FC-COMP-SLS-MTD(DMM-IDX1)) * PC-HUNDRED         28820062
289500        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            28830062
289600     END-IF.                                                      28840000
289700                                                                  28850000
      *    SHOW FC MTD GM AT MONTH END ONLY                             28851038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   28852038
289800        AT-DMM-FC-GM-MTD(DMM-IDX1) = ZEROS                        28860038
289900        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         28870000
290000     ELSE                                                         28880000
290100        COMPUTE PV-PCT =                                          28890000
290200        (((AT-DMM-TY-GM-MTD(DMM-IDX1) / PC-THOUSAND) -            28900000
290300           AT-DMM-FC-GM-MTD(DMM-IDX1)) /                          28910000
290400           AT-DMM-FC-GM-MTD(DMM-IDX1)) * PC-HUNDRED               28920000
290500        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  28930000
290600     END-IF.                                                      28940000
290700                                                                  28950000
290800     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        28960000
290900                                                                  28970000
      *    ZERO % VAR FC EOW INVENTORY                                  28971079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               28972087
291000     IF AT-DMM-FC-INV-EOW(DMM-IDX1) = ZEROS                       28980087
291100        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        28990087
291200     ELSE                                                         29000087
291300        COMPUTE PV-PCT =                                          29010087
291400        (((AT-DMM-TY-INV-EOW(DMM-IDX1) / PC-THOUSAND) -           29020087
291500           AT-DMM-FC-INV-EOW(DMM-IDX1)) /                         29030087
291600           AT-DMM-FC-INV-EOW(DMM-IDX1)) * PC-HUNDRED              29040087
291700        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 29050087
291800     END-IF.                                                      29060087
291900                                                                  29070000
292000     IF AT-DMM-FC-MKDN-MTD(DMM-IDX1) = ZEROS                      29080000
292100        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       29090000
292200     ELSE                                                         29100000
292300        COMPUTE PV-PCT =                                          29110000
292400        (((AT-DMM-TY-MKDN-MTD(DMM-IDX1) / PC-THOUSAND) -          29120000
292500           AT-DMM-FC-MKDN-MTD(DMM-IDX1)) /                        29130000
292600           AT-DMM-FC-MKDN-MTD(DMM-IDX1)) * PC-HUNDRED             29140000
292700        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                29150000
292800     END-IF.                                                      29160000
292900                                                                  29170000
277100*    ZERO MKDN MTD % AND MKON %                                   29180000
293000     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       29190000
293100                                          DWL1-MKON-PURCH-PCT.    29200000
293200                                                                  29210000
293300     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          29220000
293400                                                                  29230000
293500*   *** PCT VARIANCE PLAN ***                                     29240000
293600     MOVE SPACES                       TO DWL1-HEADING.           29250000
293700     MOVE PC-PVARPL                    TO DWL1-TOTAL-DESC.        29260000
293800                                                                  29270000
293900*    WEEKLY SALES                                                 29280000
294000     IF AT-DMM-PL-SLS-WK1(DMM-IDX1) = ZEROS                       29290000
294100        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        29300000
294200     ELSE                                                         29310000
294300        COMPUTE PV-PCT =                                          29320000
294400        (((AT-DMM-TY-SLS-WK1(DMM-IDX1) / PC-THOUSAND) -           29330000
294500           AT-DMM-PL-SLS-WK1(DMM-IDX1)) /                         29340000
294600           AT-DMM-PL-SLS-WK1(DMM-IDX1)) * PC-HUNDRED              29350000
294700        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 29360000
294800     END-IF.                                                      29370000
294900                                                                  29380000
           IF SS-OPEN-WK < 2 OR                                         29382032
295000        AT-DMM-PL-SLS-WK2(DMM-IDX1) = ZEROS                       29390032
295100        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        29400000
295200     ELSE                                                         29410000
295300        COMPUTE PV-PCT =                                          29420000
295400        (((AT-DMM-TY-SLS-WK2(DMM-IDX1) / PC-THOUSAND) -           29430000
295500           AT-DMM-PL-SLS-WK2(DMM-IDX1)) /                         29440000
295600           AT-DMM-PL-SLS-WK2(DMM-IDX1)) * PC-HUNDRED              29450000
295700        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 29460000
295800     END-IF.                                                      29470000
295900                                                                  29480000
           IF SS-OPEN-WK < 3 OR                                         29481032
296000        AT-DMM-PL-SLS-WK3(DMM-IDX1) = ZEROS                       29490032
296100        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        29500000
296200     ELSE                                                         29510000
296300        COMPUTE PV-PCT =                                          29520000
296400        (((AT-DMM-TY-SLS-WK3(DMM-IDX1) / PC-THOUSAND) -           29530000
296500           AT-DMM-PL-SLS-WK3(DMM-IDX1)) /                         29540000
296600           AT-DMM-PL-SLS-WK3(DMM-IDX1)) * PC-HUNDRED              29550000
296700        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 29560000
296800     END-IF.                                                      29570000
296900                                                                  29580000
           IF SS-OPEN-WK < 4 OR                                         29581032
297000        AT-DMM-PL-SLS-WK4(DMM-IDX1) = ZEROS                       29590032
297100        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        29600000
297200     ELSE                                                         29610000
297300        COMPUTE PV-PCT =                                          29620000
297400        (((AT-DMM-TY-SLS-WK4(DMM-IDX1) / PC-THOUSAND) -           29630000
297500           AT-DMM-PL-SLS-WK4(DMM-IDX1)) /                         29640000
297600           AT-DMM-PL-SLS-WK4(DMM-IDX1)) * PC-HUNDRED              29650000
297700        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 29660000
297800     END-IF.                                                      29670000
297900                                                                  29680000
           IF SS-OPEN-WK < 5 OR                                         29681032
298000        AT-DMM-PL-SLS-WK5(DMM-IDX1) = ZEROS                       29690032
298100        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        29700000
298200     ELSE                                                         29710000
298300        COMPUTE PV-PCT =                                          29720000
298400        (((AT-DMM-TY-SLS-WK5(DMM-IDX1) / PC-THOUSAND) -           29730000
298500           AT-DMM-PL-SLS-WK5(DMM-IDX1)) /                         29740000
298600           AT-DMM-PL-SLS-WK5(DMM-IDX1)) * PC-HUNDRED              29750000
298700        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 29760000
298800     END-IF.                                                      29770000
298900                                                                  29780000
299000*    MTD AMTS                                                     29790000
299100     IF AT-DMM-PL-SLS-MTD(DMM-IDX1) = ZEROS                       29800000
299200        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        29810000
299300     ELSE                                                         29820000
299400        COMPUTE PV-PCT =                                          29830000
299500        (((AT-DMM-TY-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -           29840000
299600           AT-DMM-PL-SLS-MTD(DMM-IDX1)) /                         29850000
299700           AT-DMM-PL-SLS-MTD(DMM-IDX1)) * PC-HUNDRED              29860000
299800        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 29870000
299900     END-IF.                                                      29880000
300000                                                                  29890000
300100     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       29900000
300200                                                                  29910000
      *    SHOW PLAN MTD COMP SLS AT MONTH END ONLY                     29911038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   29912038
300300        AT-DMM-PL-COMP-SLS-MTD(DMM-IDX1) = ZEROS                  29920062
300400        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   29930062
300500     ELSE                                                         29940000
300600        COMPUTE PV-PCT =                                          29950000
300700        (((AT-DMM-TY-COMP-SLS-MTD(DMM-IDX1) / PC-THOUSAND) -      29960062
300800           AT-DMM-PL-COMP-SLS-MTD(DMM-IDX1)) /                    29970062
300900           AT-DMM-PL-COMP-SLS-MTD(DMM-IDX1)) * PC-HUNDRED         29980062
301000        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            29990062
301100     END-IF.                                                      30000000
301200                                                                  30010000
      *    SHOW PLAN MTD GM AT MONTH END ONLY                           30011038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   30012038
301300        AT-DMM-PL-GM-MTD(DMM-IDX1) = ZEROS                        30020038
301400        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         30030000
301500     ELSE                                                         30040000
301600        COMPUTE PV-PCT =                                          30050000
301700        (((AT-DMM-TY-GM-MTD(DMM-IDX1) / PC-THOUSAND) -            30060000
301800           AT-DMM-PL-GM-MTD(DMM-IDX1)) /                          30070000
301900           AT-DMM-PL-GM-MTD(DMM-IDX1)) * PC-HUNDRED               30080000
302000        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  30090000
302100     END-IF.                                                      30100000
302200                                                                  30110000
277100*    ZERO GM MTD %                                                30120000
302300     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        30130000
302400                                                                  30140000
302500     IF AT-DMM-PL-INV-EOW(DMM-IDX1) = ZEROS                       30150000
302600        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        30160000
302700     ELSE                                                         30170000
302800        COMPUTE PV-PCT =                                          30180000
302900        (((AT-DMM-TY-INV-EOW(DMM-IDX1) / PC-THOUSAND) -           30190000
303000           AT-DMM-PL-INV-EOW(DMM-IDX1)) /                         30200000
303100           AT-DMM-PL-INV-EOW(DMM-IDX1)) * PC-HUNDRED              30210000
303200        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 30220000
303300     END-IF.                                                      30230000
303400                                                                  30240000
303500     IF AT-DMM-PL-MKDN-MTD(DMM-IDX1) = ZEROS                      30250000
303600        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       30260000
303700     ELSE                                                         30270000
303800        COMPUTE PV-PCT =                                          30280000
303900        (((AT-DMM-TY-MKDN-MTD(DMM-IDX1) / PC-THOUSAND) -          30290000
304000           AT-DMM-PL-MKDN-MTD(DMM-IDX1)) /                        30300000
304100           AT-DMM-PL-MKDN-MTD(DMM-IDX1)) * PC-HUNDRED             30310000
304200        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                30320000
304300     END-IF.                                                      30330000
304400                                                                  30340000
304500     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       30350000
304600                                          DWL1-MKON-PURCH-PCT.    30360000
304700                                                                  30370000
304800     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          30380000
304900                                                                  30390000
305000*   *** PCT VARIANCE LAST YR ***                                  30400000
305100     MOVE SPACES                       TO DWL1-HEADING.           30410000
305200     MOVE PC-PVARLY                    TO DWL1-TOTAL-DESC.        30420000
305300                                                                  30430000
305400*    WEEKLY SALES                                                 30440000
305500     IF AT-DMM-PVLY-SLS-WK1(DMM-IDX1) = ZEROS                     30450000
305600        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        30460000
305700     ELSE                                                         30470000
305800        COMPUTE PV-PCT =                                          30480000
305900              ((AT-DMM-TY-SLS-WK1(DMM-IDX1) -                     30490000
306000                AT-DMM-PVLY-SLS-WK1(DMM-IDX1)) /                  30500000
306100                AT-DMM-PVLY-SLS-WK1(DMM-IDX1)) * PC-HUNDRED       30510000
306200        COMPUTE DWL1-SLS-WK1-AMT     ROUNDED = PV-PCT             30520000
306300     END-IF.                                                      30530000
306400                                                                  30540000
306500     IF AT-DMM-PVLY-SLS-WK2(DMM-IDX1) = ZEROS                     30550000
306600        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        30560000
306700     ELSE                                                         30570000
306800        COMPUTE PV-PCT =                                          30580000
306900              ((AT-DMM-TY-SLS-WK2(DMM-IDX1) -                     30590000
307000                AT-DMM-PVLY-SLS-WK2(DMM-IDX1)) /                  30600000
307100                AT-DMM-PVLY-SLS-WK2(DMM-IDX1)) * PC-HUNDRED       30610000
307200        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED = PV-PCT             30620000
307300     END-IF.                                                      30630000
307400                                                                  30640000
307500     IF AT-DMM-PVLY-SLS-WK3(DMM-IDX1) = ZEROS                     30650000
307600        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        30660000
307700     ELSE                                                         30670000
307800        COMPUTE PV-PCT =                                          30680000
307900              ((AT-DMM-TY-SLS-WK3(DMM-IDX1) -                     30690000
308000                AT-DMM-PVLY-SLS-WK3(DMM-IDX1)) /                  30700000
308100                AT-DMM-PVLY-SLS-WK3(DMM-IDX1)) * PC-HUNDRED       30710000
308200        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED = PV-PCT             30720000
308300     END-IF.                                                      30730000
308400                                                                  30740000
308500     IF AT-DMM-PVLY-SLS-WK4(DMM-IDX1) = ZEROS                     30750000
308600        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        30760000
308700     ELSE                                                         30770000
308800        COMPUTE PV-PCT =                                          30780000
308900              ((AT-DMM-TY-SLS-WK4(DMM-IDX1) -                     30790000
309000                AT-DMM-PVLY-SLS-WK4(DMM-IDX1)) /                  30800000
309100                AT-DMM-PVLY-SLS-WK4(DMM-IDX1)) * PC-HUNDRED       30810000
309200        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED = PV-PCT             30820000
309300     END-IF.                                                      30830000
309400                                                                  30840000
309500     IF AT-DMM-PVLY-SLS-WK5(DMM-IDX1) = ZEROS                     30850000
309600        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        30860000
309700     ELSE                                                         30870000
309800        COMPUTE PV-PCT =                                          30880000
309900              ((AT-DMM-TY-SLS-WK5(DMM-IDX1) -                     30890000
310000                AT-DMM-PVLY-SLS-WK5(DMM-IDX1)) /                  30900000
310100                AT-DMM-PVLY-SLS-WK5(DMM-IDX1)) * PC-HUNDRED       30910000
310200        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED = PV-PCT             30920000
310300     END-IF.                                                      30930000
310400                                                                  30940000
310500*    MTD AMTS                                                     30950000
310600     IF AT-DMM-PVLY-SLS-MTD(DMM-IDX1) = ZEROS                     30960000
310700        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        30970000
310800     ELSE                                                         30980000
310900        COMPUTE PV-PCT =                                          30990000
311000              ((AT-DMM-TY-SLS-MTD(DMM-IDX1) -                     31000000
311100                AT-DMM-PVLY-SLS-MTD(DMM-IDX1)) /                  31010000
311200                AT-DMM-PVLY-SLS-MTD(DMM-IDX1)) * PC-HUNDRED       31020000
311300        COMPUTE DWL1-SLS-MTD-AMT     ROUNDED = PV-PCT             31030000
311400     END-IF.                                                      31040000
311500***  USE PLAN SALES FOR MONTH % VARIANCE LY                       31050000
311600     IF AT-DMM-PVLY-SLS-MONTH(DMM-IDX1) = ZEROS                   31060000
311700        MOVE ZEROS                     TO DWL1-SLS-MONTHLY        31070000
311800     ELSE                                                         31080000
311900        COMPUTE PV-PCT =                                          31090000
312000              ((AT-DMM-PL-SLS-MONTH(DMM-IDX1) -                   31100000
312100               (AT-DMM-PVLY-SLS-MONTH(DMM-IDX1) / PC-THOUSAND)) / 31110000
312100               (AT-DMM-PVLY-SLS-MONTH(DMM-IDX1) / PC-THOUSAND)) * 31120000
312200                PC-HUNDRED                                        31130000
312300        COMPUTE DWL1-SLS-MONTHLY    ROUNDED = PV-PCT              31140000
312400     END-IF.                                                      31150000
312500                                                                  31160000
312600     IF AT-DMM-PVLY-COMP-SLS-MTD(DMM-IDX1) = ZEROS                31170062
312700        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   31180062
312800     ELSE                                                         31190000
312900        COMPUTE PV-PCT =                                          31200000
313000              ((AT-DMM-TY-COMP-SLS-MTD(DMM-IDX1) -                31210062
313100                AT-DMM-PVLY-COMP-SLS-MTD(DMM-IDX1)) /             31220062
313200                AT-DMM-PVLY-COMP-SLS-MTD(DMM-IDX1)) * PC-HUNDRED  31230062
313300        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            31240062
313400     END-IF.                                                      31250000
313500                                                                  31260000
313600     IF AT-DMM-PVLY-GM-MTD(DMM-IDX1) = ZEROS                      31270000
313700        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         31280000
313800     ELSE                                                         31290000
313900        COMPUTE PV-PCT =                                          31300000
314000              ((AT-DMM-TY-GM-MTD(DMM-IDX1) -                      31310000
314100                AT-DMM-PVLY-GM-MTD(DMM-IDX1)) /                   31320000
314200                AT-DMM-PVLY-GM-MTD(DMM-IDX1)) * PC-HUNDRED        31330000
314300        COMPUTE DWL1-GM-MTD-AMT     ROUNDED = PV-PCT              31340000
314400     END-IF.                                                      31350000
314500                                                                  31360000
314600     IF AT-DMM-PVLY-INV-EOW(DMM-IDX1) = ZEROS                     31370000
314700        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        31380000
314800     ELSE                                                         31390000
314900        COMPUTE PV-PCT =                                          31400000
315000              ((AT-DMM-TY-INV-EOW(DMM-IDX1) -                     31410000
315100                AT-DMM-PVLY-INV-EOW(DMM-IDX1)) /                  31420000
315200                AT-DMM-PVLY-INV-EOW(DMM-IDX1)) * PC-HUNDRED       31430000
315300        COMPUTE DWL1-INV-EOW-AMT    ROUNDED = PV-PCT              31440000
315400     END-IF.                                                      31450000
315500                                                                  31460000
315600     IF AT-DMM-PVLY-MKDN-MTD(DMM-IDX1) = ZEROS                    31470000
315700        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       31480000
315800     ELSE                                                         31490000
315900        COMPUTE PV-PCT =                                          31500000
316000              ((AT-DMM-TY-MKDN-MTD(DMM-IDX1) -                    31510000
316100                AT-DMM-PVLY-MKDN-MTD(DMM-IDX1)) /                 31520000
316200                AT-DMM-PVLY-MKDN-MTD(DMM-IDX1)) * PC-HUNDRED      31530000
316300        COMPUTE DWL1-MKDN-MTD-AMT   ROUNDED = PV-PCT              31540000
316400     END-IF.                                                      31550000
316500                                                                  31560000
316600*    GM MTD %                                                     31570000
316700     IF AT-DMM-TY-SLS-MTD(DMM-IDX1)   = ZEROS OR                  31580000
316800        AT-DMM-PVLY-SLS-MTD(DMM-IDX1) = ZEROS                     31590000
316900        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         31600000
317000     ELSE                                                         31610000
317100        COMPUTE PV-PCT =                                          31620000
317200       ((AT-DMM-TY-GM-MTD(DMM-IDX1) * PC-HUNDRED) /               31630000
317300         AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                           31640000
317400       ((AT-DMM-PVLY-GM-MTD(DMM-IDX1) * PC-HUNDRED) /             31650000
317500         AT-DMM-PVLY-SLS-MTD(DMM-IDX1))                           31660000
317600        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  31670000
317700     END-IF.                                                      31680000
317800                                                                  31690000
317900*    MKDN MTD %                                                   31700000
318000     IF AT-DMM-TY-SLS-MTD(DMM-IDX1)   = ZEROS OR                  31710000
318100        AT-DMM-PVLY-SLS-MTD(DMM-IDX1) = ZEROS                     31720000
318200        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       31730000
318300     ELSE                                                         31740000
318400        COMPUTE PV-PCT =                                          31750000
318500       ((AT-DMM-TY-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /             31760000
318600         AT-DMM-TY-SLS-MTD(DMM-IDX1)) -                           31770000
318700       ((AT-DMM-PVLY-MKDN-MTD(DMM-IDX1) * PC-HUNDRED) /           31780000
318800         AT-DMM-PVLY-SLS-MTD(DMM-IDX1))                           31790000
318900        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                31800000
319000     END-IF.                                                      31810000
319100                                                                  31820000
319200*    MKON PURCH %                                                 31830000
319300     IF AT-DMM-TY-PRCH-RTL(DMM-IDX1)   = ZEROS OR                 31840000
319400        AT-DMM-PVLY-PRCH-RTL(DMM-IDX1) = ZEROS                    31850000
319500        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     31860000
319600     ELSE                                                         31870000
319700        COMPUTE PV-PCT =                                          31880000
319800       (((AT-DMM-TY-PRCH-RTL(DMM-IDX1) -                          31890000
319900          AT-DMM-TY-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /       31900000
320000          AT-DMM-TY-PRCH-RTL(DMM-IDX1)) -                         31910000
320100       (((AT-DMM-PVLY-PRCH-RTL(DMM-IDX1) -                        31920000
320200          AT-DMM-PVLY-PRCH-NET-CST(DMM-IDX1)) * PC-HUNDRED) /     31930000
320300          AT-DMM-PVLY-PRCH-RTL(DMM-IDX1))                         31940000
320400          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            31950000
320500     END-IF.                                                      31960000
320600                                                                  31970000
320700     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          31980000
320800                                                                  31990000
320900     MOVE SPACES TO DWL1-DETAIL-WK-LINE-1.                        32011048
321000     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          32012048
321100                                                                  32020000
321200***************************************************************** 32030000
321300*  PRINT REPORT PAGE 1 GMM TOTALS.                                32040000
321400******************************************************************32050000
321500 4200-PROCESS-GMM-PAGE1.                                          32060000
321600                                                                  32070000
321700*   *** ACTUALS ***                                               32080000
321800     MOVE PC-GMM-TOTAL                 TO DWL1-HEADING.           32090000
321900     MOVE PC-ACTUAL                    TO DWL1-TOTAL-DESC.        32100000
322000                                                                  32110000
322100*    WEEKLY SALES                                                 32120000
322200     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       32130000
322300                AT-GMM-TY-SLS-WK1(GMM-IDX1) /                     32140000
322400                PC-THOUSAND.                                      32150000
322500     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       32160000
322600                AT-GMM-TY-SLS-WK2(GMM-IDX1) /                     32170000
322700                PC-THOUSAND.                                      32180000
322800     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       32190000
322900                AT-GMM-TY-SLS-WK3(GMM-IDX1) /                     32200000
323000                PC-THOUSAND.                                      32210000
323100     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       32220000
323200                AT-GMM-TY-SLS-WK4(GMM-IDX1) /                     32230000
323300                PC-THOUSAND.                                      32240000
323400     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       32250000
323500                AT-GMM-TY-SLS-WK5(GMM-IDX1) /                     32260000
323600                PC-THOUSAND.                                      32270000
323700                                                                  32280000
323800*    MTD AMTS                                                     32290000
323900     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       32300000
324000                AT-GMM-TY-SLS-MTD(GMM-IDX1) /                     32310000
324100                PC-THOUSAND.                                      32320000
324200     MOVE AT-GMM-TY-SLS-MONTH(GMM-IDX1)                           32330000
324300                                     TO DWL1-SLS-MONTHLY.         32340000
324400     COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                      32350062
324500                AT-GMM-TY-COMP-SLS-MTD(GMM-IDX1) /                32360062
324600                PC-THOUSAND.                                      32370000
324700     COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                       32380000
324800                AT-GMM-TY-GM-MTD(GMM-IDX1) /                      32390000
324900                PC-THOUSAND.                                      32400000
325000     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       32410000
325100                AT-GMM-TY-INV-EOW(GMM-IDX1) /                     32420000
325200                PC-THOUSAND.                                      32430000
325300     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       32440000
325400                AT-GMM-TY-MKDN-MTD(GMM-IDX1) /                    32450000
325500                PC-THOUSAND.                                      32460000
325600*    GM MTD %                                                     32470000
325700     IF AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS                       32480000
325800        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         32490000
325900     ELSE                                                         32500000
326000        COMPUTE PV-PCT =                                          32510000
326100        (AT-GMM-TY-GM-MTD(GMM-IDX1) * PC-HUNDRED) /               32520000
326200         AT-GMM-TY-SLS-MTD(GMM-IDX1)                              32530000
326300        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  32540000
326400     END-IF.                                                      32550000
326500                                                                  32560000
326600*    MKDN MTD %                                                   32570000
326700     IF AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS                       32580000
326800        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       32590000
326900     ELSE                                                         32600000
327000        COMPUTE PV-PCT =                                          32610000
327100        (AT-GMM-TY-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /             32620000
327200         AT-GMM-TY-SLS-MTD(GMM-IDX1)                              32630000
327300        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                32640000
327400     END-IF.                                                      32650000
327500                                                                  32660000
327600*    MKON PURCH %                                                 32670000
327700     IF AT-GMM-TY-PRCH-RTL(GMM-IDX1) = ZEROS                      32680000
327800        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     32690000
327900     ELSE                                                         32700000
328000        COMPUTE PV-PCT =                                          32710000
328100        ((AT-GMM-TY-PRCH-RTL(GMM-IDX1) -                          32720000
328200          AT-GMM-TY-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       32730000
328300          AT-GMM-TY-PRCH-RTL(GMM-IDX1)                            32740000
328400          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            32750000
328500     END-IF.                                                      32760000
328600                                                                  32770000
328700     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          32780000
328800                                                                  32790000
328900*   *** FORECAST ***                                              32800000
329000     MOVE AT-GMM-DESC-PG1(GMM-IDX1)    TO DWL1-HEADING.           32810000
329100     MOVE PC-FCST                      TO DWL1-TOTAL-DESC.        32820000
329200                                                                  32830000
329300*    WEEKLY SALES                                                 32840000
329400     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       32850000
329500          AT-GMM-FC-SLS-WK1(GMM-IDX1).                            32860000
329600     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       32870000
329700          AT-GMM-FC-SLS-WK2(GMM-IDX1).                            32880000
329800     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       32890000
329900          AT-GMM-FC-SLS-WK3(GMM-IDX1).                            32900000
330000     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       32910000
330100          AT-GMM-FC-SLS-WK4(GMM-IDX1).                            32920000
330200     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       32930000
330300          AT-GMM-FC-SLS-WK5(GMM-IDX1).                            32940000
330400*    MTD AMTS                                                     32950000
330500     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       32960000
330600          AT-GMM-FC-SLS-MTD(GMM-IDX1).                            32970000
                                                                        32980000
277100*    ZERO MONTHLY SALES                                           32990000
           MOVE ZEROS                   TO DWL1-SLS-MONTHLY             33000000
                                                                        33010000
      *    SHOW FC MTD COMP SLS AND GM AT MONTH END ONLY                33011038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      33012038
              MOVE ZEROS             TO DWL1-COMP-SLS-MTD-AMT           33012162
                                        DWL1-GM-MTD-AMT                 33012239
           ELSE                                                         33013038
330900        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   33020062
331000             AT-GMM-FC-COMP-SLS-MTD(GMM-IDX1)                     33030062
331100        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    33040038
331200             AT-GMM-FC-GM-MTD(GMM-IDX1)                           33050038
           END-IF.                                                      33051038
                                                                        33052038
      *    ZERO FC EOW INVENTORY                                        33053079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               33054087
331300     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       33060087
331400          AT-GMM-FC-INV-EOW(GMM-IDX1).                            33070087
                                                                        33071079
331500     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       33080000
331600          AT-GMM-FC-MKDN-MTD(GMM-IDX1).                           33090000
331700                                                                  33100000
331800*    GM MTD %                                                     33110000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   33111042
331900        AT-GMM-FC-SLS-MTD(GMM-IDX1) = ZEROS                       33120042
332000        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         33130000
332100     ELSE                                                         33140000
332200        COMPUTE PV-PCT =                                          33150000
332300        (AT-GMM-FC-GM-MTD(GMM-IDX1) * PC-HUNDRED) /               33160000
332400         AT-GMM-FC-SLS-MTD(GMM-IDX1)                              33170000
332500        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  33180000
332600     END-IF.                                                      33190000
332700                                                                  33200000
332800*    MKDN MTD %                                                   33210000
332900     IF AT-GMM-FC-SLS-MTD(GMM-IDX1) = ZEROS                       33220000
333000        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       33230000
333100     ELSE                                                         33240000
333200        COMPUTE PV-PCT =                                          33250000
333300        (AT-GMM-FC-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /             33260000
333400         AT-GMM-FC-SLS-MTD(GMM-IDX1)                              33270000
333500        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                33280000
333600     END-IF.                                                      33290000
333700                                                                  33300000
333800*    MKON PURCH %                                                 33310000
333900     MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT.       33320000
334000*                                                                 33330000
334100* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           33340000
334200* =====================================================           33350000
334300*    IF AT-GMM-FC-PRCH-RTL(GMM-IDX1) = ZEROS                      33360000
334400*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     33370000
334500*    ELSE                                                         33380000
334600*       COMPUTE PV-PCT =                                          33390000
334700*       ((AT-GMM-FC-PRCH-RTL(GMM-IDX1) -                          33400000
334800*         AT-GMM-FC-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       33410000
334900*         AT-GMM-FC-PRCH-RTL(GMM-IDX1)                            33420000
335000*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            33430000
335100*    END-IF.                                                      33440000
335200                                                                  33450000
335300     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          33460000
335400                                                                  33470000
335500*   *** PLAN ***                                                  33480000
335600     MOVE AT-GMM-NAME-PG1(GMM-IDX1)    TO DWL1-HEADING.           33490000
335700     MOVE PC-PLAN                      TO DWL1-TOTAL-DESC.        33500000
335800                                                                  33510000
335900*    WEEKLY SALES                                                 33520000
336000     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       33530000
336100          AT-GMM-PL-SLS-WK1(GMM-IDX1).                            33540000
336200     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       33550000
336300          AT-GMM-PL-SLS-WK2(GMM-IDX1).                            33560000
336400     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       33570000
336500          AT-GMM-PL-SLS-WK3(GMM-IDX1).                            33580000
336600     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       33590000
336700          AT-GMM-PL-SLS-WK4(GMM-IDX1).                            33600000
336800     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       33610000
336900          AT-GMM-PL-SLS-WK5(GMM-IDX1).                            33620000
337000                                                                  33630000
337100     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       33640000
337200          AT-GMM-PL-SLS-MTD(GMM-IDX1).                            33650000
337300     COMPUTE DWL1-SLS-MONTHLY     ROUNDED =                       33660000
337400          AT-GMM-PL-SLS-MONTH(GMM-IDX1).                          33670000
                                                                        33670138
      *    SHOW PLAN MTD COMP SLS AND GM AT MONTH END ONLY              33671039
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      33672038
              MOVE ZEROS             TO DWL1-COMP-SLS-MTD-AMT           33673062
                                        DWL1-GM-MTD-AMT                 33673138
           ELSE                                                         33674038
330900        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   33675062
331000             AT-GMM-PL-COMP-SLS-MTD(GMM-IDX1)                     33676062
331100        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    33677038
331200             AT-GMM-PL-GM-MTD(GMM-IDX1)                           33678038
           END-IF.                                                      33679038
                                                                        33679138
337900     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       33720000
338000          AT-GMM-PL-INV-EOW(GMM-IDX1).                            33730000
338100     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       33740000
338200          AT-GMM-PL-MKDN-MTD(GMM-IDX1).                           33750000
338300                                                                  33760000
338400*    GM MTD %                                                     33770000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   33771042
338500        AT-GMM-PL-SLS-MTD(GMM-IDX1) = ZEROS                       33780042
338600        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         33790000
338700     ELSE                                                         33800000
338800        COMPUTE PV-PCT =                                          33810000
338900        (AT-GMM-PL-GM-MTD(GMM-IDX1) * PC-HUNDRED) /               33820000
339000         AT-GMM-PL-SLS-MTD(GMM-IDX1)                              33830000
339100        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  33840000
339200     END-IF.                                                      33850000
339300                                                                  33860000
339400*    MKDN MTD %                                                   33870000
339500     IF AT-GMM-PL-SLS-MTD(GMM-IDX1) = ZEROS                       33880000
339600        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       33890000
339700     ELSE                                                         33900000
339800        COMPUTE PV-PCT =                                          33910000
339900        (AT-GMM-PL-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /             33920000
340000         AT-GMM-PL-SLS-MTD(GMM-IDX1)                              33930000
340100        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                33940000
340200     END-IF.                                                      33950000
340300                                                                  33960000
264800*    MKON PURCH %                                                 33970000
265000     IF AT-GMM-PL-PRCH-RTL(GMM-IDX1) = ZEROS                      33980000
265100        MOVE ZEROS                  TO DWL1-MKON-PURCH-PCT        33990000
265200     ELSE                                                         34000000
265300        COMPUTE PV-PCT =                                          34010000
265400        ((AT-GMM-PL-PRCH-RTL(GMM-IDX1) -                          34020000
265500          AT-GMM-PL-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       34030000
265600          AT-GMM-PL-PRCH-RTL(GMM-IDX1)                            34040000
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            34050000
265800     END-IF.                                                      34051000
340600*                                                                 34052000
340700* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           34053000
340800* =====================================================           34054000
340900*    IF AT-GMM-PL-PRCH-RTL(GMM-IDX1) = ZEROS                      34055000
341000*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     34056000
341100*    ELSE                                                         34057000
341200*       COMPUTE PV-PCT =                                          34058000
341300*       ((AT-GMM-PL-PRCH-RTL(GMM-IDX1) -                          34059000
341400*         AT-GMM-PL-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       34060000
341500*         AT-GMM-PL-PRCH-RTL(GMM-IDX1)                            34070000
341600*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            34080000
341700*    END-IF.                                                      34090000
341800                                                                  34100000
341900     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          34110000
342000                                                                  34120000
342100*   *** VARIANCE FORECAST ***                                     34130000
342200     MOVE SPACES                       TO DWL1-HEADING.           34140000
342300     MOVE PC-VAR-FCST                  TO DWL1-TOTAL-DESC.        34150000
342400                                                                  34160000
267900*    WEEKLY SALES - ONLY SHOW THRU OPEN WEEK                      34171037
342600     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       34180000
342700         (AT-GMM-TY-SLS-WK1(GMM-IDX1) / PC-THOUSAND) -            34190000
342800          AT-GMM-FC-SLS-WK1(GMM-IDX1).                            34200000
                                                                        34200137
           IF SS-OPEN-WK < 2                                            34201037
              MOVE ZEROS             TO DWL1-SLS-WK2-AMT                34202037
           ELSE                                                         34203037
342900        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    34210037
343000            (AT-GMM-TY-SLS-WK2(GMM-IDX1) / PC-THOUSAND) -         34220037
343100             AT-GMM-FC-SLS-WK2(GMM-IDX1)                          34230037
           END-IF.                                                      34231037
                                                                        34232037
           IF SS-OPEN-WK < 3                                            34233037
              MOVE ZEROS             TO DWL1-SLS-WK3-AMT                34234037
           ELSE                                                         34235037
342900        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    34236037
343000            (AT-GMM-TY-SLS-WK3(GMM-IDX1) / PC-THOUSAND) -         34237037
343100             AT-GMM-FC-SLS-WK3(GMM-IDX1)                          34238037
           END-IF.                                                      34239037
                                                                        34239137
           IF SS-OPEN-WK < 4                                            34239237
              MOVE ZEROS             TO DWL1-SLS-WK4-AMT                34239337
           ELSE                                                         34239437
342900        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    34239537
343000            (AT-GMM-TY-SLS-WK4(GMM-IDX1) / PC-THOUSAND) -         34239637
343100             AT-GMM-FC-SLS-WK4(GMM-IDX1)                          34239737
           END-IF.                                                      34239837
                                                                        34239937
           IF SS-OPEN-WK < 5                                            34240037
              MOVE ZEROS             TO DWL1-SLS-WK5-AMT                34240137
           ELSE                                                         34240237
342900        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    34240337
343000            (AT-GMM-TY-SLS-WK5(GMM-IDX1) / PC-THOUSAND) -         34240437
343100             AT-GMM-FC-SLS-WK5(GMM-IDX1)                          34240537
           END-IF.                                                      34240637
                                                                        34240737
344100*    MTD AMTS                                                     34330000
344200     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       34340000
344300         (AT-GMM-TY-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -            34350000
344400          AT-GMM-FC-SLS-MTD(GMM-IDX1).                            34360000
344500                                                                  34370000
      *    ZERO MONTHLY SALES AND COMP SALES MTD                        34380000
344600     MOVE ZEROS         TO  DWL1-SLS-MONTHLY                      34390000
345000                            DWL1-COMP-SLS-MTD-AMT.                34400062
                                                                        34410000
      *    SHOW FC MTD GM AT MONTH END ONLY                             34411038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      34412038
              MOVE ZEROS             TO DWL1-GM-MTD-AMT                 34413038
           ELSE                                                         34415038
345400        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    34420038
345500            (AT-GMM-TY-GM-MTD(GMM-IDX1) / PC-THOUSAND) -          34430038
345600             AT-GMM-FC-GM-MTD(GMM-IDX1)                           34440038
           END-IF.                                                      34441038
                                                                        34442038
      *    ZERO VAR FC EOW INVENTORY                                    34443079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               34444087
345700     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       34450087
345800         (AT-GMM-TY-INV-EOW(GMM-IDX1) / PC-THOUSAND) -            34460087
345900          AT-GMM-FC-INV-EOW(GMM-IDX1).                            34470087
                                                                        34471079
346000     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       34480000
346100         (AT-GMM-TY-MKDN-MTD(GMM-IDX1) / PC-THOUSAND) -           34490000
346200          AT-GMM-FC-MKDN-MTD(GMM-IDX1).                           34500000
346300                                                                  34510000
346400*    GM MTD %                                                     34520000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   34521042
346500        AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS  OR                   34530042
346600        AT-GMM-FC-SLS-MTD(GMM-IDX1) = ZEROS                       34540000
346700        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         34550000
346800     ELSE                                                         34560000
346900        COMPUTE PV-PCT =                                          34570000
347000        ((AT-GMM-TY-GM-MTD(GMM-IDX1) * PC-HUNDRED) /              34580000
347100          AT-GMM-TY-SLS-MTD(GMM-IDX1) -                           34590000
347200         (AT-GMM-FC-GM-MTD(GMM-IDX1) * PC-HUNDRED) /              34600000
347300          AT-GMM-FC-SLS-MTD(GMM-IDX1))                            34610000
347400        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  34620000
347500     END-IF.                                                      34630000
347600                                                                  34640000
347700*    MKDN MTD %                                                   34650000
347800     IF AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS OR                    34660000
347900        AT-GMM-FC-SLS-MTD(GMM-IDX1) = ZEROS                       34670000
348000        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       34680000
348100     ELSE                                                         34690000
348200        COMPUTE PV-PCT =                                          34700000
348300        ((AT-GMM-TY-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /            34710000
348400          AT-GMM-TY-SLS-MTD(GMM-IDX1) -                           34720000
348500         (AT-GMM-FC-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /            34730000
348600          AT-GMM-FC-SLS-MTD(GMM-IDX1))                            34740000
348700        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                34750000
348800     END-IF.                                                      34760000
348900                                                                  34770000
349000*    MKON PURCH %                                                 34780000
349100     MOVE ZEROS                        TO DWL1-MKON-PURCH-PCT.    34790000
349200                                                                  34800000
349300     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          34810000
349400                                                                  34820000
349500*   *** VARIANCE PLAN ***                                         34830000
349600     MOVE SPACES                       TO DWL1-HEADING.           34840000
349700     MOVE PC-VAR-PL                    TO DWL1-TOTAL-DESC.        34850000
349800                                                                  34860000
267900*    WEEKLY SALES - ONLY SHOW THRU OPEN WEEK                      34861037
350000     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       34880000
350100         (AT-GMM-TY-SLS-WK1(GMM-IDX1) / PC-THOUSAND) -            34890000
350200          AT-GMM-PL-SLS-WK1(GMM-IDX1).                            34900000
                                                                        34900137
           IF SS-OPEN-WK < 2                                            34901037
              MOVE ZEROS             TO DWL1-SLS-WK2-AMT                34901137
           ELSE                                                         34902037
350300        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    34910037
350400            (AT-GMM-TY-SLS-WK2(GMM-IDX1) / PC-THOUSAND) -         34920037
350500             AT-GMM-PL-SLS-WK2(GMM-IDX1)                          34930037
           END-IF.                                                      34931037
                                                                        34931137
           IF SS-OPEN-WK < 3                                            34931237
              MOVE ZEROS             TO DWL1-SLS-WK3-AMT                34931337
           ELSE                                                         34931437
350300        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    34931537
350400            (AT-GMM-TY-SLS-WK3(GMM-IDX1) / PC-THOUSAND) -         34931637
350500             AT-GMM-PL-SLS-WK3(GMM-IDX1)                          34931737
           END-IF.                                                      34931837
                                                                        34931937
           IF SS-OPEN-WK < 4                                            34932037
              MOVE ZEROS             TO DWL1-SLS-WK4-AMT                34932137
           ELSE                                                         34932237
350300        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    34932337
350400            (AT-GMM-TY-SLS-WK4(GMM-IDX1) / PC-THOUSAND) -         34932437
350500             AT-GMM-PL-SLS-WK4(GMM-IDX1)                          34932537
           END-IF.                                                      34932637
                                                                        34932737
           IF SS-OPEN-WK < 5                                            34932837
              MOVE ZEROS             TO DWL1-SLS-WK5-AMT                34932937
           ELSE                                                         34933037
350300        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    34933137
350400            (AT-GMM-TY-SLS-WK5(GMM-IDX1) / PC-THOUSAND) -         34933237
350500             AT-GMM-PL-SLS-WK5(GMM-IDX1)                          34933337
           END-IF.                                                      34933437
                                                                        34934037
351500*    MTD AMTS                                                     35030000
351600     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       35040000
351700         (AT-GMM-TY-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -            35050000
351800          AT-GMM-PL-SLS-MTD(GMM-IDX1).                            35060000
351900                                                                  35070000
      *    ZERO MONTHLY SALES                                           35080000
352000     MOVE ZEROS         TO  DWL1-SLS-MONTHLY.                     35090000
352400                                                                  35100000
      *    SHOW PLAN MTD COMP SLS AND GM AT MONTH END ONLY              35101039
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      35102038
              MOVE ZEROS             TO DWL1-COMP-SLS-MTD-AMT           35103062
                                        DWL1-GM-MTD-AMT                 35103138
           ELSE                                                         35104038
352500        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   35110062
352600            (AT-GMM-TY-COMP-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -    35120062
352700             AT-GMM-PL-COMP-SLS-MTD(GMM-IDX1)                     35130062
352800        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    35130138
352900            (AT-GMM-TY-GM-MTD(GMM-IDX1) / PC-THOUSAND) -          35130238
353000             AT-GMM-PL-GM-MTD(GMM-IDX1)                           35130338
           END-IF.                                                      35131038
                                                                        35132038
353100     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       35170000
353200         (AT-GMM-TY-INV-EOW(GMM-IDX1) / PC-THOUSAND) -            35180000
353300          AT-GMM-PL-INV-EOW(GMM-IDX1).                            35190000
353400     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       35200000
353500         (AT-GMM-TY-MKDN-MTD(GMM-IDX1) / PC-THOUSAND) -           35210000
353600          AT-GMM-PL-MKDN-MTD(GMM-IDX1).                           35220000
353700                                                                  35230000
353800*    GM MTD %                                                     35240000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   35241042
353900        AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS  OR                   35250042
354000        AT-GMM-PL-SLS-MTD(GMM-IDX1) = ZEROS                       35260000
354100        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         35270000
354200     ELSE                                                         35280000
354300        COMPUTE PV-PCT =                                          35290000
354400        ((AT-GMM-TY-GM-MTD(GMM-IDX1) * PC-HUNDRED) /              35300000
354500          AT-GMM-TY-SLS-MTD(GMM-IDX1) -                           35310000
354600         (AT-GMM-PL-GM-MTD(GMM-IDX1) * PC-HUNDRED) /              35320000
354700          AT-GMM-PL-SLS-MTD(GMM-IDX1))                            35330000
354800        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  35340000
354900     END-IF.                                                      35350000
355000                                                                  35360000
355100*    MKDN MTD %                                                   35370000
355200     IF AT-GMM-TY-SLS-MTD(GMM-IDX1) = ZEROS OR                    35380000
355300        AT-GMM-PL-SLS-MTD(GMM-IDX1) = ZEROS                       35390000
355400        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       35400000
355500     ELSE                                                         35410000
355600        COMPUTE PV-PCT =                                          35420000
355700        ((AT-GMM-TY-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /            35430000
355800          AT-GMM-TY-SLS-MTD(GMM-IDX1)) -                          35440000
355900        ((AT-GMM-PL-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /            35450000
356000          AT-GMM-PL-SLS-MTD(GMM-IDX1))                            35460000
356100        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                35470000
356200     END-IF.                                                      35480000
356300                                                                  35490000
281500*    MKON PURCH %                                                 35511047
252100     IF AT-GMM-TY-PRCH-RTL(GMM-IDX1) = ZEROS OR                   35513044
265000        AT-GMM-PL-PRCH-RTL(GMM-IDX1) = ZEROS                      35514044
281600        MOVE ZEROS                   TO DWL1-MKON-PURCH-PCT       35515044
           ELSE                                                         35516044
252400        COMPUTE PV-PCT =                                          35517044
252500       (((AT-GMM-TY-PRCH-RTL(GMM-IDX1) -                          35518044
252600          AT-GMM-TY-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       35519044
252700          AT-GMM-TY-PRCH-RTL(GMM-IDX1)) -                         35519144
265400       (((AT-GMM-PL-PRCH-RTL(GMM-IDX1) -                          35519244
265500          AT-GMM-PL-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       35519344
265600          AT-GMM-PL-PRCH-RTL(GMM-IDX1))                           35519444
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            35519544
265800     END-IF.                                                      35519644
356600                                                                  35520000
356700     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          35530000
356800                                                                  35540000
356900*   *** PCT VARIANCE FORECAST ***                                 35550000
357000     MOVE SPACES                       TO DWL1-HEADING.           35560000
357100     MOVE PC-PVARFCST                  TO DWL1-TOTAL-DESC.        35570000
357200                                                                  35580000
357300*    WEEKLY SALES                                                 35590000
357400     IF AT-GMM-FC-SLS-WK1(GMM-IDX1) = ZEROS                       35600000
357500        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        35610000
357600     ELSE                                                         35620000
357700        COMPUTE PV-PCT =                                          35630000
357800        (((AT-GMM-TY-SLS-WK1(GMM-IDX1) / PC-THOUSAND) -           35640000
357900           AT-GMM-FC-SLS-WK1(GMM-IDX1)) /                         35650000
358000           AT-GMM-FC-SLS-WK1(GMM-IDX1)) * PC-HUNDRED              35660000
358100        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 35670000
358200     END-IF.                                                      35680000
                                                                        35681032
           IF SS-OPEN-WK < 2 OR                                         35691032
358400        AT-GMM-FC-SLS-WK2(GMM-IDX1) = ZEROS                       35700032
358500        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        35710000
358600     ELSE                                                         35720000
358700        COMPUTE PV-PCT =                                          35730000
358800        (((AT-GMM-TY-SLS-WK2(GMM-IDX1) / PC-THOUSAND) -           35740000
358900           AT-GMM-FC-SLS-WK2(GMM-IDX1)) /                         35750000
359000           AT-GMM-FC-SLS-WK2(GMM-IDX1)) * PC-HUNDRED              35760000
359100        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 35770000
359200     END-IF.                                                      35780000
359300                                                                  35790000
           IF SS-OPEN-WK < 3 OR                                         35791032
359400        AT-GMM-FC-SLS-WK3(GMM-IDX1) = ZEROS                       35800032
359500        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        35810000
359600     ELSE                                                         35820000
359700        COMPUTE PV-PCT =                                          35830000
359800        (((AT-GMM-TY-SLS-WK3(GMM-IDX1) / PC-THOUSAND) -           35840000
359900           AT-GMM-FC-SLS-WK3(GMM-IDX1)) /                         35850000
360000           AT-GMM-FC-SLS-WK3(GMM-IDX1)) * PC-HUNDRED              35860000
360100        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 35870000
360200     END-IF.                                                      35880000
360300                                                                  35890000
           IF SS-OPEN-WK < 4 OR                                         35891032
360400        AT-GMM-FC-SLS-WK4(GMM-IDX1) = ZEROS                       35900032
360500        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        35910000
360600     ELSE                                                         35920000
360700        COMPUTE PV-PCT =                                          35930000
360800        (((AT-GMM-TY-SLS-WK4(GMM-IDX1) / PC-THOUSAND) -           35940000
360900           AT-GMM-FC-SLS-WK4(GMM-IDX1)) /                         35950000
361000           AT-GMM-FC-SLS-WK4(GMM-IDX1)) * PC-HUNDRED              35960000
361100        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 35970000
361200     END-IF.                                                      35980000
361300                                                                  35990000
           IF SS-OPEN-WK < 5 OR                                         35991032
361400        AT-GMM-FC-SLS-WK5(GMM-IDX1) = ZEROS                       36000032
361500        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        36010000
361600     ELSE                                                         36020000
361700        COMPUTE PV-PCT =                                          36030000
361800        (((AT-GMM-TY-SLS-WK5(GMM-IDX1) / PC-THOUSAND) -           36040000
361900           AT-GMM-FC-SLS-WK5(GMM-IDX1)) /                         36050000
362000           AT-GMM-FC-SLS-WK5(GMM-IDX1)) * PC-HUNDRED              36060000
362100        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 36070000
362200     END-IF.                                                      36080000
362300                                                                  36090000
362400     IF AT-GMM-FC-SLS-MTD(GMM-IDX1) = ZEROS                       36100000
362500        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        36110000
362600     ELSE                                                         36120000
362700        COMPUTE PV-PCT =                                          36130000
362800        (((AT-GMM-TY-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -           36140000
362900           AT-GMM-FC-SLS-MTD(GMM-IDX1)) /                         36150000
363000           AT-GMM-FC-SLS-MTD(GMM-IDX1)) * PC-HUNDRED              36160000
363100        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 36170000
363200     END-IF.                                                      36180000
363300                                                                  36190000
363400     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       36200000
363500                                                                  36210000
      *    SHOW FC MTD COMP SLS AT MONTH END ONLY                       36211038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   36212038
363600        AT-GMM-FC-COMP-SLS-MTD(GMM-IDX1) = ZEROS                  36220062
363700        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   36230062
363800     ELSE                                                         36240000
363900        COMPUTE PV-PCT =                                          36250000
364000        (((AT-GMM-TY-COMP-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -      36260062
364100           AT-GMM-FC-COMP-SLS-MTD(GMM-IDX1)) /                    36270062
364200           AT-GMM-FC-COMP-SLS-MTD(GMM-IDX1)) * PC-HUNDRED         36280062
364300        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            36290062
364400     END-IF.                                                      36300000
364500                                                                  36310000
      *    SHOW FC MTD GM AT MONTH END ONLY                             36311038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   36312038
364600        AT-GMM-FC-GM-MTD(GMM-IDX1) = ZEROS                        36320038
364700        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         36330000
364800     ELSE                                                         36340000
364900        COMPUTE PV-PCT =                                          36350000
365000        (((AT-GMM-TY-GM-MTD(GMM-IDX1) / PC-THOUSAND) -            36360000
365100           AT-GMM-FC-GM-MTD(GMM-IDX1)) /                          36370000
365200           AT-GMM-FC-GM-MTD(GMM-IDX1)) * PC-HUNDRED               36380000
365300        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  36390000
365400     END-IF.                                                      36400000
365500                                                                  36410000
365600     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        36420000
365700                                                                  36430000
      *    ZERO % VAR FC EOW INVENTORY                                  36431079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               36432087
365800     IF AT-GMM-FC-INV-EOW(GMM-IDX1) = ZEROS                       36440087
365900        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        36450087
366000     ELSE                                                         36460087
366100        COMPUTE PV-PCT =                                          36470087
366200        (((AT-GMM-TY-INV-EOW(GMM-IDX1) / PC-THOUSAND) -           36480087
366300           AT-GMM-FC-INV-EOW(GMM-IDX1)) /                         36490087
366400           AT-GMM-FC-INV-EOW(GMM-IDX1)) * PC-HUNDRED              36500087
366500        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 36510087
366600     END-IF.                                                      36520087
366700                                                                  36530000
366800     IF AT-GMM-FC-MKDN-MTD(GMM-IDX1) = ZEROS                      36540000
366900        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       36550000
367000     ELSE                                                         36560000
367100        COMPUTE PV-PCT =                                          36570000
367200        (((AT-GMM-TY-MKDN-MTD(GMM-IDX1) / PC-THOUSAND) -          36580000
367300           AT-GMM-FC-MKDN-MTD(GMM-IDX1)) /                        36590000
367400           AT-GMM-FC-MKDN-MTD(GMM-IDX1)) * PC-HUNDRED             36600000
367500        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                36610000
367600     END-IF.                                                      36620000
367700                                                                  36630000
      *    ZERO MKDN MTD % AND MKON %                                   36640000
367800     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       36650000
367900                                          DWL1-MKON-PURCH-PCT.    36660000
368000                                                                  36670000
368100     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          36680000
368200                                                                  36690000
368300*   *** PCT VARIANCE PLAN ***                                     36700000
368400     MOVE SPACES                       TO DWL1-HEADING.           36710000
368500     MOVE PC-PVARPL                    TO DWL1-TOTAL-DESC.        36720000
368600                                                                  36730000
368700     IF AT-GMM-PL-SLS-WK1(GMM-IDX1) = ZEROS                       36740000
368800        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        36750000
368900     ELSE                                                         36760000
369000        COMPUTE PV-PCT =                                          36770000
369100        (((AT-GMM-TY-SLS-WK1(GMM-IDX1) / PC-THOUSAND) -           36780000
369200           AT-GMM-PL-SLS-WK1(GMM-IDX1)) /                         36790000
369300           AT-GMM-PL-SLS-WK1(GMM-IDX1)) * PC-HUNDRED              36800000
369400        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 36810000
369500     END-IF.                                                      36820000
369600                                                                  36830000
           IF SS-OPEN-WK < 2 OR                                         36832032
369700        AT-GMM-PL-SLS-WK2(GMM-IDX1) = ZEROS                       36840032
369800        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        36850000
369900     ELSE                                                         36860000
370000        COMPUTE PV-PCT =                                          36870000
370100        (((AT-GMM-TY-SLS-WK2(GMM-IDX1) / PC-THOUSAND) -           36880000
370200           AT-GMM-PL-SLS-WK2(GMM-IDX1)) /                         36890000
370300           AT-GMM-PL-SLS-WK2(GMM-IDX1)) * PC-HUNDRED              36900000
370400        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 36910000
370500     END-IF.                                                      36920000
370600                                                                  36930000
           IF SS-OPEN-WK < 3 OR                                         36931032
370700        AT-GMM-PL-SLS-WK3(GMM-IDX1) = ZEROS                       36940032
370800        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        36950000
370900     ELSE                                                         36960000
371000        COMPUTE PV-PCT =                                          36970000
371100        (((AT-GMM-TY-SLS-WK3(GMM-IDX1) / PC-THOUSAND) -           36980000
371200           AT-GMM-PL-SLS-WK3(GMM-IDX1)) /                         36990000
371300           AT-GMM-PL-SLS-WK3(GMM-IDX1)) * PC-HUNDRED              37000000
371400        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 37010000
371500     END-IF.                                                      37020000
371600                                                                  37030000
           IF SS-OPEN-WK < 4 OR                                         37031032
371700        AT-GMM-PL-SLS-WK4(GMM-IDX1) = ZEROS                       37040032
371800        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        37050000
371900     ELSE                                                         37060000
372000        COMPUTE PV-PCT =                                          37070000
372100        (((AT-GMM-TY-SLS-WK4(GMM-IDX1) / PC-THOUSAND) -           37080000
372200           AT-GMM-PL-SLS-WK4(GMM-IDX1)) /                         37090000
372300           AT-GMM-PL-SLS-WK4(GMM-IDX1)) * PC-HUNDRED              37100000
372400        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 37110000
372500     END-IF.                                                      37120000
372600                                                                  37130000
           IF SS-OPEN-WK < 5 OR                                         37131032
372700        AT-GMM-PL-SLS-WK5(GMM-IDX1) = ZEROS                       37140032
372800        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        37150000
372900     ELSE                                                         37160000
373000        COMPUTE PV-PCT =                                          37170000
373100        (((AT-GMM-TY-SLS-WK5(GMM-IDX1) / PC-THOUSAND) -           37180000
373200           AT-GMM-PL-SLS-WK5(GMM-IDX1)) /                         37190000
373300           AT-GMM-PL-SLS-WK5(GMM-IDX1)) * PC-HUNDRED              37200000
373400        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 37210000
373500     END-IF.                                                      37220000
373600                                                                  37230000
373700     IF AT-GMM-PL-SLS-MTD(GMM-IDX1) = ZEROS                       37240000
373800        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        37250000
373900     ELSE                                                         37260000
374000        COMPUTE PV-PCT =                                          37270000
374100        (((AT-GMM-TY-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -           37280000
374200           AT-GMM-PL-SLS-MTD(GMM-IDX1)) /                         37290000
374300           AT-GMM-PL-SLS-MTD(GMM-IDX1)) * PC-HUNDRED              37300000
374400        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 37310000
374500     END-IF.                                                      37320000
374600                                                                  37330000
      *    ZERO MONTHLY SALES                                           37340000
374700     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       37350000
374800                                                                  37360000
      *    SHOW PLAN COMP SLS AT MONTH END ONLY                         37361038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   37362038
374900        AT-GMM-PL-COMP-SLS-MTD(GMM-IDX1) = ZEROS                  37370062
375000        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   37380062
375100     ELSE                                                         37390000
375200        COMPUTE PV-PCT =                                          37400000
375300        (((AT-GMM-TY-COMP-SLS-MTD(GMM-IDX1) / PC-THOUSAND) -      37410062
375400           AT-GMM-PL-COMP-SLS-MTD(GMM-IDX1)) /                    37420062
375500           AT-GMM-PL-COMP-SLS-MTD(GMM-IDX1)) * PC-HUNDRED         37430062
375600        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            37440062
375700     END-IF.                                                      37450000
375800                                                                  37460000
      *    SHOW PLAN GM AT MONTH END ONLY                               37461038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   37462038
375900        AT-GMM-PL-GM-MTD(GMM-IDX1) = ZEROS                        37470038
376000        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         37480000
376100     ELSE                                                         37490000
376200        COMPUTE PV-PCT =                                          37500000
376300        (((AT-GMM-TY-GM-MTD(GMM-IDX1) / PC-THOUSAND) -            37510000
376400           AT-GMM-PL-GM-MTD(GMM-IDX1)) /                          37520000
376500           AT-GMM-PL-GM-MTD(GMM-IDX1)) * PC-HUNDRED               37530000
376600        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  37540000
376700     END-IF.                                                      37550000
376800                                                                  37560000
      *    ZERO GM MTD %                                                37570000
376900     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        37580000
377000                                                                  37590000
377100     IF AT-GMM-PL-INV-EOW(GMM-IDX1) = ZEROS                       37600000
377200        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        37610000
377300     ELSE                                                         37620000
377400        COMPUTE PV-PCT =                                          37630000
377500        (((AT-GMM-TY-INV-EOW(GMM-IDX1) / PC-THOUSAND) -           37640000
377600           AT-GMM-PL-INV-EOW(GMM-IDX1)) /                         37650000
377700           AT-GMM-PL-INV-EOW(GMM-IDX1)) * PC-HUNDRED              37660000
377800        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 37670000
377900     END-IF.                                                      37680000
378000                                                                  37690000
378100     IF AT-GMM-PL-MKDN-MTD(GMM-IDX1) = ZEROS                      37700000
378200        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       37710000
378300     ELSE                                                         37720000
378400        COMPUTE PV-PCT =                                          37730000
378500        (((AT-GMM-TY-MKDN-MTD(GMM-IDX1) / PC-THOUSAND) -          37740000
378600           AT-GMM-PL-MKDN-MTD(GMM-IDX1)) /                        37750000
378700           AT-GMM-PL-MKDN-MTD(GMM-IDX1)) * PC-HUNDRED             37760000
378800        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                37770000
378900     END-IF.                                                      37780000
379000                                                                  37790000
379100     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       37800000
379200                                          DWL1-MKON-PURCH-PCT.    37810000
379300                                                                  37820000
379400     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          37830000
379500                                                                  37840000
379600*   *** PCT VARIANCE LAST YR ***                                  37850000
379700     MOVE SPACES                        TO DWL1-HEADING.          37860000
379800     MOVE PC-PVARLY                     TO DWL1-TOTAL-DESC.       37870000
379900                                                                  37880000
380000     IF AT-GMM-PVLY-SLS-WK1(GMM-IDX1) = ZEROS                     37890000
380100        MOVE ZEROS                TO DWL1-SLS-WK1-AMT             37900000
380200     ELSE                                                         37910000
380300        COMPUTE PV-PCT =                                          37920000
380400              ((AT-GMM-TY-SLS-WK1(GMM-IDX1) -                     37930000
380500                AT-GMM-PVLY-SLS-WK1(GMM-IDX1)) /                  37940000
380600                AT-GMM-PVLY-SLS-WK1(GMM-IDX1)) * PC-HUNDRED       37950000
380700        COMPUTE DWL1-SLS-WK1-AMT     ROUNDED = PV-PCT             37960000
380800     END-IF.                                                      37970000
380900                                                                  37980000
381000     IF AT-GMM-PVLY-SLS-WK2(GMM-IDX1) = ZEROS                     37990000
381100        MOVE ZEROS                TO DWL1-SLS-WK2-AMT             38000000
381200     ELSE                                                         38010000
381300        COMPUTE PV-PCT =                                          38020000
381400              ((AT-GMM-TY-SLS-WK2(GMM-IDX1) -                     38030000
381500                AT-GMM-PVLY-SLS-WK2(GMM-IDX1)) /                  38040000
381600                AT-GMM-PVLY-SLS-WK2(GMM-IDX1)) * PC-HUNDRED       38050000
381700        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED = PV-PCT             38060000
381800     END-IF.                                                      38070000
381900                                                                  38080000
382000     IF AT-GMM-PVLY-SLS-WK3(GMM-IDX1) = ZEROS                     38090000
382100        MOVE ZEROS                TO DWL1-SLS-WK3-AMT             38100000
382200     ELSE                                                         38110000
382300        COMPUTE PV-PCT =                                          38120000
382400              ((AT-GMM-TY-SLS-WK3(GMM-IDX1) -                     38130000
382500                AT-GMM-PVLY-SLS-WK3(GMM-IDX1)) /                  38140000
382600                AT-GMM-PVLY-SLS-WK3(GMM-IDX1)) * PC-HUNDRED       38150000
382700        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED = PV-PCT             38160000
382800     END-IF.                                                      38170000
382900                                                                  38180000
383000     IF AT-GMM-PVLY-SLS-WK4(GMM-IDX1) = ZEROS                     38190000
383100        MOVE ZEROS                TO DWL1-SLS-WK4-AMT             38200000
383200     ELSE                                                         38210000
383300        COMPUTE PV-PCT =                                          38220000
383400              ((AT-GMM-TY-SLS-WK4(GMM-IDX1) -                     38230000
383500                AT-GMM-PVLY-SLS-WK4(GMM-IDX1)) /                  38240000
383600                AT-GMM-PVLY-SLS-WK4(GMM-IDX1)) * PC-HUNDRED       38250000
383700        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED = PV-PCT             38260000
383800     END-IF.                                                      38270000
383900                                                                  38280000
384000     IF AT-GMM-PVLY-SLS-WK5(GMM-IDX1) = ZEROS                     38290000
384100        MOVE ZEROS                TO DWL1-SLS-WK5-AMT             38300000
384200     ELSE                                                         38310000
384300        COMPUTE PV-PCT =                                          38320000
384400              ((AT-GMM-TY-SLS-WK5(GMM-IDX1) -                     38330000
384500                AT-GMM-PVLY-SLS-WK5(GMM-IDX1)) /                  38340000
384600                AT-GMM-PVLY-SLS-WK5(GMM-IDX1)) * PC-HUNDRED       38350000
384700        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED = PV-PCT             38360000
384800     END-IF.                                                      38370000
384900                                                                  38380000
385000     IF AT-GMM-PVLY-SLS-MTD(GMM-IDX1) = ZEROS                     38390000
385100        MOVE ZEROS                TO DWL1-SLS-MTD-AMT             38400000
385200     ELSE                                                         38410000
385300        COMPUTE PV-PCT =                                          38420000
385400              ((AT-GMM-TY-SLS-MTD(GMM-IDX1) -                     38430000
385500                AT-GMM-PVLY-SLS-MTD(GMM-IDX1)) /                  38440000
385600                AT-GMM-PVLY-SLS-MTD(GMM-IDX1)) * PC-HUNDRED       38450000
385700        COMPUTE DWL1-SLS-MTD-AMT     ROUNDED = PV-PCT             38460000
385800     END-IF.                                                      38470000
385900                                                                  38480000
311500***  USE PLAN SALES FOR MONTH % VARIANCE LY                       38490000
386000     IF AT-GMM-PVLY-SLS-MONTH(GMM-IDX1) = ZEROS                   38500000
386100        MOVE ZEROS                TO DWL1-SLS-MONTHLY             38510000
386200     ELSE                                                         38520000
386300        COMPUTE PV-PCT =                                          38530000
312000              ((AT-GMM-PL-SLS-MONTH(GMM-IDX1) -                   38540000
312100               (AT-GMM-PVLY-SLS-MONTH(GMM-IDX1) / PC-THOUSAND)) / 38550000
312100               (AT-GMM-PVLY-SLS-MONTH(GMM-IDX1) / PC-THOUSAND)) * 38560000
312200                PC-HUNDRED                                        38570000
386700        COMPUTE DWL1-SLS-MONTHLY ROUNDED = PV-PCT                 38580000
386800     END-IF.                                                      38590000
386900                                                                  38600000
387000     IF AT-GMM-PVLY-COMP-SLS-MTD(GMM-IDX1) = ZEROS                38610062
387100        MOVE ZEROS                TO DWL1-COMP-SLS-MTD-AMT        38620062
387200     ELSE                                                         38630000
387300        COMPUTE PV-PCT =                                          38640000
387400              ((AT-GMM-TY-COMP-SLS-MTD(GMM-IDX1) -                38650062
387500                AT-GMM-PVLY-COMP-SLS-MTD(GMM-IDX1)) /             38660062
387600                AT-GMM-PVLY-COMP-SLS-MTD(GMM-IDX1)) * PC-HUNDRED  38670062
387700        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            38680062
387800     END-IF.                                                      38690000
387900                                                                  38700000
388000     IF AT-GMM-PVLY-GM-MTD(GMM-IDX1) = ZEROS                      38710000
388100        MOVE ZEROS                TO DWL1-GM-MTD-AMT              38720000
388200     ELSE                                                         38730000
388300        COMPUTE PV-PCT =                                          38740000
388400              ((AT-GMM-TY-GM-MTD(GMM-IDX1) -                      38750000
388500                AT-GMM-PVLY-GM-MTD(GMM-IDX1)) /                   38760000
388600                AT-GMM-PVLY-GM-MTD(GMM-IDX1)) * PC-HUNDRED        38770000
388700        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  38780000
388800     END-IF.                                                      38790000
388900                                                                  38800000
389000     IF AT-GMM-PVLY-INV-EOW(GMM-IDX1) = ZEROS                     38810000
389100        MOVE ZEROS                TO DWL1-INV-EOW-AMT             38820000
389200     ELSE                                                         38830000
389300        COMPUTE PV-PCT =                                          38840000
389400              ((AT-GMM-TY-INV-EOW(GMM-IDX1) -                     38850000
389500                AT-GMM-PVLY-INV-EOW(GMM-IDX1)) /                  38860000
389600                AT-GMM-PVLY-INV-EOW(GMM-IDX1)) * PC-HUNDRED       38870000
389700        COMPUTE DWL1-INV-EOW-AMT     ROUNDED = PV-PCT             38880000
389800     END-IF.                                                      38890000
389900                                                                  38900000
390000     IF AT-GMM-PVLY-MKDN-MTD(GMM-IDX1) = ZEROS                    38910000
390100        MOVE ZEROS                TO DWL1-MKDN-MTD-AMT            38920000
390200     ELSE                                                         38930000
390300        COMPUTE PV-PCT =                                          38940000
390400              ((AT-GMM-TY-MKDN-MTD(GMM-IDX1) -                    38950000
390500                AT-GMM-PVLY-MKDN-MTD(GMM-IDX1)) /                 38960000
390600                AT-GMM-PVLY-MKDN-MTD(GMM-IDX1)) * PC-HUNDRED      38970000
390700        COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED = PV-PCT             38980000
390800     END-IF.                                                      38990000
390900                                                                  39000000
391000*    GM MTD %                                                     39010000
391100     IF AT-GMM-TY-SLS-MTD(GMM-IDX1)   = ZEROS OR                  39020000
391200        AT-GMM-PVLY-SLS-MTD(GMM-IDX1) = ZEROS                     39030000
391300        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         39040000
391400     ELSE                                                         39050000
391500        COMPUTE PV-PCT =                                          39060000
391600       ((AT-GMM-TY-GM-MTD(GMM-IDX1) * PC-HUNDRED) /               39070000
391700         AT-GMM-TY-SLS-MTD(GMM-IDX1)) -                           39080000
391800       ((AT-GMM-PVLY-GM-MTD(GMM-IDX1) * PC-HUNDRED) /             39090000
391900         AT-GMM-PVLY-SLS-MTD(GMM-IDX1))                           39100000
392000        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  39110000
392100     END-IF.                                                      39120000
392200                                                                  39130000
392300*    MKDN MTD %                                                   39140000
392400     IF AT-GMM-TY-SLS-MTD(GMM-IDX1)   = ZEROS OR                  39150000
392500        AT-GMM-PVLY-SLS-MTD(GMM-IDX1) = ZEROS                     39160000
392600        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       39170000
392700     ELSE                                                         39180000
392800        COMPUTE PV-PCT =                                          39190000
392900       ((AT-GMM-TY-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /             39200000
393000         AT-GMM-TY-SLS-MTD(GMM-IDX1)) -                           39210000
393100       ((AT-GMM-PVLY-MKDN-MTD(GMM-IDX1) * PC-HUNDRED) /           39220000
393200         AT-GMM-PVLY-SLS-MTD(GMM-IDX1))                           39230000
393300        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                39240000
393400     END-IF.                                                      39250000
393500                                                                  39260000
393600*    MKON PURCH %                                                 39270000
393700     IF AT-GMM-TY-PRCH-RTL(GMM-IDX1)   = ZEROS OR                 39280000
393800        AT-GMM-PVLY-PRCH-RTL(GMM-IDX1) = ZEROS                    39290000
393900        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     39300000
394000     ELSE                                                         39310000
394100        COMPUTE PV-PCT =                                          39320000
394200       (((AT-GMM-TY-PRCH-RTL(GMM-IDX1) -                          39330000
394300          AT-GMM-TY-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /       39340000
394400          AT-GMM-TY-PRCH-RTL(GMM-IDX1)) -                         39350000
394500       (((AT-GMM-PVLY-PRCH-RTL(GMM-IDX1) -                        39360000
394600          AT-GMM-PVLY-PRCH-NET-CST(GMM-IDX1)) * PC-HUNDRED) /     39370000
394700          AT-GMM-PVLY-PRCH-RTL(GMM-IDX1))                         39380000
394800          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            39390000
394900     END-IF.                                                      39400000
395000                                                                  39410000
395100     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          39420000
395200                                                                  39430000
395300     MOVE SPACES TO DWL1-DETAIL-WK-LINE-1.                        39440000
395400     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          39450000
395500                                                                  39460000
395600     SET GMM-IDX1 UP BY 1.                                        39470000
395700     MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-1.          39480000
395800                                                                  39490000
395900***************************************************************** 39500000
396000*  PRINT REPORT PAGE 1 COMPANY TOTALS.                            39510000
396100******************************************************************39520000
396200 4300-PROCESS-CMPY-PG1-TOTS.                                      39530000
396300                                                                  39540000
396400*   *** ACTUALS ***                                               39550000
396500     MOVE PC-TOTAL-KOHLS               TO DWL1-HEADING.           39560000
396600     MOVE PC-ACTUAL                    TO DWL1-TOTAL-DESC.        39570000
396700     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       39580000
396800                AT-CMPY-TY-SLS-WK1 /                              39590000
396900                PC-THOUSAND.                                      39600000
397000     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       39610000
397100                AT-CMPY-TY-SLS-WK2 /                              39620000
397200                PC-THOUSAND.                                      39630000
397300     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       39640000
397400                AT-CMPY-TY-SLS-WK3 /                              39650000
397500                PC-THOUSAND.                                      39660000
397600     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       39670000
397700                AT-CMPY-TY-SLS-WK4 /                              39680000
397800                PC-THOUSAND.                                      39690000
397900     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       39700000
398000                AT-CMPY-TY-SLS-WK5 /                              39710000
398100                PC-THOUSAND.                                      39720000
398200     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       39730000
398300                AT-CMPY-TY-SLS-MTD /                              39740000
398400                PC-THOUSAND.                                      39750000
398500                                                                  39760000
398600     MOVE ZEROS                      TO DWL1-SLS-MONTHLY.         39780000
398700                                                                  39790000
398800     COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                      39800062
398900                AT-CMPY-TY-COMP-SLS-MTD /                         39810062
399000                PC-THOUSAND.                                      39820000
399100                                                                  39830000
399200     COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                       39840000
399300                AT-CMPY-TY-GM-MTD /                               39850000
399400                PC-THOUSAND.                                      39860000
399500                                                                  39870000
399600     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       39880000
399700                AT-CMPY-TY-INV-EOW /                              39890000
399800                PC-THOUSAND.                                      39900000
399900                                                                  39910000
400000     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       39920000
400100                AT-CMPY-TY-MKDN-MTD /                             39930000
400200                PC-THOUSAND.                                      39940000
400300                                                                  39950000
400400*    GM MTD %                                                     39960000
400500     IF AT-CMPY-TY-SLS-MTD = ZEROS                                39970000
400600        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         39980000
400700     ELSE                                                         39990000
400800        COMPUTE PV-PCT =                                          40000000
400900        (AT-CMPY-TY-GM-MTD * PC-HUNDRED) /                        40010000
401000         AT-CMPY-TY-SLS-MTD                                       40020000
401100        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  40030000
401200     END-IF.                                                      40040000
401300                                                                  40050000
401400*    MKDN MTD %                                                   40060000
401500     IF AT-CMPY-TY-SLS-MTD = ZEROS                                40070000
401600        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       40080000
401700     ELSE                                                         40090000
401800        COMPUTE PV-PCT =                                          40100000
401900        (AT-CMPY-TY-MKDN-MTD * PC-HUNDRED) /                      40110000
402000         AT-CMPY-TY-SLS-MTD                                       40120000
402100        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                40130000
402200     END-IF.                                                      40140000
402300                                                                  40150000
402400*    MKON PURCH %                                                 40160000
402500     IF AT-CMPY-TY-PRCH-RTL = ZEROS                               40170000
402600        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     40180000
402700     ELSE                                                         40190000
402800        COMPUTE PV-PCT =                                          40200000
402900        ((AT-CMPY-TY-PRCH-RTL -                                   40210000
403000          AT-CMPY-TY-PRCH-NET-CST) * PC-HUNDRED) /                40220000
403100          AT-CMPY-TY-PRCH-RTL                                     40230000
403200          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            40240000
403300     END-IF.                                                      40250000
403400                                                                  40260000
403500     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          40270000
403600                                                                  40280000
403700*   *** FORECAST ***                                              40290000
403800     MOVE SPACES                       TO DWL1-HEADING.           40300000
403900     MOVE PC-FCST                      TO DWL1-TOTAL-DESC.        40310000
404000                                                                  40320000
404100     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       40330000
404200          AT-CMPY-FC-SLS-WK1.                                     40340000
404300     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       40350000
404400          AT-CMPY-FC-SLS-WK2.                                     40360000
404500     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       40370000
404600          AT-CMPY-FC-SLS-WK3.                                     40380000
404700     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       40390000
404800          AT-CMPY-FC-SLS-WK4.                                     40400000
404900     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       40410000
405000          AT-CMPY-FC-SLS-WK5.                                     40420000
405100                                                                  40430000
405200     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       40440000
405300          AT-CMPY-FC-SLS-MTD.                                     40450000
                                                                        40460000
405400     MOVE ZEROS              TO DWL1-SLS-MONTHLY.                 40470000
405400*    COMPUTE DWL1-SLS-MONTHLY     ROUNDED =                       40480000
405500*         AT-CMPY-FC-SLS-MONTH.                                   40490000
                                                                        40500000
      *    SHOW FC COMP SLS AND GM AT MONTH END ONLY                    40501038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      40502039
              MOVE ZEROS              TO DWL1-COMP-SLS-MTD-AMT          40502162
                                         DWL1-GM-MTD-AMT                40502238
           ELSE                                                         40503038
405600        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   40510062
405700             AT-CMPY-FC-COMP-SLS-MTD                              40520062
405800        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    40530038
405900             AT-CMPY-FC-GM-MTD                                    40540038
           END-IF.                                                      40541038
                                                                        40542038
      *    ZERO FC EOW INVENTORY                                        40543079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               40544087
406000     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       40550087
406100          AT-CMPY-FC-INV-EOW.                                     40560087
                                                                        40561079
406200     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       40570000
406300          AT-CMPY-FC-MKDN-MTD.                                    40580000
406400                                                                  40590000
406500*    GM MTD %                                                     40600000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   40601042
406600        AT-CMPY-FC-SLS-MTD = ZEROS                                40610042
406700        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         40620000
406800     ELSE                                                         40630000
406900        COMPUTE PV-PCT =                                          40640000
407000        (AT-CMPY-FC-GM-MTD * PC-HUNDRED) /                        40650000
407100         AT-CMPY-FC-SLS-MTD                                       40660000
407200        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  40670000
407300     END-IF.                                                      40680000
407400                                                                  40690000
407500*    MKDN MTD %                                                   40700000
407600     IF AT-CMPY-FC-SLS-MTD = ZEROS                                40710000
407700        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       40720000
407800     ELSE                                                         40730000
407900        COMPUTE PV-PCT =                                          40740000
408000        (AT-CMPY-FC-MKDN-MTD * PC-HUNDRED) /                      40750000
408100         AT-CMPY-FC-SLS-MTD                                       40760000
408200        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                40770000
408300     END-IF.                                                      40780000
408400                                                                  40790000
408500*    MKON PURCH %                                                 40800000
408600     MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT.       40810000
408700*                                                                 40820000
408800* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           40830000
408900* =====================================================           40840000
409000*    IF AT-CMPY-FC-PRCH-RTL = ZEROS                               40850000
409100*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     40860000
409200*    ELSE                                                         40870000
409300*       COMPUTE PV-PCT =                                          40880000
409400*       ((AT-CMPY-FC-PRCH-RTL -                                   40890000
409500*         AT-CMPY-FC-PRCH-NET-CST) * PC-HUNDRED) /                40900000
409600*         AT-CMPY-FC-PRCH-RTL                                     40910000
409700*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            40920000
409800*    END-IF.                                                      40930000
409900                                                                  40940000
410000     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          40950000
410100                                                                  40960000
410200*   *** PLAN ***                                                  40970000
410300     MOVE SPACES                       TO DWL1-HEADING.           40980000
410400     MOVE PC-PLAN                      TO DWL1-TOTAL-DESC.        40990000
410500                                                                  41000000
410600     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       41010000
410700          AT-CMPY-PL-SLS-WK1.                                     41020000
410800     COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                       41030000
410900          AT-CMPY-PL-SLS-WK2.                                     41040000
411000     COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                       41050000
411100          AT-CMPY-PL-SLS-WK3.                                     41060000
411200     COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                       41070000
411300          AT-CMPY-PL-SLS-WK4.                                     41080000
411400     COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                       41090000
411500          AT-CMPY-PL-SLS-WK5.                                     41100000
411600                                                                  41110000
411700     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       41120000
411800          AT-CMPY-PL-SLS-MTD.                                     41130000
411900     COMPUTE DWL1-SLS-MONTHLY     ROUNDED =                       41140000
412000          AT-CMPY-PL-SLS-MONTH.                                   41150000
                                                                        41150138
      *    SHOW PLAN COMP SLS AND GM AT MONTH END ONLY                  41151038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      41152039
              MOVE ZEROS              TO DWL1-COMP-SLS-MTD-AMT          41153062
                                         DWL1-GM-MTD-AMT                41154038
           ELSE                                                         41155038
412100        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   41160062
412200             AT-CMPY-PL-COMP-SLS-MTD                              41170062
412300        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    41180038
412400             AT-CMPY-PL-GM-MTD                                    41190038
           END-IF.                                                      41191038
                                                                        41192038
 12500     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       41200038
412600          AT-CMPY-PL-INV-EOW.                                     41210000
412700     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       41220000
412800          AT-CMPY-PL-MKDN-MTD.                                    41230000
412900                                                                  41240000
413000*    GM MTD %                                                     41250000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   41251042
413100        AT-CMPY-PL-SLS-MTD = ZEROS                                41260042
413200        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         41270000
413300     ELSE                                                         41280000
413400        COMPUTE PV-PCT =                                          41290000
413500        (AT-CMPY-PL-GM-MTD * PC-HUNDRED) /                        41300000
413600         AT-CMPY-PL-SLS-MTD                                       41310000
413700        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  41320000
413800     END-IF.                                                      41330000
413900                                                                  41340000
414000*    MKDN MTD %                                                   41350000
414100     IF AT-CMPY-PL-SLS-MTD = ZEROS                                41360000
414200        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       41370000
414300     ELSE                                                         41380000
414400        COMPUTE PV-PCT =                                          41390000
414500        (AT-CMPY-PL-MKDN-MTD * PC-HUNDRED) /                      41400000
414600         AT-CMPY-PL-SLS-MTD                                       41410000
414700        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                41420000
414800     END-IF.                                                      41430000
414900                                                                  41440000
415000*    MKON PURCH %                                                 41450000
415100     MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT.       41460000
415200*                                                                 41470000
415300* FUTURE WHEN XFERS AND MKUPS ARE AVAIL FOR FCS AND PLN           41480000
415400* =====================================================           41490000
415500*    IF AT-CMPY-PL-PRCH-RTL = ZEROS                               41500000
415600*       MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     41510000
415700*    ELSE                                                         41520000
415800*       COMPUTE PV-PCT =                                          41530000
415900*       ((AT-CMPY-PL-PRCH-RTL -                                   41540000
416000*         AT-CMPY-PL-PRCH-NET-CST) * PC-HUNDRED) /                41550000
416100*         AT-CMPY-PL-PRCH-RTL                                     41560000
416200*         COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            41570000
416300*    END-IF.                                                      41580000
                                                                        41581026
264800*    MKON PURCH %                                                 41590000
265000     IF AT-CMPY-PL-PRCH-RTL = ZEROS                               41600000
265100        MOVE ZEROS                  TO DWL1-MKON-PURCH-PCT        41610000
265200     ELSE                                                         41620000
265300        COMPUTE PV-PCT =                                          41630000
265400        ((AT-CMPY-PL-PRCH-RTL -                                   41631000
265500          AT-CMPY-PL-PRCH-NET-CST) * PC-HUNDRED) /                41632000
265600          AT-CMPY-PL-PRCH-RTL                                     41633000
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            41634000
265800     END-IF.                                                      41635000
416400                                                                  41636000
416500     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          41637000
416600                                                                  41638000
416700*   *** VARIANCE FORECAST ***                                     41639000
416800     MOVE SPACES                       TO DWL1-HEADING.           41640000
416900     MOVE PC-VAR-FCST                  TO DWL1-TOTAL-DESC.        41650000
417000                                                                  41660000
417100     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       41670000
417200         (AT-CMPY-TY-SLS-WK1 / PC-THOUSAND) -                     41680000
417300          AT-CMPY-FC-SLS-WK1.                                     41690000
                                                                        41690137
           IF SS-OPEN-WK < 2                                            41691037
              MOVE ZEROS             TO DWL1-SLS-WK2-AMT                41692037
           ELSE                                                         41693037
417400        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    41700037
417500            (AT-CMPY-TY-SLS-WK2 / PC-THOUSAND) -                  41710037
417600             AT-CMPY-FC-SLS-WK2                                   41720037
           END-IF.                                                      41721037
                                                                        41721137
           IF SS-OPEN-WK < 3                                            41721237
              MOVE ZEROS             TO DWL1-SLS-WK3-AMT                41721337
           ELSE                                                         41721437
417400        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    41721537
417500            (AT-CMPY-TY-SLS-WK3 / PC-THOUSAND) -                  41721637
417600             AT-CMPY-FC-SLS-WK3                                   41721737
           END-IF.                                                      41721837
                                                                        41721937
           IF SS-OPEN-WK < 4                                            41722037
              MOVE ZEROS             TO DWL1-SLS-WK4-AMT                41722137
           ELSE                                                         41722237
417400        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    41722337
417500            (AT-CMPY-TY-SLS-WK4 / PC-THOUSAND) -                  41722437
417600             AT-CMPY-FC-SLS-WK4                                   41722537
           END-IF.                                                      41722637
                                                                        41722737
           IF SS-OPEN-WK < 5                                            41722837
              MOVE ZEROS             TO DWL1-SLS-WK5-AMT                41722937
           ELSE                                                         41723037
417400        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    41723137
417500            (AT-CMPY-TY-SLS-WK5 / PC-THOUSAND) -                  41723237
417600             AT-CMPY-FC-SLS-WK5                                   41723337
           END-IF.                                                      41723437
                                                                        41724037
418700     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       41830000
418800         (AT-CMPY-TY-SLS-MTD / PC-THOUSAND) -                     41840000
418900          AT-CMPY-FC-SLS-MTD.                                     41850000
419000                                                                  41860000
419100     MOVE ZEROS         TO  DWL1-SLS-MONTHLY                      41870000
419100                            DWL1-COMP-SLS-MTD-AMT.                41880062
419500                                                                  41890000
419600*N/A COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                      41900062
419700*        (AT-CMPY-TY-COMP-SLS-MTD / PC-THOUSAND) -                41910062
419800*         AT-CMPY-FC-COMP-SLS-MTD.                                41920062
                                                                        41930000
      *    SHOW FC GM AT MONTH END ONLY                                 41931038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      41932039
              MOVE ZEROS              TO DWL1-GM-MTD-AMT                41933038
           ELSE                                                         41935038
419900        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    41940038
420000            (AT-CMPY-TY-GM-MTD / PC-THOUSAND) -                   41950038
420100             AT-CMPY-FC-GM-MTD                                    41960038
           END-IF.                                                      41961038
                                                                        41962038
      *    ZERO VAR FC EOW INVENTORY                                    41963079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               41964087
420200     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       41970087
420300         (AT-CMPY-TY-INV-EOW / PC-THOUSAND) -                     41980087
420400          AT-CMPY-FC-INV-EOW.                                     41990087
                                                                        41991079
420500     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       42000000
420600         (AT-CMPY-TY-MKDN-MTD / PC-THOUSAND) -                    42010000
420700          AT-CMPY-FC-MKDN-MTD.                                    42020000
420800                                                                  42030000
420900*    GM MTD %                                                     42040000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   42041042
421000        AT-CMPY-TY-SLS-MTD = ZEROS OR                             42050042
421100        AT-CMPY-FC-SLS-MTD = ZEROS                                42060000
421200        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         42070000
421300     ELSE                                                         42080000
421400        COMPUTE PV-PCT =                                          42090000
421500        ((AT-CMPY-TY-GM-MTD * PC-HUNDRED) /                       42100000
421600          AT-CMPY-TY-SLS-MTD -                                    42110000
421700         (AT-CMPY-FC-GM-MTD * PC-HUNDRED) /                       42120000
421800          AT-CMPY-FC-SLS-MTD)                                     42130000
421900        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  42140000
422000     END-IF.                                                      42150000
422100                                                                  42160000
422200*    MKDN MTD %                                                   42170000
422300     IF AT-CMPY-TY-SLS-MTD = ZEROS OR                             42180000
422400        AT-CMPY-FC-SLS-MTD = ZEROS                                42190000
422500        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       42200000
422600     ELSE                                                         42210000
422700        COMPUTE PV-PCT =                                          42220000
422800        ((AT-CMPY-TY-MKDN-MTD * PC-HUNDRED) /                     42230000
422900          AT-CMPY-TY-SLS-MTD) -                                   42240000
423000        ((AT-CMPY-FC-MKDN-MTD * PC-HUNDRED) /                     42250000
423100          AT-CMPY-FC-SLS-MTD)                                     42260000
423200        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                42270000
423300     END-IF.                                                      42280000
423400                                                                  42290000
423500*    MKON PURCH %                                                 42300000
423600     MOVE ZEROS                        TO DWL1-MKON-PURCH-PCT.    42310000
423700                                                                  42320000
423800     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          42330000
423900                                                                  42340000
424000*   *** VARIANCE PLAN ***                                         42350000
424100     MOVE SPACES                         TO DWL1-HEADING.         42360000
424200     MOVE PC-VAR-PL                      TO DWL1-TOTAL-DESC.      42370000
424300     COMPUTE DWL1-SLS-WK1-AMT     ROUNDED =                       42380000
424400         (AT-CMPY-TY-SLS-WK1 / PC-THOUSAND) -                     42390000
424500          AT-CMPY-PL-SLS-WK1.                                     42400000
                                                                        42400137
           IF SS-OPEN-WK < 2                                            42401037
              MOVE ZEROS             TO DWL1-SLS-WK2-AMT                42402037
           ELSE                                                         42403037
424600        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED =                    42410037
424700            (AT-CMPY-TY-SLS-WK2 / PC-THOUSAND) -                  42420037
424800             AT-CMPY-PL-SLS-WK2                                   42430037
           END-IF.                                                      42431037
                                                                        42432037
           IF SS-OPEN-WK < 3                                            42433037
              MOVE ZEROS             TO DWL1-SLS-WK3-AMT                42434037
           ELSE                                                         42435037
424600        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED =                    42436037
424700            (AT-CMPY-TY-SLS-WK3 / PC-THOUSAND) -                  42437037
424800             AT-CMPY-PL-SLS-WK3                                   42438037
           END-IF.                                                      42439037
                                                                        42440037
           IF SS-OPEN-WK < 4                                            42450037
              MOVE ZEROS             TO DWL1-SLS-WK4-AMT                42460037
           ELSE                                                         42470037
424600        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED =                    42480037
424700            (AT-CMPY-TY-SLS-WK4 / PC-THOUSAND) -                  42490037
424800             AT-CMPY-PL-SLS-WK4                                   42500037
           END-IF.                                                      42510037
                                                                        42520037
           IF SS-OPEN-WK < 5                                            42521037
              MOVE ZEROS             TO DWL1-SLS-WK5-AMT                42522037
           ELSE                                                         42523037
424600        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED =                    42524037
424700            (AT-CMPY-TY-SLS-WK5 / PC-THOUSAND) -                  42525037
424800             AT-CMPY-PL-SLS-WK5                                   42526037
           END-IF.                                                      42527037
425800                                                                  42530000
425900     COMPUTE DWL1-SLS-MTD-AMT     ROUNDED =                       42540000
426000         (AT-CMPY-TY-SLS-MTD / PC-THOUSAND) -                     42550000
426100          AT-CMPY-PL-SLS-MTD.                                     42560000
426200                                                                  42570000
      *    ZERO MONTHLY SALES                                           42580000
426300     MOVE ZEROS         TO  DWL1-SLS-MONTHLY.                     42590000
426700                                                                  42600000
      *    SHOW PLAN COMP SLS AND GM AT MONTH END ONLY                  42601038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      42602040
              MOVE ZEROS              TO DWL1-COMP-SLS-MTD-AMT          42603062
                                         DWL1-GM-MTD-AMT                42604038
           ELSE                                                         42605038
426800        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED =                   42610062
426900            (AT-CMPY-TY-COMP-SLS-MTD / PC-THOUSAND) -             42620062
427000             AT-CMPY-PL-COMP-SLS-MTD                              42630062
427100        COMPUTE DWL1-GM-MTD-AMT      ROUNDED =                    42640038
427200            (AT-CMPY-TY-GM-MTD / PC-THOUSAND) -                   42650038
427300             AT-CMPY-PL-GM-MTD                                    42660038
           END-IF.                                                      42661038
                                                                        42662038
427400     COMPUTE DWL1-INV-EOW-AMT     ROUNDED =                       42670000
427500         (AT-CMPY-TY-INV-EOW / PC-THOUSAND) -                     42680000
427600          AT-CMPY-PL-INV-EOW.                                     42690000
427700     COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED =                       42700000
427800         (AT-CMPY-TY-MKDN-MTD / PC-THOUSAND) -                    42710000
427900          AT-CMPY-PL-MKDN-MTD.                                    42720000
428000                                                                  42730000
428100*    GM MTD %                                                     42740000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   42741042
428200        AT-CMPY-TY-SLS-MTD = ZEROS OR                             42750042
428300        AT-CMPY-PL-SLS-MTD = ZEROS                                42760000
428400        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         42770000
428500     ELSE                                                         42780000
428600        COMPUTE PV-PCT =                                          42790000
428700        ((AT-CMPY-TY-GM-MTD * PC-HUNDRED) /                       42800000
428800          AT-CMPY-TY-SLS-MTD -                                    42810000
428900         (AT-CMPY-PL-GM-MTD * PC-HUNDRED) /                       42820000
429000          AT-CMPY-PL-SLS-MTD)                                     42830000
429100        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  42840000
429200     END-IF.                                                      42850000
429300                                                                  42860000
429400*    MKDN MTD %                                                   42870000
429500     IF AT-CMPY-TY-SLS-MTD = ZEROS OR                             42880000
429600        AT-CMPY-PL-SLS-MTD = ZEROS                                42890000
429700        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       42900000
429800     ELSE                                                         42910000
429900        COMPUTE PV-PCT =                                          42920000
430000        ((AT-CMPY-TY-MKDN-MTD * PC-HUNDRED) /                     42930000
430100          AT-CMPY-TY-SLS-MTD) -                                   42940000
430200        ((AT-CMPY-PL-MKDN-MTD * PC-HUNDRED) /                     42950000
430300          AT-CMPY-PL-SLS-MTD)                                     42960000
430400        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                42970000
430500     END-IF.                                                      42980000
430600                                                                  42990000
430700*    MKON PURCH %                                                 43000000
252100     IF AT-CMPY-TY-PRCH-RTL = ZEROS OR                            43012044
265000        AT-CMPY-PL-PRCH-RTL = ZEROS                               43013044
281600        MOVE ZEROS                   TO DWL1-MKON-PURCH-PCT       43014044
           ELSE                                                         43015044
252400        COMPUTE PV-PCT =                                          43016044
252500       (((AT-CMPY-TY-PRCH-RTL -                                   43017044
252600          AT-CMPY-TY-PRCH-NET-CST) * PC-HUNDRED) /                43018044
252700          AT-CMPY-TY-PRCH-RTL) -                                  43019044
265400       (((AT-CMPY-PL-PRCH-RTL -                                   43019144
265500          AT-CMPY-PL-PRCH-NET-CST) * PC-HUNDRED) /                43019244
265600          AT-CMPY-PL-PRCH-RTL)                                    43019344
265700          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            43019444
265800     END-IF.                                                      43019544
430900                                                                  43020000
431000     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          43030000
431100                                                                  43040000
431200*   *** PCT VARIANCE FORECAST ***                                 43050000
431300     MOVE SPACES                       TO DWL1-HEADING.           43060000
431400     MOVE PC-PVARFCST                  TO DWL1-TOTAL-DESC.        43070000
431500                                                                  43080000
431600     IF AT-CMPY-FC-SLS-WK1 = ZEROS                                43090000
431700        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        43100000
431800     ELSE                                                         43110000
431900        COMPUTE PV-PCT =                                          43120000
432000        (((AT-CMPY-TY-SLS-WK1 / PC-THOUSAND) -                    43130000
432100           AT-CMPY-FC-SLS-WK1) /                                  43140000
432200           AT-CMPY-FC-SLS-WK1) * PC-HUNDRED                       43150000
432300        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 43160000
432400     END-IF.                                                      43170000
432500                                                                  43180000
           IF SS-OPEN-WK < 2 OR                                         43182033
432600        AT-CMPY-FC-SLS-WK2 = ZEROS                                43190033
432700        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        43200000
432800     ELSE                                                         43210000
432900        COMPUTE PV-PCT =                                          43220000
433000        (((AT-CMPY-TY-SLS-WK2 / PC-THOUSAND) -                    43230000
433100           AT-CMPY-FC-SLS-WK2) /                                  43240000
433200           AT-CMPY-FC-SLS-WK2) * PC-HUNDRED                       43250000
433300        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 43260000
433400     END-IF.                                                      43270000
433500                                                                  43280000
           IF SS-OPEN-WK < 3 OR                                         43281033
433600        AT-CMPY-FC-SLS-WK3 = ZEROS                                43290033
433700        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        43300000
433800     ELSE                                                         43310000
433900        COMPUTE PV-PCT =                                          43320000
434000        (((AT-CMPY-TY-SLS-WK3 / PC-THOUSAND) -                    43330000
434100           AT-CMPY-FC-SLS-WK3) /                                  43340000
434200           AT-CMPY-FC-SLS-WK3) * PC-HUNDRED                       43350000
434300        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 43360000
434400     END-IF.                                                      43370000
434500                                                                  43380000
           IF SS-OPEN-WK < 4 OR                                         43381033
434600        AT-CMPY-FC-SLS-WK4 = ZEROS                                43390033
434700        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        43400000
434800     ELSE                                                         43410000
434900        COMPUTE PV-PCT =                                          43420000
435000        (((AT-CMPY-TY-SLS-WK4 / PC-THOUSAND) -                    43430000
435100           AT-CMPY-FC-SLS-WK4) /                                  43440000
435200           AT-CMPY-FC-SLS-WK4) * PC-HUNDRED                       43450000
435300        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 43460000
435400     END-IF.                                                      43470000
435500                                                                  43480000
           IF SS-OPEN-WK < 5 OR                                         43481033
435600        AT-CMPY-FC-SLS-WK5 = ZEROS                                43490033
435700        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        43500000
435800     ELSE                                                         43510000
435900        COMPUTE PV-PCT =                                          43520000
436000        (((AT-CMPY-TY-SLS-WK5 / PC-THOUSAND) -                    43530000
436100           AT-CMPY-FC-SLS-WK5) /                                  43540000
436200           AT-CMPY-FC-SLS-WK5) * PC-HUNDRED                       43550000
436300        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 43560000
436400     END-IF.                                                      43570000
436500                                                                  43580000
436600     IF AT-CMPY-FC-SLS-MTD = ZEROS                                43590000
436700        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        43600000
436800     ELSE                                                         43610000
436900        COMPUTE PV-PCT =                                          43620000
437000        (((AT-CMPY-TY-SLS-MTD / PC-THOUSAND) -                    43630000
437100           AT-CMPY-FC-SLS-MTD) /                                  43640000
437200           AT-CMPY-FC-SLS-MTD) * PC-HUNDRED                       43650000
437300        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 43660000
437400     END-IF.                                                      43670000
437500                                                                  43680000
      *    ZERO MONTHLY SALES                                           43690000
437600     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       43700000
437700                                                                  43710000
      *    SHOW FC COMP SLS AT MONTH END ONLY                           43711038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   43712038
437800        AT-CMPY-FC-COMP-SLS-MTD = ZEROS                           43720062
437900        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   43730062
438000     ELSE                                                         43740000
438100        COMPUTE PV-PCT =                                          43750000
438200        (((AT-CMPY-TY-COMP-SLS-MTD / PC-THOUSAND) -               43760062
438300           AT-CMPY-FC-COMP-SLS-MTD) /                             43770062
438400           AT-CMPY-FC-COMP-SLS-MTD) * PC-HUNDRED                  43780062
438500        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            43790062
438600     END-IF.                                                      43800000
438700                                                                  43810000
      *    SHOW FC GM AT MONTH END ONLY                                 43811038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   43812038
438800        AT-CMPY-FC-GM-MTD = ZEROS                                 43820038
438900        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         43830000
439000     ELSE                                                         43840000
439100        COMPUTE PV-PCT =                                          43850000
439200        (((AT-CMPY-TY-GM-MTD / PC-THOUSAND) -                     43860000
439300           AT-CMPY-FC-GM-MTD) /                                   43870000
439400           AT-CMPY-FC-GM-MTD) * PC-HUNDRED                        43880000
439500        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  43890000
439600     END-IF.                                                      43900000
439700                                                                  43910000
      *    ZERO GM MTD %                                                43920000
439800     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        43930000
439900                                                                  43940000
      *    ZERO VAR FC EOW INVENTORY                                    43941079
255100*    MOVE ZEROS                TO DWL1-INV-EOW-AMT.               43942087
440000     IF AT-CMPY-FC-INV-EOW = ZEROS                                43950087
440100        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        43960087
440200     ELSE                                                         43970087
440300        COMPUTE PV-PCT =                                          43980087
440400        (((AT-CMPY-TY-INV-EOW / PC-THOUSAND) -                    43990087
440500           AT-CMPY-FC-INV-EOW) /                                  44000087
440600           AT-CMPY-FC-INV-EOW) * PC-HUNDRED                       44010087
440700        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 44020087
440800     END-IF.                                                      44030087
440900                                                                  44040000
441000     IF AT-CMPY-FC-MKDN-MTD = ZEROS                               44050000
441100        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       44060000
441200     ELSE                                                         44070000
441300        COMPUTE PV-PCT =                                          44080000
441400        (((AT-CMPY-TY-MKDN-MTD / PC-THOUSAND) -                   44090000
441500           AT-CMPY-FC-MKDN-MTD) /                                 44100000
441600           AT-CMPY-FC-MKDN-MTD) * PC-HUNDRED                      44110000
441700        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                44120000
441800     END-IF.                                                      44130000
441900                                                                  44140000
      *    ZERO MKDN MTD % AND MKON %                                   44150000
442000     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       44160000
442100                                          DWL1-MKON-PURCH-PCT.    44170000
442200                                                                  44180000
442300     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          44190000
442400                                                                  44200000
442500*   *** PCT VARIANCE PLAN ***                                     44210000
442600     MOVE SPACES                       TO DWL1-HEADING.           44220000
442700     MOVE PC-PVARPL                    TO DWL1-TOTAL-DESC.        44230000
442800                                                                  44240000
442900     IF AT-CMPY-PL-SLS-WK1 = ZEROS                                44250000
443000        MOVE ZEROS                     TO DWL1-SLS-WK1-AMT        44260000
443100     ELSE                                                         44270000
443200        COMPUTE PV-PCT =                                          44280000
443300        (((AT-CMPY-TY-SLS-WK1 / PC-THOUSAND) -                    44290000
443400           AT-CMPY-PL-SLS-WK1) /                                  44300000
443500           AT-CMPY-PL-SLS-WK1) * PC-HUNDRED                       44310000
443600        COMPUTE DWL1-SLS-WK1-AMT ROUNDED = PV-PCT                 44320000
443700     END-IF.                                                      44330000
443800                                                                  44340000
           IF SS-OPEN-WK < 2 OR                                         44342033
443900        AT-CMPY-PL-SLS-WK2 = ZEROS                                44350033
444000        MOVE ZEROS                     TO DWL1-SLS-WK2-AMT        44360000
444100     ELSE                                                         44370000
444200        COMPUTE PV-PCT =                                          44380000
444300        (((AT-CMPY-TY-SLS-WK2 / PC-THOUSAND) -                    44390000
444400           AT-CMPY-PL-SLS-WK2) /                                  44400000
444500           AT-CMPY-PL-SLS-WK2) * PC-HUNDRED                       44410000
444600        COMPUTE DWL1-SLS-WK2-AMT ROUNDED = PV-PCT                 44420000
444700     END-IF.                                                      44430000
444800                                                                  44440000
           IF SS-OPEN-WK < 3 OR                                         44441033
444900        AT-CMPY-PL-SLS-WK3 = ZEROS                                44450033
445000        MOVE ZEROS                     TO DWL1-SLS-WK3-AMT        44460000
445100     ELSE                                                         44470000
445200        COMPUTE PV-PCT =                                          44480000
445300        (((AT-CMPY-TY-SLS-WK3 / PC-THOUSAND) -                    44490000
445400           AT-CMPY-PL-SLS-WK3) /                                  44500000
445500           AT-CMPY-PL-SLS-WK3) * PC-HUNDRED                       44510000
445600        COMPUTE DWL1-SLS-WK3-AMT ROUNDED = PV-PCT                 44520000
445700     END-IF.                                                      44530000
445800                                                                  44540000
           IF SS-OPEN-WK < 4 OR                                         44541033
445900        AT-CMPY-PL-SLS-WK4 = ZEROS                                44550033
446000        MOVE ZEROS                     TO DWL1-SLS-WK4-AMT        44560000
446100     ELSE                                                         44570000
446200        COMPUTE PV-PCT =                                          44580000
446300        (((AT-CMPY-TY-SLS-WK4 / PC-THOUSAND) -                    44590000
446400           AT-CMPY-PL-SLS-WK4) /                                  44600000
446500           AT-CMPY-PL-SLS-WK4) * PC-HUNDRED                       44610000
446600        COMPUTE DWL1-SLS-WK4-AMT ROUNDED = PV-PCT                 44620000
446700     END-IF.                                                      44630000
446800                                                                  44640000
           IF SS-OPEN-WK < 5 OR                                         44641033
446900        AT-CMPY-PL-SLS-WK5 = ZEROS                                44650033
447000        MOVE ZEROS                     TO DWL1-SLS-WK5-AMT        44660000
447100     ELSE                                                         44670000
447200        COMPUTE PV-PCT =                                          44680000
447300        (((AT-CMPY-TY-SLS-WK5 / PC-THOUSAND) -                    44690000
447400           AT-CMPY-PL-SLS-WK5) /                                  44700000
447500           AT-CMPY-PL-SLS-WK5) * PC-HUNDRED                       44710000
447600        COMPUTE DWL1-SLS-WK5-AMT ROUNDED = PV-PCT                 44720000
447700     END-IF.                                                      44730000
447800                                                                  44740000
447900     IF AT-CMPY-PL-SLS-MTD = ZEROS                                44750000
448000        MOVE ZEROS                     TO DWL1-SLS-MTD-AMT        44760000
448100     ELSE                                                         44770000
448200        COMPUTE PV-PCT =                                          44780000
448300        (((AT-CMPY-TY-SLS-MTD / PC-THOUSAND) -                    44790000
448400           AT-CMPY-PL-SLS-MTD) /                                  44800000
448500           AT-CMPY-PL-SLS-MTD) * PC-HUNDRED                       44810000
448600        COMPUTE DWL1-SLS-MTD-AMT ROUNDED = PV-PCT                 44820000
448700     END-IF.                                                      44830000
448800                                                                  44840000
      *    ZERO MONTHLY SALES                                           44850000
448900     MOVE ZEROS                        TO DWL1-SLS-MONTHLY.       44860000
449000                                                                  44870000
      *    SHOW PLAN COMP SLS AT MONTH END ONLY                         44871038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   44872038
449100        AT-CMPY-PL-COMP-SLS-MTD = ZEROS                           44880062
449200        MOVE ZEROS                     TO DWL1-COMP-SLS-MTD-AMT   44890062
449300     ELSE                                                         44900000
449400        COMPUTE PV-PCT =                                          44910000
449500        (((AT-CMPY-TY-COMP-SLS-MTD / PC-THOUSAND) -               44920062
449600           AT-CMPY-PL-COMP-SLS-MTD) /                             44930062
449700           AT-CMPY-PL-COMP-SLS-MTD) * PC-HUNDRED                  44940062
449800        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            44950062
449900     END-IF.                                                      44960000
450000                                                                  44970000
      *    SHOW PLAN GM AT MONTH END ONLY                               44971038
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   44972038
450100        AT-CMPY-PL-GM-MTD = ZEROS                                 44980038
450200        MOVE ZEROS                     TO DWL1-GM-MTD-AMT         44990000
450300     ELSE                                                         45000000
450400        COMPUTE PV-PCT =                                          45010000
450500        (((AT-CMPY-TY-GM-MTD / PC-THOUSAND) -                     45020000
450600           AT-CMPY-PL-GM-MTD) /                                   45030000
450700           AT-CMPY-PL-GM-MTD) * PC-HUNDRED                        45040000
450800        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  45050000
450900     END-IF.                                                      45060000
451000                                                                  45070000
      *    ZERO GM MTD %                                                45080000
451100     MOVE ZEROS                        TO DWL1-GM-MTD-PCT.        45090000
451200                                                                  45100000
451300     IF AT-CMPY-PL-INV-EOW = ZEROS                                45110000
451400        MOVE ZEROS                     TO DWL1-INV-EOW-AMT        45120000
451500     ELSE                                                         45130000
451600        COMPUTE PV-PCT =                                          45140000
451700        (((AT-CMPY-TY-INV-EOW / PC-THOUSAND) -                    45150000
451800           AT-CMPY-PL-INV-EOW) /                                  45160000
451900           AT-CMPY-PL-INV-EOW) * PC-HUNDRED                       45170000
452000        COMPUTE DWL1-INV-EOW-AMT ROUNDED = PV-PCT                 45180000
452100     END-IF.                                                      45190000
452200                                                                  45200000
452300     IF AT-CMPY-PL-MKDN-MTD = ZEROS                               45210000
452400        MOVE ZEROS                     TO DWL1-MKDN-MTD-AMT       45220000
452500     ELSE                                                         45230000
452600        COMPUTE PV-PCT =                                          45240000
452700        (((AT-CMPY-TY-MKDN-MTD / PC-THOUSAND) -                   45250000
452800           AT-CMPY-PL-MKDN-MTD) /                                 45260000
452900           AT-CMPY-PL-MKDN-MTD) * PC-HUNDRED                      45270000
453000        COMPUTE DWL1-MKDN-MTD-AMT ROUNDED = PV-PCT                45280000
453100     END-IF.                                                      45290000
453200                                                                  45300000
      *    ZERO MKDN MTD % AND MKON %                                   45310000
453300     MOVE ZEROS                        TO DWL1-MKDN-MTD-PCT       45320000
453400                                          DWL1-MKON-PURCH-PCT.    45330000
453500                                                                  45340000
453600     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          45350000
453700                                                                  45360000
453800*   *** PCT VARIANCE LAST YR ***                                  45370000
453900     MOVE SPACES                        TO DWL1-HEADING.          45380000
454000     MOVE PC-PVARLY                     TO DWL1-TOTAL-DESC.       45390000
454100                                                                  45400000
454200     IF AT-CMPY-PVLY-SLS-WK1 = ZEROS                              45410000
454300        MOVE ZEROS                TO DWL1-SLS-WK1-AMT             45420000
454400     ELSE                                                         45430000
454500        COMPUTE PV-PCT =                                          45440000
454600              ((AT-CMPY-TY-SLS-WK1 -                              45450000
454700                AT-CMPY-PVLY-SLS-WK1) /                           45460000
454800                AT-CMPY-PVLY-SLS-WK1) * PC-HUNDRED                45470000
454900        COMPUTE DWL1-SLS-WK1-AMT     ROUNDED = PV-PCT             45480000
455000     END-IF.                                                      45490000
455100                                                                  45500000
455200     IF AT-CMPY-PVLY-SLS-WK2 = ZEROS                              45510000
455300        MOVE ZEROS                TO DWL1-SLS-WK2-AMT             45520000
455400     ELSE                                                         45530000
455500        COMPUTE PV-PCT =                                          45540000
455600              ((AT-CMPY-TY-SLS-WK2 -                              45550000
455700                AT-CMPY-PVLY-SLS-WK2) /                           45560000
455800                AT-CMPY-PVLY-SLS-WK2) * PC-HUNDRED                45570000
455900        COMPUTE DWL1-SLS-WK2-AMT     ROUNDED = PV-PCT             45580000
456000     END-IF.                                                      45590000
456100                                                                  45600000
456200     IF AT-CMPY-PVLY-SLS-WK3 = ZEROS                              45610000
456300        MOVE ZEROS                TO DWL1-SLS-WK3-AMT             45620000
456400     ELSE                                                         45630000
456500        COMPUTE PV-PCT =                                          45640000
456600              ((AT-CMPY-TY-SLS-WK3 -                              45650000
456700                AT-CMPY-PVLY-SLS-WK3) /                           45660000
456800                AT-CMPY-PVLY-SLS-WK3) * PC-HUNDRED                45670000
456900        COMPUTE DWL1-SLS-WK3-AMT     ROUNDED = PV-PCT             45680000
457000     END-IF.                                                      45690000
457100                                                                  45700000
457200     IF AT-CMPY-PVLY-SLS-WK4 = ZEROS                              45710000
457300        MOVE ZEROS                TO DWL1-SLS-WK4-AMT             45720000
457400     ELSE                                                         45730000
457500        COMPUTE PV-PCT =                                          45740000
457600              ((AT-CMPY-TY-SLS-WK4 -                              45750000
457700                AT-CMPY-PVLY-SLS-WK4) /                           45760000
457800                AT-CMPY-PVLY-SLS-WK4) * PC-HUNDRED                45770000
457900        COMPUTE DWL1-SLS-WK4-AMT     ROUNDED = PV-PCT             45780000
458000     END-IF.                                                      45790000
458100                                                                  45800000
458200     IF AT-CMPY-PVLY-SLS-WK5 = ZEROS                              45810000
458300        MOVE ZEROS                TO DWL1-SLS-WK5-AMT             45820000
458400     ELSE                                                         45830000
458500        COMPUTE PV-PCT =                                          45840000
458600              ((AT-CMPY-TY-SLS-WK5 -                              45850000
458700                AT-CMPY-PVLY-SLS-WK5) /                           45860000
458800                AT-CMPY-PVLY-SLS-WK5) * PC-HUNDRED                45870000
458900        COMPUTE DWL1-SLS-WK5-AMT     ROUNDED = PV-PCT             45880000
459000     END-IF.                                                      45890000
459100                                                                  45900000
459200     IF AT-CMPY-PVLY-SLS-MTD = ZEROS                              45910000
459300        MOVE ZEROS                TO DWL1-SLS-MTD-AMT             45920000
459400     ELSE                                                         45930000
459500        COMPUTE PV-PCT =                                          45940000
459600              ((AT-CMPY-TY-SLS-MTD -                              45950000
459700                AT-CMPY-PVLY-SLS-MTD) /                           45960000
459800                AT-CMPY-PVLY-SLS-MTD) * PC-HUNDRED                45970000
459900        COMPUTE DWL1-SLS-MTD-AMT     ROUNDED = PV-PCT             45980000
460000     END-IF.                                                      45990000
460100                                                                  46000000
311500***  USE PLAN SALES FOR MONTH % VARIANCE LY                       46010000
460200     IF AT-CMPY-PVLY-SLS-MONTH = ZEROS                            46020000
460300        MOVE ZEROS                TO DWL1-SLS-MONTHLY             46030000
460400     ELSE                                                         46040000
460500        COMPUTE PV-PCT =                                          46050000
460600              ((AT-CMPY-PL-SLS-MONTH -                            46060000
460700               (AT-CMPY-PVLY-SLS-MONTH / PC-THOUSAND)) /          46070000
460700               (AT-CMPY-PVLY-SLS-MONTH / PC-THOUSAND)) *          46071000
460800                PC-HUNDRED                                        46072000
460900        COMPUTE DWL1-SLS-MONTHLY ROUNDED = PV-PCT                 46073000
461000     END-IF.                                                      46074000
461100                                                                  46075000
461200     IF AT-CMPY-PVLY-COMP-SLS-MTD = ZEROS                         46076062
461300        MOVE ZEROS                TO DWL1-COMP-SLS-MTD-AMT        46077062
461400     ELSE                                                         46078000
461500        COMPUTE PV-PCT =                                          46079000
461600              ((AT-CMPY-TY-COMP-SLS-MTD -                         46080062
461700                AT-CMPY-PVLY-COMP-SLS-MTD) /                      46090062
461800                AT-CMPY-PVLY-COMP-SLS-MTD) * PC-HUNDRED           46100062
461900        COMPUTE DWL1-COMP-SLS-MTD-AMT ROUNDED = PV-PCT            46110062
462000     END-IF.                                                      46120000
462100                                                                  46130000
462200     IF AT-CMPY-PVLY-GM-MTD = ZEROS                               46140000
462300        MOVE ZEROS                TO DWL1-GM-MTD-AMT              46150000
462400     ELSE                                                         46160000
462500        COMPUTE PV-PCT =                                          46170000
462600              ((AT-CMPY-TY-GM-MTD -                               46180000
462700                AT-CMPY-PVLY-GM-MTD) /                            46190000
462800                AT-CMPY-PVLY-GM-MTD) * PC-HUNDRED                 46200000
462900        COMPUTE DWL1-GM-MTD-AMT ROUNDED = PV-PCT                  46210000
463000     END-IF.                                                      46220000
463100                                                                  46230000
463200     IF AT-CMPY-PVLY-INV-EOW = ZEROS                              46240000
463300        MOVE ZEROS                TO DWL1-INV-EOW-AMT             46250000
463400     ELSE                                                         46260000
463500        COMPUTE PV-PCT =                                          46270000
463600              ((AT-CMPY-TY-INV-EOW -                              46280000
463700                AT-CMPY-PVLY-INV-EOW) /                           46290000
463800                AT-CMPY-PVLY-INV-EOW) * PC-HUNDRED                46300000
463900        COMPUTE DWL1-INV-EOW-AMT     ROUNDED = PV-PCT             46310000
464000     END-IF.                                                      46320000
464100                                                                  46330000
464200     IF AT-CMPY-PVLY-MKDN-MTD = ZEROS                             46340000
464300        MOVE ZEROS                TO DWL1-MKDN-MTD-AMT            46350000
464400     ELSE                                                         46360000
464500        COMPUTE PV-PCT =                                          46370000
464600              ((AT-CMPY-TY-MKDN-MTD -                             46380000
464700                AT-CMPY-PVLY-MKDN-MTD) /                          46390000
464800                AT-CMPY-PVLY-MKDN-MTD) * PC-HUNDRED               46400000
464900        COMPUTE DWL1-MKDN-MTD-AMT    ROUNDED = PV-PCT             46410000
465000     END-IF.                                                      46420000
465100                                                                  46430000
465200*    GM MTD %                                                     46440000
465300     IF AT-CMPY-TY-SLS-MTD = ZEROS OR                             46450000
465400        AT-CMPY-PVLY-SLS-MTD = ZEROS                              46460000
465500        MOVE ZEROS                     TO DWL1-GM-MTD-PCT         46470000
465600     ELSE                                                         46480000
465700        COMPUTE PV-PCT =                                          46490000
465800       ((AT-CMPY-TY-GM-MTD * PC-HUNDRED) /                        46500000
465900         AT-CMPY-TY-SLS-MTD) -                                    46510000
466000       ((AT-CMPY-PVLY-GM-MTD * PC-HUNDRED) /                      46520000
466100         AT-CMPY-PVLY-SLS-MTD)                                    46530000
466200        COMPUTE DWL1-GM-MTD-PCT ROUNDED = PV-PCT                  46540000
466300     END-IF.                                                      46550000
466400                                                                  46560000
466500*    MKDN MTD %                                                   46570000
466600     IF AT-CMPY-TY-SLS-MTD = ZEROS OR                             46580000
466700        AT-CMPY-PVLY-SLS-MTD = ZEROS                              46590000
466800        MOVE ZEROS                     TO DWL1-MKDN-MTD-PCT       46600000
466900     ELSE                                                         46610000
467000        COMPUTE PV-PCT =                                          46620000
467100       ((AT-CMPY-TY-MKDN-MTD * PC-HUNDRED) /                      46630000
467200         AT-CMPY-TY-SLS-MTD) -                                    46640000
467300       ((AT-CMPY-PVLY-MKDN-MTD * PC-HUNDRED) /                    46650000
467400         AT-CMPY-PVLY-SLS-MTD)                                    46660000
467500        COMPUTE DWL1-MKDN-MTD-PCT ROUNDED = PV-PCT                46670000
467600     END-IF.                                                      46680000
467700                                                                  46690000
467800*    MKON PURCH %                                                 46700000
467900     IF AT-CMPY-TY-PRCH-RTL   = ZEROS  OR                         46710028
467900        AT-CMPY-PVLY-PRCH-RTL = ZEROS                             46711028
468000        MOVE ZEROS                     TO DWL1-MKON-PURCH-PCT     46720000
468100     ELSE                                                         46730000
468200        COMPUTE PV-PCT =                                          46740000
319800       (((AT-CMPY-TY-PRCH-RTL -                                   46750000
319900          AT-CMPY-TY-PRCH-NET-CST) * PC-HUNDRED) /                46760000
320000          AT-CMPY-TY-PRCH-RTL) -                                  46770000
320100       (((AT-CMPY-PVLY-PRCH-RTL -                                 46780000
320200          AT-CMPY-PVLY-PRCH-NET-CST) * PC-HUNDRED) /              46790000
320300          AT-CMPY-PVLY-PRCH-RTL)                                  46800000
468600          COMPUTE DWL1-MKON-PURCH-PCT ROUNDED = PV-PCT            46810000
468700     END-IF.                                                      46820000
468800                                                                  46830000
468900     PERFORM 7600-PRINT-WK-DETAIL-LINE1.                          46840000
469000     MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-1.          46850000
469100                                                                  46860000
469200******************************************************************46870000
469300*  PRINT REPORT PAGE 2 DMM TOTALS.                                46880000
469400******************************************************************46890000
469500 4400-PROCESS-DMM-PAGE2.                                          46900000
469600                                                                  46910000
469700     IF PV-LINE-COUNTER-2 > PC-PAGE-MAX-LINES                     46920000
              MOVE SPACES                  TO  PH2-YTD-FOR-YTD-RPT      46921048
469800        MOVE 7                       TO PV-LINE-COUNTER-2         46930000
469900        PERFORM 7200-PRINT-PAGE-HEADINGS                          46940000
470000        PERFORM 7400-PRINT-COL-PG2-HEADINGS                       46950000
470100     END-IF.                                                      46960000
470200                                                                  46970000
470300*** MOVE EACH TYPE OF DMM TOTAL TO DETAIL LINE                    46980000
470400                                                                  46990000
470500*   *** ACTUALS ***                                               47000000
470600     MOVE AT-DMM-DESC-PG2(DMM-IDX2)      TO DWL2-HEADING.         47010000
470700     MOVE PC-ACTUAL                      TO DWL2-TOTAL-DESC.      47020000
470800                                                                  47030000
470900*    WEEKLY GROSS RECEIPTS                                        47040000
471000     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        47050000
471100                AT-DMM-TY-GR-WK1(DMM-IDX2) /                      47060000
471200                PC-THOUSAND.                                      47070000
471300     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        47080000
471400                AT-DMM-TY-GR-WK2(DMM-IDX2) /                      47090000
471500                PC-THOUSAND.                                      47100000
471600     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        47110000
471700                AT-DMM-TY-GR-WK3(DMM-IDX2) /                      47120000
471800                PC-THOUSAND.                                      47130000
471900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        47140000
472000                AT-DMM-TY-GR-WK4(DMM-IDX2) /                      47150000
472100                PC-THOUSAND.                                      47160000
472200     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        47170000
472300                AT-DMM-TY-GR-WK5(DMM-IDX2) /                      47180000
472400                PC-THOUSAND.                                      47190000
472500     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        47200000
472600                AT-DMM-TY-GR-MTD(DMM-IDX2) /                      47210000
472700                PC-THOUSAND.                                      47220000
472800                                                                  47230000
472900*    WEEKLY PURCHASE ADJUSTMENTS                                  47240000
473000     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        47250000
473100                AT-DMM-TY-PADJ-WK1(DMM-IDX2) /                    47260000
473200                PC-THOUSAND.                                      47270000
473300     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        47280000
473400                AT-DMM-TY-PADJ-WK2(DMM-IDX2) /                    47290000
473500                PC-THOUSAND.                                      47300000
473600     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        47310000
473700                AT-DMM-TY-PADJ-WK3(DMM-IDX2) /                    47320000
473800                PC-THOUSAND.                                      47330000
473900     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        47340000
474000                AT-DMM-TY-PADJ-WK4(DMM-IDX2) /                    47350000
474100                PC-THOUSAND.                                      47360000
474200     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        47370000
474300                AT-DMM-TY-PADJ-WK5(DMM-IDX2) /                    47380000
474400                PC-THOUSAND.                                      47390000
474500     COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        47400000
474600                AT-DMM-TY-PADJ-MTD(DMM-IDX2) /                    47410000
474700                PC-THOUSAND.                                      47420000
474800                                                                  47430000
474900     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          47440000
475000                                                                  47450000
475100*   *** ACTUALS % FOR MONTH ***                                   47460000
475200     MOVE AT-DMM-NAME-PG2(DMM-IDX2)      TO DWL2-HEADING.         47470000
475300     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      47480000
475400                                                                  47490000
475500*    WEEKLY GROSS RECEIPTS MTD PERCENT                            47500000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   47501025
475600        AT-DMM-TY-GR-MTD(DMM-IDX2) = ZEROS                        47510025
475700        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       47520000
475800                                            DWL2-GR-WK2-AMT       47530000
475900                                            DWL2-GR-WK3-AMT       47540000
476000                                            DWL2-GR-WK4-AMT       47550000
476100                                            DWL2-GR-WK5-AMT       47560000
476200                                            DWL2-GR-MTD-AMT       47570000
476300     ELSE                                                         47580000
476400        COMPUTE PV-PCT =                                          47590000
476500               (AT-DMM-TY-GR-WK1(DMM-IDX2) /                      47600000
476600                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47610000
476700        COMPUTE DWL2-GR-WK1-AMT ROUNDED = PV-PCT                  47620000
476800        COMPUTE PV-PCT =                                          47630000
476900               (AT-DMM-TY-GR-WK2(DMM-IDX2) /                      47640000
477000                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47650000
477100        COMPUTE DWL2-GR-WK2-AMT ROUNDED = PV-PCT                  47660000
477200        COMPUTE PV-PCT =                                          47670000
477300               (AT-DMM-TY-GR-WK3(DMM-IDX2) /                      47680000
477400                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47690000
477500        COMPUTE DWL2-GR-WK3-AMT ROUNDED = PV-PCT                  47700000
477600        COMPUTE PV-PCT =                                          47710000
477700               (AT-DMM-TY-GR-WK4(DMM-IDX2) /                      47720000
477800                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47730000
477900        COMPUTE DWL2-GR-WK4-AMT ROUNDED = PV-PCT                  47740000
478000        COMPUTE PV-PCT =                                          47750000
478100               (AT-DMM-TY-GR-WK5(DMM-IDX2) /                      47760000
478200                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47770000
478300        COMPUTE DWL2-GR-WK5-AMT ROUNDED = PV-PCT                  47780000
478400        COMPUTE PV-PCT =                                          47790000
478500               (AT-DMM-TY-GR-MTD(DMM-IDX2) /                      47800000
478600                AT-DMM-TY-GR-MTD(DMM-IDX2)) * PC-HUNDRED          47810000
478700        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              47820000
478800     END-IF.                                                      47830000
478900                                                                  47840000
479000                                                                  47850000
479100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      47860000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   47861025
479200        AT-DMM-TY-PADJ-MTD(DMM-IDX2) = ZEROS                      47870025
479300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     47880000
479400                                            DWL2-PADJ-WK2-AMT     47890000
479500                                            DWL2-PADJ-WK3-AMT     47900000
479600                                            DWL2-PADJ-WK4-AMT     47910000
479700                                            DWL2-PADJ-WK5-AMT     47920000
479800                                            DWL2-PADJ-MTD-AMT     47930000
479900     ELSE                                                         47940000
480000        COMPUTE PV-PCT =                                          47950000
480100               (AT-DMM-TY-PADJ-WK1(DMM-IDX2) /                    47960000
480200                AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        47970000
480300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              47980000
480400        COMPUTE PV-PCT =                                          47990000
480500               (AT-DMM-TY-PADJ-WK2(DMM-IDX2) /                    48000000
480600                AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        48010000
480700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              48020000
480800        COMPUTE PV-PCT =                                          48030000
480900                AT-DMM-TY-PADJ-WK3(DMM-IDX2) /                    48040000
481000               (AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        48050000
481100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              48060000
481200        COMPUTE PV-PCT =                                          48070000
481300                AT-DMM-TY-PADJ-WK4(DMM-IDX2) /                    48080000
481400               (AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        48090000
481500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              48100000
481600        COMPUTE PV-PCT =                                          48110000
481700                AT-DMM-TY-PADJ-WK5(DMM-IDX2) /                    48120000
481800               (AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        48130000
481900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              48140000
482000        COMPUTE PV-PCT =                                          48150000
482100                AT-DMM-TY-PADJ-MTD(DMM-IDX2) /                    48160000
482200               (AT-DMM-TY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        48170000
482300        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              48180000
482400     END-IF.                                                      48190000
482500                                                                  48200000
482600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          48210000
482700                                                                  48220000
482800*   *** FORECAST ***                                              48230000
482900     MOVE SPACES                       TO DWL2-HEADING.           48240000
483000     MOVE PC-FCST                      TO DWL2-TOTAL-DESC.        48250000
483100                                                                  48260000
483200*    WEEKLY GROSS RECEIPTS                                        48270000
483300     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        48280000
483400                AT-DMM-FC-GR-WK1(DMM-IDX2).                       48290000
483500     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        48300000
483600                AT-DMM-FC-GR-WK2(DMM-IDX2).                       48310000
483700     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        48320000
483800                AT-DMM-FC-GR-WK3(DMM-IDX2).                       48330000
483900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        48340000
484000                AT-DMM-FC-GR-WK4(DMM-IDX2).                       48350000
484100     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        48360000
484200                AT-DMM-FC-GR-WK5(DMM-IDX2).                       48370000
484300     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        48380000
484400                AT-DMM-FC-GR-MTD(DMM-IDX2).                       48390000
484500                                                                  48400000
484600*    WEEKLY PURCHASES                                             48410000
484700     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        48420000
484800                AT-DMM-FC-PADJ-WK1(DMM-IDX2).                     48430000
484900     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        48440000
485000                AT-DMM-FC-PADJ-WK2(DMM-IDX2).                     48450000
485100     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        48460000
485200                AT-DMM-FC-PADJ-WK3(DMM-IDX2).                     48470000
485300     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        48480000
485400                AT-DMM-FC-PADJ-WK4(DMM-IDX2).                     48490000
485500     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        48500000
485600                AT-DMM-FC-PADJ-WK5(DMM-IDX2).                     48510000
                                                                        48520000
485700     MOVE ZEROS            TO DWL2-PADJ-MTD-AMT.                  48530000
      *                                                                 48531026
485700*N/A COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        48540000
485800*               AT-DMM-FC-PADJ-MTD(DMM-IDX2).                     48550000
485900                                                                  48560000
486000     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          48570000
486100                                                                  48580000
486200*   *** FORECAST % FOR MONTH ***                                  48590000
486300     MOVE SPACES                         TO DWL2-HEADING.         48600000
486400     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      48610000
486500                                                                  48620000
486600*    WEEKLY GROSS RECEIPTS MTD PERCENT                            48630000
486700     IF AT-DMM-FC-GR-MONTH(DMM-IDX2) = ZEROS                      48640052
486800        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       48650000
486900                                            DWL2-GR-WK2-AMT       48660000
487000                                            DWL2-GR-WK3-AMT       48670000
487100                                            DWL2-GR-WK4-AMT       48680000
487200                                            DWL2-GR-WK5-AMT       48690000
487300                                            DWL2-GR-MTD-AMT       48700000
487400     ELSE                                                         48710000
487500        COMPUTE PV-PCT =                                          48720000
487600               (AT-DMM-FC-GR-WK1(DMM-IDX2) /                      48730000
487700                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48740052
487800        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              48750000
487900        COMPUTE PV-PCT =                                          48760000
488000               (AT-DMM-FC-GR-WK2(DMM-IDX2) /                      48770000
488100                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48780052
488200        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              48790000
488300        COMPUTE PV-PCT =                                          48800000
488400               (AT-DMM-FC-GR-WK3(DMM-IDX2) /                      48810000
488500                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48820052
488600        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              48830000
488700        COMPUTE PV-PCT =                                          48840000
488800               (AT-DMM-FC-GR-WK4(DMM-IDX2) /                      48850000
488900                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48860052
489000        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              48870000
489100        COMPUTE PV-PCT =                                          48880000
489200               (AT-DMM-FC-GR-WK5(DMM-IDX2) /                      48890000
489300                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48900052
489400        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              48910000
489500        COMPUTE PV-PCT =                                          48920000
489600               (AT-DMM-FC-GR-MTD(DMM-IDX2) /                      48930000
489700                AT-DMM-FC-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        48940052
489800        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              48950000
489900     END-IF.                                                      48960000
490000                                                                  48970000
490100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      48980000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   48981046
490200        AT-DMM-FC-PADJ-MTD(DMM-IDX2) = ZEROS                      48990046
490300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     49000000
490400                                            DWL2-PADJ-WK2-AMT     49010000
490500                                            DWL2-PADJ-WK3-AMT     49020000
490600                                            DWL2-PADJ-WK4-AMT     49030000
490700                                            DWL2-PADJ-WK5-AMT     49040000
490800                                            DWL2-PADJ-MTD-AMT     49050000
490900     ELSE                                                         49060000
491000        COMPUTE PV-PCT =                                          49070000
491100               (AT-DMM-FC-PADJ-WK1(DMM-IDX2) /                    49080000
491200                AT-DMM-FC-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        49090000
491300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              49100000
491400        COMPUTE PV-PCT =                                          49110000
491500               (AT-DMM-FC-PADJ-WK2(DMM-IDX2) /                    49120000
491600                AT-DMM-FC-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        49130000
491700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              49140000
491800        COMPUTE PV-PCT =                                          49150000
491900                AT-DMM-FC-PADJ-WK3(DMM-IDX2) /                    49160000
492000               (AT-DMM-FC-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        49170000
492100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              49180000
492200        COMPUTE PV-PCT =                                          49190000
492300                AT-DMM-FC-PADJ-WK4(DMM-IDX2) /                    49200000
492400               (AT-DMM-FC-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        49210000
492500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              49220000
492600        COMPUTE PV-PCT =                                          49230000
492700                AT-DMM-FC-PADJ-WK5(DMM-IDX2) /                    49240000
492800               (AT-DMM-FC-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        49250000
492900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              49260000
                                                                        49270000
      *       ZERO PADJ MTD AMT                                         49280000
485700        MOVE ZEROS            TO DWL2-PADJ-MTD-AMT                49290000
493400     END-IF.                                                      49300000
493500                                                                  49310000
493600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          49320000
493700                                                                  49330000
493800*   *** PLAN ***                                                  49340000
493900     MOVE SPACES                       TO DWL2-HEADING.           49350000
21517      MOVE PC-PLAN                      TO DWL2-TOTAL-DESC.        49360090
494100                                                                  49370000
494200*    WEEKLY GROSS RECEIPTS                                        49380000
494300     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        49390000
494400                AT-DMM-PL-GR-WK1(DMM-IDX2).                       49400000
494500     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        49410000
494600                AT-DMM-PL-GR-WK2(DMM-IDX2).                       49420000
494700     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        49430000
494800                AT-DMM-PL-GR-WK3(DMM-IDX2).                       49440000
494900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        49450000
495000                AT-DMM-PL-GR-WK4(DMM-IDX2).                       49460000
495100     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        49470000
495200                AT-DMM-PL-GR-WK5(DMM-IDX2).                       49480000
495300     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        49490000
495400                AT-DMM-PL-GR-MTD(DMM-IDX2).                       49500000
495500                                                                  49510000
495600*    WEEKLY PURCHASES                                             49520000
495700     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        49530000
495800                AT-DMM-PL-PADJ-WK1(DMM-IDX2).                     49540000
495900     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        49550000
496000                AT-DMM-PL-PADJ-WK2(DMM-IDX2).                     49560000
496100     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        49570000
496200                AT-DMM-PL-PADJ-WK3(DMM-IDX2).                     49580000
496300     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        49590000
496400                AT-DMM-PL-PADJ-WK4(DMM-IDX2).                     49600000
496500     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        49610000
496600                AT-DMM-PL-PADJ-WK5(DMM-IDX2).                     49620000
                                                                        49621048
      *    PADJ MTD AMT - ONLY WHEN LAST WEEK OF MONTH                  49630048
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      49641048
              MOVE ZEROS             TO DWL2-PADJ-MTD-AMT               49642048
           ELSE                                                         49643048
496500        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                     49643148
496600                AT-DMM-PL-PADJ-MTD(DMM-IDX2)                      49643248
           END-IF.                                                      49643348
496900                                                                  49650000
497000     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          49660000
497100                                                                  49670000
497200*   *** PLAN % FOR MONTH ***                                      49680000
497300     MOVE SPACES                         TO DWL2-HEADING.         49690000
497400     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      49700000
497500                                                                  49710000
497600*    WEEKLY GROSS RECEIPTS MTD PERCENT                            49720000
497700     IF AT-DMM-PL-GR-MONTH(DMM-IDX2) = ZEROS                      49730055
497800        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       49740000
497900                                            DWL2-GR-WK2-AMT       49750000
498000                                            DWL2-GR-WK3-AMT       49760000
498100                                            DWL2-GR-WK4-AMT       49770000
498200                                            DWL2-GR-WK5-AMT       49780000
498300                                            DWL2-GR-MTD-AMT       49790000
498400     ELSE                                                         49800000
498500        COMPUTE PV-PCT =                                          49810000
498600               (AT-DMM-PL-GR-WK1(DMM-IDX2) /                      49820000
498700                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        49830052
498800        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              49840000
498900        COMPUTE PV-PCT =                                          49850000
499000               (AT-DMM-PL-GR-WK2(DMM-IDX2) /                      49860000
499100                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        49870052
499200        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              49880000
499300        COMPUTE PV-PCT =                                          49890000
499400               (AT-DMM-PL-GR-WK3(DMM-IDX2) /                      49900000
499500                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        49910052
499600        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              49920000
499700        COMPUTE PV-PCT =                                          49930000
499800               (AT-DMM-PL-GR-WK4(DMM-IDX2) /                      49940000
499900                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        49950052
500000        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              49960000
500100        COMPUTE PV-PCT =                                          49970000
500200               (AT-DMM-PL-GR-WK5(DMM-IDX2) /                      49980000
500300                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        49990052
500400        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              50000000
500500        COMPUTE PV-PCT =                                          50010000
500600               (AT-DMM-PL-GR-MTD(DMM-IDX2) /                      50020052
500700                AT-DMM-PL-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50030052
500800        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              50040000
500900     END-IF.                                                      50050000
501000                                                                  50060000
501100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      50070000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   50071046
501200        AT-DMM-PL-PADJ-MTD(DMM-IDX2) = ZEROS                      50080046
501300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     50090000
501400                                            DWL2-PADJ-WK2-AMT     50100000
501500                                            DWL2-PADJ-WK3-AMT     50110000
501600                                            DWL2-PADJ-WK4-AMT     50120000
501700                                            DWL2-PADJ-WK5-AMT     50130000
501800                                            DWL2-PADJ-MTD-AMT     50140000
501900     ELSE                                                         50150000
502000        COMPUTE PV-PCT =                                          50160000
502100               (AT-DMM-PL-PADJ-WK1(DMM-IDX2) /                    50170000
502200                AT-DMM-PL-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50180000
502300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              50190000
502400        COMPUTE PV-PCT =                                          50200000
502500               (AT-DMM-PL-PADJ-WK2(DMM-IDX2) /                    50210000
502600                AT-DMM-PL-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50220000
502700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              50230000
502800        COMPUTE PV-PCT =                                          50240000
502900                AT-DMM-PL-PADJ-WK3(DMM-IDX2) /                    50250000
503000               (AT-DMM-PL-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50260000
503100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              50270000
503200        COMPUTE PV-PCT =                                          50280000
503300                AT-DMM-PL-PADJ-WK4(DMM-IDX2) /                    50290000
503400               (AT-DMM-PL-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50300000
503500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              50310000
503600        COMPUTE PV-PCT =                                          50320000
503700                AT-DMM-PL-PADJ-WK5(DMM-IDX2) /                    50330000
503800               (AT-DMM-PL-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50340000
503900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              50350000
      *       ZERO PADJ MTD AMT                                         50360000
485700        MOVE ZEROS            TO DWL2-PADJ-MTD-AMT                50370000
504400     END-IF.                                                      50380000
504500                                                                  50390000
504600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          50400000
504700                                                                  50410000
504800*   *** LAST YEAR % FOR MONTH ***                                 50420000
504900     MOVE SPACES                         TO DWL2-HEADING.         50430000
505000     MOVE PC-LYPMNTH                     TO DWL2-TOTAL-DESC.      50440000
505100                                                                  50450000
505200*    WEEKLY GROSS RECEIPTS MTD PERCENT                            50460000
505300     IF AT-DMM-LY-GR-MONTH(DMM-IDX2) = ZEROS                      50470052
505400        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       50480000
505500                                            DWL2-GR-WK2-AMT       50490000
505600                                            DWL2-GR-WK3-AMT       50500000
505700                                            DWL2-GR-WK4-AMT       50510000
505800                                            DWL2-GR-WK5-AMT       50520000
505900                                            DWL2-GR-MTD-AMT       50530000
506000     ELSE                                                         50540000
506100        COMPUTE PV-PCT =                                          50550000
506200               (AT-DMM-LY-GR-WK1(DMM-IDX2) /                      50560000
506300                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50570052
506400        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              50580000
506500        COMPUTE PV-PCT =                                          50590000
506600               (AT-DMM-LY-GR-WK2(DMM-IDX2) /                      50600000
506700                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50610052
506800        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              50620000
506900        COMPUTE PV-PCT =                                          50630000
507000               (AT-DMM-LY-GR-WK3(DMM-IDX2) /                      50640000
507100                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50650052
507200        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              50660000
507300        COMPUTE PV-PCT =                                          50670000
507400               (AT-DMM-LY-GR-WK4(DMM-IDX2) /                      50680000
507500                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50690052
507600        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              50700000
507700        COMPUTE PV-PCT =                                          50710000
507800               (AT-DMM-LY-GR-WK5(DMM-IDX2) /                      50720000
507900                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50730052
508000        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              50740000
508100        COMPUTE PV-PCT =                                          50750000
508200               (AT-DMM-LY-GR-MTD(DMM-IDX2) /                      50760000
508300                AT-DMM-LY-GR-MONTH(DMM-IDX2)) * PC-HUNDRED        50770052
508400        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              50780000
508500     END-IF.                                                      50790000
508600                                                                  50800000
508700*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      50810000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   50811046
508800        AT-DMM-LY-PADJ-MTD(DMM-IDX2) = ZEROS                      50820046
508900        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     50830000
509000                                            DWL2-PADJ-WK2-AMT     50840000
509100                                            DWL2-PADJ-WK3-AMT     50850000
509200                                            DWL2-PADJ-WK4-AMT     50860000
509300                                            DWL2-PADJ-WK5-AMT     50870000
509400                                            DWL2-PADJ-MTD-AMT     50880000
509500     ELSE                                                         50890000
509600        COMPUTE PV-PCT =                                          50900000
509700               (AT-DMM-LY-PADJ-WK1(DMM-IDX2) /                    50910000
509800                AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50920000
509900        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              50930000
510000        COMPUTE PV-PCT =                                          50940000
510100               (AT-DMM-LY-PADJ-WK2(DMM-IDX2) /                    50950000
510200                AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        50960000
510300        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              50970000
510400        COMPUTE PV-PCT =                                          50980000
510500                AT-DMM-LY-PADJ-WK3(DMM-IDX2) /                    50990000
510600               (AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        51000000
510700        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              51010000
510800        COMPUTE PV-PCT =                                          51020000
510900                AT-DMM-LY-PADJ-WK4(DMM-IDX2) /                    51030000
511000               (AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        51040000
511100        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              51050000
511200        COMPUTE PV-PCT =                                          51060000
511300                AT-DMM-LY-PADJ-WK5(DMM-IDX2) /                    51070000
511400               (AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        51080000
511500        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              51090000
511600        COMPUTE PV-PCT =                                          51100000
511700                AT-DMM-LY-PADJ-MTD(DMM-IDX2) /                    51110000
511800               (AT-DMM-LY-PADJ-MTD(DMM-IDX2)) * PC-HUNDRED        51120000
511900        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              51130000
512000     END-IF.                                                      51140000
512100                                                                  51150000
512200     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          51160000
512300                                                                  51170000
512400     MOVE SPACES TO DWL2-DETAIL-WK-LINE-1.                        51180000
512500     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          51190000
512600                                                                  51200000
512700                                                                  51210000
512800******************************************************************51220000
512900*  PRINT REPORT PAGE 2 GMM TOTALS.                                51230000
513000******************************************************************51240000
513100 4500-PROCESS-GMM-PAGE2.                                          51250000
513200                                                                  51260000
513300*** MOVE EACH TYPE OF GMM TOTAL TO DETAIL LINE                    51270000
513400                                                                  51280000
513500*   *** ACTUALS ***                                               51290000
513600     MOVE PC-GMM-TOTAL                   TO DWL2-HEADING.         51300000
513700     MOVE PC-ACTUAL                      TO DWL2-TOTAL-DESC.      51310000
513800                                                                  51320000
513900*    WEEKLY GROSS RECEIPTS                                        51330000
514000     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        51340000
514100                AT-GMM-TY-GR-WK1(GMM-IDX2) /                      51350000
514200                PC-THOUSAND.                                      51360000
514300     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        51370000
514400                AT-GMM-TY-GR-WK2(GMM-IDX2) /                      51380000
514500                PC-THOUSAND.                                      51390000
514600     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        51400000
514700                AT-GMM-TY-GR-WK3(GMM-IDX2) /                      51410000
514800                PC-THOUSAND.                                      51420000
514900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        51430000
515000                AT-GMM-TY-GR-WK4(GMM-IDX2) /                      51440000
515100                PC-THOUSAND.                                      51450000
515200     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        51460000
515300                AT-GMM-TY-GR-WK5(GMM-IDX2) /                      51470000
515400                PC-THOUSAND.                                      51480000
515500     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        51490000
515600                AT-GMM-TY-GR-MTD(GMM-IDX2) /                      51500000
515700                PC-THOUSAND.                                      51510000
515800                                                                  51520000
515900*    WEEKLY PURCHASE ADJUSTMENTS                                  51530000
516000     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        51540000
516100                AT-GMM-TY-PADJ-WK1(GMM-IDX2) /                    51550000
516200                PC-THOUSAND.                                      51560000
516300     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        51570000
516400                AT-GMM-TY-PADJ-WK2(GMM-IDX2) /                    51580000
516500                PC-THOUSAND.                                      51590000
516600     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        51600000
516700                AT-GMM-TY-PADJ-WK3(GMM-IDX2) /                    51610000
516800                PC-THOUSAND.                                      51620000
516900     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        51630000
517000                AT-GMM-TY-PADJ-WK4(GMM-IDX2) /                    51640000
517100                PC-THOUSAND.                                      51650000
517200     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        51660000
517300                AT-GMM-TY-PADJ-WK5(GMM-IDX2) /                    51670000
517400                PC-THOUSAND.                                      51680000
517500     COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        51690000
517600                AT-GMM-TY-PADJ-MTD(GMM-IDX2) /                    51700000
517700                PC-THOUSAND.                                      51710000
517800                                                                  51720000
517900     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          51730000
518000                                                                  51740000
518100*   *** ACTUALS % FOR MONTH ***                                   51750000
518200     MOVE AT-GMM-DESC-PG2(GMM-IDX2)      TO DWL2-HEADING.         51760000
518300     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      51770000
518400                                                                  51780000
518500*    WEEKLY GROSS RECEIPTS MTD PERCENT                            51790000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   51791034
518600        AT-GMM-TY-GR-MTD(GMM-IDX2) = ZEROS                        51800034
518700        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       51810000
518800                                            DWL2-GR-WK2-AMT       51820000
518900                                            DWL2-GR-WK3-AMT       51830000
519000                                            DWL2-GR-WK4-AMT       51840000
519100                                            DWL2-GR-WK5-AMT       51850000
519200                                            DWL2-GR-MTD-AMT       51860000
519300     ELSE                                                         51870000
519400        COMPUTE PV-PCT =                                          51880000
519500               (AT-GMM-TY-GR-WK1(GMM-IDX2) /                      51890000
519600                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          51900000
519700        COMPUTE DWL2-GR-WK1-AMT ROUNDED = PV-PCT                  51910000
519800        COMPUTE PV-PCT =                                          51920000
519900               (AT-GMM-TY-GR-WK2(GMM-IDX2) /                      51930000
520000                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          51940000
520100        COMPUTE DWL2-GR-WK2-AMT ROUNDED = PV-PCT                  51950000
520200        COMPUTE PV-PCT =                                          51960000
520300               (AT-GMM-TY-GR-WK3(GMM-IDX2) /                      51970000
520400                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          51980000
520500        COMPUTE DWL2-GR-WK3-AMT ROUNDED = PV-PCT                  51990000
520600        COMPUTE PV-PCT =                                          52000000
520700               (AT-GMM-TY-GR-WK4(GMM-IDX2) /                      52010000
520800                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          52020000
520900        COMPUTE DWL2-GR-WK4-AMT ROUNDED = PV-PCT                  52030000
521000        COMPUTE PV-PCT =                                          52040000
521100               (AT-GMM-TY-GR-WK5(GMM-IDX2) /                      52050000
521200                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          52060000
521300        COMPUTE DWL2-GR-WK5-AMT ROUNDED = PV-PCT                  52070000
521400        COMPUTE PV-PCT =                                          52080000
521500               (AT-GMM-TY-GR-MTD(GMM-IDX2) /                      52090000
521600                AT-GMM-TY-GR-MTD(GMM-IDX2)) * PC-HUNDRED          52100000
521700        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              52110000
521800     END-IF.                                                      52120000
521900                                                                  52130000
522000                                                                  52140000
522100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      52150000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   52151034
522200        AT-GMM-TY-PADJ-MTD(GMM-IDX2) = ZEROS                      52160034
522300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     52170000
522400                                            DWL2-PADJ-WK2-AMT     52180000
522500                                            DWL2-PADJ-WK3-AMT     52190000
522600                                            DWL2-PADJ-WK4-AMT     52200000
522700                                            DWL2-PADJ-WK5-AMT     52210000
522800                                            DWL2-PADJ-MTD-AMT     52220000
522900     ELSE                                                         52230000
523000        COMPUTE PV-PCT =                                          52240000
523100               (AT-GMM-TY-PADJ-WK1(GMM-IDX2) /                    52250000
523200                AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52260000
523300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              52270000
523400        COMPUTE PV-PCT =                                          52280000
523500               (AT-GMM-TY-PADJ-WK2(GMM-IDX2) /                    52290000
523600                AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52300000
523700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              52310000
523800        COMPUTE PV-PCT =                                          52320000
523900                AT-GMM-TY-PADJ-WK3(GMM-IDX2) /                    52330000
524000               (AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52340000
524100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              52350000
524200        COMPUTE PV-PCT =                                          52360000
524300                AT-GMM-TY-PADJ-WK4(GMM-IDX2) /                    52370000
524400               (AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52380000
524500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              52390000
524600        COMPUTE PV-PCT =                                          52400000
524700                AT-GMM-TY-PADJ-WK5(GMM-IDX2) /                    52410000
524800               (AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52420000
524900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              52430000
525000        COMPUTE PV-PCT =                                          52440000
525100                AT-GMM-TY-PADJ-MTD(GMM-IDX2) /                    52450000
525200               (AT-GMM-TY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        52460000
525300        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              52470000
525400     END-IF.                                                      52480000
525500                                                                  52490000
525600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          52500000
525700                                                                  52510000
525800*   *** FORECAST ***                                              52520000
525900     MOVE AT-GMM-NAME-PG2(GMM-IDX2)    TO DWL2-HEADING.           52530000
526000     MOVE PC-FCST                      TO DWL2-TOTAL-DESC.        52540000
526100                                                                  52550000
526200*    WEEKLY GROSS RECEIPTS                                        52560000
526300     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        52570000
526400                AT-GMM-FC-GR-WK1(GMM-IDX2).                       52580000
526500     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        52590000
526600                AT-GMM-FC-GR-WK2(GMM-IDX2).                       52600000
526700     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        52610000
526800                AT-GMM-FC-GR-WK3(GMM-IDX2).                       52620000
526900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        52630000
527000                AT-GMM-FC-GR-WK4(GMM-IDX2).                       52640000
527100     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        52650000
527200                AT-GMM-FC-GR-WK5(GMM-IDX2).                       52660000
527300     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        52670000
527400                AT-GMM-FC-GR-MTD(GMM-IDX2).                       52680000
527500                                                                  52690000
527600*    WEEKLY PURCHASES                                             52700000
527700     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        52710000
527800                AT-GMM-FC-PADJ-WK1(GMM-IDX2).                     52720000
527900     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        52730000
528000                AT-GMM-FC-PADJ-WK2(GMM-IDX2).                     52740000
528100     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        52750000
528200                AT-GMM-FC-PADJ-WK3(GMM-IDX2).                     52760000
528300     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        52770000
528400                AT-GMM-FC-PADJ-WK4(GMM-IDX2).                     52780000
528500     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        52790000
528600                AT-GMM-FC-PADJ-WK5(GMM-IDX2).                     52800000
528700     COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        52810000
528800                AT-GMM-FC-PADJ-MTD(GMM-IDX2).                     52820000
528900                                                                  52830000
529000     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          52840000
529100                                                                  52850000
529200*   *** FORECAST % FOR MONTH ***                                  52860000
529300     MOVE SPACES                         TO DWL2-HEADING.         52870000
529400     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      52880000
529500                                                                  52890000
529600*    WEEKLY GROSS RECEIPTS MTD PERCENT                            52900000
L1010      IF AT-GMM-FC-GR-MONTH(GMM-IDX2) = ZEROS                      52910087
529800        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       52920000
529900                                            DWL2-GR-WK2-AMT       52930000
530000                                            DWL2-GR-WK3-AMT       52940000
530100                                            DWL2-GR-WK4-AMT       52950000
530200                                            DWL2-GR-WK5-AMT       52960000
530300                                            DWL2-GR-MTD-AMT       52970000
530400     ELSE                                                         52980000
530500        COMPUTE PV-PCT =                                          52990000
530600               (AT-GMM-FC-GR-WK1(GMM-IDX2) /                      53000000
530700                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53010088
530800        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              53020000
530900        COMPUTE PV-PCT =                                          53030000
531000               (AT-GMM-FC-GR-WK2(GMM-IDX2) /                      53040000
531100                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53050088
531200        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              53060000
531300        COMPUTE PV-PCT =                                          53070000
531400               (AT-GMM-FC-GR-WK3(GMM-IDX2) /                      53080000
531500                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53090088
531600        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              53100000
531700        COMPUTE PV-PCT =                                          53110000
531800               (AT-GMM-FC-GR-WK4(GMM-IDX2) /                      53120000
531900                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53130088
532000        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              53140000
532100        COMPUTE PV-PCT =                                          53150000
532200               (AT-GMM-FC-GR-WK5(GMM-IDX2) /                      53160000
532300                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53170088
532400        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              53180000
532500        COMPUTE PV-PCT =                                          53190000
532600               (AT-GMM-FC-GR-MTD(GMM-IDX2) /                      53200000
532700                AT-GMM-FC-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        53210088
532800        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              53220000
532900     END-IF.                                                      53230000
533000                                                                  53240000
533100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      53250000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   53251046
533200        AT-GMM-FC-PADJ-MTD(GMM-IDX2) = ZEROS                      53260046
533300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     53270000
533400                                            DWL2-PADJ-WK2-AMT     53280000
533500                                            DWL2-PADJ-WK3-AMT     53290000
533600                                            DWL2-PADJ-WK4-AMT     53300000
533700                                            DWL2-PADJ-WK5-AMT     53310000
533800                                            DWL2-PADJ-MTD-AMT     53320000
533900     ELSE                                                         53330000
534000        COMPUTE PV-PCT =                                          53340000
534100               (AT-GMM-FC-PADJ-WK1(GMM-IDX2) /                    53350000
534200                AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53360000
534300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              53370000
534400        COMPUTE PV-PCT =                                          53380000
534500               (AT-GMM-FC-PADJ-WK2(GMM-IDX2) /                    53390000
534600                AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53400000
534700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              53410000
534800        COMPUTE PV-PCT =                                          53420000
534900                AT-GMM-FC-PADJ-WK3(GMM-IDX2) /                    53430000
535000               (AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53440000
535100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              53450000
535200        COMPUTE PV-PCT =                                          53460000
535300                AT-GMM-FC-PADJ-WK4(GMM-IDX2) /                    53470000
535400               (AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53480000
535500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              53490000
535600        COMPUTE PV-PCT =                                          53500000
535700                AT-GMM-FC-PADJ-WK5(GMM-IDX2) /                    53510000
535800               (AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53520000
535900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              53530000
536000        COMPUTE PV-PCT =                                          53540000
536100                AT-GMM-FC-PADJ-MTD(GMM-IDX2) /                    53550000
536200               (AT-GMM-FC-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        53560000
536300        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              53570000
536400     END-IF.                                                      53580000
536500                                                                  53590000
536600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          53600000
536700                                                                  53610000
536800*   *** PLAN ***                                                  53620000
536900     MOVE SPACES                       TO DWL2-HEADING.           53630000
21517      MOVE PC-PLAN                      TO DWL2-TOTAL-DESC.        53640092
537100                                                                  53650000
537200*    WEEKLY GROSS RECEIPTS                                        53660000
537300     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        53670000
537400                AT-GMM-PL-GR-WK1(GMM-IDX2).                       53680000
537500     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        53690000
537600                AT-GMM-PL-GR-WK2(GMM-IDX2).                       53700000
537700     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        53710000
537800                AT-GMM-PL-GR-WK3(GMM-IDX2).                       53720000
537900     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        53730000
538000                AT-GMM-PL-GR-WK4(GMM-IDX2).                       53740000
538100     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        53750000
538200                AT-GMM-PL-GR-WK5(GMM-IDX2).                       53760000
538300     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        53770000
538400                AT-GMM-PL-GR-MTD(GMM-IDX2).                       53780000
538500                                                                  53790000
538600*    WEEKLY PURCHASES                                             53800000
538700     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        53810000
538800                AT-GMM-PL-PADJ-WK1(GMM-IDX2).                     53820000
538900     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        53830000
539000                AT-GMM-PL-PADJ-WK2(GMM-IDX2).                     53840000
539100     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        53850000
539200                AT-GMM-PL-PADJ-WK3(GMM-IDX2).                     53860000
539300     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        53870000
539400                AT-GMM-PL-PADJ-WK4(GMM-IDX2).                     53880000
539500     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        53890000
539600                AT-GMM-PL-PADJ-WK5(GMM-IDX2).                     53900000
                                                                        53900141
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      53901041
              MOVE ZEROS              TO DWL2-PADJ-MTD-AMT              53902041
           ELSE                                                         53903041
539700        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                     53910041
539800                   AT-GMM-PL-PADJ-MTD(GMM-IDX2)                   53920041
           END-IF.                                                      53921041
539900                                                                  53930000
540000     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          53940000
540100                                                                  53950000
540200*   *** PLAN % FOR MONTH ***                                      53960000
540300     MOVE SPACES                         TO DWL2-HEADING.         53970000
540400     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      53980000
540500                                                                  53990000
540600*    WEEKLY GROSS RECEIPTS MTD PERCENT                            54000000
L1010      IF AT-GMM-PL-GR-MONTH(GMM-IDX2) = ZEROS                      54010087
540800        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       54020000
540900                                            DWL2-GR-WK2-AMT       54030000
541000                                            DWL2-GR-WK3-AMT       54040000
541100                                            DWL2-GR-WK4-AMT       54050000
541200                                            DWL2-GR-WK5-AMT       54060000
541300                                            DWL2-GR-MTD-AMT       54070000
541400     ELSE                                                         54080000
541500        COMPUTE PV-PCT =                                          54090000
541600               (AT-GMM-PL-GR-WK1(GMM-IDX2) /                      54100000
541700                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54110088
541800        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              54120000
541900        COMPUTE PV-PCT =                                          54130000
542000               (AT-GMM-PL-GR-WK2(GMM-IDX2) /                      54140000
542100                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54150088
542200        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              54160000
542300        COMPUTE PV-PCT =                                          54170000
542400               (AT-GMM-PL-GR-WK3(GMM-IDX2) /                      54180000
542500                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54190088
542600        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              54200000
542700        COMPUTE PV-PCT =                                          54210000
542800               (AT-GMM-PL-GR-WK4(GMM-IDX2) /                      54220000
542900                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54230088
543000        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              54240000
543100        COMPUTE PV-PCT =                                          54250000
543200               (AT-GMM-PL-GR-WK5(GMM-IDX2) /                      54260000
543300                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54270088
543400        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              54280000
543500        COMPUTE PV-PCT =                                          54290000
543600               (AT-GMM-PL-GR-MTD(GMM-IDX2) /                      54300000
543700                AT-GMM-PL-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54310088
543800        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              54320000
543900     END-IF.                                                      54330000
544000                                                                  54340000
544100*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      54350000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   54351046
544200        AT-GMM-PL-PADJ-MTD(GMM-IDX2) = ZEROS                      54360046
544300        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     54370000
544400                                            DWL2-PADJ-WK2-AMT     54380000
544500                                            DWL2-PADJ-WK3-AMT     54390000
544600                                            DWL2-PADJ-WK4-AMT     54400000
544700                                            DWL2-PADJ-WK5-AMT     54410000
544800                                            DWL2-PADJ-MTD-AMT     54420000
544900     ELSE                                                         54430000
545000        COMPUTE PV-PCT =                                          54440000
545100               (AT-GMM-PL-PADJ-WK1(GMM-IDX2) /                    54450000
545200                AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54460000
545300        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              54470000
545400        COMPUTE PV-PCT =                                          54480000
545500               (AT-GMM-PL-PADJ-WK2(GMM-IDX2) /                    54490000
545600                AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54500000
545700        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              54510000
545800        COMPUTE PV-PCT =                                          54520000
545900                AT-GMM-PL-PADJ-WK3(GMM-IDX2) /                    54530000
546000               (AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54540000
546100        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              54550000
546200        COMPUTE PV-PCT =                                          54560000
546300                AT-GMM-PL-PADJ-WK4(GMM-IDX2) /                    54570000
546400               (AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54580000
546500        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              54590000
546600        COMPUTE PV-PCT =                                          54600000
546700                AT-GMM-PL-PADJ-WK5(GMM-IDX2) /                    54610000
546800               (AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54620000
546900        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              54630000
547000        COMPUTE PV-PCT =                                          54640000
547100                AT-GMM-PL-PADJ-MTD(GMM-IDX2) /                    54650000
547200               (AT-GMM-PL-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        54660000
547300        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              54670000
547400     END-IF.                                                      54680000
547500                                                                  54690000
547600     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          54700000
547700                                                                  54710000
547800*   *** LAST YEAR % FOR MONTH ***                                 54720000
547900     MOVE SPACES                         TO DWL2-HEADING.         54730000
548000     MOVE PC-LYPMNTH                     TO DWL2-TOTAL-DESC.      54740000
548100                                                                  54750000
548200*    WEEKLY GROSS RECEIPTS MTD PERCENT                            54760000
L1010      IF AT-GMM-LY-GR-MONTH(GMM-IDX2) = ZEROS                      54770087
548400        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       54780000
548500                                            DWL2-GR-WK2-AMT       54790000
548600                                            DWL2-GR-WK3-AMT       54800000
548700                                            DWL2-GR-WK4-AMT       54810000
548800                                            DWL2-GR-WK5-AMT       54820000
548900                                            DWL2-GR-MTD-AMT       54830000
549000     ELSE                                                         54840000
549100        COMPUTE PV-PCT =                                          54850000
549200               (AT-GMM-LY-GR-WK1(GMM-IDX2) /                      54860000
549300                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54870088
549400        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              54880000
549500        COMPUTE PV-PCT =                                          54890000
549600               (AT-GMM-LY-GR-WK2(GMM-IDX2) /                      54900000
549700                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54910088
549800        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              54920000
549900        COMPUTE PV-PCT =                                          54930000
550000               (AT-GMM-LY-GR-WK3(GMM-IDX2) /                      54940000
550100                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54950088
550200        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              54960000
550300        COMPUTE PV-PCT =                                          54970000
550400               (AT-GMM-LY-GR-WK4(GMM-IDX2) /                      54980000
550500                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        54990088
550600        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              55000000
550700        COMPUTE PV-PCT =                                          55010000
550800               (AT-GMM-LY-GR-WK5(GMM-IDX2) /                      55020000
550900                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        55030088
551000        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              55040000
551100        COMPUTE PV-PCT =                                          55050000
551200               (AT-GMM-LY-GR-MTD(GMM-IDX2) /                      55060000
551300                AT-GMM-LY-GR-MONTH(GMM-IDX2)) * PC-HUNDRED        55070088
551400        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              55080000
551500     END-IF.                                                      55090000
551600                                                                  55100000
551700*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      55110000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   55111046
551800        AT-GMM-LY-PADJ-MTD(GMM-IDX2) = ZEROS                      55120046
551900        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     55130000
552000                                            DWL2-PADJ-WK2-AMT     55140000
552100                                            DWL2-PADJ-WK3-AMT     55150000
552200                                            DWL2-PADJ-WK4-AMT     55160000
552300                                            DWL2-PADJ-WK5-AMT     55170000
552400                                            DWL2-PADJ-MTD-AMT     55180000
552500     ELSE                                                         55190000
552600        COMPUTE PV-PCT =                                          55200000
552700               (AT-GMM-LY-PADJ-WK1(GMM-IDX2) /                    55210000
552800                AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55220000
552900        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              55230000
553000        COMPUTE PV-PCT =                                          55240000
553100               (AT-GMM-LY-PADJ-WK2(GMM-IDX2) /                    55250000
553200                AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55260000
553300        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              55270000
553400        COMPUTE PV-PCT =                                          55280000
553500                AT-GMM-LY-PADJ-WK3(GMM-IDX2) /                    55290000
553600               (AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55300000
553700        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              55310000
553800        COMPUTE PV-PCT =                                          55320000
553900                AT-GMM-LY-PADJ-WK4(GMM-IDX2) /                    55330000
554000               (AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55340000
554100        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              55350000
554200        COMPUTE PV-PCT =                                          55360000
554300                AT-GMM-LY-PADJ-WK5(GMM-IDX2) /                    55370000
554400               (AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55380000
554500        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              55390000
554600        COMPUTE PV-PCT =                                          55400000
554700                AT-GMM-LY-PADJ-MTD(GMM-IDX2) /                    55410000
554800               (AT-GMM-LY-PADJ-MTD(GMM-IDX2)) * PC-HUNDRED        55420000
554900        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              55430000
555000     END-IF.                                                      55440000
555100                                                                  55450000
555200     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          55460000
555300                                                                  55470000
555400     MOVE SPACES TO DWL2-DETAIL-WK-LINE-1.                        55480000
555500     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          55490000
555600                                                                  55500000
555700     SET GMM-IDX2 UP BY 1.                                        55510000
555800     MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-1.          55520000
555900                                                                  55530000
556000******************************************************************55540000
556100*  PRINT REPORT PAGE 2 COMPANY TOTALS.                            55550000
556200******************************************************************55560000
556300 4600-PROCESS-CMPY-PG2-TOTS.                                      55570000
556400                                                                  55580000
556500*** MOVE EACH TYPE OF COMPANY TOTAL TO DETAIL LINE                55590000
556600                                                                  55600000
556700*   *** ACTUALS ***                                               55610000
556800     MOVE PC-TOTAL-KOHLS                 TO DWL2-HEADING.         55620000
556900     MOVE PC-ACTUAL                      TO DWL2-TOTAL-DESC.      55630000
557000                                                                  55640000
557100*    WEEKLY GROSS RECEIPTS                                        55650000
557200     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        55660000
557300                AT-CMPY-TY-GR-WK1 /                               55670000
557400                PC-THOUSAND.                                      55680000
557500     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        55690000
557600                AT-CMPY-TY-GR-WK2 /                               55700000
557700                PC-THOUSAND.                                      55710000
557800     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        55720000
557900                AT-CMPY-TY-GR-WK3 /                               55730000
558000                PC-THOUSAND.                                      55740000
558100     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        55750000
558200                AT-CMPY-TY-GR-WK4 /                               55760000
558300                PC-THOUSAND.                                      55770000
558400     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        55780000
558500                AT-CMPY-TY-GR-WK5 /                               55790000
558600                PC-THOUSAND.                                      55800000
558700     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        55810000
558800                AT-CMPY-TY-GR-MTD /                               55820000
558900                PC-THOUSAND.                                      55830000
559000                                                                  55840000
559100*    WEEKLY PURCHASE ADJUSTMENTS                                  55850000
559200     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        55860000
559300                AT-CMPY-TY-PADJ-WK1 /                             55870000
559400                PC-THOUSAND.                                      55880000
559500     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        55890000
559600                AT-CMPY-TY-PADJ-WK2 /                             55900000
559700                PC-THOUSAND.                                      55910000
559800     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        55920000
559900                AT-CMPY-TY-PADJ-WK3 /                             55930000
560000                PC-THOUSAND.                                      55940000
560100     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        55950000
560200                AT-CMPY-TY-PADJ-WK4 /                             55960000
560300                PC-THOUSAND.                                      55970000
560400     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        55980000
560500                AT-CMPY-TY-PADJ-WK5 /                             55990000
560600                PC-THOUSAND.                                      56000000
560700     COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        56010000
560800                AT-CMPY-TY-PADJ-MTD /                             56020000
560900                PC-THOUSAND.                                      56030000
561000                                                                  56040000
561100     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          56050000
561200                                                                  56060000
561300*   *** ACTUALS % FOR MONTH ***                                   56070000
561400     MOVE SPACES                         TO DWL2-HEADING.         56080000
561500     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      56090000
561600                                                                  56100000
561700*    WEEKLY GROSS RECEIPTS MTD PERCENT                            56110000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   56111034
561800        AT-CMPY-TY-GR-MTD = ZEROS                                 56120034
561900        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       56130000
562000                                            DWL2-GR-WK2-AMT       56140000
562100                                            DWL2-GR-WK3-AMT       56150000
562200                                            DWL2-GR-WK4-AMT       56160000
562300                                            DWL2-GR-WK5-AMT       56170000
562400                                            DWL2-GR-MTD-AMT       56180000
562500     ELSE                                                         56190000
562600        COMPUTE PV-PCT =                                          56200000
562700               (AT-CMPY-TY-GR-WK1 /                               56210000
562800                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56220000
562900        COMPUTE DWL2-GR-WK1-AMT ROUNDED = PV-PCT                  56230000
563000        COMPUTE PV-PCT =                                          56240000
563100               (AT-CMPY-TY-GR-WK2 /                               56250000
563200                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56260000
563300        COMPUTE DWL2-GR-WK2-AMT ROUNDED = PV-PCT                  56270000
563400        COMPUTE PV-PCT =                                          56280000
563500               (AT-CMPY-TY-GR-WK3 /                               56290000
563600                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56300000
563700        COMPUTE DWL2-GR-WK3-AMT ROUNDED = PV-PCT                  56310000
563800        COMPUTE PV-PCT =                                          56320000
563900               (AT-CMPY-TY-GR-WK4 /                               56330000
564000                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56340000
564100        COMPUTE DWL2-GR-WK4-AMT ROUNDED = PV-PCT                  56350000
564200        COMPUTE PV-PCT =                                          56360000
564300               (AT-CMPY-TY-GR-WK5 /                               56370000
564400                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56380000
564500        COMPUTE DWL2-GR-WK5-AMT ROUNDED = PV-PCT                  56390000
564600        COMPUTE PV-PCT =                                          56400000
564700               (AT-CMPY-TY-GR-MTD /                               56410000
564800                AT-CMPY-TY-GR-MTD) * PC-HUNDRED                   56420000
564900        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              56430000
565000     END-IF.                                                      56440000
565100                                                                  56450000
565200                                                                  56460000
565300*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      56470000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   56471034
565400        AT-CMPY-TY-PADJ-MTD = ZEROS                               56480034
565500        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     56490000
565600                                            DWL2-PADJ-WK2-AMT     56500000
565700                                            DWL2-PADJ-WK3-AMT     56510000
565800                                            DWL2-PADJ-WK4-AMT     56520000
565900                                            DWL2-PADJ-WK5-AMT     56530000
566000                                            DWL2-PADJ-MTD-AMT     56540000
566100     ELSE                                                         56550000
566200        COMPUTE PV-PCT =                                          56560000
566300               (AT-CMPY-TY-PADJ-WK1 /                             56570000
566400                AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56580000
566500        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              56590000
566600        COMPUTE PV-PCT =                                          56600000
566700               (AT-CMPY-TY-PADJ-WK2 /                             56610000
566800                AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56620000
566900        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              56630000
567000        COMPUTE PV-PCT =                                          56640000
567100                AT-CMPY-TY-PADJ-WK3 /                             56650000
567200               (AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56660000
567300        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              56670000
567400        COMPUTE PV-PCT =                                          56680000
567500                AT-CMPY-TY-PADJ-WK4 /                             56690000
567600               (AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56700000
567700        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              56710000
567800        COMPUTE PV-PCT =                                          56720000
567900                AT-CMPY-TY-PADJ-WK5 /                             56730000
568000               (AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56740000
568100        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              56750000
568200        COMPUTE PV-PCT =                                          56760000
568300                AT-CMPY-TY-PADJ-MTD /                             56770000
568400               (AT-CMPY-TY-PADJ-MTD) * PC-HUNDRED                 56780000
568500        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              56790000
568600     END-IF.                                                      56800000
568700                                                                  56810000
568800     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          56820000
568900                                                                  56830000
569000*   *** FORECAST ***                                              56840000
569100     MOVE SPACES                       TO DWL2-HEADING.           56850000
569200     MOVE PC-FCST                      TO DWL2-TOTAL-DESC.        56860000
569300                                                                  56870000
569400*    WEEKLY GROSS RECEIPTS                                        56880000
569500     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        56890000
569600                AT-CMPY-FC-GR-WK1.                                56900000
569700     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        56910000
569800                AT-CMPY-FC-GR-WK2.                                56920000
569900     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        56930000
570000                AT-CMPY-FC-GR-WK3.                                56940000
570100     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        56950000
570200                AT-CMPY-FC-GR-WK4.                                56960000
570300     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        56970000
570400                AT-CMPY-FC-GR-WK5.                                56980000
570500     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        56990000
570600                AT-CMPY-FC-GR-MTD.                                57000000
570700                                                                  57010000
570800*    WEEKLY PURCHASES                                             57020000
570900     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        57030000
571000                AT-CMPY-FC-PADJ-WK1.                              57040000
571100     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        57050000
571200                AT-CMPY-FC-PADJ-WK2.                              57060000
571300     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        57070000
571400                AT-CMPY-FC-PADJ-WK3.                              57080000
571500     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        57090000
571600                AT-CMPY-FC-PADJ-WK4.                              57100000
571700     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        57110000
571800                AT-CMPY-FC-PADJ-WK5.                              57120000
571900     COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                        57130000
572000                AT-CMPY-FC-PADJ-MTD.                              57140000
572100                                                                  57150000
572200     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          57160000
572300                                                                  57170000
572400*   *** FORECAST % FOR MONTH ***                                  57180000
572500     MOVE SPACES                         TO DWL2-HEADING.         57190000
572600     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      57200000
572700                                                                  57210000
572800*    WEEKLY GROSS RECEIPTS MTD PERCENT                            57220000
L1010      IF AT-CMPY-FC-GR-MONTH = ZEROS                               57230087
573000        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       57240000
573100                                            DWL2-GR-WK2-AMT       57250000
573200                                            DWL2-GR-WK3-AMT       57260000
573300                                            DWL2-GR-WK4-AMT       57270000
573400                                            DWL2-GR-WK5-AMT       57280000
573500                                            DWL2-GR-MTD-AMT       57290000
573600     ELSE                                                         57300000
573700        COMPUTE PV-PCT =                                          57310000
573800               (AT-CMPY-FC-GR-WK1 /                               57320000
573900                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57330088
574000        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              57340000
574100        COMPUTE PV-PCT =                                          57350000
574200               (AT-CMPY-FC-GR-WK2 /                               57360000
574300                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57370088
574400        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              57380000
574500        COMPUTE PV-PCT =                                          57390000
574600               (AT-CMPY-FC-GR-WK3 /                               57400000
574700                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57410088
574800        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              57420000
574900        COMPUTE PV-PCT =                                          57430000
575000               (AT-CMPY-FC-GR-WK4 /                               57440000
575100                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57450088
575200        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              57460000
575300        COMPUTE PV-PCT =                                          57470000
575400               (AT-CMPY-FC-GR-WK5 /                               57480000
575500                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57490088
575600        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              57500000
575700        COMPUTE PV-PCT =                                          57510000
575800               (AT-CMPY-FC-GR-MTD /                               57520000
575900                AT-CMPY-FC-GR-MONTH) * PC-HUNDRED                 57530088
576000        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              57540000
576100     END-IF.                                                      57550000
576200                                                                  57560000
576300*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      57570000
      *    IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   57571045
576400     IF AT-CMPY-FC-PADJ-MTD = ZEROS                               57580045
576500        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     57590000
576600                                            DWL2-PADJ-WK2-AMT     57600000
576700                                            DWL2-PADJ-WK3-AMT     57610000
576800                                            DWL2-PADJ-WK4-AMT     57620000
576900                                            DWL2-PADJ-WK5-AMT     57630000
577000                                            DWL2-PADJ-MTD-AMT     57640000
577100     ELSE                                                         57650000
577200        COMPUTE PV-PCT =                                          57660000
577300               (AT-CMPY-FC-PADJ-WK1 /                             57670000
577400                AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57680000
577500        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              57690000
577600        COMPUTE PV-PCT =                                          57700000
577700               (AT-CMPY-FC-PADJ-WK2 /                             57710000
577800                AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57720000
577900        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              57730000
578000        COMPUTE PV-PCT =                                          57740000
578100                AT-CMPY-FC-PADJ-WK3 /                             57750000
578200               (AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57760000
578300        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              57770000
578400        COMPUTE PV-PCT =                                          57780000
578500                AT-CMPY-FC-PADJ-WK4 /                             57790000
578600               (AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57800000
578700        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              57810000
578800        COMPUTE PV-PCT =                                          57820000
578900                AT-CMPY-FC-PADJ-WK5 /                             57830000
579000               (AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57840000
579100        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              57850000
579200        COMPUTE PV-PCT =                                          57860000
579300                AT-CMPY-FC-PADJ-MTD /                             57870000
579400               (AT-CMPY-FC-PADJ-MTD) * PC-HUNDRED                 57880000
579500        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              57890000
579600     END-IF.                                                      57900000
579700                                                                  57910000
579800     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          57920000
579900                                                                  57930000
580000*   *** PLAN ***                                                  57940000
580100     MOVE SPACES                       TO DWL2-HEADING.           57950000
21517      MOVE PC-PLAN                      TO DWL2-TOTAL-DESC.        57960092
580300                                                                  57970000
580400*    WEEKLY GROSS RECEIPTS                                        57980000
580500     COMPUTE DWL2-GR-WK1-AMT     ROUNDED =                        57990000
580600                AT-CMPY-PL-GR-WK1.                                58000000
580700     COMPUTE DWL2-GR-WK2-AMT     ROUNDED =                        58010000
580800                AT-CMPY-PL-GR-WK2.                                58020000
580900     COMPUTE DWL2-GR-WK3-AMT     ROUNDED =                        58030000
581000                AT-CMPY-PL-GR-WK3.                                58040000
581100     COMPUTE DWL2-GR-WK4-AMT     ROUNDED =                        58050000
581200                AT-CMPY-PL-GR-WK4.                                58060000
581300     COMPUTE DWL2-GR-WK5-AMT     ROUNDED =                        58070000
581400                AT-CMPY-PL-GR-WK5.                                58080000
581500     COMPUTE DWL2-GR-MTD-AMT     ROUNDED =                        58090000
581600                AT-CMPY-PL-GR-MTD.                                58100000
581700                                                                  58110000
581800*    WEEKLY PURCHASES                                             58120000
581900     COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED =                        58130000
582000                AT-CMPY-PL-PADJ-WK1.                              58140000
582100     COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED =                        58150000
582200                AT-CMPY-PL-PADJ-WK2.                              58160000
582300     COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED =                        58170000
582400                AT-CMPY-PL-PADJ-WK3.                              58180000
582500     COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED =                        58190000
582600                AT-CMPY-PL-PADJ-WK4.                              58200000
582700     COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED =                        58210000
582800                AT-CMPY-PL-PADJ-WK5.                              58220000
                                                                        58220141
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN                      58221041
              MOVE ZEROS              TO DWL2-PADJ-MTD-AMT              58222041
           ELSE                                                         58223041
582900        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED =                     58230041
583000                   AT-CMPY-PL-PADJ-MTD                            58240041
           END-IF.                                                      58241041
583100                                                                  58250000
583200     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          58260000
583300                                                                  58270000
583400*   *** PLAN % FOR MONTH ***                                      58280000
583500     MOVE SPACES                         TO DWL2-HEADING.         58290000
583600     MOVE PC-PMNTH                       TO DWL2-TOTAL-DESC.      58300000
583700                                                                  58310000
583800*    WEEKLY GROSS RECEIPTS MTD PERCENT                            58320000
L1010      IF AT-CMPY-PL-GR-MONTH = ZEROS                               58330087
584000        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       58340000
584100                                            DWL2-GR-WK2-AMT       58350000
584200                                            DWL2-GR-WK3-AMT       58360000
584300                                            DWL2-GR-WK4-AMT       58370000
584400                                            DWL2-GR-WK5-AMT       58380000
584500                                            DWL2-GR-MTD-AMT       58390000
584600     ELSE                                                         58400000
584700        COMPUTE PV-PCT =                                          58410000
584800               (AT-CMPY-PL-GR-WK1 /                               58420000
584900                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58430088
585000        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              58440000
585100        COMPUTE PV-PCT =                                          58450000
585200               (AT-CMPY-PL-GR-WK2 /                               58460000
585300                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58470088
585400        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              58480000
585500        COMPUTE PV-PCT =                                          58490000
585600               (AT-CMPY-PL-GR-WK3 /                               58500000
585700                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58510088
585800        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              58520000
585900        COMPUTE PV-PCT =                                          58530000
586000               (AT-CMPY-PL-GR-WK4 /                               58540000
586100                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58550088
586200        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              58560000
586300        COMPUTE PV-PCT =                                          58570000
586400               (AT-CMPY-PL-GR-WK5 /                               58580000
586500                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58590088
586600        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              58600000
586700        COMPUTE PV-PCT =                                          58610000
586800               (AT-CMPY-PL-GR-MTD /                               58620088
586900                AT-CMPY-PL-GR-MONTH) * PC-HUNDRED                 58630088
587000        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              58640000
587100     END-IF.                                                      58650000
587200                                                                  58660000
587300*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      58670000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   58671046
587400        AT-CMPY-PL-PADJ-MTD = ZEROS                               58680046
587500        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     58690000
587600                                            DWL2-PADJ-WK2-AMT     58700000
587700                                            DWL2-PADJ-WK3-AMT     58710000
587800                                            DWL2-PADJ-WK4-AMT     58720000
587900                                            DWL2-PADJ-WK5-AMT     58730000
588000                                            DWL2-PADJ-MTD-AMT     58740000
588100     ELSE                                                         58750000
588200        COMPUTE PV-PCT =                                          58760000
588300               (AT-CMPY-PL-PADJ-WK1 /                             58770000
588400                AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58780000
588500        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              58790000
588600        COMPUTE PV-PCT =                                          58800000
588700               (AT-CMPY-PL-PADJ-WK2 /                             58810000
588800                AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58820000
588900        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              58830000
589000        COMPUTE PV-PCT =                                          58840000
589100                AT-CMPY-PL-PADJ-WK3 /                             58850000
589200               (AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58860000
589300        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              58870000
589400        COMPUTE PV-PCT =                                          58880000
589500                AT-CMPY-PL-PADJ-WK4 /                             58890000
589600               (AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58900000
589700        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              58910000
589800        COMPUTE PV-PCT =                                          58920000
589900                AT-CMPY-PL-PADJ-WK5 /                             58930000
590000               (AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58940000
590100        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              58950000
590200        COMPUTE PV-PCT =                                          58960000
590300                AT-CMPY-PL-PADJ-MTD /                             58970000
590400               (AT-CMPY-PL-PADJ-MTD) * PC-HUNDRED                 58980000
590500        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              58990000
590600     END-IF.                                                      59000000
590700                                                                  59010000
590800     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          59020000
590900                                                                  59030000
591000*   *** LAST YEAR % FOR MONTH ***                                 59040000
591100     MOVE SPACES                         TO DWL2-HEADING.         59050000
591200     MOVE PC-LYPMNTH                     TO DWL2-TOTAL-DESC.      59060000
591300                                                                  59070000
591400*    WEEKLY GROSS RECEIPTS MTD PERCENT                            59080000
L1010      IF AT-CMPY-LY-GR-MONTH = ZEROS                               59090087
591600        MOVE ZEROS                       TO DWL2-GR-WK1-AMT       59100000
591700                                            DWL2-GR-WK2-AMT       59110000
591800                                            DWL2-GR-WK3-AMT       59120000
591900                                            DWL2-GR-WK4-AMT       59130000
592000                                            DWL2-GR-WK5-AMT       59140000
592100                                            DWL2-GR-MTD-AMT       59150000
592200     ELSE                                                         59160000
592300        COMPUTE PV-PCT =                                          59170000
592400               (AT-CMPY-LY-GR-WK1 /                               59180000
592500                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59190088
592600        COMPUTE DWL2-GR-WK1-AMT     ROUNDED = PV-PCT              59200000
592700        COMPUTE PV-PCT =                                          59210000
592800               (AT-CMPY-LY-GR-WK2 /                               59220000
592900                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59230088
593000        COMPUTE DWL2-GR-WK2-AMT     ROUNDED = PV-PCT              59240000
593100        COMPUTE PV-PCT =                                          59250000
593200               (AT-CMPY-LY-GR-WK3 /                               59260000
593300                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59270088
593400        COMPUTE DWL2-GR-WK3-AMT     ROUNDED = PV-PCT              59280000
593500        COMPUTE PV-PCT =                                          59290000
593600               (AT-CMPY-LY-GR-WK4 /                               59300000
593700                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59310088
593800        COMPUTE DWL2-GR-WK4-AMT     ROUNDED = PV-PCT              59320000
593900        COMPUTE PV-PCT =                                          59330000
594000               (AT-CMPY-LY-GR-WK5 /                               59340000
594100                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59350088
594200        COMPUTE DWL2-GR-WK5-AMT     ROUNDED = PV-PCT              59360000
594300        COMPUTE PV-PCT =                                          59370000
594400               (AT-CMPY-LY-GR-MTD /                               59380088
594500                AT-CMPY-LY-GR-MONTH) * PC-HUNDRED                 59390088
594600        COMPUTE DWL2-GR-MTD-AMT     ROUNDED = PV-PCT              59400000
594700     END-IF.                                                      59410000
594800                                                                  59420000
594900*    WEEKLY PURCHASE ADJUSTMENTS MTD PERCENT                      59430000
           IF SS-OPEN-WK NOT = PV-TY-LAST-WK-IN-MN OR                   59431046
595000        AT-CMPY-LY-PADJ-MTD = ZEROS                               59440046
595100        MOVE ZEROS                       TO DWL2-PADJ-WK1-AMT     59450000
595200                                            DWL2-PADJ-WK2-AMT     59460000
595300                                            DWL2-PADJ-WK3-AMT     59470000
595400                                            DWL2-PADJ-WK4-AMT     59480000
595500                                            DWL2-PADJ-WK5-AMT     59490000
595600                                            DWL2-PADJ-MTD-AMT     59500000
595700     ELSE                                                         59510000
595800        COMPUTE PV-PCT =                                          59520000
595900               (AT-CMPY-LY-PADJ-WK1 /                             59530000
596000                AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59540000
596100        COMPUTE DWL2-PADJ-WK1-AMT   ROUNDED = PV-PCT              59550000
596200        COMPUTE PV-PCT =                                          59560000
596300               (AT-CMPY-LY-PADJ-WK2 /                             59570000
596400                AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59580000
596500        COMPUTE DWL2-PADJ-WK2-AMT   ROUNDED = PV-PCT              59590000
596600        COMPUTE PV-PCT =                                          59600000
596700                AT-CMPY-LY-PADJ-WK3 /                             59610000
596800               (AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59620000
596900        COMPUTE DWL2-PADJ-WK3-AMT   ROUNDED = PV-PCT              59630000
597000        COMPUTE PV-PCT =                                          59640000
597100                AT-CMPY-LY-PADJ-WK4 /                             59650000
597200               (AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59660000
597300        COMPUTE DWL2-PADJ-WK4-AMT   ROUNDED = PV-PCT              59670000
597400        COMPUTE PV-PCT =                                          59680000
597500                AT-CMPY-LY-PADJ-WK5 /                             59690000
597600               (AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59700000
597700        COMPUTE DWL2-PADJ-WK5-AMT   ROUNDED = PV-PCT              59710000
597800        COMPUTE PV-PCT =                                          59720000
597900                AT-CMPY-LY-PADJ-MTD /                             59730000
598000               (AT-CMPY-LY-PADJ-MTD) * PC-HUNDRED                 59740000
598100        COMPUTE DWL2-PADJ-MTD-AMT   ROUNDED = PV-PCT              59750000
598200     END-IF.                                                      59760000
598300                                                                  59770000
598400     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          59780000
598500                                                                  59790000
598600     MOVE SPACES TO DWL2-DETAIL-WK-LINE-1.                        59800000
598700     PERFORM 7610-PRINT-WK-DETAIL-LINE2.                          59810000
598800                                                                  59820000
598900******************************************************************59830000
599000*  CREATE REPORT PAGE 3 DMM YTD                                   59840000
599100******************************************************************59850000
599200 4700-CREATE-YTD-REPORT.                                          59860065
                                                                        59860165
241100     PERFORM 4710-PROCESS-DMM-PAGE3                               59860365
241200        VARYING DMM-IDX3 FROM DMM-IDX3 BY 1                       59860467
241300          UNTIL AT-DMM-GMM-NBR-PG3(DMM-IDX3) NOT = HN-GMA-NBR     59860565
241400             OR DMM-IDX3 > PS-DMMS-LOADED.                        59860666
                                                                        59860765
241300     MOVE AT-DMM-GMM-NBR-PG3(DMM-IDX3) TO    HN-GMA-NBR.          59860866
                                                                        59860966
241500*    PRINT GMM YTD TOTALS - PAGE3                                 59861070
           PERFORM 7630-PRINT-SEPARATOR-LINE.                           59861165
241600     PERFORM 4800-PROCESS-GMM-PAGE3.                              59861265
                                                                        59861382
241700*    PRINT COMPANY YTD TOTALS  - PAGE3                            59861482
           PERFORM 7630-PRINT-SEPARATOR-LINE.                           59861582
241800     PERFORM 4900-PROCESS-CMPY-PAGE3.                             59861682
                                                                        59861765
 98900******************************************************************59861865
599000*  CREATE REPORT PAGE 3 DMM YTD                                   59862065
599100******************************************************************59863065
599200 4710-PROCESS-DMM-PAGE3.                                          59864065
599300                                                                  59870000
599400     IF PV-LINE-COUNTER-3 > PC-PAGE-MAX-LINES                     59880000
              MOVE PC-YTD                  TO PH2-YTD-FOR-YTD-RPT       59881048
132900        MOVE 2                       TO DP200O-REPORT-NUMBER      59890000
599500        MOVE 7                       TO PV-LINE-COUNTER-3         59900000
599600        PERFORM 7200-PRINT-PAGE-HEADINGS                          59910000
599700        PERFORM 7500-PRINT-COL-PG3-HEADINGS                       59920000
599800     END-IF.                                                      59930000
599900                                                                  59940000
600000*   *** ACTUALS ***                                               59950000
600100     MOVE AT-DMM-DESC-PG3(DMM-IDX3)    TO DYL3-HEADING.           59960000
600200     MOVE PC-ACTUAL                    TO DYL3-TOTAL-DESC.        59970000
600300                                                                  59980000
600400*    YTD SALES                                                    59990000
600500     COMPUTE DYL3-SLS-YTD      ROUNDED =                          60000000
600600                AT-DMM-TY-SLS-YTD(DMM-IDX3) /                     60010000
600700                PC-THOUSAND.                                      60020000
600400*    YTD COMP SALES                                               60021062
600500     COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          60022062
600600                AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) /                60023062
600700                PC-THOUSAND.                                      60024062
600800*    YTD GROSS MARGIN                                             60030000
600900     COMPUTE DYL3-GM-YTD       ROUNDED =                          60040000
601000                AT-DMM-TY-GM-YTD(DMM-IDX3) /                      60050000
601100                PC-THOUSAND.                                      60060000
601200*    YTD END-OF-MONTH INVENTROY                                   60070000
601300     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      60080000
601400                AT-DMM-TY-EOM-YTD(DMM-IDX3) /                     60090000
601500                PC-THOUSAND.                                      60100000
                                                                        60101000
601600*    YTD INVENTORY AVG                                            60110000
601700     COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                      60120000
601800              ((AT-DMM-TY-INV-YTD(DMM-IDX3) /                     60130000
601900               (PV-INV-MONTHS))   /                               60140064
602000                PC-THOUSAND).                                     60150000
602100                                                                  60160000
602200*    YTD INVENTORY TURN THIS YEAR                                 60170000
602300     IF AT-DMM-TY-INV-YTD(DMM-IDX3) = ZEROS                       60180085
602400        MOVE ZEROS                TO DYL3-INV-TURN-YTD            60190000
602500     ELSE                                                         60200000
602600        COMPUTE PV-PCT =                                          60210000
602700             (AT-DMM-TY-SLS-YTD(DMM-IDX3) /                       60220000
602800             (AT-DMM-TY-INV-YTD(DMM-IDX3) /                       60230000
602900             (PV-INV-MONTHS)))                                    60240064
603000        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           60250000
603100     END-IF.                                                      60260000
603200                                                                  60270000
603300*    YTD CUMM MKON PCT                                            60280000
603400     IF AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3) = ZERO                   60290000
603500        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               60300000
603600     ELSE                                                         60310000
603700        COMPUTE PV-PCT =                                          60320000
603800               ((AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3) -               60330016
603900                 AT-DMM-TY-PRCH-CST-YTD(DMM-IDX3)) * PC-HUNDRED) /60340000
604000                 AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3)                 60350000
604100        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           60360000
604200     END-IF.                                                      60370000
604300                                                                  60380000
604400*    YTD MARKDOWN                                                 60390000
604500     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          60400000
604600                AT-DMM-TY-MKDN-YTD(DMM-IDX3) /                    60410000
604700                PC-THOUSAND.                                      60420000
604800                                                                  60430000
604900*    YTD GM %                                                     60440000
605000     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS                       60450000
605100        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           60460000
605200     ELSE                                                         60470000
605300        COMPUTE PV-PCT =                                          60480000
605400               (AT-DMM-TY-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        60490000
605500                AT-DMM-TY-SLS-YTD(DMM-IDX3)                       60500000
605600        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              60510000
605700     END-IF.                                                      60520000
605800                                                                  60530000
605900*    YTD MKDN %                                                   60540000
606000     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS                       60550000
606100        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         60560000
606200     ELSE                                                         60570000
606300        COMPUTE PV-PCT =                                          60580000
606400               (AT-DMM-TY-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      60590000
606500                AT-DMM-TY-SLS-YTD(DMM-IDX3)                       60600000
606600        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            60610000
606700     END-IF.                                                      60620000
606800                                                                  60630000
606900     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         60640000
607000                                                                  60650000
607100*   *** FORECAST ***                                              60660000
607200     MOVE AT-DMM-NAME-PG3(DMM-IDX3)    TO DYL3-HEADING.           60670000
607300     MOVE PC-FCST                      TO DYL3-TOTAL-DESC.        60680000
607400                                                                  60690000
607500     COMPUTE DYL3-SLS-YTD       ROUNDED =                         60700000
607600                AT-DMM-FC-SLS-YTD(DMM-IDX3).                      60710000
607500*N/A COMPUTE DYL3-COMP-SLS-YTD       ROUNDED =                    60711062
607600*               AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3).                 60712062
607700     COMPUTE DYL3-GM-YTD        ROUNDED =                         60720000
607800                AT-DMM-FC-GM-YTD(DMM-IDX3).                       60730000
607900     COMPUTE DYL3-INV-EOM-YTD       ROUNDED =                     60740000
608000                AT-DMM-FC-EOM-YTD(DMM-IDX3).                      60750000
608100*                                                                 60760000
608200     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             60770000
608300                                     DYL3-INV-TURN-YTD.           60780000
608400                                                                  60790000
608500     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         60800000
608600                AT-DMM-FC-MKDN-YTD(DMM-IDX3).                     60810000
608700                                                                  60820000
608800*    GM %                                                         60830000
608900     IF AT-DMM-FC-SLS-YTD(DMM-IDX3) = ZEROS                       60840000
609000        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           60850000
609100     ELSE                                                         60860000
609200        COMPUTE PV-PCT =                                          60870000
609300               (AT-DMM-FC-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        60880000
609400                AT-DMM-FC-SLS-YTD(DMM-IDX3)                       60890000
609500        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              60900000
609600     END-IF.                                                      60910000
609700                                                                  60920000
609800*    MKDN %                                                       60930000
609900     IF AT-DMM-FC-SLS-YTD(DMM-IDX3) = ZEROS                       60940000
610000        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         60950000
610100     ELSE                                                         60960000
610200        COMPUTE PV-PCT =                                          60970000
610300               (AT-DMM-FC-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      60980000
610400                AT-DMM-FC-SLS-YTD(DMM-IDX3)                       60990000
610500        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            61000000
610600     END-IF.                                                      61010000
610700                                                                  61020000
610800     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         61030000
610900                                                                  61040000
611000*   *** PLAN ***                                                  61050000
611100     MOVE SPACES                       TO DYL3-HEADING.           61060000
611200     MOVE PC-PLAN                      TO DYL3-TOTAL-DESC.        61070000
611300                                                                  61080000
611400     COMPUTE DYL3-SLS-YTD       ROUNDED =                         61090000
611500                AT-DMM-PL-SLS-YTD(DMM-IDX3).                      61100000
611400     COMPUTE DYL3-COMP-SLS-YTD  ROUNDED =                         61101062
611500                AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3).                 61102062
611600     COMPUTE DYL3-GM-YTD        ROUNDED =                         61110000
611700                AT-DMM-PL-GM-YTD(DMM-IDX3).                       61120000
611800     COMPUTE DYL3-INV-EOM-YTD   ROUNDED =                         61130000
611900                AT-DMM-PL-EOM-YTD(DMM-IDX3).                      61140000
612000*                                                                 61150000
612100     COMPUTE DYL3-INV-AVG-YTD   ROUNDED =                         61160000
612200               (AT-DMM-PL-INV-YTD(DMM-IDX3) /                     61170000
612300               (PV-INV-MONTHS)).                                  61180064
612400                                                                  61190000
612500*    YTD INVENTORY TURN                                           61200021
612600     IF AT-DMM-PL-INV-YTD(DMM-IDX3) = ZEROS                       61210085
612700        MOVE ZEROS                TO DYL3-INV-TURN-YTD            61220000
612800     ELSE                                                         61230000
612900        COMPUTE PV-PCT =                                          61240000
613000             (AT-DMM-PL-SLS-YTD(DMM-IDX3) /                       61250000
613100             (AT-DMM-PL-INV-YTD(DMM-IDX3) /                       61260000
613200             (PV-INV-MONTHS)))                                    61270064
613300        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           61280000
613400     END-IF.                                                      61290000
613500                                                                  61300000
613600     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         61310000
613700                AT-DMM-PL-MKDN-YTD(DMM-IDX3).                     61320000
613800                                                                  61330000
613900*    GM %                                                         61340000
614000     IF AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       61350000
614100        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           61360000
614200     ELSE                                                         61370000
614300        COMPUTE PV-PCT =                                          61380000
614400               (AT-DMM-PL-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        61390000
614500                AT-DMM-PL-SLS-YTD(DMM-IDX3)                       61400000
614600        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              61410000
614700     END-IF.                                                      61420000
614800                                                                  61430000
614900*    MKDN %                                                       61440000
615000     IF AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       61450000
615100        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         61460000
615200     ELSE                                                         61470000
615300        COMPUTE PV-PCT =                                          61480000
615400               (AT-DMM-PL-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      61490000
615500                AT-DMM-PL-SLS-YTD(DMM-IDX3)                       61500000
615600        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            61510000
615700     END-IF.                                                      61520000
615800                                                                  61530000
615900     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         61540000
616000                                                                  61550000
616100*   *** VARIANCE FORECAST ***                                     61560000
616200     MOVE SPACES                       TO DYL3-HEADING.           61570000
616300     MOVE PC-VAR-FCST                  TO DYL3-TOTAL-DESC.        61580000
616400                                                                  61590000
616500     COMPUTE DYL3-SLS-YTD      ROUNDED =                          61600000
616600              (AT-DMM-TY-SLS-YTD(DMM-IDX3) /                      61610000
616700                PC-THOUSAND) -                                    61620000
616800                AT-DMM-FC-SLS-YTD(DMM-IDX3)                       61630000
616500*N/A COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          61631062
616600*             (AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) /                 61632062
616700*               PC-THOUSAND) -                                    61633062
616800*               AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3)                  61634062
616900     COMPUTE DYL3-GM-YTD       ROUNDED =                          61640000
617000              (AT-DMM-TY-GM-YTD(DMM-IDX3) /                       61650000
617100                PC-THOUSAND) -                                    61660000
617200                AT-DMM-FC-GM-YTD(DMM-IDX3)                        61670000
617300     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      61680000
617400              (AT-DMM-TY-EOM-YTD(DMM-IDX3) /                      61690000
617500                PC-THOUSAND) -                                    61700000
617600                AT-DMM-FC-EOM-YTD(DMM-IDX3)                       61710000
617700*                                                                 61720000
617800     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             61730000
617900                                     DYL3-INV-TURN-YTD.           61740000
618000                                                                  61750000
618100     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          61760000
618200              (AT-DMM-TY-MKDN-YTD(DMM-IDX3) /                     61770000
618300                PC-THOUSAND) -                                    61780000
618400                AT-DMM-FC-MKDN-YTD(DMM-IDX3)                      61790000
618500                                                                  61800000
618600*    GM %                                                         61810000
618700     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    61820000
618800        AT-DMM-FC-SLS-YTD(DMM-IDX3) = ZEROS                       61830000
618900        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           61840000
619000     ELSE                                                         61850000
619100        COMPUTE PV-PCT =                                          61860000
619200              ((AT-DMM-TY-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        61870000
619300                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    61880000
619400              ((AT-DMM-FC-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        61890000
619500                AT-DMM-FC-SLS-YTD(DMM-IDX3))                      61900000
619600        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              61910000
619700     END-IF.                                                      61920000
619800                                                                  61930000
619900*    MKDN %                                                       61940000
620000     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    61950000
620100        AT-DMM-FC-SLS-YTD(DMM-IDX3) = ZEROS                       61960000
620200        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         61970000
620300     ELSE                                                         61980000
620400        COMPUTE PV-PCT =                                          61990000
620500              ((AT-DMM-TY-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      62000000
620600                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    62010000
620700              ((AT-DMM-FC-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      62020000
620800                AT-DMM-FC-SLS-YTD(DMM-IDX3))                      62030000
620900        COMPUTE DYL3-MKDN-PCT-YTD   ROUNDED = PV-PCT              62040000
621000     END-IF.                                                      62050000
621100                                                                  62060000
621200     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         62070000
621300                                                                  62080000
621400*   *** VARIANCE PLAN ***                                         62090000
621500     MOVE SPACES                       TO DYL3-HEADING.           62100000
621600     MOVE PC-VAR-PL                    TO DYL3-TOTAL-DESC.        62110000
621700                                                                  62120000
621800     COMPUTE DYL3-SLS-YTD      ROUNDED =                          62130000
621900              (AT-DMM-TY-SLS-YTD(DMM-IDX3) /                      62140000
622000                PC-THOUSAND) -                                    62150000
622100                AT-DMM-PL-SLS-YTD(DMM-IDX3)                       62160000
621800     COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          62161062
621900              (AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) /                 62162062
622000                PC-THOUSAND) -                                    62163062
622100                AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3)                  62164062
622200     COMPUTE DYL3-GM-YTD       ROUNDED =                          62170000
622300              (AT-DMM-TY-GM-YTD(DMM-IDX3) /                       62180000
622400                PC-THOUSAND) -                                    62190000
622500                AT-DMM-PL-GM-YTD(DMM-IDX3)                        62200000
622600     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      62210000
622700              (AT-DMM-TY-EOM-YTD(DMM-IDX3) /                      62220000
622800                PC-THOUSAND) -                                    62230000
622900                AT-DMM-PL-EOM-YTD(DMM-IDX3)                       62240000
623000                                                                  62250000
623100     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    62260000
623200        AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       62270000
623300        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           62280000
623400     ELSE                                                         62290000
623500        COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                   62300000
623600                (((AT-DMM-TY-INV-YTD(DMM-IDX3) /                  62310000
623700                  (PV-INV-MONTHS))   /                            62320064
623800                   PC-THOUSAND) -                                 62330000
623900                  (AT-DMM-PL-INV-YTD(DMM-IDX3) /                  62340000
624000                  (PV-INV-MONTHS)))                               62350064
624100     END-IF.                                                      62360000
                                                                        62361086
624200*    INVENTORY TURN PLAN VAR                                      62370086
612600     IF AT-DMM-TY-INV-YTD(DMM-IDX3) = ZEROS OR                    62381085
612600        AT-DMM-PL-INV-YTD(DMM-IDX3) = ZEROS                       62381185
612700        MOVE ZEROS                TO DYL3-INV-TURN-YTD            62382085
612800     ELSE                                                         62383085
602600        COMPUTE PV-PCT =                                          62383185
602700            ((AT-DMM-TY-SLS-YTD(DMM-IDX3) /                       62383285
602800             (AT-DMM-TY-INV-YTD(DMM-IDX3) /                       62383385
602900             (PV-INV-MONTHS))) -                                  62383485
613000             (AT-DMM-PL-SLS-YTD(DMM-IDX3) /                       62385085
613100             (AT-DMM-PL-INV-YTD(DMM-IDX3) /                       62386085
613200             (PV-INV-MONTHS))))                                   62387085
613300        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           62388085
613400     END-IF.                                                      62389085
624400                                                                  62390000
624500     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          62400000
624600              (AT-DMM-TY-MKDN-YTD(DMM-IDX3) /                     62410000
624700                PC-THOUSAND) -                                    62420000
624800                AT-DMM-PL-MKDN-YTD(DMM-IDX3)                      62430000
624900                                                                  62440000
625000*    GM %                                                         62450000
625100     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    62460000
625200        AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       62470000
625300        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           62480000
625400     ELSE                                                         62490000
625500        COMPUTE PV-PCT =                                          62500000
625600              ((AT-DMM-TY-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        62510000
625700                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    62520000
625800              ((AT-DMM-PL-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        62530000
625900                AT-DMM-PL-SLS-YTD(DMM-IDX3))                      62540000
626000        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              62550000
626100     END-IF.                                                      62560000
626200                                                                  62570000
626300*    MKDN %                                                       62580000
626400     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    62590000
626500        AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       62600000
626600        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         62610000
626700     ELSE                                                         62620000
626800        COMPUTE PV-PCT =                                          62630000
626900              ((AT-DMM-TY-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      62640000
627000                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    62650000
627100              ((AT-DMM-PL-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      62660000
627200                AT-DMM-PL-SLS-YTD(DMM-IDX3))                      62670000
627300        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            62680000
627400     END-IF.                                                      62690000
627500                                                                  62700000
627600     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         62710000
627700                                                                  62720000
627800*   *** PCT VARIANCE FORECAST ***                                 62730000
627900     MOVE SPACES                       TO DYL3-HEADING.           62740000
628000     MOVE PC-PVARFCST                  TO DYL3-TOTAL-DESC.        62750000
628100                                                                  62760000
628200     IF AT-DMM-FC-SLS-YTD(DMM-IDX3) = ZEROS                       62770000
628300        MOVE ZEROS                     TO DYL3-SLS-YTD            62780000
628400     ELSE                                                         62790000
628500        COMPUTE PV-PCT =                                          62800000
628600                (((AT-DMM-TY-SLS-YTD(DMM-IDX3) /                  62810000
628700                   PC-THOUSAND) -                                 62820000
628800                   AT-DMM-FC-SLS-YTD(DMM-IDX3)) /                 62830000
628900                   AT-DMM-FC-SLS-YTD(DMM-IDX3)) * 100             62840000
629000        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                62850000
629100     END-IF.                                                      62860000
628100*                                                                 62861062
628200*    IF AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3) = ZEROS                  62862062
628300*       MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       62863062
628400*    ELSE                                                         62864062
628500*       COMPUTE PV-PCT =                                          62865062
628600*               (((AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) /             62866062
628700*                  PC-THOUSAND) -                                 62867062
628800*                  AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3)) /            62868062
628900*                  AT-DMM-FC-COMP-SLS-YTD(DMM-IDX3)) * 100        62869062
629000*       COMPUTE DYL3-COMP-SLS-YTD ROUNDED = PV-PCT                62869162
629100*    END-IF.                                                      62869262
629200                                                                  62870000
629300     IF AT-DMM-FC-GM-YTD(DMM-IDX3) = ZEROS                        62880000
629400        MOVE ZEROS                     TO DYL3-GM-YTD             62890000
629500     ELSE                                                         62900000
629600        COMPUTE PV-PCT =                                          62910000
629700                (((AT-DMM-TY-GM-YTD(DMM-IDX3) /                   62920000
629800                   PC-THOUSAND) -                                 62930000
629900                   AT-DMM-FC-GM-YTD(DMM-IDX3)) /                  62940000
630000                   AT-DMM-FC-GM-YTD(DMM-IDX3)) * 100              62950000
630100        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                62960000
630200     END-IF.                                                      62970000
630300                                                                  62980000
630400     IF AT-DMM-FC-EOM-YTD(DMM-IDX3) = ZEROS                       62990000
630500        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        63000000
630600     ELSE                                                         63010000
630700        COMPUTE PV-PCT =                                          63020000
630800               (((AT-DMM-TY-EOM-YTD(DMM-IDX3) /                   63030000
630900                  PC-THOUSAND) -                                  63040000
631000                  AT-DMM-FC-EOM-YTD(DMM-IDX3)) /                  63050000
631100                  AT-DMM-FC-EOM-YTD(DMM-IDX3)) * 100              63060000
631200        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            63070000
631300     END-IF.                                                      63080000
631400                                                                  63090000
631500     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             63100000
631600                                     DYL3-INV-TURN-YTD.           63110000
631700                                                                  63120000
631800     IF AT-DMM-FC-MKDN-YTD(DMM-IDX3) = ZEROS                      63130000
631900        MOVE ZEROS                     TO DYL3-MKDN-YTD           63140000
632000     ELSE                                                         63150000
632100        COMPUTE PV-PCT =                                          63160000
632200               (((AT-DMM-TY-MKDN-YTD(DMM-IDX3) /                  63170000
632300                  PC-THOUSAND) -                                  63180000
632400                  AT-DMM-FC-MKDN-YTD(DMM-IDX3)) /                 63190000
632500                  AT-DMM-FC-MKDN-YTD(DMM-IDX3)) * 100             63200000
632600        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                63210000
632700     END-IF.                                                      63220000
632800                                                                  63230000
632900     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              63240000
633000                                     DYL3-MKDN-PCT-YTD.           63250000
633100                                                                  63260000
633200     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         63270000
633300                                                                  63280000
633400*   *** PCT VARIANCE PLAN ***                                     63290000
633500     MOVE SPACES                       TO DYL3-HEADING.           63300000
633600     MOVE PC-PVARPL                    TO DYL3-TOTAL-DESC.        63310000
633700                                                                  63320000
633800     IF AT-DMM-PL-SLS-YTD(DMM-IDX3) = ZEROS                       63330000
633900        MOVE ZEROS                     TO DYL3-SLS-YTD            63340000
634000     ELSE                                                         63350000
634100        COMPUTE PV-PCT =                                          63360000
634200                (((AT-DMM-TY-SLS-YTD(DMM-IDX3) /                  63370000
634300                   PC-THOUSAND) -                                 63380000
634400                   AT-DMM-PL-SLS-YTD(DMM-IDX3)) /                 63390000
634500                   AT-DMM-PL-SLS-YTD(DMM-IDX3)) * 100             63400000
634600        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                63410000
634700     END-IF.                                                      63420000
634800                                                                  63430000
633800     IF AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3) = ZEROS                  63431062
633900        MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       63432062
634000     ELSE                                                         63433062
634100        COMPUTE PV-PCT =                                          63434062
634200                (((AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) /             63435062
634300                   PC-THOUSAND) -                                 63436062
634400                   AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3)) /            63437062
634500                   AT-DMM-PL-COMP-SLS-YTD(DMM-IDX3)) * 100        63438062
634600        COMPUTE DYL3-COMP-SLS-YTD ROUNDED = PV-PCT                63439062
634700     END-IF.                                                      63439162
634800                                                                  63439262
634900     IF AT-DMM-PL-GM-YTD(DMM-IDX3) = ZEROS                        63440000
635000        MOVE ZEROS                     TO DYL3-GM-YTD             63450000
635100     ELSE                                                         63460000
635200        COMPUTE PV-PCT =                                          63470000
635300                (((AT-DMM-TY-GM-YTD(DMM-IDX3) /                   63480000
635400                   PC-THOUSAND) -                                 63490000
635500                   AT-DMM-PL-GM-YTD(DMM-IDX3)) /                  63500000
635600                   AT-DMM-PL-GM-YTD(DMM-IDX3)) * 100              63510000
635700        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                63520000
635800     END-IF.                                                      63530000
635900                                                                  63540000
636000     IF AT-DMM-PL-EOM-YTD(DMM-IDX3) = ZEROS                       63550000
636100        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        63560000
636200     ELSE                                                         63570000
636300        COMPUTE PV-PCT =                                          63580000
636400               (((AT-DMM-TY-EOM-YTD(DMM-IDX3) /                   63590000
636500                  PC-THOUSAND) -                                  63600000
636600                  AT-DMM-PL-EOM-YTD(DMM-IDX3)) /                  63610000
636700                  AT-DMM-PL-EOM-YTD(DMM-IDX3)) * 100              63620000
636800        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            63630000
636900     END-IF.                                                      63640000
637000                                                                  63650000
637100     IF AT-DMM-PL-INV-YTD(DMM-IDX3) = ZEROS                       63660000
637200        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        63670000
637300     ELSE                                                         63680000
637400        COMPUTE PV-PCT =                                          63690000
637500               (((AT-DMM-TY-INV-YTD(DMM-IDX3) /                   63700000
637600                  PC-THOUSAND) -                                  63710000
637700                  AT-DMM-PL-INV-YTD(DMM-IDX3)) /                  63720000
637800                  AT-DMM-PL-INV-YTD(DMM-IDX3)) * 100              63730000
637900        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            63740000
638000     END-IF.                                                      63750000
638100                                                                  63760000
      *    ZERO INV TURN YTD                                            63770000
638200     MOVE ZEROS                   TO DYL3-INV-TURN-YTD.           63780000
638300                                                                  63790000
638400     IF AT-DMM-PL-MKDN-YTD(DMM-IDX3) = ZEROS                      63800000
638500        MOVE ZEROS                     TO DYL3-MKDN-YTD           63810000
638600     ELSE                                                         63820000
638700        COMPUTE PV-PCT =                                          63830000
638800               (((AT-DMM-TY-MKDN-YTD(DMM-IDX3) /                  63840000
638900                  PC-THOUSAND) -                                  63850000
639000                  AT-DMM-PL-MKDN-YTD(DMM-IDX3)) /                 63860000
639100                  AT-DMM-PL-MKDN-YTD(DMM-IDX3)) * 100             63870000
639200        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                63880000
639300     END-IF.                                                      63890000
639400                                                                  63900000
      *    ZERO GM YTD % AND MKDN YTD %                                 63910000
639500     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              63920000
639600                                     DYL3-MKDN-PCT-YTD.           63930000
639700                                                                  63940000
639800     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         63950000
639900                                                                  63960000
640000*   *** PCT VARIANCE LAST YR ***                                  63970000
640100     MOVE SPACES                       TO DYL3-HEADING.           63980000
640200     MOVE PC-PVARLY                    TO DYL3-TOTAL-DESC.        63990000
640400                                                                  64010000
640500     IF AT-DMM-LY-SLS-YTD(DMM-IDX3) = ZEROS                       64020000
640600        MOVE ZEROS                     TO DYL3-SLS-YTD            64030000
640700     ELSE                                                         64040000
640800        COMPUTE PV-PCT =                                          64050000
640900                 ((AT-DMM-TY-SLS-YTD(DMM-IDX3) -                  64060000
641000                   AT-DMM-LY-SLS-YTD(DMM-IDX3)) /                 64070000
641100                   AT-DMM-LY-SLS-YTD(DMM-IDX3)) * 100             64080000
641200        COMPUTE DYL3-SLS-YTD       ROUNDED = PV-PCT               64090000
641300     END-IF.                                                      64100000
641400                                                                  64110000
640500     IF AT-DMM-LY-COMP-SLS-YTD(DMM-IDX3) = ZEROS                  64111062
640600        MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       64112062
640700     ELSE                                                         64113062
640800        COMPUTE PV-PCT =                                          64114062
640900                 ((AT-DMM-TY-COMP-SLS-YTD(DMM-IDX3) -             64115062
641000                   AT-DMM-LY-COMP-SLS-YTD(DMM-IDX3)) /            64116062
641100                   AT-DMM-LY-COMP-SLS-YTD(DMM-IDX3)) * 100        64117062
641200        COMPUTE DYL3-COMP-SLS-YTD  ROUNDED = PV-PCT               64118062
641300     END-IF.                                                      64119062
641400                                                                  64119162
641500     IF AT-DMM-LY-GM-YTD(DMM-IDX3) = ZEROS                        64120000
641600        MOVE ZEROS                     TO DYL3-GM-YTD             64130000
641700     ELSE                                                         64140000
641800        COMPUTE PV-PCT =                                          64150000
641900                 ((AT-DMM-TY-GM-YTD(DMM-IDX3) -                   64160000
642000                   AT-DMM-LY-GM-YTD(DMM-IDX3)) /                  64170000
642100                   AT-DMM-LY-GM-YTD(DMM-IDX3)) * 100              64180000
642200        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                64190000
642300     END-IF.                                                      64200000
642400                                                                  64210000
642500     IF AT-DMM-LY-EOM-YTD(DMM-IDX3) = ZEROS                       64220000
642600        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        64230000
642700     ELSE                                                         64240000
642800        COMPUTE PV-PCT =                                          64250000
642900               ((AT-DMM-TY-EOM-YTD(DMM-IDX3) -                    64260000
643000                  AT-DMM-LY-EOM-YTD(DMM-IDX3)) /                  64270000
643100                  AT-DMM-LY-EOM-YTD(DMM-IDX3)) * 100              64280000
643200        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            64290000
643300     END-IF.                                                      64300000
643400                                                                  64310000
643500*    YTD INVENTORY AVG                                            64320000
643600     IF AT-DMM-LY-INV-YTD(DMM-IDX3) = ZEROS                       64330024
643700        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        64340024
643800     ELSE                                                         64350024
643900        COMPUTE PV-PCT =                                          64360024
644000               ((AT-DMM-TY-INV-YTD(DMM-IDX3) -                    64370024
644100                  AT-DMM-LY-INV-YTD(DMM-IDX3)) /                  64380024
644200                  AT-DMM-LY-INV-YTD(DMM-IDX3)) * 100              64390024
644300        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            64400024
644400     END-IF.                                                      64410024
                                                                        64410150
644600*    YTD INVENTORY TURN LAST YEAR                                 64430000
644700     IF AT-DMM-TY-INV-YTD(DMM-IDX3) = ZEROS OR                    64440085
644700        AT-DMM-LY-INV-YTD(DMM-IDX3) = ZEROS                       64441085
644800        MOVE ZEROS                TO DYL3-INV-TURN-YTD            64450000
644900     ELSE                                                         64460000
645000        COMPUTE PV-PCT =                                          64470000
645100            ((AT-DMM-TY-SLS-YTD(DMM-IDX3) /                       64480048
645200             (AT-DMM-TY-INV-YTD(DMM-IDX3) /                       64490048
645300             (PV-INV-MONTHS)))) -                                 64500064
645100            ((AT-DMM-LY-SLS-YTD(DMM-IDX3) /                       64501048
645200             (AT-DMM-LY-INV-YTD(DMM-IDX3) /                       64502048
645300             (PV-INV-MONTHS))))                                   64503064
645400        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           64510000
645500     END-IF.                                                      64520000
645600                                                                  64530000
645700*    YTD MKDN                                                     64540000
645800     IF AT-DMM-LY-MKDN-YTD(DMM-IDX3) = ZEROS                      64550000
645900        MOVE ZEROS                     TO DYL3-MKDN-YTD           64560000
646000     ELSE                                                         64570000
646100        COMPUTE PV-PCT =                                          64580000
646200               ((AT-DMM-TY-MKDN-YTD(DMM-IDX3) -                   64590000
646300                  AT-DMM-LY-MKDN-YTD(DMM-IDX3)) /                 64600000
646400                  AT-DMM-LY-MKDN-YTD(DMM-IDX3)) * 100             64610000
646500        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                64620000
646600     END-IF.                                                      64630000
646700                                                                  64640000
646800*    YTD GM %                                                     64650000
646900     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    64660000
647000        AT-DMM-LY-SLS-YTD(DMM-IDX3) = ZEROS                       64670000
647100        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           64680000
647200     ELSE                                                         64690000
647300        COMPUTE PV-PCT =                                          64700000
647400              ((AT-DMM-TY-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        64710000
647500                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    64720000
647600              ((AT-DMM-LY-GM-YTD(DMM-IDX3) * PC-HUNDRED) /        64730000
647700                AT-DMM-LY-SLS-YTD(DMM-IDX3))                      64740000
647800        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              64750000
647900     END-IF.                                                      64760000
648000                                                                  64770000
648100*    YTD MKDN %                                                   64780000
648200     IF AT-DMM-TY-SLS-YTD(DMM-IDX3) = ZEROS OR                    64790000
648300        AT-DMM-LY-SLS-YTD(DMM-IDX3) = ZEROS                       64800000
648400        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         64810000
648500     ELSE                                                         64820000
648600        COMPUTE PV-PCT =                                          64830000
648700              ((AT-DMM-TY-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      64840000
648800                AT-DMM-TY-SLS-YTD(DMM-IDX3)) -                    64850000
648900              ((AT-DMM-LY-MKDN-YTD(DMM-IDX3) * PC-HUNDRED) /      64860000
649000                AT-DMM-LY-SLS-YTD(DMM-IDX3))                      64870000
649100        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            64880000
649200     END-IF.                                                      64890000
649300                                                                  64900000
649500*    YTD CUMM MKON PCT                                            64910000
649600     IF AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3) = ZERO OR                64920000
649600        AT-DMM-LY-PRCH-RTL-YTD(DMM-IDX3) = ZERO                   64921000
649700        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               64930000
649800     ELSE                                                         64940000
649900        COMPUTE PV-PCT =                                          64950000
650000               ((AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3) -               64960016
650100                 AT-DMM-TY-PRCH-CST-YTD(DMM-IDX3)) * PC-HUNDRED) /64970000
650200                 AT-DMM-TY-PRCH-RTL-YTD(DMM-IDX3)  -              64980000
650000               ((AT-DMM-LY-PRCH-RTL-YTD(DMM-IDX3) -               64981016
650100                 AT-DMM-LY-PRCH-CST-YTD(DMM-IDX3)) * PC-HUNDRED) /64982000
650200                 AT-DMM-LY-PRCH-RTL-YTD(DMM-IDX3)                 64983000
650300        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           64990000
650400     END-IF.                                                      65000000
650500                                                                  65010000
650600     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         65020000
650700                                                                  65030000
650800     MOVE SPACES TO DYL3-DETAIL-YTD-LINE-1.                       65040000
650900     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         65050000
651000                                                                  65060000
651100******************************************************************65070000
651200*  CREATE REPORT PAGE 3 GMM YTD                                   65080000
651300******************************************************************65090000
651400 4800-PROCESS-GMM-PAGE3.                                          65100000
651500                                                                  65110000
651600*   *** ACTUALS ***                                               65120000
651700     MOVE PC-GMM-TOTAL                 TO DYL3-HEADING.           65130000
651800     MOVE PC-ACTUAL                    TO DYL3-TOTAL-DESC.        65140000
651900                                                                  65150000
652000*    YTD SALES                                                    65160000
652100     COMPUTE DYL3-SLS-YTD      ROUNDED =                          65170000
652200                AT-GMM-TY-SLS-YTD(GMM-IDX3) /                     65180000
652300                PC-THOUSAND.                                      65190000
652000*    YTD COMP SALES                                               65191062
652100     COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          65192062
652200                AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) /                65193062
652300                PC-THOUSAND.                                      65194062
652400*    YTD GROSS MARGIN                                             65200000
652500     COMPUTE DYL3-GM-YTD       ROUNDED =                          65210000
652600                AT-GMM-TY-GM-YTD(GMM-IDX3) /                      65220000
652700                PC-THOUSAND.                                      65230000
652800*    YTD END-OF-MONTH INVENTROY                                   65240000
652900     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      65250000
653000                AT-GMM-TY-EOM-YTD(GMM-IDX3) /                     65260000
653100                PC-THOUSAND.                                      65270000
653200*    YTD INVENTORY AVG                                            65280000
653300     COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                      65290000
653400              ((AT-GMM-TY-INV-YTD(GMM-IDX3) /                     65300000
653500               (PV-INV-MONTHS))   /                               65310064
653600                PC-THOUSAND).                                     65320000
653700                                                                  65330000
653800*    YTD INVENTORY TURN THIS YEAR                                 65340000
653900     IF AT-GMM-TY-INV-YTD(GMM-IDX3) = ZEROS                       65350000
654000        MOVE ZEROS                TO DYL3-INV-TURN-YTD            65360000
654100     ELSE                                                         65370000
654200        COMPUTE PV-PCT =                                          65380000
654300             (AT-GMM-TY-SLS-YTD(GMM-IDX3) /                       65390000
654400             (AT-GMM-TY-INV-YTD(GMM-IDX3) /                       65400000
654500             (PV-INV-MONTHS)))                                    65410064
654600        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           65420000
654700     END-IF.                                                      65430000
654800                                                                  65440000
654900*    YTD CUMM MKON PCT                                            65450000
655000     IF AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3) = ZERO                   65460000
655100        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               65470000
655200     ELSE                                                         65480000
655300        COMPUTE PV-PCT =                                          65490000
655400               ((AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3) -               65500016
655500                 AT-GMM-TY-PRCH-CST-YTD(GMM-IDX3)) * PC-HUNDRED) /65510000
655600                 AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3)                 65520000
655700        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           65530000
655800     END-IF.                                                      65540000
655900                                                                  65550000
656000*    YTD MARKDOWN                                                 65560000
656100     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          65570000
656200                AT-GMM-TY-MKDN-YTD(GMM-IDX3) /                    65580000
656300                PC-THOUSAND.                                      65590000
656400                                                                  65600000
656500*    YTD GM %                                                     65610000
656600     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS                       65620000
656700        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           65630000
656800     ELSE                                                         65640000
656900        COMPUTE PV-PCT =                                          65650000
657000               (AT-GMM-TY-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        65660000
657100                AT-GMM-TY-SLS-YTD(GMM-IDX3)                       65670000
657200        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              65680000
657300     END-IF.                                                      65690000
657400                                                                  65700000
657500*    YTD MKDN %                                                   65710000
657600     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS                       65720000
657700        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         65730000
657800     ELSE                                                         65740000
657900        COMPUTE PV-PCT =                                          65750000
658000               (AT-GMM-TY-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      65760000
658100                AT-GMM-TY-SLS-YTD(GMM-IDX3)                       65770000
658200        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            65780000
658300     END-IF.                                                      65790000
658400                                                                  65800000
658500     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         65810000
658600                                                                  65820000
658700*   *** FORECAST ***                                              65830000
658800     MOVE AT-GMM-DESC-PG3(GMM-IDX3)    TO DYL3-HEADING.           65840000
658900     MOVE PC-FCST                      TO DYL3-TOTAL-DESC.        65850000
659000                                                                  65860000
659100     COMPUTE DYL3-SLS-YTD       ROUNDED =                         65870000
659200                AT-GMM-FC-SLS-YTD(GMM-IDX3).                      65880000
659100*N/A COMPUTE DYL3-COMP-SLS-YTD  ROUNDED =                         65881062
659200*               AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3).                 65882062
659300     COMPUTE DYL3-GM-YTD        ROUNDED =                         65890000
659400                AT-GMM-FC-GM-YTD(GMM-IDX3).                       65900000
659500     COMPUTE DYL3-INV-EOM-YTD       ROUNDED =                     65910000
659600                AT-GMM-FC-EOM-YTD(GMM-IDX3).                      65920000
659700*                                                                 65930000
659800     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             65940000
659900                                     DYL3-INV-TURN-YTD.           65950000
660000                                                                  65960000
660100     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         65970000
660200                AT-GMM-FC-MKDN-YTD(GMM-IDX3).                     65980000
660300                                                                  65990000
660400*    GM %                                                         66000000
660500     IF AT-GMM-FC-SLS-YTD(GMM-IDX3) = ZEROS                       66010000
660600        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           66020000
660700     ELSE                                                         66030000
660800        COMPUTE PV-PCT =                                          66040000
660900               (AT-GMM-FC-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        66050000
661000                AT-GMM-FC-SLS-YTD(GMM-IDX3)                       66060000
661100        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              66070000
661200     END-IF.                                                      66080000
661300                                                                  66090000
661400*    MKDN %                                                       66100000
661500     IF AT-GMM-FC-SLS-YTD(GMM-IDX3) = ZEROS                       66110000
661600        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         66120000
661700     ELSE                                                         66130000
661800        COMPUTE PV-PCT =                                          66140000
661900               (AT-GMM-FC-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      66150000
662000                AT-GMM-FC-SLS-YTD(GMM-IDX3)                       66160000
662100        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            66170000
662200     END-IF.                                                      66180000
662300                                                                  66190000
662400     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         66200000
662500                                                                  66210000
662600*   *** PLAN ***                                                  66220000
662700     MOVE AT-GMM-NAME-PG3(GMM-IDX3)    TO DYL3-HEADING.           66230000
662800     MOVE PC-PLAN                      TO DYL3-TOTAL-DESC.        66240000
662900                                                                  66250000
663000     COMPUTE DYL3-SLS-YTD       ROUNDED =                         66260000
663100                AT-GMM-PL-SLS-YTD(GMM-IDX3).                      66270000
663000     COMPUTE DYL3-COMP-SLS-YTD  ROUNDED =                         66271062
663100                AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3).                 66272062
663200     COMPUTE DYL3-GM-YTD        ROUNDED =                         66280000
663300                AT-GMM-PL-GM-YTD(GMM-IDX3).                       66290000
663400     COMPUTE DYL3-INV-EOM-YTD   ROUNDED =                         66300000
663500                AT-GMM-PL-EOM-YTD(GMM-IDX3).                      66310000
663600*                                                                 66320000
663700     COMPUTE DYL3-INV-AVG-YTD   ROUNDED =                         66330000
663800               (AT-GMM-PL-INV-YTD(GMM-IDX3) /                     66340000
663900               (PV-INV-MONTHS)).                                  66350064
664000                                                                  66360000
664100*    YTD INVENTORY TURN LAST YEAR                                 66370000
664200     IF AT-GMM-PL-INV-YTD(GMM-IDX3) = ZEROS                       66380000
664300        MOVE ZEROS                TO DYL3-INV-TURN-YTD            66390000
664400     ELSE                                                         66400000
664500        COMPUTE PV-PCT =                                          66410000
664600             (AT-GMM-PL-SLS-YTD(GMM-IDX3) /                       66420000
664700             (AT-GMM-PL-INV-YTD(GMM-IDX3) /                       66430000
664800             (PV-INV-MONTHS)))                                    66440064
664900        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           66450000
665000     END-IF.                                                      66460000
665100                                                                  66470000
665200     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         66480000
665300                AT-GMM-PL-MKDN-YTD(GMM-IDX3).                     66490000
665400                                                                  66500000
665500*    GM %                                                         66510000
665600     IF AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       66520000
665700        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           66530000
665800     ELSE                                                         66540000
665900        COMPUTE PV-PCT =                                          66550000
666000               (AT-GMM-PL-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        66560000
666100                AT-GMM-PL-SLS-YTD(GMM-IDX3)                       66570000
666200        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              66580000
666300     END-IF.                                                      66590000
666400                                                                  66600000
666500*    MKDN %                                                       66610000
666600     IF AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       66620000
666700        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         66630000
666800     ELSE                                                         66640000
666900        COMPUTE PV-PCT =                                          66650000
667000               (AT-GMM-PL-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      66660000
667100                AT-GMM-PL-SLS-YTD(GMM-IDX3)                       66670000
667200        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            66680000
667300     END-IF.                                                      66690000
667400                                                                  66700000
667500     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         66710000
667600                                                                  66720000
667700*   *** VARIANCE FORECAST ***                                     66730000
667800     MOVE SPACES                       TO DYL3-HEADING.           66740000
667900     MOVE PC-VAR-FCST                  TO DYL3-TOTAL-DESC.        66750000
668000                                                                  66760000
668100     COMPUTE DYL3-SLS-YTD      ROUNDED =                          66770000
668200              (AT-GMM-TY-SLS-YTD(GMM-IDX3) /                      66780000
668300                PC-THOUSAND) -                                    66790000
668400                AT-GMM-FC-SLS-YTD(GMM-IDX3)                       66800000
668100*N/A COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          66801062
668200*             (AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) /                 66802062
668300*               PC-THOUSAND) -                                    66803062
668400*               AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3)                  66804062
668500     COMPUTE DYL3-GM-YTD       ROUNDED =                          66810000
668600              (AT-GMM-TY-GM-YTD(GMM-IDX3) /                       66820000
668700                PC-THOUSAND) -                                    66830000
668800                AT-GMM-FC-GM-YTD(GMM-IDX3)                        66840000
668900     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      66850000
669000              (AT-GMM-TY-EOM-YTD(GMM-IDX3) /                      66860000
669100                PC-THOUSAND) -                                    66870000
669200                AT-GMM-FC-EOM-YTD(GMM-IDX3)                       66880000
669300*                                                                 66890000
669400     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             66900000
669500                                     DYL3-INV-TURN-YTD.           66910000
669600                                                                  66920000
669700     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          66930000
669800              (AT-GMM-TY-MKDN-YTD(GMM-IDX3) /                     66940000
669900                PC-THOUSAND) -                                    66950000
670000                AT-GMM-FC-MKDN-YTD(GMM-IDX3)                      66960000
670100                                                                  66970000
670200*    GM %                                                         66980000
670300     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    66990000
670400        AT-GMM-FC-SLS-YTD(GMM-IDX3) = ZEROS                       67000000
670500        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           67010000
670600     ELSE                                                         67020000
670700        COMPUTE PV-PCT =                                          67030000
670800              ((AT-GMM-TY-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        67040000
670900                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    67050000
671000              ((AT-GMM-FC-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        67060000
671100                AT-GMM-FC-SLS-YTD(GMM-IDX3))                      67070000
671200        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              67080000
671300     END-IF.                                                      67090000
671400                                                                  67100000
671500*    MKDN %                                                       67110000
671600     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    67120000
671700        AT-GMM-FC-SLS-YTD(GMM-IDX3) = ZEROS                       67130000
671800        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         67140000
671900     ELSE                                                         67150000
672000        COMPUTE PV-PCT =                                          67160000
672100              ((AT-GMM-TY-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      67170000
672200                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    67180000
672300              ((AT-GMM-FC-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      67190000
672400                AT-GMM-FC-SLS-YTD(GMM-IDX3))                      67200000
672500        COMPUTE DYL3-MKDN-PCT-YTD   ROUNDED = PV-PCT              67210000
672600     END-IF.                                                      67220000
672700                                                                  67230000
672800     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         67240000
672900                                                                  67250000
673000*   *** VARIANCE PLAN ***                                         67260000
673100     MOVE SPACES                       TO DYL3-HEADING.           67270000
673200     MOVE PC-VAR-PL                    TO DYL3-TOTAL-DESC.        67280000
673300                                                                  67290000
673400     COMPUTE DYL3-SLS-YTD      ROUNDED =                          67300000
673500              (AT-GMM-TY-SLS-YTD(GMM-IDX3) /                      67310000
673600                PC-THOUSAND) -                                    67320000
673700                AT-GMM-PL-SLS-YTD(GMM-IDX3)                       67330000
673400     COMPUTE DYL3-COMP-SLS-YTD ROUNDED =                          67331062
673500              (AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) /                 67332062
673600                PC-THOUSAND) -                                    67333062
673700                AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3)                  67334062
673800     COMPUTE DYL3-GM-YTD       ROUNDED =                          67340000
673900              (AT-GMM-TY-GM-YTD(GMM-IDX3) /                       67350000
674000                PC-THOUSAND) -                                    67360000
674100                AT-GMM-PL-GM-YTD(GMM-IDX3)                        67370000
674200     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      67380000
674300              (AT-GMM-TY-EOM-YTD(GMM-IDX3) /                      67390000
674400                PC-THOUSAND) -                                    67400000
674500                AT-GMM-PL-EOM-YTD(GMM-IDX3)                       67410000
674600                                                                  67420000
674700     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    67430000
674800        AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       67440000
674900        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           67450000
675000     ELSE                                                         67460000
675100        COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                   67470000
675200                (((AT-GMM-TY-INV-YTD(GMM-IDX3) /                  67480000
675300                  (PV-INV-MONTHS))   /                            67490064
675400                   PC-THOUSAND) -                                 67500000
675500                  (AT-GMM-PL-INV-YTD(GMM-IDX3) /                  67510000
675600                  (PV-INV-MONTHS)))                               67520064
675700     END-IF.                                                      67530000
675800                                                                  67540000
624200*    INVENTORY TURN PLAN VAR                                      67551086
612600     IF AT-GMM-TY-INV-YTD(GMM-IDX3) = ZEROS OR                    67552086
612600        AT-GMM-PL-INV-YTD(GMM-IDX3) = ZEROS                       67553086
612700        MOVE ZEROS                TO DYL3-INV-TURN-YTD            67554086
612800     ELSE                                                         67555086
602600        COMPUTE PV-PCT =                                          67556086
602700            ((AT-GMM-TY-SLS-YTD(GMM-IDX3) /                       67557086
602800             (AT-GMM-TY-INV-YTD(GMM-IDX3) /                       67558086
602900             (PV-INV-MONTHS))) -                                  67559086
613000             (AT-GMM-PL-SLS-YTD(GMM-IDX3) /                       67559186
613100             (AT-GMM-PL-INV-YTD(GMM-IDX3) /                       67559286
613200             (PV-INV-MONTHS))))                                   67559386
613300        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           67559486
613400     END-IF.                                                      67559586
676000                                                                  67560000
676100     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          67570000
676200              (AT-GMM-TY-MKDN-YTD(GMM-IDX3) /                     67580000
676300                PC-THOUSAND) -                                    67590000
676400                AT-GMM-PL-MKDN-YTD(GMM-IDX3)                      67600000
676500                                                                  67610000
676600*    GM %                                                         67620000
676700     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    67630000
676800        AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       67640000
676900        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           67650000
677000     ELSE                                                         67660000
677100        COMPUTE PV-PCT =                                          67670000
677200              ((AT-GMM-TY-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        67680000
677300                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    67690000
677400              ((AT-GMM-PL-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        67700000
677500                AT-GMM-PL-SLS-YTD(GMM-IDX3))                      67710000
677600        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              67720000
677700     END-IF.                                                      67730000
677800                                                                  67740000
677900*    MKDN %                                                       67750000
678000     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    67760000
678100        AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       67770000
678200        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         67780000
678300     ELSE                                                         67790000
678400        COMPUTE PV-PCT =                                          67800000
678500              ((AT-GMM-TY-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      67810000
678600                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    67820000
678700              ((AT-GMM-PL-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      67830000
678800                AT-GMM-PL-SLS-YTD(GMM-IDX3))                      67840000
678900        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            67850000
679000     END-IF.                                                      67860000
679100                                                                  67870000
679200     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         67880000
679300                                                                  67890000
679400*   *** PCT VARIANCE FORECAST ***                                 67900000
679500     MOVE SPACES                       TO DYL3-HEADING.           67910000
679600     MOVE PC-PVARFCST                  TO DYL3-TOTAL-DESC.        67920000
679700                                                                  67930000
679800     IF AT-GMM-FC-SLS-YTD(GMM-IDX3) = ZEROS                       67940000
679900        MOVE ZEROS                     TO DYL3-SLS-YTD            67950000
680000     ELSE                                                         67960000
680100        COMPUTE PV-PCT =                                          67970000
680200                (((AT-GMM-TY-SLS-YTD(GMM-IDX3) /                  67980000
680300                   PC-THOUSAND) -                                 67990000
680400                   AT-GMM-FC-SLS-YTD(GMM-IDX3)) /                 68000000
680500                   AT-GMM-FC-SLS-YTD(GMM-IDX3)) * 100             68010000
680600        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                68020000
680700     END-IF.                                                      68030000
679700                                                                  68031062
679800*N/A IF AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3) = ZEROS                  68032062
679900*       MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       68033062
680000*    ELSE                                                         68034062
680100*       COMPUTE PV-PCT =                                          68035062
680200*               (((AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) /             68036062
680300*                  PC-THOUSAND) -                                 68037062
680400*                  AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3)) /            68038062
680500*                  AT-GMM-FC-COMP-SLS-YTD(GMM-IDX3)) * 100        68039062
680600*       COMPUTE DYL3-COMP-SLS-YTD ROUNDED = PV-PCT                68039162
680700*    END-IF.                                                      68039262
680800                                                                  68040000
680900     IF AT-GMM-FC-GM-YTD(GMM-IDX3) = ZEROS                        68050000
681000        MOVE ZEROS                     TO DYL3-GM-YTD             68060000
681100     ELSE                                                         68070000
681200        COMPUTE PV-PCT =                                          68080000
681300                (((AT-GMM-TY-GM-YTD(GMM-IDX3) /                   68090000
681400                   PC-THOUSAND) -                                 68100000
681500                   AT-GMM-FC-GM-YTD(GMM-IDX3)) /                  68110000
681600                   AT-GMM-FC-GM-YTD(GMM-IDX3)) * 100              68120000
681700        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                68130000
681800     END-IF.                                                      68140000
681900                                                                  68150000
682000     IF AT-GMM-FC-EOM-YTD(GMM-IDX3) = ZEROS                       68160000
682100        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        68170000
682200     ELSE                                                         68180000
682300        COMPUTE PV-PCT =                                          68190000
682400               (((AT-GMM-TY-EOM-YTD(GMM-IDX3) /                   68200000
682500                  PC-THOUSAND) -                                  68210000
682600                  AT-GMM-FC-EOM-YTD(GMM-IDX3)) /                  68220000
682700                  AT-GMM-FC-EOM-YTD(GMM-IDX3)) * 100              68230000
682800        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            68240000
682900     END-IF.                                                      68250000
683000                                                                  68260000
      *    ZERO AVG INV YTD AND INV TURN YTD                            68270000
683100     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             68280000
683200                                     DYL3-INV-TURN-YTD.           68290000
683300                                                                  68300000
683400     IF AT-GMM-FC-MKDN-YTD(GMM-IDX3) = ZEROS                      68310000
683500        MOVE ZEROS                     TO DYL3-MKDN-YTD           68320000
683600     ELSE                                                         68330000
683700        COMPUTE PV-PCT =                                          68340000
683800               (((AT-GMM-TY-MKDN-YTD(GMM-IDX3) /                  68350000
683900                  PC-THOUSAND) -                                  68360000
684000                  AT-GMM-FC-MKDN-YTD(GMM-IDX3)) /                 68370000
684100                  AT-GMM-FC-MKDN-YTD(GMM-IDX3)) * 100             68380000
684200        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                68390000
684300     END-IF.                                                      68400000
684400                                                                  68410000
      *    ZERO GM % YTD AND MKDN YTD %                                 68420000
684500     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              68430000
684600                                     DYL3-MKDN-PCT-YTD.           68440000
684700                                                                  68450000
684800     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         68460000
684900                                                                  68470000
685000*   *** PCT VARIANCE PLAN ***                                     68480000
685100     MOVE SPACES                       TO DYL3-HEADING.           68490000
685200     MOVE PC-PVARPL                    TO DYL3-TOTAL-DESC.        68500000
685300                                                                  68510000
685400     IF AT-GMM-PL-SLS-YTD(GMM-IDX3) = ZEROS                       68520000
685500        MOVE ZEROS                     TO DYL3-SLS-YTD            68530000
685600     ELSE                                                         68540000
685700        COMPUTE PV-PCT =                                          68550000
685800                (((AT-GMM-TY-SLS-YTD(GMM-IDX3) /                  68560000
685900                   PC-THOUSAND) -                                 68570000
686000                   AT-GMM-PL-SLS-YTD(GMM-IDX3)) /                 68580000
686100                   AT-GMM-PL-SLS-YTD(GMM-IDX3)) * 100             68590000
686200        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                68600000
686300     END-IF.                                                      68610000
685300                                                                  68611062
685400     IF AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3) = ZEROS                  68612062
685500        MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       68613062
685600     ELSE                                                         68614062
685700        COMPUTE PV-PCT =                                          68615062
685800                (((AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) /             68616062
685900                   PC-THOUSAND) -                                 68617062
686000                   AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3)) /            68618062
686100                   AT-GMM-PL-COMP-SLS-YTD(GMM-IDX3)) * 100        68619062
686200        COMPUTE DYL3-COMP-SLS-YTD ROUNDED = PV-PCT                68619162
686300     END-IF.                                                      68619262
686400                                                                  68620000
686500     IF AT-GMM-PL-GM-YTD(GMM-IDX3) = ZEROS                        68630000
686600        MOVE ZEROS                     TO DYL3-GM-YTD             68640000
686700     ELSE                                                         68650000
686800        COMPUTE PV-PCT =                                          68660000
686900                (((AT-GMM-TY-GM-YTD(GMM-IDX3) /                   68670000
687000                   PC-THOUSAND) -                                 68680000
687100                   AT-GMM-PL-GM-YTD(GMM-IDX3)) /                  68690000
687200                   AT-GMM-PL-GM-YTD(GMM-IDX3)) * 100              68700000
687300        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                68710000
687400     END-IF.                                                      68720000
687500                                                                  68730000
687600     IF AT-GMM-PL-EOM-YTD(GMM-IDX3) = ZEROS                       68740000
687700        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        68750000
687800     ELSE                                                         68760000
687900        COMPUTE PV-PCT =                                          68770000
688000               (((AT-GMM-TY-EOM-YTD(GMM-IDX3) /                   68780000
688100                  PC-THOUSAND) -                                  68790000
688200                  AT-GMM-PL-EOM-YTD(GMM-IDX3)) /                  68800000
688300                  AT-GMM-PL-EOM-YTD(GMM-IDX3)) * 100              68810000
688400        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            68820000
688500     END-IF.                                                      68830000
688600                                                                  68840000
688700     IF AT-GMM-PL-INV-YTD(GMM-IDX3) = ZEROS                       68850000
688800        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        68860000
688900     ELSE                                                         68870000
689000        COMPUTE PV-PCT =                                          68880000
689100               (((AT-GMM-TY-INV-YTD(GMM-IDX3) /                   68890000
689200                  PC-THOUSAND) -                                  68900000
689300                  AT-GMM-PL-INV-YTD(GMM-IDX3)) /                  68910000
689400                  AT-GMM-PL-INV-YTD(GMM-IDX3)) * 100              68920000
689500        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            68930000
689600     END-IF.                                                      68940000
689700                                                                  68950000
      *    ZERO INV TURN YTD                                            68960000
689800     MOVE ZEROS                   TO DYL3-INV-TURN-YTD.           68970000
689900                                                                  68980000
690000     IF AT-GMM-PL-MKDN-YTD(GMM-IDX3) = ZEROS                      68990000
690100        MOVE ZEROS                     TO DYL3-MKDN-YTD           69000000
690200     ELSE                                                         69010000
690300        COMPUTE PV-PCT =                                          69020000
690400               (((AT-GMM-TY-MKDN-YTD(GMM-IDX3) /                  69030000
690500                  PC-THOUSAND) -                                  69040000
690600                  AT-GMM-PL-MKDN-YTD(GMM-IDX3)) /                 69050000
690700                  AT-GMM-PL-MKDN-YTD(GMM-IDX3)) * 100             69060000
690800        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                69070000
690900     END-IF.                                                      69080000
691000                                                                  69090000
      *    ZERO GM % YTD AND MKDN YTD %                                 69100000
691100     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              69110000
691200                                     DYL3-MKDN-PCT-YTD.           69120000
691300                                                                  69130000
691400     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         69140000
691500                                                                  69150000
691600*   *** PCT VARIANCE LAST YR ***                                  69160000
691700     MOVE SPACES                       TO DYL3-HEADING.           69170000
691800     MOVE PC-PVARLY                    TO DYL3-TOTAL-DESC.        69180000
692000                                                                  69200000
692100     IF AT-GMM-LY-SLS-YTD(GMM-IDX3) = ZEROS                       69210000
692200        MOVE ZEROS                     TO DYL3-SLS-YTD            69220000
692300     ELSE                                                         69230000
692400        COMPUTE PV-PCT =                                          69240000
692500                 ((AT-GMM-TY-SLS-YTD(GMM-IDX3) -                  69250000
692600                   AT-GMM-LY-SLS-YTD(GMM-IDX3)) /                 69260000
692700                   AT-GMM-LY-SLS-YTD(GMM-IDX3)) * 100             69270000
692800        COMPUTE DYL3-SLS-YTD       ROUNDED = PV-PCT               69280000
692900     END-IF.                                                      69290000
693000                                                                  69300000
692100     IF AT-GMM-LY-COMP-SLS-YTD(GMM-IDX3) = ZEROS                  69301062
692200        MOVE ZEROS                     TO DYL3-COMP-SLS-YTD       69302062
692300     ELSE                                                         69303062
692400        COMPUTE PV-PCT =                                          69304062
692500                 ((AT-GMM-TY-COMP-SLS-YTD(GMM-IDX3) -             69305062
692600                   AT-GMM-LY-COMP-SLS-YTD(GMM-IDX3)) /            69306062
692700                   AT-GMM-LY-COMP-SLS-YTD(GMM-IDX3)) * 100        69307062
692800        COMPUTE DYL3-COMP-SLS-YTD  ROUNDED = PV-PCT               69308062
692900     END-IF.                                                      69309062
693000                                                                  69309162
693100     IF AT-GMM-LY-GM-YTD(GMM-IDX3) = ZEROS                        69310000
693200        MOVE ZEROS                     TO DYL3-GM-YTD             69320000
693300     ELSE                                                         69330000
693400        COMPUTE PV-PCT =                                          69340000
693500                 ((AT-GMM-TY-GM-YTD(GMM-IDX3) -                   69350000
693600                   AT-GMM-LY-GM-YTD(GMM-IDX3)) /                  69360000
693700                   AT-GMM-LY-GM-YTD(GMM-IDX3)) * 100              69370000
693800        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                69380000
693900     END-IF.                                                      69390000
694000                                                                  69400000
694100     IF AT-GMM-LY-EOM-YTD(GMM-IDX3) = ZEROS                       69410000
694200        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        69420000
694300     ELSE                                                         69430000
694400        COMPUTE PV-PCT =                                          69440000
694500               ((AT-GMM-TY-EOM-YTD(GMM-IDX3) -                    69450000
694600                  AT-GMM-LY-EOM-YTD(GMM-IDX3)) /                  69460000
694700                  AT-GMM-LY-EOM-YTD(GMM-IDX3)) * 100              69470000
694800        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            69480000
694900     END-IF.                                                      69490000
695000                                                                  69500000
695100*    YTD INVENTORY AVG                                            69510000
695200     IF AT-GMM-LY-INV-YTD(GMM-IDX3) = ZEROS                       69520000
695300        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        69530000
695400     ELSE                                                         69540000
695500        COMPUTE PV-PCT =                                          69550000
695600               ((AT-GMM-TY-INV-YTD(GMM-IDX3) -                    69560000
695700                  AT-GMM-LY-INV-YTD(GMM-IDX3)) /                  69570000
695800                  AT-GMM-LY-INV-YTD(GMM-IDX3)) * 100              69580000
695900        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            69590000
696000     END-IF.                                                      69600000
696100                                                                  69610000
696200*    YTD INVENTORY TURN LAST YEAR                                 69620000
696300     IF AT-GMM-TY-INV-YTD(GMM-IDX3) = ZEROS                       69630000
               OR AT-GMM-LY-INV-YTD(GMM-IDX3) = ZEROS                   69630000
696400        MOVE ZEROS                TO DYL3-INV-TURN-YTD            69640000
696500     ELSE                                                         69650000
645000        COMPUTE PV-PCT =                                          69660048
645100            ((AT-GMM-TY-SLS-YTD(GMM-IDX3) /                       69670048
645200             (AT-GMM-TY-INV-YTD(GMM-IDX3) /                       69680048
645300             (PV-INV-MONTHS)))) -                                 69690064
645100            ((AT-GMM-LY-SLS-YTD(GMM-IDX3) /                       69700048
645200             (AT-GMM-LY-INV-YTD(GMM-IDX3) /                       69701048
645300             (PV-INV-MONTHS))))                                   69702064
645400        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           69703048
697100     END-IF.                                                      69710000
697200                                                                  69720000
697300*    YTD MKDN                                                     69730000
697400     IF AT-GMM-LY-MKDN-YTD(GMM-IDX3) = ZEROS                      69740000
697500        MOVE ZEROS                     TO DYL3-MKDN-YTD           69750000
697600     ELSE                                                         69760000
697700        COMPUTE PV-PCT =                                          69770000
697800               ((AT-GMM-TY-MKDN-YTD(GMM-IDX3) -                   69780000
697900                  AT-GMM-LY-MKDN-YTD(GMM-IDX3)) /                 69790000
698000                  AT-GMM-LY-MKDN-YTD(GMM-IDX3)) * 100             69800000
698100        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                69810000
698200     END-IF.                                                      69820000
698300                                                                  69830000
698400*    YTD GM %                                                     69840000
698500     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    69850000
698600        AT-GMM-LY-SLS-YTD(GMM-IDX3) = ZEROS                       69860000
698700        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           69870000
698800     ELSE                                                         69880000
698900        COMPUTE PV-PCT =                                          69890000
699000              ((AT-GMM-TY-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        69900000
699100                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    69910000
699200              ((AT-GMM-LY-GM-YTD(GMM-IDX3) * PC-HUNDRED) /        69920000
699300                AT-GMM-LY-SLS-YTD(GMM-IDX3))                      69930000
699400        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              69940000
699500     END-IF.                                                      69950000
699600                                                                  69960000
699700*    YTD MKDN %                                                   69970000
699800     IF AT-GMM-TY-SLS-YTD(GMM-IDX3) = ZEROS OR                    69980000
699900        AT-GMM-LY-SLS-YTD(GMM-IDX3) = ZEROS                       69990000
700000        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         70000000
700100     ELSE                                                         70010000
700200        COMPUTE PV-PCT =                                          70020000
700300              ((AT-GMM-TY-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      70030000
700400                AT-GMM-TY-SLS-YTD(GMM-IDX3)) -                    70040000
700500              ((AT-GMM-LY-MKDN-YTD(GMM-IDX3) * PC-HUNDRED) /      70050000
700600                AT-GMM-LY-SLS-YTD(GMM-IDX3))                      70060000
700700        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            70070000
700800     END-IF.                                                      70080000
700900                                                                  70090000
649500*    YTD CUMM MKON PCT                                            70101015
649600     IF AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3) = ZERO OR                70102017
649600        AT-GMM-LY-PRCH-RTL-YTD(GMM-IDX3) = ZERO                   70103017
649700        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               70104015
649800     ELSE                                                         70105015
649900        COMPUTE PV-PCT =                                          70106015
650000               ((AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3) -               70107016
650100                 AT-GMM-TY-PRCH-CST-YTD(GMM-IDX3)) * PC-HUNDRED) /70108015
650200                 AT-GMM-TY-PRCH-RTL-YTD(GMM-IDX3) -               70109016
650000               ((AT-GMM-LY-PRCH-RTL-YTD(GMM-IDX3) -               70109116
650100                 AT-GMM-LY-PRCH-CST-YTD(GMM-IDX3)) * PC-HUNDRED) /70109215
650200                 AT-GMM-LY-PRCH-RTL-YTD(GMM-IDX3)                 70109315
650300        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           70109415
650400     END-IF.                                                      70109515
702100                                                                  70200000
702200     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         70210000
702300                                                                  70220000
702400     MOVE SPACES TO DYL3-DETAIL-YTD-LINE-1.                       70230000
702500     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         70240000
702600                                                                  70250000
702700     SET GMM-IDX3 UP BY 1.                                        70260000
702800     MOVE PC-PAGE-MAX-LINES-PLUS-1 TO PV-LINE-COUNTER-3.          70270000
702900                                                                  70280000
703000******************************************************************70290000
703100*  CREATE REPORT PAGE 3 CMPY YTD                                  70300000
703200******************************************************************70310000
703300 4900-PROCESS-CMPY-PAGE3.                                         70320000
703400                                                                  70330000
703500*   *** ACTUALS ***                                               70340000
703600     MOVE PC-TOTAL-KOHLS               TO DYL3-HEADING.           70350000
703700     MOVE PC-ACTUAL                    TO DYL3-TOTAL-DESC.        70360000
703800                                                                  70370000
703900*    YTD SALES                                                    70380000
704000     COMPUTE DYL3-SLS-YTD      ROUNDED =                          70390000
704100                AT-CMPY-TY-SLS-YTD /                              70400000
704200                PC-THOUSAND.                                      70410000
703900*    YTD COMP SALES                                               70411062
704000     COMPUTE DYL3-COMP-SLS-YTD      ROUNDED =                     70412062
704100                AT-CMPY-TY-COMP-SLS-YTD /                         70413062
704200                PC-THOUSAND.                                      70414062
704300*    YTD GROSS MARGIN                                             70420000
704400     COMPUTE DYL3-GM-YTD       ROUNDED =                          70430000
704500                AT-CMPY-TY-GM-YTD /                               70440000
704600                PC-THOUSAND.                                      70450000
704700*    YTD END-OF-MONTH INVENTROY                                   70460000
704800     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      70470000
704900                AT-CMPY-TY-EOM-YTD /                              70480000
705000                PC-THOUSAND.                                      70490000
705100*    YTD INVENTORY AVG                                            70500000
705200     COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                      70510000
705300              ((AT-CMPY-TY-INV-YTD /                              70520000
705400               (PV-INV-MONTHS))   /                               70530064
705500                PC-THOUSAND).                                     70540000
705600                                                                  70550000
705700*    YTD INVENTORY TURN THIS YEAR                                 70560000
705800     IF AT-CMPY-TY-INV-YTD = ZEROS                                70570000
705900        MOVE ZEROS                TO DYL3-INV-TURN-YTD            70580000
706000     ELSE                                                         70590000
706100        COMPUTE PV-PCT =                                          70600000
706200             (AT-CMPY-TY-SLS-YTD /                                70610000
706300             (AT-CMPY-TY-INV-YTD /                                70620000
706400             (PV-INV-MONTHS)))                                    70630064
706500        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           70640000
706600     END-IF.                                                      70650000
706700                                                                  70660000
706800*    YTD CUMM MKON PCT                                            70670000
706900     IF AT-CMPY-TY-PRCH-RTL-YTD = ZERO                            70680000
707000        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               70690000
707100     ELSE                                                         70700000
707200        COMPUTE PV-PCT =                                          70710000
707300               ((AT-CMPY-TY-PRCH-RTL-YTD -                        70720016
707400                 AT-CMPY-TY-PRCH-CST-YTD) * PC-HUNDRED) /         70730016
707500                 AT-CMPY-TY-PRCH-RTL-YTD                          70740000
707600        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           70750000
707700     END-IF.                                                      70760000
707800                                                                  70770000
707900*    YTD MARKDOWN                                                 70780000
708000     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          70790000
708100                AT-CMPY-TY-MKDN-YTD /                             70800000
708200                PC-THOUSAND.                                      70810000
708300                                                                  70820000
708400*    YTD GM %                                                     70830000
708500     IF AT-CMPY-TY-SLS-YTD = ZEROS                                70840000
708600        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           70850000
708700     ELSE                                                         70860000
708800        COMPUTE PV-PCT =                                          70870000
708900               (AT-CMPY-TY-GM-YTD * PC-HUNDRED) /                 70880000
709000                AT-CMPY-TY-SLS-YTD                                70890000
709100        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              70900000
709200     END-IF.                                                      70910000
709300                                                                  70920000
709400*    YTD MKDN %                                                   70930000
709500     IF AT-CMPY-TY-SLS-YTD = ZEROS                                70940000
709600        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         70950000
709700     ELSE                                                         70960000
709800        COMPUTE PV-PCT =                                          70970000
709900               (AT-CMPY-TY-MKDN-YTD * PC-HUNDRED) /               70980000
710000                AT-CMPY-TY-SLS-YTD                                70990000
710100        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            71000000
710200     END-IF.                                                      71010000
710300                                                                  71020000
710400     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         71030000
710500                                                                  71040000
710600*   *** FORECAST ***                                              71050000
710700     MOVE SPACES                       TO DYL3-HEADING.           71060000
710800     MOVE PC-FCST                      TO DYL3-TOTAL-DESC.        71070000
710900                                                                  71080000
711000     COMPUTE DYL3-SLS-YTD       ROUNDED =                         71090000
711100                AT-CMPY-FC-SLS-YTD.                               71100000
711000*N/A COMPUTE DYL3-COMP-SLS-YTD       ROUNDED =                    71101062
711100*                AT-CMPY-FC-COMP-SLS-YTD.                         71102062
711200     COMPUTE DYL3-GM-YTD        ROUNDED =                         71110000
711300                AT-CMPY-FC-GM-YTD.                                71120000
711400     COMPUTE DYL3-INV-EOM-YTD       ROUNDED =                     71130000
711500                AT-CMPY-FC-EOM-YTD.                               71140000
711600*                                                                 71150000
711700     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             71160000
711800                                     DYL3-INV-TURN-YTD.           71170000
711900                                                                  71180000
712000     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         71190000
712100                AT-CMPY-FC-MKDN-YTD.                              71200000
712200                                                                  71210000
712300*    GM %                                                         71220000
712400     IF AT-CMPY-FC-SLS-YTD = ZEROS                                71230000
712500        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           71240000
712600     ELSE                                                         71250000
712700        COMPUTE PV-PCT =                                          71260000
712800               (AT-CMPY-FC-GM-YTD * PC-HUNDRED) /                 71270000
712900                AT-CMPY-FC-SLS-YTD                                71280000
713000        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              71290000
713100     END-IF.                                                      71300000
713200                                                                  71310000
713300*    MKDN %                                                       71320000
713400     IF AT-CMPY-FC-SLS-YTD = ZEROS                                71330000
713500        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         71340000
713600     ELSE                                                         71350000
713700        COMPUTE PV-PCT =                                          71360000
713800               (AT-CMPY-FC-MKDN-YTD * PC-HUNDRED) /               71370000
713900                AT-CMPY-FC-SLS-YTD                                71380000
714000        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            71390000
714100     END-IF.                                                      71400000
714200                                                                  71410000
714300     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         71420000
714400                                                                  71430000
714500*   *** PLAN ***                                                  71440000
714600     MOVE SPACES                       TO DYL3-HEADING.           71450000
714700     MOVE PC-PLAN                      TO DYL3-TOTAL-DESC.        71460000
714800                                                                  71470000
714900     COMPUTE DYL3-SLS-YTD       ROUNDED =                         71480000
715000                AT-CMPY-PL-SLS-YTD.                               71490000
711000     COMPUTE DYL3-COMP-SLS-YTD       ROUNDED =                    71491062
711100                 AT-CMPY-PL-COMP-SLS-YTD.                         71492062
715100     COMPUTE DYL3-GM-YTD        ROUNDED =                         71500000
715200                AT-CMPY-PL-GM-YTD.                                71510000
715300     COMPUTE DYL3-INV-EOM-YTD   ROUNDED =                         71520000
715400                AT-CMPY-PL-EOM-YTD.                               71530000
715500*                                                                 71540000
715600     COMPUTE DYL3-INV-AVG-YTD   ROUNDED =                         71550000
715700               (AT-CMPY-PL-INV-YTD /                              71560000
715800               (PV-INV-MONTHS)).                                  71570064
715900                                                                  71580000
716000*    YTD INVENTORY TURN LAST YEAR                                 71590000
716100     IF AT-CMPY-PL-INV-YTD = ZEROS                                71600000
716200        MOVE ZEROS                TO DYL3-INV-TURN-YTD            71610000
716300     ELSE                                                         71620000
716400        COMPUTE PV-PCT =                                          71630000
716500             (AT-CMPY-PL-SLS-YTD /                                71640000
716600             (AT-CMPY-PL-INV-YTD /                                71650000
716700             (PV-INV-MONTHS)))                                    71660064
716800        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           71670000
716900     END-IF.                                                      71680000
717000                                                                  71690000
717100     COMPUTE DYL3-MKDN-YTD      ROUNDED =                         71700000
717200                AT-CMPY-PL-MKDN-YTD.                              71710000
717300                                                                  71720000
717400*    GM %                                                         71730000
717500     IF AT-CMPY-PL-SLS-YTD = ZEROS                                71740000
717600        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           71750000
717700     ELSE                                                         71760000
717800        COMPUTE PV-PCT =                                          71770000
717900               (AT-CMPY-PL-GM-YTD * PC-HUNDRED) /                 71780000
718000                AT-CMPY-PL-SLS-YTD                                71790000
718100        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              71800000
718200     END-IF.                                                      71810000
718300                                                                  71820000
718400*    MKDN %                                                       71830000
718500     IF AT-CMPY-PL-SLS-YTD = ZEROS                                71840000
718600        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         71850000
718700     ELSE                                                         71860000
718800        COMPUTE PV-PCT =                                          71870000
718900               (AT-CMPY-PL-MKDN-YTD * PC-HUNDRED) /               71880000
719000                AT-CMPY-PL-SLS-YTD                                71890000
719100        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            71900000
719200     END-IF.                                                      71910000
719300                                                                  71920000
719400     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         71930000
719500                                                                  71940000
719600*   *** VARIANCE FORECAST ***                                     71950000
719700     MOVE SPACES                       TO DYL3-HEADING.           71960000
719800     MOVE PC-VAR-FCST                  TO DYL3-TOTAL-DESC.        71970000
719900                                                                  71980000
720000     COMPUTE DYL3-SLS-YTD      ROUNDED =                          71990000
720100              (AT-CMPY-TY-SLS-YTD /                               72000000
720200                PC-THOUSAND) -                                    72010000
720300                AT-CMPY-FC-SLS-YTD                                72020000
720000*N/A COMPUTE DYL3-COMP-SLS-YTD      ROUNDED =                     72021062
720100*             (AT-CMPY-TY-COMP-SLS-YTD /                          72022062
720200*               PC-THOUSAND) -                                    72023062
720300*               AT-CMPY-FC-COMP-SLS-YTD                           72024062
720400     COMPUTE DYL3-GM-YTD       ROUNDED =                          72030000
720500              (AT-CMPY-TY-GM-YTD /                                72040000
720600                PC-THOUSAND) -                                    72050000
720700                AT-CMPY-FC-GM-YTD                                 72060000
720800     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      72070000
720900              (AT-CMPY-TY-EOM-YTD /                               72080000
721000                PC-THOUSAND) -                                    72090000
721100                AT-CMPY-FC-EOM-YTD                                72100000
      *    ZERO INV AVG YTD AND INV TURN YTD                            72110000
721300     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             72120000
721400                                     DYL3-INV-TURN-YTD.           72130000
721500                                                                  72140000
721600     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          72150000
721700              (AT-CMPY-TY-MKDN-YTD /                              72160000
721800                PC-THOUSAND) -                                    72170000
721900                AT-CMPY-FC-MKDN-YTD                               72180000
722000                                                                  72190000
722100*    GM %                                                         72200000
722200     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             72210000
722300        AT-CMPY-FC-SLS-YTD = ZEROS                                72220000
722400        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           72230000
722500     ELSE                                                         72240000
722600        COMPUTE PV-PCT =                                          72250000
722700              ((AT-CMPY-TY-GM-YTD * PC-HUNDRED) /                 72260000
722800                AT-CMPY-TY-SLS-YTD) -                             72270000
722900              ((AT-CMPY-FC-GM-YTD * PC-HUNDRED) /                 72280000
723000                AT-CMPY-FC-SLS-YTD)                               72290000
723100        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              72300000
723200     END-IF.                                                      72310000
723300                                                                  72320000
723400*    MKDN %                                                       72330000
723500     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             72340000
723600        AT-CMPY-FC-SLS-YTD = ZEROS                                72350000
723700        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         72360000
723800     ELSE                                                         72370000
723900        COMPUTE PV-PCT =                                          72380000
724000              ((AT-CMPY-TY-MKDN-YTD * PC-HUNDRED) /               72390000
724100                AT-CMPY-TY-SLS-YTD) -                             72400000
724200              ((AT-CMPY-FC-MKDN-YTD * PC-HUNDRED) /               72410000
724300                AT-CMPY-FC-SLS-YTD)                               72420000
724400        COMPUTE DYL3-MKDN-PCT-YTD   ROUNDED = PV-PCT              72430000
724500     END-IF.                                                      72440000
724600                                                                  72450000
724700     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         72460000
724800                                                                  72470000
724900*   *** VARIANCE PLAN ***                                         72480000
725000     MOVE SPACES                       TO DYL3-HEADING.           72490000
725100     MOVE PC-VAR-PL                    TO DYL3-TOTAL-DESC.        72500000
725200                                                                  72510000
725300     COMPUTE DYL3-SLS-YTD      ROUNDED =                          72520000
725400              (AT-CMPY-TY-SLS-YTD /                               72530000
725500                PC-THOUSAND) -                                    72540000
725600                AT-CMPY-PL-SLS-YTD                                72550000
725300     COMPUTE DYL3-COMP-SLS-YTD      ROUNDED =                     72551062
725400              (AT-CMPY-TY-COMP-SLS-YTD /                          72552062
725500                PC-THOUSAND) -                                    72553062
725600                AT-CMPY-PL-COMP-SLS-YTD                           72554062
725700     COMPUTE DYL3-GM-YTD       ROUNDED =                          72560000
725800              (AT-CMPY-TY-GM-YTD /                                72570000
725900                PC-THOUSAND) -                                    72580000
726000                AT-CMPY-PL-GM-YTD                                 72590000
726100     COMPUTE DYL3-INV-EOM-YTD      ROUNDED =                      72600000
726200              (AT-CMPY-TY-EOM-YTD /                               72610000
726300                PC-THOUSAND) -                                    72620000
726400                AT-CMPY-PL-EOM-YTD                                72630000
726500                                                                  72640000
726600     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             72650000
726700        AT-CMPY-PL-SLS-YTD = ZEROS                                72660000
726800        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           72670000
726900     ELSE                                                         72680000
727000        COMPUTE DYL3-INV-AVG-YTD      ROUNDED =                   72690000
727100                (((AT-CMPY-TY-INV-YTD /                           72700000
727200                  (PV-INV-MONTHS))   /                            72710064
727300                   PC-THOUSAND) -                                 72720000
727400                  (AT-CMPY-PL-INV-YTD /                           72730000
727500                  (PV-INV-MONTHS)))                               72740064
727600     END-IF.                                                      72750000
727700                                                                  72760000
624200*    INVENTORY TURN PLAN VAR                                      72781086
612600     IF AT-CMPY-TY-INV-YTD = ZEROS OR                             72782086
612600        AT-CMPY-PL-INV-YTD = ZEROS                                72783086
612700        MOVE ZEROS                TO DYL3-INV-TURN-YTD            72784086
612800     ELSE                                                         72785086
602600        COMPUTE PV-PCT =                                          72786086
602700            ((AT-CMPY-TY-SLS-YTD /                                72787086
602800             (AT-CMPY-TY-INV-YTD /                                72788086
602900             (PV-INV-MONTHS))) -                                  72789086
613000             (AT-CMPY-PL-SLS-YTD /                                72789186
613100             (AT-CMPY-PL-INV-YTD /                                72789286
613200             (PV-INV-MONTHS))))                                   72789386
613300        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           72789486
613400     END-IF.                                                      72789586
727900                                                                  72790000
728000     COMPUTE DYL3-MKDN-YTD     ROUNDED =                          72800000
728100              (AT-CMPY-TY-MKDN-YTD /                              72810000
728200                PC-THOUSAND) -                                    72820000
728300                AT-CMPY-PL-MKDN-YTD                               72830000
728400                                                                  72840000
728500*    GM %                                                         72850000
728600     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             72860000
728700        AT-CMPY-PL-SLS-YTD = ZEROS                                72870000
728800        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           72880000
728900     ELSE                                                         72890000
729000        COMPUTE PV-PCT =                                          72900000
729100              ((AT-CMPY-TY-GM-YTD * PC-HUNDRED) /                 72910000
729200                AT-CMPY-TY-SLS-YTD) -                             72920000
729300              ((AT-CMPY-PL-GM-YTD * PC-HUNDRED) /                 72930000
729400                AT-CMPY-PL-SLS-YTD)                               72940000
729500        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              72950000
729600     END-IF.                                                      72960000
729700                                                                  72970000
729800*    MKDN %                                                       72980000
729900     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             72990000
730000        AT-CMPY-PL-SLS-YTD = ZEROS                                73000000
730100        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         73010000
730200     ELSE                                                         73020000
730300        COMPUTE PV-PCT =                                          73030000
730400              ((AT-CMPY-TY-MKDN-YTD * PC-HUNDRED) /               73040000
730500                AT-CMPY-TY-SLS-YTD) -                             73050000
730600              ((AT-CMPY-PL-MKDN-YTD * PC-HUNDRED) /               73060000
730700                AT-CMPY-PL-SLS-YTD)                               73070000
730800        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            73080000
730900     END-IF.                                                      73090000
731000                                                                  73100000
731100     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         73110000
731200                                                                  73120000
731300*   *** PCT VARIANCE FORECAST ***                                 73130000
731400     MOVE SPACES                       TO DYL3-HEADING.           73140000
731500     MOVE PC-PVARFCST                  TO DYL3-TOTAL-DESC.        73150000
731600                                                                  73160000
731700     IF AT-CMPY-FC-SLS-YTD = ZEROS                                73170000
731800        MOVE ZEROS                     TO DYL3-SLS-YTD            73180000
731900     ELSE                                                         73190000
732000        COMPUTE PV-PCT =                                          73200000
732100                (((AT-CMPY-TY-SLS-YTD /                           73210000
732200                   PC-THOUSAND) -                                 73220000
732300                   AT-CMPY-FC-SLS-YTD) /                          73230000
732400                   AT-CMPY-FC-SLS-YTD) * 100                      73240000
732500        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                73250000
732600     END-IF.                                                      73260000
731600                                                                  73261062
731700*N/A IF AT-CMPY-FC-COMP-SLS-YTD = ZEROS                           73262062
731800*       MOVE ZEROS                     TO DYL3-SLS-YTD            73263062
731900*    ELSE                                                         73264062
732000*       COMPUTE PV-PCT =                                          73265062
732100*               (((AT-CMPY-TY-COMP-SLS-YTD /                      73266062
732200*                  PC-THOUSAND) -                                 73267062
732300*                  AT-CMPY-FC-COMP-SLS-YTD) /                     73268062
732400*                  AT-CMPY-FC-COMP-SLS-YTD) * 100                 73269062
732500*       COMPUTE DYL3-COMP-SLS-YTD      ROUNDED = PV-PCT           73269162
732600*    END-IF.                                                      73269262
732700                                                                  73270000
732800     IF AT-CMPY-FC-GM-YTD = ZEROS                                 73280000
732900        MOVE ZEROS                     TO DYL3-GM-YTD             73290000
733000     ELSE                                                         73300000
733100        COMPUTE PV-PCT =                                          73310000
733200                (((AT-CMPY-TY-GM-YTD /                            73320000
733300                   PC-THOUSAND) -                                 73330000
733400                   AT-CMPY-FC-GM-YTD) /                           73340000
733500                   AT-CMPY-FC-GM-YTD) * 100                       73350000
733600        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                73360000
733700     END-IF.                                                      73370000
733800                                                                  73380000
733900     IF AT-CMPY-FC-EOM-YTD = ZEROS                                73390000
734000        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        73400000
734100     ELSE                                                         73410000
734200        COMPUTE PV-PCT =                                          73420000
734300               (((AT-CMPY-TY-EOM-YTD /                            73430000
734400                  PC-THOUSAND) -                                  73440000
734500                  AT-CMPY-FC-EOM-YTD) /                           73450000
734600                  AT-CMPY-FC-EOM-YTD) * 100                       73460000
734700        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            73470000
734800     END-IF.                                                      73480000
734900                                                                  73490000
      *    ZERO INV AVG YTD AND INV TURN YTD                            73491000
735000     MOVE ZEROS                   TO DYL3-INV-AVG-YTD             73492000
735100                                     DYL3-INV-TURN-YTD.           73493000
735200                                                                  73494000
735300     IF AT-CMPY-FC-MKDN-YTD = ZEROS                               73495000
735400        MOVE ZEROS                     TO DYL3-MKDN-YTD           73496000
735500     ELSE                                                         73497000
735600        COMPUTE PV-PCT =                                          73498000
735700               (((AT-CMPY-TY-MKDN-YTD /                           73499000
735800                  PC-THOUSAND) -                                  73500000
735900                  AT-CMPY-FC-MKDN-YTD) /                          73510000
736000                  AT-CMPY-FC-MKDN-YTD) * 100                      73520000
736100        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                73530000
736200     END-IF.                                                      73540000
736300                                                                  73550000
      *    ZERO GM % YTD AND MKDN % YTD                                 73560000
736400     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              73570000
736500                                     DYL3-MKDN-PCT-YTD.           73580000
736600                                                                  73590000
736700     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         73600000
736800                                                                  73610000
736900*   *** PCT VARIANCE PLAN ***                                     73620000
737000     MOVE SPACES                       TO DYL3-HEADING.           73630000
737100     MOVE PC-PVARPL                    TO DYL3-TOTAL-DESC.        73640000
737200                                                                  73650000
737300     IF AT-CMPY-PL-SLS-YTD = ZEROS                                73660000
737400        MOVE ZEROS                     TO DYL3-SLS-YTD            73670000
737500     ELSE                                                         73680000
737600        COMPUTE PV-PCT =                                          73690000
737700                (((AT-CMPY-TY-SLS-YTD /                           73700000
737800                   PC-THOUSAND) -                                 73710000
737900                   AT-CMPY-PL-SLS-YTD) /                          73720000
738000                   AT-CMPY-PL-SLS-YTD) * 100                      73730000
738100        COMPUTE DYL3-SLS-YTD      ROUNDED = PV-PCT                73740000
738200     END-IF.                                                      73750000
737200                                                                  73751062
737300     IF AT-CMPY-PL-COMP-SLS-YTD = ZEROS                           73752062
737400        MOVE ZEROS                     TO DYL3-SLS-YTD            73753062
737500     ELSE                                                         73754062
737600        COMPUTE PV-PCT =                                          73755062
737700                (((AT-CMPY-TY-COMP-SLS-YTD /                      73756062
737800                   PC-THOUSAND) -                                 73757062
737900                   AT-CMPY-PL-COMP-SLS-YTD) /                     73758062
738000                   AT-CMPY-PL-COMP-SLS-YTD) * 100                 73759062
738100        COMPUTE DYL3-COMP-SLS-YTD ROUNDED = PV-PCT                73759162
738200     END-IF.                                                      73759262
738300                                                                  73760000
738400     IF AT-CMPY-PL-GM-YTD = ZEROS                                 73770000
738500        MOVE ZEROS                     TO DYL3-GM-YTD             73780000
738600     ELSE                                                         73790000
738700        COMPUTE PV-PCT =                                          73800000
738800                (((AT-CMPY-TY-GM-YTD /                            73810000
738900                   PC-THOUSAND) -                                 73820000
739000                   AT-CMPY-PL-GM-YTD) /                           73830000
739100                   AT-CMPY-PL-GM-YTD) * 100                       73840000
739200        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                73850000
739300     END-IF.                                                      73860000
739400                                                                  73870000
739500     IF AT-CMPY-PL-EOM-YTD = ZEROS                                73880000
739600        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        73890000
739700     ELSE                                                         73900000
739800        COMPUTE PV-PCT =                                          73910000
739900               (((AT-CMPY-TY-EOM-YTD /                            73920000
740000                  PC-THOUSAND) -                                  73930000
740100                  AT-CMPY-PL-EOM-YTD) /                           73940000
740200                  AT-CMPY-PL-EOM-YTD) * 100                       73950000
740300        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            73960000
740400     END-IF.                                                      73970000
740500                                                                  73980000
740600     IF AT-CMPY-PL-INV-YTD = ZEROS                                73990000
740700        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        74000000
740800     ELSE                                                         74010000
740900        COMPUTE PV-PCT =                                          74020000
741000               (((AT-CMPY-TY-INV-YTD /                            74030000
741100                  PC-THOUSAND) -                                  74040000
741200                  AT-CMPY-PL-INV-YTD) /                           74050000
741300                  AT-CMPY-PL-INV-YTD) * 100                       74060000
741400        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            74070000
741500     END-IF.                                                      74080000
741600                                                                  74090000
      *    ZERO INV-TURN YTD                                            74100000
741700     MOVE ZEROS                   TO DYL3-INV-TURN-YTD.           74110000
741800                                                                  74120000
741900     IF AT-CMPY-PL-MKDN-YTD = ZEROS                               74130000
742000        MOVE ZEROS                     TO DYL3-MKDN-YTD           74140000
742100     ELSE                                                         74150000
742200        COMPUTE PV-PCT =                                          74160000
742300               (((AT-CMPY-TY-MKDN-YTD /                           74170000
742400                  PC-THOUSAND) -                                  74180000
742500                  AT-CMPY-PL-MKDN-YTD) /                          74190000
742600                  AT-CMPY-PL-MKDN-YTD) * 100                      74200000
742700        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                74210000
742800     END-IF.                                                      74220000
742900                                                                  74230000
      *    ZERO GM % YTD AND MKDN % YTD                                 74240000
743000     MOVE ZEROS                   TO DYL3-GM-PCT-YTD              74250000
743100                                     DYL3-MKDN-PCT-YTD.           74260000
743200                                                                  74270000
743300     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         74280000
743400                                                                  74290000
743500*   *** PCT VARIANCE LAST YR ***                                  74300000
743600     MOVE SPACES                       TO DYL3-HEADING.           74310000
743700     MOVE PC-PVARLY                    TO DYL3-TOTAL-DESC.        74320000
743800                                                                  74330000
744000     IF AT-CMPY-LY-SLS-YTD = ZEROS                                74340000
744100        MOVE ZEROS                     TO DYL3-SLS-YTD            74350000
744200     ELSE                                                         74360000
744300        COMPUTE PV-PCT =                                          74370000
744400                 ((AT-CMPY-TY-SLS-YTD -                           74380000
744500                   AT-CMPY-LY-SLS-YTD) /                          74390000
744600                   AT-CMPY-LY-SLS-YTD) * 100                      74400000
744700        COMPUTE DYL3-SLS-YTD       ROUNDED = PV-PCT               74410000
744800     END-IF.                                                      74420000
743800                                                                  74421062
744000     IF AT-CMPY-LY-COMP-SLS-YTD = ZEROS                           74422062
744100        MOVE ZEROS                     TO DYL3-SLS-YTD            74423062
744200     ELSE                                                         74424062
744300        COMPUTE PV-PCT =                                          74425062
744400                 ((AT-CMPY-TY-COMP-SLS-YTD -                      74426062
744500                   AT-CMPY-LY-COMP-SLS-YTD) /                     74427062
744600                   AT-CMPY-LY-COMP-SLS-YTD) * 100                 74428062
744700        COMPUTE DYL3-COMP-SLS-YTD  ROUNDED = PV-PCT               74429062
744800     END-IF.                                                      74429162
744900                                                                  74430000
745000     IF AT-CMPY-LY-GM-YTD = ZEROS                                 74440000
745100        MOVE ZEROS                     TO DYL3-GM-YTD             74450000
745200     ELSE                                                         74460000
745300        COMPUTE PV-PCT =                                          74470000
745400                 ((AT-CMPY-TY-GM-YTD -                            74480000
745500                   AT-CMPY-LY-GM-YTD) /                           74490000
745600                   AT-CMPY-LY-GM-YTD) * 100                       74500000
745700        COMPUTE DYL3-GM-YTD       ROUNDED = PV-PCT                74510000
745800     END-IF.                                                      74520000
745900                                                                  74530000
746000     IF AT-CMPY-LY-EOM-YTD = ZEROS                                74540000
746100        MOVE ZEROS                     TO DYL3-INV-EOM-YTD        74550000
746200     ELSE                                                         74560000
746300        COMPUTE PV-PCT =                                          74570000
746400               ((AT-CMPY-TY-EOM-YTD -                             74580000
746500                  AT-CMPY-LY-EOM-YTD) /                           74590000
746600                  AT-CMPY-LY-EOM-YTD) * 100                       74600000
746700        COMPUTE DYL3-INV-EOM-YTD      ROUNDED = PV-PCT            74610000
746800     END-IF.                                                      74620000
746900                                                                  74630000
747000*    YTD INVENTORY AVG                                            74640000
747100     IF AT-CMPY-LY-INV-YTD = ZEROS                                74650000
747200        MOVE ZEROS                     TO DYL3-INV-AVG-YTD        74660000
747300     ELSE                                                         74670000
747400        COMPUTE PV-PCT =                                          74680000
747500               ((AT-CMPY-TY-INV-YTD -                             74690000
747600                  AT-CMPY-LY-INV-YTD) /                           74700000
747700                  AT-CMPY-LY-INV-YTD) * 100                       74710000
747800        COMPUTE DYL3-INV-AVG-YTD      ROUNDED = PV-PCT            74720000
747900     END-IF.                                                      74730000
748000                                                                  74740000
748100*    YTD INVENTORY TURN LAST YEAR                                 74750000
748200     IF AT-CMPY-TY-INV-YTD = ZEROS                                74760000
               OR AT-CMPY-LY-INV-YTD = ZEROS                            74760000
748300        MOVE ZEROS                TO DYL3-INV-TURN-YTD            74770000
748400     ELSE                                                         74780000
748500        COMPUTE PV-PCT =                                          74790000
748600            ((AT-CMPY-TY-SLS-YTD /                                74800048
748700             (AT-CMPY-TY-INV-YTD /                                74810048
748800             (PV-INV-MONTHS)))) -                                 74820064
748600            ((AT-CMPY-LY-SLS-YTD /                                74821048
748700             (AT-CMPY-LY-INV-YTD /                                74822048
748800             (PV-INV-MONTHS))))                                   74823064
748900        COMPUTE DYL3-INV-TURN-YTD      ROUNDED = PV-PCT           74830000
749000     END-IF.                                                      74840000
749100                                                                  74850000
749200*    YTD MKDN                                                     74860000
749300     IF AT-CMPY-LY-MKDN-YTD = ZEROS                               74870000
749400        MOVE ZEROS                     TO DYL3-MKDN-YTD           74880000
749500     ELSE                                                         74890000
749600        COMPUTE PV-PCT =                                          74900000
749700               ((AT-CMPY-TY-MKDN-YTD -                            74910000
749800                  AT-CMPY-LY-MKDN-YTD) /                          74920000
749900                  AT-CMPY-LY-MKDN-YTD) * 100                      74930000
750000        COMPUTE DYL3-MKDN-YTD     ROUNDED = PV-PCT                74940000
750100     END-IF.                                                      74950000
750200                                                                  74960000
750300*    YTD GM %                                                     74970000
750400     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             74980000
750500        AT-CMPY-LY-SLS-YTD = ZEROS                                74990000
750600        MOVE ZEROS                   TO DYL3-GM-PCT-YTD           75000000
750700     ELSE                                                         75010000
750800        COMPUTE PV-PCT =                                          75020000
750900              ((AT-CMPY-TY-GM-YTD * PC-HUNDRED) /                 75030000
751000                AT-CMPY-TY-SLS-YTD) -                             75040000
751100              ((AT-CMPY-LY-GM-YTD * PC-HUNDRED) /                 75050000
751200                AT-CMPY-LY-SLS-YTD)                               75060000
751300        COMPUTE DYL3-GM-PCT-YTD     ROUNDED = PV-PCT              75070000
751400     END-IF.                                                      75080000
751500                                                                  75090000
751600*    YTD MKDN %                                                   75100000
751700     IF AT-CMPY-TY-SLS-YTD = ZEROS OR                             75110000
751800        AT-CMPY-LY-SLS-YTD = ZEROS                                75120000
751900        MOVE ZEROS                   TO DYL3-MKDN-PCT-YTD         75130000
752000     ELSE                                                         75140000
752100        COMPUTE PV-PCT =                                          75150000
752200              ((AT-CMPY-TY-MKDN-YTD * PC-HUNDRED) /               75160000
752300                AT-CMPY-TY-SLS-YTD) -                             75170000
752400              ((AT-CMPY-LY-MKDN-YTD * PC-HUNDRED) /               75180000
752500                AT-CMPY-LY-SLS-YTD)                               75190000
752600        COMPUTE DYL3-MKDN-PCT-YTD     ROUNDED = PV-PCT            75200000
752700     END-IF.                                                      75210000
752800                                                                  75220000
649500*    YTD CUMM MKON PCT                                            75231015
649600     IF AT-CMPY-TY-PRCH-RTL-YTD = ZERO OR                         75232015
649600        AT-CMPY-LY-PRCH-RTL-YTD = ZERO                            75233015
649700        MOVE ZERO             TO DYL3-MKON-CUMM-YTD               75234015
649800     ELSE                                                         75235015
649900        COMPUTE PV-PCT =                                          75236015
650000               (((AT-CMPY-TY-PRCH-RTL-YTD  -                      75237015
650100                  AT-CMPY-TY-PRCH-CST-YTD) * PC-HUNDRED) /        75238015
650200                  AT-CMPY-TY-PRCH-RTL-YTD) -                      75239015
650000               (((AT-CMPY-LY-PRCH-RTL-YTD  -                      75239115
650100                  AT-CMPY-LY-PRCH-CST-YTD) * PC-HUNDRED) /        75239215
650200                  AT-CMPY-LY-PRCH-RTL-YTD)                        75239315
650300        COMPUTE DYL3-MKON-CUMM-YTD     ROUNDED = PV-PCT           75239415
650400     END-IF.                                                      75239515
754000                                                                  75330000
754100     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         75340000
754200                                                                  75350000
754300     MOVE SPACES TO DYL3-DETAIL-YTD-LINE-1.                       75360000
754400     PERFORM 7620-PRINT-YTD-DETAIL-LINE1.                         75370000
754500******************************************************************75380000
754600*  READ THE LEDGER EXTRACT WEEKLY FILE (MLRD122)                  75390000
754700******************************************************************75400000
754800 7000-READ-LEDGER-EXTRACT-WK.                                     75410000
754900                                                                  75420000
755000     READ LEDGER-EXTRACT-WK-FILE INTO ML122-LEDGER-EXTRACT-WK-REC 75430000
755100         AT END SET PS-END-OF-LEDGER-EXTRACT-WK TO TRUE.          75440000
755200                                                                  75450000
755300******************************************************************75460000
755400*  READ THE LEDGER EXTRACT MONTHLY FILE (MLRD128)                 75470000
755500******************************************************************75480000
755600 7050-READ-LEDGER-EXTRACT-MN.                                     75490000
755700                                                                  75500000
755800     READ LEDGER-EXTRACT-MN-FILE INTO ML128-LEDGER-EXTRACT-MN-REC 75510000
755900         AT END SET PS-END-OF-LEDGER-EXTRACT-MN TO TRUE.          75520000
756000                                                                  75530000
756100******************************************************************75540000
756200*  READ THE LEDGER EXTRACT MONTHLY FILE (MLRD128)                 75550000
756300******************************************************************75560000
756400 7060-READ-LEDGER-EXTRACT-EOW.                                    75570000
756500*                                                                 75580000
756600     READ LEDGER-EXTRACT-EOW-FILE                                 75590000
756700         INTO ML140-LEDGER-EXTRACT-EOW-REC                        75600000
756800         AT END SET PS-END-OF-LEDGER-EOW-FILE TO TRUE.            75610000
756900                                                                  75620000
757000******************************************************************75630000
757100*  READ THE LEDGER EXTRACT DATE FILE.                             75640000
757200******************************************************************75650000
757300 7100-READ-LEDGER-EXTRACT-DATE.                                   75660000
757400                                                                  75670000
757500     READ LEDGER-EXTRACT-DATE-FILE                                75680000
757600         INTO ML114-LEDGER-EXTRACT-DATE-REC                       75690000
757700         AT END SET PS-END-OF-LEDGER-DATE-FILE TO TRUE.           75700000
757800                                                                  75710000
757900******************************************************************75720000
758000*    FILL IN THE SUB HEADING INFORMATION.                         75730000
758100******************************************************************75740000
758200 7200-PRINT-PAGE-HEADINGS.                                        75750000
758300                                                                  75760000
758400     ADD  1           TO PV-PAGE-CNT.                             75770000
758500     MOVE PV-PAGE-CNT TO DP200O-PAGE-NUMBER.                      75780000
758600                                                                  75790000
           IF WEEKLY-REPORT                                             75791075
758700        WRITE WKLY-LEDGER-REPORT-RECORD                           75800075
758800            FROM DP200O-STANDRD-HEADER-200-COLS                   75810075
758900            AFTER ADVANCING PAGE                                  75820075
759000                                                                  75830000
759100        WRITE WKLY-LEDGER-REPORT-RECORD                           75840075
759200            FROM PH2-PAGE-HEADING-2                               75850075
759300            AFTER ADVANCING 1 LINE                                75860075
759400                                                                  75870000
759500        WRITE WKLY-LEDGER-REPORT-RECORD                           75880075
759600            FROM PH3-PAGE-HEADING-3                               75890075
759700            AFTER ADVANCING 1 LINE                                75900075
           ELSE                                                         75901075
758700        WRITE YTD-LEDGER-REPORT-RECORD                            75902075
758800            FROM DP200O-STANDRD-HEADER-200-COLS                   75903075
758900            AFTER ADVANCING PAGE                                  75904075
759000                                                                  75905075
759100        WRITE YTD-LEDGER-REPORT-RECORD                            75906075
759200            FROM PH2-PAGE-HEADING-2                               75907075
759300            AFTER ADVANCING 1 LINE                                75908075
759400                                                                  75909075
759500        WRITE YTD-LEDGER-REPORT-RECORD                            75909175
759600            FROM PH3-PAGE-HEADING-3                               75909275
759700            AFTER ADVANCING 1 LINE                                75909375
           END-IF.                                                      75909475
759800                                                                  75910000
759900******************************************************************75920000
760000* PRINT REPORT PAGE 1 COLUMN HEADINGS                             75930000
760100******************************************************************75940000
760200 7300-PRINT-COL-PG1-HEADINGS.                                     75950000
760300                                                                  75960000
760400     WRITE WKLY-LEDGER-REPORT-RECORD                              75970075
760500         FROM WH1-WKLY-PG1-HEADER-1A                              75980000
760600         AFTER ADVANCING 2 LINES.                                 75990000
760700                                                                  76000000
760800     WRITE WKLY-LEDGER-REPORT-RECORD                              76010075
760900         FROM WH1-WKLY-PG1-HEADER-1B                              76020000
761000         AFTER ADVANCING 1 LINE.                                  76030000
761100                                                                  76040000
761200     WRITE WKLY-LEDGER-REPORT-RECORD                              76050075
761300         FROM UL1-UNDER-LINE-1                                    76060000
761400         AFTER ADVANCING 1 LINE.                                  76070000
761500                                                                  76080000
761600******************************************************************76090000
761700* PRINT REPORT PAGE 2 COLUMN HEADINGS                             76100000
761800******************************************************************76110000
761900 7400-PRINT-COL-PG2-HEADINGS.                                     76120000
762000                                                                  76130000
762100     WRITE WKLY-LEDGER-REPORT-RECORD                              76140075
762200         FROM WH2-WKLY-PG2-HEADER-1A                              76150000
762300         AFTER ADVANCING 2 LINES.                                 76160000
762400                                                                  76170000
762500     WRITE WKLY-LEDGER-REPORT-RECORD                              76180075
762600         FROM WH2-WKLY-PG2-HEADER-1B                              76190000
762700         AFTER ADVANCING 1 LINE.                                  76200000
762800                                                                  76210000
762900     WRITE WKLY-LEDGER-REPORT-RECORD                              76220075
763000         FROM UL2-UNDER-LINE-1                                    76230000
763100         AFTER ADVANCING 1 LINE.                                  76240000
763200                                                                  76250000
763300******************************************************************76260000
763400*  PRINT PAGE 3 REPORT AND COLUMN HEADINGS                        76270050
763500******************************************************************76280000
763600 7500-PRINT-COL-PG3-HEADINGS.                                     76290000
763700                                                                  76300000
763800     WRITE YTD-LEDGER-REPORT-RECORD                               76310075
763900         FROM YH3-YTD-PG3-HEADER-1A                               76320000
764000         AFTER ADVANCING 2 LINES.                                 76330000
764100                                                                  76340000
764200     WRITE YTD-LEDGER-REPORT-RECORD                               76350075
764300         FROM YH3-YTD-PG3-HEADER-1B                               76360000
764400         AFTER ADVANCING 1 LINE.                                  76370000
764500                                                                  76380000
764600     WRITE YTD-LEDGER-REPORT-RECORD                               76390075
764700         FROM UL3-UNDER-LINE-1                                    76400000
764800         AFTER ADVANCING 1 LINE.                                  76410000
764900                                                                  76420000
765000******************************************************************76430000
765100*  PRINT WEEKLY DETAIL LINE 1                                     76440050
765200******************************************************************76450000
765300 7600-PRINT-WK-DETAIL-LINE1.                                      76460000
765400                                                                  76470000
765500     WRITE WKLY-LEDGER-REPORT-RECORD                              76480075
765600         FROM DWL1-DETAIL-WK-LINE-1                               76490000
765700         AFTER ADVANCING 1 LINE.                                  76500000
765800                                                                  76510000
765900     ADD 1 TO PV-LINE-COUNTER-1.                                  76520000
766000     INITIALIZE DWL1-DETAIL-WK-LINE-1.                            76530000
766100                                                                  76540000
766200******************************************************************76550000
766300*  PRINT WEEKLY DETAIL LINE 2                                     76560050
766400******************************************************************76570000
766500 7610-PRINT-WK-DETAIL-LINE2.                                      76580000
766600                                                                  76590000
766700     WRITE WKLY-LEDGER-REPORT-RECORD                              76600075
766800         FROM DWL2-DETAIL-WK-LINE-1                               76610000
766900         AFTER ADVANCING 1 LINE.                                  76620000
767000                                                                  76630000
767100     ADD 1 TO PV-LINE-COUNTER-2.                                  76640000
767200     INITIALIZE DWL2-DETAIL-WK-LINE-1.                            76650000
767300                                                                  76660000
767400******************************************************************76670000
767500*  PRINT YTD DETAIL LINE                                          76680050
767600******************************************************************76690000
767700 7620-PRINT-YTD-DETAIL-LINE1.                                     76700000
767800                                                                  76710000
767900     WRITE YTD-LEDGER-REPORT-RECORD                               76720075
768000         FROM DYL3-DETAIL-YTD-LINE-1                              76730000
768100         AFTER ADVANCING 1 LINE.                                  76740000
768200                                                                  76750000
768300     ADD 1 TO PV-LINE-COUNTER-3.                                  76760000
768400     INITIALIZE DYL3-DETAIL-YTD-LINE-1.                           76770000
768500                                                                  76780000
767400******************************************************************76780150
767500*  PRINT SEPARATOR LINE                                           76780250
767600******************************************************************76780350
767700 7630-PRINT-SEPARATOR-LINE.                                       76780450
767800                                                                  76780550
           IF WEEKLY-REPORT                                             76780676
320900        MOVE DYL2-DETAIL-SEPARATOR-LINE TO DWL1-DETAIL-WK-LINE-1  76780776
321000        PERFORM 7600-PRINT-WK-DETAIL-LINE1                        76780876
320900        MOVE SPACES                     TO DWL1-DETAIL-WK-LINE-1  76780976
321000        PERFORM 7600-PRINT-WK-DETAIL-LINE1                        76781076
           ELSE                                                         76781176
320900        MOVE DYL2-DETAIL-SEPARATOR-LINE TO DYL3-DETAIL-YTD-LINE-1 76781276
321000        PERFORM 7620-PRINT-YTD-DETAIL-LINE1                       76781376
320900        MOVE SPACES                     TO DYL3-DETAIL-YTD-LINE-1 76781476
321000        PERFORM 7620-PRINT-YTD-DETAIL-LINE1                       76781576
           END-IF.                                                      76781676
                                                                        76782050
769700******************************************************************76790000
769800* GET THIS YEAR'S AND LAST YEAR'S DATES USED IN THIS PROGRAM.     76800000
769900*                                                                 76810000
770000* THIS QUERY HANDLES GETTING THE MONTH END DATE WHEN THE CURRENT  76820000
770100* MONTH HAS THE 53RD WEEK IN IT.                                  76830000
770200*                                                                 76840000
770300* IN THE FIRST SELECT:                                            76850000
770400*                                                                 76860000
770500*    TABLE TDTATTR A - THIS FISCAL YEAR'S DATES                   76870000
770600*    TABLE TDTATTR B - LAST FISCAL YEAR'S DATES WHEN THIS YEAR    76880000
770700*                      ONLY HAS 52 WEEKS                          76890000
770800*    TABLE TDTATTR C - LAST FISCAL YEAR'S DATES WHEN THIS YEAR    76900000
770900*                      HAS 53 WEEKS                               76910000
771000*    TABLE TDTATTR D - TO GET TOTAL NUMBER OF WEEKS IN MONTH FOR  76920000
771100*                      THIS YEAR.                                 76930000
771200*    TABLE TDTATTR E - TO GET TOTAL NUMBER OF WEEKS IN MONTH FOR  76940000
771300*                      LAST YEAR.                                 76950000
771400******************************************************************76960000
771500 8000-GET-DATE-ATTRIBUTES.                                        76970000
771600                                                                  76980000
771700     EXEC SQL                                                     76990000
771800          SELECT                                                  77000000
771900                   A.FSCL_YR_NBR                                  77010000
772000                  ,A.FSCL_MN_NM                                   77020000
772100                  ,A.FSCL_MN_NBR                                  77030000
772200                  ,A.WK_IN_MN_NBR                                 77040000
772300                  ,A.FSCL_WK_NBR                                  77050000
772400                  ,A.FSCL_YR_BEG_DTE                              77060000
772500                  ,A.FSCL_YR_END_DTE                              77070000
772600                  ,D.WK_IN_MN_NBR                                 77080000
772700                  ,E.WK_IN_MN_NBR                                 77090000
772800          INTO     :DTATTR-FSCL-YR-NBR                            77100000
772900                  ,:DTATTR-FSCL-MN-NM                             77110000
773000                  ,:DTATTR-FSCL-MN-NBR                            77120000
773100                  ,:DTATTR-WK-IN-MN-NBR                           77130000
773200                  ,:DTATTR-FSCL-WK-NBR                            77140000
773300                  ,:DTATTR-FSCL-YR-BEG-DTE                        77150000
773400                  ,:DTATTR-FSCL-YR-END-DTE                        77160000
773500                  ,:TY-LAST-WK-IN-MN                              77170000
773600                  ,:LY-LAST-WK-IN-MN                              77180000
773700          FROM                                                    77190000
773800               TDTATTR A                                          77200000
773900              ,TDTATTR B                                          77210000
774000              ,TDTATTR C                                          77220000
774100              ,TDTATTR D                                          77230000
774200              ,TDTATTR E                                          77240000
774300          WHERE A.KY_DTE             =:ML114-EXTRACT-DTE          77250000
774400           AND E.KY_DTE              = C.FSCL_MN_END_DTE          77260000
774500           AND D.KY_DTE              = A.FSCL_MN_END_DTE          77270000
774600           AND C.KY_DTE              = B.LY_THIS_DAY_KY_DTE       77280000
774700           AND B.KY_DTE              = A.FSCL_MN_END_DTE - 7 DAYS 77290000
774800           AND A.FSCL_MN_END_DTE     = B.FSCL_MN_END_DTE          77300000
774900           AND A.LY_THIS_DAY_KY_DTE  = '9999-09-09'               77310000
775000                                                                  77320000
775100          UNION                                                   77330000
775200                                                                  77340000
775300          SELECT                                                  77350000
775400                   A.FSCL_YR_NBR                                  77360000
775500                  ,A.FSCL_MN_NM                                   77370000
775600                  ,A.FSCL_MN_NBR                                  77380000
775700                  ,A.WK_IN_MN_NBR                                 77390000
775800                  ,A.FSCL_WK_NBR                                  77400000
775900                  ,A.FSCL_YR_BEG_DTE                              77410000
776000                  ,A.FSCL_YR_END_DTE                              77420000
776100                  ,D.WK_IN_MN_NBR                                 77430000
776200                  ,E.WK_IN_MN_NBR                                 77440000
776300          INTO     :DTATTR-FSCL-YR-NBR                            77450000
776400                  ,:DTATTR-FSCL-MN-NM                             77460000
776500                  ,:DTATTR-FSCL-MN-NBR                            77470000
776600                  ,:DTATTR-WK-IN-MN-NBR                           77480000
776700                  ,:DTATTR-FSCL-WK-NBR                            77490000
776800                  ,:DTATTR-FSCL-YR-BEG-DTE                        77500000
776900                  ,:DTATTR-FSCL-YR-END-DTE                        77510000
777000                  ,:TY-LAST-WK-IN-MN                              77520000
777100                  ,:LY-LAST-WK-IN-MN                              77530000
777200          FROM                                                    77540000
777300               TDTATTR A                                          77550000
777400              ,TDTATTR B                                          77560000
777500              ,TDTATTR C                                          77570000
777600              ,TDTATTR D                                          77580000
777700              ,TDTATTR E                                          77590000
777800          WHERE A.KY_DTE             =:ML114-EXTRACT-DTE          77600000
777900           AND E.KY_DTE              = B.FSCL_MN_END_DTE          77610000
778000           AND D.KY_DTE              = A.FSCL_MN_END_DTE          77620000
778100           AND C.KY_DTE              = B.LY_THIS_DAY_KY_DTE       77630000
778200           AND B.KY_DTE              = A.LY_THIS_DAY_KY_DTE       77640000
778300           AND A.FSCL_MN_END_DTE    ^= B.FSCL_MN_END_DTE          77650000
W26603          WITH UR                                                         
778400     END-EXEC.                                                    77660000
778500                                                                  77670000
778600     EVALUATE TRUE                                                77680000
778700         WHEN SQLCODE = ZERO                                      77690000
778800             CONTINUE                                             77700000
778900         WHEN OTHER                                               77710000
779000             DISPLAY 'DTATTR-KY-DTE: ' DTATTR-KY-DTE              77720000
779100             MOVE    '8000-GET-DATE-ATTRIBUTES'                   77730000
779200                                          TO PV-PARAGRAPH-NAME    77740000
779300             MOVE    'SELECT ROW FROM TDTATTR'                    77750000
779400                                          TO PV-DB2-OPER-ATTEMPTED77760000
779500             PERFORM 9998-SQL-ABEND                               77770000
779600     END-EVALUATE.                                                77780000
779700                                                                  77790000
779800******************************************************************77800000
779900*                                                                 77810000
780000******************************************************************77820000
780100 8100-GET-GMM-NAME.                                               77830000
780200                                                                  77840000
780300     EXEC SQL                                                     77850000
780400          SELECT      B.WORKER_LAST_NAME                          77860000
780500               ,      B.WORKER_FIR_NAME                           77870000
780600            INTO     :RSPBAR-WORKER-LAST-NAME                     77880000
780700               ,     :RSPBAR-WORKER-FIR-NAME                      77890000
780800            FROM      TMDSEAR A                                   77900000
780900               ,      TRSPBAR B                                   77910000
781000               ,      TAPLAVL C                                   77920000
781100           WHERE      A.GMA_NBR     = :PV-GMA-NBR                 77930000
781200             AND      B.RSPLVL_CDE  = :PC-RSPLVL-CDE-GMM          77940000
781300             AND      A.OPERCO_NBR  = :PC-OPERCO-NBR              77950000
781400             AND      C.APLSYS_CDE  = :PC-APLSYS-CDE              77960000
781500             AND      A.MDSEAR_DKEY =  B.MDSEAR_DKEY              77970000
781600             AND      A.MDSEAR_DKEY =  C.MDSEAR_DKEY              77980000
781700             AND     (:ML114-EXTRACT-DTE                          77990000
781800                      BETWEEN B.WORKER_STRT_DTE                   78000000
781900                      AND     B.WORKER_END_DTE)                   78010000
782000             AND     (:ML114-EXTRACT-DTE                          78020000
782100                      BETWEEN C.MDSEAR_STRT_DTE                   78030000
782200                      AND     C.MDSEAR_END_DTE)                   78040000
W26603           WITH UR                                                        
782300     END-EXEC.                                                    78050000
782400                                                                  78060000
782500     EVALUATE TRUE                                                78070000
782600         WHEN SQLCODE = ZERO                                      78080000
782700             CONTINUE                                             78090000
782800         WHEN SQLCODE = +100                                      78100000
782900             MOVE 'OPEN' TO  RSPBAR-WORKER-FIR-NAME               78110000
783000             MOVE SPACE  TO  RSPBAR-WORKER-LAST-NAME              78120000
783100         WHEN OTHER                                               78130000
783200             MOVE '8100-GET-GMM-NAME'     TO PV-PARAGRAPH-NAME    78140000
783300             MOVE 'SELECT ROW FROM TRSPBAR'                       78150000
783400                                          TO PV-DB2-OPER-ATTEMPTED78160000
783500             PERFORM 9998-SQL-ABEND                               78170000
783600     END-EVALUATE.                                                78180000
783700                                                                  78190000
783800******************************************************************78200000
783900*                                                                 78210000
784000******************************************************************78220000
784100 8200-GET-DMM-NAME.                                               78230000
784200                                                                  78240000
784300     EXEC SQL                                                     78250000
784400          SELECT      B.WORKER_LAST_NAME                          78260000
784500                     ,B.WORKER_FIR_NAME                           78270000
784600            INTO     :RSPBAR-WORKER-LAST-NAME                     78280000
784700                    ,:RSPBAR-WORKER-FIR-NAME                      78290000
784800            FROM      TMDSEAR A                                   78300000
784900                     ,TRSPBAR B                                   78310000
785000                     ,TAPLAVL C                                   78320000
785100           WHERE     (A.DMA_NBR     = :PV-DMA-NBR)                78330000
785200             AND     (B.RSPLVL_CDE  = :PC-RSPLVL-CDE-DMM)         78340000
785300             AND     (A.OPERCO_NBR  = :PC-OPERCO-NBR)             78350000
785400             AND     (C.APLSYS_CDE  = :PC-APLSYS-CDE)             78360000
785500             AND     (A.MDSEAR_DKEY =  B.MDSEAR_DKEY)             78370000
785600             AND     (A.MDSEAR_DKEY =  C.MDSEAR_DKEY)             78380000
785700             AND     (:ML114-EXTRACT-DTE                          78390000
785800                      BETWEEN B.WORKER_STRT_DTE                   78400000
785900                      AND     B.WORKER_END_DTE)                   78410000
786000             AND     (:ML114-EXTRACT-DTE                          78420000
786100                      BETWEEN C.MDSEAR_STRT_DTE                   78430000
786200                      AND     C.MDSEAR_END_DTE)                   78440000
W26603           WITH UR                                                        
786300     END-EXEC.                                                    78450000
786400                                                                  78460000
786500     EVALUATE TRUE                                                78470000
786600         WHEN SQLCODE = ZERO                                      78480000
786700             CONTINUE                                             78490000
786800         WHEN SQLCODE = +100                                      78500000
786900             MOVE 'OPEN' TO  RSPBAR-WORKER-FIR-NAME               78510000
787000             MOVE SPACE  TO  RSPBAR-WORKER-LAST-NAME              78520000
787100         WHEN OTHER                                               78530000
787200             MOVE '8200-GET-DMM-NAME'     TO PV-PARAGRAPH-NAME    78540000
787300             MOVE 'SELECT ROW FROM TRSPBAR'                       78550000
787400                                          TO PV-DB2-OPER-ATTEMPTED78560000
787500             PERFORM 9998-SQL-ABEND                               78570000
787600     END-EVALUATE.                                                78580000
787700                                                                  78590000
787800******************************************************************78600000
787900*                                                                 78610000
788000******************************************************************78620000
788100 8400-GET-MDSEAR-DESC.                                            78630000
788200                                                                  78640000
788300     EXEC SQL                                                     78650000
788400         SELECT     A.MDSEAR_DESC                                 78660000
788500           INTO    :MDSEAR-DESC                                   78670000
788600           FROM     TMDSEAR A                                     78680000
788700                   ,TAPLAVL B                                     78690000
788800          WHERE    (A.GMA_NBR     = :PV-GMA-NBR                   78700000
788900             OR     A.DMA_NBR     = :PV-DMA-NBR                   78710000
789000             OR     A.BYR_NBR     = :PV-BYR-NBR)                  78720000
789100            AND    (A.DEPT_NBR    = :PV-DEPT-NBR)                 78730000
789200            AND    (A.MDSELV_CDE  = :PV-MDSELV-CDE)               78740000
789300            AND    (A.OPERCO_NBR  = :PC-OPERCO-NBR)               78750000
789400            AND    (B.APLSYS_CDE  = :PC-APLSYS-CDE)               78760000
789500            AND    (A.MDSEAR_DKEY =  B.MDSEAR_DKEY)               78770000
789600            AND    (:ML114-EXTRACT-DTE                            78780000
789700                    BETWEEN B.MDSEAR_STRT_DTE                     78790000
789800                    AND     B.MDSEAR_END_DTE)                     78800000
789900            AND    (:ML114-EXTRACT-DTE                            78810000
790000                    BETWEEN A.STRT_DTE                            78820000
790100                    AND     A.END_DTE)                            78830000
W26603           WITH UR                                                        
790200     END-EXEC.                                                    78840000
790300                                                                  78850000
790400     EVALUATE TRUE                                                78860000
790500         WHEN SQLCODE = ZERO                                      78870000
790600             CONTINUE                                             78880000
790700         WHEN SQLCODE = +100                                      78890000
790800             MOVE 'NOT FOUND' TO MDSEAR-DESC                      78900000
790900         WHEN OTHER                                               78910000
791000             MOVE '8400-GET-MDSEAR-DESC'  TO PV-PARAGRAPH-NAME    78920000
791100             MOVE 'SELECT DEPARTMENT ROW ON TMDSEAR'              78930000
791200                                          TO PV-DB2-OPER-ATTEMPTED78940000
791300             PERFORM 9998-SQL-ABEND                               78950000
791400     END-EVALUATE.                                                78960000
791500                                                                  78970000
791600******************************************************************78980000
791700*                                                                 78990000
791800******************************************************************79000000
791900 8500-OPEN-FSCL-MN-NM-CSR.                                        79010000
792000                                                                  79020000
792100     EXEC SQL                                                     79030000
792200          OPEN FSCL-MN-NM-CSR                                     79040000
792300     END-EXEC.                                                    79050000
792400                                                                  79060000
792500     EVALUATE TRUE                                                79070000
792600         WHEN SQLCODE = ZERO                                      79080000
792700             CONTINUE                                             79090000
792800         WHEN OTHER                                               79100000
792900             MOVE '8500-OPEN-FSCL-MN-NM-CSR'                      79110000
793000                                          TO PV-PARAGRAPH-NAME    79120000
793100             MOVE 'OPEN FSCL-MN-NM-CSR'   TO PV-DB2-OPER-ATTEMPTED79130000
793200             PERFORM 9998-SQL-ABEND                               79140000
793300     END-EVALUATE.                                                79150000
793400                                                                  79160000
793500******************************************************************79170000
793600*                                                                 79180000
793700******************************************************************79190000
793800 8600-FETCH-FSCL-MN-NM-CSR.                                       79200000
793900                                                                  79210000
794000     EXEC SQL                                                     79220000
794100         FETCH                                                    79230000
794200             FSCL-MN-NM-CSR                                       79240000
794300         INTO                                                     79250000
794400             :DTATTR-FSCL-MN-NBR                                  79260000
794500            ,:DTATTR-FSCL-MN-NM                                   79270000
794600     END-EXEC.                                                    79280000
794700                                                                  79290000
794800     EVALUATE TRUE                                                79300000
794900         WHEN SQLCODE = ZERO                                      79310000
795000             CONTINUE                                             79320000
795100         WHEN SQLCODE = +100                                      79330000
795200             SET PS-END-OF-FSCL-MN-NM-CSR TO TRUE                 79340000
795300         WHEN OTHER                                               79350000
795400             MOVE '8600-FETCH-FSCL-MN-NM-CSR'                     79360000
795500                                          TO PV-PARAGRAPH-NAME    79370000
795600             MOVE 'FETCH FSCL-MN-NM-CSR'  TO PV-DB2-OPER-ATTEMPTED79380000
795700             PERFORM 9998-SQL-ABEND                               79390000
795800     END-EVALUATE.                                                79400000
795900                                                                  79410000
796000******************************************************************79420000
796100*                                                                 79430000
796200******************************************************************79440000
796300 8700-CLOSE-FSCL-MN-NM-CSR.                                       79450000
796400                                                                  79460000
796500     EXEC SQL                                                     79470000
796600         CLOSE FSCL-MN-NM-CSR                                     79480000
796700     END-EXEC.                                                    79490000
796800                                                                  79500000
796900     EVALUATE TRUE                                                79510000
797000         WHEN SQLCODE = ZERO                                      79520000
797100             CONTINUE                                             79530000
797200         WHEN OTHER                                               79540000
797300             MOVE '8700-CLOSE-FSCL-MN-NM-CSR'                     79550000
797400                                          TO PV-PARAGRAPH-NAME    79560000
797500             MOVE 'CLOSE FSCL-MN-NM-CSR'  TO PV-DB2-OPER-ATTEMPTED79570000
797600             PERFORM 9998-SQL-ABEND                               79580000
797700     END-EVALUATE.                                                79590000
797800                                                                  79600000
798500******************************************************************79670000
798600* SQL ABEND                                                       79680000
798700******************************************************************79690000
798800 9998-SQL-ABEND.                                                  79700000
798900                                                                  79710000
799000     MOVE +4013 TO PV-ABEND-CODE.                                 79720000
799100     DISPLAY '** ABEND **         ** = SQLERROR'.                 79730000
799200     DISPLAY '** PROGRAM          ** = MLKRP224'.                 79740000
799300     DISPLAY '** PARAGRAPH        ** = ' PV-PARAGRAPH-NAME.       79750000
799400     DISPLAY '** OPERATION        ** = ' PV-DB2-OPER-ATTEMPTED.   79760000
799500                                                                  79770000
799600*    THE FOLLOWING COPYBOOK UTILIZES THE DB2 ABEND MODULE         79780000
799700*    DSNTIAR TO CONVERT SQLCA INTO UNDERSTANDABLE VERBAGE.        79790000
799800     COPY DPPD004.                                                79800000
799900                                                                  79810000
800000     PERFORM 9999-ABEND.                                          79820000
800100                                                                  79830000
800200                                                                  79840000
800300******************************************************************79850000
800400* ABEND                                                           79860000
800500******************************************************************79870000
800600 9999-ABEND.                                                      79880000
800700                                                                  79890000
800800     CALL 'ILBOABN0'  USING PV-ABEND-CODE.                        79900000
