       IDENTIFICATION DIVISION.                                         00010099
                                                                        00020099
       PROGRAM-ID.    MLKUP351.                                         00030099
       AUTHOR.        ERIN SEARL.                                       00040099
       INSTALLATION.  KOHLS DEPARTMENT STORES.                          00050099
       DATE-WRITTEN.  8-10-04.                                          00060099
       DATE-COMPILED.                                                   00070099
                                                                        00080099
      ******************************************************************00090099
      *     MLKUP351 - MONTHLY DETAILED ML ON-ORDER UPDATE PROGRAM     *00100099
      ******************************************************************00110099
      *     THIS PROGRAM WILL MAINTAIN THE MONTHLY DETAIL ML DB2       *00120099
      * TABLE WITH ONORDER RETAIL AND COST FIELDS.  THE TABLE IS READ  *00130099
      * USING THE TABLE KEY FROM EACH SORT-SUMMED INPUT FILE           *00140099
      * RECORD.  IF THE ROW IS FOUND, THE ROW IS UPDATED WITH DATA     *00150099
      * FROM THE INPUT FILE RECORD.  IF THE ROW IS NOT FOUND, A NEW    *00160099
      * ROW IS INSERTED ON THE DB2 TABLE (MLT_MNLY_SUM).  COMMITS ARE  *00170099
      * TAKEN EVERY TEN SECONDS, AND CHECKPOINT RESTART LOGIC IS       *00180099
      * INCORPORATED.                                                  *00190099
      ******************************************************************00200099
      *    WR/PITS#     DATE        DESCRIPTION                        *00210099
      *    --------   --------     ---------------------------------   *00220099
      *    21764      01/13/2005   MADE CHANGES TO MLPD500 AND MLWS500 *00230099
      *    W28582     12/14/2005   CHANGED ENT-ID TO ML-LWST-ID OR     *00240099
      *                            ML-LO-MDSE-LVL-ID.      C. MCCAMMON *00250099
J28582*    W28582     02/28/2007   ADD FISCAL BEGIN AND END DATES TO   *00260099
      *                            CHECKPOINT RESTART.   J. SELWITSCHKA*00270099
B28582*    W28582     04/16/2007   INIT COLUMNS ON TABLE INSERT        *00280099
B28582*    W                       B.GRAHAM   STRATAGEM                *00290099
      ******************************************************************00300099
                                                                        00310099
       ENVIRONMENT DIVISION.                                            00320099
                                                                        00330099
       CONFIGURATION SECTION.                                           00340099
       SOURCE-COMPUTER.        IBM-3090.                                00350099
       OBJECT-COMPUTER.        IBM-3090.                                00360099
       INPUT-OUTPUT SECTION.                                            00370099
       FILE-CONTROL.                                                    00380099
           SELECT CONDENSED-FILE                                        00390099
               ASSIGN TO INP01.                                         00400099
                                                                        00410099
           SELECT LEDGER-EXTRACT-DATE-FILE                              00420099
               ASSIGN TO INP02.                                         00430099
                                                                        00440099
       DATA DIVISION.                                                   00450099
       FILE SECTION.                                                    00460099
                                                                        00470099
       FD  CONDENSED-FILE                                               00480099
           LABEL RECORDS ARE STANDARD                                   00490099
           RECORDING MODE IS F                                          00500099
           BLOCK CONTAINS 0 RECORDS.                                    00510099
       01  CONDENSED-RECORD            PIC X(80).                       00520099
      *                                                                 00530099
       FD  LEDGER-EXTRACT-DATE-FILE                                     00540099
           RECORDING MODE IS F                                          00550099
           LABEL RECORDS ARE STANDARD                                   00560099
           BLOCK CONTAINS 0 RECORDS.                                    00570099
       01  LEDGER-EXTRACT-DATE-RECORD       PIC X(80).                  00580099
                                                                        00590099
      *                                                                 00600099
       WORKING-STORAGE SECTION.                                         00610099
                                                                        00620099
       01  ABEND-CODE                  PIC S9(04)  VALUE ZERO COMP SYNC.00630099
                                                                        00640099
       01  PC-PROGRAM-CONSTANTS.                                        00650099
           05  PC-JOB-NAME             PIC  X(06)    VALUE 'MLK110'.    00660099
           05  PC-PROGRAM-NAME         PIC  X(08)    VALUE 'MLKUP351'.  00670099
           05  PC-MAX-RETRIES          PIC S9(03) VALUE +3.             00680099
           05  PC-MAX-DEADLOCKS        PIC S9(03) VALUE +3.             00690099
                                                                        00700099
       01  PC-PROGRAM-COUNTER.                                          00710099
           05  PC-UPDATE-CNT           PIC  9(09).                      00720099
           05  PC-DISPLAY-CNT          PIC  9(09).                      00730099
                                                                        00740099
       01  PE-PROGRAM-ERROR-MESSAGES.                                   00750099
           05  PE-MSG-01                       PIC X(50) VALUE          00760099
                'ATTEMPT TO SELECT ROW FOR UPDATE/INSERT FAILED   '.    00770099
           05  PE-MSG-02                       PIC X(50) VALUE          00780099
                'ATTEMPT TO UPDATE ROW ON TABLE MLT_MNLY_SUM FAILED'.   00790099
           05  PE-MSG-03                       PIC X(50) VALUE          00800099
                'ATTEMPT TO INSERT ROW ON TABLE MLT_MNLY_SUM FAILED'.   00810099
           05  PE-MSG-04                       PIC X(50) VALUE          00820099
                'ERROR IN SELECT ''STATUS CODE'' FROM TCKRSTCNTL  '.    00830099
           05  PE-MSG-05                       PIC X(50) VALUE          00840099
                'UPDATE TO ''WORK_STRG_DESC'' ON TCKRSTINF FAILED '.    00850099
           05  PE-MSG-06                       PIC X(50) VALUE          00860099
                'PROGRAM ABENDED WHILE TRYING TO PERFORM A COMMIT '.    00870099
           05  PE-MSG-07                       PIC X(50) VALUE          00880099
                'PROGRAM MAXIMUM DEADLOCK COUNT HAS BEEN EXCEEDED'.     00890099
           05  PE-MSG-08                       PIC X(50) VALUE          00900099
                'AFTER DEADLOCK ERROR, AN UPDATE OR INSERT FAILED'.     00910099
           05  PE-MSG-09                       PIC X(50) VALUE          00920099
                'CHECKPNT RESTART FAILED UPON FIRST INSERT/UPDATE'.     00930099
           05  PE-MSG-10                       PIC X(50) VALUE          00940099
                'UPDATE OF STATUS CODE ON TCKRSTCNTL UNSUCCESSFUL'.     00950099
           05  PE-MSG-11                       PIC X(50) VALUE          00960099
                'ATTEMPT TO SELECT TIMESTAMP + CKPT_FRQNCY_QTY   '.     00970099
           05  PE-MSG-12                       PIC X(50) VALUE          00980099
                'UPDATE MLT_MNLY_SUM TO INIT ONORD AMOUNT FAILED '.     00990099
           05  PE-MSG-13                       PIC X(50) VALUE          01000099
                'ATTEMPT TO SELECT ROW FROM TDTATTR FAILED       '.     01010099
           05  PE-MSG-14                       PIC X(50) VALUE          01020099
                'ATTEMPT TO OPEN PARTN-CSR FAILED                '.     01030099
           05  PE-MSG-15                       PIC X(50) VALUE          01040099
                'ATTEMPT TO FETCH PARTN-CSR FAILED               '.     01050099
           05  PE-MSG-16                       PIC X(50) VALUE          01060099
                'ATTEMPT TO CLOSE PARTN-CSR FAILED               '.     01070099
           05  PE-MSG-17                       PIC X(50) VALUE          01080099
                'ATTEMPT TO OPEN DEPT-CSR FAILED                 '.     01090099
           05  PE-MSG-18                       PIC X(50) VALUE          01100099
                'ATTEMPT TO FETCH DEPT-CSR FAILED                '.     01110099
           05  PE-MSG-19                       PIC X(50) VALUE          01120099
                'ATTEMPT TO CLOSE DEPT-CSR FAILED                '.     01130099
      *                                                                 01140099
       01  PS-PROGRAM-SWITCHES.                                         01150099
           05  PS-INPUT-FILE-EOF-SW         PIC  X        VALUE 'N'.    01160099
               88  PS-MORE-INPUT-RECORDS                  VALUE 'N'.    01170099
               88  PS-NO-MORE-INPUT-RECORDS               VALUE 'Y'.    01180099
           05  PS-EMPTY-FILE-SW             PIC  X        VALUE 'N'.    01190099
               88  PS-EMPTY-INPUT-FILE                    VALUE 'Y'.    01200099
           05  PS-FIRST-COMMIT-SW           PIC X         VALUE 'N'.    01210099
               88  PS-FIRST-COMMIT                        VALUE 'Y'.    01220099
           05  PS-DEADLOCK-RESTART-SW       PIC X         VALUE 'N'.    01230099
               88  PS-PROGRAM-DEADLOCKED                  VALUE 'Y'.    01240099
           05  PS-PROCESSING-OPTIONS        PIC X         VALUE 'P'.    01250099
               88  PS-UPDATE-MLT00004-ROW                 VALUE 'U'.    01260099
               88  PS-UPDATE-WKSHNK-ROW                   VALUE 'U'.    01270099
               88  PS-INSERT-MLT00004-ROW                 VALUE 'I'.    01280099
               88  PS-INSERT-WKSHNK-ROW                   VALUE 'I'.    01290099
           05  PS-END-OF-LEDGER-DATE-FILE-SW   PIC X      VALUE 'N'.    01300099
               88 PS-END-OF-LEDGER-DATE-FILE              VALUE 'Y'.    01310099
           05  PS-END-OF-PARTN-CSR-SW          PIC X      VALUE 'N'.    01320099
               88 PS-END-OF-PARTN-CSR                     VALUE 'Y'.    01330099
           05  PS-END-OF-DEPT-CSR-SW           PIC X      VALUE 'N'.    01340099
               88 PS-END-OF-DEPT-CSR                      VALUE 'Y'.    01350099
      *                                                                 01360099
      *                                                                 01370099
       01  PROGRAM-VARIABLES.                                           01380099
           05  PV-DEADLOCK-COUNT               PIC S9(04) VALUE +0.     01390099
           05  PV-PARAGRAPH-NAME               PIC  X(30) VALUE SPACES. 01400099
           05  PV-ABEND-MESSAGE                PIC  X(75) VALUE SPACES. 01410099
           05  PV-OPERATION-ATTEMPTED          PIC  X(50) VALUE SPACES. 01420099
           05  PV-CURRENT-TIMESTAMP            PIC  X(26) VALUE SPACES. 01430099
           05  PV-COMMIT-TIMESTAMP             PIC  X(26) VALUE SPACES. 01440099
           05  PV-SQLCODE-DISPLAY              PIC  ++++9 VALUE ZERO.   01450099
           05  PV-MN-END-FSCL-WK-NBR           PIC  X(10) VALUE SPACES. 01460099
           05  PV-MN-BEG-FSCL-WK-NBR           PIC  X(10) VALUE SPACES. 01470099
           05  PV-FSCL-MN-BEG-DTE              PIC  X(10) VALUE SPACES. 01480099
           05  PV-DEPT-CNT                     PIC S9(04) VALUE +0.     01490099
           05  PV-PARTN-CNT                    PIC S9(04) VALUE +0.     01500099
           05  PV-DEPT-MAX                     PIC S9(04) VALUE +0.     01510099
           05  PV-DB2-TEST                     PIC S9(04) VALUE ZEROES  01520099
                                                      COMP.             01530099
           05  PV-EXTRACT-DTE                  PIC  X(10) VALUE SPACES. 01540099
           05  PV-FSCL-END-DTE                 PIC  X(10) VALUE SPACES. 01550099
           05  PV-FSCL-MN-END-DTE              PIC  X(10) VALUE SPACES. 01560099
                                                                        01561099
           05  PV-MAJ-CL-NBR-WORK.                                      01561199
               10  PV-MAJ-CL-NBR-1             PIC 9(01)   VALUE 0.     01561299
               10  PV-MAJ-CL-NBR-2             PIC 9(01)   VALUE 0.     01561399
                                                                        01561499
           05  PV-MAJ-CL-NBR                   REDEFINES                01561599
               PV-MAJ-CL-NBR-WORK              PIC 9(02).               01561699
                                                                        01561799
      *    05  PV-DEPT-NBR                     PIC X(03).               01561899
           05  PV-DEPT-NBR                     PIC S9(4)V COMP-3        01561999
                                                      VALUE ZEROS.      01562099
      *    05  PV-DEPT-NBR-2                   REDEFINES                01563099
      *        PV-DEPT-NBR                     PIC 9(03).               01563199
                                                                        01563299
           05  PV-SUB-CL-NBR                   PIC X(02).               01563399
           05  PV-SUB-CL-NBR-2                 REDEFINES                01563499
               PV-SUB-CL-NBR                   PIC 9(02).               01563599
           05  PV-PARTN-NBR                    PIC S9(4)V COMP.         01563699
           05  PV-FSCL-DTE                     PIC X(10).               01563799
           05  PV-SAVE-MN-PARTN-NBR            PIC S9(4)  COMP          01563899
                                                      VALUE ZEROS.      01563999
                                                                        01564099
      *                                                                 01565099
       01  DEPT-TBL.                                                    01566099
           05  TBL-DEPT-NBRS   OCCURS  1000.                            01567099
               10  TBL-DEPT                    PIC  X(03) VALUE SPACES. 01568099
      *                                                                 01569099
      *                                                                 01570099
       01  PARTN-TBL.                                                   01580099
           05  TBL-PARTN       OCCURS  9.                               01590099
               10  TBL-PARTN-NBR               PIC  S9(4) COMP VALUE 0. 01600099
      *                                                                 01610099
      *                                                                 01620099
       01  PA-PROGRAM-ACCUMULATORS.                                     01630099
           05  PA-RECORD-COUNTS.                                        01640099
               10  PA-INPUT-COUNT              PIC  9(9)  VALUE ZEROES. 01650099
               10  PA-UPD-MLT00004-COUNT       PIC  9(9)  VALUE ZEROES. 01660099
               10  PA-INS-MLT00004-COUNT       PIC  9(9)  VALUE ZEROES. 01670099
               10  PA-SEL-MLT00004-COUNT       PIC  9(9)  VALUE ZEROES. 01680099
               10  PA-SEL-TDTATTR-COUNT        PIC  9(9)  VALUE ZEROES. 01690099
               10  PA-COMMIT-COUNT             PIC  9(9)  VALUE ZEROES. 01700099
               10  PA-PARTN-REUSE              PIC 9(11)  VALUE ZEROES. 01710099
               10  PA-PARTN-LOOKUP             PIC 9(11)  VALUE ZEROES. 01720099
      *                                                                 01730099
       01  PD-PROGRAM-DISPLAYS.                                         01740099
           05  PD-DEADLOCK-COUNT         PIC  9(04) VALUE 0.            01750099
      *                                                                 01760099
      ************************************************************      01770099
      * PARTITION.                                                      01780099
      ************************************************************      01790099
           COPY MLWS500.                                                01800099
                                                                        01810099
      ******************************************************************01820099
      * MLRD132 - PURCHASE ORDER ON ORDER EXTRACT                       01830099
      ******************************************************************01840099
           COPY MLRD132.                                                01850099
      *                                                                 01860099
      ******************************************************************01870099
      * MLRD135 - FISCAL MONTH END DATE                                 01880099
      ******************************************************************01890099
           COPY MLRD135.                                                01900099
      *                                                                 01910099
      ******************************************************************01920099
      *  DB2 ERROR MESSAGES FORMAT AREA.                                01930099
      ******************************************************************01940099
           COPY DPWS004.                                                01950099
      *                                                                 01960099
      ******************************************************************01970099
      *  USED FOR DB2 ERRORS                                            01980099
      ******************************************************************01990099
           EXEC SQL                                                     02000099
               INCLUDE SQLCA                                            02010099
           END-EXEC.                                                    02020099
      *                                                                 02030099
      ******************************************************************02040099
      *  M/L MONTHLY DAILY DETAIL TABLE                                 02050099
      ******************************************************************02060099
           EXEC SQL                                                     02070099
               INCLUDE MLT00004                                         02080099
           END-EXEC.                                                    02090099
      *                                                                 02100099
      ******************************************************************02110099
      *  M/L DATE ATTRIBUTES TABLE                                      02120099
      ******************************************************************02130099
           EXEC SQL                                                     02140099
               INCLUDE TDTATTR                                          02150099
           END-EXEC.                                                    02160099
      *                                                                 02170099
      ***************************************************************** 02180099
      * DB2 CHECKPOINT RESTART CONTROL TABLE AND RESTART INFO TABLE     02190099
      ***************************************************************** 02200099
           EXEC SQL                                                     02210099
               INCLUDE TCKRSTCN                                         02220099
           END-EXEC.                                                    02230099
      *                                                                 02240099
           EXEC SQL                                                     02250099
               INCLUDE TCKRSTIN                                         02260099
           END-EXEC.                                                    02270099
      *                                                                 02280099
      ******************************************************************02290099
      * CHECKPOINT RESTART VARIABLES AND PREV COMMIT VARIABLES.        *02300099
      ******************************************************************02310099
       01  CR-CHECKPOINT-RESTART-AREA.                                  02320099
J28582*    05  CR-AREA-LEN                  PIC S9(04) VALUE +104 COMP. 02330099
J28582     05  CR-AREA-LEN                  PIC S9(04) VALUE +124 COMP. 02331099
           05  CR-CHECKPOINT-RESTART-VAR.                               02332099
               10  CR-PREV-DTL-KEY          PIC  X(27) VALUE SPACES.    02333099
               10  FILLER REDEFINES CR-PREV-DTL-KEY.                    02334099
                   15  CR-FISCAL-NBR        PIC  X(02).                 02335099
                   15  CR-FISCAL-MN-END-DTE PIC  X(10).                 02336099
                   15  CR-DEPT-NBR          PIC  S9(4)V COMP-3.         02337099
                   15  CR-MAJ-CL-NBR        PIC  S9(4)V COMP-3.         02338099
                   15  CR-SUB-CL-NBR        PIC  S9(4)V COMP-3.         02339099
                   15  CR-LOC-NBR           PIC  S9(4) COMP.            02340099
W28582             15  CR-ML-LWST-ID        PIC  S9(9) COMP.            02350099
W28582***          15  CR-ENT-ID            PIC  S9(9) COMP.            02360099
               10  CR-INPUT-READ-COUNT      PIC  9(09) VALUE ZEROES.    02370099
               10  CR-MLT00004-COMMIT-COUNT PIC 9(09) VALUE ZEROES.     02380099
               10  CR-UPD-MLT00004-COUNT PIC 9(09) VALUE ZEROES.        02390099
               10  CR-INS-MLT00004-COUNT PIC 9(09) VALUE ZEROES.        02400099
               10  CR-SEL-MLT00004-COUNT PIC 9(09) VALUE ZEROES.        02410099
               10  CR-SEL-TDTATTR-COUNT     PIC  9(09) VALUE ZEROES.    02420099
J28582         10  CR-FSCL-MN-BEG-DTE       PIC  X(10).                 02430099
J28582         10  CR-FSCL-END-DTE          PIC  X(10).                 02440099
      *                                                                 02450099
       01  CK-CHECKPOINT-SAVE-AREA.                                     02460099
           05  CK-SAVE-PREV-KEY         PIC  X(27) VALUE SPACES.        02470099
           05  FILLER REDEFINES CK-SAVE-PREV-KEY.                       02480099
               10  CK-FISCAL-NBR        PIC  X(02).                     02490099
               10  CK-FISCAL-MN-END-DTE PIC  X(10).                     02500099
               10  CK-DEPT-NBR          PIC  S9(4)V COMP-3.             02510099
               10  CK-MAJ-CL-NBR        PIC  S9(4)V COMP-3.             02520099
               10  CK-SUB-CL-NBR        PIC  S9(4)V COMP-3.             02530099
               10  CK-LOC-NBR           PIC  S9(4) COMP.                02540099
W28582         10  CK-ENT-ID            PIC  S9(9) COMP.                02550099
W28582***      10  CK-ML-LWST-ID        PIC  S9(9) COMP.                02551099
      *                                                                 02552099
      ****************************************************************  02553099
      *  DEPARTMENT CURSOR FOR MLT_MNLY_SUM TABLE                       02554099
      ****************************************************************  02555099
                                                                        02556099
           EXEC SQL                                                     02557099
               DECLARE DEPT-CSR CURSOR FOR                              02558099
                   SELECT DISTINCT DEPT_NBR                             02559099
                   FROM MLT_MNLY_SUM A                                  02560099
                       ,MLT_PARTN_CNTL B                                02570099
                   WHERE B.FSCL_DTE    BETWEEN :PV-FSCL-MN-BEG-DTE      02580099
                                           AND :ML135-EXTRACT-DTE       02590099
                     AND A.PARTN_NBR = B.PARTN_NBR                      02600099
                     AND B.TBL_TM_LVL_CDE = 'M'                         02610099
                   ORDER BY DEPT_NBR                                    02620099
                   WITH UR                                              02630099
           END-EXEC.                                                    02640099
                                                                        02650099
                                                                        02660099
      *                                                                 02670099
      ****************************************************************  02680099
      *  PARTITION CURSOR                                               02690099
      ****************************************************************  02700099
                                                                        02710099
           EXEC SQL                                                     02720099
               DECLARE PARTN-CSR CURSOR FOR                             02730099
                   SELECT DISTINCT A.PARTN_NBR                          02740099
                                  ,B.FSCL_DTE                           02750099
                   FROM MLT_MNLY_SUM A                                  02760099
                       ,MLT_PARTN_CNTL B                                02770099
                       ,TDTATTR C                                       02771099
                   WHERE C.KY_DTE BETWEEN :PV-FSCL-MN-BEG-DTE           02772099
                                    AND :ML135-EXTRACT-DTE              02773099
                   AND A.PARTN_NBR = B.PARTN_NBR                        02774099
                   AND B.FSCL_DTE = C.KY_DTE                            02775099
                   AND B.TBL_TM_LVL_CDE = 'M'                           02776099
                   WITH UR                                              02777099
           END-EXEC.                                                    02778099
      *                                                                 02779099
      *                                                                 02780099
       LINKAGE SECTION.                                                 02790099
      *                                                                 02800099
      *                                                                 02810099
      *-------------------*                                             02820099
       PROCEDURE DIVISION.                                              02830099
      *-------------------*                                             02840099
                                                                        02850099
       0000-MAIN-MODULE.                                                02860099
                                                                        02870099
           PERFORM 1000-INITIALIZATION.                                 02880099
      *                                                                 02890099
           PERFORM 2000-PROCESS-INPUT                                   02900099
                UNTIL PS-NO-MORE-INPUT-RECORDS.                         02910099
      *                                                                 02920099
           PERFORM 8000-EOJ-ROUTINE.                                    02930099
                                                                        02940099
           STOP RUN.                                                    02950099
      *                                                                 02960099
      *                                                                 02970099
      *                                                                 02980099
      ******************************************************************02990099
      * OPEN INPUT FILE , INITIALIZE COUNTERS AND THE ONORD VALUES IN   03000099
      * THE MLT_MNLY_SUM TABLE, READ FIRST INPUT RECORD PREPARE         03010099
      * CHECKPOINT RESTART TABLES FOR PROCESSING / RESTART              03020099
      ******************************************************************03030099
      *                                                                 03040099
       1000-INITIALIZATION.                                             03050099
      *                                                                 03060099
           OPEN INPUT CONDENSED-FILE                                    03070099
                      LEDGER-EXTRACT-DATE-FILE.                         03080099
      *                                                                 03090099
           PERFORM 7100-INIT-CHECKPOINT-SELECT.                         03100099
      *                                                                 03110099
      * CKPT-STAT-CODE = '9' INDICATES A RESTART CONDITION              03120099
           IF TCKRSTCNTL-CKPT-STAT-CODE = '9'                           03130099
               PERFORM 7200-SELECT-RESTART-INFO                         03140099
               MOVE TCKRSTINF-WORK-STRG-DESC-TEXT TO                    03150099
                                             CR-CHECKPOINT-RESTART-VAR  03160099
               MOVE CR-PREV-DTL-KEY         TO CK-SAVE-PREV-KEY         03170099
      * MOVE RESTART COUNTS TO PA-FIELDS FOR ACCURATE DISPLAY AT EOJ    03180099
               MOVE CR-UPD-MLT00004-COUNT                               03190099
                                         TO PA-UPD-MLT00004-COUNT       03200099
               MOVE CR-INS-MLT00004-COUNT                               03210099
                                         TO PA-INS-MLT00004-COUNT       03220099
               MOVE CR-SEL-MLT00004-COUNT                               03230099
                                         TO PA-SEL-MLT00004-COUNT       03240099
               MOVE CR-SEL-TDTATTR-COUNT                                03250099
                                         TO PA-SEL-TDTATTR-COUNT        03260099
               MOVE CR-MLT00004-COMMIT-COUNT                            03270099
                                         TO PA-COMMIT-COUNT             03280099
J28582         MOVE CR-FSCL-MN-BEG-DTE   TO PV-FSCL-MN-BEG-DTE          03290099
J28582         MOVE CR-FSCL-END-DTE      TO PV-FSCL-END-DTE             03300099
           ELSE                                                         03310099
               PERFORM 4000-READ-LEDGER-EXTRACT-DATE                    03320099
      *                                                                 03330099
               IF PS-END-OF-LEDGER-DATE-FILE                            03340099
                   DISPLAY '** ABEND **'                                03350099
                   DISPLAY '** PROGRAM MLKRP215 **'                     03360099
                   DISPLAY '** PARAGRAPH 1000-INITIALIZATION'           03370099
                   DISPLAY '** LEDGER EXTRACT DATE FILE IS EMPTY.'      03380099
                   MOVE +4003 TO ABEND-CODE                             03390099
                   PERFORM 9999-ABEND                                   03400099
               END-IF                                                   03410099
      *                                                                 03420099
               MOVE ML135-EXTRACT-DTE          TO DTATTR-KY-DTE         03430099
               MOVE ML135-EXTRACT-DTE          TO PV-EXTRACT-DTE        03440099
               MOVE ML135-EXTRACT-DTE          TO PV-FSCL-END-DTE       03450099
      *                                                                 03460099
               PERFORM 6000-GET-DATE-ATTRIBUTES                         03470099
      *                                                                 03480099
               INITIALIZE DEPT-TBL                                      03490099
               PERFORM 1100-BUILD-DEPT-TABLE                            03500099
               INITIALIZE PARTN-TBL                                     03510099
               PERFORM 1400-BUILD-PARTN-TABLE                           03520099
      *                                                                 03530099
      *        THIS IS THE OUTER PROCESSING LOOP THAT PROCESSES         03540099
      *        BY MONTH. WITHIN 1300-INIT-BY-PARTITION, THERE IS A LOWER03550099
      *        LEVEL OF DEPARTMENT THAT IS PROCESSED.                   03560099
               MOVE +1             TO PV-PARTN-CNT                      03570099
               PERFORM 1300-INIT-BY-PARTITION                           03580099
                   UNTIL PV-PARTN-CNT > 8                               03590099
                      OR ML500-WS-PARTN-NBR(PV-PARTN-CNT) = ZEROES      03600099
      *                                                                 03610099
               SET PS-FIRST-COMMIT TO TRUE                              03620099
           END-IF.                                                      03630099
                                                                        03640099
           MOVE PV-EXTRACT-DTE      TO PV-FSCL-MN-END-DTE               03650099
           MOVE PV-FSCL-MN-BEG-DTE  TO ML500-PV-REQ-FSCL-BEG-DTE        03660099
           MOVE PV-FSCL-END-DTE     TO ML500-PV-REQ-FSCL-END-DTE        03661099
                                                                        03661199
           PERFORM ML500-0100-LOAD-PARTN-TABLE                          03661299
           IF ML500-PV-PARAGRAPH-NAME NOT EQUAL TO SPACES               03661399
             MOVE ML500-PV-PARAGRAPH-NAME TO PV-PARAGRAPH-NAME          03661499
             MOVE ML500-PV-OPERATION-ATTEMPTED                          03661599
                                              TO PV-OPERATION-ATTEMPTED 03661699
             PERFORM 9998-SQL-ABEND                                     03661799
           END-IF                                                       03661899
      *                                                                 03661999
           DISPLAY 'COMMITS WILL BE TAKEN EVERY ',                      03662099
                   TCKRSTCNTL-CKPT-FRQNCY-QTY, ' SECONDS.'.             03663099
      *                                                                 03664099
           PERFORM 4100-READ-CONDENSED-FILE UNTIL                       03665099
               PA-INPUT-COUNT > CR-INPUT-READ-COUNT                     03666099
            OR PS-NO-MORE-INPUT-RECORDS.                                03667099
      *                                                                 03668099
           IF TCKRSTCNTL-CKPT-STAT-CODE = '9'                           03669099
               DISPLAY 'FISCAL MONTH NBR      ' ML132-ONORD-FSCL-MN-NBR 03670099
               DISPLAY 'FISCAL MONTH END DATE '                         03680099
                                            ML132-ONORD-FSCL-MN-END-DTE 03690099
               DISPLAY 'DEPARTMENT NBR       ' ML132-ONORD-DEPT-NBR     03700099
               DISPLAY 'SUB CLASS NBR        ' ML132-ONORD-SUB-CL-NBR   03710099
               DISPLAY 'STORE NBR            ' ML132-ONORD-STR-NBR      03720099
W28582         DISPLAY 'ML LWST ID           ' ML132-ONORD-ML-LWST-ID   03730099
W28582***      DISPLAY 'ENT ID               ' ML132-ONORD-ENT-ID       03740099
               DISPLAY 'INPUT RECORD RESTARTED ON RECORD '              03750099
                        PA-INPUT-COUNT                                  03760099
           END-IF.                                                      03770099
                                                                        03780099
           IF PS-NO-MORE-INPUT-RECORDS                                  03790099
               IF TCKRSTCNTL-CKPT-STAT-CODE = '9'                       03800099
                   CONTINUE                                             03810099
               ELSE                                                     03820099
                   DISPLAY '** NO RECORDS ON INPUT FILE **'             03830099
               END-IF                                                   03840099
           ELSE                                                         03850099
               PERFORM 7000-GET-COMMIT-TIMESTAMP                        03860099
           END-IF.                                                      03870099
      *                                                                 03880099
      *                                                                 03890099
      ******************************************************************03900099
      * LOOP THROUGH THE DEPARTMENT CURSOR AND POPULATE DEPT TABLE      03910099
      ******************************************************************03920099
       1100-BUILD-DEPT-TABLE.                                           03930099
      *                                                                 03940099
           PERFORM 6100-OPEN-DEPT-CSR.                                  03950099
      *                                                                 03960099
           PERFORM 6110-FETCH-DEPT-CSR.                                 03970099
      *                                                                 03980099
           PERFORM 1200-INSERT-DEPT-TABLE                               03990099
             UNTIL PS-END-OF-DEPT-CSR.                                  04000099
      *                                                                 04010099
           MOVE PV-DEPT-CNT               TO PV-DEPT-MAX.               04020099
      *                                                                 04030099
           PERFORM 6120-CLOSE-DEPT-CSR.                                 04040099
      *                                                                 04050099
      *                                                                 04060099
      ******************************************************************04070099
      * ADD A DEPARTMENT TO THE TABLE                                   04080099
      ******************************************************************04090099
       1200-INSERT-DEPT-TABLE.                                          04100099
      *                                                                 04110099
           ADD +1                         TO PV-DEPT-CNT.               04120099
           MOVE MLT00004-DEPT-NBR         TO TBL-DEPT(PV-DEPT-CNT).     04130099
      *                                                                 04140099
           PERFORM 6110-FETCH-DEPT-CSR.                                 04150099
      *                                                                 04160099
      *                                                                 04170099
      ******************************************************************04180099
      * THE PROCEDURE PROCESSES BY MONTH, 1310-ZERO-OUT-ONORD-AMTS      04190099
      * PROCESSES BY DEPARTMENT.  THE COMMIT IS DONE BY MONTH.          04200099
      ******************************************************************04210099
       1300-INIT-BY-PARTITION.                                          04220099
      *                                                                 04230099
           MOVE TBL-PARTN-NBR(PV-PARTN-CNT) TO MLT00004-PARTN-NBR.      04240099
                                                                        04250099
           MOVE +1 TO PV-DEPT-CNT.                                      04260099
           PERFORM 1310-ZERO-OUT-ONORD-AMTS                             04270099
               UNTIL PV-DEPT-CNT > PV-DEPT-MAX.                         04280099
                                                                        04290099
           ADD +1  TO PV-PARTN-CNT.                                     04300099
           PERFORM 7510-COMMIT.                                         04310099
      *                                                                 04320099
      *                                                                 04330099
      *                                                                 04340099
      ******************************************************************04350099
      * ZERO OUT THE MLT_MNLY_SUM FOR ONE DEPARTMENT FOR THE FISCAL MTH 04360099
      ******************************************************************04370099
       1310-ZERO-OUT-ONORD-AMTS.                                        04380099
                                                                        04390099
           MOVE ML500-WS-DEPT-NBR(PV-DEPT-CNT) TO MLT00004-DEPT-NBR.    04400099
           PERFORM 6300-INITIALIZE-ONORD.                               04410099
           PERFORM 7510-COMMIT.                                         04420099
           ADD +1 TO PV-DEPT-CNT.                                       04430099
      *                                                                 04440099
      *                                                                 04450099
      ******************************************************************04460099
      * LOOP THROUGH THE PARTITION CURSOR AND POPULATE                  04470099
      * THE PARTN TABLE                                                 04480099
      ******************************************************************04490099
       1400-BUILD-PARTN-TABLE.                                          04500099
      *                                                                 04510099
           PERFORM 6200-OPEN-PARTN-CSR.                                 04520099
      *                                                                 04530099
           PERFORM 6210-FETCH-PARTN-CSR.                                04540099
      *                                                                 04550099
           PERFORM 1500-INSERT-PARTN-TABLE                              04560099
             UNTIL PS-END-OF-PARTN-CSR                                  04570099
      *                                                                 04580099
           PERFORM 6220-CLOSE-PARTN-CSR.                                04590099
      *                                                                 04600099
      *                                                                 04610099
      ******************************************************************04620099
      * ADD A DEPARTMENT TO THE TABLE                                   04630099
      ******************************************************************04640099
       1500-INSERT-PARTN-TABLE.                                         04650099
      *                                                                 04660099
           ADD +1                      TO PV-PARTN-CNT.                 04670099
           MOVE PV-PARTN-NBR           TO TBL-PARTN-NBR(PV-PARTN-CNT).  04680099
      *                                                                 04690099
           PERFORM 6210-FETCH-PARTN-CSR.                                04700099
      *                                                                 04710099
      *                                                                 04720099
      ******************************************************************04730099
      * PROCESS THE SORTED/CONDENSED FILE - UPDATE OR INSERT AS NEEDED  04740099
      ******************************************************************04750099
       2000-PROCESS-INPUT.                                              04760099
      *                                                                 04770099
           MOVE 'N' TO PS-DEADLOCK-RESTART-SW.                          04780099
      *                                                                 04790099
           MOVE ML132-ONORD-FSCL-MN-END-DTE TO MLT00004-FSCL-MN-END-DTE.04800099
           MOVE ML132-ONORD-FSCL-MN-END-DTE TO ML500-PV-FSCL-END-DTE.   04810099
           MOVE ML132-ONORD-DEPT-NBR        TO PV-DEPT-NBR              04820099
                                               MLT00004-DEPT-NBR.       04830099
           MOVE ML132-ONORD-SUB-CL-NBR      TO PV-SUB-CL-NBR-2.         04840099
           MOVE PV-SUB-CL-NBR-2             TO MLT00004-SUB-CL-NBR.     04850099
           MOVE ML132-ONORD-STR-NBR         TO MLT00004-LOC-NBR.        04860099
W28582     MOVE ML132-ONORD-ML-LWST-ID    TO MLT00004-ML-LO-MDSE-LVL-ID.04870099
W28582***  MOVE ML132-ONORD-ENT-ID          TO MLT00004-ENT-ID.         04880099
                                                                        04890099
      * DERIVE MAJOR CLASS NUMBER FROM SUB CLASS NUMBER                 04900099
           MOVE ML132-ONORD-SUB-CL-NBR      TO PV-MAJ-CL-NBR-WORK.      04910099
           MOVE 0                           TO PV-MAJ-CL-NBR-2.         04920099
           MOVE PV-MAJ-CL-NBR               TO MLT00004-MAJ-CL-NBR.     04930099
                                                                        04940099
           PERFORM 7800-FIND-BOTH-PARTN.                                04950099
                                                                        04951099
           PERFORM 6500-SELECT-MLT00004-ROW.                            04952099
      *                                                                 04953099
           IF PS-PROGRAM-DEADLOCKED                                     04954099
               CONTINUE                                                 04955099
           ELSE                                                         04956099
               EVALUATE TRUE                                            04957099
                   WHEN PS-UPDATE-MLT00004-ROW                          04958099
                       PERFORM 6600-UPDATE-MLT00004-ROW                 04959099
                   WHEN PS-INSERT-MLT00004-ROW                          04960099
                       PERFORM 6700-INSERT-MLT00004-ROW                 04970099
               END-EVALUATE                                             04980099
           END-IF.                                                      04990099
      *                                                                 05000099
           IF PS-PROGRAM-DEADLOCKED                                     05010099
               CONTINUE                                                 05020099
           ELSE                                                         05030099
               PERFORM 7400-COMMIT-PROCESSING                           05040099
               PERFORM 4100-READ-CONDENSED-FILE                         05050099
           END-IF.                                                      05060099
      *                                                                 05070099
      ******************************************************************05080099
      * READ THE DATE FILE                                              05090099
      ******************************************************************05100099
       4000-READ-LEDGER-EXTRACT-DATE.                                   05110099
           READ LEDGER-EXTRACT-DATE-FILE                                05120099
              INTO ML135-LEDGER-EXTRACT-DATE-REC                        05130099
               AT END SET PS-END-OF-LEDGER-DATE-FILE TO TRUE.           05140099
      *                                                                 05150099
      ******************************************************************05160099
      * READS THE CONDENSED FILE INTO THE MLT_MNLY_SUM LAYOUT           05170099
      ******************************************************************05180099
       4100-READ-CONDENSED-FILE.                                        05190099
           READ CONDENSED-FILE INTO ML132-ONORD-EXTRACT-WK-REC          05200099
               AT END MOVE 'Y' TO PS-INPUT-FILE-EOF-SW.                 05210099
      *                                                                 05220099
           IF PS-NO-MORE-INPUT-RECORDS                                  05230099
               MOVE ML132-ONORD-FSCL-MN-NBR     TO CR-FISCAL-NBR        05240099
               MOVE ML132-ONORD-FSCL-MN-END-DTE TO CR-FISCAL-MN-END-DTE 05250099
               MOVE ML132-ONORD-DEPT-NBR        TO CR-DEPT-NBR          05260099
               MOVE ML132-ONORD-SUB-CL-NBR      TO CR-SUB-CL-NBR        05270099
               MOVE ML132-ONORD-STR-NBR         TO CR-LOC-NBR           05280099
W28582         MOVE ML132-ONORD-ML-LWST-ID      TO CR-ML-LWST-ID        05290099
W28582***      MOVE ML132-ONORD-ENT-ID          TO CR-ENT-ID            05300099
               MOVE PA-INPUT-COUNT              TO CR-INPUT-READ-COUNT  05310099
J28582         MOVE PV-FSCL-MN-BEG-DTE          TO CR-FSCL-MN-BEG-DTE   05320099
J28582         MOVE PV-FSCL-END-DTE             TO CR-FSCL-END-DTE      05330099
      *        MOVE COMMIT INFO TO WORKING STORAGE ROW                  05340099
               MOVE CR-CHECKPOINT-RESTART-AREA  TO                      05350099
                                             TCKRSTINF-WORK-STRG-DESC   05360099
               EXEC SQL                                                 05370099
                 UPDATE TCKRSTINF                                       05380099
                    SET WORK_STRG_DESC = :TCKRSTINF-WORK-STRG-DESC      05390099
                  WHERE JOB_NAME   = :PC-JOB-NAME                       05400099
                    AND PLAN_NAME  = :PC-PROGRAM-NAME                   05410099
               END-EXEC                                                 05420099
               IF SQLCODE = 0                                           05430099
                   CONTINUE                                             05440099
               ELSE                                                     05450099
                   MOVE PE-MSG-05            TO PV-OPERATION-ATTEMPTED  05460099
                   MOVE '* 4100-READ-CONDENSED-FILE *' TO               05470099
                        PV-PARAGRAPH-NAME                               05480099
                   PERFORM 9998-SQL-ABEND                               05490099
               END-IF                                                   05500099
           ELSE                                                         05510099
               ADD 1                         TO PA-INPUT-COUNT          05520099
                                                PC-UPDATE-CNT           05530099
               IF PC-UPDATE-CNT > 100000                                05540099
                    ADD 1                    TO PC-DISPLAY-CNT          05550099
                    DISPLAY 'UPDATE COUNT: ' PC-DISPLAY-CNT             05560099
                    MOVE +0                  TO PC-UPDATE-CNT           05570099
               END-IF                                                   05580099
           END-IF.                                                      05590099
      *                                                                 05600099
      ******************************************************************05610099
      * GET DATE ATTRIBUTES                                             05620099
      ******************************************************************05630099
       6000-GET-DATE-ATTRIBUTES.                                        05640099
      *                                                                 05650099
           EXEC SQL                                                     05660099
               SELECT                                                   05670099
                     A.FSCL_MN_BEG_DTE                                  05680099
                    ,A.FSCL_MN_NBR                                      05690099
                    ,B.FSCL_MN_NBR                                      05700099
               INTO :PV-FSCL-MN-BEG-DTE                                 05710099
                   ,:PV-MN-END-FSCL-WK-NBR                              05720099
                   ,:PV-MN-BEG-FSCL-WK-NBR                              05730099
               FROM TDTATTR A                                           05740099
                   ,TDTATTR B                                           05750099
               WHERE A.KY_DTE          =:ML135-EXTRACT-DTE              05760099
                 AND A.FSCL_MN_BEG_DTE = B.KY_DTE                       05770099
               WITH UR                                                  05780099
           END-EXEC.                                                    05790099
      *                                                                 05800099
           EVALUATE SQLCODE                                             05810099
               WHEN 0                                                   05820099
                   CONTINUE                                             05830099
               WHEN OTHER                                               05840099
                   DISPLAY 'DTATTR-KY-DTE: ' DTATTR-KY-DTE              05850099
                   MOVE    '6000-GET-DATE-ATTRIBUTES'                   05860099
                                              TO PV-PARAGRAPH-NAME      05870099
                   MOVE PE-MSG-13             TO PV-OPERATION-ATTEMPTED 05880099
                   PERFORM 9998-SQL-ABEND                               05890099
           END-EVALUATE.                                                05900099
      *                                                                 05910099
      ******************************************************************05920099
       6100-OPEN-DEPT-CSR.                                              05930099
      *                                                                 05940099
           EXEC SQL                                                     05950099
                OPEN DEPT-CSR                                           05960099
           END-EXEC.                                                    05970099
      *                                                                 05980099
           EVALUATE SQLCODE                                             05990099
               WHEN 0                                                   06000099
                   CONTINUE                                             06010099
               WHEN OTHER                                               06020099
                   MOVE '6100-OPEN-DEPT-CSR'                            06030099
                                            TO PV-PARAGRAPH-NAME        06040099
                   MOVE PE-MSG-14           TO PV-OPERATION-ATTEMPTED   06050099
                   PERFORM 9998-SQL-ABEND                               06060099
           END-EVALUATE.                                                06070099
      *                                                                 06080099
      *                                                                 06090099
       6110-FETCH-DEPT-CSR.                                             06100099
      *                                                                 06110099
            EXEC SQL                                                    06120099
                FETCH                                                   06130099
                    DEPT-CSR                                            06140099
                INTO                                                    06150099
                   :MLT00004-DEPT-NBR                                   06160099
            END-EXEC.                                                   06170099
      *                                                                 06180099
      *                                                                 06190099
            EVALUATE SQLCODE                                            06200099
               WHEN 0                                                   06210099
                   CONTINUE                                             06220099
               WHEN +100                                                06230099
                   SET PS-END-OF-DEPT-CSR TO TRUE                       06240099
               WHEN OTHER                                               06250099
                   MOVE '6110-FETCH-DEPT-CSR'                           06260099
                                               TO PV-PARAGRAPH-NAME     06270099
                   MOVE PE-MSG-15              TO PV-OPERATION-ATTEMPTED06280099
                   PERFORM 9998-SQL-ABEND                               06290099
            END-EVALUATE.                                               06300099
      *                                                                 06310099
      *                                                                 06320099
       6120-CLOSE-DEPT-CSR.                                             06330099
      *                                                                 06340099
           EXEC SQL                                                     06350099
               CLOSE DEPT-CSR                                           06360099
           END-EXEC.                                                    06370099
      *                                                                 06380099
           EVALUATE SQLCODE                                             06390099
               WHEN 0                                                   06400099
                   CONTINUE                                             06410099
               WHEN OTHER                                               06420099
                   MOVE '6120-CLOSE-DEPT-CSR'                           06430099
                                              TO PV-PARAGRAPH-NAME      06440099
                   MOVE PE-MSG-16             TO PV-OPERATION-ATTEMPTED 06450099
                   PERFORM 9998-SQL-ABEND                               06460099
           END-EVALUATE.                                                06470099
      *                                                                 06480099
      *                                                                 06490099
      ******************************************************************06500099
       6200-OPEN-PARTN-CSR.                                             06510099
      *                                                                 06520099
           EXEC SQL                                                     06530099
                OPEN PARTN-CSR                                          06540099
           END-EXEC.                                                    06550099
      *                                                                 06560099
           EVALUATE SQLCODE                                             06570099
               WHEN 0                                                   06580099
                   CONTINUE                                             06590099
               WHEN OTHER                                               06600099
                   MOVE '6200-OPEN-PARTN-CSR'                           06610099
                                            TO PV-PARAGRAPH-NAME        06620099
                   MOVE PE-MSG-14           TO PV-OPERATION-ATTEMPTED   06630099
                   PERFORM 9998-SQL-ABEND                               06640099
           END-EVALUATE.                                                06650099
      *                                                                 06660099
      *                                                                 06670099
       6210-FETCH-PARTN-CSR.                                            06680099
      *                                                                 06690099
            EXEC SQL                                                    06700099
                FETCH                                                   06710099
                    PARTN-CSR                                           06720099
                INTO                                                    06730099
                   :PV-PARTN-NBR                                        06740099
            END-EXEC.                                                   06750099
      *                                                                 06760099
      *                                                                 06770099
            EVALUATE SQLCODE                                            06780099
               WHEN 0                                                   06790099
                   CONTINUE                                             06800099
               WHEN +100                                                06810099
                   SET PS-END-OF-PARTN-CSR TO TRUE                      06820099
               WHEN OTHER                                               06830099
                   MOVE '6200-OPEN-PARTN-CSR'                           06840099
                                               TO PV-PARAGRAPH-NAME     06850099
                   MOVE PE-MSG-15              TO PV-OPERATION-ATTEMPTED06860099
                   PERFORM 9998-SQL-ABEND                               06870099
            END-EVALUATE.                                               06880099
      *                                                                 06890099
      *                                                                 06900099
       6220-CLOSE-PARTN-CSR.                                            06910099
      *                                                                 06920099
           EXEC SQL                                                     06930099
               CLOSE PARTN-CSR                                          06940099
           END-EXEC.                                                    06950099
      *                                                                 06960099
           EVALUATE SQLCODE                                             06970099
               WHEN 0                                                   06980099
                   CONTINUE                                             06990099
               WHEN OTHER                                               07000099
                   MOVE '6220-CLOSE-PARTN-CSR'                          07010099
                                              TO PV-PARAGRAPH-NAME      07020099
                   MOVE PE-MSG-16             TO PV-OPERATION-ATTEMPTED 07030099
                   PERFORM 9998-SQL-ABEND                               07040099
           END-EVALUATE.                                                07050099
      *                                                                 07060099
      *                                                                 07070099
      ******************************************************************07080099
      * SET ALL ONORDER AMOUNTS TO ZERO FOR THE FISCAL MONTH            07090099
      ******************************************************************07100099
       6300-INITIALIZE-ONORD.                                           07110099
      *                                                                 07120099
      *                                                                 07130099
           EXEC SQL                                                     07140099
               UPDATE MLT_MNLY_SUM                                      07150099
                 SET ONORD_RTL_AMT       = 0                            07160099
                    ,ONORD_COST_AMT      = 0                            07170099
               WHERE PARTN_NBR           = :MLT00004-PARTN-NBR          07180099
                 AND DEPT_NBR            = :MLT00004-DEPT-NBR           07190099
           END-EXEC.                                                    07200099
      *                                                                 07210099
           EVALUATE SQLCODE                                             07220099
               WHEN 0                                                   07230099
                   CONTINUE                                             07240099
               WHEN +100                                                07250099
                   CONTINUE                                             07260099
               WHEN OTHER                                               07270099
                   MOVE PE-MSG-12           TO PV-OPERATION-ATTEMPTED   07280099
                   MOVE  '6300-INITIALIZE-ONORD'                        07290099
                                            TO PV-PARAGRAPH-NAME        07300099
                   PERFORM 9998-SQL-ABEND                               07310099
           END-EVALUATE.                                                07320099
      *                                                                 07330099
      *                                                                 07340099
      ******************************************************************07350099
      * EXISTENCE CK FROM THE MONTHLY DETAIL TABLE THAT MATCHES INPUT   07360099
      *   KEY SQLCODE FROM 'SELECT' IS EVALUATED IN 2000-PROCESS-INPUT  07370099
      ******************************************************************07380099
       6500-SELECT-MLT00004-ROW.                                        07390099
      *                                                                 07400099
           EXEC SQL                                                     07410099
               SELECT 1                                                 07420099
                 INTO :PV-DB2-TEST                                      07430099
               FROM MLT_MNLY_SUM                                        07440099
               WHERE  PARTN_NBR        = :MLT00004-PARTN-NBR            07450099
                 AND  DEPT_NBR         = :MLT00004-DEPT-NBR             07460099
                 AND  MAJ_CL_NBR       = :MLT00004-MAJ-CL-NBR           07470099
                 AND  SUB_CL_NBR       = :MLT00004-SUB-CL-NBR           07480099
                 AND  LOC_NBR          = :MLT00004-LOC-NBR              07490099
W28582           AND  ML_LO_MDSE_LVL_ID = :MLT00004-ML-LO-MDSE-LVL-ID   07500099
W28582***        AND  ENT_ID           = :MLT00004-ENT-ID               07510099
               FETCH FIRST ROW ONLY                                     07520099
           END-EXEC.                                                    07530099
      *                                                                 07540099
           EVALUATE SQLCODE                                             07550099
               WHEN 0                                                   07560099
                   MOVE ZERO                   TO PV-DEADLOCK-COUNT     07570099
                   SET PS-UPDATE-MLT00004-ROW  TO TRUE                  07580099
                   ADD +1               TO PA-SEL-MLT00004-COUNT        07590099
               WHEN +100                                                07600099
                   MOVE ZERO                   TO PV-DEADLOCK-COUNT     07610099
                   SET PS-INSERT-MLT00004-ROW  TO TRUE                  07620099
               WHEN -911                                                07630099
                   ADD +1             TO PV-DEADLOCK-COUNT              07640099
                   DISPLAY 'DEADLOCK -911 IN 6500-SELECT-MLT00004-ROW'  07650099
                   IF PV-DEADLOCK-COUNT > PC-MAX-DEADLOCKS              07660099
                       MOVE '6500-SELECT-MLT00004-ROW'                  07670099
                                                 TO PV-PARAGRAPH-NAME   07680099
                       PERFORM 9000-DEADLOCK-ERROR                      07690099
                   ELSE                                                 07700099
                       PERFORM 7999-RESTART-PROCESS                     07710099
                   END-IF                                               07720099
               WHEN OTHER                                               07730099
                   MOVE '6500-SELECT-MLT00004-ROW' TO PV-PARAGRAPH-NAME 07740099
                   MOVE PE-MSG-01 TO PV-OPERATION-ATTEMPTED             07750099
                   PERFORM 9998-SQL-ABEND                               07760099
           END-EVALUATE.                                                07770099
      *                                                                 07780099
      *                                                                 07790099
      ***************************************************************** 07800099
      * THE INPUT RECORD FOUND A MATCHING ROW BASED ON FSCL INFO, DEPT, 07810099
      * MAJ CLASS, SUB CLASS, LOC NUMBER, AND ENT ID.  CURRENT TABLE    07820099
      * VALUES ARE UPDATED TO INCLUDE VALUES FROM THE INPUT RECORD.     07830099
      ***************************************************************** 07840099
       6600-UPDATE-MLT00004-ROW.                                        07850099
      *                                                                 07860099
           MOVE ML132-EXT-RTL-AMT        TO MLT00004-ONORD-RTL-AMT.     07870099
           MOVE ML132-EXT-CST-AMT        TO MLT00004-ONORD-COST-AMT.    07880099
      *                                                                 07890099
           EXEC SQL                                                     07900099
              UPDATE MLT_MNLY_SUM                                       07910099
                   SET ONORD_RTL_AMT     = :MLT00004-ONORD-RTL-AMT      07920099
                     , ONORD_COST_AMT    = :MLT00004-ONORD-COST-AMT     07930099
              WHERE   PARTN_NBR          = :MLT00004-PARTN-NBR          07940099
                AND   DEPT_NBR           = :MLT00004-DEPT-NBR           07950099
                AND   MAJ_CL_NBR         = :MLT00004-MAJ-CL-NBR         07960099
                AND   SUB_CL_NBR         = :MLT00004-SUB-CL-NBR         07970099
                AND   LOC_NBR            = :MLT00004-LOC-NBR            07980099
W28582          AND   ML_LO_MDSE_LVL_ID  = :MLT00004-ML-LO-MDSE-LVL-ID  07990099
W28582***       AND   ENT_ID             = :MLT00004-ENT-ID             08000099
           END-EXEC.                                                    08010099
      *                                                                 08020099
           EVALUATE SQLCODE                                             08030099
               WHEN 0                                                   08040099
                   MOVE ZERO          TO PV-DEADLOCK-COUNT              08050099
                   ADD 1              TO PA-UPD-MLT00004-COUNT          08060099
               WHEN -911                                                08070099
                   ADD +1             TO PV-DEADLOCK-COUNT              08080099
                   DISPLAY 'DEADLOCK -911 IN 6600-UPDATE-MLT00004-ROW'  08090099
                   IF PV-DEADLOCK-COUNT > PC-MAX-DEADLOCKS              08100099
                       MOVE '6600-UPDATE-MLT00004-ROW'                  08110099
                                      TO PV-PARAGRAPH-NAME              08120099
                       PERFORM 9000-DEADLOCK-ERROR                      08130099
                   ELSE                                                 08140099
                       PERFORM 7999-RESTART-PROCESS                     08150099
                   END-IF                                               08160099
               WHEN OTHER                                               08170099
                   MOVE '6600-UPDATE-MLT00004-ROW'                      08180099
                                      TO PV-PARAGRAPH-NAME              08190099
                   MOVE PE-MSG-02     TO PV-OPERATION-ATTEMPTED         08200099
                   PERFORM 9998-SQL-ABEND                               08210099
           END-EVALUATE.                                                08220099
      *                                                                 08230099
      *                                                                 08240099
      ***************************************************************** 08250099
      * THERE WAS NO MATCHING ROW ON THE MONTHLY DETAIL TABLE.        * 08260099
      * - ENTRY FOR THIS ENTITY IS INSERTED AS A 'NEW' ROW            * 08270099
      ***************************************************************** 08280099
       6700-INSERT-MLT00004-ROW.                                        08290099
      *                                                                 08300099
           MOVE ML132-EXT-RTL-AMT        TO MLT00004-ONORD-RTL-AMT.     08310099
           MOVE ML132-EXT-CST-AMT        TO MLT00004-ONORD-COST-AMT.    08311099
      *                                                                 08312099
           EXEC SQL                                                     08313099
               INSERT INTO MLT_MNLY_SUM                                 08314099
                   (   PARTN_NBR                                        08315099
                     , DEPT_NBR                                         08316099
                     , MAJ_CL_NBR                                       08317099
                     , SUB_CL_NBR                                       08318099
                     , LOC_NBR                                          08319099
W28582               , ML_LO_MDSE_LVL_ID                                08320099
W28582***            , ENT_ID                                           08330099
                     , FSCL_MN_END_DTE                                  08340099
                     , SLS_REG_RTL_AMT                                  08350099
                     , SLS_PROMO_RTL_AMT                                08360099
                     , SLS_PROCLR_RTL_AMT                               08370099
                     , SLS_CLR_RTL_AMT                                  08380099
                     , SLS_OTH_RTL_AMT                                  08390099
                     , MKDN_PLU_RTL_AMT                                 08400099
                     , MKDN_PROMO_RTL_AMT                               08401099
                     , MKDN_RGST_RTL_AMT                                08402099
                     , MKDN_GLDST_RTL_AMT                               08403099
                     , MKDN_UMTCH_RTL_AMT                               08404099
                     , MKDN_BYR_RTL_AMT                                 08405099
                     , MKDN_STR_RTL_AMT                                 08406099
                     , MKDN_PRPT_RTL_AMT                                08407099
                     , MKDN_OTH_RTL_AMT                                 08408099
                     , MKDN_RTL_AMT                                     08409099
                     , MKUP_RTL_AMT                                     08410099
                     , XFER_IN_RTL_AMT                                  08420099
                     , XFER_OUT_RTL_AMT                                 08430099
                     , RCPT_RTL_AMT                                     08440099
                     , RCPT_NET_COST_AMT                                08450099
                     , RCPT_GRO_COST_AMT                                08460099
                     , PADJ_RTL_AMT                                     08470099
                     , PADJ_FRGT_COST_AMT                               08471099
                     , PADJ_DISC_COST_AMT                               08472099
                     , PADJ_RTV_COST_AMT                                08473099
                     , PADJ_RTV_RTL_AMT                                 08473199
                     , PADJ_DA_COST_AMT                                 08473299
                     , PADJ_DA_RTL_AMT                                  08473399
                     , PADJ_NET_COST_AMT                                08473499
                     , PADJ_OTH_COST_AMT                                08473599
                     , PADJ_OTH_RTL_AMT                                 08473699
                     , DR_ALW_RTL_AMT                                   08473799
                     , RTV_RTL_AMT                                      08473899
                     , MKUP_INIT_AMT                                    08473999
                     , MKUP_NET_AMT                                     08474099
                     , INV_ADJ_RTL_AMT                                  08475099
                     , ONORD_RTL_AMT                                    08476099
                     , ONORD_COST_AMT                                   08477099
                     , SHNK_RTL_AMT                                     08478099
B28582               , END_INV_RTL_AMT                                  08479099
B28582               , INV_COST_ADJ1_AMT                                08480099
B28582               , INV_COST_ADJ2_AMT                                08490099
B28582               , END_INV_COST1_AMT                                08500099
B28582               , END_INV_COST2_AMT                                08510099
B28582               , ADJ_GRO_MRGN_AMT)                                08511099
               VALUES                                                   08512099
                   (   :MLT00004-PARTN-NBR                              08513099
                     , :MLT00004-DEPT-NBR                               08514099
                     , :MLT00004-MAJ-CL-NBR                             08515099
                     , :MLT00004-SUB-CL-NBR                             08516099
                     , :MLT00004-LOC-NBR                                08517099
W28582               , :MLT00004-ML-LO-MDSE-LVL-ID                      08518099
W28582***            , :MLT00004-ENT-ID                                 08519099
                     , :MLT00004-FSCL-MN-END-DTE                        08520099
                     , 0                                                08530099
                     , 0                                                08540099
                     , 0                                                08550099
                     , 0                                                08560099
                     , 0                                                08570099
                     , 0                                                08580099
                     , 0                                                08590099
                     , 0                                                08600099
                     , 0                                                08610099
                     , 0                                                08620099
                     , 0                                                08630099
                     , 0                                                08640099
                     , 0                                                08650099
                     , 0                                                08660099
                     , 0                                                08670099
                     , 0                                                08671099
                     , 0                                                08672099
                     , 0                                                08673099
                     , 0                                                08674099
                     , 0                                                08675099
                     , 0                                                08676099
                     , 0                                                08677099
                     , 0                                                08678099
                     , 0                                                08679099
                     , 0                                                08679199
                     , 0                                                08679299
                     , 0                                                08679399
                     , 0                                                08679499
                     , 0                                                08679599
                     , 0                                                08679699
                     , 0                                                08679799
                     , 0                                                08679899
                     , 0                                                08679999
                     , 0                                                08680099
                     , 0                                                08680199
                     , 0                                                08680299
                     , :MLT00004-ONORD-RTL-AMT                          08680399
                     , :MLT00004-ONORD-COST-AMT                         08680499
                     , 0                                                08680599
B28582               , 0                                                08680699
B28582               , 0                                                08680799
B28582               , 0                                                08680899
B28582               , 0                                                08680999
B28582               , 0                                                08681099
B28582               , 0                      )                         08682099
           END-EXEC.                                                    08683099
      *                                                                 08684099
           EVALUATE SQLCODE                                             08685099
               WHEN 0                                                   08686099
                   MOVE ZERO          TO PV-DEADLOCK-COUNT              08687099
                   ADD 1              TO PA-INS-MLT00004-COUNT          08688099
               WHEN -911                                                08689099
                   ADD +1             TO PV-DEADLOCK-COUNT              08690099
                   DISPLAY 'DEADLOCK -911 IN 6700-INSERT-MLT00004-ROW'  08700099
                   IF PV-DEADLOCK-COUNT > PC-MAX-DEADLOCKS              08710099
                       MOVE '6700-INSERT-MLT00004-ROW' TO               08720099
                                                    PV-PARAGRAPH-NAME   08730099
                       PERFORM 9000-DEADLOCK-ERROR                      08740099
                   ELSE                                                 08750099
                       PERFORM 7999-RESTART-PROCESS                     08760099
                   END-IF                                               08770099
               WHEN OTHER                                               08780099
                   MOVE '6700-INSERT-MLT00004-ROW' TO PV-PARAGRAPH-NAME 08790099
                   MOVE PE-MSG-03              TO PV-OPERATION-ATTEMPTED08800099
                   PERFORM 9998-SQL-ABEND                               08810099
           END-EVALUATE.                                                08820099
      *                                                                 08830099
      *                                                                 08840099
      ******************************************************************08850099
      * 7000-GET-COMMIT-TIMESTAMP.                                     *08860099
      * PROCESSES: GET THE COMMIT TIMESTAMP FROM THE CHECKPOINT        *08870099
      *            CONTROL TABLE                                       *08880099
      ******************************************************************08890099
       7000-GET-COMMIT-TIMESTAMP.                                       08900099
                                                                        08910099
           EXEC SQL                                                     08920099
      * CHECKPOINT TAKEN BASED ON CHEKPOINT RESTART CICSP1 PANEL        08930099
             SELECT (CURRENT TIMESTAMP + CKPT_FRQNCY_QTY SECONDS)       08940099
               INTO :PV-COMMIT-TIMESTAMP                                08950099
               FROM TCKRSTCNTL                                          08960099
              WHERE JOB_NAME  = :PC-JOB-NAME                            08970099
                AND PLAN_NAME = :PC-PROGRAM-NAME                        08980099
           END-EXEC.                                                    08990099
                                                                        09000099
           IF SQLCODE = 0                                               09010099
               CONTINUE                                                 09020099
           ELSE                                                         09030099
               MOVE '7000-GET-COMMIT-TIMESTAMP' TO PV-PARAGRAPH-NAME    09040099
               MOVE PE-MSG-11             TO PV-OPERATION-ATTEMPTED     09050099
               PERFORM 9998-SQL-ABEND                                   09060099
           END-IF.                                                      09070099
      *                                                                 09080099
      *                                                                 09090099
      ******************************************************************09100099
      * 7100-INIT-CHECKPOINT-SELECT                                    *09110099
      * PROCESSES: SELECTS FROM THE CHECKPOINT RESTART CONTROL TABLE   *09120099
      *            IF WE ARE IN A RESTART CONDITION.                   *09130099
      ******************************************************************09140099
       7100-INIT-CHECKPOINT-SELECT.                                     09150099
                                                                        09160099
           EXEC SQL                                                     09170099
             SELECT  CKPT_STAT_CODE                                     09180099
                    ,CKPT_FRQNCY_QTY                                    09190099
               INTO  :TCKRSTCNTL-CKPT-STAT-CODE                         09200099
                    ,:TCKRSTCNTL-CKPT-FRQNCY-QTY                        09210099
               FROM  TCKRSTCNTL                                         09220099
              WHERE  JOB_NAME  = :PC-JOB-NAME                           09230099
                AND  PLAN_NAME = :PC-PROGRAM-NAME                       09240099
           END-EXEC.                                                    09250099
                                                                        09260099
           IF SQLCODE = 0                                               09270099
               CONTINUE                                                 09280099
           ELSE                                                         09290099
               MOVE '7100-INIT-CHECKPOINT-SELECT' TO PV-PARAGRAPH-NAME  09300099
               MOVE PE-MSG-04             TO PV-OPERATION-ATTEMPTED     09310099
               PERFORM 9998-SQL-ABEND                                   09320099
           END-IF.                                                      09330099
      *                                                                 09340099
      *                                                                 09350099
      ******************************************************************09360099
      * 7200-SELECT-RESTART-INFO                                       *09370099
      * PROCESSES: SELECTS FROM THE CHECKPOINT RESTART INFORMATION     *09380099
      *            TABLE TO OBTAIN THE PROGRAMS SAVED VARIABLES.       *09390099
      ******************************************************************09400099
       7200-SELECT-RESTART-INFO.                                        09410099
                                                                        09420099
           EXEC SQL                                                     09430099
             SELECT  WORK_STRG_DESC                                     09440099
               INTO  :TCKRSTINF-WORK-STRG-DESC                          09450099
               FROM  TCKRSTINF                                          09460099
              WHERE  JOB_NAME  = :PC-JOB-NAME                           09470099
                AND  PLAN_NAME = :PC-PROGRAM-NAME                       09480099
           END-EXEC.                                                    09490099
                                                                        09500099
           IF SQLCODE = 0                                               09510099
               CONTINUE                                                 09520099
           ELSE                                                         09530099
               MOVE '*7200-SELECT-RESTART-INFO*' TO PV-PARAGRAPH-NAME   09540099
               PERFORM 9998-SQL-ABEND                                   09550099
           END-IF.                                                      09560099
      *                                                                 09570099
      *                                                                 09580099
      ******************************************************************09590099
      * 7300-SET-CURRENT-TIMESTAMP.                                    *09600099
      * PROCESSES: GET THE CURRENT TIMESTAMP FROM DB2.                 *09610099
      ******************************************************************09620099
       7300-SET-CURRENT-TIMESTAMP.                                      09630099
                                                                        09640099
           EXEC SQL                                                     09650099
                SET :PV-CURRENT-TIMESTAMP = CURRENT TIMESTAMP           09660099
           END-EXEC.                                                    09670099
      *                                                                 09680099
           IF SQLCODE = 0                                               09690099
               CONTINUE                                                 09700099
           ELSE                                                         09710099
               MOVE '*7300-SET-CURRENT-TIMESTAMP*' TO PV-PARAGRAPH-NAME 09720099
               PERFORM 9998-SQL-ABEND                                   09730099
           END-IF.                                                      09740099
      *                                                                 09750099
      *                                                                 09760099
      ******************************************************************09770099
      * 7400-COMMIT-PROCESSING.                                        *09780099
      * PROCESSES: CHECK IF WE NEED TO TAKE A COMMIT.                  *09790099
      *          PREPARE CHECKPOINT RECORD FOR UPDATE OF WORK_STRG_DESC*09800099
      ******************************************************************09810099
       7400-COMMIT-PROCESSING.                                          09820099
           MOVE '*7400-COMMIT-PROCESSING*'    TO PV-PARAGRAPH-NAME.     09830099
                                                                        09840099
           PERFORM 7300-SET-CURRENT-TIMESTAMP.                          09850099
      *                                                                 09860099
           IF PV-CURRENT-TIMESTAMP > PV-COMMIT-TIMESTAMP                09870099
      *        PREPARE COMMIT RECORD FOR UPDATE                         09880099
               ADD 1                          TO PA-COMMIT-COUNT        09890099
               MOVE ML132-ONORD-FSCL-MN-NBR   TO CR-FISCAL-NBR          09900099
               MOVE ML132-ONORD-FSCL-MN-END-DTE TO CR-FISCAL-MN-END-DTE 09910099
               MOVE ML132-ONORD-DEPT-NBR      TO CR-DEPT-NBR            09920099
               MOVE ML132-ONORD-SUB-CL-NBR    TO CR-SUB-CL-NBR          09930099
               MOVE ML132-ONORD-STR-NBR       TO CR-LOC-NBR             09940099
W28582         MOVE ML132-ONORD-ML-LWST-ID    TO CR-ML-LWST-ID          09950099
W28582***      MOVE ML132-ONORD-ENT-ID        TO CR-ENT-ID              09960099
               MOVE PA-COMMIT-COUNT                                     09970099
                                         TO CR-MLT00004-COMMIT-COUNT    09980099
               MOVE PA-INPUT-COUNT                                      09990099
                                         TO CR-INPUT-READ-COUNT         10000099
               MOVE PA-UPD-MLT00004-COUNT                               10010099
                                         TO CR-UPD-MLT00004-COUNT       10020099
               MOVE PA-INS-MLT00004-COUNT                               10030099
                                         TO CR-INS-MLT00004-COUNT       10040099
               MOVE PA-SEL-MLT00004-COUNT                               10050099
                                         TO CR-SEL-MLT00004-COUNT       10060099
               MOVE PA-SEL-TDTATTR-COUNT                                10070099
                                         TO CR-SEL-TDTATTR-COUNT        10080099
J28582         MOVE PV-FSCL-MN-BEG-DTE   TO CR-FSCL-MN-BEG-DTE          10081099
J28582         MOVE PV-FSCL-END-DTE      TO CR-FSCL-END-DTE             10082099
      *        MOVE COMMIT INFO TO WORKING STORAGE ROW                  10083099
               MOVE CR-CHECKPOINT-RESTART-AREA TO                       10084099
                                             TCKRSTINF-WORK-STRG-DESC   10085099
               IF PS-FIRST-COMMIT                                       10086099
                   MOVE '9' TO TCKRSTCNTL-CKPT-STAT-CODE                10087099
                   PERFORM 7600-UPDATE-CHECKPOINT-STATUS                10088099
                   MOVE 'N' TO PS-FIRST-COMMIT-SW                       10089099
               END-IF                                                   10090099
               PERFORM 7500-COMMIT-CHANGES                              10100099
               PERFORM 7000-GET-COMMIT-TIMESTAMP                        10110099
           END-IF.                                                      10120099
      *                                                                 10130099
      *                                                                 10140099
      ******************************************************************10150099
      * 7500-COMMIT-CHANGES.                                            10160099
      * PROCESSES: PERFORM UPDATE OF CHECKPOINT INFORMATION TABLE.      10170099
      *            TAKE A COMMIT.                                       10180099
      *  ==> PERFORMED FROM: 7400-COMMIT-PROCESSING.                    10190099
      ******************************************************************10200099
       7500-COMMIT-CHANGES.                                             10210099
                                                                        10220099
           EXEC SQL                                                     10230099
             UPDATE TCKRSTINF                                           10240099
                SET WORK_STRG_DESC = :TCKRSTINF-WORK-STRG-DESC          10250099
              WHERE JOB_NAME       = :PC-JOB-NAME                       10260099
                AND PLAN_NAME      = :PC-PROGRAM-NAME                   10270099
           END-EXEC.                                                    10280099
                                                                        10290099
           IF SQLCODE = 0                                               10300099
               CONTINUE                                                 10310099
           ELSE                                                         10320099
               MOVE PE-MSG-05                  TO PV-OPERATION-ATTEMPTED10330099
               MOVE  '* 7500-COMMIT-CHANGES *' TO PV-PARAGRAPH-NAME     10340099
               PERFORM 9998-SQL-ABEND                                   10350099
           END-IF.                                                      10360099
                                                                        10370099
           EXEC SQL                                                     10380099
               COMMIT                                                   10390099
           END-EXEC.                                                    10400099
                                                                        10410099
           IF SQLCODE = 0                                               10420099
               CONTINUE                                                 10430099
           ELSE                                                         10440099
               MOVE PE-MSG-06                  TO PV-OPERATION-ATTEMPTED10450099
               MOVE  '* 7500-COMMIT-CHANGES *' TO PV-PARAGRAPH-NAME     10460099
               PERFORM 9998-SQL-ABEND                                   10470099
           END-IF.                                                      10480099
      *                                                                 10490099
      *                                                                 10500099
      ******************************************************************10510099
      * 7510-COMMIT.                                                    10520099
      * THERE IS NO CHECKPOINT DONE WITH THIS COMMIT.  THIS COMMIT IS   10530099
      * EXECUTED WHEN INITIALIZING THE ONORDER AMOUNT AND COST TO ZERO. 10540099
      *  ==> PERFORMED FROM: 1300-INIT-BY-PARTITION.                    10550099
      ******************************************************************10560099
       7510-COMMIT.                                                     10570099
                                                                        10580099
                                                                        10590099
           EXEC SQL                                                     10600099
               COMMIT                                                   10610099
           END-EXEC.                                                    10620099
                                                                        10630099
           IF SQLCODE = 0                                               10640099
               CONTINUE                                                 10650099
           ELSE                                                         10660099
               MOVE PE-MSG-06                  TO PV-OPERATION-ATTEMPTED10670099
               MOVE  '* 7510-COMMIT         *' TO PV-PARAGRAPH-NAME     10680099
               PERFORM 9998-SQL-ABEND                                   10690099
           END-IF.                                                      10700099
      *                                                                 10710099
      *                                                                 10720099
      ******************************************************************10730099
      * 7600-UPDATE-CHECKPOINT-STATUS                                   10740099
      * PROCESSES: UPDATES THE STATUS ON THE CHECKPOINT CONTROL TABLE   10750099
      *                                                                 10760099
      ******************************************************************10770099
       7600-UPDATE-CHECKPOINT-STATUS.                                   10780099
                                                                        10790099
           EXEC SQL                                                     10800099
             UPDATE  TCKRSTCNTL                                         10810099
                SET  CKPT_STAT_CODE = :TCKRSTCNTL-CKPT-STAT-CODE        10820099
              WHERE  JOB_NAME  = :PC-JOB-NAME                           10830099
                AND  PLAN_NAME = :PC-PROGRAM-NAME                       10840099
           END-EXEC.                                                    10850099
                                                                        10860099
           IF SQLCODE = 0                                               10870099
               CONTINUE                                                 10880099
           ELSE                                                         10890099
               MOVE '7600-UPDATE-CHECKPOINT-STATUS' TO PV-PARAGRAPH-NAME10900099
               MOVE PE-MSG-10                  TO PV-OPERATION-ATTEMPTED10910099
               PERFORM 9998-SQL-ABEND                                   10920099
           END-IF.                                                      10930099
                                                                        10940099
           EJECT                                                        10950099
      *                                                                 10960099
      *                                                                 10970099
      ******************************************************************10980099
      * FIND PARTITION NUMBER FOR BOTH WEEKLY AND MONTHLY FISCAL DATE   10990099
      ******************************************************************11000099
       7800-FIND-BOTH-PARTN.                                            11010099
                                                                        11020099
           IF PV-DEPT-NBR = ML500-PV-DEPT-NBR                           11030099
               ADD +1                      TO PA-PARTN-REUSE            11040099
               MOVE PV-SAVE-MN-PARTN-NBR   TO MLT00004-PARTN-NBR        11041099
           ELSE                                                         11041199
               ADD +1                   TO PA-PARTN-LOOKUP              11041299
               MOVE PV-DEPT-NBR         TO ML500-PV-DEPT-NBR            11041399
                                                                        11041499
               MOVE 'M'                 TO ML500-PV-TM-LVL-CDE          11041599
                                                                        11041699
               PERFORM 7850-FIND-PARTITION                              11041799
                                                                        11041899
               MOVE ML500-PV-PARTN-NBR-OUT TO MLT00004-PARTN-NBR        11041999
                                              PV-SAVE-MN-PARTN-NBR      11042099
           END-IF.                                                      11043099
                                                                        11043199
      ******************************************************************11043299
      * FIND PARTITION NUMBER                                           11043399
      ******************************************************************11043499
       7850-FIND-PARTITION.                                             11043599
                                                                        11043699
           PERFORM ML500-0500-FIND-PARTITION.                           11043799
           IF ML500-PV-PARAGRAPH-NAME NOT EQUAL TO SPACES               11043899
             MOVE ML500-PV-PARAGRAPH-NAME TO PV-PARAGRAPH-NAME          11043999
             MOVE ML500-PV-OPERATION-ATTEMPTED TO PV-OPERATION-ATTEMPTED11044099
             PERFORM 9998-SQL-ABEND                                     11044199
           END-IF.                                                      11044299
                                                                        11044399
      ******************************************************************11044499
      * PROGRAM RESTART DUE TO A DEADLOCK AGAINST MLT_MNLY_SUM ROW FOR  11044599
      *  UPDATE.  FIND RESTART RECORD AND CKPT RESTART AT POINT OF LAST 11044699
      *  COMMIT.                                                        11044799
      ******************************************************************11044899
       7999-RESTART-PROCESS.                                            11044999
      *                                                                 11045099
           SET PS-PROGRAM-DEADLOCKED TO TRUE.                           11046099
      *                                                                 11047099
           CLOSE CONDENSED-FILE                                         11048099
                 LEDGER-EXTRACT-DATE-FILE.                              11049099
      *                                                                 11050099
           PERFORM 7200-SELECT-RESTART-INFO.                            11060099
      *                                                                 11070099
           DISPLAY '**** RESTART **** '.                                11080099
           MOVE PV-DEADLOCK-COUNT TO PD-DEADLOCK-COUNT.                 11090099
           DISPLAY '** SQLCODE -911 **  ' PD-DEADLOCK-COUNT ' TIMES'.   11100099
      *                                                                 11110099
      *-- THIS CHECK WILL PREVENT THE FILE FROM BEING RESTARTED IN      11120099
      *-- THE WRONG POSITION IF NO COMMITS HAVE OCCURRED AND THE        11130099
      *-- RESTART INFORMATION IS NOT CLEARED OUT.                       11140099
           IF PS-FIRST-COMMIT                                           11150099
               INITIALIZE TCKRSTINF-WORK-STRG-DESC                      11160099
               DISPLAY 'NO COMMITS HAVE OCCURRED YET; RESTART FROM'     11170099
                      ' BEGINNING'                                      11180099
           ELSE                                                         11190099
               DISPLAY 'TCKRSTINF-LAST CKPT '                           11200099
                        TCKRSTINF-WORK-STRG-DESC (1:104)                11210099
      ***    INFO ON LAST CHECKPOINT TAKEN IS IN                        11220099
      ***    CR-CHECKPOINT-RESTART-AREA.                                11230099
               MOVE TCKRSTINF-WORK-STRG-DESC TO                         11240099
                     CR-CHECKPOINT-RESTART-AREA                         11250099
               DISPLAY 'CHECKPOINT RESTART INFORMATION:'                11260099
               DISPLAY 'MONTH NBR        ' CR-FISCAL-NBR                11270099
               DISPLAY 'MONTH END DATE   ' CR-FISCAL-MN-END-DTE         11280099
               DISPLAY 'DEPARTMENT NBR  ' CR-DEPT-NBR                   11290099
               DISPLAY 'SUB CLASS NBR   ' CR-SUB-CL-NBR                 11300099
               DISPLAY 'STORE NBR       ' CR-LOC-NBR                    11310099
W28582         DISPLAY 'ML LWST ID      ' CR-ML-LWST-ID                 11320099
W28582***      DISPLAY 'ENT ID          ' CR-ENT-ID                     11330099
               DISPLAY 'INPUT RECS READ ' CR-INPUT-READ-COUNT           11340099
J28582         DISPLAY 'FSCL-MN-BEG-DTE ' CR-FSCL-MN-BEG-DTE            11350099
J28582         DISPLAY 'FSCL-END-DTE    ' CR-FSCL-END-DTE               11360099
           END-IF.                                                      11370099
      *                                                                 11380099
           OPEN INPUT CONDENSED-FILE.                                   11390099
           MOVE ZEROES                          TO PA-INPUT-COUNT.      11400099
      *                                                                 11410099
      *POSITION INPUT FILE TO 1ST RECORD AFTER LAST CHECKPOINT          11420099
           PERFORM 4100-READ-CONDENSED-FILE                             11430099
               UNTIL PA-INPUT-COUNT > CR-INPUT-READ-COUNT               11440099
                 OR PS-NO-MORE-INPUT-RECORDS.                           11450099
           IF PS-NO-MORE-INPUT-RECORDS                                  11460099
               DISPLAY 'END OF INPUT FILE ON RESTART'                   11470099
           ELSE                                                         11480099
               DISPLAY 'INPUT RECORD RESTARTED ON RECORD '              11490099
                        PA-INPUT-COUNT                                  11500099
               DISPLAY 'FISCAL MONTH NBR       ' ML132-ONORD-FSCL-MN-NBR11510099
               DISPLAY 'FISCAL MONTH END DATE  '                        11520099
                                            ML132-ONORD-FSCL-MN-END-DTE 11530099
               DISPLAY 'DEPARTMENT NBR        ' ML132-ONORD-DEPT-NBR    11540099
               DISPLAY 'SUB CLASS NBR         ' ML132-ONORD-SUB-CL-NBR  11550099
               DISPLAY 'STORE NBR             ' ML132-ONORD-STR-NBR     11560099
W28582         DISPLAY 'ML LWST ID            ' ML132-ONORD-ML-LWST-ID  11570099
W28582***      DISPLAY 'ENT ID                ' ML132-ONORD-ENT-ID      11580099
           END-IF.                                                      11590099
      *                                                                 11600099
      *RE-ESTABLISH COUNTS FOR PROCESSED INPUT (FROM CHECKPOINT RECORD) 11610099
           MOVE CR-UPD-MLT00004-COUNT TO PA-UPD-MLT00004-COUNT.         11620099
           MOVE CR-INS-MLT00004-COUNT TO PA-INS-MLT00004-COUNT.         11630099
           MOVE CR-SEL-MLT00004-COUNT TO PA-SEL-MLT00004-COUNT.         11640099
           MOVE CR-SEL-TDTATTR-COUNT    TO PA-SEL-TDTATTR-COUNT.        11650099
           MOVE CR-MLT00004-COMMIT-COUNT TO PA-COMMIT-COUNT.            11660099
J28582     MOVE CR-FSCL-MN-BEG-DTE    TO PV-FSCL-MN-BEG-DTE.            11670099
J28582     MOVE CR-FSCL-END-DTE       TO PV-FSCL-END-DTE.               11680099
      *                                                                 11690099
      *                                                                 11700099
      ******************************************************************11710099
      *  RESET STATUS CODE, DISPLAY FINAL COUNTS , CLOSE INPUT FILE    *11720099
      ******************************************************************11730099
       8000-EOJ-ROUTINE.                                                11740099
      *                                                                 11750099
           MOVE '0' TO TCKRSTCNTL-CKPT-STAT-CODE.                       11760099
           PERFORM 7600-UPDATE-CHECKPOINT-STATUS.                       11770099
      *                                                                 11780099
           DISPLAY '                                             '.     11790099
           DISPLAY 'INPUT RECORDS   ', PA-INPUT-COUNT.                  11800099
           DISPLAY 'SELECT MLT_MNLY_SUM  ', PA-SEL-MLT00004-COUNT.      11810099
           DISPLAY 'UPDATE MLT_MNLY_SUM  ', PA-UPD-MLT00004-COUNT.      11820099
           DISPLAY 'INSERT MLT_MNLY_SUM  ', PA-INS-MLT00004-COUNT.      11830099
           DISPLAY 'SELECT TDTATTR  ', PA-SEL-TDTATTR-COUNT.            11840099
           DISPLAY '                                             '.     11850099
           DISPLAY 'COMMITS TAKEN   ', PA-COMMIT-COUNT.                 11860099
      *                                                                 11870099
           CLOSE CONDENSED-FILE                                         11880099
                 LEDGER-EXTRACT-DATE-FILE.                              11890099
      *                                                                 11900099
      *                                                                 11910099
      ******************************************************************11920099
      * MLPD500 - PARTITION                                             11930099
      ******************************************************************11931099
           COPY MLPD500.                                                11932099
      *                                                                 11933099
      ******************************************************************11934099
      *  PERFORMED BY 6500-SELECT AND 6600-UPDATE AND 6700-INSERT       11935099
      *  THIS ROUTINE FORCES AN ABEND DUE TO A SQLCODE -911 (3 TIMES)   11936099
      ******************************************************************11937099
       9000-DEADLOCK-ERROR.                                             11938099
      *                                                                 11939099
               MOVE PE-MSG-07             TO PV-OPERATION-ATTEMPTED     11940099
               PERFORM 9998-SQL-ABEND.                                  11950099
      *                                                                 11960099
      ******************************************************************11970099
      *  STANDARD DB2 ERROR ABEND ROUTINE                               11980099
      *  THIS ROUTINE FORCES AN ABEND DUE TO A DB2 PROBLEM.             11990099
      ******************************************************************12000099
       9998-SQL-ABEND.                                                  12010099
      *                                                                 12020099
           MOVE +4013                 TO ABEND-CODE.                    12030099
           MOVE SQLCODE               TO PV-SQLCODE-DISPLAY.            12040099
           DISPLAY '**  ABEND     **'.                                  12050099
           DISPLAY '**  PROGRAM   ** => ' PC-PROGRAM-NAME.              12060099
           DISPLAY '**  PARAGRAPH **  = ' PV-PARAGRAPH-NAME.            12070099
           DISPLAY '**  OPERATION **  = ' PV-OPERATION-ATTEMPTED.       12080099
           DISPLAY '**  SQLCODE   **  = ' PV-SQLCODE-DISPLAY.           12090099
      *                                                                 12100099
      *    EXEC SQL                                                     12110099
      *         ROLLBACK                                                12120099
      *    END-EXEC.                                                    12130099
      *                                                                 12140099
      *    THE FOLLOWING COPYBOOK UTILIZES THE DB2 ABEND MODULE         12150099
      *    DSNTIAR TO CONVERT SQLCA INTO UNDERSTANDABLE VERBAGE.        12160099
           COPY DPPD004.                                                12170099
           PERFORM 9999-ABEND.                                          12180099
      *                                                                 12190099
      *                                                                 12200099
       9999-ABEND.                                                      12210099
      *                                                                 12220099
           CALL 'ILBOABN0'  USING ABEND-CODE.                           12230099
