       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID.    MLKUP973.                                         00020008
       AUTHOR.        B. GRAHAM - STRATAGEM.                            00030000
       INSTALLATION.  KOHLS DEPARTMENT STORES.                          00040000
       DATE-WRITTEN.  07/08/07.                                         00050000
       DATE-COMPILED.                                                   00060000
                                                                        00070000
      ******************************************************************00080000
      * THIS PROGRAM WILL INSERT EIC 2 CORRECTIONS FOR UNKNOWN /        00090000
      * UNKNOWN USING LOCATION 400 SUB CLASS 10                         00100000
      ******************************************************************00110000
                                                                        00120000
      ******************************************************************00130000
       ENVIRONMENT DIVISION.                                            00140000
      ******************************************************************00150000
                                                                        00160000
       CONFIGURATION SECTION.                                           00170000
                                                                        00180000
       SOURCE-COMPUTER.        IBM-3090.                                00190000
       OBJECT-COMPUTER.        IMB-3090.                                00200000
                                                                        00210000
       INPUT-OUTPUT SECTION.                                            00220000
                                                                        00230000
       FILE-CONTROL.                                                    00240000
           SELECT CNTL-DATE-FILE                                        00250000
               ASSIGN TO INP01.                                         00260000
           SELECT EIC-2-INPUT-FILE                                      00270000
               ASSIGN TO INP02.                                         00280000
      ******************************************************************00290000
       DATA DIVISION.                                                   00300000
      ******************************************************************00310000
                                                                        00320000
       FILE SECTION.                                                    00330000
                                                                        00340000
       FD  CNTL-DATE-FILE                                               00350000
           RECORDING  MODE IS F.                                        00360000
       01  CNTL-DATE-REC                    PIC X(80).                  00370000
                                                                        00380000
       FD  EIC-2-INPUT-FILE                                             00390000
           RECORDING  MODE IS F.                                        00400000
       01  EIC-2-INPUT-REC                  PIC X(017).                 00410000
                                                                        00420000
       WORKING-STORAGE SECTION.                                         00430000
                                                                        00440000
       01  ABEND-CODE                        PIC S9(4) VALUE ZEROS      00450000
                                                       COMP SYNC.       00460000
           88  AC-OTHER-ERROR                          VALUE +4003.     00470000
           88  AC-SQL-ERROR                            VALUE +4013.     00480000
                                                                        00490000
       01  PS-PROGRAM-SWITCHES.                                         00500000
           05  PS-EIC-2-AT-END-SW            PIC X     VALUE 'N'.       00510000
               88  PS-EIC-2-AT-END-YES                 VALUE 'Y'.       00520000
               88  PS-EIC-2-AT-END-NO                  VALUE 'N'.       00530000
                                                                        00540000
       01  ABEND-CODE-SQL              PIC S9(04)  VALUE ZERO COMP SYNC.00550000
                                                                        00560000
       01  PC-PROGRAM-CONSTANTS.                                        00570000
           05 PC-PGM-NAME                  PIC X(8)  VALUE 'MLKUP973'.  00580008
           05 PC-MAX-RETRIES               PIC S9(03) VALUE 3 COMP-3.   00590000
           05 PC-M                         PIC X(01) VALUE 'M'.         00600000
                                                                        00610000
       01  PV-PROGRAM-VARIABLES.                                        00620000
           05 PV-DATE-FIELDS.                                           00630000
              10 PV-PROCESS-DATE             PIC   X(10).               00640000
           05 PV-GET-END-INV-COST2-AMT       PIC S9(11)V99 COMP-3       00650000
                                                        VALUE ZEROS.    00660000
           05 PV-GET-INV-COST-ADJ2-AMT       PIC S9(11)V99 COMP-3       00661005
                                                        VALUE ZEROS.    00662005
           05 PV-MISC.                                                  00670000
              10 PV-RETRY-COUNTER            PIC S9(04) COMP.           00680000
              10 PV-PARAGRAPH-NAME           PIC X(30)  VALUE SPACES.   00690000
              10 PV-DB2-DATE-EXISTS          PIC X(01).                 00700000
              10 PV-DEPT-9                  PIC S9(04)V COMP-3 VALUE 0. 00710000
              10 PV-DISP-MDSE-LVL-ID         PIC 9(09).                 00720000
              10 PV-DISP-DEPT-NBR            PIC 9(05).                 00730000
              10 PV-DISP-PARTN-NBR           PIC 9(04).                 00740000
              10 PV-SAVE-PARTN-NBR           PIC S9(04) COMP VALUE 0.   00750000
           05 PV-SQLCODE                     PIC S9(04) VALUE ZERO.     00760000
           05 PV-TOTALS.                                                00770000
              10  PA-INPUT-COUNT             PIC   9(11) VALUE ZEROS.   00780000
              10  PA-INSERT-COUNT            PIC  9(11) VALUE ZEROS.    00790000
              10  PA-UPDATE-COUNT            PIC  9(11)                 00800000
                                                     VALUE ZERO.        00810000
                                                                        00820000
       01  PV-EIC-2-INPUT-REC.                                          00830000
           10 PV-EIC-TYPE-REV               PIC   X(03).                00840000
           10 PV-EIC-DEPT-NBR               PIC   S9(04)V COMP-3.       00850000
           10 PV-EIC-ML-LO-MDSE-LVL-ID      PIC  S9(9) COMP.            00860000
           10 PV-EIC-END-INV-COST2-AMT      PIC  S9(11)V9(2) COMP-3.    00870000
                                                                        00880000
                                                                        00890000
                                                                        00900000
      ***************************************************************** 00910000
      *  CONTROL CARD WITH DATE FOR CURSOR.                             00920000
      ***************************************************************** 00930000
       01  CC-CONTROL-CARD.                                             00940000
           05  CC-PROC-DATE-ISO                PIC X(10).               00950000
           05  CC-PROC-DATE-RDF  REDEFINES                              00960000
               CC-PROC-DATE-ISO.                                        00970000
               10  CC-PROC-CC                  PIC X(02).               00980000
               10  CC-PROC-YY                  PIC X(02).               00990000
               10  FILLER                      PIC X(01).               01000000
               10  CC-PROC-MM                  PIC X(02).               01010000
               10  FILLER                      PIC X(01).               01020000
               10  CC-PROC-DD                  PIC X(02).               01030000
           05  FILLER                          PIC X(70).               01040000
                                                                        01050000
      ******************************************************************01060000
      *  DB2 SQL ERROR MESSAGE FORMAT AREA                              01070000
      ******************************************************************01080000
           COPY DPWS004.                                                01090000
                                                                        01100000
      ******************************************************************01110000
      * DATE ATTRIBUTE TABLE                                            01120000
      ******************************************************************01130000
           EXEC SQL                                                     01140000
             INCLUDE TDTATTR                                            01150000
           END-EXEC.                                                    01160000
      ******************************************************************01170000
      * PARTITION NUMBER TABLE                                          01180000
      ******************************************************************01190000
           EXEC SQL                                                     01200000
             INCLUDE MLT00003                                           01210000
           END-EXEC.                                                    01220000
      ******************************************************************01230000
      * PARTITION BAL TABLE                                             01240000
      ******************************************************************01250000
           EXEC SQL                                                     01260000
             INCLUDE MLT00002                                           01270000
           END-EXEC.                                                    01280000
      ******************************************************************01290000
      * MLT_DEPT_BRND_VND TABLE                                         01300001
      ******************************************************************01310000
           EXEC SQL                                                     01320000
             INCLUDE MLT00010                                           01330001
           END-EXEC.                                                    01340000
      ***************************************************************** 01350000
      *    DB2 AREA FOR COMMUNICATIONS                                * 01360000
      ***************************************************************** 01370000
           EXEC SQL                                                     01380000
                INCLUDE SQLCA                                           01390000
           END-EXEC.                                                    01400000
                                                                        01410000
                                                                        01420000
      ******************************************************************01430000
       PROCEDURE DIVISION.                                              01440000
      ******************************************************************01450000
                                                                        01460000
       0000-MAINLINE.                                                   01470000
                                                                        01480000
           PERFORM 1000-INITIALIZE                                      01490000
                                                                        01500000
           SET PS-EIC-2-AT-END-NO TO TRUE.                              01510000
                                                                        01520000
           PERFORM 2000-PROCESS-EIC-2                                   01530000
               UNTIL PS-EIC-2-AT-END-YES.                               01540000
                                                                        01550000
           DISPLAY 'PA-INPUT-COUNT    ' PA-INPUT-COUNT.                 01560000
           DISPLAY 'PA-INSERT-COUNT   ' PA-INSERT-COUNT.                01570000
           DISPLAY 'PA-UPDATE-COUNT   ' PA-UPDATE-COUNT.                01580000
                                                                        01590000
           CLOSE CNTL-DATE-FILE                                         01600000
                 EIC-2-INPUT-FILE.                                      01610000
                                                                        01620000
           STOP RUN.                                                    01630000
                                                                        01640000
      ******************************************************************01650000
      *  PERFORM THE NECESSARY INITIALIZATION STEPS                     01660000
      ******************************************************************01670000
       1000-INITIALIZE.                                                 01680000
                                                                        01690000
           OPEN INPUT  CNTL-DATE-FILE                                   01700000
                       EIC-2-INPUT-FILE.                                01710000
                                                                        01720000
           PERFORM 9000-READ-CNTL-DTE.                                  01730000
                                                                        01740000
           PERFORM 3000-GET-PROCESS-DATE-INFO.                          01750000
                                                                        01760000
                                                                        01770000
      ******************************************************************01780000
      *  PROCESS EIC 2 CORRECTIONS FOR UNKNOWN/UNKNOWN                  01790000
      ******************************************************************01800000
                                                                        01810000
       2000-PROCESS-EIC-2.                                              01820000
                                                                        01830000
           PERFORM 2900-READ-EIC-2-REC.                                 01840000
                                                                        01850000
           IF PS-EIC-2-AT-END-NO                                        01860000
               PERFORM 2050-BUILD-UPDATE-REC                            01870000
               PERFORM 2100-DO-INSERT-UPDATE                            01880000
            END-IF.                                                     01890000
                                                                        01900000
                                                                        01910000
       2050-BUILD-UPDATE-REC.                                           01920000
                                                                        01930000
           INITIALIZE DCLMLT00010.                                      01940001
                                                                        01950000
           MOVE PV-EIC-DEPT-NBR           TO MLT00010-DEPT-NBR.         01960001
           MOVE PV-EIC-ML-LO-MDSE-LVL-ID  TO                            01970000
                                     MLT00010-ML-LO-MDSE-LVL-ID.        01980001
           MOVE PV-EIC-END-INV-COST2-AMT  TO                            01990000
                                     MLT00010-END-INV-COST2-AMT.        02000001
           MOVE PV-EIC-END-INV-COST2-AMT  TO                            02001004
                                     MLT00010-INV-COST-ADJ2-AMT.        02002004
           MOVE CC-PROC-DATE-ISO          TO  MLT00010-FSCL-MN-END-DTE. 02010001
                                                                        02050000
           IF PV-EIC-DEPT-NBR = PV-DEPT-9                               02060000
               MOVE PV-SAVE-PARTN-NBR     TO  MLT00010-PARTN-NBR        02070001
           ELSE                                                         02080000
               PERFORM 2075-LOOK-UP-PARTN                               02090000
               MOVE PV-EIC-DEPT-NBR TO PV-DEPT-9                        02100000
               MOVE MLT00010-PARTN-NBR  TO PV-SAVE-PARTN-NBR            02110001
               MOVE PV-DEPT-9           TO PV-DISP-DEPT-NBR             02120000
               MOVE MLT00010-PARTN-NBR  TO PV-DISP-PARTN-NBR            02130001
               DISPLAY 'PV-DISP-DEPT-NBR  ' PV-DISP-DEPT-NBR            02140000
               DISPLAY 'PV-DISP-PARTN-NBR ' PV-SAVE-PARTN-NBR           02150000
           END-IF.                                                      02160000
                                                                        02170000
       2075-LOOK-UP-PARTN.                                              02180000
                                                                        02190000
           EXEC SQL                                                     02200000
                SELECT PARTN_NBR                                        02210000
                    INTO   :MLT00010-PARTN-NBR                          02220001
                FROM MLT_PARTN_CNTL A                                   02230000
                    ,MLT_PARTN_BAL  B                                   02240000
                WHERE B.DEPT_NBR = :MLT00010-DEPT-NBR                   02250001
                  AND A.TBL_TM_LVL_CDE = B.TBL_TM_LVL_CDE               02260000
                  AND A.TBL_TM_LVL_CDE = :PC-M                          02270000
                  AND A.DEPT_GP_CDE = B.DEPT_GP_CDE                     02280000
                  AND A.FSCL_DTE = :MLT00010-FSCL-MN-END-DTE            02290001
                  AND B.EFF_BEG_DTE <= :MLT00010-FSCL-MN-END-DTE        02300001
                  AND B.EFF_END_DTE >= :MLT00010-FSCL-MN-END-DTE        02310001
                                                                        02320000
           END-EXEC.                                                    02330000
                                                                        02340000
           EVALUATE TRUE                                                02350000
               WHEN SQLCODE = 0                                         02360000
                    CONTINUE                                            02370000
               WHEN SQLWARN0 NOT = SPACES                               02380000
               WHEN SQLCODE < +0                                        02390000
               WHEN SQLCODE > +0                                        02400000
                    MOVE '2075-LOOK-UP-PARTN        '                   02410000
                          TO PV-PARAGRAPH-NAME                          02420000
                    PERFORM 9999-SQL-ABEND                              02430000
           END-EVALUATE.                                                02440000
                                                                        02450000
       2100-DO-INSERT-UPDATE.                                           02460000
                                                                        02470000
           EXEC SQL                                                     02480000
               INSERT INTO MLT_DEPT_BRND_VND                            02490001
                    (  PARTN_NBR                                        02500000
                     , DEPT_NBR                                         02510000
                     , ML_LO_MDSE_LVL_ID                                02550000
                     , FSCL_MN_END_DTE                                  02560000
                     , SHNK_RTL_AMT                                     02561002
                     , END_INV_RTL_AMT                                  02562002
                     , END_INV_COST_AMT                                 02563002
                     , GRO_MRGN_AMT                                     02563102
                     , INV_COST_ADJ1_AMT                                02564002
                     , INV_COST_ADJ2_AMT                                02565002
                     , END_INV_COST1_AMT                                02566002
                     , END_INV_COST2_AMT)                               02567002
               VALUES (:MLT00010-PARTN-NBR                              03030001
                      ,:MLT00010-DEPT-NBR                               03040001
                      ,:MLT00010-ML-LO-MDSE-LVL-ID                      03080001
                      ,:MLT00010-FSCL-MN-END-DTE                        03090001
                      ,:MLT00010-SHNK-RTL-AMT                           03091002
                      ,:MLT00010-END-INV-RTL-AMT                        03092002
                      ,:MLT00010-END-INV-COST-AMT                       03093002
                      ,:MLT00010-GRO-MRGN-AMT                           03093103
                      ,:MLT00010-INV-COST-ADJ1-AMT                      03094002
                      ,:MLT00010-INV-COST-ADJ2-AMT                      03095002
                      ,:MLT00010-END-INV-COST1-AMT                      03096002
                      ,:MLT00010-END-INV-COST2-AMT)                     03097002
           END-EXEC.                                                    03497000
                                                                        03498000
           EVALUATE TRUE                                                03499000
               WHEN SQLCODE = 0                                         03499100
                   ADD 1                      TO PA-INSERT-COUNT        03499200
               WHEN SQLCODE = -803                                      03499300
                   PERFORM 2200-GET-EIC-2                               03499400
                   PERFORM 2300-REPLACE-EIC-2                           03499500
               WHEN OTHER                                               03499600
                   DISPLAY                                              03499700
                        ' PA-INPUT-COUNT ' PA-INPUT-COUNT               03499800
                        ' PARTN: ' MLT00010-PARTN-NBR,                  03499901
                        ' DEPT:  ' MLT00010-DEPT-NBR,                   03500001
                        ' ML-LWST-ID: ' MLT00010-ML-LO-MDSE-LVL-ID      03500401
                   MOVE '2100-DO-INSERT-UPDATE    '                     03500500
                                         TO PV-PARAGRAPH-NAME           03500600
                   PERFORM 9999-SQL-ABEND                               03500700
           END-EVALUATE.                                                03500800
                                                                        03500900
                                                                        03501000
       2200-GET-EIC-2.                                                  03502000
                                                                        03503000
           EXEC SQL                                                     03504000
               SELECT                                                   03505000
                       END_INV_COST2_AMT                                03506000
                      ,INV_COST_ADJ2_AMT                                03506104
                 INTO                                                   03507000
                       :PV-GET-END-INV-COST2-AMT                        03508000
                      ,:PV-GET-INV-COST-ADJ2-AMT                        03508104
                 FROM                                                   03509000
                       MLT_DEPT_BRND_VND                                03510001
                 WHERE PARTN_NBR       = :MLT00010-PARTN-NBR            03520001
                   AND DEPT_NBR        = :MLT00010-DEPT-NBR             03520101
                   AND ML_LO_MDSE_LVL_ID = :MLT00010-ML-LO-MDSE-LVL-ID  03520501
           END-EXEC.                                                    03520600
                                                                        03520700
           EVALUATE SQLCODE                                             03520800
               WHEN 0                                                   03520900
                   CONTINUE                                             03521000
               WHEN OTHER                                               03521100
                    DISPLAY '*************************************'     03521200
                    DISPLAY 'ROW IN PROCESS : '                         03521300
                    DISPLAY  PA-INPUT-COUNT                             03521400
                         ' PARTN: ' MLT00010-PARTN-NBR,                 03521501
                         ' DEPT:  ' MLT00010-DEPT-NBR,                  03521601
                         ' ML-LWST-ID: ' MLT00010-ML-LO-MDSE-LVL-ID     03522001
                    DISPLAY '*************************************'     03523000
                    MOVE '2200-GET-EIC-2 '                              03523100
                                          TO PV-PARAGRAPH-NAME          03523200
                    PERFORM 9999-SQL-ABEND                              03523300
           END-EVALUATE.                                                03523400
                                                                        03523500
      ******************************************************************03523600
      * 2300-REPLACE-EIC-2                                              03523700
      * REPLACE EIC-2  ( ADD INPUT TO EXISTING AMOUNT RETRIEVED ABOVE)  03523800
      ******************************************************************03523900
       2300-REPLACE-EIC-2.                                              03524000
                                                                        03524100
           COMPUTE MLT00010-END-INV-COST2-AMT =                         03524201
                 PV-GET-END-INV-COST2-AMT + PV-EIC-END-INV-COST2-AMT.   03524300
                                                                        03524404
           COMPUTE MLT00010-INV-COST-ADJ2-AMT =                         03524504
                 PV-GET-INV-COST-ADJ2-AMT + PV-EIC-END-INV-COST2-AMT.   03524604
                                                                        03524704
           EXEC SQL                                                     03524804
               UPDATE MLT_DEPT_BRND_VND                                 03524904
                  SET                                                   03525004
                     END_INV_COST2_AMT = :MLT00010-END-INV-COST2-AMT    03525104
                    ,INV_COST_ADJ2_AMT = :MLT00010-INV-COST-ADJ2-AMT    03525207
                 WHERE PARTN_NBR       = :MLT00010-PARTN-NBR            03525306
                   AND DEPT_NBR        = :MLT00010-DEPT-NBR             03526004
                   AND ML_LO_MDSE_LVL_ID = :MLT00010-ML-LO-MDSE-LVL-ID  03526301
           END-EXEC.                                                    03526400
                                                                        03526500
           EVALUATE SQLCODE                                             03526600
               WHEN 0                                                   03526700
                    ADD 1                TO PA-UPDATE-COUNT             03526800
               WHEN OTHER                                               03526900
                    DISPLAY '*************************************'     03527000
                    DISPLAY 'ROW IN PROCESS : '                         03527100
                    DISPLAY  PA-INPUT-COUNT                             03527200
                         ' PARTN: ' MLT00010-PARTN-NBR,                 03527301
                         ' DEPT:  ' MLT00010-DEPT-NBR,                  03527401
                         ' ML-LWST-ID: ' MLT00010-ML-LO-MDSE-LVL-ID     03527801
                    DISPLAY '*************************************'     03527900
                    MOVE '2300-REPLACE-EIC-2    '                       03528000
                                          TO PV-PARAGRAPH-NAME          03528100
                    PERFORM 9999-SQL-ABEND                              03528200
           END-EVALUATE.                                                03528300
                                                                        03528400
                                                                        03528500
                                                                        03528600
       2900-READ-EIC-2-REC.                                             03528700
                                                                        03528800
           READ EIC-2-INPUT-FILE INTO PV-EIC-2-INPUT-REC                03528900
               AT END                                                   03529000
                   SET PS-EIC-2-AT-END-YES TO TRUE.                     03529100
                                                                        03529200
           IF PS-EIC-2-AT-END-NO                                        03529300
               ADD 1 TO PA-INPUT-COUNT                                  03529400
           END-IF.                                                      03529500
                                                                        03529600
                                                                        03529700
      ****************************************************************  03529800
      * VALIDATE THE PROCESS DATE.                                      03529900
      ****************************************************************  03530000
       3000-GET-PROCESS-DATE-INFO.                                      03540000
           PERFORM                                                      03550000
               WITH TEST AFTER                                          03560000
               VARYING PV-RETRY-COUNTER                                 03570000
               FROM 1 BY 1                                              03580000
               UNTIL ((PV-RETRY-COUNTER > PC-MAX-RETRIES)               03590000
                         OR (SQLCODE = ZERO)                            03600000
                         OR (SQLCODE = 100))                            03610000
                  EXEC SQL                                              03620000
                      SELECT 'Y'                                        03630000
                        INTO :PV-DB2-DATE-EXISTS                        03640000
                        FROM TDTATTR                                    03650000
                       WHERE KY_DTE = :PV-PROCESS-DATE                  03660000
                  END-EXEC                                              03670000
                                                                        03680000
                  EVALUATE TRUE                                         03690000
                      WHEN SQLCODE = 0                                  03700000
                           DISPLAY 'DATE SELECT: '                      03710000
                                  PV-PROCESS-DATE                       03720000
                                  ' SUCCESSFUL'                         03730000
                           CONTINUE                                     03740000
                      WHEN SQLCODE = -904                               03750000
                      WHEN SQLCODE = -913                               03760000
                           CONTINUE                                     03770000
                      WHEN SQLWARN0 NOT = SPACES                        03780000
                      WHEN SQLCODE < +0                                 03790000
                      WHEN SQLCODE > +0                                 03800000
                           MOVE '3000-GET-PROCESS-DATE-INFO'            03810000
                                 TO PV-PARAGRAPH-NAME                   03820000
                           PERFORM 9999-SQL-ABEND                       03830000
                  END-EVALUATE                                          03840000
           END-PERFORM.                                                 03850000
                                                                        03860000
           IF PV-RETRY-COUNTER > PC-MAX-RETRIES                         03870000
              DISPLAY 'RETRIES EXCEEDED FOR PROCESS DATE '              03880000
           END-IF.                                                      03890000
                                                                        03900000
                                                                        03910000
      ******************************************************************03920000
      * 9000-READ-CNTL-DTE.                                             03930000
      ******************************************************************03940000
       9000-READ-CNTL-DTE.                                              03950000
           READ CNTL-DATE-FILE INTO CC-CONTROL-CARD                     03960000
               AT END                                                   03970000
                   DISPLAY '** PROGRAM ABEND **'                        03980000
                   DISPLAY 'MLKUP973  - CONTROL DATE EMPTY'             03990008
                   SET AC-OTHER-ERROR TO TRUE                           04000000
                   CALL 'ILBOABN0' USING ABEND-CODE.                    04010000
                                                                        04020000
           DISPLAY '** MLKUP973 CONTROL CARD:' CNTL-DATE-REC.           04030008
                                                                        04040000
           MOVE CC-PROC-DATE-ISO TO PV-PROCESS-DATE.                    04050000
                                                                        04060000
                                                                        04070000
      ******************************************************************04080000
      *  STANDARD DB2 ERROR ABEND ROUTINE                               04090000
      *  THIS ROUTINE FORCES AN ABEND DUE TO A DB2 PROBLEM.             04100000
      ******************************************************************04110000
       9999-SQL-ABEND.                                                  04120000
                                                                        04130000
           SET AC-SQL-ERROR           TO TRUE.                          04140000
           DISPLAY '**  ABEND     **'.                                  04150000
           DISPLAY '**  PROGRAM   **  = ' PC-PGM-NAME.                  04160000
           DISPLAY '**  PARAGRAPH **  = ' PV-PARAGRAPH-NAME.            04170000
                                                                        04180000
      *    THE FOLLOWING COPYBOOK UTILIZES THE DB2 ABEND MODULE         04190000
      *    DSNTIAR TO CONVERT SQLCA INTO UNDERSTANDABLE VERBAGE.        04200000
                                                                        04210000
           COPY DPPD004.                                                04220000
                                                                        04230000
           CALL 'ILBOABN0'  USING ABEND-CODE.                           04240000
                                                                        04250000
