       IDENTIFICATION DIVISION.                                         00010000
                                                                        00020000
       PROGRAM-ID.    MLKUT229.                                         00030001
       AUTHOR.        JOHN SELWITSCHKA.                                 00040000
       INSTALLATION.  KOHLS DEPARTMENT STORES.                          00050000
       DATE-WRITTEN.  11/12/2010.                                       00060002
       DATE-COMPILED.                                                   00070000
                                                                        00080000
      ******************************************************************00090000
      *    MLKUT229 - ASSIGN PURCHASE ADJUSTMENT RTV AMOUNTS (MLRD254) *00100001
      *                                                                *00100100
      *    THIS PROGRAM CHECKS THE TYPE OF PURCHASE ADJUSTMENT AND     *00100201
      *    ASSIGNS THE RTV AMOUNTS IF NEEDED                           *00100301
      ******************************************************************00110000
      ******************************************************************00110100
      *    WR/PITS#     DATE        DESCRIPTION                        *00110200
      *    --------   --------     ---------------------------------   *00110300
      *    WR37965    11/12/10     INITIAL CREATION                    *00110401
      ******************************************************************00110500
                                                                        00110600
       ENVIRONMENT DIVISION.                                            00110700
                                                                        00110800
       CONFIGURATION SECTION.                                           00110900
       SOURCE-COMPUTER.        IBM-3090.                                00111000
       OBJECT-COMPUTER.        IBM-3090.                                00112000
       INPUT-OUTPUT SECTION.                                            00113000
       FILE-CONTROL.                                                    00114000
           SELECT DTL-LEDGER-FILE-IN                                    00115000
               ASSIGN TO INP01.                                         00116000
                                                                        00117000
           SELECT DTL-LEDGER-FILE-OUT                                   00118000
               ASSIGN TO OUT01.                                         00118100
                                                                        00118200
       DATA DIVISION.                                                   00118300
       FILE SECTION.                                                    00118400
                                                                        00118500
       FD  DTL-LEDGER-FILE-IN                                           00118600
           LABEL RECORDS ARE STANDARD                                   00118700
           RECORDING MODE IS F                                          00118800
           BLOCK CONTAINS 0 RECORDS.                                    00118900
       01  DTL-LEDGER-IN-REC            PIC X(450).                     00119000
                                                                        00120000
       FD  DTL-LEDGER-FILE-OUT                                          00130000
           LABEL RECORDS ARE STANDARD                                   00140000
           RECORDING MODE IS F                                          00150000
           BLOCK CONTAINS 0 RECORDS.                                    00160000
       01  DTL-LEDGER-OUT-REC           PIC X(450).                     00170000
      *                                                                 00180000
                                                                        00190000
       WORKING-STORAGE SECTION.                                         00200000
                                                                        00210000
       01  FILLER                      PIC X(28)   VALUE                00220000
                'BEGINNING OF WORKING STORAGE'.                         00230000
                                                                        00240000
       01  ABEND-CODE                  PIC S9(04)  VALUE ZERO COMP SYNC.00250000
                                                                        00260000
       01  PC-PROGRAM-CONSTANTS.                                        00270000
           05  PC-PROGRAM-NAME         PIC  X(08)    VALUE 'MLKUT229'.  00290001
      *                                                                 00300000
       01  PS-PROGRAM-SWITCHES.                                         00310000
           05  PS-EOF-DTL-LDR-FILE-SW       PIC X(01)     VALUE 'N'.    00320000
               88  PS-EOF-DTL-LDR-FILE                    VALUE 'Y'.    00330000
           05  PS-PURCH-AP-TRANS-CDE        PIC  X(2)     VALUE SPACE.  00331000
               88  PS-AP-RETURN-TO-VENDOR      VALUES '20' '21' '22'    00332000
                                                      '55' '54' '0A'.   00333000
      *                                                                 00400000
       01  PROGRAM-VARIABLES.                                           00410000
           05  PV-SUB                    PIC 9(04)  VALUE ZEROES.       00420000
           05  PV-PARAGRAPH-NAME         PIC  X(30) VALUE SPACES.       00430000
           05  PV-OPERATION-ATTEMPTED    PIC  X(50) VALUE SPACES.       00440000
      *                                                                 00450000
       01  PA-PROGRAM-ACCUMULATORS.                                     00460000
           05  PA-RECORD-COUNTS.                                        00470000
               10  PA-INPUT-COUNT        PIC  9(09)  VALUE ZEROES.      00480000
               10  PA-OUTPUT-COUNT       PIC  9(09)  VALUE ZEROES.      00490000
      *                                                                 00510000
      ******************************************************************00590000
      * MLRD254 - DETAIL LEDGER TRANSACTIONS                            00600000
      ******************************************************************00610000
           COPY MLRD254.                                                00620006
      *                                                                 00630000
                                                                        00950000
      *-------------------*                                             00960000
       PROCEDURE DIVISION.                                              00970000
      *-------------------*                                             00980000
                                                                        00990000
       0000-MLKUT229.                                                   01000001
                                                                        01010000
           PERFORM 1000-INITIALIZATION.                                 01020000
      *                                                                 01030000
           PERFORM 2000-PROCESS-INPUT                                   01040000
                UNTIL PS-EOF-DTL-LDR-FILE.                              01050000
      *                                                                 01060000
           PERFORM 8000-EOJ-ROUTINE.                                    01070000
                                                                        01080000
           STOP RUN.                                                    01090000
                                                                        01100000
      ******************************************************************01110000
      * OPEN FILES, READ FIRST INPUT RECORD                             01120000
      ******************************************************************01130000
      *                                                                 01140000
       1000-INITIALIZATION.                                             01150000
      *                                                                 01160000
           OPEN INPUT DTL-LEDGER-FILE-IN.                               01170000
                                                                        01180000
           OPEN OUTPUT DTL-LEDGER-FILE-OUT.                             01190000
                                                                        01200000
           PERFORM 4000-READ-DTL-LDR-FILE.                              01230000
      *                                                                 01240000
      ******************************************************************01570000
      * PROCESS THE INPUT AUDIT FILE                                    01580000
      ******************************************************************01590000
       2000-PROCESS-INPUT.                                              01600000
      *                                                                 01610000
           PERFORM 5000-WRITE-DTL-LDR-FILE.                             01640000
                                                                        01650000
           PERFORM 4000-READ-DTL-LDR-FILE.                              01660000
      *                                                                 01670000
      ******************************************************************01850000
      * READS THE CONDENSED FILE INTO MLRD254 LAYOUT                    01860000
      ******************************************************************01870000
       4000-READ-DTL-LDR-FILE.                                          01880000
           READ DTL-LEDGER-FILE-IN INTO ML254-UPDATE-REC                01890000
              AT END                                                    01900000
                MOVE 'Y' TO PS-EOF-DTL-LDR-FILE-SW.                     01910000
                                                                        01920000
           IF NOT PS-EOF-DTL-LDR-FILE                                   01921000
               ADD 1                    TO PA-INPUT-COUNT               01930000
           END-IF.                                                      01931000
      *                                                                 01940000
      ******************************************************************01950000
      * WRITES THE CONDENSED FILE FROM THE MLRD254 LAYOUT               01960000
      ******************************************************************01970000
       5000-WRITE-DTL-LDR-FILE.                                         01980000
                                                                        01981000
           IF ML254-AP-TRANS-CDE = SPACES                               02001001
               DISPLAY 'AP TRANS CODE SPACES'                           02001101
               DISPLAY 'DEPT_NBR         : ' ML254-DEPT-NBR             02001200
               DISPLAY 'LBL_SEQ_NBR      : ' ML254-LBL-SEQ-NBR          02001300
               DISPLAY 'ENT_ID           : ' ML254-ENT-ID               02001400
               DISPLAY 'ML_LO_MDSE_LVL_ID: ' ML254-ML-LWST-ID           02001500
               DISPLAY 'SUB_CL_NBR       : ' ML254-SUB-CL-NBR           02001600
               DISPLAY 'LOC_NBR          : ' ML254-LOC-NBR              02001700
               DISPLAY '                   '                            02001800
           END-IF.                                                      02001900
                                                                        02003000
           MOVE ML254-AP-TRANS-CDE        TO PS-PURCH-AP-TRANS-CDE.     02003102
                                                                        02004000
           IF PS-AP-RETURN-TO-VENDOR                                    02014201
               MOVE ML254-PADJ-RTL-AMT                                  02014301
                       TO ML254-PADJ-RTV-RTL-AMT                        02014401
               MOVE ML254-PADJ-DISC-COST-AMT                            02014501
                       TO ML254-PADJ-RTV-COST-AMT                       02014601
               ADD ML254-PADJ-GRO-COST-AMT                              02014701
                         TO ML254-PADJ-RTV-COST-AMT                     02014801
           END-IF.                                                      02017501
                                                                        02017700
           IF ML254-AP-TRANS-CDE IS EQUAL TO '21' OR '22'               02017803
               MOVE ML254-PADJ-GRO-COST-AMT TO ML254-RTV-RTL-AMT        02017904
           END-IF.                                                      02018003
                                                                        02018103
           WRITE DTL-LEDGER-OUT-REC FROM ML254-UPDATE-REC.              02018200
                                                                        02018300
           ADD 1                        TO PA-OUTPUT-COUNT.             02019000
      *                                                                 02020000
      ******************************************************************02030000
      *  DISPLAY FINAL COUNTS , CLOSE INPUT FILE                       *02040005
      ******************************************************************02050000
       8000-EOJ-ROUTINE.                                                02060000
                                                                        02070000
           DISPLAY SPACES.                                              02080000
           DISPLAY 'MLKUT229 - ASSIGN RTV AMOUNTS'.                     02081001
           DISPLAY 'INPUT RECORDS PROCESSED  ', PA-INPUT-COUNT.         02090000
           DISPLAY 'OUTPUT RECORDS PROCESSED ', PA-OUTPUT-COUNT.        02110000
           DISPLAY SPACES.                                              02120000
      *                                                                 02130000
           CLOSE DTL-LEDGER-FILE-IN                                     02140000
                 DTL-LEDGER-FILE-OUT.                                   02150000
      *                                                                 02160000
