000010 IDENTIFICATION DIVISION.                                                 
000020                                                                          
000030 PROGRAM-ID.    MLKUT100.                                                 
000040 AUTHOR.        TESS BESTE.                                               
000050 INSTALLATION.  KOHLS DEPARTMENT STORES.                                  
000060 DATE-WRITTEN.  05-15-98.                                                 
000070 DATE-COMPILED.                                                           
000080                                                                          
000090******************************************************************        
000100* ACCUMULATE AMOUNTS ON FILE IN MLRD100 FORMAT.                           
000110******************************************************************        
000120                                                                          
000130 ENVIRONMENT DIVISION.                                                    
000140                                                                          
000150 CONFIGURATION SECTION.                                                   
000160                                                                          
000170 SOURCE-COMPUTER.    IBM-3090.                                            
000180 OBJECT-COMPUTER.    IBM-3090.                                            
000190                                                                          
000200                                                                          
000210 INPUT-OUTPUT SECTION.                                                    
000220                                                                          
000230 FILE-CONTROL.                                                            
000240     SELECT INPUT-FILE                                                    
000250         ASSIGN TO INP01.                                                 
000260                                                                          
000270                                                                          
000280                                                                          
000290 DATA DIVISION.                                                           
000300                                                                          
000310 FILE SECTION.                                                            
000320                                                                          
000330 FD  INPUT-FILE                                                           
000340     LABEL RECORDS ARE STANDARD                                           
000350     BLOCK CONTAINS 0 RECORDS                                             
000360     RECORDING  MODE IS F.                                                
000370**1  INPUT-RECORD                PIC X(150).                              
000371     COPY MLRD100.                                                        
000380                                                                          
000390 WORKING-STORAGE SECTION.                                                 
000400                                                                          
000410******************************************************************        
000420* INPUT RECORD LAYOUT                                                     
000430******************************************************************        
000440                                                                          
000450**OPY MLRD100.                                                            
000460                                                                          
000470 01  PS-PROGRAM-SWITCHES.                                                 
000480     05  PS-END-OF-INPUT-FILE-SW    PIC X            VALUE 'N'.           
000490         88  PS-END-OF-INPUT-FILE                    VALUE 'Y'.           
000500         88  PS-NOT-END-OF-INPUT-FILE                VALUE 'N'.           
000510                                                                          
000520 01  PV-PROGRAM-VARIABLES.                                                
000541     05 PV-TOT-SLS-RTL-AMT          PIC S9(13)V99 COMP-3 VALUE +0.        
000542     05 PV-TOT-MKDN-RTL-AMT         PIC S9(13)V99 COMP-3 VALUE +0.        
000543     05 PV-TOT-MKUP-RTL-AMT         PIC S9(13)V99 COMP-3 VALUE +0.        
000544     05 PV-TOT-XFER-IN-RTL-AMT      PIC S9(13)V99 COMP-3 VALUE +0.        
000545     05 PV-TOT-XFER-OUT-RTL-AMT     PIC S9(13)V99 COMP-3 VALUE +0.        
000546     05 PV-TOT-RCPT-RTL-AMT         PIC S9(13)V99 COMP-3 VALUE +0.        
000548     05 PV-TOT-RCPT-FRGT-COST-AMT   PIC S9(13)V99 COMP-3 VALUE +0.        
000550     05 PV-TOT-RCPT-NET-COST-AMT    PIC S9(13)V99 COMP-3 VALUE +0.        
000551     05 PV-TOT-PADJ-RTL-AMT         PIC S9(13)V99 COMP-3 VALUE +0.        
000553     05 PV-TOT-PADJ-FRGT-COST-AMT   PIC S9(13)V99 COMP-3 VALUE +0.        
000555     05 PV-TOT-PADJ-NET-COST-AMT    PIC S9(13)V99 COMP-3 VALUE +0.        
000556     05 PV-TOT-INV-ADJ-RTL-AMT      PIC S9(13)V99 COMP-3 VALUE +0.        
000557                                                                          
000558     05  PV-DISPLAY-AMT             PIC Z,ZZZ,ZZZ,ZZZ,ZZZ.99-.            
000560                                                                          
000570 PROCEDURE DIVISION.                                                      
000580                                                                          
000590 A100-PROGRAM-MAINLINE.                                                   
000600                                                                          
000610     OPEN INPUT INPUT-FILE.                                               
000620     READ INPUT-FILE NEXT                                                 
000630         AT END SET PS-END-OF-INPUT-FILE TO TRUE.                         
000640                                                                          
000650     PERFORM UNTIL PS-END-OF-INPUT-FILE                                   
000651         ADD ML100-SLS-RTL-AMT        TO PV-TOT-SLS-RTL-AMT               
000653         ADD ML100-MKDN-RTL-AMT       TO PV-TOT-MKDN-RTL-AMT              
000655         ADD ML100-MKUP-RTL-AMT       TO PV-TOT-MKUP-RTL-AMT              
000657         ADD ML100-XFER-IN-RTL-AMT    TO PV-TOT-XFER-IN-RTL-AMT           
000659         ADD ML100-XFER-OUT-RTL-AMT   TO PV-TOT-XFER-OUT-RTL-AMT          
000661         ADD ML100-RCPT-RTL-AMT       TO PV-TOT-RCPT-RTL-AMT              
000665         ADD ML100-RCPT-FRGT-COST-AMT TO PV-TOT-RCPT-FRGT-COST-AMT        
000669         ADD ML100-RCPT-NET-COST-AMT  TO PV-TOT-RCPT-NET-COST-AMT         
000671         ADD ML100-PADJ-RTL-AMT       TO PV-TOT-PADJ-RTL-AMT              
000675         ADD ML100-PADJ-FRGT-COST-AMT TO PV-TOT-PADJ-FRGT-COST-AMT        
000679         ADD ML100-PADJ-NET-COST-AMT  TO PV-TOT-PADJ-NET-COST-AMT         
000681         ADD ML100-INV-ADJ-RTL-AMT    TO PV-TOT-INV-ADJ-RTL-AMT           
000683         READ INPUT-FILE NEXT                                             
000684             AT END SET PS-END-OF-INPUT-FILE TO TRUE                      
000690         END-READ                                                         
000700     END-PERFORM.                                                         
000710                                                                          
000720     MOVE PV-TOT-SLS-RTL-AMT          TO PV-DISPLAY-AMT.                  
000721     DISPLAY 'SLS-RTL-AMT:             ' PV-DISPLAY-AMT.                  
000730     MOVE PV-TOT-MKDN-RTL-AMT         TO PV-DISPLAY-AMT.                  
000731     DISPLAY 'MKDN-RTL-AMT:            ' PV-DISPLAY-AMT.                  
000732     MOVE PV-TOT-MKUP-RTL-AMT         TO PV-DISPLAY-AMT.                  
000733     DISPLAY 'MKUP-RTL-AMT:            ' PV-DISPLAY-AMT.                  
000734     MOVE PV-TOT-XFER-IN-RTL-AMT      TO PV-DISPLAY-AMT.                  
000735     DISPLAY 'XFER-IN-RTL-AMT:         ' PV-DISPLAY-AMT.                  
000736     MOVE PV-TOT-XFER-OUT-RTL-AMT     TO PV-DISPLAY-AMT.                  
000737     DISPLAY 'XFER-OUT-RTL-AMT:        ' PV-DISPLAY-AMT.                  
000738     MOVE PV-TOT-RCPT-RTL-AMT         TO PV-DISPLAY-AMT.                  
000739     DISPLAY 'RCPT-RTL-AMT:            ' PV-DISPLAY-AMT.                  
000742     MOVE PV-TOT-RCPT-FRGT-COST-AMT   TO PV-DISPLAY-AMT.                  
000743     DISPLAY 'RCPT-FRGT-COST-AMT:      ' PV-DISPLAY-AMT.                  
000746     MOVE PV-TOT-RCPT-NET-COST-AMT    TO PV-DISPLAY-AMT.                  
000747     DISPLAY 'RCPT-NET-COST-AMT:       ' PV-DISPLAY-AMT.                  
000748     MOVE PV-TOT-PADJ-RTL-AMT         TO PV-DISPLAY-AMT.                  
000749     DISPLAY 'PADJ-RTL-AMT:            ' PV-DISPLAY-AMT.                  
000752     MOVE PV-TOT-PADJ-FRGT-COST-AMT   TO PV-DISPLAY-AMT.                  
000753     DISPLAY 'PADJ-FRGT-COST-AMT:      ' PV-DISPLAY-AMT.                  
000756     MOVE PV-TOT-PADJ-NET-COST-AMT    TO PV-DISPLAY-AMT.                  
000757     DISPLAY 'PADJ-NET-COST-AMT:       ' PV-DISPLAY-AMT.                  
000758     MOVE PV-TOT-INV-ADJ-RTL-AMT      TO PV-DISPLAY-AMT.                  
000759     DISPLAY 'INV-ADJ-RTL-AMT:         ' PV-DISPLAY-AMT.                  
000760                                                                          
000761     CLOSE INPUT-FILE.                                                    
000762                                                                          
000770     STOP RUN.                                                            
