       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID.    MLKUT454.                                         00020000
       AUTHOR.        JULIE SEIDLER.                                    00030000
       INSTALLATION.  KOHLS DEPARTMENT STORES.                          00040000
       DATE-WRITTEN.  02-10-2000.                                       00050000
       DATE-COMPILED.                                                   00060000
      ******************************************************************00070000
      *                                                                 00080000
      * MLKUT454 -                                                      00090000
      *                                                                 00100000
      * THIS PROGRAM WILL CREATE THE EXTRACT FOR THE RECALC PROGRAM     00110000
      * ON TABLE TMNMCLS                                                00120000
      *                                                                 00130000
      ******************************************************************00140000
      * WR/PITS#  DATE      DESCRIPTION                                *00140103
      * -------- --------   -----------------------------------------  *00140203
      * W31475  06/01/2009  COGNIZANT                                  *00141004
      *                     MODIFIED CURSOR DECLARATION FOR MULTI ROW  *00142003
      *                     FETCH AS PART OF ML BATCH PERF TUNE PRJ    *00143003
      ******************************************************************00144003
      *                                                                 00150000
       ENVIRONMENT DIVISION.                                            00160000
      *                                                                 00170000
       CONFIGURATION SECTION.                                           00180000
      *                                                                 00190000
       SOURCE-COMPUTER.        IBM-3090.                                00200000
       OBJECT-COMPUTER.        IBM-3090.                                00210000
      *                                                                 00220000
       INPUT-OUTPUT SECTION.                                            00230000
       FILE-CONTROL.                                                    00240000
                                                                        00250000
           SELECT MNMCLS-EXTR-FILE                                      00260000
               ASSIGN TO OUT01.                                         00270000
                                                                        00280000
      ******************************************************************00290000
       DATA DIVISION.                                                   00300000
      ******************************************************************00310000
                                                                        00320000
       FILE SECTION.                                                    00330000
                                                                        00340000
       FD  MNMCLS-EXTR-FILE                                             00350000
           RECORDING MODE IS F                                          00360000
           LABEL RECORDS ARE STANDARD                                   00370000
           BLOCK CONTAINS 0 RECORDS.                                    00380000
                                                                        00390000
       01  MNMCLS-EXTR-REC             PIC X(18).                       00400000
                                                                        00410000
      *                                                                 00420000
      ******************************************************************00430000
       WORKING-STORAGE SECTION.                                         00440000
      ******************************************************************00450000
                                                                        00460000
W31475 01  ROW-ID                      PIC S9(04) COMP VALUE 0.         00461004
  |    01  HOST-VARIABLES.                                              00462004
  |        05  HV-MNMCLS-DEPT-NBR      PIC X(03)   VALUE SPACES         00463004
  |                                    OCCURS 100  TIMES.               00464004
  |        05  HV-MNMCLS-MAJ-CL-NBR    PIC X(02)   VALUE SPACES         00465004
  |                                    OCCURS 100  TIMES.               00466004
  |        05  HV-MNMCLS-STR-NBR       PIC S9(4) COMP VALUE 0           00467004
W31475                                 OCCURS 100  TIMES.               00468004
                                                                        00469003
       01  PS-PROGRAM-SWITCHES.                                         00470000
           05  PS-TMNMCLS-DONE         PIC X       VALUE 'N'.           00480000
               88  PS-TMNMCLS-IS-DONE              VALUE 'Y'.           00490000
               88  PS-TMNMCLS-IS-NOT-DONE          VALUE 'N'.           00500000
                                                                        00510000
       01  PA-PROGRAM-ACCUMULATORS                 COMP-3.              00520000
           05  PA-TMNMCLS-ROWS-FETCHED PIC S9(13)  VALUE ZERO.          00530000
           05  PA-OUTPUT-RECS-WRITTEN  PIC S9(13)  VALUE ZERO.          00540000
                                                                        00550000
       01  CD-COUNTER-DISPLAY.                                          00560000
           05  CD-COUNT-HOLD1          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.           00570000
                                                                        00580000
       01 ABEND-AREAS.                                                  00590000
           05 ABEND-CODE               PIC S9(04)  VALUE ZERO           00600000
                                                   COMP SYNC.           00610000
               88  AC-BAD-DATA                     VALUE +4003.         00620000
               88  AC-DB2-ERROR                    VALUE +4013.         00630000
           05  AA-ABEND-LIT            PIC X(40)   VALUE                00640000
                 '*****       ABEND'.                                   00650000
           05  AA-PROGRAM-LIT          PIC X(40)   VALUE                00660000
                   '*****   PROGRAM: MLKUT454'.                         00670000
           05  AA-PARAGRAPH-LIT.                                        00680000
               10  FILLER              PIC X(17)   VALUE                00690000
                   '***** PARAGRAPH: '.                                 00700000
               10  AA-PARAGRAPH-NAME   PIC X(35)   VALUE SPACES.        00710000
           05  AA-MESSAGE-LINE.                                         00720000
               10  FILLER              PIC X(06)   VALUE '*****'.       00730000
               10  AA-MESSAGE          PIC X(127)  VALUE SPACES.        00740000
           05  AA-DB2-ERROR-LIT        PIC X(40)   VALUE                00750000
                   '*****    DB2 ERROR'.                                00760000
           05  AA-DB2-OPERATION-LIT.                                    00770000
               10  FILLER              PIC X(17)   VALUE                00780000
                   '***** OPERATION: '.                                 00790000
               10  AA-DB2-OPERATION.                                    00800000
                   15  AA-DB2-OP-1     PIC X(25)   VALUE SPACES.        00810000
                   15  AA-DB2-OP-2     PIC X(25)   VALUE SPACES.        00820000
           05  AA-DB2-TABLE-1          PIC X(08)   VALUE SPACES.        00830000
           05  AA-DB2-TABLE-2          PIC X(08)   VALUE SPACES.        00840000
           05  AA-DB2-TABLE-3          PIC X(08)   VALUE SPACES.        00850000
           05  AA-DB2-TABLE-4          PIC X(08)   VALUE SPACES.        00860000
                                                                        00870000
      *** TMNMCLS EXTRACT FILE                                          00880000
       01  EXTR-RECORD.                                                 00890000
           05  EXTR-DEPT-NBR    PIC X(03).                              00900000
           05  EXTR-MAJ-CL-NBR  PIC X(02).                              00910000
JS0200     05  EXTR-STR-NBR     PIC S9(04) COMP.                        00911000
       EJECT                                                            00920000
                                                                        00930000
      ******************************************************************00940000
      *  DB2 ERROR MESSAGES FORMAT AREA.                                00950000
      ******************************************************************00960000
           COPY DPWS004.                                                00970000
                                                                        00980000
      ******************************************************************00990000
      *  DB2 ERRORS                                                     01000000
      ******************************************************************01010000
           COPY SQLCA2.                                                 01020000
                                                                        01030000
      ******************************************************************01040000
      *  DB2 COMMUNICATION AREA                                         01050000
      ******************************************************************01060000
           EXEC SQL                                                     01070000
                INCLUDE SQLCA                                           01080000
           END-EXEC.                                                    01090000
                                                                        01100000
      ******************************************************************01110000
      *  DB2 TMNMCLS TABLE LAYOUT                                       01120000
      ******************************************************************01130000
           EXEC SQL                                                     01140000
                INCLUDE TMNMCLS                                         01150000
           END-EXEC.                                                    01160000
                                                                        01170000
      ****************************************************              01170100
      * M/L DATE TABLE AND CURRENT OPEN FISCAL DATE INFO *              01170200
      ****************************************************              01170300
           EXEC SQL                                                     01170400
               INCLUDE TDTATTR                                          01170500
           END-EXEC.                                                    01171000
                                                                        01180000
      ****************************************************              01240100
      * M/L DATE CONTROL INFO                            *              01240200
      ****************************************************              01240300
           EXEC SQL                                                     01240400
               INCLUDE TMLCNTL                                          01240500
           END-EXEC.                                                    01240600
                                                                        01240700
      ******************************************************************01250000
      *  DB2 TMNMCLS CURSOR                                             01260000
      ******************************************************************01270000
           EXEC SQL                                                     01280000
W31475         DECLARE TMNMCLS_CURSOR CURSOR                            01290004
W31475         WITH ROWSET POSITIONING FOR                              01291004
               SELECT DISTINCT DEPT_NBR                                 01300000
                              ,MAJ_CL_NBR                               01310000
                              ,STR_NBR                                  01311000
               FROM TMNMCLS                                             01320000
                   ,TMLCNTL                                             01331000
               WHERE (FSCL_MN_END_DTE BETWEEN                           01340000
                                   OPN_FSCL_MN_DTE                      01350000
                               AND MXPSTG_FSCL_MN_DTE) OR               01360000
                    ((FSCL_MN_END_DTE BETWEEN                           01361000
                      :DTATTR-PFM-END-DTE AND                           01362000
                      MXPSTG_FSCL_MN_DTE) AND                           01363000
                       (END_INV_RTL_AMT  <> 0  OR                       01363100
                        END_INV_COST_AMT <> 0))                         01364000
           END-EXEC.                                                    01380000
                                                                        01390000
       EJECT                                                            01400000
                                                                        01410000
      ******************************************************************01420000
       PROCEDURE DIVISION.                                              01430000
      ******************************************************************01440000
                                                                        01450000
      ******************************************************************01460000
       A000-MAIN-MODULE.                                                01470000
      ******************************************************************01480000
      *                                                                 01490000
           PERFORM B000-INITIALIZE.                                     01500000
                                                                        01510000
           PERFORM B100-PROCESS-DATA.                                   01520000
                                                                        01530000
           PERFORM B900-EOJ-ROUTINE.                                    01540000
                                                                        01550000
           STOP RUN.                                                    01560000
                                                                        01570000
       EJECT                                                            01580000
                                                                        01590000
      ******************************************************************01600000
       B000-INITIALIZE.                                                 01610000
      ******************************************************************01620000
      *                                                                 01630000
           OPEN OUTPUT MNMCLS-EXTR-FILE.                                01640000
           PERFORM 7100-SELECT-DB2-DATES.                               01641000
                                                                        01650000
                                                                        01660000
       EJECT                                                            01670000
                                                                        01680000
      ******************************************************************01690000
       B100-PROCESS-DATA.                                               01700000
      ******************************************************************01710000
      *                                                                 01720000
           PERFORM Z210-OPEN-CURSOR-TMNMCLS.                            01730000
                                                                        01740000
           PERFORM Z220-FETCH-TMNMCLS.                                  01750000
                                                                        01760000
           PERFORM                                                      01770000
             UNTIL PS-TMNMCLS-IS-DONE                                   01780000
W31475         PERFORM VARYING ROW-ID FROM 1 BY 1                       01781004
  |            UNTIL ROW-ID > SQLERRD (3)                               01782004
  |                 PERFORM C100-WRITE-EXTRACT                          01783004
  |            END-PERFORM                                              01784004
W31475*        PERFORM C100-WRITE-EXTRACT                               01790004
               PERFORM Z220-FETCH-TMNMCLS                               01800000
           END-PERFORM.                                                 01810000
                                                                        01820000
           PERFORM Z230-CLOSE-CURSOR-TMNMCLS.                           01830000
                                                                        01840000
       EJECT                                                            01850000
                                                                        01860000
      ******************************************************************01870000
       C100-WRITE-EXTRACT.                                              01880000
      ******************************************************************01890000
      *                                                                 01900000
W31475*    MOVE MNMCLS-DEPT-NBR        TO EXTR-DEPT-NBR.                01910004
  |   *    MOVE MNMCLS-MAJ-CL-NBR      TO EXTR-MAJ-CL-NBR.              01920004
  |   *    MOVE MNMCLS-STR-NBR         TO EXTR-STR-NBR.                 01921004
  |        MOVE HV-MNMCLS-DEPT-NBR(ROW-ID)   TO EXTR-DEPT-NBR.          01922004
  |        MOVE HV-MNMCLS-MAJ-CL-NBR(ROW-ID) TO EXTR-MAJ-CL-NBR.        01923004
W31475     MOVE HV-MNMCLS-STR-NBR(ROW-ID)    TO EXTR-STR-NBR.           01924004
           WRITE MNMCLS-EXTR-REC                                        01930000
               FROM EXTR-RECORD.                                        01940000
           ADD 1                       TO PA-OUTPUT-RECS-WRITTEN.       01950000
                                                                        01960000
       EJECT                                                            01970000
                                                                        01980000
      ******************************************************************01990000
       B900-EOJ-ROUTINE.                                                02000000
      ******************************************************************02010000
      *                                                                 02020000
           DISPLAY ' '.                                                 02030000
           DISPLAY '  PROGRAM MLKUT454 PROCESSING SUMMARY'.             02040000
           DISPLAY '  -----------------------------------'.             02050000
           DISPLAY ' '.                                                 02060000
      *                                                                 02070000
           MOVE PA-TMNMCLS-ROWS-FETCHED TO CD-COUNT-HOLD1.              02080000
           DISPLAY 'TMNMCLS ROWS FETCHED =      ' CD-COUNT-HOLD1.       02090000
      *                                                                 02100000
           MOVE PA-OUTPUT-RECS-WRITTEN TO CD-COUNT-HOLD1.               02110000
           DISPLAY 'EXTRACT RECORDS WRITTEN =   ' CD-COUNT-HOLD1.       02120000
      *                                                                 02130000
           DISPLAY ' '.                                                 02140000
                                                                        02150000
           CLOSE MNMCLS-EXTR-FILE.                                      02160000
                                                                        02170000
       EJECT                                                            02180000
                                                                        02190000
       EJECT                                                            02200000
                                                                        02210000
      ******************************************************************02220000
       Z210-OPEN-CURSOR-TMNMCLS.                                        02230000
      ******************************************************************02240000
      *                                                                 02250000
           EXEC SQL                                                     02260000
               OPEN TMNMCLS_CURSOR                                      02270000
           END-EXEC.                                                    02280000
                                                                        02290000
           EVALUATE TRUE                                                02300000
               WHEN SQLCODE < 0                                         02310000
                   MOVE 'Z210-OPEN-CURSOR-TMNMCLS'                      02320000
                                       TO AA-PARAGRAPH-NAME             02330000
                   MOVE 'TMNMCLS TABLE ERROR'                           02340000
                                       TO AA-MESSAGE                    02350000
                   MOVE 'OPEN CURSOR'  TO AA-DB2-OPERATION              02360000
                   PERFORM Z998-SQL-ERROR                               02370000
               WHEN SQLCODE > 0                                         02380000
               WHEN SQLWARN0 NOT = SPACES                               02390000
                   MOVE 'Z210-OPEN-CURSOR-TMNMCLS'                      02400000
                                       TO AA-PARAGRAPH-NAME             02410000
                   MOVE 'TMNMCLS TABLE WARNING'                         02420000
                                       TO AA-MESSAGE                    02430000
                   MOVE 'OPEN CURSOR'  TO AA-DB2-OPERATION              02440000
                   PERFORM Z998-SQL-ERROR                               02450000
           END-EVALUATE.                                                02460000
                                                                        02470000
       EJECT                                                            02480000
                                                                        02490000
      ******************************************************************02500000
       Z220-FETCH-TMNMCLS.                                              02510000
      ******************************************************************02520000
      *                                                                 02530000
W31475*    EXEC SQL                                                     02540004
  |   *        FETCH TMNMCLS_CURSOR                                     02550004
  |   *         INTO :MNMCLS-DEPT-NBR                                   02560004
  |   *             ,:MNMCLS-MAJ-CL-NBR                                 02570004
  |   *             ,:MNMCLS-STR-NBR                                    02580004
  |   *    END-EXEC.                                                    02590004
  |        EXEC SQL                                                     02591004
  |            FETCH NEXT ROWSET FROM TMNMCLS_CURSOR FOR 100 ROWS       02592004
  |             INTO :HV-MNMCLS-DEPT-NBR                                02593004
  |                 ,:HV-MNMCLS-MAJ-CL-NBR                              02594004
  |                 ,:HV-MNMCLS-STR-NBR                                 02595004
W31475     END-EXEC.                                                    02596004
                                                                        02600000
           EVALUATE TRUE                                                02610000
               WHEN SQLCODE = 0                                         02620000
W31475*            ADD +1              TO PA-TMNMCLS-ROWS-FETCHED       02630004
W31475             ADD +100            TO PA-TMNMCLS-ROWS-FETCHED       02631004
               WHEN SQLCODE = +100                                      02640000
                   MOVE 'Y'            TO PS-TMNMCLS-DONE               02640103
W31475             ADD SQLERRD (3)     TO PA-TMNMCLS-ROWS-FETCHED       02641004
  |                PERFORM VARYING ROW-ID FROM 1 BY 1                   02642004
  |                UNTIL ROW-ID > SQLERRD (3)                           02643004
  |                     PERFORM C100-WRITE-EXTRACT                      02644004
W31475             END-PERFORM                                          02645004
               WHEN SQLCODE < 0                                         02660000
                   MOVE 'Z220-FETCH-TMNMCLS'                            02670000
                                       TO AA-PARAGRAPH-NAME             02680000
                   MOVE 'TMNMCLS TABLE ERROR'                           02690000
                                       TO AA-MESSAGE                    02700000
                   MOVE 'FETCH'        TO AA-DB2-OPERATION              02710000
                   PERFORM Z998-SQL-ERROR                               02720000
               WHEN ((SQLCODE > 0) AND (SQLCODE NOT = +100))            02730000
               WHEN SQLWARN0 NOT = SPACES                               02740000
                   MOVE 'Z220-FETCH-TMNMCLS'                            02750000
                                       TO AA-PARAGRAPH-NAME             02760000
                   MOVE 'TMNMCLS TABLE WARNING'                         02770000
                                       TO AA-MESSAGE                    02780000
                   MOVE 'FETCH'        TO AA-DB2-OPERATION              02790000
                   PERFORM Z998-SQL-ERROR                               02800000
           END-EVALUATE.                                                02810000
                                                                        02820000
       EJECT                                                            02830000
                                                                        02840000
      ******************************************************************02850000
       Z230-CLOSE-CURSOR-TMNMCLS.                                       02860000
      ******************************************************************02870000
      *                                                                 02880000
           EXEC SQL                                                     02890000
               CLOSE TMNMCLS_CURSOR                                     02900000
           END-EXEC.                                                    02910000
                                                                        02920000
           EVALUATE TRUE                                                02930000
               WHEN SQLCODE < 0                                         02940000
                   MOVE 'Z230-CLOSE-CURSOR-TMNMCLS'                     02950000
                                       TO AA-PARAGRAPH-NAME             02960000
                   MOVE 'TMNMCLS TABLE ERROR'                           02970000
                                       TO AA-MESSAGE                    02980000
                   MOVE 'CLOSE CURSOR' TO AA-DB2-OPERATION              02990000
                   PERFORM Z998-SQL-ERROR                               03000000
               WHEN SQLCODE > 0                                         03010000
               WHEN SQLWARN0 NOT = SPACES                               03020000
                   MOVE 'Z230-CLOSE-CURSOR-TMNMCLS'                     03030000
                                       TO AA-PARAGRAPH-NAME             03040000
                   MOVE 'TMNMCLS TABLE WARNING'                         03050000
                                       TO AA-MESSAGE                    03060000
                   MOVE 'CLOSE CURSOR' TO AA-DB2-OPERATION              03070000
                   PERFORM Z998-SQL-ERROR                               03080000
           END-EVALUATE.                                                03090000
                                                                        03100000
       EJECT                                                            03110000
                                                                        03120000
       7100-SELECT-DB2-DATES.                                           03120100
      *                                                                 03120200
           EXEC SQL                                                     03120300
               SELECT  PFM_END_DTE                                      03120500
                INTO  :DTATTR-PFM-END-DTE                               03121100
                FROM TDTATTR                                            03121600
                    ,TMLCNTL                                            03121700
                WHERE KY_DTE  = OPN_FSCL_MN_DTE                         03122000
           END-EXEC.                                                    03122100
      *                                                                 03122200
           EVALUATE SQLCODE                                             03122300
               WHEN 0                                                   03122400
                   DISPLAY 'DTATTR-PFM-END-DTE: '                       03122500
                            DTATTR-PFM-END-DTE                          03122600
      *        WHEN +100                                                03123900
      *            DISPLAY 'NO ROWS QUALIFY FOR RECALCULATION'          03124000
               WHEN OTHER                                               03124100
                  MOVE '7100-SELECT-DB2-DATES'                          03124200
                                       TO AA-PARAGRAPH-NAME             03124300
                   PERFORM Z998-SQL-ERROR                               03124500
           END-EVALUATE.                                                03124600
      *                                                                 03124700
      *                                                                 03125000
      ******************************************************************03130000
       Z998-SQL-ERROR.                                                  03140000
      ******************************************************************03150000
      *                                                                 03160000
                                                                        03170000
           CLOSE MNMCLS-EXTR-FILE.                                      03180000
                                                                        03190000
           DISPLAY AA-ABEND-LIT.                                        03200000
           DISPLAY AA-DB2-ERROR-LIT.                                    03210000
           DISPLAY AA-PROGRAM-LIT.                                      03220000
           DISPLAY AA-PARAGRAPH-LIT.                                    03230000
           DISPLAY AA-MESSAGE-LINE.                                     03240000
           DISPLAY AA-DB2-OPERATION-LIT.                                03250000
           SET AC-DB2-ERROR TO TRUE.                                    03260000
           MOVE +4013                  TO ABEND-CODE.                   03270000
                                                                        03280000
           COPY DPPD004.                                                03290000
           CALL 'ILBOABN0' USING ABEND-CODE.                            03300000
                                                                        03310000
