000100 IDENTIFICATION DIVISION.                                         00010099
000200 PROGRAM-ID.    MLKUT615.                                         00020099
000300 AUTHOR.        ERIN SEARL.                                       00030099
000400 INSTALLATION.  KOHLS DEPARTMENT STORES.                          00040099
000500 DATE-WRITTEN.  08-09-04.                                         00050099
000600 DATE-COMPILED.                                                   00060099
000700******************************************************************00070099
000800*                                                                 00080099
000900* MLKUT615 - CREATE THE DATA INTEGRITY EXTRACT FILE FOR           00090099
001000*            MLT_MNLY_SUM.                                        00100099
001010*                                                                 00101099
001020* THIS PROGRAM WILL TAKE THE SORTED MLT_MNLY_SUM FILE AND FORMAT  00102099
001030* THE DATA TO DATA INTEGRITY EXTRACT COPYBOOK MLRD111 AND CREATE  00103099
001060* DATA INTEGRITY EXTRACT FILE.                                    00106099
001070*                                                                 00107099
001080*CHANGE HISTORY:                                                  00108099
001090* WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00109099
001100* ------- ---------- ----------- -------------------------------- 00110099
001200* WR21764 11-26-2004 ROD JANSSEN MERCH LEDGER DETAIL LEDGER TBLS  00120099
007600* WR28582 01-24-2007 PATRICK BURKE BRAND VENDOR CHANGES           00121099
001300******************************************************************00130099
001400*                                                                 00140099
001500 ENVIRONMENT DIVISION.                                            00150099
001600*                                                                 00160099
001700 CONFIGURATION SECTION.                                           00170099
001800*                                                                 00180099
001900 SOURCE-COMPUTER.        IBM-3090.                                00190099
002000 OBJECT-COMPUTER.        IBM-3090.                                00200099
002100*                                                                 00210099
002200 INPUT-OUTPUT SECTION.                                            00220099
002300 FILE-CONTROL.                                                    00230099
002400                                                                  00240099
002500     SELECT DATA-INTEGRITY-SRT-FILE                               00250099
002600         ASSIGN TO INP01.                                         00260099
002700                                                                  00270099
002800     SELECT DATA-INTEGRITY-EXTR-FILE                              00280099
002900         ASSIGN TO OUT01.                                         00290099
003000                                                                  00300099
003100******************************************************************00310099
003200 DATA DIVISION.                                                   00320099
003300******************************************************************00330099
003400                                                                  00340099
003500 FILE SECTION.                                                    00350099
003600                                                                  00360099
003700 FD  DATA-INTEGRITY-SRT-FILE                                      00370099
003800     LABEL RECORDS ARE STANDARD                                   00380099
003900     RECORDING MODE IS F                                          00390099
004000     BLOCK CONTAINS 0 RECORDS.                                    00400099
004100 01  DATA-INTEGRITY-SRT-REC      PIC X(356).                      00410099
004200                                                                  00420099
004300 FD  DATA-INTEGRITY-EXTR-FILE                                     00430099
004400     RECORDING MODE IS F                                          00440099
004500     LABEL RECORDS ARE STANDARD                                   00450099
004600     BLOCK CONTAINS 0 RECORDS.                                    00460099
004700                                                                  00470099
004800 01  DATA-INTEGRITY-EXTR-REC     PIC X(120).                      00480099
004900                                                                  00490099
005000*                                                                 00500099
005100******************************************************************00510099
005200 WORKING-STORAGE SECTION.                                         00520099
005300******************************************************************00530099
005400                                                                  00540099
005500 01  PS-PROGRAM-SWITCHES.                                         00550099
005600     05  PS-END-OF-INPUT-SW      PIC X       VALUE 'N'.           00560099
005700         88  PS-END-OF-INPUT                 VALUE 'Y'.           00570099
005800         88  PS-END-OF-INPUT-NO              VALUE 'N'.           00580099
005900                                                                  00590099
006000 01  PV-PROGRAM-VARIABLES.                                        00600099
006100     05  PV-OPN-MONTH-FIRST-WEEK PIC X(10).                       00610099
006200     05  PV-DEPT-NBR             PIC 9(03)  VALUE ZEROS.          00620099
006210     05  PV-MAJ-CL-NBR           PIC 9(02)  VALUE ZEROS.          00621099
006220     05  PV-SUB-CL-NBR           PIC 9(02)  VALUE ZEROS.          00622099
006230     05  PV-LOC-NBR              PIC 9(04)  VALUE ZEROS.          00623099
006231     05  PV-FSCL-DTE             PIC X(10).                       00623199
006240     05  PV-FSCL-MN-END-DTE      PIC X(10).                       00624099
006250     05  PV-FSCL-MN-NBR          PIC X(02).                       00625099
006260     05  PV-PARTN-NBR            PIC S9(4)V COMP.                 00626099
006261                                                                  00626199
006262     05  PV-DKEY-NBR.                                             00626299
006263         10  PV-DKEY-WK-NBR      PIC X(02).                       00626399
006264         10  PV-DKEY-MN-NBR      PIC X(02).                       00626499
006265         10  FILLER              PIC X(11).                       00626599
006270                                                                  00627099
006280 01  PA-PROGRAM-ACCUMULATORS.                                     00628099
006290     05  PA-INPUT-FILES           PIC S9(13) VALUE ZEROS.         00629099
006300     05  PA-TDTATTR-ROWS-SELECTED PIC S9(13)  VALUE ZEROS.        00630099
006310     05  PA-OUTPUT-RECS-WRITTEN  PIC S9(13)  VALUE ZEROS.         00631099
006320                                                                  00632099
006330 01  PC-PROGRAM-CONSTANTS.                                        00633099
006340     05  PC-MAX-TBL-ROWS         PIC S9(03)  VALUE +120.          00634099
006350                                                                  00635099
006360 01  TABLE-FOR-MONTH-DATA.                                        00636099
006370     05  TABLE-MONTHEND-ENTRIES  OCCURS 450 TIMES                 00637099
006380                                 INDEXED BY MTH-IDX.              00638099
006390         10  TBL-FSCL-DTE        PIC X(10).                       00639099
006400         10  TBL-MONTHEND-DTE    PIC X(10).                       00640099
006410         10  TBL-MONTHEND-NBR    PIC X(02).                       00641099
006420                                                                  00642099
006430 01  CD-COUNTER-DISPLAY.                                          00643099
006440     05  CD-COUNT-HOLD1          PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.           00644099
006450                                                                  00645099
006460 01 ABEND-AREAS.                                                  00646099
006470     05 ABEND-CODE               PIC S9(04)  VALUE ZEROS          00647099
006480                                             COMP SYNC.           00648099
006490         88  AC-BAD-DATA                     VALUE +4003.         00649099
006500         88  AC-DB2-ERROR                    VALUE +4013.         00650099
006600     05  AA-ABEND-LIT            PIC X(40)   VALUE                00660099
006700             '*****       ABEND'.                                 00670099
006800     05  AA-PROGRAM-LIT          PIC X(40)   VALUE                00680099
006900             '*****   PROGRAM: MLKUT615'.                         00690099
007000     05  AA-PARAGRAPH-LIT.                                        00700099
007100         10  FILLER              PIC X(17)   VALUE                00710099
007200             '***** PARAGRAPH: '.                                 00720099
007300         10  AA-PARAGRAPH-NAME   PIC X(35)   VALUE SPACES.        00730099
007400     05  AA-MESSAGE-LINE.                                         00740099
007500         10  FILLER              PIC X(06)   VALUE '*****'.       00750099
007600         10  AA-MESSAGE          PIC X(127)  VALUE SPACES.        00760099
007700     05  AA-DB2-ERROR-LIT        PIC X(40)   VALUE                00770099
007800             '*****    DB2 ERROR'.                                00780099
007900     05  AA-DB2-OPERATION-LIT.                                    00790099
008000         10  FILLER              PIC X(17)   VALUE                00800099
008100             '***** OPERATION: '.                                 00810099
008200         10  AA-DB2-OPERATION.                                    00820099
008300             15  AA-DB2-OP-1     PIC X(25)   VALUE SPACES.        00830099
008400             15  AA-DB2-OP-2     PIC X(25)   VALUE SPACES.        00840099
008500     05  AA-DB2-TABLE-1          PIC X(08)   VALUE SPACES.        00850099
008600     05  AA-DB2-TABLE-2          PIC X(08)   VALUE SPACES.        00860099
008700     05  AA-DB2-TABLE-3          PIC X(08)   VALUE SPACES.        00870099
008800     05  AA-DB2-TABLE-4          PIC X(08)   VALUE SPACES.        00880099
008900                                                                  00890099
009000 EJECT                                                            00900099
009100                                                                  00910099
009200*** DATA INTEGRITY CONTROL CARD                                   00920099
009300     COPY MLRD110.                                                00930099
009400                                                                  00940099
009500                                                                  00950099
009600*** DATA INTEGRITY MLT_MNLY_SUM EXTRACT FILE                      00960099
009700     COPY MLRD111.                                                00970099
009800                                                                  00980099
009900 EJECT                                                            00990099
010000                                                                  01000099
010100******************************************************************01010099
010200*  DB2 ERROR MESSAGES FORMAT AREA.                                01020099
010300******************************************************************01030099
010400     COPY DPWS004.                                                01040099
010500                                                                  01050099
010600******************************************************************01060099
010700*  DB2 ERRORS                                                     01070099
010800******************************************************************01080099
010900     COPY SQLCA2.                                                 01090099
011000                                                                  01100099
011100******************************************************************01110099
011200*  DB2 COMMUNICATION AREA                                         01120099
011300******************************************************************01130099
011400     EXEC SQL                                                     01140099
011500          INCLUDE SQLCA                                           01150099
011600     END-EXEC.                                                    01160099
011700                                                                  01170099
011800******************************************************************01180099
011900*  M/L DETAIL TABLE - PARTITION BALANCING TABLE                   01190099
012000******************************************************************01200099
012100     EXEC SQL                                                     01210099
012200         INCLUDE MLT00002                                         01220099
012300     END-EXEC.                                                    01230099
012400*                                                                 01240099
012410******************************************************************01241099
012420*  M/L DETAIL TABLE - PARTITION CONTROL TABLE                     01242099
012430******************************************************************01243099
012440     EXEC SQL                                                     01244099
012450         INCLUDE MLT00003                                         01245099
012460     END-EXEC.                                                    01246099
012470*                                                                 01247099
012480******************************************************************01248099
012490*  DB2 MLT_MNLY_SUM TABLE LAYOUT                                  01249099
012500******************************************************************01250099
012600     EXEC SQL                                                     01260099
012700          INCLUDE MLT00004                                        01270099
012800     END-EXEC.                                                    01280099
012900*                                                                 01290099
013000******************************************************************01300099
013100*  DB2 TDTATTR TABLE LAYOUT                                       01310099
013200******************************************************************01320099
013210     EXEC SQL                                                     01321099
013220          INCLUDE TDTATTR                                         01322099
013230     END-EXEC.                                                    01323099
013231                                                                  01323199
015800******************************************************************01580099
015900 PROCEDURE DIVISION.                                              01590099
016000******************************************************************01600099
016100                                                                  01610099
016200******************************************************************01620099
016300 0000-MAINLINE-MLKUT615.                                          01630099
016400******************************************************************01640099
016500*                                                                 01650099
016600     PERFORM 1000-INITIALIZATION.                                 01660099
016700                                                                  01670099
016800     PERFORM 2000-MAIN-PROCESS.                                   01680099
016900                                                                  01690099
017000     PERFORM 8000-EOJ.                                            01700099
017100                                                                  01710099
017200     STOP RUN.                                                    01720099
017300                                                                  01730099
017400 EJECT                                                            01740099
017500                                                                  01750099
017600******************************************************************01760099
017700 1000-INITIALIZATION.                                             01770099
017800******************************************************************01780099
017900*                                                                 01790099
018000     OPEN INPUT  DATA-INTEGRITY-SRT-FILE.                         01800099
018100     OPEN OUTPUT DATA-INTEGRITY-EXTR-FILE.                        01810099
018200                                                                  01820099
018300     PERFORM 4000-READ-INPUT-FILE.                                01830099
018400                                                                  01840099
018900*    MOVE ZEROS TO MLT00004-PARTN-NBR.                            01890099
019000*    MOVE ZEROS TO MLT00004-DEPT-NBR.                             01900099
019100*    MOVE ZEROS TO MLT00004-MAJ-CL-NBR.                           01910099
019200*    MOVE ZEROS TO MLT00004-SUB-CL-NBR.                           01920099
019201*    MOVE ZEROS TO MLT00004-LOC-NBR.                              01920199
019202                                                                  01920299
019203     INITIALIZE PA-PROGRAM-ACCUMULATORS.                          01920399
019204     INITIALIZE PV-PROGRAM-VARIABLES.                             01920499
019205     INITIALIZE TABLE-FOR-MONTH-DATA.                             01920599
019208*                                                                 01920899
019209 EJECT                                                            01920999
019220******************************************************************01922099
019230 2000-MAIN-PROCESS.                                               01923099
019240******************************************************************01924099
019250*                                                                 01925099
019300     PERFORM                                                      01930099
019400       UNTIL PS-END-OF-INPUT                                      01940099
019500         PERFORM 2100-GET-MONTH-DATA                              01950099
019600         PERFORM 5000-WRITE-EXTRACT                               01960099
019700         PERFORM 4000-READ-INPUT-FILE                             01970099
019710         ADD  1           TO PA-INPUT-FILES                       01971099
019800     END-PERFORM.                                                 01980099
019900                                                                  01990099
020200 EJECT                                                            02020099
020300                                                                  02030099
020400******************************************************************02040099
020500 2100-GET-MONTH-DATA.                                             02050099
020600******************************************************************02060099
020700                                                                  02070099
020800     SET MTH-IDX                 TO 1.                            02080099
020900     SEARCH TABLE-MONTHEND-ENTRIES                                02090099
021000         AT END                                                   02100099
021100             PERFORM 7400-SELECT-TDTATTR                          02110099
021200             ADD 1               TO PA-TDTATTR-ROWS-SELECTED      02120099
021210             MOVE MLT00004-FSCL-MN-END-DTE                        02121099
021220                                 TO PV-FSCL-DTE                   02122099
021221             MOVE MLT00004-FSCL-MN-END-DTE                        02122199
021222                                 TO PV-FSCL-MN-END-DTE            02122299
021230             MOVE DTATTR-FSCL-MN-NBR                              02123099
021240                                 TO PV-FSCL-MN-NBR                02124099
021250             IF PA-TDTATTR-ROWS-SELECTED > PC-MAX-TBL-ROWS        02125099
021260                 CONTINUE                                         02126099
021270             ELSE                                                 02127099
021280                 SET MTH-IDX     TO PA-TDTATTR-ROWS-SELECTED      02128099
021290                 MOVE MLT00004-FSCL-MN-END-DTE                    02129099
021300                                 TO TBL-FSCL-DTE (MTH-IDX)        02130099
021301                 MOVE MLT00004-FSCL-MN-END-DTE                    02130199
021302                                 TO TBL-MONTHEND-DTE (MTH-IDX)    02130299
021303                 MOVE DTATTR-FSCL-MN-NBR                          02130399
021304                                 TO TBL-MONTHEND-NBR (MTH-IDX)    02130499
021305             END-IF                                               02130599
021306         WHEN TBL-FSCL-DTE   (MTH-IDX) = MLT00004-FSCL-MN-END-DTE 02130699
021307             MOVE TBL-MONTHEND-DTE (MTH-IDX)                      02130799
021308                                 TO PV-FSCL-MN-END-DTE            02130899
021309             MOVE TBL-MONTHEND-NBR (MTH-IDX)                      02130999
021310                                 TO PV-FSCL-MN-NBR                02131099
021311     END-SEARCH.                                                  02131199
021312                                                                  02131299
021313 EJECT                                                            02131399
021314                                                                  02131499
021315******************************************************************02131599
021316 4000-READ-INPUT-FILE.                                            02131699
021317******************************************************************02131799
021318*                                                                 02131899
021319     READ DATA-INTEGRITY-SRT-FILE                                 02131999
021320       INTO DCLMLT00004                                           02132099
021330         AT END                                                   02133099
021331             SET PS-END-OF-INPUT    TO TRUE.                      02133199
021500                                                                  02150099
021600 EJECT                                                            02160099
021700                                                                  02170099
021800******************************************************************02180099
021900 5000-WRITE-EXTRACT.                                              02190099
022000******************************************************************02200099
022100*                                                                 02210099
022200     MOVE PV-FSCL-MN-END-DTE       TO ML111-FSCL-MN-END-DTE.      02220099
022300     MOVE PV-FSCL-MN-NBR           TO ML111-FSCL-MN-NBR.          02230099
022400     MOVE MLT00004-DEPT-NBR        TO PV-DEPT-NBR.                02240099
022500     MOVE PV-DEPT-NBR              TO ML111-DEPT-NBR.             02250099
022600     MOVE MLT00004-MAJ-CL-NBR      TO PV-MAJ-CL-NBR.              02260099
022700     MOVE PV-MAJ-CL-NBR            TO ML111-MAJ-CL-NBR.           02270099
022800     MOVE MLT00004-SUB-CL-NBR      TO PV-SUB-CL-NBR.              02280099
022900     MOVE PV-SUB-CL-NBR            TO ML111-SUB-CL-NBR.           02290099
023000     MOVE MLT00004-LOC-NBR         TO PV-LOC-NBR.                 02300099
023100     MOVE PV-LOC-NBR               TO ML111-STR-NBR.              02310099
023200                                                                  02320099
023300     COMPUTE ML111-SLS-RTL-AMT  = MLT00004-SLS-REG-RTL-AMT        02330099
023400                                + MLT00004-SLS-PROMO-RTL-AMT      02340099
023500                                + MLT00004-SLS-PROCLR-RTL-AMT     02350099
023600                                + MLT00004-SLS-CLR-RTL-AMT        02360099
023700                                + MLT00004-SLS-OTH-RTL-AMT.       02370099
023800     COMPUTE ML111-MKDN-RTL-AMT = MLT00004-MKDN-PLU-RTL-AMT       02380099
023900                                + MLT00004-MKDN-RGST-RTL-AMT      02390099
024000                                + MLT00004-MKDN-UMTCH-RTL-AMT     02400099
024010                                + MLT00004-MKDN-BYR-RTL-AMT       02401099
024020                                + MLT00004-MKDN-STR-RTL-AMT.      02402099
024030     MOVE MLT00004-MKUP-RTL-AMT     TO ML111-MKUP-RTL-AMT.        02403099
024040     MOVE MLT00004-XFER-IN-RTL-AMT  TO ML111-XFER-IN-RTL-AMT.     02404099
024050     MOVE MLT00004-XFER-OUT-RTL-AMT TO ML111-XFER-OUT-RTL-AMT.    02405099
024060     MOVE MLT00004-RCPT-RTL-AMT     TO ML111-RCPT-RTL-AMT.        02406099
024070     MOVE MLT00004-RCPT-NET-COST-AMT                              02407099
024080                                    TO ML111-RCPT-NET-COST-AMT.   02408099
024090     MOVE MLT00004-PADJ-RTL-AMT     TO ML111-PADJ-RTL-AMT.        02409099
024100     MOVE MLT00004-PADJ-NET-COST-AMT                              02410099
024200                                    TO ML111-PADJ-NET-COST-AMT.   02420099
024300     MOVE MLT00004-INV-ADJ-RTL-AMT  TO ML111-INV-ADJ-RTL-AMT.     02430099
024400     MOVE MLT00004-SHNK-RTL-AMT     TO ML111-SHNK-RTL-AMT.        02440099
024500     MOVE MLT00004-END-INV-RTL-AMT  TO ML111-END-INV-RTL-AMT.     02450099
024501                                                                  02450199
024540     MOVE MLT00004-ML-LO-MDSE-LVL-ID TO ML111-DKEY-NBR.           02454099
024600                                                                  02460099
024700     WRITE DATA-INTEGRITY-EXTR-REC                                02470099
024800         FROM ML111-DATA-INTEGRITY-EXTR-REC.                      02480099
024900     ADD 1                         TO PA-OUTPUT-RECS-WRITTEN.     02490099
025000                                                                  02500099
025100 EJECT                                                            02510099
025200                                                                  02520099
031000******************************************************************03100099
031100 7400-SELECT-TDTATTR.                                             03110099
031200******************************************************************03120099
031300*                                                                 03130099
031410     MOVE MLT00004-FSCL-MN-END-DTE TO PV-FSCL-DTE.                03141099
031420                                                                  03142099
031430     EXEC SQL                                                     03143099
031440         SELECT DISTINCT                                          03144099
031450                FSCL_MN_NBR                                       03145099
031460               ,FSCL_MN_END_DTE                                   03146099
031470               ,FSCL_WK_NBR                                       03147099
031480               ,FSCL_WK_END_DTE                                   03148099
031490         INTO  :DTATTR-FSCL-MN-NBR                                03149099
031491              ,:DTATTR-FSCL-MN-END-DTE                            03149199
031492              ,:DTATTR-FSCL-WK-NBR                                03149299
031493              ,:DTATTR-FSCL-WK-END-DTE                            03149399
031494         FROM  MLT_PARTN_CNTL A                                   03149499
031495               ,TDTATTR B                                         03149599
031496         WHERE A.FSCL_DTE = :PV-FSCL-DTE                          03149699
031497           AND A.FSCL_DTE = B.KY_DTE                              03149799
031498           AND A.TBL_TM_LVL_CDE = 'M'                             03149899
031499         WITH UR                                                  03149999
031500     END-EXEC.                                                    03150099
031501                                                                  03150199
032506     EVALUATE TRUE                                                03250699
032507         WHEN SQLCODE = 0                                         03250799
032508             CONTINUE                                             03250899
032509         WHEN OTHER                                               03250999
032510             MOVE '7400-SELECT-TDTATTR'                           03251099
032511                                 TO AA-PARAGRAPH-NAME             03251199
032512             MOVE 'TDTATTR ROW NOT FOUND'                         03251299
032513                                 TO AA-MESSAGE                    03251399
032514             MOVE 'SELECT'       TO AA-DB2-OPERATION              03251499
032515             PERFORM Z998-SQL-ERROR                               03251599
032516     END-EVALUATE.                                                03251699
032517                                                                  03251799
032518 EJECT                                                            03251899
032519                                                                  03251999
032520******************************************************************03252099
032530 8000-EOJ.                                                        03253099
032540******************************************************************03254099
032550*                                                                 03255099
032560     DISPLAY ' '.                                                 03256099
032570     DISPLAY '  PROGRAM MLKUT615 PROCESSING SUMMARY'.             03257099
032580     DISPLAY '  -----------------------------------'.             03258099
032590     DISPLAY ' '.                                                 03259099
032600*                                                                 03260099
032700     MOVE PA-INPUT-FILES           TO CD-COUNT-HOLD1.             03270099
032800     DISPLAY 'TOTAL INPUT FILES     =           ' CD-COUNT-HOLD1. 03280099
032900*                                                                 03290099
033000     MOVE PA-OUTPUT-RECS-WRITTEN TO CD-COUNT-HOLD1.               03300099
033100     DISPLAY 'EXTRACT RECORDS WRITTEN =   ' CD-COUNT-HOLD1.       03310099
033200*                                                                 03320099
033300     DISPLAY ' '.                                                 03330099
033400                                                                  03340099
033500     CLOSE DATA-INTEGRITY-SRT-FILE.                               03350099
033600     CLOSE DATA-INTEGRITY-EXTR-FILE.                              03360099
033700                                                                  03370099
033800 EJECT                                                            03380099
033900                                                                  03390099
034000******************************************************************03400099
034100 Z990-COMMON-ABEND-ROUTINE.                                       03410099
034200******************************************************************03420099
034300*                                                                 03430099
034400     DISPLAY AA-ABEND-LIT.                                        03440099
034500     DISPLAY AA-PROGRAM-LIT.                                      03450099
034600     DISPLAY AA-PARAGRAPH-LIT.                                    03460099
034700     DISPLAY AA-MESSAGE-LINE.                                     03470099
034800     DISPLAY ABEND-CODE.                                          03480099
034900                                                                  03490099
035000     CALL 'ILBOABN0' USING ABEND-CODE.                            03500099
035100                                                                  03510099
035200 EJECT                                                            03520099
035300                                                                  03530099
035400******************************************************************03540099
035500 Z998-SQL-ERROR.                                                  03550099
035600******************************************************************03560099
035700*                                                                 03570099
035800     CLOSE DATA-INTEGRITY-SRT-FILE                                03580099
035900           DATA-INTEGRITY-EXTR-FILE.                              03590099
036000                                                                  03600099
036100     DISPLAY AA-ABEND-LIT.                                        03610099
036200     DISPLAY AA-DB2-ERROR-LIT.                                    03620099
036300     DISPLAY AA-PROGRAM-LIT.                                      03630099
036400     DISPLAY AA-PARAGRAPH-LIT.                                    03640099
036500     DISPLAY AA-MESSAGE-LINE.                                     03650099
036600     DISPLAY AA-DB2-OPERATION-LIT.                                03660099
036700     SET AC-DB2-ERROR TO TRUE.                                    03670099
036800     MOVE +4013                  TO ABEND-CODE.                   03680099
036900                                                                  03690099
037000     COPY DPPD004.                                                03700099
037100     CALL 'ILBOABN0' USING ABEND-CODE.                            03710099
037200                                                                  03720099
