      *****************************************************************         
      *    MLRD019 - MERCH LEDGER TRANSFER RECORD                               
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION             
W28545* W28545  08-22-2005 ROD JANSSEN THE NEW TRANSFER PROCESS                 
SR3403* SR3403  03-07-2012 TEJA KARWEER LARGE RETAIL AMOUNT FIELD               
SR3403*                    EXPANSION                                            
      *****************************************************************         
00001  01  ML019-TRANSFER-RECORD.                                       01/05/95
00002      05  ML019-TRANSFER-CODE             PIC  X(1).               MLRD019 
00003          88  ML019-VALID-TRANSFER-CODE   VALUE '3'.                  LV002
00004      05  FILLER                          PIC  X(1).               MLRD019 
W26603     05  ML019-TRANSFER-FROM-STORE-NBR   PIC  X(5).               MLRD019 
W26603     05  ML019-TRANSFER-FROM-STORE-9 REDEFINES                            
W26603         ML019-TRANSFER-FROM-STORE-NBR   PIC  9(5).                       
      ***  THE TRANSFER NUMBER CAN BE NUMERIC OR 'FAST '. ***           MLRD019 
00006      05  ML019-TRANSFER-NBR              PIC  X(5).               MLRD019 
00007      05  ML019-TRANSFER-DTE            .                          MLRD019 
00008          10  ML019-TRANSFER-MM           PIC  9(2).               MLRD019 
00009          10  ML019-TRANSFER-DD           PIC  9(2).               MLRD019 
00010      05  ML019-TRANSFER-KOHLS-MM         PIC  X(2).               MLRD019 
00011      05  FILLER                          PIC  X(3).               MLRD019 
00012      05  ML019-TRANSFER-QTY              PIC  9(3).               MLRD019 
SR3403     05  ML019-TRANSFER-PER-UNT-RTL-AMT  PIC S9(5)V99.            MLRD019 
00014      05  ML019-TRANSFER-BATCH-NBR        PIC  X(3).               MLRD019 
R21731     05  ML019-TRANSFER-BATCH-NBR-9 REDEFINES                             
R21731         ML019-TRANSFER-BATCH-NBR        PIC  9(3).                       
SR3403     05  FILLER                          PIC  X(4).               MLRD019 
W26603     05  ML019-TRANSFER-TO-STORE-NBR     PIC  X(5).               MLRD019 
W26603     05  ML019-TRANSFER-TO-STORE-9 REDEFINES                              
W26603         ML019-TRANSFER-TO-STORE-NBR     PIC  9(5).                       
W21731     05  ML019-SKU                       PIC  X(8).               MLRD019 
W21731     05  FILLER REDEFINES ML019-SKU.                                 CL**2
W21731         10  FILLER                      PIC  9(5).               MLRD019 
W21731         10  ML019-TRANSFER-SEQ-NO       PIC  9(3).               MLRD019 
                                                                                
      ***  THE TRANSFER DOCUMENT NUMBER ONLY USED FOR FAST SYSTEM. ***  MLRD019 
           05  ML019-TRANSFER-DOC-NBR.                                  MLRD005I
R21731         10  ML019-TRANSFER-DOC-STORE    PIC  9(04) VALUE ZEROS.          
R21731         10  ML019-TRANSFER-DOC-SEQ      PIC  9(06) VALUE ZEROS.          
W21731     05  ML019-TRANSFER-DEPT-CLASS       PIC  X(05).              MLRD019 
W21731     05  ML019-TRANSFER-DEPT-CLASS-NUM REDEFINES                  MLRD019 
W21731         ML019-TRANSFER-DEPT-CLASS.                                  CL**2
W21731         10  ML019-TRANSFER-DEPT-NBR     PIC  9(3).               MLRD019 
W21731         10  ML019-TRANSFER-CLASS-NBR    PIC  9(2).               MLRD019 
R21731     05  FILLER REDEFINES ML019-TRANSFER-DEPT-CLASS.                      
R21731         10  ML019-TRANSFER-DEPT-NBR-X   PIC  X(3).                       
R21731         10  ML019-TRANSFER-CLASS-NBR-X  PIC  X(2).                       
W28545     05  ML019-TRANSFER-ENT-ID       PIC S9(9) COMP VALUE ZEROS.          
W28545     05  FILLER                          PIC  X(10).                 CL**2
