000010***************************************************************** 00010000
000020*    MLRD201 - M/L MONTHLY DEPT/MAJOR-CLASS/ENT-ID              * 00020005
000021*    LENGTH  - 175 BYTES                                        * 00030000
000010*                                                                 00030110
      *CHANGE HISTORY:                                                  00030210
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00030310
      * ------- ---------- ----------- -------------------------------- 00030410
      * 10587   05/19/1999             CHANGED ALL OCCURANCES OF        00030710
      *                                MKDN-PERM-RTL-AMT TO             00030810
      *                                MKDN-RGST-RTL-AMT                00030910
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION     00031110
      ******************************************************************00032009
000040*                                                                 00033000
000100 01  ML201-UPDATE-REC.                                            00034000
           05  ML201-FSCL-MN-NBR          PIC X(02) VALUE SPACE.        00034105
000300     05  ML201-FSCL-MN-END-DTE      PIC X(10) VALUE SPACE.        00034205
000200     05  ML201-DEPT-NBR             PIC X(03) VALUE SPACE.        00034305
000220     05  ML201-MAJ-CL-NBR           PIC X(02) VALUE SPACE.        00034405
001000     05  ML201-ENT-ID               PIC S9(09)    COMP   VALUE +0.00034602
W26603     05  ML201-SLS-REG-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00060010
W26603     05  ML201-SLS-PROMO-RTL-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00062010
W26603     05  ML201-SLS-PROCLR-RTL-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00064010
W26603     05  ML201-SLS-CLR-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00066010
W26603     05  ML201-SLS-OTH-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00068010
W26603     05  ML201-MKDN-PLU-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00080010
W26603     05  ML201-MKDN-RGST-RTL-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00082010
W26603     05  ML201-MKDN-UMTCH-RTL-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00084010
W26603     05  ML201-MKDN-BYR-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00086010
W26603     05  ML201-MKDN-STR-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00088010
W26603     05  ML201-MKUP-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00100010
W26603     05  ML201-XFER-IN-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00120010
W26603     05  ML201-XFER-OUT-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00140010
W26603     05  ML201-RCPT-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00160010
W26603     05  ML201-RCPT-NET-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00180010
W26603     05  ML201-PADJ-FRGT-COST-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00182010
W26603     05  ML201-PADJ-DISC-COST-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00186010
W26603     05  ML201-RCPT-GRO-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00187010
W26603     05  ML201-DR-ALW-RTL-AMT       PIC S9(11)V99 COMP-3 VALUE +0.00222010
W26603     05  ML201-RTV-RTL-AMT          PIC S9(11)V99 COMP-3 VALUE +0.00224010
002000     05  ML201-PADJ-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00225010
W26603     05  ML201-PADJ-NET-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00226010
W26603     05  ML201-INV-ADJ-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00240010
W26603     05  FILLER                     PIC X(18) VALUE SPACE.        00250010
