000100***************************************************************** 00010000
000200*    MLRD126 - COMBINED LEDGER WEEKLY PLANNING EXTRACT          * 00020001
000300*    LENGTH  - 64 BYTES                                         * 00030003
31355 *                                                               * 00040009
31355 ***************************************************************** 00041009
31355 *    WR/PITS#    DATE      DESCRIPTION                          * 00042009
31355 *    --------  --------  ---------------------------------------* 00043009
31355 *    WR# 31355  11/17/2000   ROD JANSSEN                        * 00049009
31355 *    E-COMMERCE COMBINED LEDGER REPORT MODIFICATION.......      * 00049109
31355 *                                                               * 00049209
31355 ***************************************************************** 00049309
000500*                                                                 00050000
000600 01  ML126-WEEKLY-PLN-EXTRACT-REC.                                00060000
000700     05  ML126-FSCL-WK-NBR              PIC X(02) VALUE SPACES.   00070003
000800     05  ML126-FSCL-WK-END-DTE          PIC X(10) VALUE SPACES.   00080003
000900     05  ML126-DEPT-NBR                 PIC X(03) VALUE SPACES.   00090003
31355      05  ML126-CHNL-CDE                 PIC X(01) VALUE SPACES.   00091009
001000     05  ML126-SLS-RTL-AMT              PIC S9(09)V99             00100000
001100                                                  COMP-3 VALUE +0.00110000
001200     05  ML126-MKDN-RTL-AMT             PIC S9(09)V99             00120000
001300                                                  COMP-3 VALUE +0.00130000
001400     05  ML126-RCPT-RTL-AMT             PIC S9(09)V99             00140000
001500                                                  COMP-3 VALUE +0.00150000
001800     05  ML126-SHNK-RTL-AMT             PIC S9(09)V99             00180000
001900                                                  COMP-3 VALUE +0.00190000
002000     05  ML126-END-INV-RTL-AMT          PIC S9(09)V99             00200000
002100                                                  COMP-3 VALUE +0.00210000
21517      05  ML126-PADJ-RTL-AMT             PIC S9(09)V99             00220006
21517                                                   COMP-3 VALUE +0.00230007
31355      05  FILLER                         PIC X(12) VALUE SPACES.   00300009
