      ******************************************************************00010005
      *  MLRD141 - DATA INTEGRITY EXTRACT FILE                          00020010
      *  01/17/07 - DATA INTEGRITY COPYBOOK FOR WKLY_SUM TO TWKMCLC     00030002
      *             COMPARISON               -JOHN SELWITSCHKA          00040002
      ******************************************************************00050005
       01  ML141-DATA-INTEGRITY-EXTR-REC.                               00060010
           05  ML141-FSCL-WK-END-DTE        PIC X(10).                  00070010
           05  ML141-DEPT-NBR               PIC X(03).                  00090010
           05  ML141-MAJ-CL-NBR             PIC X(02).                  00100010
           05  ML141-SLS-RTL-AMT            PIC S9(11)V99 COMP-3.       00130010
           05  ML141-MKDN-PLU-RTL-AMT       PIC S9(11)V99 COMP-3.       00140010
           05  ML141-MKDN-PROMO-RTL-AMT     PIC S9(11)V99 COMP-3.       00140110
           05  ML141-MKDN-RGST-RTL-AMT      PIC S9(11)V99 COMP-3.       00140210
           05  ML141-MKDN-GLDST-RTL-AMT     PIC S9(11)V99 COMP-3.       00140310
           05  ML141-MKDN-UMTCH-RTL-AMT     PIC S9(11)V99 COMP-3.       00140510
           05  ML141-MKDN-BYR-RTL-AMT       PIC S9(11)V99 COMP-3.       00140610
           05  ML141-MKDN-STR-RTL-AMT       PIC S9(11)V99 COMP-3.       00140710
           05  ML141-MKDN-PRPT-RTL-AMT      PIC S9(11)V99 COMP-3.       00140810
           05  ML141-MKDN-OTH-RTL-AMT       PIC S9(11)V99 COMP-3.       00140910
           05  ML141-MKUP-RTL-AMT           PIC S9(11)V99 COMP-3.       00150010
           05  ML141-XFER-IN-RTL-AMT        PIC S9(11)V99 COMP-3.       00160010
           05  ML141-XFER-OUT-RTL-AMT       PIC S9(11)V99 COMP-3.       00170010
           05  ML141-RCPT-RTL-AMT           PIC S9(11)V99 COMP-3.       00180010
           05  ML141-RCPT-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00190010
           05  ML141-PADJ-RTL-AMT           PIC S9(11)V99 COMP-3.       00200010
           05  ML141-PADJ-FRGT-COST-AMT     PIC S9(11)V99 COMP-3.       00200110
           05  ML141-PADJ-RTV-COST-AMT      PIC S9(11)V99 COMP-3.       00200210
           05  ML141-PADJ-RTV-RTL-AMT       PIC S9(11)V99 COMP-3.       00200310
           05  ML141-PADJ-DA-COST-AMT       PIC S9(11)V99 COMP-3.       00200410
           05  ML141-PADJ-DA-RTL-AMT        PIC S9(11)V99 COMP-3.       00200510
           05  ML141-PADJ-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00210010
           05  ML141-PADJ-OTH-COST-AMT      PIC S9(11)V99 COMP-3.       00210110
           05  ML141-PADJ-OTH-RTL-AMT       PIC S9(11)V99 COMP-3.       00211010
           05  ML141-INV-ADJ-RTL-AMT        PIC S9(11)V99 COMP-3.       00220010
           05  ML141-SHNK-RTL-AMT           PIC S9(11)V99 COMP-3.       00230010
           05  ML141-END-INV-RTL-AMT        PIC S9(11)V99 COMP-3.       00240010
