      *****************************************************************         
      *    MLRD138 - M/L WEEKLY MAJOR CLASS STORE UPDATE TRANSACTION  *         
      *    LENGTH  - 100 BYTES   (TWKMCLS)                            *         
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION             
      *****************************************************************         
      *                                                                         
       01  ML138-UPDATE-REC.                                                    
           05  ML138-FSCL-WK-NBR              PIC X(02) VALUE SPACE.            
           05  ML138-FSCL-WK-END-DTE          PIC X(10) VALUE SPACE.            
           05  ML138-DEPT-NBR                 PIC X(03) VALUE SPACE.            
           05  ML138-MAJ-CL-NBR               PIC X(02) VALUE SPACE.            
           05  ML138-STR-NBR                  PIC S9(04)                        
                                                        COMP   VALUE +0.        
W26603     05  ML138-SLS-RTL-AMT              PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-MKDN-RTL-AMT             PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-MKUP-RTL-AMT             PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-XFER-IN-RTL-AMT          PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-XFER-OUT-RTL-AMT         PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-RCPT-RTL-AMT             PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-RCPT-NET-COST-AMT        PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-PADJ-RTL-AMT             PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-PADJ-NET-COST-AMT        PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  ML138-INV-ADJ-RTL-AMT          PIC S9(11)V99                     
                                                        COMP-3 VALUE +0.        
W26603     05  FILLER                         PIC X(11) VALUE SPACE.            
