      ***************************************************************** 00010000
      *    MLRD080 - ML BRAND VENDOR SHRINK PRORATION                   00020000
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00060000
      * -------  ----------  ----------------------------------------   00070000
      * W34567   03/21/2008  INITIAL CREATION.                          00080002
      *                      J. SELWITSCHKA                             00090000
      ***************************************************************** 00120000
       01  ML080-BRAND-VENDOR-SHNK.                                     00130000
           05  ML080-FSCL-WK-END-DTE   PIC  X(10)      VALUE SPACES.    00260000
           05  ML080-DEPT-NBR          PIC S9(04)      VALUE ZEROES     00261000
                              COMP-3.                                   00261100
           05  ML080-MAJ-CL-NBR        PIC S9(04)      VALUE ZEROES     00262000
                              COMP-3.                                   00262100
           05  ML080-SUB-CL-NBR        PIC S9(04)      VALUE ZEROES     00262200
                              COMP-3.                                   00262300
           05  ML080-ENT-ID            PIC S9(09)      VALUE ZEROES     00263000
                              COMP.                                     00263100
           05  ML080-LBL-SEQ-NBR       PIC S9(09)      VALUE ZEROES     00264000
                              COMP.                                     00264100
           05  ML080-ML-LO-MDSE-LVL-ID PIC S9(09)      VALUE ZEROES     00266000
                              COMP.                                     00266100
           05  ML080-LOC-NBR           PIC S9(04)      VALUE ZEROES     00266200
                              COMP.                                     00266300
           05  ML080-FSCL-MN-END-DTE   PIC  X(10)      VALUE SPACES.    00267000
           05  ML080-CURR-SHNK-RTL-AMT PIC S9(11)V9(2) VALUE ZEROES     00267100
                              COMP-3.                                   00267200
           05  ML080-SLS-RTL-AMT       PIC S9(11)V9(2) VALUE ZEROES     00268000
                              COMP-3.                                   00268100
           05  ML080-SHNK-RTL-AMT      PIC S9(11)V9(2) VALUE ZEROES     00269000
                              COMP-3.                                   00270000
           05  FILLER                  PIC  X(16)      VALUE SPACES.    02080000
