000100******************************************************************00010000
000200*  MLRD119 - DEPARTMENT ELIMINATION TOTALS BY BUYER REPORT        00020000
000200*            EXTRACT.                                             00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION     00080000
000300******************************************************************00090000
000400 01  ML119-DEPT-ELIM-BY-BYR-EXTRACT.                              00100000
           05  ML119-REC-TYP-CDE            PIC X.                      00110000
               88  ML119-REC-TYP-HDR        VALUE '1'.                  00120000
               88  ML119-REC-TYP-DTL        VALUE '2'.                  00130000
           05  ML119-HDR-DATA.                                          00140000
               10  ML119-FSCL-MN-END-DTE    PIC X(10).                  00150000
               10  ML119-DR-BATCH-NBR       PIC X(03).                  00160000
               10  ML119-CR-BATCH-NBR       PIC X(03).                  00170000
               10  FILLER                   PIC X(63).                  00180000
           05  ML119-DTL-DATA               REDEFINES                   00190000
               ML119-HDR-DATA.                                          00200000
000500         10  ML119-BYR-NBR            PIC X(03).                  00210000
  0600         10  ML119-DEPT-NBR           PIC X(03).                  00220000
001000         10  ML119-DEPT-DESC          PIC X(25).                  00230000
000700         10  ML119-SUB-CL-NBR         PIC X(02).                  00240000
001200         10  ML119-SUB-CL-DESC        PIC X(25).                  00250000
W26603         10  ML119-END-INV-RTL-AMT    PIC S9(13)V99 COMP-3.       00260000
W26603         10  FILLER                   PIC X(13).                  00270000
