      ***************************************************************** 00000100
      *    MLRD250 - VENDOR ANALYSIS ENDING ADJUSTMENT UPDATE TRANS   * 00000200
      *    LENGTH  - 24 BYTES                                         * 00000400
      ***************************************************************** 00000500
      *                                                                 00000600
       01  ML250-UPDATE-REC.                                            00000700
           05  ML250-DEPT-NBR             PIC X(03)     VALUE SPACES.   00001200
           05  ML250-SUB-CL-NBR           PIC X(02)     VALUE SPACES.   00001300
           05  ML250-VENDOR-ENT-ID        PIC S9(09)    VALUE +0 COMP.  00001400
           05  ML250-INV-ADJ-RTL-AMT      PIC S9(09)V99 VALUE +0 COMP-3.00005000
           05  FILLER                     PIC X(09)     VALUE SPACES.   00005100
