000010***************************************************************** 00010000
000020*    MLRD203 - M/L MONTHLY VENDOR ANALYSIS DEPT/ENT-ID LEVEL    * 00020001
000021*    LENGTH  - 200 BYTES                                        * 00030002
      *                                                                 00030102
      *CHANGE HISTORY:                                                  00030202
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00030302
      * ------- ---------- ----------- -------------------------------- 00030402
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION     00030502
      ******************************************************************00030800
000040*                                                                 00030900
000100 01  ML203-UPDATE-REC.                                            00031000
           05  ML203-FSCL-MN-NBR          PIC X(02) VALUE SPACE.        00032000
000300     05  ML203-FSCL-MN-END-DTE      PIC X(10) VALUE SPACE.        00033000
000200     05  ML203-DEPT-NBR             PIC X(03) VALUE SPACE.        00034000
001000     05  ML203-ENT-ID               PIC S9(09)    COMP   VALUE +0.00034200
W26603     05  ML203-SLS-REG-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00034302
W26603     05  ML203-SLS-PROMO-RTL-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00034402
W26603     05  ML203-SLS-PROCLR-RTL-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00034502
W26603     05  ML203-SLS-CLR-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00034602
W26603     05  ML203-SLS-OTH-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00034702
W26603     05  ML203-MKDN-PLU-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00034802
W26603     05  ML203-MKDN-RGST-RTL-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00034902
W26603     05  ML203-MKDN-UMTCH-RTL-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00035002
W26603     05  ML203-MKDN-BYR-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00036002
W26603     05  ML203-MKDN-STR-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00037002
W26603     05  ML203-MKUP-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00038002
W26603     05  ML203-XFER-IN-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00039002
W26603     05  ML203-XFER-OUT-RTL-AMT     PIC S9(11)V99 COMP-3 VALUE +0.00040002
W26603     05  ML203-RCPT-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00050002
W26603     05  ML203-RCPT-NET-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00060002
W26603     05  ML203-PADJ-FRGT-COST-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00070002
W26603     05  ML203-PADJ-DISC-COST-AMT   PIC S9(11)V99 COMP-3 VALUE +0.00080002
W26603     05  ML203-RCPT-GRO-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00090002
W26603     05  ML203-DR-ALW-RTL-AMT       PIC S9(11)V99 COMP-3 VALUE +0.00100002
W26603     05  ML203-RTV-RTL-AMT          PIC S9(11)V99 COMP-3 VALUE +0.00110002
W26603     05  ML203-PADJ-RTL-AMT         PIC S9(11)V99 COMP-3 VALUE +0.00120002
W26603     05  ML203-PADJ-NET-COST-AMT    PIC S9(11)V99 COMP-3 VALUE +0.00130002
W26603     05  ML203-INV-ADJ-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.00140002
W26603     05  FILLER                     PIC X(20) VALUE SPACE.        00150002
