      *****************************************************************         
      *    MLRD157 - WK DETAILED MERCH LEDGER UPDATE TRANSACTION                
      *    LENGTH  - 400 BYTES                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
      *                                                                         
      *****************************************************************         
       01  ML157-UPDATE-REC.                                                    
           05 ML157-FSCL-WK-NBR            PIC  X(2).                           
           05 ML157-FSCL-WK-END-DTE        PIC  X(10).                          
           05 ML157-DEPT-NBR               PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML157-MAJ-CL-NBR             PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML157-SUB-CL-NBR             PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML157-LOC-NBR                PIC  S9(4) COMP                      
                                                VALUE ZEROES.                   
           05 ML157-ENT-ID                 PIC  S9(9) COMP                      
                                                VALUE ZEROES.                   
           05 ML157-SLS-REG-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-SLS-PROMO-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-SLS-PROCLR-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-SLS-CLR-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-SLS-OTH-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-PLU-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-PROMO-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-RGST-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-GLDST-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-UMTCH-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-BYR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-STR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-PRPT-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKDN-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML157-MKUP-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML157-XFER-IN-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-XFER-OUT-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-RCPT-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML157-RCPT-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-RCPT-GRO-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-FRGT-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-DISC-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-RTV-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-RTV-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-DA-COST-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-DA-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-OTH-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML157-PADJ-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML157-DR-ALW-RTL-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML157-RTV-RTL-AMT            PIC  S9(11)V9(2) COMP-3.             
           05 ML157-INV-ADJ-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML157-ONORD-RTL-AMT          PIC  S9(11)V9(2) COMP-3.             
           05 ML157-ONORD-COST-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML157-WK-PARTN-NBR           PIC  S9(4) COMP  VALUE ZEROS.        
           05 FILLER                       PIC X(119)   VALUE SPACES.           
