      ******************************************************************        
      * MAIN DATA EXTRACT LAYOUT FOR SALES & INVENTORY PERFORMANCE BY  *        
      * STORE GRADE.                                                   *        
FMNTH * CHANGE THE MONTH NUMBER TO RESOLVE TO A FISCAL MONTH LITERAL   *        
FMNTH * (VS. CALENDAR MONTH)          1/5/2004     S.JACKSON   WR25534 *        
      ******************************************************************        
       01  ML041-SALES-INVENTORY-EXTRACT.                                       
           05  ML041-RECORD-KEY.                                                
               10  ML041-SEASON            PIC X(01)       VALUE SPACES.        
                   88  ML041-SPRING-SEASON                 VALUE 'S'.           
                   88  ML041-FALL-SEASON                   VALUE 'F'.           
               10  ML041-YEAR              PIC X(04)       VALUE ZEROES.        
               10  ML041-YEAR-9 REDEFINES ML041-YEAR                            
                                           PIC 9(04).                           
               10  ML041-WEEK-NBR          PIC X(02)       VALUE ZEROES.        
                   88  ML041-BEG-INV-WEEK                  VALUE ZEROES.        
               10  ML041-WEEK-NBR-9 REDEFINES ML041-WEEK-NBR                    
                                           PIC 9(02).                           
               10  ML041-DEPT-NBR          PIC X(03)       VALUE SPACES.        
               10  ML041-BUYER-NBR         PIC X(03)       VALUE SPACES.        
               10  ML041-BUS-GRP-NBR       PIC X(03)       VALUE SPACES.        
               10  ML041-DMA-NBR           PIC X(02)       VALUE SPACES.        
               10  ML041-GMA-NBR           PIC X(02)       VALUE SPACES.        
               10  FILLER                  PIC X(20)       VALUE SPACES.        
MCL   *        10  FILLER                  PIC X(01)       VALUE SPACES.        
MCL   *        10  ML041-CLASS-NBR         PIC X(02)       VALUE SPACES.        
MCL   *        10  FILLER                  PIC X(17)       VALUE SPACES.        
               10  ML041-STORE-NBR         PIC 9(04)       VALUE ZEROES.        
               10  ML041-STORE-TYPE        PIC X(06)       VALUE SPACES.        
                   88  ML041-COMP-STORE               VALUE 'COMP  '.           
                   88  ML041-NON-COMP-STORE           VALUE 'NCMP  '.           
                   88  ML041-DC-LOCATION              VALUE 'DC    '.           
                   88  ML041-NEW-STORE                VALUES ARE                
                       '000001' '000002' '000003' '000004'                      
                       '000007' '000008' '000009' '000010'                      
                       '000005' '000006'                                        
                       '000011' '000012'.                                       
FMNTH ** INPUT MONTH NUMBER REPRESENTS THE FISCAL MONTH (NOT CALENDAR)          
                   88  ML041-NEW-JAN-STORE            VALUE '000012'.           
                   88  ML041-NEW-FEB-STORE            VALUE '000001'.           
                   88  ML041-NEW-MAR-STORE            VALUE '000002'.           
                   88  ML041-NEW-APR-STORE            VALUE '000003'.           
                   88  ML041-NEW-MAY-STORE            VALUE '000004'.           
                   88  ML041-NEW-JUN-STORE            VALUE '000005'.           
                   88  ML041-NEW-JUL-STORE            VALUE '000006'.           
                   88  ML041-NEW-AUG-STORE            VALUE '000007'.           
                   88  ML041-NEW-SEP-STORE            VALUE '000008'.           
                   88  ML041-NEW-OCT-STORE            VALUE '000009'.           
                   88  ML041-NEW-NOV-STORE            VALUE '000010'.           
                   88  ML041-NEW-DEC-STORE            VALUE '000011'.           
           05  ML041-RECORD-DATA.                                               
               10  ML041-SLS-RTL           PIC S9(12)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML041-END-INV-RTL       PIC S9(12)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML041-MKDN-RTL          PIC S9(12)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML041-OLD-STORE-NBR     PIC 9(04)       VALUE ZEROES         
                               COMP-3.                                          
               10  FILLER                  PIC X(48)       VALUE SPACES.        
