000100******************************************************************00010000
000200*  MLRD113 - SKU RENUMBERS FINANCIAL BY BUYER EXTRACT FILE        00020000
W28545*            RECORD LENGTH = 139                                  00021000
000300******************************************************************00030000
000400 01  ML113-SKU-RNMBR-BYR-EXTRACT.                                 00040000
000500     05  ML113-BYR-NBR                PIC X(03).                  00050000
000600     05  ML113-DEPT-NBR               PIC X(03).                  00060000
000700     05  ML113-SUB-CL-NBR             PIC X(02).                  00070000
000800     05  ML113-BYR-FIR-NAME           PIC X(12).                  00080000
000900     05  ML113-BYR-LAST-NAME          PIC X(18).                  00090000
001000     05  ML113-DEPT-DESC              PIC X(25).                  00100000
001100     05  ML113-MAJ-CL-DESC            PIC X(25).                  00110000
001200     05  ML113-SUB-CL-DESC            PIC X(25).                  00120000
001300     05  ML113-RTL-AMT                PIC S9(15)V99 COMP-3.       00130000
001400     05  ML113-COST-AMT               PIC S9(15)V99 COMP-3.       00140000
001500     05  ML113-BATCH-NBR              PIC X(3).                   00150000
W28545     05  ML113-LOC-NBR                PIC 9(5).                   00160000
