000010*****************************************************************         
000020*    MLRD100 - M/L DATABASE UPDATE TRANSACTION                  *         
000021*    LENGTH  - 150 BYTES                                        *         
000030*****************************************************************         
      ******************************************************************        
      *    WR/PITS#     DATE        DESCRIPTION                        *        
      *    --------   --------     ---------------------------------   *        
      *    20698      12/28/1999   ADDED RCPT-PO-TYP-CDE X(02)         *        
      *    W26603     03/29/2004   STORE EXPANSION                     *        
      ******************************************************************        
000040*                                                                         
000100 01  ML100-UPDATE-REC.                                                    
000300     05  ML100-FSCL-MN-END-DTE          PIC X(10) VALUE SPACE.            
           05  ML100-FSCL-MN-NBR              PIC X(02) VALUE SPACE.            
000300     05  ML100-FSCL-WK-END-DTE          PIC X(10) VALUE SPACE.            
           05  ML100-FSCL-WK-NBR              PIC X(02) VALUE SPACE.            
000200     05  ML100-DEPT-NBR                 PIC X(03) VALUE SPACE.            
000220     05  ML100-SUB-CL-NBR               PIC X(02) VALUE SPACE.            
W26603     05  ML100-STR-NBR                  PIC S9(04)                        
                                                        COMP VALUE +0.          
000300     05  ML100-FIN-LIAB-DTE             PIC X(10) VALUE SPACE.    00150015
           05  ML100-TRN-TYP-CDE              PIC X(02) VALUE SPACE.    00160015
W26603     05  ML100-SLS-RTL-AMT              PIC S9(11)V99             00170025
001000                                                  COMP-3 VALUE +0.00180023
W26603     05  ML100-MKDN-RTL-AMT             PIC S9(11)V99             00190025
001200                                                  COMP-3 VALUE +0.00200023
W26603     05  ML100-MKUP-RTL-AMT             PIC S9(11)V99             00210025
001400                                                  COMP-3 VALUE +0.00220023
W26603     05  ML100-XFER-IN-RTL-AMT          PIC S9(11)V99             00230025
001600                                                  COMP-3 VALUE +0.00240023
W26603     05  ML100-XFER-OUT-RTL-AMT         PIC S9(11)V99             00250025
001800                                                  COMP-3 VALUE +0.00260023
W26603     05  ML100-RCPT-RTL-AMT             PIC S9(11)V99             00270025
002000                                                  COMP-3 VALUE +0.00280020
W26603     05  ML100-RCPT-FRGT-COST-AMT       PIC S9(11)V99             00290025
002200                                                  COMP-3 VALUE +0.00300020
W26603     05  ML100-RCPT-NET-COST-AMT        PIC S9(11)V99             00310025
002400                                                  COMP-3 VALUE +0.00320020
W26603     05  ML100-PADJ-RTL-AMT             PIC S9(11)V99             00330025
002000                                                  COMP-3 VALUE +0.00340020
W26603     05  ML100-PADJ-FRGT-COST-AMT       PIC S9(11)V99             00350025
002200                                                  COMP-3 VALUE +0.00360020
W26603     05  ML100-PADJ-NET-COST-AMT        PIC S9(11)V99             00370025
002400                                                  COMP-3 VALUE +0.00380020
W26603     05  ML100-INV-ADJ-RTL-AMT          PIC S9(11)V99             00390025
002500                                                  COMP-3 VALUE +0.00400009
1299RM     05  ML100-RCPT-PO-TYP-CDE          PIC X(02) VALUE SPACE.    00411028
W26603     05  ML100-IN-TRNST-RTL-AMT         PIC S9(11)V99                     
21591                                                   COMP-3 VALUE +0.        
W26603     05  FILLER                         PIC X(14) VALUE SPACE.            
