      *****************************************************************         
      *    MLRD983 - MERCH LEDGER NEW AUDIT DATA INTEGRITY PROCESS              
      *    DATA EXTRACT BY UNLOADING THE MLT_PADJ_TRN_DTL TABLE                 
      *                                  (MLT00039)                             
      *    RECORD LENGTH - 74 BYTES                                             
      *    ALL FILLER FIELDS HERE ARE USED FOR NULL IND                         
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *****************************************************************         
       01  ML983-PURCHASE-ADJ-RECS.                                             
           10 ML983-FSCL-WK-END-DTE         PIC   X(10).                        
           10 ML983-DEPT-NBR                PIC  S9(4)V COMP-3.                 
           10 ML983-MAJ-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML983-SUB-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML983-LOC-NBR                 PIC  S9(4) COMP.                    
           10 ML983-ML-LO-MDSE-LVL-ID       PIC  S9(9) COMP.                    
           10 ML983-TRN-TYP-CDE             PIC   X(03).                        
           10 ML983-FINCL-PRC-GP-CDE        PIC   X(06).                        
           10 ML983-AP-TRN-CDE              PIC   X(02).                        
           10 ML983-DRCR-CDE                PIC   X(02).                        
           10 FILLER                        PIC   X(01).                        
           10 ML983-PADJ-GRO-COST-AMT       PIC  S9(11)V9(2) COMP-3.            
           10 FILLER                        PIC   X(02).                        
           10 ML983-PADJ-NET-COST-AMT       PIC  S9(11)V9(2) COMP-3.            
           10 FILLER                        PIC   X(02).                        
           10 ML983-PADJ-RTL-AMT            PIC  S9(11)V9(2) COMP-3.            
           10 FILLER                        PIC   X(02).                        
           10 ML983-PADJ-DISC-COST-AMT      PIC  S9(11)V9(2) COMP-3.            
           10 FILLER                        PIC   X(01).                        
