000001*****************************************************************         
000002*  MLRD204 - DATA SMOOTHING OUTLYER REPORTING                   *         
000003*  LENGTH  - 350 BYTES                                          *         
003100*****************************************************************         
003800* CHANGED BY:               DATE:                    WR#        *         
C03100* DESCRIPTION:                                                  *         
000001*****************************************************************         
       01  ML204-OUTLYER-EXTRACT.                                               
           05  ML204-KEY-DATA.                                                  
               10  ML204-PARTN-NBR          PIC S9(04) COMP                     
                                                       VALUE ZERO.              
               10  ML204-FSCL-PERIOD        PIC X(02)  VALUE SPACES.            
               10  ML204-FSCL-END-DTE       PIC X(10)  VALUE SPACES.            
               10  ML204-DEPT-NBR           PIC S9(04) COMP-3                   
                                                       VALUE ZERO.              
               10  ML204-MAJ-CL-NBR         PIC S9(04) COMP-3                   
                                                       VALUE ZERO.              
               10  ML204-SUB-CL-NBR         PIC S9(04) COMP-3                   
                                                       VALUE ZERO.              
               10  ML204-LOC-NBR            PIC S9(04) COMP                     
                                                       VALUE ZERO.              
               10  ML204-ENT-ID             PIC S9(09) COMP                     
                                                       VALUE ZERO.              
               10  ML204-PARTN-GROUP        PIC S9(04) COMP                     
                                                       VALUE ZERO.              
               10  ML204-LBL-SEQ-NBR        PIC S9(09) COMP                     
                                                       VALUE ZERO.              
               10  ML204-ML-LWST-ID         PIC S9(09) COMP                     
                                                       VALUE ZERO.              
               10  ML204-GMM                PIC X(02)  VALUE SPACES.            
               10  ML204-DMM                PIC X(02)  VALUE SPACES.            
               10  ML204-BUYER              PIC X(03)  VALUE SPACES.            
               10  FILLER                   PIC X(02)  VALUE SPACES.            
           05  ML204-NAMES.                                                     
               10  ML204-NAME-GMM           PIC X(30).                          
               10  ML204-NAME-DMM           PIC X(30).                          
               10  ML204-NAME-BUYER         PIC X(30).                          
               10  ML204-NAME-DEPT          PIC X(25).                          
               10  ML204-NAME-MCL           PIC X(30).                          
               10  ML204-NAME-VENDOR        PIC X(30).                          
           05  ML204-DATA.                                                      
               10  ML204-OUTLYER-CANDI-IND  PIC X(01)       VALUE '0'.          
Y                  88  ML204-OUTLYER-CANDIDATES VALUE '1' '2' '3' '4'           
Y                                                 '5' '6' '7' '8' '9'.          
Y                  88  ML204-NONOUTLYER-CANDIDATE          VALUE '0'.           
Y                  88  ML204-OUTLYER-CMU-SMOOTH            VALUE '1'.           
Y                  88  ML204-OUTLYER-GM-SMOOTH             VALUE '2'.           
Y                  88  ML204-OUTLYER-OTHER-SMOOTH          VALUE '3'.           
Y                  88  ML204-SMOOTH-CANDI-4                VALUE '4'.           
Y                  88  ML204-SMOOTH-CANDI-5                VALUE '5'.           
Y                  88  ML204-SMOOTH-CANDI-6                VALUE '6'.           
Y                  88  ML204-SMOOTH-CANDI-7                VALUE '7'.           
Y                  88  ML204-SMOOTH-CANDI-8                VALUE '8'.           
Y                  88  ML204-SMOOTH-CANDI-9                VALUE '9'.           
               10  ML204-ORIG-SLS-RTL-AMT   PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ORIG-END-INV-RTL-AMT                                   
                                            PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ORIG-END-INV-COST-AMT                                  
                                            PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ORIG-CUM-MKUP-PCT  PIC S9(04)V9(7) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ORIG-GRO-MRGN-AMT  PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ORIG-GRO-MRGN-PCT  PIC S9(04)V9(7) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-TGT-CUM-MKUP-PCT   PIC S9(04)V9(7) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ADJ-END-INV-COST-AMT1                                  
                                            PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ADJ-END-INV-COST-AMT2                                  
                                            PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-INV-COST-ADJ1      PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-INV-COST-ADJ2      PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ADJ-GRO-MRGN-AMT   PIC S9(11)V9(2) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-ADJ-GRO-MRGN-PCT   PIC S9(04)V9(7) COMP-3              
                                                            VALUE ZERO.         
               10  ML204-SMOOTHED-CUM-MKUP-PCT                                  
                                            PIC S9(04)V9(7) COMP-3              
                                                            VALUE ZERO.         
           05  FILLER                       PIC X(33).                          
