      *****************************************************************         
      *    MLRD811 - PRIVATE BRAND GIVEBACK ACTUALS BY FISCAL DATE              
      *    RECORD LENGTH - 080 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
      * W?????   08/04/2008  INITIAL CREATION.  -LEE                            
      *****************************************************************         
       01  ML811-PB-GIVEBACK-RECORD.                                            
           05  ML811-FSCL-MN-END-DTE       PIC X(10)       VALUE SPACES.        
           05  ML811-DEPT-NBR              PIC S9(04)      VALUE ZEROES         
                               COMP-3.                                          
           05  ML811-PADJ-NET-COST-AMT     PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  FILLER                      PIC X(60)       VALUE SPACES.        
