      ***************************************************************** 00010003
      *    MLRD020 - MERCH LEDGER COMPOSITE FILE RECORD                 00020003
      *    RECORD LENGTH - 175 BYTES                                    00030003
      *                                                                 00040003
      *CHANGE HISTORY:                                                  00050003
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060003
      * ------- ---------- ----------- -------------------------------- 00070003
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION     00080003
W20445* W20445  09-01-2004 ROD JANSSEN DETAILED INVENTORY ADJUSTMENT    00090003
26006R* 26006   07-20-2005 ROD JANSSEN ISSUE WITH TRANSFER GOING TO     00100003
26006R*                                UNKNOWN VENDOR.                  00110003
W29145* W29145  10-11-2005 S. JACKSON  SAS-PASS DW MKDN CODE/CLR DATES  00120003
S29145* S29145  11-20-2005 S. JACKSON  SAS-ADD ORIG-NON-GROUP-RTL(PCHG) 00130007
W28582* W28582  11-21-2005 C. MCCAMMON DEBIT ALLOW / ADD BRAND (SHORT)  00131005
W32898* W32898  10-15-2007 J. SELWITSCHKA - BRAND VENDOR PHASE II       00131112
W32898*                                ADD PURCH-LBL-SEQ-NBR.           00131209
W38216* W38216  03-31-2010 J. SELWITSCHKA - EFC2 PROJECT                00131314
W38216*                                ADD EFC2 CONVERSION INDICATOR.   00131414
W38972* W38972  08-18-2010 COGNIZANT      - MLOF PROJECT CHANGES.       00131519
W38972*                    (SANDEEP)      - REMOVED THE EFC2 CONVERSION 00131619
W38972*                                     INDICATOR AND REPLACED WITH 00131819
W38972*                                     AVAILABLE FILLER.           00131919
SR3403* SR3403  03-15-2012 JALAJ KUMAR - CHANGES FOR LARGE RETAIL       00132020
      ***************************************************************** 00132203
000100 01  ML020-COMPOSITE-RECORD.                                      00133003
000200     05  ML020-SORT-KEY              PIC  X(25).                  00134003
000300     05  ML020-SORT-KEY-X REDEFINES  ML020-SORT-KEY.              00135003
W26603         10  ML020-STORE-NBR         PIC  X(5).                   00136003
W26603         10  ML020-STORE-NBR-9       REDEFINES                    00137003
W26603             ML020-STORE-NBR         PIC  9(5).                   00138003
W21731         10  ML020-SKU               PIC  X(8).                   00139003
001200         10  ML020-TRANS-CDE         PIC  X(2).                   00140003
001300             88  ML020-PURCHASE              VALUE                00150003
001400                '10'.                                             00160003
001500             88  ML020-SALE                  VALUE                00170003
001600                '20'.                                             00180003
001700             88  ML020-STORE-TRANSFER        VALUE                00190003
001800                '30'.                                             00200003
001900             88  ML020-PRICE-CHANGE          VALUE                00210003
002000                '40' '50'.                                        00220003
002100             88  ML020-MKDOWN                VALUE                00230003
002200                '40'.                                             00240003
002300             88  ML020-MKUP                  VALUE                00250003
002400                '50'.                                             00260003
002500             88  ML020-ADJUSTMENT            VALUE                00270003
002600                '80'.                                             00280003
002700         10  ML020-SYST-ORIG-CDE             PIC  X(2).           00290003
002800             88  ML020-ACCOUNTS-PAYABLE      VALUE                00300003
002900                '01'.                                             00310003
003000             88  ML020-DATA-ENTRY            VALUE                00320003
003100                '02'.                                             00330003
003200             88  ML020-POS                   VALUE                00340003
003300                '03'.                                             00350003
003400             88  ML020-PERM                  VALUE                00360003
003500                '04'.                                             00370003
003600             88  ML020-PROMO                 VALUE                00380003
003700                '05'.                                             00390003
003800             88  ML020-PHYSICAL-INVENTORY    VALUE                00400003
003900                '06'.                                             00410003
004000             88  ML020-MERCHANDISE-LEDGER    VALUE                00420003
004100                '07'.                                             00430003
004110             88  ML020-RECEIPT               VALUE                00440003
004120                '08'.                                             00450003
W21731****         ML020-DEPT-CLASS CONTAINS 'NEW' DPT/SUBCL ATTRIBUTES 00460003
W21731         10  ML020-DEPT-CLASS.                                    00470003
W21731             15  ML020-DEPT-NBR             PIC  9(3).            00480003
W21731             15  ML020-CLASS-NBR            PIC  9(2).            00490003
W21731         10  ML020-MAJOR-CLASS              PIC  9(2).            00500003
W38972         10  ML020-AVAILABLE-FILLER         PIC  X(01).           00510019
W26603     05  ML020-TRANSACTION-DATA             PIC  X(150).          00520003
004300                                                                  00530003
004500     05  ML020-PURCHASE-RECORD              REDEFINES             00540003
004600         ML020-TRANSACTION-DATA.                                  00550003
004700         10  ML020-PURCH-DTE.                                     00560003
004800             15  ML020-PURCH-DTE-MM         PIC  9(2).            00570003
004900             15  ML020-PURCH-DTE-DD         PIC  9(2).            00580003
005000             15  ML020-PURCH-DTE-YY         PIC  9(2).            00590003
005100         10  ML020-PURCH-TYP-CDE            PIC  X(1).            00600003
005200             88  ML020-PURCH-VALID-TYP-CDE    VALUE '1' '2' '3'   00610003
005300                                                    ' '.          00620003
005400             88  ML020-PURCH-TYP-RECEIPT      VALUE '1'.          00630003
005500             88  ML020-PURCH-TYP-TRANSFER     VALUE '2'.          00640003
005600             88  ML020-PURCH-TYP-ADJUSTMENT   VALUE '3'.          00650003
005700             88  ML020-PURCH-TYP-OTHER        VALUE ' '.          00660003
005800         10  ML020-PURCH-RSN-CDE            PIC  X(2).            00670003
005900         10  ML020-PURCH-INIT-BY-CDE        PIC  X(1).            00680003
W26603         10  ML020-PURCH-EXTD-GRO-COST-AMTX.                      00690003
W26603             15  ML020-PURCH-EXTD-GRO-COST-AMT  PIC S9(9)V99.     00700003
W26603         10  ML020-PURCH-FRGT-AMTX.                               00710003
W26603             15  ML020-PURCH-FRGT-AMT           PIC S9(9)V99.     00720003
W26603         10  ML020-PURCH-DISC-AMTX.                               00730003
W26603             15  ML020-PURCH-DISC-AMT           PIC S9(9)V99.     00740003
W26603         10  ML020-PURCH-EXTD-NET-COST-AMTX.                      00750003
W26603             15  ML020-PURCH-EXTD-NET-COST-AMT  PIC S9(9)V99.     00760003
W26603         10  ML020-PURCH-EXTD-RTL-AMTX.                           00770003
W26603             15  ML020-PURCH-EXTD-RTL-AMT       PIC S9(9)V99.     00780003
007000         10  ML020-PURCH-DR-CR-CDE              PIC  X(2).        00790003
007100             88  ML020-PURCH-VALID-DR-CR      VALUE '01'          00800003
007200                                                    '02'          00810003
007300                                                    '07'          00820003
007400                                                    '08'.         00830003
007500             88  ML020-PURCH-CR               VALUE '01'          00840003
007600                                                    '07'.         00850003
007700             88  ML020-PURCH-DR               VALUE '02'          00860003
007800                                                    '08'.         00870003
007900             88  ML020-PURCH-CR-SPLIT-FREIGHT VALUE '07'.         00880003
008000             88  ML020-PURCH-DR-SPLIT-FREIGHT VALUE '08'.         00890003
008100                                                                  00900003
008200         10  ML020-PURCH-AP-TRANS-CDE       PIC  X(2).            00910003
008300         10  ML020-PURCH-JRNL-IND           PIC  X(1).            00920003
008400             88  ML020-PURCH-VALID-JRNL-IND VALUE 'Y' 'N' ' '.    00930003
008500         10  ML020-PURCH-DOC-DTE.                                 00940003
008600             15  ML020-PURCH-DOC-MM         PIC  9(2).            00950003
008700             15  ML020-PURCH-DOC-DD         PIC  9(2).            00960003
008800         10  ML020-PURCH-DOC-5-NBRX.                              00970003
008900             15  ML020-PURCH-DOC-5-NBR      PIC  9(5).            00980003
009000         10  ML020-PURCH-BATCH-NBR          PIC  X(4).            00990003
009100         10  ML020-PURCH-PO-NBRX.                                 01000003
009200             15  ML020-PURCH-PO-NBR         PIC  9(5).            01010003
009300         10  ML020-PURCH-VEND-NBR           PIC  X(5).            01020003
009400         10  ML020-PURCH-KOHLS-MM           PIC  X(2).            01030003
009500         10  FILLER                         PIC  X(7).            01040003
1299RM         10  ML020-PURCH-PO-TYP-CDE         PIC  X(02).           01050003
W26603         10  ML020-PURCH-ENT-IDX.                                 01060003
W26603             15  ML020-PURCH-ENT-ID         PIC  9(09).           01070003
W28582         10  ML020-PURCH-PO-9-NBR           PIC  X(09).           01080005
W28582         10  ML020-PURCH-DOC-16-NBR         PIC  X(16).           01081005
W28582         10  ML020-PURCH-ML-LWST-ID         PIC  S9(9) COMP.      01090008
W32898         10  ML020-PURCH-LBL-SEQ-NBR        PIC  S9(4) COMP.      01091010
W32898         10  ML020-PURCH-FILLER             PIC  X(06).           01092010
009900                                                                  01100003
010000     05  ML020-SALES-RECORD              REDEFINES                01110003
010100         ML020-TRANSACTION-DATA.                                  01120003
010200         10  ML020-SALE-DTE.                                      01130003
010300             15  ML020-SALE-DTE-MM       PIC  9(2).               01140003
010400             15  ML020-SALE-DTE-DD       PIC  9(2).               01150003
010500             15  ML020-SALE-DTE-YY       PIC  9(2).               01160003
010600         10  ML020-SALE-TYP-CDE          PIC  X(1).               01170003
010700         10  ML020-SALE-RSN-CDE          PIC  X(2).               01180003
010800         10  ML020-SALE-INIT-BY-CDE      PIC  X(1).               01190003
W26603         10  ML020-SALE-EXTD-RTL-AMTX.                            01200003
W26603             15  ML020-SALE-EXTD-RTL-AMT PIC S9(11)V99.           01210003
011100         10  ML020-SALE-KOHLS-MM         PIC  X(2).               01220003
011110         10  ML020-SALE-TYPE-2           PIC  X(1).               01230003
011110         10  ML020-SALE-CORR-CDE         PIC  X(1).               01240003
007100             88  ML020-NORMAL-TRANS           VALUE ' '.          01250003
007100             88  ML020-SALES-AUDIT-CORR       VALUE 'S'.          01260003
007100             88  ML020-SYSTEM-LATE-CORR       VALUE 'L'.          01270003
W26603         10  ML020-SALE-FILLER           PIC  X(123).             01280003
011300                                                                  01290003
011400     05  ML020-XFER-RECORD                   REDEFINES            01300003
011500         ML020-TRANSACTION-DATA.                                  01310003
011600         10  ML020-XFER-DTE.                                      01320003
011700             15  ML020-XFER-MM               PIC  9(2).           01330003
011800             15  ML020-XFER-DD               PIC  9(2).           01340003
011900                                                                  01350003
012000***  THE TRANSFER NUMBER CAN BE NUMERIC OR 'FAST '. ***           01360003
012100         10  ML020-XFER-NBR                  PIC  X(5).           01370003
012200         10  ML020-XFER-TYP-CDE              PIC  X(1).           01380003
012300             88  ML020-XFER-VALID-TYP-CDE     VALUE '2'.          01390003
012400             88  ML020-XFER-TYP-CDE-TRANSFER  VALUE '2'.          01400003
012500         10  ML020-XFER-RSN-CDE              PIC  X(2).           01410003
012600         10  ML020-XFER-INIT-BY-CDE          PIC  X(1).           01420003
W26603         10  ML020-XFER-EXTD-RTL-AMTX.                            01430003
W26603             15  ML020-XFER-EXTD-RTL-AMT     PIC S9(11)V99.       01440003
W26603         10  ML020-XFER-QTYX.                                     01450003
W26603             15  ML020-XFER-QTY              PIC S9(11).          01460003
W26603         10  ML020-XFER-PER-UNT-RTL-AMTX.                         01470003
W26603             15  ML020-XFER-PER-UNT-RTL-AMT  PIC S9(11)V99.       01480003
013300         10  ML020-XFER-BATCH-NBR            PIC  X(3).           01490003
W26603         10  ML020-XFER-TO-STORE-NBR         PIC  X(5).           01500003
013500         10  ML020-XFER-KOHLS-MM             PIC  X(2).           01510003
013600         10  ML020-XFER-AP-TRANS-CDE         PIC  X(2).           01520003
013700                                                                  01530003
013800***  THE TRANSFER DOCUMENT NUMBER ONLY USED FOR FAST SYSTEM. ***  01540003
013900         10  ML020-XFER-DOC-NBR.                                  01550003
014000             15  ML020-XFER-DOC-STORE        PIC  9(04).          01560003
014100             15  ML020-XFER-DOC-SEQ          PIC  9(06).          01570003
26006R         10  ML020-XFER-ENT-IDX.                                  01580003
26006R             15  ML020-XFER-ENT-ID           PIC  9(09).          01590003
26006R         10  ML020-XFER-FILLER               PIC  X(69).          01600003
014300                                                                  01610003
014400     05  ML020-PRICE-CHANGE-RECORD         REDEFINES              01620003
014500         ML020-TRANSACTION-DATA.                                  01630003
014600         10  ML020-PC-DTE.                                        01640003
014700             15  ML020-PC-DTE-MM           PIC  9(2).             01650003
014800             15  ML020-PC-DTE-DD           PIC  9(2).             01660003
014900         10  ML020-PC-TYP-CDE              PIC  X(1).             01670003
015000         10  ML020-PC-RSN-CDE              PIC  X(2).             01680003
015100         10  ML020-PC-INIT-BY-CDE          PIC  X(1).             01690003
W26603         10  ML020-PC-OLD-PR-AMTX.                                01700003
W26603             15  ML020-PC-OLD-PR-AMT       PIC S9(11)V99.         01710003
W26603         10  ML020-PC-NEW-PR-AMTX.                                01720003
W26603             15  ML020-PC-NEW-PR-AMT       PIC S9(11)V99.         01730003
W26603         10  ML020-PC-QTYX.                                       01740003
W26603             15  ML020-PC-QTY              PIC S9(11).            01750003
015800         10  ML020-PC-OLD-RSN-CDE          PIC  X(1).             01760003
015900         10  ML020-PC-DOC-5-NBRX.                                 01770003
016000             15  ML020-PC-DOC-5-NBR        PIC  9(5).             01780003
016100         10  ML020-PC-BATCH-NBR.                                  01790003
016200             15  ML020-PC-BATCH-NBR-1      PIC  X(1).             01800003
016300             15  ML020-PC-BATCH-NBR-3      PIC  X(3).             01810003
016400         10  ML020-PC-CATEG-CDE            PIC  X(1).             01820003
016500         10  ML020-PC-DOC-7-NBR            PIC  X(7).             01830003
016600         10  ML020-PC-KOHLS-MM             PIC  X(2).             01840003
016700         10  ML020-PC-MKDN-MKUP-RSN-CDE    PIC  X(3).             01850003
1099RM*        10  ML020-PC-FILLER               PIC  X(48).            01860003
1099RM         10  ML020-PC-VENDOR-INHSE-NMBR    PIC  X(03).            01870003
W26603         10  ML020-PC-ENT-IDX.                                    01880003
W26603             15  ML020-PC-ENT-ID           PIC  9(09).            01890003
W29145         10  ML020-PC-ORIG-CLR-DTE         PIC  X(10).            01900003
W29145         10  ML020-PC-MKDN-CDE             PIC  X(01).            01910003
SR3403         10  ML020-PC-ORIG-RTL-NONGRP      PIC  S9(5)V99.         01921020
W28582         10  ML020-PC-DOC-16-NBR           PIC  X(16).            01930003
W28582         10  ML020-PC-AP-TRANS-CDE         PIC  X(2).             01940003
SR3403         10  ML020-PC-FILLER               PIC  X(34).            01951020
016900                                                                  01960003
017000     05  ML020-ADJUSTMENT-RECORD           REDEFINES              01970003
017100         ML020-TRANSACTION-DATA.                                  01980003
017200         10  ML020-ADJ-DTE.                                       01990003
017300             15  ML020-ADJ-DTE-MM        PIC  9(2).               02000003
017400             15  ML020-ADJ-DTE-DD        PIC  9(2).               02010003
017500             15  ML020-ADJ-DTE-YY        PIC  9(2).               02020003
017600         10  ML020-ADJ-TYP-CDE           PIC  X(1).               02030003
017700         10  ML020-ADJ-RSN-CDE           PIC  X(2).               02040003
017800         10  ML020-ADJ-INIT-BY-CDE       PIC  X(1).               02050003
W26603         10  ML020-ADJ-AT-RTL-AMTX.                               02060003
W26603             15  ML020-ADJ-AT-RTL-AMT    PIC S9(11)V99.           02070003
W26603         10  ML020-ADJ-AT-COST-AMTX.                              02080003
W26603             15  ML020-ADJ-AT-COST-AMT   PIC S9(11)V99.           02090003
018300         10  ML020-ADJ-DOC-5-NBRX.                                02100003
018400             15  ML020-ADJ-DOC-5-NBR     PIC  9(5).               02110003
               10  ML020-ADJ-KOHLS-MM          PIC  X(2).               02120003
W20445         10  ML020-ADJ-ENT-ID            PIC S9(9) COMP.          02130003
W28582         10  ML020-ADJ-ML-LWST-ID        PIC S9(9) COMP.          02140008
W28582         10  ML020-ADJ-FILLER            PIC X(99).               02150004
