000001***************************************************************** 00000109
000002*  MLRD101 - M/L DATE PARAMETER RECORD                          * 00000209
000003*  LENGTH  - 181 BYTES                                          * 00000322
000004***************************************************************** 00000409
000005                                                                  00000509
000006 01  MLRD101-DATE-RECORD.                                         00000609
000007     05  ML101-TM-KY-DTE            PIC   X(10)   VALUE SPACE.    00000709
000008     05  ML101-FSCL-YR-NBR.                                       00000809
000009         10  ML101-FSCL-CC          PIC   9(02)   VALUE ZERO.     00000909
000010         10  ML101-FSCL-YY          PIC   9(02)   VALUE ZERO.     00001009
000011     05  ML101-FSCL-MN-NBR          PIC   9(02)   VALUE ZERO.     00001109
000012     05  ML101-FSCL-MN-NM           PIC   X(09)   VALUE SPACE.    00001209
000015     05  ML101-FSCL-WK-NBR          PIC   9(02)   VALUE ZERO.     00001309
000017     05  ML101-WK-IN-MN-NBR         PIC   9(01)   VALUE ZERO.     00001409
000014     05  ML101-DAY-NM               PIC   X(09)   VALUE SPACE.    00001509
000014     05  ML101-DAY-OF-WK-NBR        PIC   9(01)   VALUE ZERO.     00001609
000018     05  ML101-FSCL-QTR-NBR         PIC   9(01)   VALUE ZERO.     00001709
000018     05  ML101-CAL-MN-NBR           PIC   9(02)   VALUE ZERO.     00001809
000019     05  ML101-JLN-DTE              PIC   9(07)   COMP            00001920
000019                                                  VALUE ZERO.     00002013
000024     05  ML101-LY-THIS-KY-DTE       PIC   X(10)   VALUE SPACE.    00002110
000027     05  ML101-FSCL-YR-BEG-DTE      PIC   X(10)   VALUE SPACE.    00002210
000027     05  ML101-FSCL-YR-END-DTE      PIC   X(10)   VALUE SPACE.    00002310
000027     05  ML101-FSCL-MN-BEG-DTE      PIC   X(10)   VALUE SPACE.    00002410
000027     05  ML101-FSCL-MN-END-DTE      PIC   X(10)   VALUE SPACE.    00002510
000025     05  ML101-FSCL-WK-BEG-DTE      PIC   X(10)   VALUE SPACE.    00002610
000026     05  ML101-FSCL-WK-END-DTE      PIC   X(10)   VALUE SPACE.    00002710
000023     05  ML101-SEA-DESC             PIC   X(06)   VALUE SPACE.    00002810
000029     05  ML101-SEA-BEG-DTE          PIC   X(10)   VALUE SPACE.    00002910
000030     05  ML101-SEA-END-DTE          PIC   X(10)   VALUE SPACE.    00003010
000031     05  ML101-PREV-SEA-END-DTE     PIC   X(10)   VALUE SPACE.    00003110
000032     05  ML101-PFM-END-DTE          PIC   X(10)   VALUE SPACE.    00003210
000032     05  ML101-NFM-END-DTE          PIC   X(10)   VALUE SPACE.    00003310
000032     05  ML101-PFW-END-DTE          PIC   X(10)   VALUE SPACE.    00003421
000040                                                                  00010009
