      ***************************************************************** 00010000
      *    MLRD139 - M/L WEEKLY MAJOR CLASS DB UPDATE TRANSACTION     * 00020000
      *    LENGTH  - 100 BYTES   (TWKMCL)                             * 00030000
      *    WR/PITS#     DATE        DESCRIPTION                       * 00040000
      *    --------   --------     ---------------------------------  * 00050000
      *    W26603     04/14/2004   STORE EXPANSION AND INCREASE       * 00060000
      *                            AMOUNT FIELDS FROM PIC S9(09)V99   * 00070000
      *                            TO PIC S9(11)V99                   * 00080000
      ***************************************************************** 00090000
      *                                                                 00100000
       01  ML139-UPDATE-REC.                                            00110000
           05  ML139-FSCL-WK-NBR              PIC X(02) VALUE SPACE.    00120000
           05  ML139-FSCL-WK-END-DTE          PIC X(10) VALUE SPACE.    00130000
           05  ML139-DEPT-NBR                 PIC X(03) VALUE SPACE.    00140000
           05  ML139-MAJ-CL-NBR               PIC X(02) VALUE SPACE.    00150000
W26603     05  ML139-SLS-RTL-AMT              PIC S9(11)V99             00160000
                                                        COMP-3 VALUE +0.00170000
W26603     05  ML139-MKDN-RTL-AMT             PIC S9(11)V99             00180000
                                                        COMP-3 VALUE +0.00190000
W26603     05  ML139-MKUP-RTL-AMT             PIC S9(11)V99             00200000
                                                        COMP-3 VALUE +0.00210000
W26603     05  ML139-XFER-IN-RTL-AMT          PIC S9(11)V99             00220000
                                                        COMP-3 VALUE +0.00230000
W26603     05  ML139-XFER-OUT-RTL-AMT         PIC S9(11)V99             00240000
                                                        COMP-3 VALUE +0.00250000
W26603     05  ML139-RCPT-RTL-AMT             PIC S9(11)V99             00260000
                                                        COMP-3 VALUE +0.00270000
W26603     05  ML139-RCPT-NET-COST-AMT        PIC S9(11)V99             00280000
                                                        COMP-3 VALUE +0.00290000
W26603     05  ML139-PADJ-RTL-AMT             PIC S9(11)V99             00300000
                                                        COMP-3 VALUE +0.00310000
W26603     05  ML139-PADJ-NET-COST-AMT        PIC S9(11)V99             00320000
                                                        COMP-3 VALUE +0.00330000
W26603     05  ML139-INV-ADJ-RTL-AMT          PIC S9(11)V99             00340000
                                                        COMP-3 VALUE +0.00350000
           05  FILLER                         PIC X(13) VALUE SPACE.    00360000
