      **                                                                        
      **                                                                        
      **      RESERVED FOR THE LARGE RETAIL PROJECT (P03403)                    
      **                                                                        
      **                                                                        
      *****************************************************************         
      *    MLRD017 - PRICE CHANGE RECORD LAYOUT                                 
      *    RECORD LENGTH - 200 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
W21731* W21731   05-18-2002  INCLUDES NON-INTELLIGENT SKU ATTRIBUTES            
W21731*                      (DPT/SCL/MCL) AND COSA PROMOTIONAL PRICE           
W21731*                      CHANGE CODES                                       
W21732* W21732   04-24-2003  CHANGE THE ML017-PC-LINE-NBR RO S9(4) COMP         
W21732*                      - ROD JANSSEN                                      
W25349* W25349   08-22-2003  BUY ONE GET ONE FREE ENHANCEMENT                   
W25349*                      - LIHUA LIANG                                      
W26130* W26130   01-16-2004  ADD ML017-BN-BOGO-II FOR A NEW BATCH NUMBER        
W26130*                      - ROD JANSSEN                                      
W26603* W26603   03-08-2004  ROD JANSSEN MERCH LEDGER STORE EXPANSION           
W28545* W28545   08-18-2005  ROD JANSSEN ADD ML017-BN-UNEARNED-RWDS             
      * W29145   09-20-2005  V. LEE YANG ADD ORIGINAL CLR DATE AND              
      *                      MARKDOWN CODE.                                     
      * S29145   09-20-2005  S. JACKSON ADD ORIG NON-GRP-RTL (DW-SAS)           
      *                      AND PC-DA FIELD (FOR BRAND/VENDOR)                 
      * W34938   10-14-2008  J. PIETROSKE 4 NEW LID REASON CODES                
      *                      CREATED FOR SPRING 2009 POS                        
      * P03403   04-28Ë2012  LARGE RETAIL PROJECT. EXPAND RTL FIELDS            
      *                      TO ALLOW MAX 99999.99                              
W39372* W39372   08-03Ë2012  NEW BATCH NUMBER ADDED FOR MARKDOWN                
W39372*                      MARKUP REASON CODE FROM COSA.                      
205464* CHG0205464 08-16Ë2018  NEW BATCH NUMBER 710 ADDED FOR                   
205464*                        NON-RECEIPTED RETURN.                            
262807* CHG0262807 10-19Ë2021  NEW BATCH NUMBER 720 ADDED FOR                   
262807*                        SEPHORA DISCOUNTS IF USED IN FUTURE.             
      *****************************************************************         
000100 01  ML017-PRICE-CHANGE-RECORD.                                   11/12/93
000200     05  ML017-PC-CDE                  PIC  X(1).                 MLRD017 
000300         88  ML017-VALID-PC-CDE        VALUE '4' '5'.                LV002
000400         88  ML017-MKDOWN              VALUE '4'.                 MLRD017 
000500         88  ML017-MKUP                VALUE '5'.                 MLRD017 
000600     05  ML017-PC-TYP-CDE              PIC  X(1).                 MLRD017 
000500         88  ML017-MARKDOWN            VALUE '1'.                 MLRD017 
000500         88  ML017-MARKDOWN-CANCEL     VALUE '2'.                 MLRD017 
000500         88  ML017-MARKUP              VALUE '3'.                 MLRD017 
000500         88  ML017-MARKUP-CANCEL       VALUE '4'.                 MLRD017 
000700     05  ML017-SLS-CORR-CDE            PIC  X(1).                 MLRD017 
000800         88  ML017-NORMAL-TRANS        VALUE ' '.                         
000900         88  ML017-SALES-AUDIT-CORR    VALUE 'S'.                         
001000         88  ML017-SYSTEM-LATE-CORR    VALUE 'L'.                         
001100     05  ML017-PC-DOC-5-NBR            PIC  X(5).                 MLRD017 
001200     05  FILLER REDEFINES ML017-PC-DOC-5-NBR.                     MLRD017 
001300         10  ML017-PC-DOC-5-DEPT       PIC  9(3).                 MLRD017 
001400         10  ML017-PC-DOC-5-DAY        PIC  9(2).                 MLRD017 
001500     05  ML017-PC-DTE.                                            MLRD017 
001600         10  ML017-PC-DTE-MM           PIC  9(2).                 MLRD017 
001700         10  ML017-PC-DTE-DD           PIC  9(2).                 MLRD017 
001800     05  ML017-PC-KOHLS-MM             PIC  X(2).                 MLRD017 
W21731     05  ML017-PC-SKU                  PIC  X(8).                 MLRD017 
W21731     05  FILLER REDEFINES ML017-PC-SKU.                           MLRD017 
W21731         10  FILLER                    PIC  9(5).                 MLRD017 
W21731         10  ML017-PC-SEQ-NBR          PIC  9(3).                 MLRD017 
002500     05  ML017-PC-RSN-CDE              PIC  X(1).                 MLRD017 
001000         88  ML017-RC-VALID-MKDN-RSN   VALUE '1', '2', '3',               
                                                   '4', '5', '6'.               
001000         88  ML017-RC-VALID-MKUP-RSN   VALUE '1', '2', '3',               
                                                   '4', '5'.                    
001000         88  ML017-RC-PROMOTIONAL      VALUE '1'.                         
001000         88  ML017-RC-FREE-WITH-PURCH  VALUE '4'.                         
001000         88  ML017-RC-MISCELLANEOUS    VALUE '5'.                         
                                                                                
P03403     05  ML017-PC-OLD-PR-AMT           PIC  9(5)V99.              MLRD017 
P03403     05  ML017-PC-NEW-PR-AMT           PIC  9(5)V99.              MLRD017 
002800     05  ML017-PC-QTY                  PIC  9(4).                 MLRD017 
002900     05  FILLER                        PIC  X(1) VALUE SPACE.     MLRD017 
003000     05  ML017-PC-BATCH-NBR            PIC  X(3).                 MLRD017 
001000         88  ML017-BN-MANUAL-LID-CRCT  VALUE '799'.                       
001000         88  ML017-BN-OWN-ADJ-CRCT     VALUE '797'.                       
001000         88  ML017-BN-FWP-VOID-CRCT    VALUE '771'.                       
001000         88  ML017-BN-MANUAL-LID       VALUE '798'.                       
001000         88  ML017-BN-KOHLS-COUPON     VALUE '733'.                       
001000         88  ML017-BN-SENIOR-CITZ-DISC VALUE '728'.                       
001000         88  ML017-BN-OWN-ADJ          VALUE '796'.                       
001000         88  ML017-BN-GOLDSTAR         VALUE '753'.                       
SP0906         88  ML017-BN-OFFER-COUPON     VALUE '760'.                       
SP0906         88  ML017-BN-OFFER-TLD-TIERED VALUE '761'.                       
SP0906         88  ML017-BN-OFFER-LID-TIERED VALUE '762'.                       
SP0906         88  ML017-BN-OFFER-GWP-PWP    VALUE '763'.                       
W39372         88  ML017-BN-UU-GFT-RCPT-RTRN VALUE '765'.                       
001000         88  ML017-BN-PROMOTIONAL      VALUE '746'.                       
W25349         88  ML017-BN-BOGO             VALUE '775'.                       
W26130         88  ML017-BN-BOGO-II          VALUE '777'.                       
W28545         88  ML017-BN-UNEARNED-RWDS    VALUE '780'.                       
001000         88  ML017-BN-OWN-RTN-ADJ      VALUE '792'.                       
001000         88  ML017-BN-EMPLY-DISCOUNT   VALUE '790'.                       
205464         88  ML017-BN-NON-RCPT-RETURN  VALUE '710'.                       
262807         88  ML017-BN-SEPHORA-DISCOUNT VALUE '720'.                       
003100     05  ML017-PC-MKDN-MKUP-RSN-CDE    PIC  X(3).                    CL**2
P03403     05  ML017-PC-DIFFER-AMT           PIC S9(5)V99.                 CL**2
003400     05  ML017-PC-TOT-DOC-QTY          PIC  9(5).                 MLRD017 
W26603     05  ML017-PC-STORE-NBR            PIC  X(5).                 MLRD017 
003600     05  FILLER                        PIC  X(1) VALUE SPACE.     MLRD017 
003700     05  ML017-PC-CATEG-CDE            PIC  X(1).                 MLRD017 
001000         88  ML017-PLU-MKDN-MKON       VALUE '1'.                         
001000         88  ML017-REGISTER-MKDN-MKON  VALUE '2'.                         
001000         88  ML017-UNMATCHED-MKDN-MKON VALUE '3'.                         
001000         88  ML017-BUYER-MKDN-MKON     VALUE '4'.                         
001000         88  ML017-STORE-MKDN-MKON     VALUE '5'.                         
003800     05  ML017-PC-DOC-7-NBR            PIC  X(7).                 MLRD017 
W21731     05  ML017-PC-DOC-7-NBR-PIC9       REDEFINES                          
W21731         ML017-PC-DOC-7-NBR            PIC  9(7).                         
W21731     05  FILLER REDEFINES ML017-PC-DOC-7-NBR.                     MLRD017 
004000         10  ML017-PC-CATEGORY-IND     PIC  9(2).                 MLRD017 
004100         10  ML017-PC-DOC-NBR.                                    MLRD017 
004200             15  ML017-PC-DOC-DEPT     PIC  9(3).                 MLRD017 
004300             15  ML017-PC-DOC-DAY      PIC  9(2).                 MLRD017 
1099RR     05  FILLER                        PIC  X(01) VALUE SPACE.    MLRD017 
1099RM     05  ML017-PC-VENDOR-INHSE-NMBR    PIC  X(03).                MLRD017 
W21731     05  FILLER                        PIC  X(02).                MLRD012I
W21732     05  ML017-PC-LINE-NBR         PIC S9(04) COMP VALUE ZEROS.   MLRD017 
W21731     05  ML017-PC-SKU-DTA-ATTRIB.                                 MLRD017 
W21731         10  ML017-PC-DEPT-CLASS       PIC  X(05).                MLRD017 
W21731         10  ML017-PC-DEPT-CLASS-NUM  REDEFINES                   MLRD017 
W21731             ML017-PC-DEPT-CLASS.                                 MLRD017 
W21731             15  ML017-PC-DEPT-NBR     PIC  9(03).                MLRD017 
W21731             15  ML017-PC-CLASS-NBR    PIC  9(02).                MLRD017 
W21731         10  ML017-PC-MAJ-CLASS        PIC  X(04).                MLRD017 
W26603     05  ML017-POS-NBR.                                                   
W26603         10  ML017-RGST-ID             PIC  S9(04) COMP.                  
W26603         10  ML017-TRN-NBR             PIC  S9(04) COMP.          MLRD017 
W26603         10  ML017-LNE-ITM-SEQ-NBR     PIC  S9(04) COMP.          MLRD017 
W26603     05  ML017-GMM                     PIC X(02).                 MLRD017 
W26603     05  FILLER REDEFINES ML017-GMM.                              MLRD017 
W26603         10  ML017-FILLER              PIC X(01).                 MLRD017 
W26603         10  ML017-DIVISION-NUMBER     PIC 9(01).                 MLRD017 
W26603     05  ML017-DMM                     PIC X(02).                 MLRD017 
W26603     05  ML017-MANAGER-NBR REDEFINES ML017-DMM PIC 9(02).                 
W26603     05  ML017-BUYER                   PIC X(03).                 MLRD017 
W26603     05  FILLER REDEFINES ML017-BUYER.                            MLRD017 
W26603         10  FILLER                    PIC X(01).                 MLRD017 
W26603         10  ML017-BUYER-NUMBER        PIC 9(02).                 MLRD017 
W26603     05  ML017-PC-ENT-ID               PIC S9(9) COMP.            MLRD017 
W29145     05  ML017-ORIG-CLR-DTE            PIC X(10).                 MLRD017 
W29145     05  ML017-MKDN-CDE                PIC X(01).                 MLRD017 
P03403     05  ML017-ORIG-CLR-NONGRP-RTL     PIC 9(5)V99 VALUE ZERO.    MLRD017 
S29145     05  ML017-PC-DA.                                             MLRD017 
S29145         10  ML017-PC-DOC-16-NBR       PIC X(16)  VALUE SPACES.   MLRD017 
S29145         10  ML017-PC-AP-TRANS-CDE     PIC X(02)  VALUE SPACES.   MLRD017 
P03403     05  FILLER                        PIC X(56)  VALUE SPACES.   MLRD017 
