000010***************************************************************** 00010000
000020*    MLRD117 - M/L MONTHLY SUB CLASS DATABASE EXTRACT BY        * 00020000
000021*              DEPARTMENT/STORE FOR THE CURRENT MONTH           * 00030000
000021*    LENGTH  - 85 BYTES                                         * 00031002
000030***************************************************************** 00040000
000040*                                                                 00050000
000100 01  ML117-REC.                                                   00060000
000220     05  ML117-STR-NBR                  PIC S9(04)  COMP VALUE +0.00100001
000200     05  ML117-DEPT-NBR                 PIC X(03) VALUE SPACES.   00101000
001200     05  ML117-MKDN-RTL-AMT             PIC S9(11)V99             00130000
001200                                                  COMP-3 VALUE +0.00140000
001600     05  ML117-NET-XFER-RTL-AMT         PIC S9(11)V99             00170000
001600                                                  COMP-3 VALUE +0.00180000
002000     05  ML117-RCPT-NET-RTL-AMT         PIC S9(11)V99             00210003
002000                                                  COMP-3 VALUE +0.00220000
002400     05  ML117-RCPT-NET-COST-AMT        PIC S9(11)V99             00230000
002400                                                  COMP-3 VALUE +0.00240000
001600     05  ML117-END-INV-RTL-AMT          PIC S9(11)V99             00250002
001600                                                  COMP-3 VALUE +0.00260002
002800     05  FILLER                         PIC X(45) VALUE SPACES.   00310000
