      *****************************************************************         
      *    MLRD002 - MERCH LEDGER NEW PERM SKU/STORE DATA ATTRIBUTES            
      *    RECORD LENGTH - 080 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
32094 * 32094   05-25-2007 ROD JANSSEN * BUILD IN SPEED WITH THE PROCESS        
32094 *                                * STORE SPECIFIC PERM ATTRIB(S)          
32094 *                                  ARE NOT FOUND, TEST TO SEE IF          
32094 *                                  OTHER STORES WITH THE SAME UPC         
32094 *                                  HAD A PRICE CHANGE OCCUR ON THE        
32094 *                                  SAME DAY TO USE THEIR ATTRIB(S)        
      *****************************************************************         
       01  ML002-PERM-PRCHG-ATTRIB-RECS.                                        
           05 ML002-SKU-NBR                 PIC S9(8)V COMP-3.                  
           05 ML002-SKU-NBR-NULL-IND        PIC X(1).                           
           05 ML002-INTR-UPC-ID             PIC S9(09) COMP.                    
           05 ML002-LOC-NBR                 PIC S9(04) COMP.                    
           05 ML002-PRCHG-ID                PIC S9(09) COMP.                    
           05 ML002-EVNT-CTG-CDE            PIC X(3).                           
           05 ML002-PRCHG-TYP-CDE           PIC X(3).                           
           05 ML002-PRCHG-EFF-DTE           PIC X(10).                          
           05 FILLER                        PIC X(48).                          
