      *****************************************************************         
      *    MLRD154 - DETAILED MERCH LEDGER UPDATE TRANSACTION                   
      *    LENGTH  - 400 BYTES                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
      * W27808  07-14-2005 S.JACKSON    ADD STORE-EXPECTED FIELD                
      * W28582  12-08-2005 C.MCCAMMON   CHG ML154-ENT-ID TO ML-LWST-ID.         
      * R28582  04-18-2006 R.MCDONALD   ADD 88 LEVEL FOR INV ADJ TRAN           
      *****************************************************************         
       01  ML154-UPDATE-REC.                                                    
           05 ML154-FSCL-MN-NBR            PIC  X(2).                           
           05 ML154-FSCL-MN-END-DTE        PIC  X(10).                          
           05 ML154-FSCL-WK-NBR            PIC  X(2).                           
           05 ML154-FSCL-WK-END-DTE        PIC  X(10).                          
           05 ML154-DEPT-NBR               PIC  S9(4)V COMP-3.                  
           05 ML154-MAJ-CL-NBR             PIC  S9(4)V COMP-3.                  
           05 ML154-SUB-CL-NBR             PIC  S9(4)V COMP-3.                  
           05 ML154-LOC-NBR                PIC  S9(4) COMP.                     
W28582     05 ML154-ML-LWST-ID             PIC  S9(9) COMP.                     
           05 ML154-SKU-NBR                PIC  S9(8)V COMP-3.                  
           05 ML154-FIN-LIAB-DTE           PIC X(10)   VALUE SPACES.            
           05 ML154-TRN-TYP-CDE            PIC X(02)   VALUE SPACES.            
               88 ML154-PURCH-PURCHASE                 VALUE '10'.              
               88 ML154-SALE                           VALUE '20'.              
               88 ML154-PURCH-TRANS-FRM-STORE          VALUE '30'.              
               88 ML154-PURCH-TRANS-TO-STORE           VALUE '31'.              
               88 ML154-PC-MARKDOWN                    VALUE '40'.              
               88 ML154-PC-MARKUP                      VALUE '50'.              
R28582         88 ML154-INV-ADJ                        VALUE '80'.              
           05 ML154-SLS-REG-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-SLS-PROMO-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-SLS-PROCLR-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-SLS-CLR-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-SLS-OTH-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-PLU-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-PROMO-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-RGST-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-GLDST-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-UMTCH-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-BYR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-STR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-PRPT-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKDN-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKUP-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-XFER-IN-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-XFER-OUT-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RCPT-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RCPT-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RCPT-GRO-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RCPT-FRGT-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-FRGT-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-DISC-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-RTV-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-RTV-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-DA-COST-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-DA-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-OTH-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-PADJ-GRO-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML154-DR-ALW-RTL-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RTV-RTL-AMT            PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKUP-INIT-AMT          PIC  S9(11)V9(2) COMP-3.             
           05 ML154-MKUP-NET-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-INV-ADJ-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-ONORD-RTL-AMT          PIC  S9(11)V9(2) COMP-3.             
           05 ML154-ONORD-COST-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML154-SHNK-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-END-INV-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML154-END-INV-COST-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-GRO-MRGN-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML154-AP-TRANS-CDE           PIC X(02)     VALUE SPACES.          
           05 ML154-IN-TRNST-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML154-RCPT-DISC-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML154-WK-PARTN-NBR           PIC  S9(4) COMP VALUE ZEROS.         
           05 ML154-MTH-PARTN-NBR          PIC  S9(4) COMP VALUE ZEROS.         
           05 ML154-WK-DEPT-GP-CDE         PIC X(01)     VALUE SPACE.           
           05 ML154-MTH-DEPT-GP-CDE        PIC X(01)     VALUE SPACE.           
27808      05 ML154-STR-EXPTED-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 FILLER                       PIC X(07)     VALUE SPACES.          
