      ******************************************************************12/09/92
00002 *     STORE TO STORE TRANSFERS RECORD LAYOUT.  RECORD LENGTH = 80 MLRD005O
PM3403*     PM3403 - LARGER RETAIL EXPANSION PROJECT                    MLRD005O
00003 ******************************************************************   LV001
00004  01  ML005O-STORE-TRANSFER-RECORD.                                MLRD005O
00005      05  ML005O-TRANSACTION-CODE         PIC  9(01) VALUE ZEROS.  MLRD005O
00006      05  FILLER                          PIC  X(01) VALUE SPACE.  MLRD005O
00007      05  ML005O-TRANSFER-FROM-STORE      PIC  9(03) VALUE ZEROS.  MLRD005O
00008      05  ML005O-DOCUMENT-NUMBER          PIC  9(05) VALUE ZEROS.  MLRD005O
00009      05  ML005O-TRANSFER-DATE.                                    MLRD005O
00010          10  ML005O-TRANSFER-DATE-MONTH  PIC  9(02) VALUE ZEROS.  MLRD005O
00011          10  ML005O-TRANSFER-DATE-DAY    PIC  9(02) VALUE ZEROS.  MLRD005O
00012      05  ML005O-KOHLS-MONTH              PIC  9(02) VALUE ZEROS.  MLRD005O
00013      05  FILLER                          PIC  X(03) VALUE SPACE.  MLRD005O
00014      05  ML005O-TRANSFER-UNITS           PIC  9(03) VALUE ZEROS.  MLRD005O
PM3403*    05  ML005O-TRANSFER-RETAIL-PRICE    PIC S9(04)V99.           MLRD005O
PM3403     05  ML005O-TRANSFER-RETAIL-PRICE    PIC S9(05)V99.           MLRD005O
00016      05  ML005O-BATCH-NUMBER             PIC  9(03) VALUE ZEROS.  MLRD005O
00017          88 ML005O-NO-SKU-RECEIPTS-GENERED          VALUE 975     MLRD005O
00018                                                     THRU  997.    MLRD005O
PM3403*    05  FILLER                          PIC  X(05) VALUE SPACE.  MLRD005O
PM3403     05  FILLER                          PIC  X(04) VALUE SPACE.  MLRD005O
00020      05  ML005O-TRANSFER-TO-STORE        PIC  9(03) VALUE ZEROS.  MLRD005O
21731      05  ML005O-SKU                      PIC  9(08) VALUE ZEROES. MLRD005O
21731      05  ML005O-SKU-X REDEFINES ML005O-SKU                                
21731                                          PIC  X(08).                      
21731      05  ML005I-TRANSFER-DOC-NBR.                                         
21731          10  ML005I-TRANSFER-DOC-STORE   PIC  9(04) VALUE ZEROS.          
21731          10  ML005I-TRANSFER-DOC-SEQ     PIC  9(06) VALUE ZEROS.          
21731      05  ML005O-SKU-DTA-ATTRIB.                                   MLRD005O
21731          10  ML005O-DEPARTMENT-NUMBER    PIC  9(03) VALUE ZEROES. MLRD005O
21731          10  ML005O-DEPARTMENT-NUMBER-X REDEFINES                         
21731              ML005O-DEPARTMENT-NUMBER    PIC  X(03).                      
21731          10  ML005O-CLASS-NUMBER         PIC  9(02) VALUE ZEROES. MLRD005O
21731          10  ML005O-CLASS-NUMBER-X REDEFINES                              
21731              ML005O-CLASS-NUMBER         PIC  X(02).                      
21731          10  ML005O-MAJ-CLASS            PIC  9(02) VALUE ZEROES. MLRD005O
21731          10  ML005O-MAJ-CLASS-X REDEFINES                                 
21731              ML005O-MAJ-CLASS            PIC  X(02).                      
21731      05  FILLER                          PIC  X(16) VALUE SPACES. MLRD005O
