000100******************************************************************00010000
000200*  MLRD114 - LEDGER REPORT EXTRACT DATE FILE                      00020000
000300******************************************************************00030000
000400 01  ML114-LEDGER-EXTRACT-DATE-REC.                               00040000
000500     05  ML114-EXTRACT-DTE            PIC X(10) VALUE SPACE.      00050001
000600     05  FILLER                       PIC X     VALUE SPACE.      00060002
000700     05  ML114-EXTRACT-MN-NBR         PIC X(02) VALUE SPACE.      00070001
000800     05  FILLER                       PIC X(67) VALUE SPACE.      00080003
