000100******************************************************************00010000
000200*  MLRD111 - DATA INTEGRITY EXTRACT FILE                          00020000
W26603*  03/22/04 - STORE EXPANSION CHANGES. EXPANDED FILE TO 120       00030000
W26603*             BYTES.                   -RONNA MCDONALD            00040000
W28582*  01/24/07 - BRAND VENDOR CHANGES.  ADDED ML111-DKEY-NBR.        00041003
W28582*                                      -PATRICK BURKE             00042003
001100******************************************************************00050000
001200 01  ML111-DATA-INTEGRITY-EXTR-REC.                               00060000
001300     05  ML111-FSCL-MN-END-DTE        PIC X(10).                  00070000
001400     05  ML111-FSCL-MN-NBR            PIC X(02).                  00080000
001500     05  ML111-DEPT-NBR               PIC X(03).                  00090000
001600     05  ML111-MAJ-CL-NBR             PIC X(02).                  00100000
001700     05  ML111-SUB-CL-NBR             PIC X(02).                  00110000
001800     05  ML111-STR-NBR                PIC S9(4) COMP.             00120000
W26603     05  ML111-SLS-RTL-AMT            PIC S9(11)V99 COMP-3.       00130000
W26603     05  ML111-MKDN-RTL-AMT           PIC S9(11)V99 COMP-3.       00140000
W26603     05  ML111-MKUP-RTL-AMT           PIC S9(11)V99 COMP-3.       00150000
W26603     05  ML111-XFER-IN-RTL-AMT        PIC S9(11)V99 COMP-3.       00160000
W26603     05  ML111-XFER-OUT-RTL-AMT       PIC S9(11)V99 COMP-3.       00170000
W26603     05  ML111-RCPT-RTL-AMT           PIC S9(11)V99 COMP-3.       00180000
W26603     05  ML111-RCPT-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00190000
W26603     05  ML111-PADJ-RTL-AMT           PIC S9(11)V99 COMP-3.       00200000
W26603     05  ML111-PADJ-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00210000
W26603     05  ML111-INV-ADJ-RTL-AMT        PIC S9(11)V99 COMP-3.       00220000
W26603     05  ML111-SHNK-RTL-AMT           PIC S9(11)V99 COMP-3.       00230000
W26603     05  ML111-END-INV-RTL-AMT        PIC S9(11)V99 COMP-3.       00240000
W26603     05  ML111-DKEY-NBR               PIC X(15).                  00250001
