      ***************************************************************** 00010000
      *    MLRD363 - EXPENSE VENDOR FILE                                00020000
      *    LENGTH  - 80 BYTES                                           00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                     00060000
      * ------- ---------- ------------ --------------------------      00070000
      * WR37965 09-01-2009  T.RAMSEYER  INITIAL SET-UP                  00080000
      ***************************************************************** 00090000
       01  ML363-VNDR-REC.                                              00100000
           05  ML363-ENT-ID               PIC 9(09)    VALUE ZEROES.    00110000
           05  ML363-EXP-TYP              PIC S9(4) COMP VALUE +0.      00120000
               88 ML363-EXP-TYP-FREIGHT                VALUE   +1.      00121000
               88 ML363-EXP-TYP-SALVAGE                VALUE   +2.      00122000
               88 ML363-EXP-TYP-LICENSE-FEE            VALUE   +3.      00123000
           05  FILLER                     PIC X(01)    VALUE SPACE.     00130000
           05  ML363-GRP-ID               PIC 9(04)    VALUE ZEROS.     00140000
           05  FILLER                     PIC X(64)    VALUE SPACE.     00150000
