      *****************************************************************         
      *    MLRD001 - MERCH LEDGER TRANSFER RECORD                               
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26602* W26602  04-06-2004 S. JACKSON  MERCH LEDGER STORE EXPANSION             
SR3403* SR3403  03-21-2012 CHANDAN     LARGE RETAILS PROJECT                    
      *****************************************************************         
00001  01  ML001-TRANSFER-RECORD.                                       01/25/95
00002      05  ML001-TRANSFER-CODE             PIC  X(01).              MLRD001 
00003          88  ML001-VALID-TRANSFER-CODE               VALUE '3'.      LV001
00004      05  ML001-TRANSFER-CODE-2           PIC  X(01).                 CL**5
00005          88  ML001-VALID-TRANSFER-TO                 VALUE '1'.      CL**7
00006          88  ML001-VALID-TRANSFER-FROM               VALUE '0'.      CL**7
W26602     05  ML001-STORE-NBR                 PIC  X(05)  VALUE SPACES.   CL**4
00008      05  ML001-TRANSFER-NBR              PIC  X(05)  VALUE SPACES.   CL**4
00009      05  ML001-TRANSFER-DTE.                                         CL**7
00010          10  ML001-TRANSFER-MM           PIC  9(02)  VALUE ZERO.     CL**4
00011          10  ML001-TRANSFER-DD           PIC  9(02)  VALUE ZERO.     CL**4
00012          10  ML001-TRANSFER-YY           PIC  9(02)  VALUE ZERO.     CL**4
00013      05  ML001-TRANSFER-KOHLS-MM         PIC  X(02)  VALUE SPACES.   CL**4
00014      05  FILLER                          PIC  X(01)  VALUE SPACES.   CL**2
00015      05  ML001-TRANSFER-QTY              PIC S9(03)  VALUE ZERO.     CL**4
SR3403     05  ML001-TRANSFER-PER-UNT-RTL-AMT PIC S9(5)V99 VALUE ZERO.     CL**4
00017      05  ML001-TRANSFER-BATCH-NBR        PIC  X(03)  VALUE SPACES.   CL**4
SR3403     05  FILLER                          PIC  X(04)  VALUE SPACES.   CL**2
W26602     05  ML001-RELATED-STORE-NBR         PIC  X(05)  VALUE SPACES.   CL**4
00020      05  ML001-TRANSFER-DEPT-CLASS       PIC  X(05).                 CL**7
00021      05  FILLER REDEFINES ML001-TRANSFER-DEPT-CLASS.                 CL**4
00022          10  ML001-TRANSFER-DEPT-NBR     PIC  X(03).                 CL**8
00023          10  ML001-TRANSFER-CLASS-NBR    PIC  X(02).                 CL**8
00024      05  ML001-TRANSFER-SEQ-NBR          PIC  X(03)  VALUE SPACES.   CL**4
00025      05  ML001-TRANSFER-TYPE             PIC  X(01).                 CL**6
00026          88  ML001-CENTRAL-STOCK                     VALUE 'C'.      CL**4
00027          88  ML001-STORE-TO-STORE                    VALUE 'S'.      CL**7
SR3403     05  ML001-TRANSFER-EXT-RETAIL       PIC S9(08)V99 VALUE ZERO.   CL**6
SR3403     05  FILLER                          PIC  X(18)  VALUE SPACES.   CL**3
