      *****************************************************************         
      *    MLRD024 - ADJUSTMENTS RECORD                                         
      *    RECORD LENGTH - 90 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26603* W26603  03-08-2004 KOHLS       MERCH LEDGER STORE EXPANSION             
R26603* W26603  06-08-2004 ROD JANSSEN INVENTORY ADJUSTMENT TRAUNCATION         
W20445* W20445  09-01-2004 ROD JANSSEN DETAILED INVENTORY ADJUSTMENT            
W28582* W28582  11-21-2005 C. MCCAMMON ADD DATA-LESS KEY FOR INV ADJ.           
      *****************************************************************         
00001  01  ML024-ADJ-RECORD.                                            11/23/93
W26603     05  ML024-ADJ-STORE-NBR          PIC  X(5)     VALUE SPACE.  MLRD024 
W21731     05  ML024-ADJ-SKU                PIC  X(8)     VALUE SPACE.     LV005
00008      05  ML024-ADJ-FIN-LIAB-DTE       PIC  X(10)    VALUE SPACE.  MLRD024 
00009      05  ML024-ADJ-FSCL-YR            PIC  X(4)     VALUE SPACE.  MLRD024 
00010      05  ML024-ADJ-FSCL-PER           PIC  X(2)     VALUE SPACE.  MLRD024 
00011      05  ML024-ADJ-FSCL-WK            PIC  X(1)     VALUE SPACE.  MLRD024 
00012      05  ML024-ADJ-FSCL-DAY           PIC  X(1)     VALUE SPACE.  MLRD024 
00013      05  ML024-ADJ-EDIT-DTE           PIC  X(10)    VALUE SPACE.  MLRD024 
00014      05  ML024-ADJ-SYST-ORIG-CDE      PIC  X(2)     VALUE SPACE.  MLRD024 
00015      05  ML024-ADJ-TRANS-CDE          PIC  X(2)     VALUE SPACE.  MLRD024 
00016          88  ML024-ADJ-ADJUSTMENT                   VALUE '80'.      CL**3
00017      05  ML024-ADJ-TYP-CDE            PIC  X(1)     VALUE SPACE.  MLRD024 
00018      05  ML024-ADJ-RSN-CDE            PIC  X(2)     VALUE SPACE.  MLRD024 
00019      05  ML024-ADJ-INIT-BY-CDE        PIC  X(1)     VALUE SPACE.  MLRD024 
00020      05  ML024-ADJ-ML-IND             PIC  X(1)     VALUE SPACE.  MLRD024 
00021      05  ML024-ADJ-INV-IND            PIC  X(1)     VALUE SPACE.  MLRD024 
R26603     05  ML024-ADJ-AT-RTL-AMT         PIC S9(11)V99  COMP-3       MLRD024 
00023                                                     VALUE ZERO.   MLRD024 
R26603     05  ML024-ADJ-AT-COST-AMT        PIC S9(11)V99  COMP-3       MLRD024 
00025                                                     VALUE ZERO.   MLRD024 
00026      05  ML024-ADJ-DOC-5-NBR          PIC  X(5)     VALUE SPACE.  MLRD024 
00027      05  ML024-ADJ-KOHLS-MM           PIC  X(2)     VALUE SPACE.  MLRD024 
W21731     05  ML024-ADJ-DEPT-CLASS.                                       CL**5
W21731         10  ML024-ADJ-DEPT-NBR       PIC  9(03)    VALUE ZERO.      CL**5
W21731         10  ML024-ADJ-CLASS-NBR      PIC  9(02)    VALUE ZERO.      CL**5
W20445     05  ML024-ADJ-ENT-ID             PIC S9(9) COMP VALUE ZERO.          
W28582     05  ML024-ADJ-LBL-SEQ-NBR        PIC S9(9) COMP VALUE ZERO.          
W28582     05  ML024-ADJ-ML-LWST-ID         PIC S9(9) COMP VALUE ZERO.          
W28582     05  FILLER                       PIC  X(01)    VALUE SPACE.     CL**5
