000100***************************************************************** 00010003
000200*    MLRD127 - COMBINED LEDGER MONTHLY DEPT OPEN TO BUY EXTRACT   00020006
000300*    LENGTH  - 125 BYTES                                          00030006
000310*                                                                 00031006
004210*    WR/PITS#     DATE        DESCRIPTION                         00032206
004220*    --------   --------     ---------------------------------    00032306
004230*    WR10586    05/03/00     ADDED CODE TO PROCESS ADDITIONAL     00032406
004500*    OTB INFORMATION THAT WILL BE USED FOR THE M/L STATISTICS     00032506
004600*    REPORT.  ALSO CHANGED CODE TO LOOK AT 88-LEVELS FOR          00032606
004700*    DETERMINING DATA TYPE, RETAIL OR COST, AND RECORD TYPE.      00032706
004800*                                                                 00032806
004710*    **  W A R N I N G  **                                        00032906
004710*    SOME OF THE RECORD TYPE 88-LEVELS ARE IN LOWER CASE.         00033006
31355 *                                                                 00033106
31355 *    WR# 31355  11/17/2000   ROD JANSSEN                          00033206
31355 *    E-COMMERCE COMBINED LEDGER REPORT MODIFICATION.......        00033306
31355 *                                                                 00033406
000400***************************************************************** 00033503
000500*                                                                 00034003
000600 01  ML127-MNTHLY-OTB-EXTRACT-REC.                                00035003
000700     05  ML127-FSCL-MN-NBR              PIC X(02) VALUE SPACE.    00036003
000800     05  ML127-FSCL-MN-END-DTE          PIC X(10) VALUE SPACE.    00037003
000900     05  ML127-DEPT-NBR                 PIC X(03) VALUE SPACE.    00038003
31355      05  ML127-CHNL-CDE                 PIC X(01) VALUE SPACE.    00038106
001000     05  ML127-SLS-RTL-AMT              PIC S9(09)V99             00039003
001100                                                  COMP-3 VALUE +0.00040003
001200     05  ML127-MKDN-RTL-AMT             PIC S9(09)V99             00050003
001300                                                  COMP-3 VALUE +0.00060003
001400     05  ML127-RCPT-RTL-AMT             PIC S9(09)V99             00070003
001500                                                  COMP-3 VALUE +0.00080003
001600     05  ML127-SHNK-RTL-AMT             PIC S9(09)V99             00090003
001700                                                  COMP-3 VALUE +0.00100003
001800     05  ML127-END-INV-RTL-AMT          PIC S9(09)V99             00110003
001900                                                  COMP-3 VALUE +0.00120003
002000     05  ML127-SLS-COST-AMT             PIC S9(09)V99             00130003
002100                                                  COMP-3 VALUE +0.00140003
002200     05  ML127-TOT-ORD-RTL-AMT          PIC S9(09)V99             00150003
002300                                                  COMP-3 VALUE +0.00160003
002400     05  ML127-APP-ORD-RTL-AMT          PIC S9(09)V99             00170003
002500                                                  COMP-3 VALUE +0.00180003
002600     05  ML127-APP-ORD-COST-AMT         PIC S9(09)V99             00190003
002700                                                  COMP-3 VALUE +0.00200003
002710     05  ML127-GRO-MRGN-AMT             PIC S9(09)V99             00220003
002720                                                  COMP-3 VALUE +0.00230003
002730     05  ML127-RCPT-NET-COST-AMT        PIC S9(09)V99             00240003
002740                                                  COMP-3 VALUE +0.00250003
002750     05  ML127-PADJ-NET-COST-AMT        PIC S9(09)V99             00260003
002760                                                  COMP-3 VALUE +0.00270003
002770     05  ML127-PADJ-RTL-AMT             PIC S9(09)V99             00271003
002780                                                  COMP-3 VALUE +0.00272003
002790     05  ML127-BOM-INV-RTL-AMT          PIC S9(09)V99             00273003
002791                                                  COMP-3 VALUE +0.00274003
31355      05  FILLER                         PIC X(25) VALUE SPACE.    00275006
