      ***************************************************************           
      * COPYBOOK     : MLRD148                                                  
      * DESCRIPTION  : COPYBOOK FOR THE UPDATE TRANSACTIONS FOR THE             
      * WEEKLY CHANNEL TABLES - TWKDPTC.                                        
      * LENGTH  - 250 BYTES                                                     
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
23565 * 23565   09-10-2003 ROD JANSSEN  DETAILED PURCH ADJUSTMENTS ENH.         
25554 * 25554   12-24-2003 PAUL KEBER   MARKDOWN REFINEMENT FOR PLANNING        
W26603* W26603  04-19-2004 R. MCDONALD  STORE EXPANSION PROJECT                 
W27511* W27511  12-27-2004 J. LINDEMANN BROADCAST OPTIMIZATION SPLIT            
W28630* W28630  04-15-2005 S. ASEN      LICENSE FEE SPLIT                       
      *                                                                         
      ****************************************************************          
       01  ML148-REC.                                                           
           05  ML148-FSCL-WK-NBR          PIC X(02).                            
           05  ML148-FSCL-WK-END-DTE      PIC X(10).                            
           05  ML148-DEPT-NBR             PIC X(03).                            
           05  ML148-CHNL-CDE             PIC X(01).                            
W26603     05  ML148-SLS-RTL-AMT          PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKDN-PLU-RTL-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKDN-RGST-RTL-AMT    PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKDN-UNMTCH-RTL-AMT  PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKDN-BYR-RTL-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKDN-STR-RTL-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-MKUP-RTL-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-XFER-IN-RTL-AMT      PIC S9(11)V99  COMP-3.                
W26603     05  ML148-XFER-OUT-RTL-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-RCPT-RTL-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-RCPT-NET-COST-AMT    PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-RTL-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-NET-COST-AMT    PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-FRGT-COST-AMT   PIC S9(11)V99  COMP-3.                
W26603     05  ML148-INV-ADJ-RTL-AMT      PIC S9(11)V99  COMP-3.                
W26603     05  ML148-SHNK-RTL-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-END-INV-RTL-AMT      PIC S9(11)V99  COMP-3.                
           05  ML148-CUM-MKUP-PCT         PIC S9(4)V9(7) COMP-3.                
W26603     05  ML148-END-INV-COST-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-SLS-COST-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-GRO-MRGN-AMT         PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-RTV-COST-AMT    PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-RTV-RTL-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-DA-COST-AMT     PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-DA-RTL-AMT      PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-OTH-COST-AMT    PIC S9(11)V99  COMP-3.                
W26603     05  ML148-PADJ-OTH-RTL-AMT     PIC S9(11)V99  COMP-3.                
25554      05  ML148-MKDN-PROMO-RTL-AMT   PIC S9(11)V99  COMP-3.                
  |        05  ML148-MKDN-PRPT-RTL-AMT    PIC S9(11)V99  COMP-3.                
  |        05  ML148-MKDN-GLDST-RTL-AMT   PIC S9(11)V99  COMP-3.                
25554      05  ML148-MKDN-OTH-RTL-AMT     PIC S9(11)V99  COMP-3.                
W27511     05  ML148-PADJ-BROP-COST-AMT   PIC S9(11)V99  COMP-3.                
W28630     05  ML148-LIC-FEE-COST-AMT     PIC S9(11)V99  COMP-3.                
W30578     05  ML148-MKDN-EMP-RTL-AMT     PIC S9(11)V99  COMP-3.                
           05  FILLER                     PIC X(04).                            
