      *****************************************************************         
      *  MLRD205 - BV ERROR FILE                                      *         
      *  LENGTH  - 247 BYTES                                          *         
      *****************************************************************         
       01  ML205-ERROR-RECORD.                                                  
           05  ML205-ML-TRANSACTION         PIC X(3)   VALUE SPACES.            
           05  ML205-ML-VND-LBL-SEQ-NBR     PIC S9(4)  VALUE 0.                 
           05  ML205-ML-NOTE                PIC X(40)  VALUE SPACES.            
           05  ML205-ML-ERROR-INPUT-REC     PIC X(200) VALUE SPACES.            
