      ***************************************************************           
      * COPYBOOK     : MLRD152                                                  
      * DESCRIPTION  : COPYBOOK FOR THE UPDATE TRANSACTIONS FOR THE             
      * MTHLY CHANNEL TABLES - TMNDPTC.                                         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   --------     ---------------------------------  *         
      *    W26603     04/14/2004   STORE EXPANSION AND INCREASE       *         
      *                            AMOUNT FIELDS FROM PIC S9(09)V99   *         
      *                            TO PIC S9(11)V99                   *         
      ****************************************************************          
       01  ML152-REC.                                                           
           05  ML152-FSCL-MN-NBR         PIC X(02).                             
           05  ML152-FSCL-MN-END-DTE     PIC X(10).                             
           05  ML152-DEPT-NBR            PIC X(03).                             
           05  ML152-CHNL-CDE            PIC X(01).                             
W26603     05  ML152-SLS-RTL-AMT         PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKDN-PLU-RTL-AMT    PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKDN-RGST-RTL-AMT   PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKDN-UNMTCH-RTL-AMT PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKDN-BYR-RTL-AMT    PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKDN-STR-RTL-AMT    PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-MKUP-RTL-AMT        PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-XFER-IN-RTL-AMT     PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-XFER-OUT-RTL-AMT    PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-RCPT-RTL-AMT        PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-RCPT-NET-COST-AMT   PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-PADJ-RTL-AMT        PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-PADJ-NET-COST-AMT   PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-PADJ-FRGT-COST-AMT  PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-INV-ADJ-RTL-AMT     PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-SHNK-RTL-AMT        PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-END-INV-RTL-AMT     PIC S9(11)V99 COMP-3.                  
           05  ML152-CUM-MKUP-PCT        PIC S9(4)V9(7) COMP-3.                 
W26603     05  ML152-END-INV-COST-AMT    PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-SLS-COST-AMT        PIC S9(11)V99 COMP-3.                  
W26603     05  ML152-GRO-MRGN-AMT        PIC S9(11)V99 COMP-3.                  
           05  FILLER                    PIC X(08).                             
