      *****************************************************************         
      *    MLRD988 - MERCH LEDGER AUDIT PCHG DATA INTEGRITY PROCESS             
      *    DATA CREATED BY COMPARSION PROGRAM MLKUT987                          
      *     AND USED BY REPORT PROGRAM MLKRP209                                 
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *****************************************************************         
       01  ML988-PRCHG-REPORT-RECS.                                             
           10 ML988-FSCL-WK-END-DTE         PIC   X(10).                        
           10 ML988-DEPT-NBR                PIC  S9(4)V COMP-3.                 
           10 ML988-MAJ-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML988-SUB-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML988-LOC-NBR                 PIC  S9(4) COMP.                    
           10 ML988-ML-LO-MDSE-LVL-ID       PIC  S9(9) COMP.                    
           10 ML988-TRN-TYP-CDE             PIC   X(03).                        
           10 ML988-WKSUM-PRCHG-AMT         PIC  S9(11)V9(2) COMP-3.            
           10 ML988-AUDIT-PRCHG-AMT         PIC  S9(11)V9(2) COMP-3.            
           10 ML988-PRCHG-RSN-CDE           PIC   X(04).                        
           10 ML988-PRCHG-CTG-CDE           PIC   X(02).                        
           10 ML988-COMPARE-FIELD-NAME      PIC   X(20).                        
           10 FILLER                        PIC   X(12).                        
