      ***************************************************************** 00010000
      *    MLRD084 - ML TRANSPORTATION, SALVAGE, LICENSE DISTRIBUTION   00020001
      *              PERCENT NOT FOUND RECORD LAYOUT.                   00021001
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00060000
      * -------  ----------  ----------------------------------------   00070000
      * W34517   10/30/2008  INITIAL CREATION.                          00080001
      *                      J. SELWITSCHKA                             00090000
      ***************************************************************** 00120000
       01  ML084-DIST-PCT-NOTFND.                                       00130004
           05  ML084-DEPT-NBR          PIC ZZZ9        VALUE ZEROES.    00261005
           05  FILLER                  PIC X(01)       VALUE SPACES.    00261105
           05  ML084-ENT-ID            PIC ZZZZZZZZ9   VALUE ZEROES.    00263005
           05  FILLER                  PIC X(01)       VALUE SPACES.    00264005
           05  ML084-ENT-NAME          PIC X(17)       VALUE SPACES.    00265008
           05  FILLER                  PIC X(01)       VALUE SPACES.    00266007
           05  ML084-PADJ-RTL-AMT      PIC -----------9.99              00267105
                                                       VALUE ZEROES.    00267205
           05  FILLER                  PIC X(01)       VALUE SPACES.    00267305
           05  ML084-PADJ-NET-COST-AMT PIC -----------9.99              00267405
                                                       VALUE ZEROES.    00267505
           05  FILLER                  PIC X(01)       VALUE SPACES.    00267605
           05  ML084-MKDN-RTL-AMT      PIC -----------9.99              00267705
                                                       VALUE ZEROES.    00267805
       01  FILLER REDEFINES ML084-DIST-PCT-NOTFND.                      02090006
           05  ML084-HEADER            PIC X(80).                       02100006
