000010***************************************************************** 00010000
000020*    MLRD136 - M/L WEEKLY SUBCLASS POS DATABASE UPDATE TXN      * 00020000
000021*    LENGTH  - 50 BYTES   (TWKPOSS)                             * 00030000
000010***************************************************************** 00040000
      *    WR/PITS#     DATE        DESCRIPTION                       * 00050000
      *    --------   --------     ---------------------------------  * 00060000
      *    W26603     04/14/2004   STORE EXPANSION AND INCREASE       * 00070000
      *                            AMOUNT FIELDS FROM PIC S9(09)V99   * 00080000
      *                            TO PIC S9(11)V99                   * 00090000
000030***************************************************************** 00100000
000040*                                                                 00110000
000100 01  ML136-UPDATE-REC.                                            00120000
           05  ML136-FSCL-WK-NBR       PIC X(02)          VALUE SPACE.  00130000
000300     05  ML136-FSCL-WK-END-DTE   PIC X(10)          VALUE SPACE.  00140000
000200     05  ML136-DEPT-NBR          PIC X(03)          VALUE SPACE.  00150000
000220     05  ML136-SUB-CL-NBR        PIC X(02)          VALUE SPACE.  00160000
000220     05  ML136-STR-NBR           PIC S9(04)    COMP VALUE +0.     00170000
000220     05  ML136-PO-TYP-CDE        PIC X(02)          VALUE SPACE.  00180000
W26603     05  ML136-RCPT-RTL-AMT      PIC S9(11)V99 COMP-3 VALUE +0.   00190000
W26603     05  ML136-RCPT-NET-COST-AMT PIC S9(11)V99 COMP-3 VALUE +0.   00200000
002800     05  FILLER                  PIC X(15)          VALUE SPACE.  00210000
