      *****************************************************************         
      *    MLRD810 - ML DEPT LEDGER W/O PRIVATE BRAND GIVEBACK                  
      *    RECORD LENGTH - 190 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
      * W?????   08/04/2008  INITIAL CREATION.  -LEE                            
      *****************************************************************         
       01  ML810-MNDPT-WO-PB-GIVEBACK.                                          
           05  ML810-FSCL-MN-NBR           PIC X(02)       VALUE SPACES.        
           05  ML810-FSCL-MN-END-DTE       PIC X(10)       VALUE SPACES.        
           05  ML810-DEPT-NBR              PIC X(03)       VALUE SPACES.        
           05  ML810-SLS-RTL-AMT           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-MKDN-RTL-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-MKUP-RTL-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-XFER-IN-RTL-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-XFER-OUT-RTL-AMT      PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-RCPT-RTL-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-RCPT-NET-COST-AMT     PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-PADJ-RTL-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-PADJ-NET-COST-AMT     PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-PADJ-GIVEBK-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-INV-ADJ-RTL-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-SHNK-RTL-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-END-INV-RTL-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-CUM-MKUP-PCT          PIC S9(4)V9(7)  VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-END-INV-COST-AMT      PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-SLS-COST-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-GRO-MRGN-AMT          PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-ML-CUM-MKUP-PCT       PIC S9(4)V9(7)  VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-ML-END-INV-COST-AMT   PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-ML-SLS-COST-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-ML-GRO-MRGN-AMT       PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-VAR-END-INV-COST-AMT  PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-VAR-SLS-COST-AMT      PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  ML810-VAR-GRO-MRGN-AMT      PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
           05  FILLER                      PIC X(09)       VALUE SPACES.        
