      ***************************************************************           
      * COPYBOOK     : MLRD146                                                  
      * DESCRIPTION  : COPYBOOK FOR THE UPDATE TRANSACTIONS FOR THE             
      * WEEKLY MAJOR CLASS/STORE TABLE(TWKDPTS).                                
W26603*  STORE EXPANSION PROJECT - R. MCDONALD                                  
      ****************************************************************          
       01  ML146-REC.                                                           
           05 ML146-FSCL-WK-NBR         PIC X(02).                              
           05 ML146-FSCL-WK-END-DTE     PIC X(10).                              
           05 ML146-DEPT-NBR            PIC X(03).                              
           05 ML146-STR-NBR             PIC S9(04)    COMP.                     
W26603     05 ML146-SLS-RTL-AMT         PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-MKDN-RTL-AMT        PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-MKUP-RTL-AMT        PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-XFER-IN-RTL-AMT     PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-XFER-OUT-RTL-AMT    PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-RCPT-RTL-COST-AMT   PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-RCPT-NET-COST-AMT   PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-PADJ-RTL-AMT        PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-PADJ-NET-COST-AMT   PIC S9(11)V99 COMP-3.                   
W26603     05 ML146-INV-ADJ-RTL-AMT     PIC S9(11)V99 COMP-3.                   
W26603     05 FILLER                    PIC X(13).                              
