      *****************************************************************         
      *    MLRD987 - MERCH LEDGER AUDIT PADJ DATA INTEGRITY PROCESS             
      *    DATA CREATED BY COMPARSION PROGRAM MLKUT987                          
      *     AND USED BY REPORT PROGRAM MLKRP209                                 
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *****************************************************************         
       01  ML987-PADJ-REPORT-RECS.                                              
           10 ML987-FSCL-WK-END-DTE         PIC   X(10).                        
           10 ML987-DEPT-NBR                PIC  S9(4)V COMP-3.                 
           10 ML987-MAJ-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML987-SUB-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML987-LOC-NBR                 PIC  S9(4) COMP.                    
           10 ML987-ML-LO-MDSE-LVL-ID       PIC  S9(9) COMP.                    
           10 ML987-TRN-TYP-CDE             PIC   X(03).                        
           10 ML987-WKSUM-PADJ-AMT          PIC  S9(11)V9(2) COMP-3.            
           10 ML987-AUDIT-PADJ-AMT          PIC  S9(11)V9(2) COMP-3.            
           10 ML987-FINCL-PRC-GP-CDE        PIC   X(06).                        
           10 ML987-AP-TRN-CDE              PIC   X(02).                        
           10 ML987-DRCR-CDE                PIC   X(02).                        
           10 ML987-COMPARE-FIELD-NAME      PIC   X(20).                        
           10 FILLER                        PIC   X(08).                        
