      *****************************************************************         
      *    MLRD901 - ML'S WEEKLY SUMMARY COMMON EXTRACT DATE CONTROL            
      *    RECORD LENGTH - 080 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
      *                                                                         
      *****************************************************************         
       01  ML901-WKLY-SUM-EXTRACT-DATES.                                        
           05  FILLER                      PIC   X(01)     VALUE SPACES.        
               88  ML901-COMMENT-RECORD                    VALUE '*'.           
               88  ML901-NOT-COMMENT-RECORD                VALUE SPACE.         
           05  ML901-BEG-FSCL-WK-END-DTE   PIC   X(10)     VALUE SPACES.        
           05  FILLER REDEFINES ML901-BEG-FSCL-WK-END-DTE.                      
               10  ML901-BEG-FSCL-DTE-CCYY PIC   X(04).                         
               10  FILLER                  PIC   X(01).                         
                   88  ML901-BEG-DTE-VALID-DASH-1          VALUE '-'.           
               10  ML901-BEG-FSCL-DTE-MM   PIC   X(02).                         
               10  FILLER                  PIC   X(01).                         
                   88  ML901-BEG-DTE-VALID-DASH-2          VALUE '-'.           
               10  ML901-BEG-FSCL-DTE-DD   PIC   X(02).                         
           05  FILLER                      PIC   X(01)     VALUE SPACES.        
           05  ML901-END-FSCL-WK-END-DTE   PIC   X(10)     VALUE SPACES.        
           05  FILLER REDEFINES ML901-END-FSCL-WK-END-DTE.                      
               10  ML901-END-FSCL-DTE-CCYY PIC   X(04).                         
               10  FILLER                  PIC   X(01).                         
                   88  ML901-END-DTE-VALID-DASH-1          VALUE '-'.           
               10  ML901-END-FSCL-DTE-MM   PIC   X(02).                         
               10  FILLER                  PIC   X(01).                         
                   88  ML901-END-DTE-VALID-DASH-2          VALUE '-'.           
               10  ML901-END-FSCL-DTE-DD   PIC   X(02).                         
           05  FILLER                      PIC   X(01)     VALUE SPACES.        
           05  ML901-RECORDS-EXTRACTED     PIC   9(12)     VALUE ZEROES.        
           05  FILLER                      PIC   X(45)     VALUE SPACES.        
