000100******************************************************************        
000200*     STORE TO STORE TRANSFERS RECORD LAYOUT.  RECORD LENGTH = 80         
PM3403*     PM3403 - LARGER RETAIL EXPANSION PROJECT                    MLRD005O
000300******************************************************************        
000400 01  ML005I-STORE-TRANSFER-RECORD.                                        
000500     05  ML005I-TRANSACTION-CODE         PIC  9(01) VALUE ZEROS.          
000600     05  FILLER                          PIC  X(01) VALUE SPACE.          
000700     05  ML005I-TRANSFER-FROM-STORE      PIC  9(03) VALUE ZEROS.          
000800     05  ML005I-DOCUMENT-NUMBER          PIC  9(05) VALUE ZEROS.          
000900     05  ML005I-DOCUMENT-NUMBER-X REDEFINES                               
001000         ML005I-DOCUMENT-NUMBER          PIC  X(05).              00100001
001100     05  ML005I-TRANSFER-DATE.                                    00110001
001200         10  ML005I-TRANSFER-DATE-MONTH  PIC  9(02) VALUE ZEROS.  00120001
001300         10  ML005I-TRANSFER-DATE-DAY    PIC  9(02) VALUE ZEROS.  00130001
001400     05  ML005I-KOHLS-MONTH              PIC  9(02) VALUE ZEROS.  00140001
001500     05  FILLER                          PIC  X(03) VALUE SPACE.  00150001
001600     05  ML005I-TRANSFER-UNITS           PIC  9(03) VALUE ZEROS.  00160001
PM3403*    05  ML005I-TRANSFER-RETAIL-PRICE    PIC S9(04)V99.           00170001
PM3403     05  ML005I-TRANSFER-RETAIL-PRICE    PIC S9(05)V99.           00170001
001800     05  ML005I-BATCH-NUMBER             PIC  9(03) VALUE ZEROS.  00180001
001900         88 ML005I-NO-SKU-RECEIPTS-GENERED          VALUE 975     00190001
002000                                                    THRU  997.    00200001
PM3403*    05  FILLER                          PIC  X(05) VALUE SPACE.  00210001
PM3403     05  FILLER                          PIC  X(04) VALUE SPACE.  00210001
002200     05  ML005I-TRANSFER-TO-STORE        PIC  9(03) VALUE ZEROS.  00220001
21731      05  ML005I-SKU                      PIC  9(08) VALUE ZEROES. 00230001
21731      05  ML005I-SKU-X REDEFINES ML005I-SKU                                
21731                                          PIC  X(08).                      
002700     05  ML005I-TRANSFER-DOC-NBR.                                 00270001
002800         10  ML005I-TRANSFER-DOC-STORE   PIC  9(04) VALUE ZEROS.  00280001
002900         10  ML005I-TRANSFER-DOC-SEQ     PIC  9(06) VALUE ZEROS.  00290001
21731      05  ML005I-SKU-DTA-ATTRIB.                                   00230001
21731          10  ML005I-DEPARTMENT-NUMBER    PIC  9(03) VALUE ZEROES. 00240001
21731          10  ML005I-DEPARTMENT-NUMBER-X REDEFINES                 00240001
21731              ML005I-DEPARTMENT-NUMBER    PIC  X(03).              00240001
21731          10  ML005I-CLASS-NUMBER         PIC  9(02) VALUE ZEROES. 00250001
21731          10  ML005I-CLASS-NUMBER-X REDEFINES                      00250001
21731              ML005I-CLASS-NUMBER         PIC  X(02).              00250001
21731          10  ML005I-MAJ-CLASS            PIC  9(02) VALUE ZEROES. 00260001
21731          10  ML005I-MAJ-CLASS-X REDEFINES ML005I-MAJ-CLASS        00260001
21731                                          PIC  X(02).              00260001
21731      05  FILLER                          PIC  X(16) VALUE SPACE.  00300001
