      ******************************************************************        
      *    MLRD090 - AUDIT DETAIL TRANSACTION                                   
      *    LENGTH  - 200 BYTES                                                  
      *                                                                         
      * CHANGE HISTORY:                                                         
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
      * W37965  02-12-2010 SURENDAR B   INITIAL IMPLEMENTATION                  
      ******************************************************************        
       01  ML090-AUDIT-REC.                                                     
           05  ML090-FSCL-WK-END-DTE             PIC X(10).                     
           05  ML090-PRCG-DTE                    PIC X(10).                     
           05  ML090-DEPT-NBR                    PIC S9(04) COMP-3.             
           05  ML090-MAJ-CL-NBR                  PIC S9(04) COMP-3.             
           05  ML090-SUB-CL-NBR                  PIC S9(04) COMP-3.             
           05  ML090-LOC-NBR                     PIC S9(04) COMP.               
           05  ML090-ML-LO-MDSE-LVL-ID           PIC S9(09) COMP.               
           05  ML090-ORIG-ENT-ID                 PIC S9(09) COMP                
                                                  VALUE ZEROES.                 
           05  ML090-ORIG-LBL-SEQ-NBR            PIC S9(09) COMP                
                                                  VALUE ZEROES.                 
           05  ML090-DUMMY-SKU-IND               PIC X(01) VALUE SPACES.        
           05  ML090-FINCL-PRC-GP-CDE            PIC X(06) VALUE SPACES.        
           05  ML090-SRC-SYS-ID                  PIC S9(04) COMP                
                                                  VALUE ZEROES.                 
           05  ML090-TRN-TYP-CDE                 PIC X(03) VALUE SPACES.        
           05  ML090-AP-TRN-CDE                  PIC X(02) VALUE SPACES.        
           05  ML090-DR-CR-CDE                   PIC X(02) VALUE SPACES.        
           05  ML090-SLS-TYP-CDE                 PIC X(01) VALUE SPACES.        
           05  ML090-PRCHG-RSN-CDE               PIC X(04) VALUE SPACES.        
           05  ML090-PRCHG-CTG-CDE               PIC X(02) VALUE SPACES.        
           05  ML090-ENT-ID                      PIC S9(09) COMP.               
           05  ML090-LBL-SEQ-NBR                 PIC S9(09) COMP.               
           05  ML090-PADJ-GRO-COST-AMT           PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-PADJ-NET-COST-AMT           PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-PADJ-RTL-AMT                PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-SLS-RTL-AMT                 PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-PRCHG-RTL-AMT               PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-INV-ADJ-RTL-AMT             PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-INV-ADJ-COST-AMT            PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-PADJ-DISC-COST-AMT          PIC S9(11)V9(2) COMP-3         
                                                  VALUE ZEROES.                 
           05  ML090-PRORATE-IND                 PIC X(01) VALUE SPACES.        
               88 ML090-PRORATE-REVERSAL          VALUE 'R'.                    
               88 ML090-PRORATE-ALLOCATE          VALUE 'A'.                    
           05  FILLER                            PIC X(69) VALUE SPACES.        
