      *****************************************************************         
      *    MLRD155 - WK DETAILED MERCH LEDGER UPDATE TRANSACTION                
      *    LENGTH  - 400 BYTES                                                  
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PROGRAMMER   DESCRIPTION                             
      * ------- ---------- ------------ --------------------------              
      * W28582  12/08/2005 C. MCCAMMON  CHG ML155-ENT-ID TO ML-LWST-ID.         
      *****************************************************************         
       01  ML155-UPDATE-REC.                                                    
           05 ML155-FSCL-WK-NBR            PIC  X(2).                           
           05 ML155-FSCL-WK-END-DTE        PIC  X(10).                          
           05 ML155-DEPT-NBR               PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML155-MAJ-CL-NBR             PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML155-SUB-CL-NBR             PIC  S9(4)V COMP-3                   
                                                VALUE ZEROES.                   
           05 ML155-LOC-NBR                PIC  S9(4) COMP                      
                                                VALUE ZEROES.                   
W28582     05 ML155-ML-LWST-ID             PIC  S9(9) COMP                      
                                                VALUE ZEROES.                   
           05 ML155-SLS-REG-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-SLS-PROMO-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-SLS-PROCLR-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-SLS-CLR-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-SLS-OTH-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-PLU-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-PROMO-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-RGST-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-GLDST-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-UMTCH-RTL-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-BYR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-STR-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-PRPT-RTL-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKDN-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML155-MKUP-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML155-XFER-IN-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-XFER-OUT-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-RCPT-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML155-RCPT-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-RCPT-GRO-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-RTL-AMT           PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-FRGT-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-DISC-COST-AMT     PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-RTV-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-RTV-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-DA-COST-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-DA-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-NET-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-OTH-COST-AMT      PIC  S9(11)V9(2) COMP-3.             
           05 ML155-PADJ-OTH-RTL-AMT       PIC  S9(11)V9(2) COMP-3.             
           05 ML155-DR-ALW-RTL-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML155-RTV-RTL-AMT            PIC  S9(11)V9(2) COMP-3.             
           05 ML155-INV-ADJ-RTL-AMT        PIC  S9(11)V9(2) COMP-3.             
           05 ML155-ONORD-RTL-AMT          PIC  S9(11)V9(2) COMP-3.             
           05 ML155-ONORD-COST-AMT         PIC  S9(11)V9(2) COMP-3.             
           05 ML155-WK-PARTN-NBR           PIC  S9(4) COMP  VALUE ZEROS.        
           05 FILLER                       PIC X(119)   VALUE SPACES.           
