                                                                                
000100 01  ML022-SALE-RECORD.                                                   
W26603     05  ML022-SALE-STORE-NBR         PIC  X(5)     VALUE SPACE.          
W21731     05  ML022-SALE-SKU               PIC  X(8)     VALUE SPACES.         
000800     05  ML022-SALE-FIN-LIAB-DTE      PIC  X(10)    VALUE SPACE.          
000900     05  ML022-SALE-FSCL-YR           PIC  X(4)     VALUE SPACE.          
001000     05  ML022-SALE-FSCL-PER          PIC  X(2)     VALUE SPACE.          
001100     05  ML022-SALE-FSCL-WK-NBR       PIC  9(2)     VALUE 0.              
001200     05  ML022-SALE-FSCL-WK           PIC  X(1)     VALUE SPACE.          
001300     05  ML022-SALE-FSCL-DAY          PIC  X(1)     VALUE SPACE.          
001400     05  ML022-SALE-EDIT-DTE          PIC  X(10)    VALUE SPACE.          
001500     05  ML022-SALE-SYST-ORIG-CDE     PIC  X(2)     VALUE SPACE.          
001600     05  ML022-SALE-TRANS-CDE         PIC  X(2)     VALUE SPACE.          
001700         88  ML022-SALE                             VALUE '20'.           
001800     05  ML022-SALE-TYP-CDE           PIC  X(1)     VALUE SPACE.          
001900     05  ML022-SALE-RSN-CDE           PIC  X(2)     VALUE SPACE.          
002000     05  ML022-SALE-INIT-BY-CDE       PIC  X(1)     VALUE SPACE.          
002100     05  ML022-SALE-ML-IND            PIC  X(1)     VALUE SPACE.          
002200     05  ML022-SALE-INV-IND           PIC  X(1)     VALUE SPACE.          
002300     05  ML022-SALE-EXTD-RTL-AMT      PIC S9(7)V99  COMP-3                
002400                                                    VALUE ZERO.           
002500     05  ML022-SALE-KOHLS-MM          PIC  X(2)     VALUE SPACE.          
002600     05  ML022-SALE-TYPE-2            PIC  X(01)    VALUE SPACE.          
               88  ML022-SALE-CLEARANCE                   VALUE  'C'.           
               88  ML022-SALE-PROMO-GOLDSTAR              VALUE  'G'.           
               88  ML022-SALE-PROMO                       VALUE  'P'.           
               88  ML022-SALE-REGULAR                     VALUE  'R'.           
002600     05  ML022-SALE-CORR-CDE          PIC  X(01)    VALUE SPACE.          
002600         88  ML022-NORMAL-TRANS                     VALUE ' '.            
002600         88  ML022-SALES-AUDIT-CORR                 VALUE 'S'.            
002600         88  ML022-SYSTEM-LATE-CORR                 VALUE 'L'.            
W21731     05  ML022-SALE-DEPT-CLASS.                                           
  |            10  ML022-SALE-DEPT-NBR      PIC  9(03)    VALUE ZERO.           
W21731         10  ML022-SALE-CLASS-NBR     PIC  9(02)    VALUE ZERO.           
W28582     05  ML022-SALE-ENT-ID            PIC S9(09)    COMP                  
W28582                                                    VALUE ZERO.           
W28582     05  ML022-SALE-LBL-SEQ-NBR       PIC S9(09)    COMP                  
W28582                                                    VALUE ZERO.           
W28582     05  ML022-SALE-ML-LWST-ID        PIC S9(09)    COMP                  
W28582                                                    VALUE ZERO.           
W34517*    05  FILLER                       PIC  X(01)    VALUE SPACE.          
W34517     05  ML022-SALE-REC-TYPE          PIC  9(01)    VALUE ZERO.           
W34517         88  ML022-SALE-ORIGINAL                    VALUE 1.              
W34517         88  ML022-SALE-REVERSAL                    VALUE 2.              
W34517         88  ML022-SALE-REASSIGN                    VALUE 3.              
W34517         88  ML022-SALE-UNCHNGED                    VALUE 4.              
