000100******************************************************************00010000
000200*  MLRD135 - LEDGER REPORT EXTRACT DATE FILE-THE EXTRACT DATE     00020000
      *            MUST BE A VALID FISCAL WEEK END DATE                 00030000
000300******************************************************************00040000
000400 01  ML135-LEDGER-EXTRACT-DATE-REC.                               00050000
000500     05  ML135-EXTRACT-DTE            PIC X(10) VALUE SPACE.      00060000
000600     05  FILLER                       PIC X(70) VALUE SPACE.      00070000
