      ******************************************************************00000100
      * MLRD031 - WEEKLY RECEIPTS AT THE DEPARTMENT LEVEL               00000203
      *           RECORD LENGTH = 80                                    00000300
      ******************************************************************00000400
       01  ML031-WKLY-RECEIPTS-DEPT-REC.                                00000503
           05  ML031-WKLY-RECEIPTS-KEY.                                 00000603
               10  ML031-WKLY-RECEIPTS-GMA-NBR     PIC X(02).           00000703
               10  ML031-WKLY-RECEIPTS-DMA-NBR     PIC X(02).           00000803
               10  ML031-WKLY-RECEIPTS-BYR-NBR     PIC X(03).           00000903
               10  ML031-WKLY-RECEIPTS-DPT-NBR     PIC X(03).           00001003
           05  ML031-WKLY-RECEIPTS-DEPT-RETL       PIC S9(11)V99 COMP.  00001103
           05  ML031-WKLY-RECEIPTS-DEPT-COST       PIC S9(11)V99 COMP.  00001203
           05  FILLER                              PIC X(54).           00002000
