       01  MLK446-ERROR-RECORD.                                                 
           05  MLK446-ONORD-ITEM-NBR          PIC   S9(15)V     COMP-3.         
           05  MLK446-ONORD-WEEK-DATE         PIC   X(10).                      
           05  MLK446-ONORD-IN-DC-DATE        PIC   X(10).                      
           05  MLK446-ONORD-STORE-NBR         PIC  S9(04)       COMP.           
           05  FILLER                         PIC   X(01).                      
           05  MLK446-ONORD-STATUS-CODE       PIC   X(02).                      
           05  MLK446-ONORD-UNIT-QTY          PIC   S9(09)V     COMP-3.         
           05  MLK446-ONORD-COST-AMT          PIC   S9(09)V9(2) COMP-3.         
           05  MLK446-ONORD-RTL-AMT           PIC   S9(09)V9(2) COMP-3.         
           05  MLK446-ONORD-PO-NBR            PIC   S9(09)V     COMP-3.         
           05  MLK446-ONORD-BOUGHT-DATE       PIC   X(06).                      
           05  MLK446-ONORD-PROMO-IND         PIC   X(01).                      
           05  MLK446-ONORD-PROMO-QTY         PIC   S9(09)V     COMP-3.         
           05  MLK446-ONORD-SKU               PIC   S9(08)V     COMP-3.         
           05  MLK446-ONORD-ENT-ID            PIC   S9(09)      COMP.           
           05  MLK446-ONORD-GROUP-CODE        PIC   X(03).                      
           05  MLK446-ONORD-LONG-VENDOR-STYLE PIC   X(20).                      
           05  MLK446-ONORD-PO-TYP-CDE        PIC   X(02).                      
           05  MLK446-ONORD-DEPT-NBR          PIC   X(03).                      
                                                                                
