      *****************************************************************         
      *    MLRD030 - BRAND VENDOR PURCHASES                                     
      *    RECORD LENGTH - 200 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W28582* W28582  11-22-2005 C. MCCAMMON NEW COPYBOOK. COPY C/B MLRD021 -         
W28582*                                 EXPAND LRECL & ADD NEW FIELDS.          
W28582* W28582  03-01-2006 C. SCHWENN   ADDED 88 LEVELS TO                      
W28582* W28582                          ML030-PURCH-AP-TRANS-CDE                
W30578* WR30578 5-24-2006 R. MCDONALD ADD '2F' AP TRAN CODE THIS                
W30578*                               ANOTHER DEBIT ALLOWANCE                   
W28582* WR28582 5-11-2007 S. JACKSON  ADD '2H' '2I' AS DEBIT-ALLOW              
W28582*                               TRANCODE (MATCH CHANNEL LOGIC)            
W34517* WR34517 5-16-2008 J. SELWITSCHKA                                        
W34517*                               ADD RECORD TYPE INDICATOR.                
      *****************************************************************         
000100 01  ML030-PURCH-RECORD.                                                  
W26603     05  ML030-PURCH-STORE-NBR        PIC X(5)      VALUE SPACE.          
W21731     05  ML030-PURCH-SKU              PIC X(8)      VALUE SPACE.          
000800     05  ML030-PURCH-FIN-LIAB-DTE     PIC  X(10)    VALUE SPACE.          
000900     05  ML030-PURCH-FSCL-YR          PIC  X(4)     VALUE SPACE.          
001000     05  ML030-PURCH-FSCL-PER         PIC  X(2)     VALUE SPACE.          
001100     05  ML030-PURCH-FSCL-WK          PIC  X        VALUE SPACE.          
001200     05  ML030-PURCH-FSCL-DAY         PIC  X        VALUE SPACE.          
001300     05  ML030-PURCH-EDIT-DTE         PIC  X(10)    VALUE SPACE.          
001400     05  ML030-PURCH-SYST-ORIG-CDE    PIC  X(2)     VALUE SPACE.          
21591          88  ML030-PHYSICAL-INVENTORY               VALUE '06'.           
001410         88  ML030-PURCH-RECEIPT                    VALUE '08'.           
001500     05  ML030-PURCH-TRANS-CDE        PIC  X(2)     VALUE SPACE.          
001600         88  ML030-PURCH-PURCHASE                   VALUE '10'.           
001700         88  ML030-PURCH-TRANSFER-FRM-STORE         VALUE '30'.           
001800         88  ML030-PURCH-TRANSFER-TO-STORE          VALUE '31'.   00180000
001900     05  ML030-PURCH-TYP-CDE          PIC  X        VALUE SPACE.  00190000
002000     05  ML030-PURCH-RSN-CDE          PIC  X(2)     VALUE SPACE.  00200000
002100     05  ML030-PURCH-INIT-BY-CDE      PIC  X        VALUE SPACE.  00210000
002200     05  ML030-PURCH-ML-IND           PIC  X        VALUE SPACE.  00220000
002300     05  ML030-PURCH-INV-IND          PIC  X        VALUE SPACE.  00230000
002400     05  ML030-PURCH-EXTD-GRO-COST-AMT                            00240000
002500                                      PIC S9(7)V99  VALUE ZERO    00250000
002600                                                    COMP-3.       00260000
002700     05  ML030-PURCH-FRGT-AMT         PIC S9(7)V99  VALUE ZERO    00270000
002800                                                    COMP-3.       00280000
002900     05  ML030-PURCH-DISC-AMT         PIC S9(7)V99  VALUE ZERO    00290000
003000                                                    COMP-3.       00300000
003100     05  ML030-PURCH-EXTD-NET-COST-AMT                            00310000
003200                                      PIC S9(7)V99  VALUE ZERO    00320000
003300                                                    COMP-3.       00330000
003400     05  ML030-PURCH-EXTD-RTL-AMT     PIC S9(7)V99  VALUE ZERO    00340000
003500                                                    COMP-3.       00350000
003600     05  ML030-PURCH-DR-CR-CDE        PIC  X(2)     VALUE SPACE.  00360000
003700     05  ML030-PURCH-AP-TRANS-CDE     PIC  X(2)     VALUE SPACE.  00370000
               88  ML030-AP-RETURN-TO-VENDOR  VALUES '20' '21' '22'             
                                                     '55' '54' '0A'.            
W30578         88  ML030-AP-DEBIT-ALLOWANCE   VALUES '24' '2F'                  
W28582                                               '2H' '2I'.                 
W26603     05  ML030-PURCH-REL-STORE-NBR    PIC  X(5)     VALUE SPACE.  00380000
003900     05  ML030-PURCH-QTY              PIC S9(9)     COMP-3        00390000
004000                                                    VALUE ZERO.   00400000
004100     05  ML030-PURCH-PER-UNT-RTL-AMT  PIC S9(5)V99  VALUE ZERO    00410000
004200                                                    COMP-3.       00420000
004300     05  ML030-PURCH-JRNL-IND         PIC  X(1)     VALUE SPACE.  00430000
004400     05  ML030-PURCH-DOC-DTE          PIC  X(10)    VALUE SPACE.  00440000
004500     05  ML030-PURCH-DOC-5-NBR        PIC  X(5)     VALUE SPACE.  00450000
004600     05  ML030-PURCH-BATCH-NBR        PIC  X(4)     VALUE SPACE.  00460000
004700     05  ML030-PURCH-PO-NBR           PIC  9(5)     VALUE ZERO.   00470000
004800     05  ML030-PURCH-VEND-NBR         PIC  X(5)     VALUE SPACE.  00480000
004900     05  ML030-PURCH-KOHLS-MM         PIC  X(2)     VALUE SPACE.  00490000
1299RM     05  ML030-PURCH-PO-TYP-CDE       PIC  X(02)    VALUE SPACE.  00500002
W21731     05  ML030-PURCH-DEPT-CLASS.                                          
  |            10  ML030-PURCH-DEPT-NBR     PIC  9(03)    VALUE ZERO.           
W21731         10  ML030-PURCH-CLASS-NBR    PIC  9(02)    VALUE ZERO.           
W26603     05  ML030-PURCH-ENT-ID           PIC  9(09)    VALUE ZEROS.  00480000
W28582     05  ML030-PURCH-DOC-16-NBR       PIC  X(16)    VALUE SPACES. 00480000
W28582     05  ML030-PURCH-PO-9-NBR         PIC  X(09)    VALUE SPACES. 00480000
W28582     05  ML030-PURCH-LBL-SEQ-NBR      PIC S9(09)    VALUE ZEROS   00480000
W28582                                                    COMP.         00480000
W28582     05  ML030-PURCH-ML-LWST-ID       PIC S9(09)    VALUE ZEROS   00480000
W28582                                                    COMP.         00480000
W34517*    05  FILLER                       PIC  X(25)    VALUE SPACE.          
W34517     05  ML030-PURCH-REC-TYPE         PIC  9(01)    VALUE ZERO.   00480000
W34517         88  ML030-PURCH-ORIGINAL                   VALUE 1.              
W34517         88  ML030-PURCH-REVERSAL                   VALUE 2.              
W34517         88  ML030-PURCH-REASSIGN                   VALUE 3.              
W34517         88  ML030-PURCH-UNCHNGED                   VALUE 4.              
W34517     05  FILLER                       PIC  X(24)    VALUE SPACE.          
