000100******************************************************************00010000
000200*  MLRD122 - WEEKLY DATA EXTRACT FOR COMBINATION LEDGER REPORT    00020000
000300*            LENGTH - 1449 BYTES                                  00030000
000200*                                                                 00040000
000200*            5/3/00 - ADDED SEVERAL NEW FIELDS AND SOME FILLER    00050000
000200*                     INCREASING LRECL FROM 1209 TO 1449          00060000
W26603*          03/18/04 - INCREASED COST AND RETAIL AMOUNTS INCREASING00070000
W26603*                     LRECL FROM 1449 TO 1638                     00080000
000300******************************************************************00090000
000400 01  ML122-LEDGER-EXTRACT-WK-REC.                                 00100000
000500     05  ML122-GMA-NBR                PIC X(02).                  00110000
000600     05  ML122-DMA-NBR                PIC X(02).                  00120000
000700     05  ML122-BYR-NBR                PIC X(03).                  00130000
000800     05  ML122-DEPT-NBR               PIC X(03).                  00140000
W26603     05  ML122-TY-BEG-INV-COST-AMT    PIC S9(11)V99  COMP-3.      00150000
W26603     05  ML122-LY-BEG-INV-COST-AMT    PIC S9(11)V99  COMP-3.      00160000
W26603     05  ML122-TY-BEG-INV-RTL-AMT     PIC S9(11)V99  COMP-3.      00170000
W26603     05  ML122-LY-BEG-INV-RTL-AMT     PIC S9(11)V99  COMP-3.      00180000
001300     05  ML122-WEEKLY-AMTS    OCCURS 5.                           00190000
W26603         10  ML122-TY-SLS-RTL-AMT        PIC S9(11)V99  COMP-3.   00200000
W26603         10  ML122-FC-SLS-RTL-AMT        PIC S9(11)V99  COMP-3.   00210000
W26603         10  ML122-PL-SLS-RTL-AMT        PIC S9(11)V99  COMP-3.   00220000
W26603         10  ML122-LY-SLS-RTL-AMT        PIC S9(11)V99  COMP-3.   00230000
W26603         10  ML122-TY-MKDN-RTL-AMT       PIC S9(11)V99  COMP-3.   00240000
W26603         10  ML122-FC-MKDN-RTL-AMT       PIC S9(11)V99  COMP-3.   00250000
W26603         10  ML122-PL-MKDN-RTL-AMT       PIC S9(11)V99  COMP-3.   00260000
W26603         10  ML122-LY-MKDN-RTL-AMT       PIC S9(11)V99  COMP-3.   00270000
W26603         10  ML122-TY-MKUP-RTL-AMT       PIC S9(11)V99  COMP-3.   00280000
W26603         10  ML122-LY-MKUP-RTL-AMT       PIC S9(11)V99  COMP-3.   00290000
W26603         10  ML122-TY-XFER-IN-RTL-AMT    PIC S9(11)V99  COMP-3.   00300000
W26603         10  ML122-LY-XFER-IN-RTL-AMT    PIC S9(11)V99  COMP-3.   00310000
W26603         10  ML122-TY-XFER-OUT-RTL-AMT   PIC S9(11)V99  COMP-3.   00320000
W26603         10  ML122-LY-XFER-OUT-RTL-AMT   PIC S9(11)V99  COMP-3.   00330000
W26603         10  ML122-TY-RCPT-RTL-AMT       PIC S9(11)V99  COMP-3.   00340000
W26603         10  ML122-FC-TOT-ORD-RTL-AMT    PIC S9(11)V99  COMP-3.   00350000
W26603         10  ML122-PL-RCPT-RTL-AMT       PIC S9(11)V99  COMP-3.   00360000
W26603         10  ML122-LY-RCPT-RTL-AMT       PIC S9(11)V99  COMP-3.   00370000
W26603         10  ML122-TY-RCPT-NET-COST-AMT  PIC S9(11)V99  COMP-3.   00380000
W26603         10  ML122-LY-RCPT-NET-COST-AMT  PIC S9(11)V99  COMP-3.   00390000
W26603         10  ML122-TY-PADJ-RTL-AMT       PIC S9(11)V99  COMP-3.   00400000
W26603         10  ML122-LY-PADJ-RTL-AMT       PIC S9(11)V99  COMP-3.   00410000
W26603         10  ML122-TY-PADJ-NET-COST-AMT  PIC S9(11)V99  COMP-3.   00420000
W26603         10  ML122-LY-PADJ-NET-COST-AMT  PIC S9(11)V99  COMP-3.   00430000
W26603         10  ML122-TY-INV-ADJ-RTL-AMT    PIC S9(11)V99  COMP-3.   00440000
W26603         10  ML122-LY-INV-ADJ-RTL-AMT    PIC S9(11)V99  COMP-3.   00450000
W26603         10  ML122-TY-END-INV-RTL-AMT    PIC S9(11)V99  COMP-3.   00460000
W26603         10  ML122-PL-END-INV-RTL-AMT    PIC S9(11)V99  COMP-3.   00470000
W26603         10  ML122-LY-END-INV-RTL-AMT    PIC S9(11)V99  COMP-3.   00480000
W26603         10  ML122-TY-END-INV-COST-AMT   PIC S9(11)V99  COMP-3.   00490000
W26603         10  ML122-LY-END-INV-COST-AMT   PIC S9(11)V99  COMP-3.   00500000
W26603         10  ML122-TY-GRO-MRGN-AMT       PIC S9(11)V99  COMP-3.   00510000
W26603         10  ML122-LY-GRO-MRGN-AMT       PIC S9(11)V99  COMP-3.   00520000
W26603         10  ML122-TY-COMP-SLS-AMT       PIC S9(11)V99  COMP-3.   00530000
W26603         10  ML122-LY-COMP-SLS-AMT       PIC S9(11)V99  COMP-3.   00540000
005200         10  ML122-TY-WKS-SUP-GT-SYMBOL  PIC  X(01).              00550000
005300         10  ML122-TY-WKS-SUP-NO-PLAN    PIC  X(01).              00560000
005400         10  ML122-TY-WKS-SUP-AMT        PIC S9(04)     COMP-3.   00570000
005500         10  ML122-FC-WKS-SUP-GT-SYMBOL  PIC  X(01).              00580000
005600         10  ML122-FC-WKS-SUP-NO-PLAN    PIC  X(01).              00590000
005700         10  ML122-FC-WKS-SUP-AMT        PIC S9(04)     COMP-3.   00600000
005800         10  ML122-PL-WKS-SUP-GT-SYMBOL  PIC  X(01).              00610000
005900         10  ML122-PL-WKS-SUP-NO-PLAN    PIC  X(01).              00620000
006000         10  ML122-PL-WKS-SUP-AMT        PIC S9(04)     COMP-3.   00630000
006100         10  ML122-LY-WKS-SUP-GT-SYMBOL  PIC  X(01).              00640000
006200         10  ML122-LY-WKS-SUP-AMT        PIC S9(04)     COMP-3.   00650000
W26603         10  ML122-TY-OPEN-ORDER-AMT     PIC S9(11)V99  COMP-3.   00660000
W26603         10  ML122-PL-PADJ-RTL-AMT       PIC S9(11)V99  COMP-3.   00670000
21517          10  FILLER                      PIC  X(42)     VALUE     00680000
006500                                                        SPACES.   00690000
