000100 01  ML021-PURCH-RECORD.                                                  
W26603     05  ML021-PURCH-STORE-NBR        PIC X(5)      VALUE SPACE.          
W21731     05  ML021-PURCH-SKU              PIC X(8)      VALUE SPACE.          
000800     05  ML021-PURCH-FIN-LIAB-DTE     PIC  X(10)    VALUE SPACE.          
000900     05  ML021-PURCH-FSCL-YR          PIC  X(4)     VALUE SPACE.          
001000     05  ML021-PURCH-FSCL-PER         PIC  X(2)     VALUE SPACE.          
001100     05  ML021-PURCH-FSCL-WK          PIC  X        VALUE SPACE.          
001200     05  ML021-PURCH-FSCL-DAY         PIC  X        VALUE SPACE.          
001300     05  ML021-PURCH-EDIT-DTE         PIC  X(10)    VALUE SPACE.          
001400     05  ML021-PURCH-SYST-ORIG-CDE    PIC  X(2)     VALUE SPACE.          
21591          88  ML021-PHYSICAL-INVENTORY               VALUE '06'.           
001410         88  ML021-PURCH-RECEIPT                    VALUE '08'.           
001500     05  ML021-PURCH-TRANS-CDE        PIC  X(2)     VALUE SPACE.          
001600         88  ML021-PURCH-PURCHASE                   VALUE '10'.           
001700         88  ML021-PURCH-TRANSFER-FRM-STORE         VALUE '30'.           
001800         88  ML021-PURCH-TRANSFER-TO-STORE          VALUE '31'.   00180000
001900     05  ML021-PURCH-TYP-CDE          PIC  X        VALUE SPACE.  00190000
002000     05  ML021-PURCH-RSN-CDE          PIC  X(2)     VALUE SPACE.  00200000
002100     05  ML021-PURCH-INIT-BY-CDE      PIC  X        VALUE SPACE.  00210000
002200     05  ML021-PURCH-ML-IND           PIC  X        VALUE SPACE.  00220000
002300     05  ML021-PURCH-INV-IND          PIC  X        VALUE SPACE.  00230000
002400     05  ML021-PURCH-EXTD-GRO-COST-AMT                            00240000
002500                                      PIC S9(7)V99  VALUE ZERO    00250000
002600                                                    COMP-3.       00260000
002700     05  ML021-PURCH-FRGT-AMT         PIC S9(7)V99  VALUE ZERO    00270000
002800                                                    COMP-3.       00280000
002900     05  ML021-PURCH-DISC-AMT         PIC S9(7)V99  VALUE ZERO    00290000
003000                                                    COMP-3.       00300000
003100     05  ML021-PURCH-EXTD-NET-COST-AMT                            00310000
003200                                      PIC S9(7)V99  VALUE ZERO    00320000
003300                                                    COMP-3.       00330000
003400     05  ML021-PURCH-EXTD-RTL-AMT     PIC S9(7)V99  VALUE ZERO    00340000
003500                                                    COMP-3.       00350000
003600     05  ML021-PURCH-DR-CR-CDE        PIC  X(2)     VALUE SPACE.  00360000
003700     05  ML021-PURCH-AP-TRANS-CDE     PIC  X(2)     VALUE SPACE.  00370000
W26603     05  ML021-PURCH-REL-STORE-NBR    PIC  X(5)     VALUE SPACE.  00380000
003900     05  ML021-PURCH-QTY              PIC S9(9)     COMP-3        00390000
004000                                                    VALUE ZERO.   00400000
004100     05  ML021-PURCH-PER-UNT-RTL-AMT  PIC S9(5)V99  VALUE ZERO    00410000
004200                                                    COMP-3.       00420000
004300     05  ML021-PURCH-JRNL-IND         PIC  X(1)     VALUE SPACE.  00430000
004400     05  ML021-PURCH-DOC-DTE          PIC  X(10)    VALUE SPACE.  00440000
004500     05  ML021-PURCH-DOC-5-NBR        PIC  X(5)     VALUE SPACE.  00450000
004600     05  ML021-PURCH-BATCH-NBR        PIC  X(4)     VALUE SPACE.  00460000
004700     05  ML021-PURCH-PO-NBR           PIC  9(5)     VALUE ZERO.   00470000
004800     05  ML021-PURCH-VEND-NBR         PIC  X(5)     VALUE SPACE.  00480000
004900     05  ML021-PURCH-KOHLS-MM         PIC  X(2)     VALUE SPACE.  00490000
1299RM     05  ML021-PURCH-PO-TYP-CDE       PIC  X(02)    VALUE SPACE.  00500002
W21731     05  ML021-PURCH-DEPT-CLASS.                                          
  |            10  ML021-PURCH-DEPT-NBR     PIC  9(03)    VALUE ZERO.           
W21731         10  ML021-PURCH-CLASS-NBR    PIC  9(02)    VALUE ZERO.           
W26603     05  ML021-PURCH-ENT-ID           PIC  9(09)    VALUE ZEROS.  00480000
W26603     05  FILLER                       PIC  X(08)    VALUE SPACE.          
