000010***************************************************************** 00010000
000020*    MLRD125 - M/L WEEKLY SHRINK EXTRACT FORMAT                 * 00020000
000021*    LENGTH  - 39  BYTES   (TWKSHNK)                            * 00030001
W26603*  03/22/04 - STORE EXPANSION CHANGES. EXPANDED FILE TO 80        00040004
W26603*             BYTES.                   -RONNA MCDONALD            00050004
000030***************************************************************** 00060000
000040*                                                                 00070000
000100 01  ML125-DATA-INTEGRITY-EXTR-REC.                               00080003
000300     05  ML125-FSCL-WK-END-DTE          PIC X(10) VALUE SPACE.    00090000
000200     05  ML125-DEPT-NBR                 PIC X(03) VALUE SPACE.    00100000
000200     05  ML125-SUB-CL-NBR               PIC X(02) VALUE SPACE.    00110000
000200     05  ML125-STR-NBR                  PIC S9(04)                00120001
                                                     COMP   VALUE +0.   00130001
000300     05  ML125-FSCL-MN-END-DTE          PIC X(10) VALUE SPACE.    00140000
W26603     05  ML125-SLS-RTL-AMT              PIC S9(11)V99             00150004
001000                                               COMP-3 VALUE +0.   00160001
W26603     05  ML125-SHNK-RTL-AMT             PIC S9(11)V99             00170004
001200                                               COMP-3 VALUE +0.   00180001
W26603     05  FILLER                         PIC X(39).                00190004
