000100******************************************************************00010000
000200*  MLRD112 - DATA INTEGRITY DIFFERENCE REPORT FILE                00020000
W26603*  03/22/04 - STORE EXPANSION CHANGES. EXPANDED FILE TO           00030000
W26603*             80 BYTES.                -RONNA MCDONALD            00040000
W28582*  01/24/07 - BRAND VENDOR CHANGES.  ADDED ML112-DKEY-NBR.        00041002
W28582*                                      -PATRICK BURKE             00042002
001100******************************************************************00050000
001200 01  ML112-DATA-INTEGRITY-DIFF-REC.                               00060000
001300     05  ML112-FSCL-MN-END-DTE        PIC X(10).                  00070000
001400     05  ML112-FSCL-MN-NBR            PIC X(02).                  00080000
001500     05  ML112-DEPT-NBR               PIC X(03).                  00090000
001600     05  ML112-MAJ-CL-NBR             PIC X(02).                  00100000
001700     05  ML112-SUB-CL-NBR             PIC X(02).                  00110000
001800     05  ML112-STR-NBR                PIC S9(4) COMP.             00120000
W26603     05  ML112-LOW-TBL-AMT            PIC S9(11)V99 COMP-3.       00130000
W26603     05  ML112-HIGH-TBL-AMT           PIC S9(11)V99 COMP-3.       00140000
002100     05  ML112-ERR-MSG-NBR            PIC S9(4) COMP.             00150000
002100     05  ML112-DKEY-NBR               PIC X(15).                  00151001
W26603     05  FILLER                       PIC X(28).                  00160001
