      ***************************************************************** 00010000
      *    MLRD081 - ML UNCLASSIFIED LICENSE FEES                       00020001
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                     00060000
      * -------  ----------  ----------------------------------------   00070000
      * W34517   06/21/2008  INITIAL CREATION.                          00080007
      *                      J. SELWITSCHKA                             00090000
      ***************************************************************** 00120000
       01  ML081-UNCL-LIC-REC.                                          00130001
           05  ML081-DEPT-NBR          PIC S9(04)      VALUE ZEROES     00261001
                              COMP-3.                                   00261100
           05  ML081-ENT-ID            PIC  9(09)      VALUE ZEROES.    00263005
           05  ML081-ENT-NAME-DESC     PIC  X(30)      VALUE SPACES.    00264001
           05  ML081-AP-TRANS-CDE      PIC  X(02)      VALUE SPACES.    00266001
           05  ML081-EXTD-RTL-AMT      PIC S9(11)V9(2) VALUE ZEROES.    00267103
           05  FILLER                  PIC  X(23)      VALUE SPACES.    02080006
