      *****************************************************************         
000020*    MLRD621 - ACTIVE/INACTIVE DBV RECORDS                      *         
000021*    LENGTH  - 100 BYTES                                        *         
000030*****************************************************************         
      ******************************************************************        
      *  NOTE:  S9(4) COMP CAN HOLD A NUMBER FROM -32768 TO 32767               
      *         FIELD FOR THE LBL SEQ NUMBER IS REDEFINED                       
      *         TO HOLD 5 DIGITS, BUT IF THE NUMBER IS HIGHER THAN 32767        
      *         THE DATA WILL NOT BE CORRECT.                                   
      ******************************************************************        
      *    CHG#         DATE        DESCRIPTION                        *        
      *    --------   --------     ---------------------------------   *        
      *                                                                *        
      *                                                                *        
      ******************************************************************        
       01  ML621-CSV-TE-REC-HEAD.                                               
           05  ML621-REC-TYPE-H               PIC X     VALUE 'H'.              
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-DEPT-BRND-VND-ID-D       PIC X(12) VALUE                   
               'DBV DATA KEY'.                                                  
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-DEPT-NBR-D               PIC X(10) VALUE                   
               'DEPT'.                                                          
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-LBL-SEQ-NBR-X-D          PIC X(07) VALUE                   
               'LBL KEY'.                                                       
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-BRAND-NAME-D             PIC X(20) VALUE                   
               'BRAND NAME'.                                                    
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-ENT-ID-D                 PIC X(16) VALUE                   
               'ENT ID - VND KEY'.                                              
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-VENDOR-NAME-D            PIC X(22) VALUE                   
               'VEND DESC'.                                                     
           05  FILLER                         PIC X     VALUE ','.              
           05  FILLER                         PIC X(5)  VALUE SPACES.           
      *                                                                         
       01  ML621-CSV-TE-REC.                                                    
           05  ML621-REC-TYPE                 PIC X.                            
               88 ML621-REC-ACTIVE                      VALUE 'A'.              
               88 ML621-REC-INACTIVATE                  VALUE 'I'.              
               88 ML621-REC-HEADER                      VALUE 'H'.              
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-DEPT-BRND-VND-ID         PIC X(10) VALUE SPACE             
                                                     JUSTIFIED RIGHT.           
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-DEPT-NBR                 PIC X(04) VALUE SPACE             
                                                     JUSTIFIED RIGHT.           
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-LBL-SEQ-NBR-X            PIC X(06) VALUE SPACE             
                                                     JUSTIFIED RIGHT.           
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-BRAND-NAME               PIC X(20) VALUE SPACE.            
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-ENT-ID                   PIC 9(10) VALUE ZERO.             
           05  FILLER                         PIC X     VALUE ','.              
           05  ML621-VENDOR-NAME              PIC X(30) VALUE SPACE.            
           05  FILLER                         PIC X     VALUE ','.              
           05  FILLER                         PIC X(12) VALUE SPACE.            
                                                                                
