      *****************************************************************         
      *    MLRD984 - MERCH LEDGER NEW AUDIT DATA INTEGRITY PROCESS              
      *    DATA EXTRACT BY UNLOADING THE MLT_PRCHG_TRN_DTL TABLE                
      *                                  (MLT00038)                             
      *    RECORD LENGTH - 43 BYTES                                             
      *    ALL FILLER FIELDS HERE ARE USED FOR NULL IND                         
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *****************************************************************         
       01  ML984-PRCHG-EXTRACT-RECS.                                            
           10 ML984-FSCL-WK-END-DTE         PIC   X(10).                        
           10 ML984-DEPT-NBR                PIC  S9(4)V COMP-3.                 
           10 ML984-MAJ-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML984-SUB-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML984-LOC-NBR                 PIC  S9(4) COMP.                    
           10 ML984-ML-LO-MDSE-LVL-ID       PIC  S9(9) COMP.                    
           10 ML984-TRN-TYP-CDE             PIC   X(03).                        
           10 ML984-PRCHG-RSN-CDE           PIC   X(04).                        
           10 ML984-PRCHG-CTG-CDE           PIC   X(02).                        
           10 FILLER                        PIC   X(01).                        
           10 ML984-PRCHG-RTL-AMT           PIC  S9(11)V9(2) COMP-3.            
           10 ML984-FIELD-TYPE              PIC   X(01).                        
