000100******************************************************************00010000
000200*  MLRD115 - STORE INVENTORY REPORT DATE RECORD                   00020003
000300******************************************************************00030000
000400 01  ML115-STR-INV-DTE-REC.                                       00040002
000500     05  ML115-EXTRACT-DTE            PIC X(10) VALUE SPACE.      00050000
000600     05  FILLER                       PIC X     VALUE SPACE.      00060000
000700     05  ML115-EXTRACT-MN-NBR         PIC X(02) VALUE SPACE.      00070000
000800     05  FILLER                       PIC X(67) VALUE SPACE.      00080000
