      *****************************************************************         
      *    MLRD079 - ML WEEKLY SHRINK (TWKSHNK FORMAT)                          
      *    NOTE: ANY CHANGES MADE TO DB2 TABLE TWKSHNK MUST ALSO                
      *    BE REFLECTED IN THIS RECORD LAYOUT.                                  
      *    RECORD LENGTH - 41 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
      * W34567   03/20/2008  INITIAL CREATION.                                  
      *                      J. SELWITSCHKA                                     
      *****************************************************************         
       01  ML079-WEEKLY-SHNK.                                                   
           10 ML079-FSCL-WK-END-DTE     PIC  X(10)      VALUE SPACES.           
           10 ML079-DEPT-NBR            PIC  X(03)      VALUE SPACES.           
           10 ML079-SUB-CL-NBR          PIC  X(02)      VALUE SPACES.           
           10 ML079-STR-NBR             PIC S9(04)      VALUE ZEROES            
                                        COMP.                                   
           10 ML079-FSCL-MN-END-DTE     PIC  X(10)      VALUE SPACES.           
           10 ML079-SLS-RTL-AMT         PIC S9(11)V9(2) VALUE ZEROES            
                                        COMP-3.                                 
           10 ML079-SHNK-RTL-AMT        PIC S9(11)V9(2) VALUE ZEROES            
                                        COMP-3.                                 
