      *****************************************************************         
      *    MLRD016 - MERCH LEDGER SALES RECORD                                  
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION             
      *****************************************************************         
00001  01  ML016-SALES-RECORD.                                          03/24/94
00002      05  FILLER                      PIC X(7).                    MLRD016 
00003      05  ML016-SALE-CDE              PIC X(1).                       LV002
00004          88  ML016-VALID-SALE-CDE         VALUE '2'.              MLRD016 
00005      05  ML016-SALE-DTE.                                          MLRD016 
00006          10  ML016-SALE-DTE-MM       PIC 9(2).                    MLRD016 
00007          10  ML016-SALE-DTE-DD       PIC 9(2).                    MLRD016 
00008          10  ML016-SALE-DTE-YY       PIC 9(2).                    MLRD016 
W26603     05  ML016-SALE-STORE-NBR        PIC X(5).                    MLRD016 
00010      05  ML016-SALE-ACTION           PIC X(1).                    MLRD016 
00011          88  ML016-NEGATIVE-CORRECTION    VALUE '-'.              MLRD016 
00012          88  ML016-POSITIVE-CORRECTION    VALUE '+'.              MLRD016 
00013      05  ML016-SKU.                                               MLRD016 
00014          10  ML016-SALE-DEPT-CLASS       PIC X(5).                MLRD016 
00015          10  FILLER REDEFINES ML016-SALE-DEPT-CLASS.              MLRD016 
00016              15  ML016-SALE-DEPT-NBR     PIC X(3).                MLRD016 
00017              15  ML016-SALE-CLASS-NBR    PIC X(2).                MLRD016 
00018          10  ML016-SALE-SEQ-NBR          PIC X(3).                MLRD016 
00019      05  ML016-SALE-QTY              PIC 9(2).                    MLRD016 
00020      05  FILLER                      PIC X(1).                    MLRD016 
00021      05  ML016-SALE-EXTD-RTL-AMT     PIC 9(3)V99.                    CL**2
W26603     05  FILLER                      PIC X(44).                   MLRD016 
