000100******************************************************************00010000
000200*  MLRD211 - DATA INTEGRITY EXTRACT FILE                          00020003
W26603*  03/22/04 - STORE EXPANSION CHANGES. EXPANDED FILE TO 120       00030000
W26603*             BYTES.                   -RONNA MCDONALD            00040000
W28582*  01/24/07 - BRAND VENDOR CHANGES.  ADDED ML211-DKEY-NBR.        00041003
W28582*                                      -PATRICK BURKE             00042000
B28582*  04/02/07 - BRAND VENDOR CHANGES.  CHANGED ML211-DKEY-NBR.      00042103
B28582*                                    AND FILLER                   00042201
B28582*         CREATED NEW VERSION FROM MLRD211 -BRUCE GRAHAM          00042303
001100******************************************************************00043000
001200 01  ML211-DATA-INTEGRITY-EXTR-REC.                               00044003
001300     05  ML211-FSCL-MN-END-DTE        PIC X(10).                  00045003
001400     05  ML211-FSCL-MN-NBR            PIC X(02).                  00046003
001500     05  ML211-DEPT-NBR               PIC X(03).                  00047003
001600     05  ML211-MAJ-CL-NBR             PIC X(02).                  00048003
001700     05  ML211-SUB-CL-NBR             PIC X(02).                  00049003
001800     05  ML211-STR-NBR                PIC S9(4) COMP.             00050003
W26603     05  ML211-SLS-RTL-AMT            PIC S9(11)V99 COMP-3.       00060003
W26603     05  ML211-MKDN-RTL-AMT           PIC S9(11)V99 COMP-3.       00070003
W26603     05  ML211-MKUP-RTL-AMT           PIC S9(11)V99 COMP-3.       00080003
W26603     05  ML211-XFER-IN-RTL-AMT        PIC S9(11)V99 COMP-3.       00090003
W26603     05  ML211-XFER-OUT-RTL-AMT       PIC S9(11)V99 COMP-3.       00100003
W26603     05  ML211-RCPT-RTL-AMT           PIC S9(11)V99 COMP-3.       00110003
W26603     05  ML211-RCPT-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00120003
W26603     05  ML211-PADJ-RTL-AMT           PIC S9(11)V99 COMP-3.       00130003
W26603     05  ML211-PADJ-NET-COST-AMT      PIC S9(11)V99 COMP-3.       00140003
W26603     05  ML211-INV-ADJ-RTL-AMT        PIC S9(11)V99 COMP-3.       00150003
W26603     05  ML211-SHNK-RTL-AMT           PIC S9(11)V99 COMP-3.       00160003
W26603     05  ML211-END-INV-RTL-AMT        PIC S9(11)V99 COMP-3.       00170003
B28582     05  ML211-DKEY-NBR               PIC S9(09)    COMP.         00180003
B28582     05  ML211-END-INV-COST1-AMT      PIC S9(11)V99 COMP-3.       00190004
B28582     05  ML211-END-INV-COST2-AMT      PIC S9(11)V99 COMP-3.       00191004
B28582     05  ML211-ADJ-GRO-MRGN-AMT       PIC S9(11)V99 COMP-3.       00192005
B28582     05  FILLER                       PIC  X(70).                 00200005
