      *****************************************************************         
      *    MLRD985 - MERCH LEDGER AUDIT INV ADJ DATA INTEGRITY PROCESS          
      *    DATA CREATED BY COMPARSION PROGRAM MLKUT987                          
      *     AND USED BY REPORT PROGRAM MLKRP209                                 
      *    RECORD LENGTH - 80 BYTES                                             
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
      *****************************************************************         
       01  ML985-INV-ADJ-REPORT-RECS.                                           
           10 ML985-FSCL-WK-END-DTE         PIC   X(10).                        
           10 ML985-DEPT-NBR                PIC  S9(4)V COMP-3.                 
           10 ML985-MAJ-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML985-SUB-CL-NBR              PIC  S9(4)V COMP-3.                 
           10 ML985-LOC-NBR                 PIC  S9(4) COMP.                    
           10 ML985-ML-LO-MDSE-LVL-ID       PIC  S9(9) COMP.                    
           10 ML985-TRN-TYP-CDE             PIC   X(03).                        
           10 ML985-WKSUM-INVADJ-AMT        PIC  S9(11)V9(2) COMP-3.            
           10 ML985-AUDIT-INVADJ-AMT        PIC  S9(11)V9(2) COMP-3.            
           10 ML985-COMPARE-FIELD-NAME      PIC   X(20).                        
           10 FILLER                        PIC   X(18).                        
