      *****************************************************************         
      *    MLRD902 - ML'S WEEKLY SUMMARY COMMON EXTRACT FOR EAI                 
      *    RECORD LENGTH - 360 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
      *                                                                         
      *****************************************************************         
       01  ML902-WKLY-SUM-COMMON-EXTRACT.                                       
           05  ML902-FSCL-WK-END-DTE       PIC   X(10)     VALUE SPACES.        
           05  ML902-DEPT-NBR              PIC  S9(04)     VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MAJ-CL-NBR            PIC  S9(04)     VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SUB-CL-NBR            PIC  S9(04)     VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-LOC-NBR               PIC  S9(04)     VALUE ZEROES         
                               COMP.                                            
           05  ML902-ENT-ID                PIC  S9(09)     VALUE ZEROES         
                               COMP.                                            
           05  ML902-SLS-REG-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SLS-PROMO-RTL-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SLS-PROCLR-RTL-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SLS-CLR-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SLS-OTH-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-PLU-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-PROMO-RTL-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-RGST-RTL-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-GLDST-RTL-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-UMTCH-RTL-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-BYR-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-STR-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-PRPT-RTL-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-OTH-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKDN-RTL-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKUP-RTL-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-XFER-IN-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-XFER-OUT-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-RCPT-RTL-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-RCPT-NET-COST-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-RCPT-GRO-COST-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-RTL-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-FRGT-COST-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-DISC-COST-AMT    PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-RTV-COST-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-RTV-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-DA-COST-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-DA-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-NET-COST-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-OTH-COST-AMT     PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-PADJ-OTH-RTL-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-DR-ALW-RTL-AMT        PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-RTV-RTL-AMT           PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKUP-INIT-AMT         PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-MKUP-NET-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-INV-ADJ-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-ONORD-RTL-AMT         PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-ONORD-COST-AMT        PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-SHNK-RTL-AMT          PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-END-INV-RTL-AMT       PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-END-INV-COST-AMT      PIC  S9(11)V99  VALUE ZEROES         
                               COMP-3.                                          
           05  ML902-FILLER                PIC   X(48)     VALUE SPACES.        
