      *****************************************************************         
      *    MLRD035 - ML'S DATALESS KEY EXTRACT                                  
      *    RECORD LENGTH - 110 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                             
      * -------  ----------  ----------------------------------------           
X     * X        09/05/2006  DATA SMOOTHING AT DEPT/BRAND/VEND LEVEL.           
X     *                      ROD JANSSEN, COPIED FROM SPEC,B.GRAHAM             
X     *          10/12/2006  MODIFIED PER DESIGN CHANGE B.GRAHAM                
      *****************************************************************         
       01  ML035-DATALESS-KEY-EXTRACT.                                          
      *                                                                         
           05  ML035-TYPE-DATA.                                                 
               10  ML035-TYPE              PIC S9(4)       VALUE ZEROES         
                               COMP.                                            
                   88  ML035-DEPT-TARGET                   VALUE +1.            
                   88  ML035-RECALC-END-INV-ALL            VALUE +2.            
                   88  ML035-END-INV-TYPE-0                VALUE +4.            
                   88  ML035-END-INV-ALL-EXIST             VALUE +7.            
           05  ML035-KEY-DATA.                                                  
               10  ML035-PARTN-NBR         PIC S9(4)       VALUE ZEROES         
                               COMP.                                            
               10  ML035-FSCL-PERIOD       PIC X(02)       VALUE SPACES.        
               10  ML035-FSCL-END-DTE      PIC X(10)       VALUE SPACES.        
               10  ML035-DEPT-NBR          PIC S9(4)       VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-MAJ-CL-NBR        PIC S9(4)       VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-SUB-CL-NBR        PIC S9(4)       VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-LOC-NBR           PIC S9(4)       VALUE ZEROES         
                               COMP.                                            
               10  ML035-ENT-ID            PIC S9(9)       VALUE ZEROES         
                               COMP.                                            
               10  ML035-PARTN-GROUP       PIC S9(4)       VALUE ZEROES         
                               COMP.                                            
W28582         10  ML035-LBL-SEQ-NBR       PIC S9(9)       VALUE ZEROES         
W28582                         COMP.                                            
W28582         10  ML035-ML-LWST-ID        PIC S9(9)       VALUE ZEROES         
W28582                         COMP.                                            
W28582         10  FILLER                  PIC X(09)       VALUE SPACES.        
      *                                                                         
           05  ML035-FISCAL-DATA.                                               
               10  ML035-END-INV-RTL-AMT                                        
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-END-INV-COST-AMT                                       
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-RECALC-END-INV-RTL-AMT                                 
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-RECALC-END-INV-COST-AMT                                
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-TARGET-END-INV-RTL-AMT                                 
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  ML035-TARGET-END-INV-COST-AMT                                
                                           PIC S9(11)V9(2) VALUE ZEROES         
                               COMP-3.                                          
               10  FILLER                  PIC X(18)       VALUE SPACES.        
