000010***************************************************************** 00010000
000020*    MLRD105 - M/L MONTHLY MAJOR CLASS DATABASE UPDATE TXN      * 00020000
000021*    LENGTH  - 100 BYTES   (TMNMCL)                             * 00030000
      *    WR/PITS#     DATE        DESCRIPTION                       * 00040000
      *    --------   --------     ---------------------------------  * 00050000
      *    W26603     04/14/2004   STORE EXPANSION AND INCREASE       * 00060000
      *                            AMOUNT FIELDS FROM PIC S9(09)V99   * 00070000
      *                            TO PIC S9(11)V99                   * 00080000
000030***************************************************************** 00090000
000040*                                                                 00100000
000100 01  ML105-UPDATE-REC.                                            00110000
           05  ML105-FSCL-MN-NBR              PIC X(02) VALUE SPACE.    00120000
000300     05  ML105-FSCL-MN-END-DTE          PIC X(10) VALUE SPACE.    00130000
000200     05  ML105-DEPT-NBR                 PIC X(03) VALUE SPACE.    00140000
000220     05  ML105-MAJ-CL-NBR               PIC X(02) VALUE SPACE.    00150000
W26603     05  ML105-SLS-RTL-AMT              PIC S9(11)V99             00160000
001000                                                  COMP-3 VALUE +0.00170000
W26603     05  ML105-MKDN-RTL-AMT             PIC S9(11)V99             00180000
001200                                                  COMP-3 VALUE +0.00190000
W26603     05  ML105-MKUP-RTL-AMT             PIC S9(11)V99             00200000
001400                                                  COMP-3 VALUE +0.00210000
W26603     05  ML105-XFER-IN-RTL-AMT          PIC S9(11)V99             00220000
001600                                                  COMP-3 VALUE +0.00230000
W26603     05  ML105-XFER-OUT-RTL-AMT         PIC S9(11)V99             00240000
001800                                                  COMP-3 VALUE +0.00250000
W26603     05  ML105-RCPT-RTL-AMT             PIC S9(11)V99             00260000
002000                                                  COMP-3 VALUE +0.00270000
W26603     05  ML105-RCPT-NET-COST-AMT        PIC S9(11)V99             00280000
002400                                                  COMP-3 VALUE +0.00290000
W26603     05  ML105-PADJ-RTL-AMT             PIC S9(11)V99             00300000
002000                                                  COMP-3 VALUE +0.00310000
W26603     05  ML105-PADJ-NET-COST-AMT        PIC S9(11)V99             00320000
002400                                                  COMP-3 VALUE +0.00330000
W26603     05  ML105-INV-ADJ-RTL-AMT          PIC S9(11)V99             00340000
002500                                                  COMP-3 VALUE +0.00350000
002800     05  FILLER                         PIC X(13) VALUE SPACE.    00360000
