      ******************************************************************        
      *  MLRD940 - ML PRICE CHANGE EXTRACT FILE.                                
      *            THIS IS THE RECORD LAYOUT FOR THE DATA WAREHOUSE             
      *            PRICE CHANGE EXTRACT.                                        
      *                                                                         
      *  RECORD LENGTH - 78 BYTES.                                              
      *  CREATED: 01/15/99 - PATI GREEN                                         
      *   UPDATE: 10/12/05 - BETTY DORST - ADDED: MKDN-CODE                     
      *                                           ORIG-CLR-DTE                  
      *                                           OLD-UNT-RTL-AMT               
      *                                           NEW-UNT-RTL-AMT               
      *   UPDATE: 04/11/11 - MARK FRAMNESS - CLONED FROM MWRD024 TO             
      *                                         MLRD940                         
      *   UPDATE: 02/29/2012 - MARK A FRAMNESS - ADDED                          
      *                       THE FIELD ML940-PRCHG-FIN-LIAB-DTE TO THE         
      *                       LAYOUT.                                           
      ******************************************************************        
                                                                                
       01  ML940-PRCHG-EXTRACT-RECORD.                                          
           05  ML940-PRCHG-PRD-DIM-KY-ID      PIC   X(30).                      
           05  ML940-PRCHG-TM-DIM-KY-DTE      PIC   X(10).                      
           05  ML940-PRCHG-PHY-SITE-ID        PIC   S9(04)      COMP.           
           05  ML940-PRCHG-TYP-CDE            PIC   X(01).                      
           05  ML940-PRCHG-CTG-CDE            PIC   X(01).                      
           05  ML940-PRCHG-RSN-CDE            PIC   X(03).                      
           05  ML940-PRCHG-MKDN-CDE           PIC   X(01).                      
           05  ML940-PRCHG-ORIG-CLR-DTE       PIC   X(10).                      
           05  ML940-PRCHG-OLD-UNT-RTL-AMT    PIC   S9(07)V9(2) COMP-3.         
           05  ML940-PRCHG-NEW-UNT-RTL-AMT    PIC   S9(07)V9(2) COMP-3.         
           05  ML940-PRCHG-UNT-QTY            PIC   S9(09)      COMP.           
           05  ML940-PRCHG-AMT                PIC   S9(09)V9(2) COMP-3.         
           05  ML940-PRCHG-FIN-LIAB-DTE       PIC   X(10).                      
                                                                                
