      ******************************************************************        
      *    MLWS003 - STORE TO STORE TRANSFER RECORD LAYOUT             *        
      *              FOR TAPE FROM SCANNING SERVICE.                   *        
      *                                                                *        
      *    RECORD LENGTH - 80 BYTES                                    *        
      * CHG ID/                                                        *        
      * WR/PROJ  DATE        DESCRIPTION OF CHANGES                    *        
      * -------  ----------  ----------------------------------------  *        
      * 25247    12/03/2003  STORE-TO-STORE ENHANCEMENTS FOR VALIDATION*        
      *                      AT POINT OF DATA ENTRY/SCANNING.          *        
      ******************************************************************        
       01  ML003-TRANSFER-RECORD.                                               
W29145     05  FILLER                     PIC X(01)        VALUE SPACES.        
W29145         88  ML003-DATA-ENTRY-SOURCE                 VALUE '3'.           
W29145     05  ML003-BATCH-NBR            PIC X(03)        VALUE SPACES.        
W29145     05  ML003-BATCH-NBR-9 REDEFINES ML003-BATCH-NBR                      
W29145                                    PIC 9(03).                            
W29145     05  FILLER                     PIC X(02)        VALUE SPACES.        
           05  ML003-DATE.                                                      
               10  ML003-MM               PIC 9(02)        VALUE ZERO.          
               10  ML003-DD               PIC 9(02)        VALUE ZERO.          
               10  ML003-YY               PIC 9(02)        VALUE ZERO.          
25247      05  ML003-FROM-STORE           PIC X(04)        VALUE ZEROES.        
25247      05  ML003-FROM-STORE-9 REDEFINES ML003-FROM-STORE                    
25247                                     PIC 9(04).                            
25247      05  FILLER                     PIC X(06)        VALUE ZEROES.        
25247      05  ML003-TO-STORE             PIC X(04)        VALUE ZEROES.        
25247      05  ML003-TO-STORE-9 REDEFINES ML003-TO-STORE                        
25247                                     PIC 9(04).                            
25247      05  FILLER                     PIC X(02)        VALUE SPACES.        
25247      05  ML003-SCAN-AREA-NUMBER     PIC 9(06)        VALUE ZEROES.        
25247          88  ML003-CLEARANCE-AREA                    VALUES ARE           
25247              9000 THROUGH 9999.                                           
25247      05  FILLER                     PIC X(02)        VALUE SPACES.        
25247      05  ML003-SCAN-LINE-NUMBER     PIC 9(06)        VALUE ZEROES.        
25247      05  FILLER                     PIC X(05)        VALUE SPACES.        
25247      05  ML003-UPC                  PIC 9(13)        VALUE ZERO.          
25247      05  ML003-UPC-X REDEFINES ML003-UPC PIC X(13).                       
25247      05  FILLER      REDEFINES ML003-UPC.                                 
               10  ML003-SKU              PIC 9(08).                            
W29145         10  ML003-SKU-X REDEFINES ML003-SKU                              
W29145                                    PIC X(08).                            
25247          10  FILLER                 PIC X(05).                            
25247T     05  FILLER REDEFINES ML003-UPC.                                      
25247T         10  ML003-UPC-12           PIC 9(12).                            
25247T         10  ML003-UPC-12-X REDEFINES ML003-UPC-12 PIC X(12).             
25247T         10  FILLER                 PIC X(01).                            
25247T             88  ML003-IS-UPC-12                     VALUE SPACE.         
           05  ML003-RETAIL-PRICE         PIC 9(10)V99     VALUE ZEROS.         
           05  ML003-UNITS                PIC 9(07)        VALUE ZEROS.         
25247      05  FILLER                     PIC X(01)        VALUE SPACES.        
