      ******************************************************************        
      * MLWS051                                                                 
      ******************************************************************        
      * CHANGE HISTORY:                                                         
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
00002 * MODIFIED 12/85: ADDED D090-RETURN-AMT TO CAPTURE RETURN AMOUNTS         
00003 *                 FOR KOHL'S STOCK LEDGER PROCESSING.                     
00004 *                    (D090-SALES-REC).                                    
00002 * MODIFIED 11/97: ADDED D090-SALES-TYPE-CDE                               
00004 *                    (D090-SALES-REC).                                    
00004 * MODIFIED 03/98: REMOVE 01 D090-ON-ORDER (& ALL ELEMENTARY ITEMS)        
00004 *   (WR5701)      REMOVE 01 D090-PLANNED-SALES-REC (& ELEM ITEMS)         
00004 *                 REMOVE 01 D090-END-INVT-REC (& ELEMENTARY ITEMS)        
00004 * XX=TRANS CODE / ADDED D090-SORT-BATCH-NBR-XX TO POS 96-98 (ALL)         
00004 *               \ ADDED D090-FISCAL-WEEK-XX TO LAST 2 BYTES (ALL)         
23511 * MODIFIED 03/02: EXPANDED FIELDS                                         
23511 *          D090-MKDWN-OPRICE      D090-MKDWN-OPRICEX                      
23511 *          D090-MKDWN-NPRICE      D090-MKDWN-NPRICEX                      
23511 *          D090-MKDWN-QTY         D090-MKDWN-QTYX                         
23511 *          D090-MKON-QTY                                                  
23511 *          D090-MERCH-AMT                                                 
23511 *          D090-DISC-AMT                                                  
23511 *          D090-FREIGHT-AMT                                               
23511 *          D090-NET-COST-AMT                                              
23511 *          D090-RETAIL-AMT                                                
23511 *          D090-TRANS-UNITS       D090-TRANS-UNITSX                       
23511 *          D090-RETAIL-PER-UN     D090-RETAIL-PER-UNX                     
23511 *          D090-UNITS-TRANSFER    D090-UNITS-TRANSFERX                    
23511 *          D090-RETAIL-PER        D090-RETAIL-PERX                        
23511 *          D090-SALE-AMT          D090-SALE-AMTX                          
R26603* W26603  06-08-2004 ROD JANSSEN INVENTORY ADJUSTMENT TRAUNCATION         
00004 ******************************************************************        
206118* 08/20/18  CHG0206118   COPYBOOK RENAMED FROM KDM2810 WHICH DID          
206118*                        NOT MEET STANDARDS FOR MAINFRAME                 
206118*                        REFACTORING.                                     
00004 ******************************************************************        
00029  01  D090-PURCH-JRNL.                                                     
00030      05  D090-CODE-10        PIC XX.                                      
00031      05  D090-PURCHNO-10     PIC 9(5).                                    
00032      05  D090-STORE-10       PIC 9(5).                                    
00033      05  D090-BUYER-10       PIC 99.                                      
00034      05  D090-DIV-10         PIC 9.                                       
00035      05  D090-DEPT-10        PIC 999.                                     
00036      05  D090-CLASS-10       PIC 99.                                      
00037      05  D090-MERCH-MGR-10   PIC 99.                                      
00038      05  D090-VENDNO-10      PIC 9(5).                                    
00039      05  D090-PURCH-DATE.                                                 
00040          10  D090-PURCH-MO   PIC 99.                                      
00041          10  D090-PURCH-DAY  PIC 99.                                      
00042      05  FILLER              PIC X(3).                                    
00043      05  D090-DOCNO-10       PIC 9(5).                                    
00044      05  D090-ACCTNO         PIC 9(5).                                    
00045      05  D090-KOHLS-MO-10    PIC 99.                                      
00046      05  D090-TR-CODE        PIC 99.                                      
23511      05  D090-MERCH-AMT      PIC S9(7)V99    COMP-3.                      
23511      05  D090-DISC-AMT       PIC S9(7)V99    COMP-3.                      
23511      05  D090-FREIGHT-AMT    PIC S9(7)V99    COMP-3.                      
23511      05  D090-NET-COST-AMT   PIC S9(7)V99    COMP-3.                      
23511      05  D090-RETAIL-AMT     PIC S9(7)V99    COMP-3.                      
00052      05  FILLER              PIC X(8).                                    
00053      05  D090-BATCHNO        PIC X(4).                                    
23511      05  FILLER              PIC X(10).                                   
WR5701     05  D090-SORT-BATCH-NBR-10       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-10          PIC 9(2).                           
00055      SKIP1                                                                
00056  01  D090-SALES-REC.                                                      
00057      05  D090-CODE-20        PIC 99.                                      
00058      05  D090-BATCH-20       PIC X(4).                                    
00059      05  D090-STORE-20       PIC X(5).                                    
00060      05  FILLER              PIC X.                                       
00061      05  D090-BUYER-20       PIC 99.                                      
00062      05  D090-DIV-20         PIC 9.                                       
00063      05  D090-DEPT-CLASS-20.                                              
00064          10  D090-DEPT-20    PIC XXX.                                     
00065          10  D090-CLASS-20   PIC XX.                                      
00066      05  D090-MERCH-MGR-20   PIC 99.                                      
00067      05  FILLER              PIC X(5).                                    
00068      05  D090-SALES-DATE     PIC 9(6).                                    
00069      05  FILLER REDEFINES D090-SALES-DATE.                                
00070          10  D090-SALES-MM   PIC 99.                                      
00071          10  D090-SALES-DD   PIC 99.                                      
00072          10  D090-SALES-YY   PIC 99.                                      
23511      05  D090-SALE-AMT       PIC S9(7)V99.                                
23511      05  D090-SALE-AMTX REDEFINES D090-SALE-AMT PIC X(9).                 
00075      05  FILLER              PIC X(5).                                    
00076      05  D090-SALE-WEEK      PIC 99.                                      
00077      05  D090-SALE-DAY       PIC 9.                                       
00078      05  D090-RETURN-AMT     PIC S9(5)V99.                                
00078      05  D090-SALE-TYP-CDE   PIC X(01).                                   
00079 *    05  FILLER              PIC X(44).                                   
23511      05  FILLER                       PIC X(37).                          
WR5701     05  D090-SORT-BATCH-NBR-20       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-20          PIC 9(2).                           
00080      SKIP1                                                                
00081  01   D090-TRANSFER-FROM-REC.                                             
00082      05  D090-CODE-30        PIC 99.                                      
00083      05  FILLER              PIC X(4).                                    
00084      05  D090-TRANSFER-FROM  PIC X(5).                                    
00085      05  FILLER              PIC X.                                       
00086      05  D090-BUYER-30       PIC 99.                                      
00087      05  D090-DIV-30         PIC 9.                                       
00088      05  D090-DEPT-30        PIC XXX.                                     
00089      05  D090-CLASS-30       PIC XX.                                      
00090      05  D090-MERCH-MGR-30   PIC 99.                                      
00091      05  D090-DOC-NO-30      PIC X(5).                                    
00092      05  D090-TRANSFER-DATE.                                              
00093          10  D090-TRANS-MM   PIC 99.                                      
00094          10  D090-TRANS-DD   PIC 99.                                      
00095      05  D090-TRANSFER-TO    PIC X(5).                                    
00096      05  D090-KOHLS-MM-30    PIC XX.                                      
23511      05  D090-TRANS-UNITS    PIC 9(9).                                    
00098      05  D090-TRANS-UNITSX REDEFINES D090-TRANS-UNITS                     
23511                              PIC X(9).                                    
23511      05  D090-RETAIL-PER-UN  PIC S9(5)V99.                                
00101      05  D090-RETAIL-PER-UNX  REDEFINES D090-RETAIL-PER-UN                
23511                              PIC X(7).                                    
00103      05  FILLER              PIC X.                                       
00104      05  D090-TRANS-BATCH    PIC 9(3).                                    
00105      05  D090-TRANS-SCAN-NO  PIC 9(5).                                    
00131 *    05  FILLER              PIC X(44).                                   
23511      05  FILLER                       PIC X(32).                          
WR5701     05  D090-SORT-BATCH-NBR-30       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-30          PIC 9(2).                           
00107      SKIP1                                                                
00108  01  D090-TRANSFER-TO-REC.                                                
00109      05  D090-CODE-31        PIC 99.                                      
00110      05  FILLER              PIC 9(4).                                    
00111      05  D090-TRANSFER-TO31  PIC X(5).                                    
00112      05  FILLER              PIC X.                                       
00113      05  D090-BUYER-31       PIC 99.                                      
00114      05  D090-DIV-31         PIC 9.                                       
00115      05  D090-DEPT-31        PIC XXX.                                     
00116      05  D090-CLASS-31       PIC XX.                                      
00117      05  D090-MERCH-MGR-31   PIC 99.                                      
00118      05  D090-DOC-NO-31      PIC X(5).                                    
00119      05  D090-TRANSFER-DATE-31.                                           
00120          10  D090-MM-31      PIC 99.                                      
00121          10  D090-DD-31      PIC 99.                                      
00122      05  D090-TRANSFER-FROM-31 PIC X(5).                                  
00123      05  D090-KOHLS-MM-31    PIC XX.                                      
23511      05  D090-UNITS-TRANSFER PIC 9(9).                                    
00125      05  D090-UNITS-TRANSFERX REDEFINES D090-UNITS-TRANSFER               
23511                              PIC X(9).                                    
23511      05  D090-RETAIL-PER     PIC S9(5)V99.                                
23511      05  D090-RETAIL-PERX REDEFINES D090-RETAIL-PER  PIC X(7).            
00129      05  FILLER              PIC X.                                       
00130      05  D090-TRANS-BATCH-31 PIC 9(3).                                    
23511      05  FILLER                       PIC X(37).                          
WR5701     05  D090-SORT-BATCH-NBR-31       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-31          PIC 9(2).                           
00132      SKIP1                                                                
00133  01  D090-MKDWN-REC.                                                      
00134      05  D090-CODE-40        PIC 99.                                      
00135      05  D090-BATCH-NO-40    PIC X(4).                                    
00136      05  D090-STORE-40       PIC X(5).                                    
00137      05  FILLER              PIC X.                                       
00138      05  D090-BUYER-40       PIC 99.                                      
00139      05  D090-DIV-40         PIC 9.                                       
00140      05  D090-DEPT-40        PIC XXX.                                     
00141      05  D090-CLASS-40       PIC XX.                                      
00142      05  D090-MERCH-MGR-40   PIC 99.                                      
00143      05  D090-DOC-NO-40      PIC X(5).                                    
00144      05  D090-MKDWN-DATE.                                                 
00145          10  D090-MKDWN-MM   PIC 99.                                      
00146          10  D090-MKDWN-DD   PIC 99.                                      
00147      05  D090-KOHLS-MM-40    PIC XX.                                      
00148      05  D090-VEND-NO-40     PIC X(5).                                    
00149      05  D090-MKDWN-REASON   PIC X.                                       
23511      05  D090-MKDWN-OPRICE   PIC S9(5)V99.                                
23511      05  D090-MKDWN-OPRICEX REDEFINES D090-MKDWN-OPRICE PIC X(7).         
23511      05  D090-MKDWN-NPRICE   PIC S9(5)V99.                                
23511      05  D090-MKDWN-NPRICEX REDEFINES D090-MKDWN-NPRICE PIC X(7).         
23511      05  D090-MKDWN-QTY      PIC 9(9).                                    
23511      05  D090-MKDWN-QTYX REDEFINES D090-MKDWN-QTY PIC X(9).               
23511      05  FILLER              PIC X(04).                                   
23511******** THE FINANCE-CORP FIELD MUST STAY IN ITS EXACT POSITION            
23511******** FOR PROGRAM MLKRP025 INTERNAL SORT WORK RECORD                    
23511      05  D090-FINANCE-CORP   PIC X(02).                                   
23511      05  FILLER              PIC X(03).                                   
00157      05  D090-CATEGORY-40    PIC X(01).                                   
00158      05  D090-7-DIGIT-DOCUMENT-NMBR-40                                    
00159                              PIC X(07).                                   
           05  D090-MKDWN-MKDN-MKUP-RSN-CDE                                     
                                   PIC X(03).                                   
00160 *    05  FILLER              PIC X(25).                                   
23511      05  FILLER                       PIC X(13).                          
WR5701     05  D090-SORT-BATCH-NBR-40       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-40          PIC 9(2).                           
00161      SKIP1                                                                
00162  01  D090-MARKON.                                                         
00163      05  D090-CODE-50        PIC XX.                                      
00164      05  D090-DOCNO-50       PIC 9(5).                                    
00165      05  D090-STORE-50       PIC 9(5).                                    
00166      05  D090-BUYER-50       PIC 99.                                      
00167      05  D090-DIV-50         PIC 9.                                       
00168      05  D090-DEPT-50        PIC 999.                                     
00169      05  D090-CLASS-50       PIC 99.                                      
00170      05  D090-MERCH-MGR-50   PIC 99.                                      
00171      05  D090-VENDOR-50      PIC 9(5).                                    
00172      05  D090-MARKON-DATE.                                                
00173          10  D090-MKON-MO    PIC 99.                                      
00174          10  D090-MKON-YR    PIC 99.                                      
00175      05  D090-KOHLS-MO-50    PIC 99.                                      
00176      05  D090-MKON-REASON    PIC X.                                       
00177      05  D090-OLD-PRICE      PIC S9(5)V99    COMP-3.                      
00178      05  D090-NEW-PRICE      PIC S9(5)V99    COMP-3.                      
23511      05  D090-MKON-QTY       PIC S9(9)       COMP-3.                      
00180      05  D090-BATCH-NO-50    PIC XXXX.                                    
23511      05  FILLER              PIC X(20).                                   
00182      05  D090-CATEGORY-50    PIC X(01).                                   
00183      05  D090-7-DIGIT-DOCUMENT-NMBR-50                                    
00184                              PIC X(07).                                   
           05  D090-MKON-MKDN-MKUP-RSN-CDE                                      
                                   PIC X(03).                                   
23511      05  FILLER                       PIC X(13).                          
WR5701     05  D090-SORT-BATCH-NBR-50       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-50          PIC 9(2).                           
00238      SKIP1                                                                
00239  01  D090-ADJ-REC.                                                        
00240      05  D090-CODE-80        PIC 99.                                      
00241      05  FILLER              PIC X(4).                                    
00242      05  D090-STORE-80       PIC X(5).                                    
00243      05  FILLER              PIC X.                                       
00244      05  D090-BUYER-80       PIC 99.                                      
00245      05  D090-DIV-80         PIC 9.                                       
00246      05  D090-DEPT-80        PIC XXX.                                     
00247      05  D090-CLASS-80       PIC XX.                                      
00248      05  D090-MERCH-MGR-80   PIC 99.                                      
00249      05  FILLER              PIC X(3).                                    
00250      05  D090-ADJ-DATE.                                                   
00251          10  D090-ADJ-MM     PIC 99.                                      
00252          10  D090-ADJ-DD     PIC 99.                                      
00253          10  D090-ADJ-YY     PIC 99.                                      
00254      05  D090-KOHLS-MM-80    PIC XX.                                      
R26603     05  D090-AT-RETAIL      PIC S9(11)V99.                               
R26603     05  D090-AT-RETAILX REDEFINES D090-AT-RETAIL PIC X(13).              
R26603     05  D090-AT-COST        PIC S9(11)V99.                               
R26603     05  D090-AT-COSTX REDEFINES D090-AT-COST     PIC X(13).              
R26603     05  FILLER              PIC X(21).                                   
00260      05  D090-SHRINKAGE-CD   PIC X.                                       
00261      05  FILLER              PIC XX.                                      
00262      05  D090-ADJ-CD         PIC X.                                       
WR5701     05  FILLER                       PIC X(11).                          
WR5701     05  D090-SORT-BATCH-NBR-80       PIC 9(3).                           
WR5701     05  D090-FISCAL-WEEK-80          PIC 9(2).                           
