      *****************************************************************         
      *    MLWS050 - TRANSACTION REFORMAT RECORD                                
      *    RECORD LENGTH - 125 BYTES                                            
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
00002 * MODIFIED 12/85: ADDED D115-RETURN-AMT TO CAPTURE RETURN AMOUNTS         
00003 *                 FOR KOHL'S STOCK LEDGER PROCESSING.                     
00004 *                    (D115-SALES-REC).                                    
00005 * MODIFIED 12/88: REMOVED PLANNED SALES AND PLANNED INVENTORY             
00006 *                 LAYOUTS.  ADDED TOTAL COST AMOUNT TO TRANSFER           
00007 *                 TO AND TRANSFER FROM RECORD.                            
00005 * MODIFIED 11/97: ADDED D115-MKDWN-MKDN-MKUP-RSN-CDE                      
00006 *                 TO D115-MKDWN-REC.                                      
00007 *                 ADDED D115-MARKON-MKDN-MKUP-RSN-CDE                     
00006 *                 TO D115-MARKON-REC.                                     
00007 *                 ADDED D115-FIN-LIAB-DTE                                 
00006 *                 TO D115-PURCH-JOURNAL-REC.                              
00007 *                 ADDED D115-AP-TRANS-CDE                                 
00006 *                 TO D115-PURCH-JOURNAL-REC.                              
00007 *                 ADDED D115-SALES-TYP-CDE                                
00006 *                 TO D115-SALES-REC.                                      
23511 * MODIFIED 03/02: EXPAND FIELDS                                           
23511 *         D115-MKDWN-OPRICE     D115-MKDWN-OPRICEX                        
23511 *         D115-MKDWN-NPRICE     D115-MKDWN-NPRICEX                        
23511 *         D115-MKDWN-QTY        D115-MKDWN-QTYX                           
23511 *         D115-MARKON-OPRICE    D115-MARKON-OPRICEX                       
23511 *         D115-MARKON-NPRICE    D115-MARKON-NPRICEX                       
23511 *         D115-MARKON-QTY       D115-MARKON-QTYX                          
23511 *         D115-MERCH-AMT        D115-MERCH-AMTX                           
23511 *         D115-DISCT-AMT        D115-DISCT-AMTX                           
23511 *         D115-FRGHT-AMT        D115-FRGHT-AMTX                           
23511 *         D115-NET-COST         D115-NET-COSTX                            
23511 *         D115-RETAIL-AMT       D115-RETAIL-AMTX                          
23511 *         D115-TRANS-UNITS      D115-TRANS-UNITSX                         
23511 *         D115-RETAIL-PER-UN    D115-RETAIL-PER-UNX                       
23511 *         D115-TOTAL-TRNSFR-FM-COST                                       
23511 *         D115-UNITS-TRANSFER   D115-UNITS-TRANSFERX                      
23511 *         D115-RETAIL-PER       D115-RETAIL-PERX                          
23511 *         D115-SALE-AMT         D115-SALE-AMTX                            
W26603* W26603  03-08-2004 ROD JANSSEN MERCH LEDGER STORE EXPANSION             
R26603* W26603  06-08-2004 ROD JANSSEN INVENTORY ADJUSTMENT TRAUNCATION         
W26606* W28582  01-24-2006 JOHN SELWITSCHKA                                     
W26606*                    PRICE CHANGE COPYBOOKS EXPANSION.                    
206118* 08/20/18  CHG0206118   COPYBOOK RENAMED FROM KDM2809 WHICH DID          
206118*                        NOT MEET STANDARDS FOR MAINFRAME                 
206118*                        REFACTORING.                                     
00008 ******************************************************************        
00009  01  D115-ON-ORDER-REC.                                                   
00010      05  D115-CODE           PIC 99.                                      
00011      05  D115-CODEX REDEFINES D115-CODE                                   
00012                              PIC X(2).                                    
00013      05  FILLER              PIC X(4).                                    
00014      05  D115-STORE          PIC X(5).                                    
00015      05  D115-DEPT           PIC 999.                                     
00016      05  D115-DEPTX REDEFINES D115-DEPT                                   
00017                              PIC X(3).                                    
00018      05  D115-CLASS          PIC 99.                                      
00019      05  D115-CLASSX REDEFINES D115-CLASS                                 
00020                              PIC X(2).                                    
00021      05  D115-DOC-NO-OO      PIC X(5).                                    
00022      05  D115-PURCH-DATE.                                                 
00023          10  D115-PURCH-MM   PIC 99.                                      
00024          10  D115-PURCH-DD   PIC 99.                                      
00025          10  D115-PURCH-YY   PIC 99.                                      
00026      05  D115-DELIVER-DATE.                                               
00027          10  D115-DELIV-MM   PIC 99.                                      
00028          10  D115-DELIV-DD   PIC 99.                                      
00029          10  D115-DELIV-YY   PIC 99.                                      
00030      05  D115-OO-AMT         PIC S9(7)V99.                                
00031      05  D115-OO-AMTX REDEFINES D115-OO-AMT  PIC X(9).                    
00032      05  D115-VEND-NO        PIC X(5).                                    
00033      05  FILLER              PIC X(20).                                   
23511      05  FILLER              PIC X(58).                                   
00035  01  D115-PURCH-JOURNAL-REC.                                              
00036      05  D115-CODE-10        PIC 99.                                      
00037      05  D115-BATCH-NO       PIC X(4).                                    
00038      05  D115-STORE-10       PIC X(5).                                    
00039      05  D115-DEPT-10        PIC 999.                                     
00040      05  D115-DEPT-10X REDEFINES D115-DEPT-10                             
00041                              PIC X(3).                                    
00042      05  D115-CLASS-10       PIC 99.                                      
00043      05  D115-CLASS-10X REDEFINES D115-CLASS-10                           
00044                              PIC X(2).                                    
00045      05  D115-DOC-NO-10      PIC X(5).                                    
00046      05  D115-DOC-DATE.                                                   
00047          10  D115-DOC-MM     PIC 99.                                      
00048          10  D115-DOC-DD     PIC 99.                                      
00049      05  FILLER              PIC XX.                                      
00050      05  D115-VEND-NO-10     PIC X(5).                                    
00051      05  D115-PO.                                                         
00052          10  D115-PO-TYPE    PIC X.                                       
00053          10  D115-PO-NO      PIC X(5).                                    
00054      05  D115-ACCT-NO        PIC X(5).                                    
00055      05  D115-KOHLS-MM       PIC XX.                                      
23511      05  D115-MERCH-AMT      PIC S9(7)V99.                                
23511      05  D115-MERCH-AMTX REDEFINES D115-MERCH-AMT    PIC X(9).            
23511      05  D115-DISCT-AMT      PIC S9(7)V99.                                
23511      05  D115-DISCT-AMTX REDEFINES D115-DISCT-AMT    PIC X(9).            
23511      05  D115-FRGHT-AMT      PIC S9(7)V99.                                
23511      05  D115-FRGHT-AMTX REDEFINES D115-FRGHT-AMT    PIC X(9).            
23511      05  D115-NET-COST       PIC S9(7)V99.                                
23511      05  D115-NET-COSTX REDEFINES D115-NET-COST  PIC X(9).                
23511      05  D115-RETAIL-AMT     PIC S9(7)V99.                                
23511      05  D115-RETAIL-AMTX REDEFINES D115-RETAIL-AMT  PIC X(9).            
00066      05  D115-TRANS-CD       PIC XX.                                      
00224      05  D115-PJ-FISCAL-DATE.                                             
00225          10  D115-PJ-FISCAL-WK      PIC 99.                               
00226          10  D115-PJ-FISCAL-PERIOD  PIC 99.                               
           05  D115-FIN-LIAB-DTE   PIC X(08).                                   
           05  D115-AP-TRANS-CDE   PIC X(02).                                   
W26603     05  D115-SKU-10         PIC 9(08).                                   
W26603     05  D115-ENT-ID         PIC 9(09).                                   
W26603     05  FILLER              PIC X(02).                                   
00068  01  D115-SALES-REC.                                                      
00069      05  D115-CODE-20        PIC 99.                                      
00070      05  D115-BATCH-20       PIC X(4).                                    
00071      05  D115-STORE-20       PIC X(5).                                    
00072      05  D115-DEPT-CLASS-20.                                              
00073          10  D115-DEPT-20    PIC 999.                                     
00074          10  D115-DEPT-20X REDEFINES D115-DEPT-20                         
00075                              PIC X(3).                                    
00076          10  D115-CLASS-20   PIC 99.                                      
00077          10  D115-CLASS-20X REDEFINES D115-CLASS-20                       
00078                              PIC X(2).                                    
00079      05  FILLER              PIC X(5).                                    
00080      05  D115-SALES-DATE     PIC X(6).                                    
00081      05  FILLER  REDEFINES D115-SALES-DATE.                               
00082          10  D115-SALES-MM   PIC 99.                                      
00083          10  D115-SALES-DD   PIC 99.                                      
00084          10  D115-SALES-YY   PIC 99.                                      
23511      05  D115-SALE-AMT       PIC S9(7)V99.                                
23511      05  D115-SALE-AMTX REDEFINES D115-SALE-AMT  PIC X(9).                
00087      05  FILLER              PIC X(5).                                    
00088      05  D115-SALE-WEEK      PIC 99.                                      
00089      05  D115-SALE-WEEKX REDEFINES D115-SALE-WEEK                         
00090                              PIC X(2).                                    
00091      05  D115-SALE-DAY       PIC 9.                                       
00092      05  D115-SALE-DAYX REDEFINES D115-SALE-DAY                           
00093                              PIC X.                                       
00094      05  D115-RETURN-AMT     PIC S9(5)V99.                                
00095      05  D115-RETURN-AMTX REDEFINES D115-RETURN-AMT                       
00096                              PIC X(7).                                    
00224      05  D115-SR-FISCAL-DATE.                                             
00225          10  D115-SR-FISCAL-WK      PIC 99.                               
00226          10  D115-SR-FISCAL-PERIOD  PIC 99.                               
           05  D115-SALE-TYP-CDE   PIC X(01).                                   
23511      05  FILLER              PIC X(69).                                   
00098  01  D115-TRANSFER-FROM-REC.                                              
00099      05  D115-CODE-30        PIC 99.                                      
00100      05  FILLER              PIC X(4).                                    
00101      05  D115-TRANSFER-FROM  PIC X(5).                                    
00102      05  D115-DEPT-30        PIC 999.                                     
00103      05  D115-DEPT-30X REDEFINES D115-DEPT-30                             
00104                              PIC X(3).                                    
00105      05  D115-CLASS-30       PIC 99.                                      
00106      05  D115-CLASS-30X REDEFINES D115-CLASS-30                           
00107                              PIC X(2).                                    
00108      05  D115-DOC-NO-30      PIC X(5).                                    
00109      05  D115-TRANSFER-DATE.                                              
00110          10  D115-TRANS-MM   PIC 99.                                      
00111          10  D115-TRANS-DD   PIC 99.                                      
00112      05  FILLER              PIC XX.                                      
00113      05  D115-TRANSFER-TO    PIC X(5).                                    
00114      05  D115-KOHLS-MM-30    PIC XX.                                      
23511      05  D115-TRANS-UNITS    PIC 9(9).                                    
23511      05  D115-TRANS-UNITSX REDEFINES D115-TRANS-UNITS                     
23511                              PIC X(9).                                    
23511      05  D115-RETAIL-PER-UN  PIC S9(5)V99.                                
23511      05  D115-RETAIL-PER-UNX REDEFINES D115-RETAIL-PER-UN                 
23511                              PIC X(7).                                    
00121      05  D115-TRANS-BATCH    PIC 9(3).                                    
00122      05  D115-TRANS-BATCHX REDEFINES D115-TRANS-BATCH                     
00123                              PIC X(3).                                    
00124      05  D115-TRANS-SCAN-NO  PIC 9(5).                                    
00125      05  D115-TRANS-SCANX REDEFINES D115-TRANS-SCAN-NO                    
00126                              PIC X(5).                                    
00127      05  D115-TOTAL-TRNSFR-FM-COST                                        
23511                              PIC S9(7)V99.                                
21731      05  FILLER              PIC X(08).                                   
00224      05  D115-TFR-FISCAL-DATE.                                            
00225          10  D115-TFR-FISCAL-WK      PIC 99.                              
00226          10  D115-TFR-FISCAL-PERIOD  PIC 99.                              
21731      05  D115-SKU-30         PIC X(08).                                   
21731      05  FILLER              PIC X(38).                                   
00134  01  D115-TRANSFER-TO-REC.                                                
00135      05  D115-CODE-31        PIC 99.                                      
00136      05  FILLER              PIC X(4).                                    
00137      05  D115-TRANSFER-TO31  PIC X(5).                                    
00138      05  D115-DEPT-31        PIC 999.                                     
00139      05  D115-CLASS-31       PIC 99.                                      
00140      05  D115-DOC-NO-31      PIC X(5).                                    
00141      05  D115-TRANSFER-DATE-31.                                           
00142          10  D115-MM-31      PIC 99.                                      
00143          10  D115-DD-31      PIC 99.                                      
00144      05  FILLER              PIC XX.                                      
00145      05  D115-TRANSFER-FROM-31   PIC X(5).                                
00146      05  D115-KOHLS-MM-31    PIC XX.                                      
23511      05  D115-UNITS-TRANSFER PIC 9(9).                                    
00148      05  D115-UNITS-TRANSFERX REDEFINES D115-UNITS-TRANSFER               
23511                                                      PIC X(9).            
23511      05  D115-RETAIL-PER     PIC S9(5)V99.                                
23511      05  D115-RETAIL-PERX REDEFINES D115-RETAIL-PER  PIC X(7).            
00152      05  D115-TRANS-BATCH-31 PIC 9(3).                                    
00153      05  D115-TRANS-BATCHX-31 REDEFINES D115-TRANS-BATCH-31               
00154                              PIC X(3).                                    
00155      05  FILLER              PIC X(5).                                    
00156      05  D115-TOTAL-TRNSFR-TO-COST                                        
23511                              PIC S9(7)V99.                                
21731      05  FILLER              PIC X(08).                                   
00224      05  D115-TTR-FISCAL-DATE.                                            
00225          10  D115-TTR-FISCAL-WK      PIC 99.                              
00226          10  D115-TTR-FISCAL-PERIOD  PIC 99.                              
21731      05  D115-SKU-31         PIC X(08).                                   
21731      05  FILLER              PIC X(38).                                   
00161  01  D115-MKDWN-REC.                                                      
00162      05  D115-CODE-40        PIC 99.                                      
00163      05  D115-BATCH-NO-40    PIC X(4).                                    
00164      05  D115-STORE-40       PIC X(5).                                    
00165      05  D115-DEPT-40        PIC 999.                                     
00166      05  D115-DEPT-40X REDEFINES D115-DEPT-40                             
00167                              PIC X(3).                                    
00168      05  D115-CLASS-40       PIC 99.                                      
00169      05  D115-CLASS-40X REDEFINES D115-CLASS-40                           
00170                              PIC X(2).                                    
00171      05  D115-DOC-NO-40      PIC X(5).                                    
00172      05  D115-MKDWN-DATE.                                                 
00173          10  D115-MKDWN-MM   PIC 99.                                      
00174          10  D115-MKDWN-DD   PIC 99.                                      
00175      05  FILLER              PIC XX.                                      
00176      05  D115-KOHLS-MM-40    PIC XX.                                      
00177      05  D115-VEND-NO-40     PIC X(5).                                    
00178      05  D115-MKDWN-REASON   PIC X.                                       
W26606     05  D115-MKDWN-OPRICE   PIC S9(11)V99.                               
W26606     05  D115-MKDWN-OPRICEX REDEFINES D115-MKDWN-OPRICE                   
W26606                             PIC X(13).                                   
W26606     05  D115-MKDWN-NPRICE   PIC S9(11)V99.                               
W26606     05  D115-MKDWN-NPRICEX REDEFINES D115-MKDWN-NPRICE                   
W26606                             PIC X(13).                                   
23511      05  D115-MKDWN-QTY      PIC 9(9).                                    
23511      05  D115-MKDWN-QTYX  REDEFINES  D115-MKDWN-QTY  PIC X(9).            
00187      05  FILLER              PIC X(13).                                   
00188      05  D115-CATEGORY-40    PIC X(01).                                   
00189      05  D115-7-DIGIT-DOCUMENT-NMBR-40                                    
00190                              PIC X(07).                                   
00224      05  D115-MKDWN-FISCAL-DATE.                                          
00225          10  D115-MKDWN-FISCAL-WK      PIC 99.                            
00226          10  D115-MKDWN-FISCAL-PERIOD  PIC 99.                            
           05  D115-MKDWN-MKDN-MKUP-RSN-CDE  PIC X(3).                          
W26603     05  D115-ENT-ID-40      PIC 9(09).                                   
W26606     05  FILLER              PIC X(18).                                   
00192  01  D115-MARKON-REC.                                                     
00193      05  D115-CODE-50        PIC 99.                                      
00194      05  D115-BATCH-NO-50    PIC X(4).                                    
00195      05  D115-STORE-50       PIC X(5).                                    
00196      05  D115-DEPT-50        PIC 999.                                     
00197      05  D115-DEPT-50X REDEFINES D115-DEPT-50                             
00198                              PIC X(3).                                    
00199      05  D115-CLASS-50       PIC 99.                                      
00200      05  D115-CLASS-50X REDEFINES D115-CLASS-50                           
00201                              PIC X(2).                                    
00202      05  D115-DOC-NO-50      PIC X(5).                                    
00203      05  D115-MARKON-DATE.                                                
00204          10  D115-MARKON-MM  PIC 99.                                      
00205          10  D115-MARKON-DD  PIC 99.                                      
00206      05  FILLER              PIC XX.                                      
00207      05  D115-KOHLS-MM-50    PIC XX.                                      
00208      05  D115-VEND-NO-50     PIC X(5).                                    
00209      05  D115-MARKON-REASON  PIC X.                                       
W26606     05  D115-MARKON-OPRICE  PIC S9(11)V99.                               
W26606     05  D115-MARKON-OPRICEX REDEFINES D115-MARKON-OPRICE                 
W26606                             PIC X(13).                                   
W26606     05  D115-MARKON-NPRICE  PIC S9(11)V99.                               
W26606     05  D115-MARKON-NPRICEX REDEFINES D115-MARKON-NPRICE                 
W26606                             PIC X(13).                                   
23511      05  D115-MARKON-QTY     PIC 9(9).                                    
23511      05  D115-MARKON-QTYX  REDEFINES  D115-MARKON-QTY                     
23511                              PIC X(9).                                    
00219      05  FILLER              PIC X(13).                                   
00220      05  D115-CATEGORY-50    PIC X(01).                                   
00221      05  D115-7-DIGIT-DOCUMENT-NMBR-50                                    
00222                              PIC X(07).                                   
00224      05  D115-MARKON-FISCAL-DATE.                                         
00225          10  D115-MARKON-FISCAL-WK      PIC 99.                           
00226          10  D115-MARKON-FISCAL-PERIOD  PIC 99.                           
           05  D115-MARKON-MKDN-MKUP-RSN-CDE  PIC X(3).                         
W26603     05  D115-ENT-ID-50      PIC 9(09).                                   
W26606     05  FILLER              PIC X(18).                                   
00224  01  D115-ADJ-REC.                                                        
00225      05  D115-CODE-80        PIC 99.                                      
00226      05  FILLER              PIC X(4).                                    
00227      05  D115-STORE-80       PIC X(5).                                    
00228      05  D115-DEPT-80        PIC 999.                                     
00229      05  D115-DEPT-80X REDEFINES D115-DEPT-80                             
00230                              PIC X(3).                                    
00231      05  D115-CLASS-80       PIC 99.                                      
00232      05  D115-CLASS-80X REDEFINES D115-CLASS-80                           
00233                              PIC X(2).                                    
00234      05  FILLER              PIC X(5).                                    
00235      05  D115-ADJ-DATE.                                                   
00236          10  D115-ADJ-MM     PIC 99.                                      
00237          10  D115-ADJ-DD     PIC 99.                                      
00238          10  D115-ADJ-YY     PIC 99.                                      
00239      05  D115-KOHLS-MM-80    PIC XX.                                      
R26603     05  D115-AT-RETAIL      PIC S9(11)V99.                               
R26603     05  D115-AT-RETAILX REDEFINES D115-AT-RETAIL                         
R26603                             PIC X(13).                                   
R26603     05  D115-AT-COST        PIC S9(11)V99.                               
R26603     05  D115-AT-COSTX REDEFINES D115-AT-COST                             
R26603                             PIC X(13).                                   
R26603     05  FILLER              PIC X(21).                                   
00247      05  D115-SHRINKAGE-CD   PIC X.                                       
00248      05  FILLER              PIC XX.                                      
00249      05  D115-ADJ-CD         PIC X.                                       
00224      05  D115-AR-FISCAL-DATE.                                             
00225          10  D115-AR-FISCAL-WK      PIC 99.                               
00226          10  D115-AR-FISCAL-PERIOD  PIC 99.                               
23511      05  FILLER              PIC X(41).                                   
