      ******************************************************************        
       IDENTIFICATION DIVISION.                                                 
      ******************************************************************        
                                                                                
       PROGRAM-ID.      MOKUT620.                                               
       AUTHOR.          TOM BOYD.                                               
       INSTALLATION.    KOHLS DEPARTMENT STORES.                                
       DATE-WRITTEN.    MARCH 2006.                                             
       DATE-COMPILED.                                                           
                                                                                
      ******************************************************************        
      * THIS PROGRAM WAS CREATED TO SETUP UPDATE THE RUN CONTROL RECORD         
      * BASED ON THE DEPARTMENTS ON THE DEPARTMENT CONTROL RECORD.              
      * (MOTW_PRC_CNTL)                                                         
      ******************************************************************        
      **  HISTORY LOG:                                                 *        
      ******************************************************************        
      * DATE:         04/10/2006                                       *        
      * WR/IR#:       WR29858                                          *        
      * PROGRAMMER:   TOM BOYD                                                  
      * DESCRIPTION:  INITIAL CREATION.                                *        
      ******************************************************************        
      * DATE:         06/14/2006                                       *        
      * WR/IR#:       P000890369                                       *        
      * PROGRAMMER:   DARYL WOELFEL                                    *        
      * DESCRIPTION:  REMOVED OLD "ALTER SESSION COST=5" STATEMENT, AS *        
      *               IT WAS CAUSING THE SQL TO TAKE A BAD PATH.       *        
      ******************************************************************        
      * DATE:         07/30/2018                                       *        
      * WR/IR#:       CHG0204126                                       *        
      * PROGRAMMER:   COGNIZANT                                        *        
      * DESCRIPTION:  ORACLE LOGON STANDARDS PROGRAM CHANGE            *        
      ******************************************************************        
                                                                                
      ******************************************************************        
       ENVIRONMENT DIVISION.                                                    
      ******************************************************************        
                                                                                
       CONFIGURATION SECTION.                                                   
                                                                                
       SOURCE-COMPUTER. IBM-3090.                                               
       OBJECT-COMPUTER. IBM-3090.                                               
                                                                                
       INPUT-OUTPUT SECTION.                                                    
                                                                                
       FILE-CONTROL.                                                            
                                                                                
           SELECT ORACLE-LOGON-FILE                                             
                  ASSIGN                    TO ORALOGON.                        
                                                                                
      ******************************************************************        
       DATA DIVISION.                                                           
      ******************************************************************        
       FILE SECTION.                                                            
                                                                                
       FD  ORACLE-LOGON-FILE                                                    
           RECORDING MODE IS F                                                  
           LABEL RECORDS ARE STANDARD                                           
           BLOCK CONTAINS 0 RECORDS                                             
           RECORD CONTAINS 80 CHARACTERS                                        
           DATA RECORDS IS OL-ORACLE-LOGON-RECORD.                              
       01  OL-ORACLE-LOGON-RECORD      PIC X(80).                               
                                                                                
       WORKING-STORAGE SECTION.                                                 
                                                                                
      ******************************************************************        
      * PC PROGRAM CONSTANTS                                                    
      ******************************************************************        
       01  PC-PROGRAM-CONSTANTS.                                                
           05  PC-AUTO-LOGON               PIC  X(01)  VALUE '/'.               
           05  PC-PROGRAM-NAME             PIC  X(08)  VALUE                    
                                                       'MOKUT620'.              
                                                                                
      ******************************************************************        
      * PV PROGRAM VARIABLES                                                    
      ******************************************************************        
       01  PV-PROGRAM-VARIABLES.                                                
           05  PV-ORACLE-USERID-LEN        PIC S9(04)  VALUE ZEROS              
                                                       COMP SYNC.               
           05  PV-ORACLE-PASSWORD-LEN      PIC S9(04)  VALUE ZEROS              
                                                       COMP SYNC.               
           05  PV-TABLE-NAME               PIC  X(30)  VALUE SPACES.            
           05  PV-SQL-CODE                 PIC  9(09)  VALUE 0.                 
           05  PV-PARAGRAPH-NAME           PIC  X(40)  VALUE SPACES.            
           05  PV-OPERATION-MSG            PIC  X(60)  VALUE SPACES.            
           05  PV-OPERATION-MSG-1          PIC  X(40)  VALUE SPACES.            
           05  PV-OPERATION-MSG-2          PIC  X(40)  VALUE SPACES.            
                                                                                
      ******************************************************************        
      * PS PROGRAM SWITCHES                                            *        
      ******************************************************************        
       01  PS-PROGRAM-SWITCHES.                                                 
006510     05  PS-END-OF-LOGON-FILE-SW     PIC X(01)   VALUE 'N'.               
006530         88  PS-END-OF-LOGON-FILE                VALUE 'Y'.               
           05  PS-ORA-SRC-CTL-DONE-SW  PIC  X(01)      VALUE 'N'.               
               88  PS-ORA-SRC-EMPTY                    VALUE 'Y'.               
                                                                                
       01  CC-ORACLE-CONNECTION.                                                
           05  CC-ORACLE-USERID             PIC X(40).                          
               88 CC-AUTO-LOGON                         VALUE '/'.              
           05  CC-ORACLE-PASSWORD           PIC X(40).                          
                                                                                
      ******************************************************************        
      * AC ABEND CODES                                                 *        
      ******************************************************************        
                                                                                
       01  ABEND-CODE                      PIC S9(04)  VALUE +0  COMP.          
           88  ABEND-4001-WRITE-ERROR                  VALUE +4001.             
           88  ABEND-4002-READ-ERROR                   VALUE +4002.             
           88  ABEND-4003-CTRL-CARD-ERROR              VALUE +4003.             
           88  ABEND-4004-TABLE-ERROR                  VALUE +4004.             
           88  ABEND-4005-OPEN-ERROR                   VALUE +4005.             
           88  ABEND-4006-CLOSE-ERROR                  VALUE +4006.             
           88  ABEND-4007-SEQUENCE-ERROR               VALUE +4007.             
           88  ABEND-4008-DATA-ERROR                   VALUE +4008.             
           88  ABEND-4009-KEY-DATA-ERROR               VALUE +4009.             
           88  ABEND-4013-DB2-ERROR                    VALUE +4013.             
           88  ABEND-4014-ORACLE-LOGON-ERROR           VALUE +4014.             
           88  ABEND-4019-DATE-ROUTINE-ERROR           VALUE +4019.             
           88  ABEND-4444-FORCED-ABEND                 VALUE +4444.             
                                                                                
      *----------------------------------------------------------               
      *                      O  R  A  C  L  E                                   
      *==========================================================               
      *                                                                         
      * ORACLE DECLARE SECTION                                                  
      * ORACLE USED AND RETURNED VARIABLES                                      
      *                                                                         
      *----------------------------------------------------------               
      *    COPY MOWS700.                                                        
                                                                                
           EXEC SQL BEGIN DECLARE SECTION END-EXEC.                             
                                                                                
      *----------------------------------------------------------               
      * ORACLE LOGON WORKING STORAGE COPYBOOK                                   
      *----------------------------------------------------------               
                                                                                
       01  PC-ENT01-TYPE-CDE               PIC  X(02)  VALUE '01'.              
       01  PV-ORACLE-ID                    PIC  X(01)  VALUE '/'.               
                                                                                
       01  USERNAME                        PIC  X(10)  VARYING.                 
       01  PASSWD                          PIC  X(10)  VARYING.                 
                                                                                
       01  ORACLE-RETURN                   PIC  X(200) VALUE SPACES.            
                                                                                
           EXEC SQL END DECLARE SECTION END-EXEC.                               
           EXEC SQL INCLUDE SQLCACOB    END-EXEC.                               
                                                                                
       EJECT                                                                    
                                                                                
       PROCEDURE DIVISION.                                                      
                                                                                
      ******************************************************************        
      * MAIN PROCESSING                                                         
      ******************************************************************        
       A100-PROGRAM-MAINLINE.                                                   
                                                                                
           PERFORM B100-INITIALIZE.                                             
                                                                                
           PERFORM C100-CONTROL.                                                
                                                                                
           GOBACK.                                                              
                                                                                
      ******************************************************************        
      * OPEN FILES                                                              
      ******************************************************************        
       B100-INITIALIZE.                                                         
                                                                                
           OPEN INPUT ORACLE-LOGON-FILE.                                        
                                                                                
           PERFORM 7000-READ-ORACLE-LOGON.                                      
                                                                                
           CLOSE ORACLE-LOGON-FILE.                                             
                                                                                
           IF ((PS-END-OF-LOGON-FILE)                                           
                   OR (CC-ORACLE-CONNECTION = SPACES))                          
               DISPLAY '** ABEND **'                                            
               DISPLAY PC-PROGRAM-NAME ' - ORACLE LOGON CONTROL CARD '          
                         'NOT PROVIDED'                                         
               SET PS-ORA-SRC-EMPTY TO TRUE                                     
               CALL 'ILBOABN0' USING ABEND-CODE                                 
           END-IF.                                                              
                                                                                
           IF CC-AUTO-LOGON                                                     
               DISPLAY PC-PROGRAM-NAME ' - AUTO LOGON TO ORACLE'                
               EXEC SQL                                                         
                    CONNECT :USERNAME                                           
               END-EXEC                                                         
           ELSE                                                                 
               INITIALIZE PV-ORACLE-USERID-LEN                                  
                          PV-ORACLE-PASSWORD-LEN                                
               INSPECT CC-ORACLE-USERID                                         
                   TALLYING PV-ORACLE-USERID-LEN                                
                FOR CHARACTERS BEFORE INITIAL SPACE                             
            INSPECT CC-ORACLE-PASSWORD                                          
                TALLYING PV-ORACLE-PASSWORD-LEN                                 
                FOR CHARACTERS BEFORE INITIAL SPACE                             
            MOVE CC-ORACLE-USERID (1:PV-ORACLE-USERID-LEN) TO                   
                      USERNAME-ARR                                              
            MOVE PV-ORACLE-USERID-LEN TO USERNAME-LEN                           
            MOVE CC-ORACLE-PASSWORD (1:PV-ORACLE-PASSWORD-LEN) TO               
                      PASSWD-ARR                                                
            MOVE PV-ORACLE-PASSWORD-LEN TO PASSWD-LEN                           
            DISPLAY PC-PROGRAM-NAME ' - LOGON TO ORACLE AS USER '               
                      USERNAME-ARR                                              
            EXEC SQL                                                            
              CONNECT :USERNAME IDENTIFIED BY :PASSWD                           
            END-EXEC                                                            
            INITIALIZE CC-ORACLE-PASSWORD                                       
                       PASSWD                                                   
            END-IF.                                                             
                                                                                
020500     IF (SQLCODE NOT = 0)                                                 
020900         DISPLAY PV-PARAGRAPH-NAME                                        
020910         DISPLAY PC-PROGRAM-NAME ' - ERROR LOGGING ON TO ORACLE'          
021000         PERFORM 9900-ORACLE-ABEND                                        
021200     END-IF.                                                              
                                                                                
                                                                                
      *--------------------------------------------------------------           
      * THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION THAT              
      * LOGS ON TO ORACLE.                                                      
      *---------------------------------------------------------------          
      *    COPY MOPD700.                                                        
                                                                                
      ******************************************************************        
      * NEEDS TO BE IN FOR NOW TIL KURT FIXES CURSOR SHARING BUG                
      * OTHERWISE I GET A ORA-3113 ERROR                                        
      ******************************************************************        
           EXEC SQL                                                             
            ALTER SESSION                                                       
                  SET CURSOR_SHARING = 'EXACT'                                  
           END-EXEC.                                                            
                                                                                
                                                                                
      ******************************************************************        
      * RESET MOTW_PRC_CNTL                                                     
      ******************************************************************        
       C100-CONTROL.                                                            
                                                                                
           EXEC SQL EXECUTE                                                     
            BEGIN                                                               
             K_MO01.K_MOPG_SAS_UTILITIES.K_MOSP_CNTL_DEPT_SETUP;                
            END;                                                                
           END-EXEC.                                                            
                                                                                
           EVALUATE TRUE                                                        
             WHEN SQLCODE = ZEROES                                              
                 CONTINUE                                                       
             WHEN OTHER                                                         
                 MOVE SQLCODE          TO PV-SQL-CODE                           
                 MOVE 'MOTW_PRC_CNTL ' TO PV-TABLE-NAME                         
                 MOVE 'C100-CONTROL '  TO PV-PARAGRAPH-NAME                     
                 PERFORM 9900-ORACLE-ABEND                                      
           END-EVALUATE.                                                        
                                                                                
                                                                                
      *-----------------------------------------------------------              
      * Z100-ABEND                                                              
      *  - PERFORM AN ABEND THAT OCCURED RELATED TO ORACLE                      
      *  - CALLED BY MOPD700!                                                   
      *-----------------------------------------------------------              
       Z100-ABEND.                                                              
                                                                                
           DISPLAY '                       '.                                   
           DISPLAY '** ABEND **       ** = SQLERROR'.                           
           DISPLAY '** PROGRAM        ** = ' PC-PROGRAM-NAME.                   
           DISPLAY '** SQLCODE        ** = ' SQLCODE.                           
           DISPLAY '** ABEND CODE     ** = ' ABEND-CODE.                        
           DISPLAY '** SQLERRM        ** = ' SQLERRM.                           
           DISPLAY '** SQLERRMC       ** = ' SQLERRMC.                          
           DISPLAY '** SQLERRD(5)     ** = ' SQLERRD(5).                        
           DISPLAY '** PARAGRAPH      ** = ' PV-PARAGRAPH-NAME.                 
           DISPLAY '** TABLE          ** = ' PV-TABLE-NAME.                     
           DISPLAY '** OPERATION      ** = ' PV-OPERATION-MSG.                  
           DISPLAY '                       '.                                   
                                                                                
           CALL 'ILBOABN0' USING ABEND-CODE.                                    
                                                                                
                                                                                
034503****************************************************************          
034504** READ THE ORACLE LOGON CONTROL CARD.                        **          
034505****************************************************************          
034506 7000-READ-ORACLE-LOGON.                                                  
                                                                                
034510     READ ORACLE-LOGON-FILE                                               
034520         INTO CC-ORACLE-CONNECTION                                        
034530         AT END                                                           
034540             SET PS-END-OF-LOGON-FILE TO TRUE                             
034550     END-READ.                                                            
034600*                                                                         
                                                                                
      *----------------------------------------------------------               
      * 9900-ORACLE-ABEND.                                                      
      *     PERFORM AN ABEND THAT OCCURED RELATED TO ORACLE.                    
      *----------------------------------------------------------               
       9900-ORACLE-ABEND.                                                       
                                                                                
           DISPLAY '                       '.                                   
           DISPLAY '** ABEND **       ** = SQLERROR'.                           
           DISPLAY '** PROGRAM        ** = ' PC-PROGRAM-NAME.                   
           DISPLAY '** SQLCODE        ** = ' PV-SQL-CODE.                       
           DISPLAY '** ABEND CODE     ** = ' ABEND-CODE.                        
           DISPLAY '** SQLERRM        ** = ' SQLERRM.                           
           DISPLAY '** SQLERRMC       ** = ' SQLERRMC.                          
           DISPLAY '** SQLERRD(5)     ** = ' SQLERRD(5).                        
           DISPLAY '** PARAGRAPH      ** = ' PV-PARAGRAPH-NAME.                 
           DISPLAY '** TABLE          ** = ' PV-TABLE-NAME.                     
           DISPLAY '** OPERATION      ** = ' PV-OPERATION-MSG.                  
           DISPLAY '                       '.                                   
                                                                                
           CALL 'ILBOABN0' USING ABEND-CODE.                                    
                                                                                
                                                                                
      *----------------------------------------------------------               
      * 9999-APPLICATION-ABEND.                                                 
      *     PERFORM AN ABEND IF AN ERROR IS DETECTED.                           
      *----------------------------------------------------------               
       9999-APPLICATION-ABEND.                                                  
                                                                                
           DISPLAY '                       '.                                   
           DISPLAY '** ABEND **       ** = '.                                   
           DISPLAY '** PROGRAM        ** = ' PC-PROGRAM-NAME.                   
           DISPLAY '** ABEND CODE     ** = ' ABEND-CODE.                        
           DISPLAY '** PARAGRAPH      ** = ' PV-PARAGRAPH-NAME.                 
           DISPLAY '** OPERATION      ** = ' PV-OPERATION-MSG.                  
           DISPLAY '                       '.                                   
                                                                                
           CALL 'ILBOABN0' USING ABEND-CODE.                                    
                                                                                
                                                                                
