      ***********************************************************       00010000
      **                      MORD117                          **       00020001
      **                     LRECL=97                          **       00030000
      **  THIS COPYBOOK IS THE LAYOUT FOR THE SAS ETL PROJECT. **       00040000
      **  STG_PROD_PRICE_COST TABLE (MOT_STGG_STR_STYL_PRICG)  **       00050001
      ***********************************************************       00060000
       01 MO117-SAS-PROD-PRICE.                                         00070000
      *STG_PROD_PRICE_COST.GEO_ID                                       00080000
          05 MO117-STR-LVL-CDE             PIC X(01) VALUE '5'.         00090002
          05 MO117-STR-NBR                 PIC 9(04) VALUE 0.           00100000
          05 FILLER                        PIC X(01) VALUE '|'.         00110000
      *STG_PROD_PRICE_COST.PROD_ID                                      00120000
          05 MO117-STYL-ID                 PIC 9(08) VALUE 0.           00130000
          05 FILLER                        PIC X(01) VALUE '|'.         00140000
      *STG_PROD_PRICE_COST.EFFECTIVE_DT                                 00150000
          05 MO117-STRT-TMST.                                           00160000
             10 MO117-STRT-TMST-MM         PIC XX    VALUE SPACES.      00170000
             10 FILLER                     PIC X     VALUE '-'.         00180000
             10 MO117-STRT-TMST-DD         PIC XX    VALUE SPACES.      00190000
             10 FILLER                     PIC X     VALUE '-'.         00200000
             10 MO117-STRT-TMST-YYYY       PIC X(04) VALUE SPACES.      00210000
             10 FILLER                     PIC X     VALUE '-'.         00220000
             10 MO117-STRT-TMST-HH24       PIC X(02) VALUE SPACES.      00230000
             10 FILLER                     PIC X     VALUE '.'.         00240000
             10 MO117-STRT-TMST-MI         PIC X(02) VALUE SPACES.      00250000
             10 FILLER                     PIC X     VALUE '.'.         00260000
             10 MO117-STRT-TMST-SS         PIC X(02) VALUE SPACES.      00270000
          05 FILLER                        PIC X(01) VALUE '|'.         00280000
      *STG_PROD_PRICE_COST.EXPIRATION_DT                                00290000
          05 MO117-END-TMST.                                            00300000
             10 MO117-END-TMST-MM          PIC XX    VALUE SPACES.      00310000
             10 FILLER                     PIC X     VALUE '-'.         00320000
             10 MO117-END-TMST-DD          PIC XX    VALUE SPACES.      00330000
             10 FILLER                     PIC X     VALUE '-'.         00340000
             10 MO117-END-TMST-YYYY        PIC X(04) VALUE SPACES.      00350000
             10 FILLER                     PIC X     VALUE '-'.         00360000
             10 MO117-END-TMST-HH24        PIC X(02) VALUE SPACES.      00370000
             10 FILLER                     PIC X     VALUE '.'.         00380000
             10 MO117-END-TMST-MI          PIC X(02) VALUE SPACES.      00390000
             10 FILLER                     PIC X     VALUE '.'.         00400000
             10 MO117-END-TMST-SS          PIC X(02) VALUE SPACES.      00410000
          05 FILLER                        PIC X(01) VALUE '|'.         00420000
      *STG_PROD_PRICE_COST.REGULAR_UNIT_PRICE                           00430000
          05 MO117-LAST-ACT-UNT-RTL-AMT    PIC 9(08).99  VALUE SPACES.  00440000
          05 FILLER                        PIC X(01) VALUE '|'.         00450000
      *STG_PROD_PRICE_COST.ACTUAL_UNIT_PRICE                            00460000
          05 MO117-ACTUAL-UNIT-PRICE       PIC 9(08).99  VALUE SPACES.  00470000
          05 FILLER                        PIC X(01) VALUE '|'.         00480000
      *STG_PROD_PRICE_COST.ACTUAL-UNIT-PRICE-IND                        00490000
          05 MO117-STYL-STAT-CDE           PIC X(03) VALUE SPACES.      00500000
          05 FILLER                        PIC X(01) VALUE '|'.         00510000
      *STG_PROD_PRICE_COST.COST                                         00520000
          05 MO117-UNT-COST-AMT            PIC 9(08).99  VALUE SPACES.  00530000
          05 FILLER                        PIC X(01) VALUE '|'.         00540000
      *STG_PROD_PRICE_COST.TOTAL_COST                                   00550000
          05 FILLER                        PIC X(01) VALUE '|'.         00560000
      *STG_PROD_PRICE_COST.CHANGE_FLG                                   00570000
          05 MO117-CHANGE-FLG              PIC X(01) VALUE '|'.         00580000
