*          DATA SET MPKM024    AT LEVEL 010 AS OF 06/17/91                      
*       PRINT NOGEN                                                     00001   
MPKM024  DFHMSD TYPE=MAP,                                              X00002   
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
MP024A   DFHMDI SIZE=(08,20),                                          X00008   
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010   
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012   
               LENGTH=003,                                             X00013   
               ATTRB=(ASKIP,NORM),                                     X00014   
               INITIAL='SKU'                                            00015**2
*                                                                       00016   
ASKUNBR  DFHMDF POS=(01,05),                                           X00017**8
               LENGTH=015,                                             X00018**2
               ATTRB=(ASKIP,NORM)                                       00019**2
*                                                                       00020**2
         DFHMDF POS=(02,01),                                           X00021**6
               LENGTH=003,                                             X00022*10
               ATTRB=(ASKIP,NORM),                                     X00023**6
               INITIAL='UPC'                                            00024*10
*                                                                       00025**6
AUPCNBR  DFHMDF POS=(02,05),                                           X00026*10
               LENGTH=013,                                             X00027**6
               ATTRB=(UNPROT,NORM,IC)                                   00028**3
*                                                                       00029**2
         DFHMDF POS=(02,19),                                           X00030*10
               LENGTH=001,                                             X00031*10
               ATTRB=(ASKIP)                                            00032*10
*                                                                       00033*10
AMSGLN1  DFHMDF POS=(04,01),                                           X00034**2
               LENGTH=019,                                             X00035   
               ATTRB=(ASKIP,NORM)                                       00036   
*                                                                       00037   
AMSGLN2  DFHMDF POS=(05,01),                                           X00038**2
               LENGTH=019,                                             X00039**2
               ATTRB=(ASKIP,NORM)                                       00040**2
*                                                                       00041**2
AMSGLN3  DFHMDF POS=(06,01),                                           X00042**2
               LENGTH=019,                                             X00043**2
               ATTRB=(ASKIP,NORM)                                       00044**2
*                                                                       00045**2
AMSGLN4  DFHMDF POS=(07,01),                                           X00046**5
               LENGTH=019,                                             X00047**5
               ATTRB=(ASKIP,NORM)                                       00048**5
*                                                                       00049**5
         DFHMDF POS=(08,01),                                           X00050**2
               LENGTH=018,                                             X00051**7
               ATTRB=(ASKIP,NORM),                                     X00052**2
               INITIAL='F3 =END F5 =DECERT'                             00053**9
         DFHMSD TYPE=FINAL                                              00055   
         END                                                            00056   
