*          DATA SET MPKM026    AT LEVEL 030 AS OF 06/17/91                      
        PRINT NOGEN                                                     00001   
MPKM026  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
MP026A   DFHMDI SIZE=(08,20),                                          X00008*22
               MAPATTS=(COLOR,HILIGHT),                                X00007   
               DSATTS=(COLOR,HILIGHT),                                 X00008   
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='UPC'                                            00015*29
*                                                                       00016   
AUPCNBR  DFHMDF POS=(01,05),                                           X00017*29
               LENGTH=013,                                             X00018*13
               ATTRB=(UNPROT,NORM,IC)                                   00019*24
*                                                                       00020*30
         DFHMDF POS=(01,19),                                           X00021*30
               LENGTH=001,                                             X00022*30
               ATTRB=(ASKIP)                                            00023*29
*                                                                       00024*30
         DFHMDF POS=(02,01),                                           X00025*14
               LENGTH=004,                                             X00026*26
               ATTRB=(ASKIP,NORM),                                     X00027*14
               INITIAL='SKU:'                                           00028*26
*                                                                       00029*14
*******************************************************************             
*   SIZE OF ASKU REDUCED   TO 8                         WR# 230ZZ *             
*******************************************************************             
ASKU     DFHMDF POS=(02,06),                                           X00030*26
               LENGTH=008,                                             X00031   
               ATTRB=(ASKIP,NORM)                                       00032*15
*******************************************************************             
*   CHANGE MADE FOR WR# 230ZZ ENDS HERE                           *             
*******************************************************************             
*                                                                       00029*14
AMOIND   DFHMDF POS=(02,17),                                           X00030*26
               LENGTH=003,                                             X00031   
               COLOR=YELLOW,                                           X00031   
               ATTRB=(ASKIP,NORM)                                       00032*15
*                                                                       00033   
ADESC    DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00037   
AVNDRNM  DFHMDF POS=(04,01),                                           X00038*22
               LENGTH=019,                                             X00039*22
               ATTRB=(ASKIP,NORM)                                       00040*22
*                                                                       00041*22
         DFHMDF POS=(05,01),                                           X00042**8
               LENGTH=003,                                             X00043**5
               ATTRB=(ASKIP,NORM),                                     X00044**5
               INITIAL='STL'                                            00045**5
*                                                                       00046**5
ASTYLE   DFHMDF POS=(05,05),                                           X00047**8
               LENGTH=015,                                             X00048**5
               ATTRB=(ASKIP,NORM)                                       00049*14
*                                                                       00050**5
         DFHMDF POS=(06,01),                                           X00051**5
               LENGTH=008,                                             X00052**5
               ATTRB=(ASKIP,NORM),                                     X00053   
               INITIAL='SIZE/CLR'                                       00054**5
*                                                                       00055   
ASIZE    DFHMDF POS=(06,10),                                           X00056**5
               LENGTH=005,                                             X00057**5
               ATTRB=(ASKIP,NORM)                                       00058*14
*                                                                       00059**5
ACOLOR   DFHMDF POS=(06,16),                                           X00060**5
               LENGTH=004,                                             X00061**5
               ATTRB=(ASKIP,NORM)                                       00062*14
*                                                                       00063   
ARETAIL  DFHMDF POS=(07,01),                                           X00064**9
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               PICOUT='ZZ,ZZZ.ZZ'                                       00067**5
*                                                                       00068   
AGRPRTL  DFHMDF POS=(07,11),                                           X00069*11
               LENGTH=009,                                             X00070*25
               ATTRB=(ASKIP,NORM)                                       00071*14
*                                                                       00072**5
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
