*          DATA SET MPKM023    AT LEVEL 003 AS OF 09/15/95                      
*          DATA SET MPKM023    AT LEVEL 001 AS OF 02/23/95              00001**1
*          DATA SET MPKM023    AT LEVEL 001 AS OF 09/26/91              00002**1
*          DATA SET MPKM023    AT LEVEL 009 AS OF 04/30/91              00003**1
        PRINT NOGEN                                                     00004**1
MPKM023  DFHMSD TYPE=MAP,                                              X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               CTRL=FREEKB                                              00009**1
*                                                                       00010**1
MP023A   DFHMDI SIZE=(08,20),                                          X00011**1
               LINE=1,                                                 X00012**1
               COLUMN=1                                                 00013**1
*                                                                       00014**1
         DFHMDF POS=(01,01),                                           X00015**1
               LENGTH=017,                                             X00016**1
               ATTRB=(ASKIP,NORM),                                     X00017**1
               INITIAL='UPC CERTIFICATION'                              00018**1
*                                                                       00019**1
         DFHMDF POS=(03,02),                                           X00020**1
               LENGTH=007,                                             X00021**1
               ATTRB=(ASKIP,NORM),                                     X00022**1
               INITIAL='PO NBR:'                                        00023**1
*                                                                       00024**1
APONBR   DFHMDF POS=(03,10),                                           X00025**1
               LENGTH=008,                                             X00026**1
               ATTRB=(UNPROT,NORM,IC)                                   00027**1
*                                                                       00028**1
         DFHMDF POS=(03,19),                                           X00029**1
               LENGTH=001,                                             X00030**1
               ATTRB=(ASKIP)                                            00031**1
*                                                                       00032**1
         DFHMDF POS=(04,01),                                           X00033**2
               LENGTH=008,                                             X00034**2
               ATTRB=(ASKIP,NORM),                                     X00035**2
               INITIAL='REC SEQ:'                                       00036**2
*                                                                       00037**2
ARECNBR  DFHMDF POS=(04,10),                                           X00038**2
               LENGTH=003,                                             X00039**2
               ATTRB=(UNPROT,NORM)                                      00040**3
*                                                                       00041**2
         DFHMDF POS=(04,14),                                           X00042**2
               LENGTH=001,                                             X00043**2
               ATTRB=(ASKIP)                                            00044**2
*                                                                       00045**2
         DFHMDF POS=(05,01),                                           X00046**1
               LENGTH=008,                                             X00047**1
               ATTRB=(ASKIP,NORM),                                     X00048**1
               INITIAL='LINE NO:'                                       00049**1
*                                                                       00050**1
ALINENO  DFHMDF POS=(05,10),                                           X00051**1
               LENGTH=004,                                             X00052**1
               ATTRB=(UNPROT,NORM)                                      00053**1
*                                                                       00054**1
         DFHMDF POS=(05,15),                                           X00055**1
               LENGTH=001,                                             X00056**1
               ATTRB=(ASKIP)                                            00057**1
*                                                                       00058**1
AMSGLN1  DFHMDF POS=(07,01),                                           X00059**1
               LENGTH=019,                                             X00060**1
               ATTRB=(ASKIP,NORM)                                       00061**1
*                                                                       00062**1
AMSGLN2  DFHMDF POS=(08,01),                                           X00063**1
               LENGTH=019,                                             X00064**1
               ATTRB=(ASKIP,NORM)                                       00065**1
*                                                                       00066**1
         DFHMSD TYPE=FINAL                                              00067**1
         END                                                            00068**1
