*                                                                       00011   
* LINE 1 MUST NOT EVER BE CHANGED!  THE SYMBOL RF GUNS ARE LOOKING      00011   
* FOR THAT EXACT TEXT.                                                  00011   
*                                                                       00011   
*                                                                       00011   
        PRINT NOGEN                                                     00005   
MPKM027  DFHMSD TYPE=MAP,                                              X00006   
               LANG=COBOL,                                             X00007   
               MODE=INOUT,                                             X00008   
               TIOAPFX=YES,                                            X00009   
               CTRL=FREEKB                                              00010   
*                                                                       00011   
MP027A   DFHMDI SIZE=(08,20),                                          X00012   
               LINE=1,                                                 X00013   
               COLUMN=1                                                 00014   
*                                                                       00015   
         DFHMDF POS=(01,01),                                           X00016   
               LENGTH=018,                                             X00017**2
               ATTRB=(ASKIP,NORM),                                     X00018   
               INITIAL='DC RF APPLICATIONS'                             00019**2
*                                                                       00025   
         DFHMDF POS=(02,01),                                           X00021   
               LENGTH=012,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               INITIAL='MENU OPTIONS'                                   00024   
ADC      DFHMDF POS=(02,15),                                           X00021   
               LENGTH=004,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               PICOUT='9999'                                                    
*                                                                       00025   
         DFHMDF POS=(03,01),                                           X00026   
               LENGTH=015,                                             X00027**2
               ATTRB=(ASKIP,NORM),                                     X00028   
               INITIAL='1. UPC   5.    '                                00029**2
*                                                                       00030   
         DFHMDF POS=(04,01),                                           X00031   
               LENGTH=018,                                             X00032**2
               ATTRB=(ASKIP,NORM),                                     X00033   
               INITIAL='2. QC    6. UCC128'                             00034**2
*                                                                       00035   
         DFHMDF POS=(05,01),                                           X00036   
               LENGTH=018,                                             X00037**2
               ATTRB=(ASKIP,NORM),                                     X00038   
               INITIAL='3. MNFST 7. SHIP  '                             00039**2
*                                                                       00040   
         DFHMDF POS=(06,01),                                           X00041   
               LENGTH=019,                                             X00042**2
               ATTRB=(ASKIP,NORM),                                     X00043   
               INITIAL='4. LABOR 8. PLOCATE'                            00044**2
*                                                                       00045   
         DFHMDF POS=(07,01),                                           X00046   
               LENGTH=009,                                             X00047   
               ATTRB=(ASKIP,NORM),                                     X00048   
               INITIAL='SELECTION'                                      00049   
*                                                                       00050   
ASELECT  DFHMDF POS=(07,11),                                           X00051   
               LENGTH=001,                                             X00052   
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00054   
         DFHMDF POS=(07,13),                                           X00055   
               LENGTH=001,                                             X00056   
               ATTRB=(ASKIP)                                            00057   
*                                                                       00058   
AMSGLN   DFHMDF POS=(08,01),                                           X00059   
               LENGTH=019,                                             X00060   
               ATTRB=(ASKIP,NORM)                                       00061   
*                                                                       00062   
         DFHMSD TYPE=FINAL                                              00063   
         END                                                            00064   
