000100***************************************************************** 00010001
000200*    COPYBOOK NAME:  MPRD052                                    * 00020003
000300*    RECORD PURPOSE: THIS RECORD LAYOUT IS USED TO ACCUMULATE   * 00030001
000400*                    DAILY STORE EXTRACT RECEIPT DATA TOTALS.   * 00040002
000500*    RECORD LENGTH:  080                                        * 00050002
000600*    RECORD FORMAT:  SEQUENTIAL                                 * 00060001
000700***************************************************************** 00070001
000800 01  MP052-RECEIPT-TOTAL-RECORD.                                  00080003
000900     05  MP052-OUT1-MM       PIC 99.                              00090003
001000     05  FILLER              PIC X(01)       VALUE '/'.           00100001
001100     05  MP052-OUT1-DD       PIC 99.                              00110003
001200     05  FILLER              PIC X(01)       VALUE '/'.           00120001
001300     05  MP052-OUT1-YY       PIC 99.                              00130003
001400     05  FILLER              PIC X(01)       VALUE SPACE.         00140001
001500     05  MP052-OUT1-HOURS    PIC 99.                              00150003
001600     05  FILLER              PIC X(01)       VALUE '.'.           00160001
001700     05  MP052-OUT1-MINUTES  PIC 99.                              00170003
001800     05  FILLER              PIC X(01)       VALUE SPACE.         00180001
001900     05  MP052-OUT1-RCVR-TOT PIC S9(07)      COMP-3.              00190003
002000     05  FILLER              PIC X(01)       VALUE SPACE.         00200001
002100     05  MP052-OUT1-MARKED-TOT PIC S9(09)    COMP-3.              00210003
002200     05  FILLER              PIC X(01)       VALUE SPACE.         00220001
002300     05  MP052-OUT1-COST-TOT PIC S9(09)V99   COMP-3.              00230003
002400     05  FILLER              PIC X(01)       VALUE SPACE.         00240001
002500     05  MP052-OUT1-RET-TOT  PIC S9(09)V99   COMP-3.              00250003
002600     05  FILLER              PIC X(41)       VALUE SPACES.        00260001
