00001  01  MP051O-CERTIFICATN-REQ-RECORD.                               09/29/95
00002      05  MP051O-OPER-UNT-ID          PIC  9(04)    VALUE ZEROES.  MPRD051 
00003      05  MP051O-MDSE-PRC-AREA-CDE    PIC  X(04)    VALUE SPACES.     LV005
00004      05  MP051O-MDSE-LNE-ITM-NBR     PIC  9(15)    VALUE ZERO.       CL**2
00005                                                                      CL**2
00006      05  MP051O-ACT-CDE              PIC  X(02)    VALUE SPACES.  MPRD051 
00007      05  MP051O-PO-NBR               PIC  9(09)    VALUE ZERO.       CL**2
00008      05  MP051O-PO-LNE-NBR           PIC  9(09)    VALUE ZERO.       CL**2
00009      05  MP051O-REC-SEQ-NBR          PIC  9(09)    VALUE ZERO.       CL**3
00010      05  MP051O-ENT-NAME-DESC        PIC  X(30)    VALUE SPACES.  MPRD051 
00011      05  MP051O-UPC-NBR              PIC  9(15)    VALUE ZERO.       CL**2
00013      05  MP051O-MERCH-DEPT-NMBR      PIC  X(03)    VALUE SPACES.  MPRD051 
00014      05  MP051O-MERCH-CLASS-NMBR     PIC  X(02)    VALUE SPACES.  MPRD051 
00015      05  FILLER                      PIC  X(03)    VALUE SPACES.  MPRD051 
00016      05  MP051O-CERT-IND             PIC  X(01)    VALUE SPACES.  MPRD051 
00017      05  MP051O-REQ-FOR-CERT-CDE     PIC  X(01)    VALUE SPACES.  MPRD051 
00018      05  MP051O-PACK-BY-ST-IND       PIC  X(01)    VALUE SPACES.  MPRD051 
00019      05  MP051O-REC-TMST             PIC  X(08)    VALUE SPACES.     CL**5
00015      05  MP051O-SKU-NMBR             PIC  X(08)    VALUE SPACES.  MPRD051 
00020      05  FILLER                      PIC  X(21)    VALUE SPACES.     CL**5
