00001 *                                                                 09/01/89
00002 * THIS IS THE RECORD LAYOUT FOR THE DEPARTMENT RELATIONSHIP       MPRD013I
00003 * REPORT FILE.  THE RECORD LENGTH IS 87 BYTES.                       LV004
00004 *                                                                    CL**2
00005  01  MP013I-DEPT-RELATIONAL-RECORD.                                  CL**3
00006      05  MP013I-SORT-KEY-MPS-RPT.                                    CL**3
00007          10  MP013I-SRT-RPT-CNTL         PIC  X(01)  VALUE SPACE.    CL**3
00008              88  MP013I-RPT-01-MPS-SEQ               VALUE '1'.      CL**3
00009              88  MP013I-RPT-02-DMM-SEQ               VALUE '2'.      CL**3
00010              88  MP013I-RPT-03-DEPT-SEQ              VALUE '3'.      CL**3
00011          10  MP013I-DIV-NMBR-RPT01                                   CL**3
00012                                          PIC  X(01)  VALUE SPACE.    CL**2
00013          10  MP013I-MPS-DIV-NMBR-RPT01   PIC  X(05)  VALUE SPACE.    CL**3
00014          10  MP013I-DMM-NMBR-RPT01       PIC  X(02)  VALUE SPACE.    CL**3
00015          10  MP013I-BYR-NMBR-RPT01       PIC  X(02)  VALUE SPACE.    CL**3
00016          10  MP013I-DEPT-NMBR-RPT01      PIC  X(03)  VALUE SPACE.    CL**3
00017      05  MP013I-SORT-KEY-DMM-RPT REDEFINES                           CL**3
00018                MP013I-SORT-KEY-MPS-RPT.                              CL**3
00019          10  MP013I-RPT-CTL-RPT02        PIC  X(01).                 CL**3
00020          10  MP013I-DIV-NMBR-RPT02       PIC  X(01).                 CL**3
00021          10  MP013I-DMM-NMBR-RPT02       PIC  X(02).                 CL**3
00022          10  MP013I-MPS-DIV-NMBR-RPT02   PIC  X(05).                 CL**3
00023          10  MP013I-BYR-NMBR-RPT02       PIC  X(02).                 CL**3
00024          10  MP013I-DEPT-NMBR-RPT02      PIC  X(03).                 CL**3
00025      05  MP013I-SORT-KEY-DEPT-RPT REDEFINES                          CL**3
00026                MP013I-SORT-KEY-MPS-RPT.                              CL**3
00027          10  MP013I-RPT-CTL-RPT03        PIC  X(01).                 CL**3
00028          10  MP013I-DEPT-NMBR-RPT03      PIC  X(03).                 CL**3
00029          10  MP013I-BYR-NMBR-RPT03       PIC  X(02).                 CL**3
00030          10  MP013I-MPS-DIV-NMBR-RPT03   PIC  X(05).                 CL**3
00031          10  MP013I-DMM-NMBR-RPT03       PIC  X(02).                 CL**3
00032          10  MP013I-DIV-NMBR-RPT03       PIC  X(01).                 CL**3
00033      05  MP013I-DEPT-EXTRACT-DATA.                                   CL**3
00034          10  MP013I-DMM-NMBR             PIC  X(02)  VALUE SPACE.    CL**3
00035          10  MP013I-MPS-DIV-NMBR         PIC  X(05)  VALUE SPACE.    CL**3
00036          10  MP013I-DMM-NAME             PIC  X(20)  VALUE SPACE.    CL**3
00037          10  MP013I-BYR-NMBR             PIC  X(02)  VALUE SPACE.    CL**3
00038          10  MP013I-BYR-NAME             PIC  X(20)  VALUE SPACE.    CL**3
00039          10  MP013I-DEPT-NMBR            PIC  X(03)  VALUE SPACE.    CL**3
00040          10  MP013I-DEPT-DESC            PIC  X(20)  VALUE SPACE.    CL**3
00041          10  MP013I-DIV-NMBR             PIC  X(01)  VALUE SPACE.    CL**3
