00001 ******************************************************************10/21/94
00002 *  MPRD004  - LENGTH - 80 BYTES                                   MPRD004 
00003 *                                                                    LV005
00004 *  THIS IS THE LAYOUT USED FOR THE NETWORK SENDER AND RECEIVER       CL**2
00005 *  STATUS REPORTS.  THE GENERAL ELECTRIC REPORTS ARE PULLED DOWN     CL**2
00006 *  AS FILES USING THIS FORMAT.  THE SEARS REPORTS ARE PULLED DOWN    CL**2
00007 *  AS REPORTS, BUT ARE THEN CONVERTED OVER TO THE G.E. FORMAT SO     CL**2
00008 *  THEY CAN BE USED BY THIS LAYOUT.                                  CL**2
00009 *                                                                 MPRD004 
00010 *  AN EXPLANATION OF THIS LAYOUT CAN BE FOUND IN THE EDI EXPRESS  MPRD004 
00011 *  SYSTEM USER MANUAL.                                            MPRD004 
00012 ******************************************************************MPRD004 
00013  01  MP004-SEND-RECV-STATUS-RECORD.                                  CL**2
00014      05  MP004-INTERCHANGE-START.                                    CL**2
00015          10  MP004-GES-SEGMENT-ID          PIC X(03).                CL**2
00016              88  MP004-GES-SEGMENT                    VALUE 'GES'.   CL**2
00017          10  MP004-FORMAT-NAME             PIC X(04).                CL**2
00018          10  MP004-FORMAT-VERSION          PIC X(05).                CL**2
00019          10  MP004-SENDER-QUALIFIER        PIC X(02).                CL**2
00020          10  MP004-SENDER-ID               PIC X(15).                CL**2
00021          10  MP004-RECEIVER-QUALIFIER      PIC X(02).                CL**2
00022          10  MP004-RECEIVER-ID             PIC X(15).                CL**2
00023          10  MP004-SEND-DATE.                                        CL**2
00024              15  MP004-SEND-YY             PIC 9(02).                CL**2
00025              15  MP004-SEND-MM             PIC 9(02).                CL**2
00026              15  MP004-SEND-DD             PIC 9(02).                CL**2
00027          10  MP004-SEND-TIME.                                        CL**2
00028              15  MP004-SEND-HR             PIC 9(02).                CL**2
00029              15  MP004-SEND-MN             PIC 9(02).                CL**2
00030          10  MP004-REPORT-TYPE             PIC X(01).                CL**2
00031              88  MP004-RECEIVER-STATUS-RPT            VALUE 'R'.     CL**2
00032              88  MP004-SENDER-STATUS-RPT              VALUE 'S'.     CL**2
00033              88  MP004-UNRETRIEVE-DOC-RPT             VALUE 'U'.     CL**2
00034              88  MP004-RECEIVER-COMPLY-ERR-RPT        VALUE 'C'.     CL**2
00035              88  MP004-SENDER-ERROR-RPT               VALUE 'E'.     CL**2
00036              88  MP004-SENDER-RETRIEVE-DOC-RPT        VALUE 'T'.     CL**2
00037              88  MP004-SENDER-SUMMARY-RPT             VALUE 'A'.     CL**2
00038          10  MP004-RPT-REQUEST-DATE.                                 CL**2
00039              15  MP004-REQUEST-MM          PIC 9(02).                CL**2
00040              15  MP004-REQUEST-DD          PIC 9(02).                CL**2
00041          10  MP004-RPT-REQUEST-TIME.                                 CL**2
00042              15  MP004-REQUEST-HR          PIC 9(02).                CL**2
00043              15  MP004-REQUEST-MN          PIC 9(02).                CL**2
00044          10  MP004-TIME-INDICATOR          PIC X(03).                CL**2
00045          10  FILLER                        PIC X(12).             MPRD004 
00046      05  MP004-TRANSMITTED-IC REDEFINES                              CL**2
00047                                MP004-INTERCHANGE-START.              CL**2
00048          10  MP004-TIA-SEGMENT-ID          PIC X(03).                CL**2
00049              88  MP004-TIA-SEGMENT                    VALUE 'TIA'.   CL**2
00050          10  FILLER                        PIC X(01).             MPRD004 
00051          10  MP004-SENDER-ADDRESS          PIC X(60).                CL**2
00052          10  FILLER                        PIC X(16).             MPRD004 
00053      05  MP004-IC-CONTINUE-1 REDEFINES                               CL**2
00054                               MP004-INTERCHANGE-START.               CL**2
00055          10  MP004-TIB-SEGMENT-ID          PIC X(03).                CL**2
00056              88  MP004-TIB-SEGMENT                    VALUE 'TIB'.   CL**2
00057          10  MP004-RECEIVER-ADDRESS        PIC X(60).                CL**2
00058          10  FILLER                        PIC X(17).             MPRD004 
00059      05  MP004-IC-CONTINUE-2 REDEFINES                               CL**2
00060                               MP004-INTERCHANGE-START.               CL**2
00061          10  MP004-TIC-SEGMENT-ID          PIC X(03).                CL**2
00062              88  MP004-TIC-SEGMENT                    VALUE 'TIC'.   CL**2
00063          10  MP004-IC-CONTROL-NUM          PIC X(09).                CL**5
00064          10  FILLER                        PIC X(05).                CL**5
00065          10  MP004-IC-CONTROL-DATE.                                  CL**2
00066              15  MP004-IC-CONTROL-YY       PIC 9(02).                CL**2
00067              15  MP004-IC-CONTROL-MM       PIC 9(02).                CL**2
00068              15  MP004-IC-CONTROL-DD       PIC 9(02).                CL**2
00069          10  MP004-IC-CONTROL-TIME.                                  CL**2
00070              15  MP004-IC-CONTROL-HR       PIC 9(02).                CL**2
00071              15  MP004-IC-CONTROL-MN       PIC 9(02).                CL**2
00072              15  MP004-IC-CONTROL-SC       PIC 9(02).                CL**2
00073          10  FILLER                        PIC X(51).             MPRD004 
00074      05  MP004-TIMESTAMPS REDEFINES                                  CL**2
00075                            MP004-INTERCHANGE-START.                  CL**2
00076          10  MP004-TIM-SEGMENT-ID          PIC X(03).                CL**2
00077              88  MP004-TIM-SEGMENT                    VALUE 'TIM'.   CL**2
00078          10  MP004-TIMESTAMP-ENTRIES OCCURS 5 TIMES.                 CL**2
00079              15  MP004-TIMESTAMP-CODE      PIC X(03).                CL**2
00080              15  MP004-TIMESTAMP-DATE.                               CL**2
00081                  20  MP004-TIMESTAMP-YY    PIC 9(02).                CL**2
00082                  20  MP004-TIMESTAMP-MM    PIC 9(02).                CL**2
00083                  20  MP004-TIMESTAMP-DD    PIC 9(02).                CL**2
00084              15  MP004-TIMESTAMP-TIME.                               CL**2
00085                  20  MP004-TIMESTAMP-HR    PIC 9(02).                CL**2
00086                  20  MP004-TIMESTAMP-MN    PIC 9(02).                CL**2
00087                  20  MP004-TIMESTAMP-SC    PIC 9(02).                CL**2
00088          10  FILLER                        PIC X(02).             MPRD004 
00089      05  MP004-TRANSMITTED-GROUP REDEFINES                           CL**2
00090                                   MP004-INTERCHANGE-START.           CL**2
00091          10  MP004-TGS-SEGMENT-ID          PIC X(03).                CL**2
00092              88  MP004-TGS-SEGMENT                    VALUE 'TGS'.   CL**2
00093          10  MP004-GROUP-CONTROL-NUM       PIC X(14).                CL**2
00094          10  MP004-GROUP-CONTROL-DATE.                               CL**2
00095              15  MP004-GROUP-CONTROL-YY    PIC 9(02).                CL**2
00096              15  MP004-GROUP-CONTROL-MM    PIC 9(02).                CL**2
00097              15  MP004-GROUP-CONTROL-DD    PIC 9(02).                CL**2
00098          10  MP004-GROUP-CONTROL-TIME.                               CL**2
00099              15  MP004-GROUP-CONTROL-HR    PIC 9(02).                CL**2
00100              15  MP004-GROUP-CONTROL-MN    PIC 9(02).                CL**2
00101              15  MP004-GROUP-CONTROL-SC    PIC 9(02).                CL**2
00102          10  FILLER                        PIC X(51).             MPRD004 
00103      05  MP004-TRANSMITTED-DOCUMENT REDEFINES                        CL**2
00104                                      MP004-INTERCHANGE-START.        CL**2
00105          10  MP004-TDS-SEGMENT-ID          PIC X(03).                CL**2
00106              88  MP004-TDS-SEGMENT                    VALUE 'TDS'.   CL**2
00107          10  MP004-DOCUMENT-CONTROL-NUM    PIC X(14).                CL**2
00108          10  MP004-DOCUMENT-NUM            PIC X(22).                CL**2
00109          10  MP004-DOCUMENT-TYPE           PIC X(3).                 CL**2
00110          10  MP004-RECEIPT-DATE.                                     CL**2
00111              15  MP004-RECEIPT-YY          PIC 9(02).                CL**2
00112              15  MP004-RECEIPT-MM          PIC 9(02).                CL**2
00113              15  MP004-RECEIPT-DD          PIC 9(02).                CL**2
00114          10  MP004-RECEIPT-TIME.                                     CL**2
00115              15  MP004-RECEIPT-HR          PIC 9(02).                CL**2
00116              15  MP004-RECEIPT-MN          PIC 9(02).                CL**2
00117              15  MP004-RECEIPT-SC          PIC 9(02).                CL**2
00118          10  MP004-MAILBOX-DATE.                                     CL**2
00119              15  MP004-MAILBOX-YY          PIC 9(02).                CL**2
00120              15  MP004-MAILBOX-MM          PIC 9(02).                CL**2
00121              15  MP004-MAILBOX-DD          PIC 9(02).                CL**2
00122          10  MP004-MAILBOX-TIME.                                     CL**2
00123              15  MP004-MAILBOX-HR          PIC 9(02).                CL**2
00124              15  MP004-MAILBOX-MN          PIC 9(02).                CL**2
00125              15  MP004-MAILBOX-SC          PIC 9(02).                CL**2
00126          10  MP004-RECEIVER-PICKUP-DATE.                             CL**2
00127              15  MP004-RECEIVER-PICKUP-YY PIC 9(02).                 CL**2
00128              15  MP004-RECEIVER-PICKUP-MM PIC 9(02).                 CL**2
00129              15  MP004-RECEIVER-PICKUP-DD PIC 9(02).                 CL**2
00130          10  MP004-RECEIVER-PICKUP-DATE-CH REDEFINES                 CL**4
00131               MP004-RECEIVER-PICKUP-DATE  PIC X(06).                 CL**3
00132          10  MP004-RECEIVER-PICKUP-TIME.                             CL**2
00133              15  MP004-RECEIVER-PICKUP-HR PIC 9(02).                 CL**2
00134              15  MP004-RECEIVER-PICKUP-MN PIC 9(02).                 CL**2
00135              15  MP004-RECEIVER-PICKUP-SC PIC 9(02).                 CL**2
00136          10  MP004-RECEIVER-PICKUP-TIME-CH REDEFINES                 CL**4
00137               MP004-RECEIVER-PICKUP-TIME  PIC X(06).                 CL**3
00138          10  MP004-REJECT-FLAG             PIC X(01).                CL**2
00139              88  MP004-REJECTED                       VALUE 'R'.     CL**2
00140          10  MP004-DOCUMENT-ERROR-FLAG     PIC X(01).                CL**2
00141              88  MP004-DOCUMENT-IN-ERROR              VALUE 'Y'.     CL**2
00142      05  MP004-DOCUMENT-ERROR REDEFINES                              CL**2
00143                                MP004-INTERCHANGE-START.              CL**2
00144          10  MP004-DER-SEGMENT-ID          PIC X(03).                CL**2
00145              88  MP004-DER-SEGMENT                    VALUE 'DER'.   CL**2
00146          10  MP004-ERROR-CODE-1            PIC X(03).                CL**2
00147          10  MP004-ERROR-SEGMENT-1         PIC X(03).                CL**2
00148          10  MP004-ERROR-FIELD-1           PIC X(03).                CL**2
00149          10  MP004-ERROR-MESSAGE-1         PIC X(21).                CL**2
00150          10  MP004-TARGET-SOURCE-FLAG-1    PIC X(01).                CL**2
00151              88  MP004-TARGET-1                        VALUE 'T'.    CL**2
00152              88  MP004-SOURCE-1                        VALUE 'S'.    CL**2
00153          10  MP004-ERROR-CODE-2            PIC X(03).                CL**2
00154          10  MP004-ERROR-SEGMENT-2         PIC X(05).                CL**2
00155          10  MP004-ERROR-FIELD-2           PIC X(05).                CL**2
00156          10  MP004-ERROR-MESSAGE-2         PIC X(21).                CL**2
00157          10  MP004-TARGET-SOURCE-FLAG-2    PIC X(01).                CL**2
00158              88  MP004-TARGET-2                        VALUE 'T'.    CL**2
00159              88  MP004-SOURCE-2                        VALUE 'S'.    CL**2
00160          10  FILLER                        PIC X(11).             MPRD004 
00161      05  MP004-INTERCHANGE-END REDEFINES                             CL**2
00162                                 MP004-INTERCHANGE-START.             CL**2
00163          10  MP004-GEE-SEGMENT-ID          PIC X(03).                CL**2
00164              88  MP004-GEE-SEGMENT                    VALUE 'GEE'.   CL**2
00165          10  MP004-SEGMENT-COUNT           PIC 9(06).                CL**2
00166          10  MP004-IC-CONTROL-NUM-END      PIC X(09).                CL**2
00167          10  FILLER                        PIC X(62).             MPRD004 
