00001 *----------------------------------------------------------------*03/09/90
00002 *      EDI INTERCHANGE SEPARATOR AND SEGMENT TERMINATOR TABLE    *MPWS023I
00003 *                                                                *   LV004
00004 *       CREATE DATE:  03/08/90      CREATED BY:  LMC             *MPWS023I
00005 *       MODIFY DATE:               MODIFIED BY:                  *MPWS023I
00006 *----------------------------------------------------------------*MPWS023I
00007 *                                                                 MPWS023I
00008  01  MP023I-SEPARATOR-TABLE.                                      MPWS023I
00009      05  MP023I-TABLE-DATA.                                       MPWS023I
00010          10  FILLER                  PIC  X(07)  VALUE            MPWS023I
00011              '2F YNN'.                                              CL**2
00012          10  FILLER                  PIC  X(07)  VALUE               CL**2
00013              '5C**YNN'.                                              CL**2
00014          10  FILLER                  PIC  X(07)  VALUE            MPWS023I
00015              '6E>>NYN'.                                           MPWS023I
00016          10  FILLER                  PIC  X(07)  VALUE            MPWS023I
00017              '15
 NNY'.                                           MPWS023I
JF0204         10  FILLER                  PIC  X(07)  VALUE            MPWS023I
JF0204             'A1~~NNY'.                                           MPWS023I
JF0204         10  FILLER                  PIC  X(07)  VALUE            MPWS023I
JF0204             '7A::NYN'.                                           MPWS023I
00018      05  MP023I-TABLE                REDEFINES MP023I-TABLE-DATA. MPWS023I
JF0204         10  MP023I-TABLE-ENTRY      OCCURS 6 TIMES                  CL**4
00020                                      INDEXED BY MP023I-IDX.       MPWS023I
00021              15  MP023I-HEX          PIC  X(02).                  MPWS023I
00022              15  MP023I-DECIMAL      PIC  X(01).                  MPWS023I
00023              15  MP023I-PRINT        PIC  X(01).                  MPWS023I
00024              15  MP023I-DATA-ELEM-SEP-FLAG                        MPWS023I
00025                                      PIC  X(01).                  MPWS023I
00026                  88  MP023I-INVALID-DATA-ELEM-SEP  VALUE 'N'.     MPWS023I
00027                  88  MP023I-VALID-DATA-ELEM-SEP    VALUE 'Y'.     MPWS023I
00028              15  MP023I-SUB-ELEM-SEP-FLAG                         MPWS023I
00029                                      PIC  X(01).                  MPWS023I
00030                  88  MP023I-INVALID-SUB-ELEM-SEP   VALUE 'N'.     MPWS023I
00031                  88  MP023I-VALID-SUB-ELEM-SEP     VALUE 'Y'.     MPWS023I
00032              15  MP023I-SEG-TERM-FLAG                             MPWS023I
00033                                      PIC  X(01).                  MPWS023I
00034                  88  MP023I-INVALID-SEG-TERM       VALUE 'N'.     MPWS023I
00035                  88  MP023I-VALID-SEG-TERM         VALUE 'Y'.     MPWS023I
JF0204     05  MP023I-OCCURS               PIC  9(02)    VALUE 6.          CL**4
