000100 01  MP026-COMMAREA.                                                      
000200     05  MP026-COMMON-DATA.                                               
000300         10  MP026-TRANSACTION-STATUS                                     
000400                                         PIC  X(01)  VALUE SPACE.         
000500             88  MP026-INITIALIZE-SCREEN             VALUE 'S'.           
000600             88  MP026-PROCESS-SCREEN                VALUE 'R'.           
000700         10  MP026-LAST-PROGRAM          PIC  X(08)  VALUE SPACE.         
000800     05  MP026-PROGRAM-DATA.                                              
000900         10  MP026-SELECTION-X           PIC  X(01)  VALUE SPACE.         
001000             88  MP026-SELECTION-TEST                VALUE 'T'.           
001100         10  MP026-SELECTION REDEFINES MP026-SELECTION-X                  
001200                                         PIC  9(01).                      
001300             88  MP026-VALID-SELECTION               VALUE                
001400                 1 2 3 4   6 7 8.                                         
001500             88  MP026-SELECTION-ONE                 VALUE 1.             
001600             88  MP026-SELECTION-TWO                 VALUE 2.             
001700             88  MP026-SELECTION-THREE               VALUE 3.             
001800             88  MP026-SELECTION-FOUR                VALUE 4.             
002000             88  MP026-SELECTION-SIX                 VALUE 6.             
002010             88  MP026-SELECTION-SEVEN               VALUE 7.             
                   88  MP026-SELECTION-EIGHT               VALUE 8.             
002200         10  MP026-OPER-UNIT-ID       PIC S9(04) COMP                     
002300                                                 VALUE ZERO.              
002200         10  MP026-USERID             PIC X(08).                          
