00001 ***************************************************************** 09/13/95
00002 *            SYSTEM  RECORD DEFINITION                            MRRD002I
00003 *****************************************************************    LV001
00004 * 06/21/91 - APAR PN01043 - EDIT UCYCLE VALUES                  * MRRD002I
00005 ***************************************************************** MRRD002I
00006      02  S-KEY.                                                   MRRD002I
00007          03  S-SYS-ID            PIC XX.                          MRRD002I
00008          03  S-RCD-TYPE          PIC X(3).                        MRRD002I
00009          03  S-RCD-ID            PIC X(16).                       MRRD002I
00010      02  S-AUDIT.                                                 MRRD002I
00011          03  S-REL-NO            PIC S9V9      COMP-3.            MRRD002I
00012          03  S-VERS-NO           PIC S999      COMP-3.            MRRD002I
00013          03  S-UPDATE-FLAG       PIC X.                           MRRD002I
00014          03  S-USER-ID           PIC X(8).                        MRRD002I
00015          03  S-CRT-DATE          PIC X(8).                        MRRD002I
00016          03  S-EFF-DATE          PIC X(8).                        MRRD002I
00017          03  S-EXP-DATE          PIC X(8).                        MRRD002I
00018          03  S-MOD-DATE          PIC X(8).                        MRRD002I
00019          03  S-RUN-DATE          PIC X(8).                        MRRD002I
00020          03  S-RUN-NO            PIC S9.                          MRRD002I
00021      02  S-RUN-PARAMETERS.                                        MRRD002I
00022          03  S-RUN-MODE          PIC X.                           MRRD002I
00023          03  S-RUN-COMP.                                          MRRD002I
00024              05  S-RUN-TYPE      PIC S9.                          MRRD002I
00025              05  S-TNOW-WN       PIC S99       COMP-3.            MRRD002I
00026              05  S-TNOW-DN       PIC S9        COMP-3.            MRRD002I
00027              05  S-UPDATE-CYCLES OCCURS 6 TIMES.                  MRRD002I
00028                  06  S-BPN       PIC S99       COMP-3.            MRRD002I
00029                  06  S-DDRUNSW   PIC X.                           MRRD002I
00030                  06  S-UCYCLE    PIC S9        COMP-3.            MRRD002I
00031                  06  S-UCYCLEX   REDEFINES  S-UCYCLE              MRRD002I
00032                                  PIC X.                           MRRD002I
00033                  06  S-DDU-WKS   PIC S99       COMP-3.            MRRD002I
00034                  06  S-DDU-MOS   PIC S99       COMP-3.            MRRD002I
00035      02  S-RUN-STDS.                                              MRRD002I
00036          03  S-CAL-TYPE          PIC X.                           MRRD002I
00037          03  S-BUYER-REPORT      PIC X.                           MRRD002I
00038          03  S-AUX-FILE          PIC X.                           MRRD002I
00039          03  S-SIM-FILE          PIC X.                           MRRD002I
00040          03  S-DDU-RERUN         PIC X.                           MRRD002I
00041          03  S-PL1-DUMP          PIC X.                           MRRD002I
00042          03  S-BPN-SOURCE        PIC X.                           MRRD002I
00043          03  S-DDU-SOURCE        PIC X.                           MRRD002I
00044          03  S-UCYCLE-SOURCE     PIC X.                           MRRD002I
00045          03  S-DDRUNSW-SOURCE    PIC X.                           MRRD002I
00046          03  S-TNOW-SOURCE       PIC X.                           MRRD002I
00047          03  FILLER              PIC X(4).                        MRRD002I
00048      02  S-PLANNING-FCSTS.                                        MRRD002I
00049          03  S-FCSTB-WN          PIC S99       COMP-3.            MRRD002I
00050          03  S-FCSTB-DN          PIC S9        COMP-3.            MRRD002I
00051          03  S-FCSTE-WN          PIC S99       COMP-3.            MRRD002I
00052          03  S-FCSTE-DN          PIC S9        COMP-3.            MRRD002I
00053          03  S-TSUPSW.                                            MRRD002I
00054              05  S-TSUPSW1       PIC X.                           MRRD002I
00055              05  S-TSUPSW2       PIC X.                           MRRD002I
00056              05  S-TSUPSW3       PIC X.                           MRRD002I
00057              05  S-TSUPSW4       PIC X.                           MRRD002I
00058          03  S-FCST-WN           PIC S99       COMP-3.            MRRD002I
00059          03  S-FCST-WKS          PIC S99       COMP-3.            MRRD002I
00060          03  S-FCST-MN           PIC S99       COMP-3.            MRRD002I
00061          03  S-FCST-MOS          PIC S99       COMP-3.            MRRD002I
00062      02  S-DDU-REPORT-CRITERIA.                                   MRRD002I
00063          03  S-TS-NCT            PIC S99       COMP-3.            MRRD002I
00064          03  S-TS-TNT            PIC S99       COMP-3.            MRRD002I
00065          03  S-TS-TEP            PIC S99       COMP-3.            MRRD002I
00066          03  S-DI-NCT            PIC S99       COMP-3.            MRRD002I
00067          03  S-DI-TNT            PIC S99       COMP-3.            MRRD002I
00068          03  S-DI-TEP            PIC S99       COMP-3.            MRRD002I
00069          03  S-DF-NCT            PIC S99       COMP-3.            MRRD002I
00070          03  S-DF-TNT            PIC S99       COMP-3.            MRRD002I
00071          03  S-DF-TEP            PIC S99       COMP-3.            MRRD002I
00072          03  S-DFC-TABLE OCCURS 9 TIMES.                          MRRD002I
00073              05  S-DFC           PIC X.                           MRRD002I
00074      02  S-CONTROL-STDS.                                          MRRD002I
00075          03  S-NAME              PIC X(10).                       MRRD002I
00076          03  S-SIZE-ICSHDR       PIC S999      COMP-3.            MRRD002I
00077          03  S-SIZE-TRINPUT      PIC S9(4)     COMP-3.            MRRD002I
00078          03  S-SIZE-USER-AREA    PIC S9(4)     COMP-3.            MRRD002I
00079          03  S-MAX-ITEM          PIC S9(4)     COMP-3.            MRRD002I
00080          03  S-PLR-TBL           PIC X(60).                       MRRD002I
00081          03  S-PLR-DESC REDEFINES S-PLR-TBL                       MRRD002I
00082                                  PIC X(5)  OCCURS 12 TIMES.       MRRD002I
00083          03  S-HS                PIC X(24).                       MRRD002I
00084          03  S-HIERARCHY REDEFINES S-HS                           MRRD002I
00085                                  PIC 99    OCCURS 12 TIMES.       MRRD002I
00086          03  S-LOG-FILE          PIC X.                           MRRD002I
00087          03  S-ORD-IMPL          PIC X.                           MRRD002I
00088          03  S-EXEC-ENV          PIC X.                           MRRD002I
00089      02  S-HDFLG-TBL             PIC X(80).                       MRRD002I
00090      02  S-HEAD-FLG-TBL REDEFINES S-HDFLG-TBL OCCURS 10 TIMES.    MRRD002I
00091          03  S-HDFLAG            PIC X.                           MRRD002I
00092          03  S-HDFLAG-LBL        PIC X(7).                        MRRD002I
00093      02  FILLER                  PIC X(32).                       MRRD002I
