000100* ****************************************************************11/02/93
000200*             MRRD004O  PROFILE TRANSFER RECORD                  *MRRD004O
000300*             RECORD LENGTH = 2900                                   LV201
000400*                                                                *   CL199
000500*  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX    *   CL199
000600*  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX    *   CL199
000700*  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX    *   CL199
000800*                                                                *   CL199
000900* ****************************************************************   CL199
001000* * * * * * * * *  START OF TRANSFER RECORD   * * * * * * * * * *    CL199
001100        03  MR004O-TR-INPUT-AREA.                                    CL199
001200*****************************************************************    CL199
001300*             OPERATIONAL CONTROLS                              *    CL199
001400*****************************************************************    CL199
001500*                                                                    CL199
001600          04  MR004O-OPERATIONAL-CONTROLS.                           CL199
001700              05  MR004O-IB-MARK    PIC X(16).                       CL199
001800              05  MR004O-IB-SEQNO   PIC 9(4).                        CL199
001900              05  MR004O-TRNBFLAG   PIC X.                           CL199
002000              05  MR004O-DMPBFLAG   PIC X.                           CL199
002100*                                                                    CL199
002200*****************************************************************    CL199
002300*             HIGH LEVEL PRODUCTION RUN CONTROLS                *    CL199
002400*****************************************************************    CL199
002500*                                                                    CL199
002600          04  MR004O-SALES-REVISION-RUNS.                            CL199
002700              05  MR004O-BPN        PIC S99        COMP-3.           CL199
002800              05  MR004O-DDUWKS     PIC S99        COMP-3.           CL199
002900              05  MR004O-DDUMOS     PIC S99        COMP-3.           CL199
003000              05  MR004O-UCYCLE     PIC S9         COMP-3.           CL199
003100              05  MR004O-DDRUNSW    PIC X.                           CL199
003200              05  MR004O-DDRERUN    PIC X.                           CL199
003300*                                                                    CL199
003400          04  MR004O-REPLENISHMENT-RUNS.                             CL199
003500              05  MR004O-TNOW.                                       CL199
003600                 07  MR004O-WN      PIC S99        COMP-3.           CL199
003700                 07  MR004O-DN      PIC S9         COMP-3.           CL199
003800              05  MR004O-FCSTSW     PIC X.                           CL199
003900              05  MR004O-CALT       PIC X.                           CL199
004000*                                                                    CL199
004100*****************************************************************    CL199
004200*             HIGH LEVEL DDU VALUES                             *    CL199
004300*****************************************************************    CL199
004400*                                                                    CL199
004500          04  MR004O-DEMAND-FILTERING.                               CL199
004600              05  MR004O-IDFL       PIC S9         COMP-3.           CL199
004700              05  MR004O-BYPIDFL    PIC X.                           CL199
004800              05  MR004O-CADL       PIC S999       COMP-3.           CL199
004900              05  MR004O-HIDFL      PIC S9         COMP-3.           CL199
005000              05  MR004O-LODFL      PIC S9         COMP-3.           CL199
005100              05  MR004O-NDFL       PIC S9         COMP-3.           CL199
005200              05  MR004O-DDMAP      PIC S9         COMP-3.           CL199
005300*                                                                    CL199
005400          04  MR004O-SMOOTHING-RATE.                                 CL199
005500              05  MR004O-DAMP       PIC SV9        COMP-3.           CL199
005600              05  MR004O-MINSMK     PIC SV9        COMP-3.           CL199
005700              05  MR004O-MAXSMK     PIC SV9        COMP-3.           CL199
005800              05  MR004O-INTSMK     PIC SV9        COMP-3.           CL199
005900*                                                                    CL199
006000          04  MR004O-TRACKING-SIGNAL.                                CL199
006100              05  MR004O-TSL        PIC SV9        COMP-3.           CL199
006200*                                                                    CL199
006300          04  MR004O-BYPASS-DD-UPDATE.                               CL199
006400              05  MR004O-BYPDDU     PIC X.                           CL199
006500              05  MR004O-BYPSCL     PIC S9V99      COMP-3.           CL199
006600              05  MR004O-FRCDDU     PIC X.                           CL199
006700              05  MR004O-BYPZSL     PIC X.                           CL199
006800              05  MR004O-BYPTFP     PIC X.                           CL199
006900              05  MR004O-BYPZOH     PIC X.                           CL199
007000              05  MR004O-BYPBEF     PIC X.                           CL199
007100              05  MR004O-BYPAFT     PIC X.                           CL199
007200              05  MR004O-LUMPSW     PIC X.                           CL199
007300              05  MR004O-MINBI      PIC SV9        COMP-3.           CL199
007400              05  MR004O-DDFTSW     PIC X.                           CL199
007500*                                                                    CL199
007600          04  MR004O-RESTRICT-DD-UPDATE.                             CL199
007700              05  MR004O-HIPCT      PIC X.                           CL199
007800              05  MR004O-LOPCT      PIC X.                           CL199
007900              05  MR004O-MINDD      PIC S9(6)V9    COMP-3.           CL199
008000              05  MR004O-MAXDD      PIC S9(6)V9    COMP-3.           CL199
008100*                                                                    CL199
008200          04  MR004O-FORECAST-ERROR.                                 CL199
008300              05  MR004O-HIMADP     PIC SV9        COMP-3.           CL199
008400              05  MR004O-LOMADP     PIC SV9        COMP-3.           CL199
008500              05  MR004O-MADSMK     PIC X.                           CL199
008600              05  MR004O-MADEXK     PIC SV9        COMP-3.           CL199
008700*                                                                    CL199
008800          04  MR004O-TREND.                                          CL199
008900              05  MR004O-TRNSMK     PIC X.                           CL199
009000              05  MR004O-TT         PIC X.                           CL199
009100*                                                                    CL199
009200          04  MR004O-DYING-ITEM.                                     CL199
009300              05  MR004O-DIDDL      PIC S999       COMP-3.           CL199
009400              05  MR004O-DITRNDL    PIC SV9        COMP-3.           CL199
009500              05  MR004O-DITRPS     PIC S9         COMP-3.           CL199
009600              05  MR004O-DIMADP     PIC SV9        COMP-3.           CL199
009700*                                                                    CL199
009800          04  MR004O-MAD-INITIALIZATION.                             CL199
009900              05  MR004O-MVSTAB     PIC SV9        COMP-3            CL199
010000                                                OCCURS 8 TIMES.      CL199
010100*                                                                    CL199
010200*****************************************************************    CL199
010300*             HIGH LEVEL FEX/RDR VALUES                         *    CL199
010400*****************************************************************    CL199
010500*                                                                    CL199
010600          04  MR004O-HIGH-LEVEL-FEX-RDR.                             CL199
010700              05  MR004O-RT         PIC S999       COMP-3.           CL199
010800              05  MR004O-HITRNDL    PIC S9V99      COMP-3.           CL199
010900              05  MR004O-PLNTT      PIC X.                           CL199
011000              05  MR004O-RTF        PIC SV9        COMP-3.           CL199
011100              05  MR004O-ZOPSW      PIC X.                           CL199
011200              05  MR004O-OUTLSW     PIC X.                           CL199
011300              05  MR004O-ZSSTOCK    PIC X.                           CL199
011400              05  MR004O-PACKSW     PIC X.                           CL199
011500              05  MR004O-DSER       PIC X.                           CL199
011600              05  MR004O-SVCTAB     PIC SV999      COMP-3            CL199
011700                                                OCCURS 6 TIMES.      CL199
011800*                                                                    CL199
011900*****************************************************************    CL199
012000*             PROFILE VALUES                                    *    CL199
012100*****************************************************************    CL199
012200*                                                                    CL199
012300          04  MR004O-REGULAR-PROFILE-VALUES.                         CL199
012400              05  MR004O-PT         PIC X.                           CL199
012500              05  MR004O-PTAG       PIC X(7).                        CL199
012600              05  MR004O-WEEKLY-INDICES.                             CL199
012700                  07  MR004O-WBI    PIC S99V9      COMP-3            CL199
012800                                                OCCURS 52 TIMES.     CL199
012900              05  MR004O-MONTHLY-INDICES.                            CL199
013000                  07  MR004O-MBI    PIC S99V9      COMP-3            CL199
013100                                                OCCURS 13 TIMES.     CL199
013200*                                                                    CL199
013300          04  MR004O-DAILY-SALES-CNTRBUTION.                         CL199
013400              05  MR004O-DPCTSW     PIC X.                           CL199
013500              05  MR004O-DPCTTAG    PIC X(7).                        CL199
013600              05  MR004O-DPCT       PIC S99V9      COMP-3            CL199
013700                                                OCCURS  7 TIMES.     CL199
013800*                                                                    CL199
013900          04  MR004O-END-OF-SEASON-VALUES.                           CL199
014000              05  MR004O-IOPEOS     PIC SV9        COMP-3.           CL199
014100              05  MR004O-LSSEOS     PIC SV9        COMP-3.           CL199
014200              05  MR004O-FEOS-WN    PIC S99        COMP-3.           CL199
014300              05  MR004O-SEOS-WN    PIC S99        COMP-3.           CL199
014400              05  MR004O-LEOS-WN    PIC S99        COMP-3.           CL199
014500              05  MR004O-NEOS-WN    PIC S99        COMP-3.           CL199
014600*                                                                    CL199
014700*****************************************************************    CL199
014800*             PROMOTIONAL SALES                                 *    CL199
014900*****************************************************************    CL199
015000*                                                                    CL199
015100          04  MR004O-PROMOTIONAL-SALES.                              CL199
015200              05  MR004O-PRMSW      PIC X.                           CL199
015300              05  MR004O-PRMTAG     PIC X(7).                        CL199
015400              05  MR004O-PRM-BI.                                     CL199
015500                  07  MR004O-PBI    PIC S9(3)V9    COMP-3            CL199
015600                                                OCCURS 52 TIMES.     CL199
015700                  07  FILLER PIC X(52).                              CL199
015800              05  MR004O-PRM-SALES REDEFINES MR004O-PRM-BI.          CL199
015900                  07  MR004O-PSL    PIC S9(7)      COMP-3            CL199
016000                                                OCCURS 52 TIMES.     CL199
016100              05  MR004O-DDX-FLAGS.                                  CL199
016200                  07  MR004O-DDX        PIC X   OCCURS 52 TIMES.     CL199
016300*                                                                    CL199
016400*****************************************************************    CL199
016500*             FORECASTS                                         *    CL199
016600*****************************************************************    CL199
016700*                                                                    CL199
016800          04  MR004O-PLANNING-FORECASTS.                             CL199
016900              05  MR004O-FCST-WN    PIC S99        COMP-3.           CL199
017000              05  MR004O-FCST-WKS   PIC S99        COMP-3.           CL199
017100              05  MR004O-FCST-MN    PIC S99        COMP-3.           CL199
017200              05  MR004O-FCST-MOS   PIC S99        COMP-3.           CL199
017300              05  MR004O-FCSTB-WN   PIC S99        COMP-3.           CL199
017400              05  MR004O-FCSTB-DN   PIC S9         COMP-3.           CL199
017500              05  MR004O-FCSTE-WN   PIC S99        COMP-3.           CL199
017600              05  MR004O-FCSTE-DN   PIC S9         COMP-3.           CL199
017700*                                                                    CL199
017800          04  MR004O-DAYS-OF-SUPPLY-FRCSTS.                          CL199
017900              05  MR004O-TSUPSW.                                     CL199
018000                  07  MR004O-TSSW1  PIC X.                           CL199
018100                  07  MR004O-TSSW2  PIC X.                           CL199
018200                  07  MR004O-TSSW3  PIC X.                           CL199
018300                  07  MR004O-TSSW4  PIC X.                           CL199
018400              05  MR004O-TSUPQTY    PIC S9(7)      COMP-3.           CL199
018500              05  MR004O-TSUP-WN    PIC S99        COMP-3.           CL199
018600              05  MR004O-TSUP-DN    PIC S9         COMP-3.           CL199
018700*                                                                    CL199
018800*****************************************************************    CL199
018900*             ITEM LEAD TIME VALUES                             *    CL199
019000*****************************************************************    CL199
019100*                                                                    CL199
019200          04  MR004O-ITEM-LEAD-TIME-VALUES.                          CL199
019300              05  MR004O-LT         PIC S999       COMP-3.           CL199
019400              05  MR004O-MADLT      PIC S99V9      COMP-3.           CL199
019500              05  MR004O-LTVADJ     PIC SV9        COMP-3.           CL199
019600              05  MR004O-ALTSW      PIC X.                           CL199
019700              05  MR004O-ALTTAG     PIC X(7).                        CL199
019800              05  MR004O-ALT        PIC S999       COMP-3            CL199
019900                                                OCCURS 13 TIMES.     CL199
020000*                                                                    CL199
020100*****************************************************************    CL199
020200*             ITEM COST VALUES                                  *    CL199
020300*****************************************************************    CL199
020400*                                                                    CL199
020500          04  MR004O-ITEM-COST-VALUES.                               CL199
020600              05  MR004O-ICOST      PIC S9(4)V9(5) COMP-3.           CL199
020700*                                                                    CL199
020800          04  MR004O-BRACKET-COST-VALUES.                            CL199
020900              05  MR004O-BCOSTSW    PIC X.                           CL199
021000              05  MR004O-BRND       PIC S9(7)      COMP-3            CL199
021100                                                OCCURS 10 TIMES.     CL199
021200              05  MR004O-BOQ        PIC S9(7)      COMP-3            CL199
021300                                                OCCURS 10 TIMES.     CL199
021400              05  MR004O-BCOST-TABLE.                                CL199
021500                  07  MR004O-BCOST  PIC S9(4)V9(5) COMP-3            CL199
021600                                                OCCURS 10 TIMES.     CL199
021700*                                                                    CL199
021800*****************************************************************    CL199
021900*             USER PROVIDED ITEM INPUTS                         *    CL199
022000*****************************************************************    CL199
022100*                                                                    CL199
022200          04  MR004O-USER-PROVIDED-ITEMS.                            CL199
022300              05  MR004O-CPS        PIC S9(7)      COMP-3.           CL199
022400              05  MR004O-OH         PIC S9(7)      COMP-3.           CL199
022500              05  MR004O-OO         PIC S9(7)      COMP-3.           CL199
022600              05  MR004O-COMSTK     PIC S9(7)      COMP-3.           CL199
022700              05  MR004O-LOTFACT    PIC S9(5)      COMP-3.           CL199
022800              05  MR004O-SPOQSW     PIC X.                           CL199
022900              05  MR004O-SPOQ       PIC S9(7)      COMP-3.           CL199
023000*                                                                    CL199
023100*****************************************************************    CL199
023200*             POLICY PROVIDED ITEM INPUTS                       *    CL199
023300*****************************************************************    CL199
023400*                                                                    CL199
023500          04  MR004O-POLICY-PROVIDED-ITEMS.                          CL199
023600              05  MR004O-INAME      PIC X(50).                       CL199
023700              05  MR004O-SKU        PIC X(30).                       CL199
023800              05  MR004O-UPC        PIC X(22).                       CL199
023900              05  MR004O-FT         PIC X.                           CL199
024000              05  MR004O-OSTRAT     PIC S999V9     COMP-3.           CL199
024100              05  MR004O-PACKSZ     PIC S9(7)      COMP-3.           CL199
024200              05  MR004O-IMIN       PIC S9(7)      COMP-3.           CL199
024300              05  MR004O-IMAX       PIC S9(7)      COMP-3.           CL199
024400              05  MR004O-CSTOCK     PIC S9(5)      COMP-3.           CL199
024500              05  MR004O-SSADJ      PIC SV9        COMP-3.           CL199
024600              05  MR004O-MINOUTL    PIC S9(7)      COMP-3.           CL199
024700              05  MR004O-MAXOUTL    PIC S9(7)      COMP-3.           CL199
024800              05  MR004O-MAXOQP     PIC S9V99      COMP-3.           CL199
024900              05  MR004O-FOQ        PIC S9(7)      COMP-3.           CL199
025000              05  MR004O-TMIN       PIC S999       COMP-3.           CL199
025100              05  MR004O-USERMIN    PIC S9(7)      COMP-3.           CL199
025200              05  MR004O-USERMAX    PIC S9(7)      COMP-3.           CL199
025300*                                                                    CL199
025400*****************************************************************    CL199
025500*             FULL SYSTEM SIMULATION VALUES                     *    CL199
025600*****************************************************************    CL199
025700*                                                                    CL199
025800          04  MR004O-SIMULATION-VALUES.                              CL199
025900              05  MR004O-MAJBRK     PIC X(10).                       CL199
026000              05  MR004O-INTBRK     PIC X(10).                       CL199
026100              05  MR004O-MINBRK     PIC X(10).                       CL199
026200              05  MR004O-DPLAN      PIC S9(9)      COMP-3.           CL199
026300              05  MR004O-YRPCT      PIC S9V99      COMP-3.           CL199
026400              05  MR004O-SLSTAG     PIC S99        COMP-3.           CL199
026500              05  MR004O-HLTTAG     PIC S99        COMP-3.           CL199
026600              05  MR004O-SVCTAG     PIC S99        COMP-3.           CL199
026700              05  MR004O-UMMTAG     PIC S99        COMP-3.           CL199
026800              05  MR004O-USMSW      PIC X.                           CL199
026900*                                                                    CL199
027000*****************************************************************    CL199
027100*             JOINT ITEM INPUT VALUES                           *    CL199
027200*****************************************************************    CL199
027300*                                                                    CL199
027400          04  MR004O-ITEM-ALLOCATION-VALUES.                         CL199
027500              05  MR004O-FORCSW     PIC X.                           CL199
027600              05  MR004O-SELECTSW   PIC X.                           CL199
027700              05  MR004O-TIERSZ     PIC S9(6)      COMP-3.           CL199
027800              05  MR004O-PALUNITS   PIC S9(6)      COMP-3.           CL199
027900              05  MR004O-BOQRND     PIC X.                           CL199
028000              05  MR004O-TIERSW     PIC X.                           CL199
028100              05  MR004O-COORFLG    PIC X.                           CL199
028200              05  MR004O-ITTSUPL    PIC S999       COMP-3.           CL199
028300              05  MR004O-TTLP       PIC S9         COMP-3.           CL199
028400              05  MR004O-PTLP       PIC S9         COMP-3.           CL199
028500              05  MR004O-CWTFACT    PIC S9(4)V9(7) COMP-3            CL199
028600                                                OCCURS 10 TIMES.     CL199
028700*                                                                    CL199
028800*****************************************************************    CL199
028900*             PUSH DISTRIBUTION VALUES                          *    CL199
029000*****************************************************************    CL199
029100*                                                                    CL199
029200          04  MR004O-PUSH-DSTRBUTION-VALUES.                         CL199
029300              05  MR004O-PUSHSW     PIC X.                           CL199
029400              05  MR004O-PUSHQTY    PIC S9(7)      COMP-3.           CL199
029500              05  MR004O-PUSHRNDH   PIC SV999      COMP-3.           CL199
029600              05  MR004O-PUSHRNDL   PIC SV999      COMP-3.           CL199
029700              05  MR004O-PUSHSCL    PIC S9V9(4)    COMP-3.           CL199
029800              05  MR004O-PUSHPCT    PIC SV9(5)     COMP-3.           CL199
029900              05  MR004O-PUSHMIN    PIC S9(7)      COMP-3.           CL199
030000              05  MR004O-PUSHMAX    PIC S9(7)      COMP-3.           CL199
030100*                                                                    CL199
030200*****************************************************************    CL199
030300*                    POOL VENDOR DATA                           *    CL199
030400*****************************************************************    CL199
030500*                                                                    CL199
030600          04  MR004O-POOL-VENDOR-DATA.                               CL199
030700              05  MR004O-POOLXREF   PIC X(24).                       CL199
030800              05  MR004O-POOLNAME   PIC X(25).                       CL199
030900              05  MR004O-POOLVEND   PIC X(07).                       CL199
031000              05  MR004O-POOLUSER   PIC X(08).                       CL199
031100*                                                                    CL199
031200*****************************************************************    CL199
031300*             DDU RECYCLE VALUES                                *    CL199
031400*****************************************************************    CL199
031500*                                                                    CL199
031600          04  MR004O-INITIAL-DDU-VALUES.                             CL199
031700              05  MR004O-DD         PIC S9(6)V9    COMP-3.           CL199
031800              05  MR004O-DDI        PIC S9(6)V9    COMP-3.           CL199
031900              05  MR004O-LPP        PIC S999       COMP-3.           CL199
032000              05  MR004O-MADSS      PIC S9(6)V9    COMP-3.           CL199
032100              05  MR004O-FWMAD      PIC S9(6)V9    COMP-3.           CL199
032200              05  MR004O-TRNDP      PIC SV9(5)     COMP-3.           CL199
032300              05  MR004O-CUMSLS     PIC S9(7)      COMP-3.           CL199
032400              05  MR004O-CUMPDS     PIC S9(2)      COMP-3.           CL199
032500*                                                                    CL199
032600          04  MR004O-DDU-MAINTAINED-VALUES.                          CL199
032700              05  MR004O-FWM        PIC S9(6)V9    COMP-3            CL199
032800                                                OCCURS  4 TIMES.     CL199
032900              05  MR004O-MSDTS      PIC S9(6)V9    COMP-3.           CL199
033000              05  MR004O-MADTS      PIC S9(6)V9    COMP-3.           CL199
033100              05  MR004O-LTVFACT    PIC S9V99      COMP-3.           CL199
033200              05  MR004O-PCTZ       PIC S9V99      COMP-3.           CL199
033300              05  MR004O-MADSTAT    PIC X.                           CL199
033400              05  MR004O-DFLREG.                                     CL199
033500                  07  MR004O-DREG   PIC X       OCCURS 13 TIMES.     CL199
033600              05  MR004O-TSREG.                                      CL199
033700                  07  MR004O-TREG   PIC X       OCCURS 13 TIMES.     CL199
033800              05  MR004O-DIREG.                                      CL199
033900                  07  MR004O-IREG   PIC X       OCCURS 13 TIMES.     CL199
034000              05  MR004O-BYPREG.                                     CL199
034100                  07  MR004O-BREG   PIC X       OCCURS 13 TIMES.     CL199
034200*                                                                    CL199
034300          04  MR004O-LAST-DDU-RUN-VALUES.                            CL199
034400              05  MR004O-LDD        PIC S9(6)V9    COMP-3.           CL199
034500              05  MR004O-LDDI       PIC S9(6)V9    COMP-3.           CL199
034600              05  MR004O-LMADSS     PIC S9(6)V9    COMP-3.           CL199
034700              05  MR004O-LFWMAD     PIC S9(6)V9    COMP-3.           CL199
034800              05  MR004O-LFWM       PIC S9(6)V9    COMP-3            CL199
034900                                                OCCURS  4 TIMES.     CL199
035000              05  MR004O-LCPS       PIC S9(7)      COMP-3.           CL199
035100*                                                                    CL199
035200*****************************************************************    CL199
035300*             FEX / RDR RECYCLE VALUES                          *    CL199
035400*****************************************************************    CL199
035500*                                                                    CL199
035600          04  MR004O-FEX-RDR-RECYCLE-VALUES.                         CL199
035700              05  MR004O-OUTSTAT    PIC X.                           CL199
035800              05  MR004O-LRTFCST    PIC S9(6)V9    COMP-3.           CL199
035900              05  MR004O-ORDSTAT    PIC X.                           CL199
036000*                                                                    CL199
036100*****************************************************************    CL199
036200*             HISTORY DATA                                      *    CL199
036300*****************************************************************    CL199
036400*                                                                    CL199
036500          04  MR004O-HISTORY-DATA.                                   CL199
036600              05  MR004O-HISTDD     PIC S9(6)V9    COMP-3            CL199
036700                                                OCCURS 13 TIMES.     CL199
036800              05  MR004O-HISTMAD    PIC S9(6)V9    COMP-3            CL199
036900                                                OCCURS 13 TIMES.     CL199
037000              05  MR004O-HISTOH     PIC S9(7)      COMP-3            CL199
037100                                                OCCURS 13 TIMES.     CL199
037200              05  MR004O-HISTCPS    PIC S9(7)      COMP-3            CL199
037300                                                OCCURS 13 TIMES.     CL199
037400              05  MR004O-HISTLYS    PIC S9(7)      COMP-3            CL199
037500                                                OCCURS 17 TIMES.     CL199
037600*****************************************************************    CL199
037700*          TEMPORARY LOCATION FOR NEW TR FIELDS                 *    CL199
037800*****************************************************************    CL199
037900          04  MR004O-NEW-FIELD-TEMP-AREA.                            CL199
038000              05  MR004O-TRNINIT    PIC X(01).                       CL199
038100              05  MR004O-KFT        PIC X(01).                       CL199
038200              05  MR004O-KORDSTAT   PIC X(01).                       CL199
038300              05  MR004O-NEW-HISTORY.                                CL199
038400                  10  MR004O-HISTBPN   PIC S9(02) COMP-3             CL199
038500                                              OCCURS 13 TIMES.       CL199
038600                  10  MR004O-HISTRBI   PIC S99V9  COMP-3             CL199
038700                                              OCCURS 13 TIMES.       CL199
038800                  10  MR004O-HISTNBI   PIC S99V9  COMP-3             CL199
038900                                              OCCURS 13 TIMES.       CL199
039000              05  MR004O-LTNOWWN   PIC S9(02) COMP-3.                CL199
039100*                                                                    CL199
039200*****************************************************************    CL199
039300*             RESERVED INPUT AREA                               *    CL199
039400*****************************************************************    CL199
039500*                                                                    CL199
039600          04  MR004O-RESERVED-STORAGE-IN.                            CL199
039700              05  MR004O-IBIRSVRED  PIC X(234).                      CL199
039800* COMMENT     05  MR004O-UPGRADE14 REDEFINES MR004O-IBIRSVRED.       CL199
039900              05  MR004O-DDUPRM PIC X(01).                           CL199
040000              05  MR004O-CSTKMINT PIC S9V99 COMP-3                   CL199
040100                                        OCCURS 6 TIMES.              CL199
040200              05  MR004O-CSTKMAXT PIC S9V99 COMP-3                   CL199
040300                                        OCCURS 6 TIMES.              CL199
040400              05  MR004O-FTJOPF PIC X(01).                           CL199
040500     SKIP1                                                           CL199
040600****************************************************************     CL199
040700*             ROD USER AREA DEFINITION                               CL199
040800****************************************************************     CL199
040900        03  MR004O-TR-ROD-USER-AREA.                                 CL199
041000            04  MR004O-COST-UNIT-MSMT    PIC X(4).                   CL199
041100            04  MR004O-RTL-UNIT-MSMT     PIC X(4).                   CL199
041200            04  MR004O-CUR-UNIT-RTL-AMT  PIC 9(5)V99.                CL199
041300            04  MR004O-GR-RTL-AMT        PIC 9(5)V99.                CL199
041400            04  MR004O-GR-QTY            PIC 9(3).                   CL199
041500            04  MR004O-MERCH-DIV-CODE    PIC 9.                      CL199
041600            04  MR004O-DMM-NBR           PIC 9(3).                   CL199
041700            04  MR004O-SEQ-NBR           PIC X(3).                   CL199
041800            04  MR004O-ORIGINAL-OQ       PIC S9(7)   COMP-3.         CL200
041900                                                                     CL199
042000         03  FILLER              PIC X(464) VALUE SPACES.            CL201
042100*****************************************************************    CL199
042200*          USER AREA DEFINITION FOR ORDER HEADER                     CL199
042300*****************************************************************    CL199
043300         03 MR004O-TR-ROH-USER-DATA.                                      
043400            05  MR004O-H-TNOW.                                            
043500                07  MR004O-H-WN          PIC S99     COMP-3.              
043600                07  MR004O-H-DN          PIC S9      COMP-3.              
043700            05  MR004O-H-VENDOR-NAME     PIC X(25).                       
043800            05  MR004O-H-BUYER-ID        PIC 9(3).                        
043900            05  MR004O-H-BUYER-NAME      PIC X(32).                       
044000            05  MR004O-H-DEPT            PIC X(03).                       
044100            05  MR004O-H-CLASS.                                           
044200                10  MR004O-H-MAJ-CLASS   PIC X(01).                       
044300                10  MR004O-H-SUB-CLASS   PIC X(01).                       
044400            05  FILLER                   PIC X(432).                      
