000001******************************************************************00010006
000002*        MRRD032   MERCHANDISE REPLENISHMENT                     *00020010
000003*                  FORECAST VS ACTUAL EXCEPTION FILE             *00030006
000004*                  RECORD LENGTH = 80                            *00040001
000005*                                                                *00050006
000006******************************************************************00060006
000007 01  MR032-FORECAST-V-ACTUAL-RECORD.                              00070006
000008     05  MR032-DEPT-NMBR                        PIC  9(04).       00080009
000009     05  MR032-LEVEL                            PIC  X(03).       00090006
000010         88  MR032-DEPT                         VALUE 'DPT'.      00100006
000020         88  MR032-MCL                          VALUE 'MCL'.      00110006
000030         88  MR032-SCL                          VALUE 'SCL'.      00120006
000040         88  MR032-GRP                          VALUE 'GRP'.      00130006
000050         88  MR032-VSC                          VALUE 'VSC'.      00140006
000060         88  MR032-VND                          VALUE 'VND'.      00150006
000070     05  MR032-SW-EXCEPT                        PIC  X(03).       00160006
000080         88  MR032-NO-EXCEPT                    VALUE 'NO '.      00170006
000090         88  MR032-PERCENT                      VALUE 'PER'.      00180006
000100         88  MR032-WOS                          VALUE 'WOS'.      00190006
000200     05  MR032-PERCENT-VARIANCE                 PIC  9(03).       00200006
000300     05  MR032-WEEKS-VARIANCE.                                    00210006
000400         10  MR032-LESS-THAN                    PIC  9(02).       00220006
000500         10  MR032-MORE-THAN                    PIC  9(02).       00230006
000600     05  FILLER                                 PIC  X(63).       00240008
000700                                                                  00250006
