00001 ***************************************************************** 07/28/95
00002 *            DEMAND EXCEPTION RECORD                              MRRD025 
00003 *****************************************************************    LV004
00004  01  MR025-DEMAND-EXCEPT-REC.                                     MRRD025 
00005      05  MR025-MERCH-DIV-CODE               PIC S9(01)    COMP-3.    CL**4
00006      05  MR025-DMM-NMBR                     PIC S9(03)    COMP-3.    CL**4
00007      05  MR025-MERCH-DEPT-NMBR              PIC X(03).            MRRD025 
00008      05  MR025-MDSEAR-DESC                  PIC X(25).            MRRD025 
00009      05  MR025-PTAG-ID                      PIC X(07).            MRRD025 
00010      05  MR025-NMBR-OF-ITEMS                PIC S9(7)     COMP-3. MRRD025 
00011      05  MR025-NMBR-OF-ITEMS-STORES         PIC S9(7)     COMP-3. MRRD025 
00012      05  MR025-DEMAND-FILTER-HISTORY OCCURS 5 TIMES.              MRRD025 
00013          10  MR025-DEREG-CDE                PIC X.                MRRD025 
00014          10  MR025-NMBR-ITEMS-CURR          PIC S9(7)     COMP-3. MRRD025 
00015          10  MR025-REG-PCT-TRIPS-CURR       PIC S9(4)V999 COMP-3. MRRD025 
00016          10  MR025-NMBR-ITEMS-1-WK          PIC S9(7)     COMP-3. MRRD025 
00017          10  MR025-REG-PCT-TRIPS-1-WK       PIC S9(4)V999 COMP-3. MRRD025 
00018          10  MR025-NMBR-ITEMS-2-WK          PIC S9(7)     COMP-3. MRRD025 
00019          10  MR025-REG-PCT-TRIPS-2-WK       PIC S9(4)V999 COMP-3. MRRD025 
00020          10  MR025-NMBR-ITEMS-3-WK          PIC S9(7)     COMP-3. MRRD025 
00021          10  MR025-REG-PCT-TRIPS-3-WK       PIC S9(4)V999 COMP-3. MRRD025 
00022          10  MR025-NMBR-ITEMS-TOTAL         PIC S9(9)     COMP-3. MRRD025 
00023          10  MR025-AVG-NMBR-ITEMS-TOTAL     PIC S9(6)V999 COMP-3. MRRD025 
00024          10  MR025-REG-PCT-TRIPS-TOTAL      PIC S9(6)V999 COMP-3. MRRD025 
00025      05  MR025-TTL-ITEMS-CURR               PIC S9(7)     COMP-3. MRRD025 
00026      05  MR025-TTL-PCT-TRIPS-CURR           PIC S9(4)V999 COMP-3. MRRD025 
00027      05  MR025-TTL-ITEMS-1-WK               PIC S9(7)     COMP-3. MRRD025 
00028      05  MR025-TTL-PCT-TRIPS-1-WK           PIC S9(4)V999 COMP-3. MRRD025 
00029      05  MR025-TTL-ITEMS-2-WK               PIC S9(7)     COMP-3. MRRD025 
00030      05  MR025-TTL-PCT-TRIPS-2-WK           PIC S9(4)V999 COMP-3. MRRD025 
00031      05  MR025-TTL-ITEMS-3-WK               PIC S9(7)     COMP-3. MRRD025 
00032      05  MR025-TTL-PCT-TRIPS-3-WK           PIC S9(4)V999 COMP-3. MRRD025 
00033      05  MR025-TTL-ITEMS-TOTAL              PIC S9(9)     COMP-3. MRRD025 
00034      05  MR025-TTL-AVG-ITEMS-TOTAL          PIC S9(6)V999 COMP-3. MRRD025 
00035      05  MR025-TTL-PCT-TRIPS-TOTAL          PIC S9(6)V999 COMP-3. MRRD025 
