000100***************************************************************** 00010003
000200******************************************************************00020003
000300*             MRRD017   PROFILE TRANSFER RECORD                  *00030003
000400*             RECORD LENGTH = 1143                               *00040003
000500*             OUTPUT OF MRKUT014                                 *00050003
000600*             INPUT TO MRKUT003                                  *00060003
000700******************************************************************00070003
000800* * * * * * * * *  START OF TRANSFER RECORD   * * * * * * * * * * 00080003
000900*                                                                 00090003
001000        03  MR017-TR-INPUT-AREA.                                  00100003
001100*                                                                 00110003
001200***************************************************************** 00120003
001300*             ADDITIONAL FIELDS FOR SORTING                     * 00130003
001400***************************************************************** 00140003
001410*----------------------------------------------------------------*00141004
001420* REPLACE THE FIELD MR017-SEQ-NBR WITH S9(8) COMP-3  FIELD       *00142004
001421* CALLED MR017-SKU-NBR AND REDUCE THE FILLER AT THE END OF       *00142104
001422* RECORD LAYOUT BY 2 BYTES.                          WR # 230ZZ  *00142204
001410*----------------------------------------------------------------*00142310
001420* CHANGE PIC FOR MR017-STR-NBR FROM X(3) TO S9(5) FOR STORE      *00142410
001421* NUMBER EXPANSION PROJECT.  REDUCE THE FILLER AT THE END OF     *00142510
001422* RECORD LAYOUT BY 2 BYTES.               B. FORD    WR # 26363  *00142610
001430*----------------------------------------------------------------*00143004
001500*                                                                 00150003
001600          04  MR017-TR-SORT-FIELDS.                               00160003
001700              05  MR017-SORT-SKU.                                 00170003
001800                 07  MR017-DEPT-NBR   PIC X(03).                  00180003
001900                 07  MR017-CLASS-NBR  PIC X(02).                  00190003
002000                 07  MR017-VEND-NBR   PIC X(03).                  00200003
002110                 07  MR017-SKU-NBR    PIC S9(8)      COMP-3.      00211008
002200              05  MR017-STR-NBR       PIC S9(05).                 00220010
002300              05  MR017-ITEM-NBR      PIC 9(15)      COMP-3.      00230003
002400              05  MR017-WEEK-NBR      PIC S99V       COMP-3.      00240003
002500              05  MR017-FE-SEQ-NBR    PIC S99V       COMP-3.      00250003
002600              05  MR017-LFWM-QTY      PIC S9(6)V9    COMP-3.      00260003
002700              05  MR017-FWM-QTY       PIC S9(6)V9    COMP-3.      00270003
002800*                                                                 00280003
002900***************************************************************** 00290003
003000*             HIGH LEVEL PRODUCTION RUN CONTROLS                * 00300003
003100***************************************************************** 00310003
003200*                                                                 00320003
003300          04  MR017-SALES-REVISION-RUNS.                          00330003
003400              05  MR017-UCYCLE        PIC S9         COMP-3.      00340003
003500*                                                                 00350003
003600          04  MR017-REPLENISHMENT-RUNS.                           00360003
003700              05  MR017-TNOW.                                     00370003
003800                 07  MR017-WN         PIC S99        COMP-3.      00380003
003900                 07  MR017-DN         PIC S9         COMP-3.      00390003
004000*                                                                 00400003
004100***************************************************************** 00410003
004200*             HIGH LEVEL DDU VALUES                             * 00420003
004300***************************************************************** 00430003
004400*                                                                 00440003
004500          04  MR017-DEMAND-FILTERING.                             00450003
004600              05  MR017-IDFL          PIC S9         COMP-3.      00460003
004700              05  MR017-CADL          PIC S999       COMP-3.      00470003
004800              05  MR017-HIDFL         PIC S9         COMP-3.      00480003
004900              05  MR017-LODFL         PIC S9         COMP-3.      00490003
005000              05  MR017-NDFL          PIC S9         COMP-3.      00500003
005100*                                                                 00510003
005200          04  MR017-SMOOTHING-RATE.                               00520003
005300              05  MR017-DAMP          PIC SV9        COMP-3.      00530003
005400              05  MR017-MINSMK        PIC SV9        COMP-3.      00540003
005500              05  MR017-MAXSMK        PIC SV9        COMP-3.      00550003
005600*                                                                 00560003
005700          04  MR017-TRACKING-SIGNAL.                              00570003
005800              05  MR017-TSL           PIC SV9        COMP-3.      00580003
005900*                                                                 00590003
006000          04  MR017-BYPASS-DD-UPDATE.                             00600003
006100              05  MR017-BYPDDU        PIC X.                      00610003
006200              05  MR017-BYPSCL        PIC S9V99      COMP-3.      00620003
006300              05  MR017-FRCDDU        PIC X.                      00630003
006400              05  MR017-BYPZSL        PIC X.                      00640003
006500              05  MR017-BYPTFP        PIC X.                      00650003
006600              05  MR017-BYPZOH        PIC X.                      00660003
006700              05  MR017-BYPBEF        PIC X.                      00670003
006800              05  MR017-BYPAFT        PIC X.                      00680003
006900              05  MR017-LUMPSW        PIC X.                      00690003
007000              05  MR017-MINBI         PIC SV9        COMP-3.      00700003
007100              05  MR017-DDFTSW        PIC X.                      00710003
007200*                                                                 00720003
007300          04  MR017-RESTRICT-DD-UPDATE.                           00730003
007400              05  MR017-HIPCT         PIC X.                      00740003
007500              05  MR017-LOPCT         PIC X.                      00750003
007600              05  MR017-MINDD         PIC S9(6)V9    COMP-3.      00760003
007700*                                                                 00770003
007800          04  MR017-FORECAST-ERROR.                               00780003
007900              05  MR017-HIMADP        PIC SV9        COMP-3.      00790003
008000              05  MR017-LOMADP        PIC SV9        COMP-3.      00800003
008100*                                                                 00810003
008200***************************************************************** 00820003
008300*             HIGH LEVEL FEX/RDR VALUES                         * 00830003
008400***************************************************************** 00840003
008500*                                                                 00850003
008600          04  MR017-HIGH-LEVEL-FEX-RDR.                           00860003
008700              05  MR017-RT            PIC S999       COMP-3.      00870003
008800              05  MR017-RTF           PIC SV9        COMP-3.      00880003
008900              05  MR017-ZOPSW         PIC X.                      00890003
009000              05  MR017-OUTLSW        PIC X.                      00900003
009100              05  MR017-ZSSTOCK       PIC X.                      00910003
009200              05  MR017-PACKSW        PIC X.                      00920003
009300              05  MR017-DSER          PIC X.                      00930003
009400*                                                                 00940003
009500***************************************************************** 00950003
009600*             PROFILE VALUES                                    * 00960003
009700***************************************************************** 00970003
009800*                                                                 00980003
009900          04  MR017-REGULAR-PROFILE-VALUES.                       00990003
010000              05  MR017-PTAG          PIC X(7).                   01000003
010100*                                                                 01010003
010200***************************************************************** 01020003
010300*             ITEM LEAD TIME VALUES                             * 01030003
010400***************************************************************** 01040003
010500*                                                                 01050003
010600          04  MR017-ITEM-LEAD-TIME-VALUES.                        01060003
010700              05  MR017-LT            PIC S999       COMP-3.      01070003
010800*                                                                 01080003
010900***************************************************************** 01090003
011000*             ITEM COST VALUES                                  * 01100003
011100***************************************************************** 01110003
011200*                                                                 01120003
011300          04  MR017-ITEM-COST-VALUES.                             01130003
011400              05  MR017-ICOST         PIC S9(4)V9(5) COMP-3.      01140003
011500*                                                                 01150003
011600***************************************************************** 01160003
011700*             USER PROVIDED ITEM INPUTS                         * 01170003
011800***************************************************************** 01180003
011900*                                                                 01190003
012000          04  MR017-USER-PROVIDED-ITEMS.                          01200003
012100              05  MR017-OO            PIC S9(7)      COMP-3.      01210003
012200              05  MR017-COMSTK        PIC S9(7)      COMP-3.      01220003
012300              05  MR017-SPOQSW        PIC X.                      01230003
012400              05  MR017-SPOQ          PIC S9(7)      COMP-3.      01240003
012500*                                                                 01250003
012600***************************************************************** 01260003
012700*             POLICY PROVIDED ITEM INPUTS                       * 01270003
012800***************************************************************** 01280003
012900*                                                                 01290003
013000          04  MR017-POLICY-PROVIDED-ITEMS.                        01300003
013100              05  MR017-INAME         PIC X(50).                  01310003
013200              05  MR017-SKU           PIC X(30).                  01320003
013300              05  MR017-UPC           PIC X(22).                  01330003
013400              05  MR017-FT            PIC X.                      01340003
013500              05  MR017-OSTRAT        PIC S999V9     COMP-3.      01350003
013600              05  MR017-PACKSZ        PIC S9(7)      COMP-3.      01360003
013700              05  MR017-IMIN          PIC S9(7)      COMP-3.      01370003
013800              05  MR017-IMAX          PIC S9(7)      COMP-3.      01380003
013900              05  MR017-CSTOCK        PIC S9(5)      COMP-3.      01390003
014000              05  MR017-SSADJ         PIC SV9        COMP-3.      01400003
014100              05  MR017-MINOUTL       PIC S9(7)      COMP-3.      01410003
014200              05  MR017-MAXOUTL       PIC S9(7)      COMP-3.      01420003
014300              05  MR017-MAXOQP        PIC S9V99      COMP-3.      01430003
014400              05  MR017-FOQ           PIC S9(7)      COMP-3.      01440003
014500              05  MR017-TMIN          PIC S999       COMP-3.      01450003
014600              05  MR017-USERMIN       PIC S9(7)      COMP-3.      01460003
014700              05  MR017-USERMAX       PIC S9(7)      COMP-3.      01470003
014800*                                                                 01480003
014900***************************************************************** 01490003
015000*             DDU RECYCLE VALUES                                * 01500003
015100***************************************************************** 01510003
015200*                                                                 01520003
015300          04  MR017-INITIAL-DDU-VALUES.                           01530003
015400              05  MR017-DD            PIC S9(6)V9    COMP-3.      01540003
015500              05  MR017-DDI           PIC S9(6)V9    COMP-3.      01550003
015600              05  MR017-LPP           PIC S999       COMP-3.      01560003
015700              05  MR017-MADSS         PIC S9(6)V9    COMP-3.      01570003
015800              05  MR017-FWMAD         PIC S9(6)V9    COMP-3.      01580003
015900              05  MR017-TRNDP         PIC SV9(5)     COMP-3.      01590003
016000*                                                                 01600003
016100          04  MR017-DDU-MAINTAINED-VALUES.                        01610003
016200              05  MR017-MSDTS         PIC S9(6)V9    COMP-3.      01620003
016300              05  MR017-MADTS         PIC S9(6)V9    COMP-3.      01630003
016400              05  MR017-LTVFACT       PIC S9V99      COMP-3.      01640003
016500              05  MR017-PCTZ          PIC S9V99      COMP-3.      01650003
016600              05  MR017-MADSTAT       PIC X.                      01660003
016700              05  MR017-DFLREG.                                   01670003
016800                  07  MR017-DREG      PIC X     OCCURS 13 TIMES.  01680003
016900              05  MR017-TSREG.                                    01690003
017000                  07  MR017-TREG      PIC X     OCCURS 13 TIMES.  01700003
017100              05  MR017-DIREG.                                    01710003
017200                  07  MR017-IREG      PIC X     OCCURS 13 TIMES.  01720003
017300              05  MR017-BYPREG.                                   01730003
017400                  07  MR017-BREG      PIC X     OCCURS 13 TIMES.  01740003
017500*                                                                 01750003
017600          04  MR017-LAST-DDU-RUN-VALUES.                          01760003
017700              05  MR017-LDD           PIC S9(6)V9    COMP-3.      01770003
017800              05  MR017-LDDI          PIC S9(6)V9    COMP-3.      01780003
017900              05  MR017-LMADSS        PIC S9(6)V9    COMP-3.      01790003
018000*                                                                 01800003
018100***************************************************************** 01810003
018200*             FEX / RDR RECYCLE VALUES                          * 01820003
018300***************************************************************** 01830003
018400*                                                                 01840003
018500          04  MR017-FEX-RDR-RECYCLE-VALUES.                       01850003
018600              05  MR017-OUTSTAT       PIC X.                      01860003
018700              05  MR017-LRTFCST       PIC S9(6)V9    COMP-3.      01870003
018800              05  MR017-ORDSTAT       PIC X.                      01880003
018900*                                                                 01890003
019000***************************************************************** 01900003
019100*             HISTORY DATA                                      * 01910003
019200***************************************************************** 01920003
019300*                                                                 01930003
019400          04  MR017-HISTORY-DATA.                                 01940003
019500              05  MR017-HISTBPN       PIC S9(2)      COMP-3       01950003
019600                                                OCCURS 13 TIMES.  01960003
019700              05  MR017-HISTDD        PIC S9(6)V9    COMP-3       01970003
019800                                                OCCURS 13 TIMES.  01980003
019900              05  MR017-HISTMAD       PIC S9(6)V9    COMP-3       01990003
020000                                                OCCURS 13 TIMES.  02000003
020100              05  MR017-HISTOH        PIC S9(7)      COMP-3       02010003
020200                                                OCCURS 13 TIMES.  02020003
020300              05  MR017-HISTCPS       PIC S9(7)      COMP-3       02030003
020400                                                OCCURS 13 TIMES.  02040003
020500*                                                                 02050003
020600***************************************************************** 02060003
020700*             RESERVED INPUT AREA                               * 02070003
020800***************************************************************** 02080003
020900*                                                                 02090003
021000          04  MR017-RESERVED-STORAGE-IN.                          02100003
021100              05  MR017-DDUPRM        PIC X(01).                  02110003
021200              05  MR017-CSTKMINT      PIC S9V99 COMP-3            02120003
021300                                        OCCURS 6 TIMES.           02130003
021400              05  MR017-CSTKMAXT      PIC S9V99 COMP-3            02140003
021500                                        OCCURS 6 TIMES.           02150003
021600              05  MR017-FTJOPF        PIC X(01).                  02160003
021700     SKIP1                                                        02170003
021800****************************************************************  02180003
021900*             ROD USER AREA DEFINITION                            02190003
022000****************************************************************  02200003
022100        03  MR017-TR-ROD-USER-AREA.                               02210003
022200            04  MR017-COST-UNIT-MSMT     PIC X(4).                02220003
022300            04  MR017-RTL-UNIT-MSMT      PIC X(4).                02230003
022400            04  MR017-CUR-UNIT-RTL-AMT   PIC 9(5)V99.             02240003
022500            04  MR017-GR-RTL-AMT         PIC 9(5)V99.             02250003
022600            04  MR017-GR-QTY             PIC 9(3).                02260003
022700            04  MR017-MERCH-DIV-CODE     PIC 9.                   02270003
022800            04  MR017-DMM-NBR            PIC 9(3).                02280003
022900            04  MR017-ROD-SEQ-NBR        PIC X(3).                02290003
023000            04  MR017-ORIGINAL-OQ        PIC S9(7)   COMP-3.      02300003
023100*                                                                 02310003
023200***************************************************************** 02320003
023300*          USER AREA DEFINITION FOR ORDER HEADER                  02330003
023400***************************************************************** 02340003
023500         03 MR017-TR-ROH-USER-DATA.                               02350003
023600            05  MR017-H-TNOW.                                     02360003
023700                07  MR017-H-WN           PIC S99     COMP-3.      02370003
023800                07  MR017-H-DN           PIC S9      COMP-3.      02380003
023900            05  MR017-H-VENDOR-NAME      PIC X(25).               02390003
024000            05  MR017-H-BUYER-ID         PIC 9(3).                02400003
024100            05  MR017-H-BUYER-NAME       PIC X(32).               02410003
024200            05  FILLER                   PIC X(427).              02420010
024300*                                                                 02430003
024400*----------------------------------------------------------------*02440004
024500* CHANGES MADE FOR WR # 230ZZ ENDS HERE.                         *02450004
024600*----------------------------------------------------------------*02460004
