      ******************************************************************        
      *                                                                *        
      *      MRRD030 - RECORD LENGTH = 65                              *        
      *                                                                *        
      *      THIS IS THE LAYOUT FOR THE FILE THAT CONTAINS INFOREM     *        
      *      SKU/STORES THAT REACH A ZERO ONHAND DURING THE WEEK.      *        
      *                                                                *        
      *   06/08/2004 - BOB FORD WR#26363                               *        
      *                CHANGED STORE-NBR PIC TO S9(5) FROM X(3)        *        
      ******************************************************************        
00057  01  MR030-OUT-OF-INV-RECORD.                                        CL**2
           05  MR030-OUT-OF-INV-KEY.                                            
00160          10  MR030-DEPT-NBR          PIC X(3).                       CL**2
00161          10  MR030-CLASS-NBR         PIC X(2).                       CL**2
               10  MR030-VENDOR-STYLE      PIC X(20).                           
00162          10  MR030-COLOR-DESC        PIC X(20).                      CL**2
00163          10  MR030-ITEM-NBR          PIC 9(15).                      CL**2
               10  MR030-STORE.                                                 
                   15 MR030-STORE-NBR      PIC S9(5).                           
                                                                                
