000100******************************************************************        
000200*        MRRD146   MERCHANNDISE REPLENISHMENT RECORD             *        
000210*                  FOR CONTROL MEMBER MRSI146                    *        
000300*                    RECORD LENGTH = 80                          *        
000400*                                                                *        
000500*  EACH RECORD WILL CONTAIN ONE WEEK OF DEPARTMENTS FOR THE 12   *        
000600*  WEEKS OF ROTATION.                                            *        
000800* ****************************************************************        
001800                                                                          
001900 01  MR146-DEPT-RECORD.                                                   
002123     05  FILLER                   PIC X(05)  VALUE SPACES.                
002124     05  MR146-WEEK              PIC 9(02)  VALUE ZERO.                   
002125     05  FILLER                  PIC X(01)  VALUE SPACE.                  
002126     05  MR146-WEEK-TABLE OCCURS 10 TIMES INDEXED BY DEPT-INDEX.          
002130         10  MR146-DEPT          PIC 9(03).                               
002140         10  FILLER              PIC X(01).                               
002150     05  FILLER                  PIC X(32).                               
