      ***************************************************************           
      *   MRRD042 - QUANTUM - BUSNINESS ORDER STRATEGY FILE LAYOUT              
      *   RECORD LENGTH = 106 BYTES                                             
      ***************************************************************           
       01  MR042-BUS-ORD-STRGY-RECORD.                                          
           05 MR042-BUS-ORD-STRGY-ID         PIC 9(05).                         
           05 FILLER                         PIC X(01) VALUE "|".               
           05 MR042-BUS-ORD-STRGY-DESC       PIC X(100).                        
