      ***************************************************************** 00001000
      * MRRD051 - WAREHOUSE EXTRACT RECORD                              00002003
      *           FILE LENGTH = 43 BYTES                                00004000
      *           CREATED BY JACK KRAMER  02/09/2011                    00006000
      ***************************************************************** 00007000
       01  MR051-EXTRACT-RECORD.                                        00040002
           05  MR051-ITEM-SIGN             PIC  X(01).                  00050000
           05  MR051-ITEM                  PIC  9(15).                  00060000
           05  FILLER                      PIC  X(02).                  00070000
           05  MR051-STORE-NBR             PIC  9(05).                  00080001
           05  FILLER                      PIC  X(01).                  00090000
           05  MR051-FSCL-YR               PIC  9(04).                  00100000
           05  FILLER                      PIC  X(01).                  00110000
           05  MR051-FSCL-WK-NBR           PIC  9(02).                  00120000
           05  FILLER                      PIC  X(01).                  00130000
           05  MR051-SLS-UNIT-QTY-SIGN     PIC  X(01).                  00140000
           05  MR051-SLS-UNT-QTY           PIC  9(09).                  00150000
           05  FILLER                      PIC  X(01).                  00160000
