      *****************************************************************         
      *                                                                         
      *      MRRD031 - RECORD LENGTH = 164                                      
      *                                                                         
      *      THIS IS THE EXTRACT FILE FROM PROGRAM MRKRP086.  IT                
      *      CONTAINS ITEMS AND STORES THAT WERE BELOW THE SERVICE              
      *      LEVEL PERCENT LIMIT.  THE RECORD WILL CONTAIN EITHER A             
      *      STORE NUMBER OR AN ITEM/SKU NUMBER, NOT BOTH.                      
      *                                                                         
      *  06/08/2004 - BOB FORD WR#26363                                         
      *               CHANGED MR031-STORE-NBR TO S9(5) FROM X(3)                
      *****************************************************************         
       01  MR031-SERVICE-LEVEL-EXT-RECORD.                                      
           10  MR031-BUSINESS-GROUP        PIC X(03).                           
           10  MR031-BUSINESS-GROUP-DESC   PIC X(25).                           
           10  MR031-DEPT-NBR              PIC X(03).                           
           10  MR031-CLASS-NBR             PIC X(02).                           
           10  MR031-SKU                   PIC X(08).                           
           10  MR031-VENDOR-STYLE          PIC X(20).                           
           10  MR031-SKU-DESC              PIC X(25).                           
           10  MR031-COLOR-DESC            PIC X(20).                           
           10  MR031-ITEM-NBR              PIC 9(15).                           
           10  MR031-STORE.                                                     
               15  MR031-STORE-NBR         PIC S9(5).                           
           10  MR031-SERVICE-LEVEL-PCT     PIC 9(03).                           
           10  MR031-BUYER-NBR             PIC X(03).                           
           10  MR031-BUYER-NAME            PIC X(32).                           
