014200******************************************************            00010000
014201*  OUTPUT RECORD FOR FUTURE FORECAST TABLE LOAD                   00020000
      *                                                                 00030000
014204*  RECORD LENGTH = 43                                             00040000
014205******************************************************            00050000
014210 01  MR142-FUTURE-FORECAST-RECORD.                                00060000
014215     05  MR142-BOW-DATE          PIC  X(19).                      00070000
014251     05  FILLER                  PIC  X(01)  VALUE ','.           00080000
014211     05  MR142-SKU               PIC  9(08).                      00090001
014251     05  FILLER                  PIC  X(01)  VALUE ','.           00100000
014213     05  MR142-STORE-NBR         PIC  9(05).                      00110000
014251     05  FILLER                  PIC  X(01)  VALUE ','.           00120000
014216     05  MR142-FCST-SLS-QTY      PIC  9(06).9.                    00130000
014290*                                                                 00140000
