      ******************************************************************        
      *  MRRD138 - RECORD LENGTH = 60                                  *        
      *                                                                *        
      *  THIS IS THE RECORD LAYOUT FOR THE MESSAGE ID FILE CREATED     *        
      *  IN THE BATCH ELIGIBILITY RULES PROCESS THAT CREATES THE       *        
      *  REQUEST MESSAGES FOR ER.                                      *        
      ******************************************************************        
      *  06/30/05 WR#26351 - NEW JOB FOR MR REVIEW & ADJUST -          *        
      *                      PO SUBMIT PROJECT.                        *        
      ******************************************************************        
       01  MR138-ER-MESSAGE-ID-RECORD.                                          
           05  MR138-ITEM-NBR          PIC S9(15)  VALUE ZEROES COMP-3.         
           05  MR138-SKU               PIC S9(08)  VALUE ZEROES COMP-3.         
           05  MR138-DEPT              PIC S9(04)  VALUE ZEROES COMP-3.         
           05  MR138-MCL               PIC S9(04)  VALUE ZEROES COMP-3.         
           05  MR138-SCL               PIC S9(04)  VALUE ZEROES COMP-3.         
           05  MR138-INTR-UPC-ID       PIC S9(11)  VALUE ZEROES COMP-3.         
           05  MR138-MESSAGE-ID        PIC  X(24)  VALUE SPACES.                
           05  FILLER                  PIC  X(08).                              
                                                                                
