00001 ***************************************************************** 06/09/95
00002 *            PARAMETER INPUT RECORD                               MRRD024 
00003 *****************************************************************    LV002
00004  01  MR024-DEMAND-EXC-SUMMARY-CTL.                                   CL**1
00005      05  MR024-LODFL-LIMIT       PIC 999V9       VALUE ZEROS.        CL**2
00006      05  MR024-HIDFL-LIMIT       PIC 999V9       VALUE ZEROS.        CL**2
00007      05  MR024-IDFL-LIMIT        PIC 999V9       VALUE ZEROS.        CL**2
00008      05  MR024-LOPCT-LIMIT       PIC 999V9       VALUE ZEROS.        CL**2
00009      05  MR024-HIPCT-LIMIT       PIC 999V9       VALUE ZEROS.        CL**2
00010      05  MR024-TOTAL-LIMIT       PIC 999V9       VALUE ZEROS.        CL**2
