00001 ***************************************************************** 05/27/93
00002 *            PTAG FILE FOR DEMAND EXCEPTION REPORTING             MRRD010 
00003 *                                                                    LV001
00004 *                  FILE LENGTH = 34 BYTES                         MRRD010 
00005 *                                                                 MRRD010 
00006 *                  CREATED BY CHRISTINE FOLEY      05/27/93       MRRD010 
00007 *                                                                 MRRD010 
00008 *                  MODIFIED BY XXXXXXXXXXXXXXX     XX/XX/XX       MRRD010 
00009 ***************************************************************** MRRD010 
00008 *         WR#26363 MODIFIED BY BOB FORD            06/16/04       MRRD010 
00008 *                  STORE CHANGED TO PIC 9(5), FILLER ADJUSTED     MRRD010 
00009 ***************************************************************** MRRD010 
00010  01  MR010-PTAG-FILE.                                             MRRD010 
00011      05  MR010-PTAG-ID          PIC X(07)   VALUE SPACES.         MRRD010 
00012      05  MR010-ITEM-NBR         PIC 9(15)V  VALUE ZEROES COMP-3.  MRRD010 
00013      05  MR010-STR-NBR          PIC 9(05)   VALUE ZEROES.         MRRD010 
00014      05  MR010-DFLREG-CDE       PIC X(13)   VALUE SPACES.         MRRD010 
00015      05  FILLER                 PIC X(02)   VALUE SPACES.         MRRD010 
