000100******************************************************************00010024
000200*        MRRD125   MERCHANNDISE REPLENISHMENT SALES RECORD       *00020024
000300*                    RECORD LENGTH = 200                         *00030024
000400*                                                                *00040024
000500*  THIS FILE CONTAINS THE FS/MR HISTORICAL UNIT SALES BY SKU.    *00050024
000600*  EACH RECORD CONTAINS ONE WEEKS WORTH OF DATA.                 *00060024
000700*  EACH RECORD CORRESPONDS TO A WEEK WITHIN THE CALENDAR YEAR.   *00070024
000800* ****************************************************************00080024
000900*  CHANGE MADE:                                                  *00090024
001000*  09-21-01  BY N MOULTON                                        *00100024
001100*   BMC CHANGES: CHANGED COPYBOOK TO WORK WITH STANDARD IBM      *00110024
001200*                FORMAT                                          *00120024
001300******************************************************************00130024
001400*  CHANGE MADE:                                                  *00131024
001500*  07-01-02  BY DON TOMLINSON                                    *00132024
001600*   NI-SKU PROJECT: REMOVED DEPT, CLASS, SEQ AND ADDED SKU.      *00133024
001700******************************************************************00134024
001400*  CHANGE MADE:                                                  *00134124
001500*  06-22-04  BY BOB FORD                                         *00134224
001600*   STORE EXPANSION: CHANGED MR125-STORE TO S9(5), CHGD FILLER   *00134324
001700******************************************************************00134424
001800                                                                  00134524
001900 01  MR125-SKU-HISTORY-RECORD.                                    00134624
002000                                                                  00134724
002100     05  MR125-SKU-DATA.                                          00134824
002200         10  MR125-SKU                 PIC 9(08).                 00134924
002300         10  MR125-ACTIVE-DELETE       PIC X.                     00135024
002400             88  MR125-ACTIVE                       VALUE IS 'A'. 00136024
002500             88  MR125-DELETE                       VALUE IS 'D'. 00137024
002600         10  MR125-VNDR-INHSE          PIC 9(3)     COMP-3.       00138024
002700         10  MR125-STATUS-CODE         PIC S9(3)    COMP-3.       00139024
002800         10  MR125-GROUP-CODE          PIC X(3).                  00140024
002900         10  MR125-ITEM-NMBR           PIC S9(15)   COMP-3.       00150024
003000         10  MR125-ENT-ID              PIC S9(9)    COMP-3.       00160024
003100         10  MR125-LONG-VENDOR-STYLE   PIC X(20).                 00170024
003200         10  MR125-CSTM-CLOR-DESC      PIC X(10).                 00180024
003300         10  MR125-KOHLS-DESC-SZ       PIC X(10).                 00190024
003400         10  MR125-FASHION-CODE        PIC X(20).                 00200024
003500         10  MR125-SEASON-CODE         PIC X(20).                 00210024
003600         10  MR125-ENT-NAME-DESC       PIC X(30).                 00220024
003700                                                                  00230024
003800     05  MR125-STORE-SALES-DATA.                                  00240024
003900         10  MR125-SALES-DATE.                                    00250024
004000             15  MR125-SALES-YEAR      PIC S9(4)    COMP.         00260024
004100             15  MR125-SALES-WW        PIC S9(4)    COMP.         00270024
004200                                                                  00280024
004300         10  MR125-SALES-TYPE          PIC X(2).                  00290024
004400             88  MR125-REG-SALES               VALUE IS '10'.     00300024
004500             88  MR125-PROMO-SALES             VALUE IS '20'.     00310024
004600             88  MR125-CLR-SALES               VALUE IS '30'.     00320024
004700             88  MR125-INVENTORY               VALUE IS '90'.     00330024
004800         10  MR125-UNITS               PIC S9(9)    COMP.         00340024
004900         10  MR125-STORE               PIC S9(4) COMP.            00350024
005000         10  MR125-STORE-STATE-CODE    PIC X(2).                  00360024
005100         10  MR125-STORE-DISTRICT-NMBR PIC X(3).                  00370024
005200         10  MR125-STORE-MET-NBR       PIC S9(5)    COMP-3.       00380024
005300                                                                  00390024
005400     05  FILLER                        PIC X(40).                 00400024
