000100***************************************************************** 01/19/93
000200*            PARAMETER INPUT RECORD                               MRRD001I
000300** IN PROGRAM MRKUT002:                                           MRRD001I
000400**                                                                MRRD001I
000500** IN PROGRAM MRKUT014:                                           MRRD001I
000600**                                                                MRRD001I
000700*****************************************************************    LV022
000800 01  PARAMETER-INPUT-RECORD.                                         CL*19
000900     05  MR001I-S-SYS-ID         PIC XX.                             CL*18
001000     05  MR001I-S-RUN-MODE       PIC X.                              CL*18
001100     05  MR001I-S-RUN-TYPE       PIC S9.                             CL*18
001200     05  MR001I-S-RUN-DATE.                                          CL*21
001300         10 MR001I-S-RUN-DATE-YR PIC XX.                             CL*21
001400         10 MR001I-S-RUN-DATE-MO PIC XX.                             CL*21
001500         10 MR001I-S-RUN-DATE-DY PIC XX.                             CL*21
001600     05  MR001I-S-RUN-CYCLE      PIC X.                              CL*22
001700     05  FILLER                  PIC X(08).                          CL*22
001800     05  MR001I-S-DAY            PIC 9(01).                          CL*22
001900     05  FILLER                  PIC X(60).                          CL*22
