00001 ******************************************************************06/10/93
00002 **                        MRWS102                               **MRWS102 
00003 **                                                              **   LV132
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR SYSTEM    **   CL132
00005 **  MESSAGE MAINTENANCE.                                        **   CL132
00006 **  LENGTH:  200 BYTES                                          **   CL132
00007 ******************************************************************   CL132
00008          10  MR102-INTER-APPL-COMMAREA  REDEFINES                    CL132
00009              INTER-APPL-COMM-AREA.                                   CL132
00010              15  FILLER                         PIC X(01).           CL132
00011              15  MR102-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL132
00012                                                     COMP-3.          CL132
00013              15  MR102-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL132
00014                                                     COMP-3.          CL132
00015              15  MR102-SEL-QUEUE-NAME           PIC X(8).            CL132
00016              15  FILLER                         PIC X(183).          CL132
