      ******************************************************************        
      *   MXRD004 - ITEM - MPX TO MR ITEM FILE LAYOUT                  *        
      *   SOR-CRE-TMST FORMAT = YYYY-MM-DD-HH24.MI.SS.FF (FF = 6 BYTES)*        
      *   RECORD LENGTH = 64 BYTES                                     *        
      ******************************************************************        
       01  MX004-ITM-RECORD.                                                    
           05 MX004-ITM-NBR             PIC 9(15).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-SOR-CRE-TMST        PIC X(26).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-ISRT-DEL-IND        PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-UCYCLE-CDE          PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-RT-NBR              PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-PACKSW-CDE          PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-DSER-CDE            PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-LT-QTY              PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-RT-DAY-NBR          PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX004-ORD-GROUP-SW        PIC X(01).                              
