      ******************************************************************        
      *   MXRD007 - STORE TRAN - MPX TO MR STORE TRAN FILE LAYOUT      *        
      *   SOR-CRE-TMST FORMAT = YYYY-MM-DD-HH24.MI.SS                  *        
      *   RECORD LENGTH =  103 BYTES                                   *        
      ******************************************************************        
       01  MX007-STORE-TRAN-RECORD.                                             
           05 MX007-DEPT-NBR            PIC X(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-PARM-CDE            PIC X(10).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-SKU-NBR             PIC X(08).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-STR-NBR             PIC X(05).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-MAJ-CL-NBR          PIC X(04).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-SUB-CL-NBR          PIC X(04).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-ITM-NBR             PIC X(15).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-PARM-VAL-TXT        PIC X(10).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-SOR-CRE-TMST        PIC X(26).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX007-SOR-CRE-BY-USR-ID   PIC X(08).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
