      ******************************************************************        
      *   MXRD005 - ITEM STORE - MPX TO MR ITEM STORE FILE LAYOUT      *        
      *   SOR-CRE-TMST FORMAT = YYYY-MM-DD-HH24.MI.SS.FF (FF = 6 BYTES)*        
      *   RECORD LENGTH = 85  BYTES                                    *        
      ******************************************************************        
       01  MX005-ITM-STR-RECORD.                                                
           05 MX005-ITM-NBR             PIC 9(15).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-STR-NBR             PIC 9(05).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-SOR-CRE-TMST        PIC X(26).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-ISRT-DEL-IND        PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-FT-CDE              PIC X(01).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-ORD-STGY-QTY        PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-MIN-PRSTN-UNT-QTY   PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-MIN-STK-UNT-QTY     PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-MAX-STK-UNT-QTY     PIC 9(03).                              
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-DSEA-DMND-UNT-QTY   PIC 9(06).9(1).                         
           05 FILLER                    PIC X(01) VALUE "|".                    
           05 MX005-PTAG-ID             PIC X(07).                              
