000100******************************************************************        
000200*    COPY MEMBER:  OFRD010                       LRECL = 60      *        
000300*                                                                *        
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR SENDING          *        
000500*    INVENTORY ADJUSTMENTS TO OMS/SIM                            *        
000600*                                                                *        
001200******************************************************************        
001300 01  OF010-PCT-INTRANSIT-REC.                                             
001400     05  OF010-INTR-UPC-ID          PIC  S9(9) COMP  VALUE ZEROS.         
002800     05  OF010-STR-NBR              PIC  S9(4) COMP  VALUE ZEROS.         
002900     05  OF010-TRN-TYP-CDE          PIC  X(02)       VALUE SPACES.        
003000         88 OF010-STORE-VRFY-RECEIPT   VALUE 'AR'.                        
003100         88 OF010-CNTL-STOCK-RECEIPT   VALUE 'CS'.                        
003200         88 OF010-STORE-VRFY-ADJ       VALUE 'VA'.                        
003300         88 OF010-SHIPPD-DC            VALUE 'SH'.                        
003400         88 OF010-UNLOAD-ST            VALUE 'UN'.                        
003500     05  OF010-IN-TRNST-QTY         PIC  S9(9) COMP  VALUE ZEROS.         
003700     05  OF010-PO-NBR               PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  OF010-RCVR-SEQ-NBR         PIC  S9(9) COMP  VALUE ZEROS.         
004000     05  OF010-STAT-CDE-DS          PIC  9(01).                           
004100         88  OF010-SHIPPED-FROM-DC           VALUE 1.                     
004200         88  OF010-NOT-SHIPPED-FROM-DC       VALUE 0.                     
004300     05  OF010-STAT-CDE-SU            PIC  9(01).                         
004400         88  OF010-UNLOADED-AT-STORE         VALUE 1.                     
004500         88  OF010-NOT-UNLOADED-AT-STORE     VALUE 0.                     
004600     05  OF010-TRN-CLSN-CDE         PIC  X(02).                           
004700         88  OF010-TRN-IN-TRANSIT            VALUE 'IT'.                  
004800         88  OF010-TRN-STR-EXPECTED          VALUE 'SE'.                  
004900     05  OF010-UPC-NBR              PIC S9(15)V.                          
003800     05  OF010-TRN-LNE-NBR          PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  OF010-OTB-TYP-CDE          PIC  X(2)        VALUE SPACES.        
006500     05  FILLER                     PIC  X(15)       VALUE SPACES.        
