000100******************************************************************00010000
000200**                        OFRD011                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT OF THE MESSAGE BEING SENT TO OMS WHEN    **00040000
000500**  OUTBOUND TRAILER ARE SHIPPED TO THE STORES                  **00050000
000600**  LENGTH: 200  BYTES                                          **00060003
000700******************************************************************00070000
000800 01  OF011-EXTRACT-RECORD.                                        00080000
000801     05  OF011-DEST-LOC-NBR         PIC  S9(04)  VALUE 0 COMP.    00080100
000802     05  OF011-OTBND-TRIP-ID        PIC  S9(09)  VALUE 0 COMP.    00080200
000803     05  OF011-SHIPPED-TMST         PIC   X(26)  VALUE SPACES.    00080300
000804     05  OF011-SHIPT-UNT-ID         PIC  S9(18)V VALUE 0 COMP-3.  00080400
000805     05  OF011-SKU-NBR              PIC  S9(08)V VALUE 0 COMP-3.  00080500
000806     05  OF011-SHPD-UNT-QTY         PIC  S9(09)V VALUE 0 COMP-3.  00080600
000801     05  OF011-ORGN-OPER-UNT-ID     PIC  S9(04)  VALUE 0 COMP.    00080700
           05  OF011-TRLR-ID              PIC   X(12)  VALUE SPACES.    00080800
           05  OF011-TRLR-SRL-NBR         PIC  S9(09)  VALUE 0 COMP.    00080900
           05  OF011-TRLR-SEAL-ID         PIC   X(20)  VALUE SPACES.    00081000
           05  OF011-SHIP-SCAC-CDE        PIC   X(4)   VALUE SPACES.    00081100
           05  OF011-TRN-NBR              PIC  S9(09)  VALUE 0 COMP.    00081200
           05  OF011-RCVR-SEQ-NBR         PIC  S9(09)  VALUE 0 COMP.    00081300
           05  OF011-UNIT-RETAIL          PIC  S9(08)V99  VALUE 0.      00081400
           05  OF011-COST-AMT             PIC  S9(07)V999 VALUE 0.      00081500
           05  OF011-SML-TYPE             PIC   X(03)  VALUE SPACES.    00081602
           05  OF011-MSTR-UNT-ID          PIC  S9(18)V VALUE 0 COMP-3.  00081702
           05  OF011-TMST-ON-TRLR         PIC  X(26)   VALUE SPACE.     00081804
           05  OF011-DTE-AT-DC            PIC  X(10)   VALUE SPACE.     00082002
           05  OF011-TM-AT-DC             PIC  X(08)   VALUE SPACE.     00082102
           05  OF011-OPC-SET-IND          PIC  X(01)   VALUE SPACE.     00082206
           05  FILLER                     PIC  X(20)   VALUE SPACE.     00083006
