000100******************************************************************00010000
000200**                        OFRD011                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT OF THE MESSAGE BEING SENT TO OMS FOR     **00040000
000500**  CARTONS THAT ARE ASSUMPTIVELY RECEIVED                     ** 00050000
000600**  LENGTH: 200  BYTES                                          **00060000
000700******************************************************************00070000
000800 01  OF012-EXTRACT-RECORD.                                        00080000
000801     05  OF012-DEST-LOC-NBR         PIC  S9(04)  VALUE 0 COMP.    00090000
000802     05  OF012-OTBND-TRIP-ID        PIC  S9(09)  VALUE 0 COMP.    00100000
000803     05  OF012-SHIPPED-TMST         PIC   X(26)  VALUE SPACES.    00110000
000804     05  OF012-SHIPT-UNT-ID         PIC  S9(18)V VALUE 0 COMP-3.  00120000
000805     05  OF012-SKU-NBR              PIC  S9(08)V VALUE 0 COMP-3.  00130000
000806     05  OF012-SHPD-UNT-QTY         PIC  S9(09)V VALUE 0 COMP-3.  00140000
000801     05  OF012-ORGN-OPER-UNT-ID     PIC  S9(04)  VALUE 0 COMP.    00150000
           05  OF012-TRLR-ID              PIC   X(12)  VALUE SPACES.    00160000
           05  OF012-TRLR-SRL-NBR         PIC  S9(09)  VALUE 0 COMP.    00170000
           05  OF012-TRLR-SEAL-ID         PIC   X(20)  VALUE SPACES.    00180000
           05  OF012-SHIP-SCAC-CDE        PIC   X(4)   VALUE SPACES.    00190000
           05  OF012-TRN-NBR              PIC  S9(09)  VALUE 0 COMP.    00200000
           05  OF012-RCVR-SEQ-NBR         PIC  S9(09)  VALUE 0 COMP.    00210000
           05  OF012-UNIT-RETAIL          PIC  S9(08)V99  VALUE 0.      00220000
           05  OF012-COST-AMT             PIC  S9(07)V999 VALUE 0.      00230000
           05  OF012-SML-TYPE             PIC   X(03)  VALUE SPACES.    00240000
           05  OF012-MSTR-UNT-ID          PIC  S9(18)V VALUE 0 COMP-3.  00250000
           05  OF012-TMST-ON-TRLR         PIC  X(26)   VALUE SPACE.     00260000
           05  OF012-DTE-AT-DC            PIC  X(10)   VALUE SPACE.     00270000
           05  OF012-TM-AT-DC             PIC  X(08)   VALUE SPACE.     00280000
           05  OF012-SCN-TYP-CDE          PIC  X(04)   VALUE SPACE.     00290002
           05  FILLER                     PIC  X(17)   VALUE SPACE.     00300002
