      ***************************************************************** 00010000
      *  PARD135 RECORD LAYOUT                                        * 00020000
      *     RECORD LAYOUT FOR PROJECTION ANALYSIS ACTUALS RECORDS     * 00030000
      *     THEY COME AS COMMA DELIMITED FIXED LENGTH FIELDS RECORDS. * 00040000
      *     FILLER HAS BEEN PLACED BETWEEN THE FIELDS SO AS TO IGNORE * 00050000
      *     THE COMMAS.  SOME NUMBERS HAVE A PERIOD AFTER THEM.  IN   * 00051000
      *     THAT CASE THE FILLER IS TWO(2).                           * 00052000
      * CHANGE HISTORY                                                * 00052109
      * DATE  10/10/2015                                              * 00052209
      *     CHANGE MADE: CLIMATE CLUSTER CHANGES. ALL UPDATED CLUSTER * 00052309
      *     VARIABLES ARE RENAMED TO REFER CLIMATE ALONE.             * 00052409
      *     MADE BY: COGNIZANT               WR/IR #: CHG0128228      * 00052509
      ***************************************************************** 00053000
       01  PA135-RECORD.                                                00054000
           05  PA135-DEPT-NMBR              PIC X(03).                  00055000
           05  FILLER                       PIC X(01).                  00056000
           05  PA135-MAJOR-CLASS            PIC X(02).                  00057000
           05  FILLER                       PIC X(01).                  00058000
           05  PA135-SUB-CLASS              PIC X(02).                  00059000
           05  FILLER                       PIC X(01).                  00060000
           05  PA135-SKU-NMBR               PIC X(09).                  00070000
           05  FILLER                       PIC X(02).                  00080000
           05  PA135-VENDOR-ID              PIC X(10).                  00090000
           05  FILLER                       PIC X(02).                  00100000
           05  PA135-VENDOR-STYLE-ID        PIC X(10).                  00110000
           05  FILLER                       PIC X(02).                  00120000
           05  PA135-GROUP-CODE             PIC X(03).                  00130000
           05  FILLER                       PIC X(01).                  00140000
           05  PA135-E-BUSINESS-CODE        PIC X(01).                  00201000
           05  FILLER                       PIC X(01).                  00202000
           05  PA135-MARKET-IND             PIC X(05).                  00203000
               88  PA135-DW-CLASSIC-CORE              VALUE '+1000'.    00208104
               88  PA135-DW-CLASSIC-WARM              VALUE '+2000'.    00208204
               88  PA135-DW-UPDATED-CORE              VALUE '+3000'.    00208304
               88  PA135-DW-UPDATED-HOT               VALUE '+4000'.    00208404
               88  PA135-DW-UPDATED-WARM              VALUE '+5000'.    00208504
               88  PA135-DW-COLD-CLASSIC              VALUE '+7000'.    00208608
      *CLIMATE CLUSTER CHANGES START                                    00208709
      *        88  PA135-DW-COLD-UPDATED              VALUE '+8000'.    00208807
               88  PA135-DW-MILD-CLASSIC              VALUE '+9020'.    00208908
      *        88  PA135-DW-MILD-UPDATED              VALUE '+9030'.    00209007
               88  PA135-DW-HOT-CLASSIC               VALUE '+9000'.    00209108
      *        88  PA135-DW-HOT-UPDATED               VALUE '+9010'.    00209207
      *        88  PA135-DW-SUPER-HOT-UPDATED         VALUE '+9013'.    00209307
               88  PA135-DW-COLD                      VALUE '+8000'.    00209407
               88  PA135-DW-MILD                      VALUE '+9030'.    00209507
               88  PA135-DW-HOT                       VALUE '+9010'.    00209607
               88  PA135-DW-SUPER-HOT                 VALUE '+9013'.    00209707
      *CLIMATE CLUSTER CHANGES END                                      00209809
           05  FILLER                       PIC X(02).                  00209900
           05  PA135-ORIG-CLEAR-DTE         PIC X(08).                  00210002
           05  FILLER                       PIC X(01).                  00210101
      ***************************************************************** 00211000
      *  REGULAR SALES (NO STATUS 30)                                   00220000
      ***************************************************************** 00230000
           05  PA135-REG-SALES-UNITS        PIC X(13).                  00240000
           05  FILLER                       PIC X(02).                  00250000
           05  PA135-REG-SALES-AMT          PIC X(17).                  00260000
           05  FILLER                       PIC X(01).                  00270000
      ***************************************************************** 00280000
      *  CLEARANCE SALES (ONLY STATUS 30)                               00290000
      ***************************************************************** 00300000
           05  PA135-CLEAR-SALES-UNITS      PIC X(13).                  00301000
           05  FILLER                       PIC X(02).                  00302000
           05  PA135-CLEAR-SALES-AMT        PIC X(17).                  00303000
           05  FILLER                       PIC X(01).                  00304000
      ***************************************************************** 00305000
      *  REGULAR INVENTORY ON HAND (NO STATUS 30 NOT CENTRAL STOCK)     00305100
      ***************************************************************** 00305200
           05  PA135-REG-INVTRY-UNITS       PIC X(13).                  00305300
           05  FILLER                       PIC X(02).                  00305400
           05  PA135-REG-INVTRY-AMT         PIC X(17).                  00305500
           05  FILLER                       PIC X(01).                  00305600
      ***************************************************************** 00305700
      *  CLEARANCE INVENTORY ON HAND (STATUS 30 ONLY NOT CENTRAL STOCK) 00305800
      ***************************************************************** 00305900
           05  PA135-CLEAR-INVTRY-UNITS     PIC X(13).                  00306000
           05  FILLER                       PIC X(02).                  00307000
           05  PA135-CLEAR-INVTRY-AMT       PIC X(17).                  00308000
           05  FILLER                       PIC X(01).                  00309000
      ***************************************************************** 00310000
      *  RECEIPTS FOR THE WEEK REPORTING                                00320000
      ***************************************************************** 00330000
           05  PA135-RECEIPTS-UNITS         PIC X(13).                  00340000
           05  FILLER                       PIC X(02).                  00350000
           05  PA135-RECEIPTS-AMT           PIC X(17).                  00360000
           05  FILLER                       PIC X(01).                  00370000
      ***************************************************************** 00380000
      *  PROMOTIONAL MARKDOWNS FOR:                                     00381000
      *              PRICE CHANGE CATEGORY 1                            00382000
      *              NET AFFECT OF MARKDOWNS (TYPE CODE 3)              00382100
      *              MARKDOWN CANCELLED (TYPE CODE 2)                   00382200
      ***************************************************************** 00382300
           05  PA135-PROMO-MRKDWN-UNITS     PIC X(13).                  00382400
           05  FILLER                       PIC X(02).                  00382500
           05  PA135-PROMO-MRKDWN-AMT       PIC X(17).                  00382600
           05  FILLER                       PIC X(01).                  00382700
      ***************************************************************** 00382800
      *  PROMOTIONAL MARKUPS FOR:                                       00382900
      *              PRICE CHANGE CATEGORY 1                            00383000
      *              NET AFFECT OF MARKUPS TYPE CODE 3)                 00384000
      *              MARKUP CANCELLED (TYPE CODE 4)                     00385000
      ***************************************************************** 00386000
           05  PA135-PROMO-MRKUP-UNITS      PIC X(13).                  00387000
           05  FILLER                       PIC X(02).                  00388000
           05  PA135-PROMO-MRKUP-AMT        PIC X(17).                  00389000
           05  FILLER                       PIC X(01).                  00390000
           05  PA135-OTHER-MRKDWN-UNITS     PIC X(13).                  00390101
           05  FILLER                       PIC X(02).                  00390201
           05  PA135-OTHER-MRKDWN-AMT       PIC X(17).                  00390301
           05  FILLER                       PIC X(01).                  00390401
           05  PA135-BUYER-MRKDWN-UNITS     PIC X(13).                  00440000
           05  FILLER                       PIC X(02).                  00450000
           05  PA135-BUYER-MRKDWN-AMT       PIC X(17).                  00460000
           05  FILLER                       PIC X(01).                  00470000
      ***************************************************************** 00520000
      *  CENTRAL STOCK REGULAR INVENTORY ON HAND (NO STATUS 30)         00530000
      ***************************************************************** 00540000
           05  PA135-CEN-STCK-REG-OH-UNITS  PIC X(13).                  00550000
           05  FILLER                       PIC X(02).                  00560000
           05  PA135-CEN-STCK-REG-OH-AMT    PIC X(17).                  00570000
           05  FILLER                       PIC X(01).                  00580000
      ***************************************************************** 00581000
      *  CENTRAL STOCK CLEARANCE INVENTORY ON HAND (ONLY STATUS 30)     00582000
      ***************************************************************** 00583000
           05  PA135-CEN-STCK-CLR-OH-UNITS  PIC X(13).                  00584000
           05  FILLER                       PIC X(02).                  00585000
           05  PA135-CEN-STCK-CLR-OH-AMT    PIC X(17).                  00586000
           05  FILLER                       PIC X(01).                  00587003
      ***************************************************************** 00588003
      *  MOS                                                            00589003
      ***************************************************************** 00590003
           05  PA135-MOS-UNITS              PIC X(13).                  00600003
           05  FILLER                       PIC X(02).                  00610003
           05  PA135-MOS-AMT                PIC X(17).                  00620003
