000100************************************************************      00010000
000200*  COPYBOOK PARD025                                        *      00020000
000300*  THIS COPYBOOK LAYOUT WILL BE USED TO READ AND WRITE     *      00030000
000400*    THE EVENT CALENDAR DATE CONTROL CARD                  *      00040000
000500************************************************************      00050000
000600 01  PA025-DTE-CONTROL-CARD-RCD.                                  00060000
000700     05  PA025-LST-SUCCESS-CSV-LABEL    PIC X(19)                 00070000
000800                                     VALUE 'PREV SUCCESS TMST: '. 00080000
000900     05  PA025-LST-SUCCESS-CSV-TMST.                              00090000
001000         10  PA025-LST-SUCCESS-CSV-DTE  PIC X(10) VALUE SPACES.   00100000
001100         10  PA025-LST-SUCCESS-FILLER   PIC X(01) VALUE ' '.      00110002
001200         10  PA025-LST-SUCCESS-CSV-TIME PIC X(08) VALUE SPACES.   00120000
001300     05  PA025-LSC-FILLER-1             PIC X(01) VALUE SPACES.   00130000
001400     05  PA025-LST-SUCCESS-CSV-IND-LBL  PIC X(18)                 00140001
001500                                     VALUE 'PREV SUCCESS IND: '.  00150000
001600     05  PA025-LST-SUCCESS-CSV-IND      PIC X(01) VALUE SPACES.   00160000
001700     05  PA025-LSC-FILLER-2             PIC X(22) VALUE SPACES.   00170000
001800                                                                  00180000
001900*********************  END OF COPYBOOK  *********************     00190002
