000100******************************************************************00010000
000200*  ---  COPYBOOK PARD905  --  NOVEMBER 2007  --  WR# 30737  ---  *00020000
000300* COBOL COPYBOOK FOR THE RECORD LAYOUT FOR EVENT CALENDAR DATA   *00030000
000400* TO BE PASSED FROM THE CALENDAR CSV FILE VALIDATION PROGRAM TO  *00040000
000500* THE PERM CLEARANCE EVENT ORACLE TABLE MAINTENANCE PROGRAM.     *00050000
000600* - FILE NAME PKMO.PA.EVNT.CAL.VALID (A GDG) -  LRECL = 152      *00060000
000700* CURRENT PGMS (09-NOV-07): VALIDATE: PAKUT905, LOAD: PAKUP106   *00070000
000800******************************************************************00080000
000900 01  PA905-EVNT-CAL-VALID-REC.                                    00090000
001000     10  PA905-CLR-EVNT-ACT-IND          PIC  X(01).              00100000
001100         88  PA905-CLR-EVNT-ACT-ADD      VALUE 'A'.               00110000
001200         88  PA905-CLR-EVNT-ACT-DELETE   VALUE 'D'.               00120000
001300         88  PA905-CLR-EVNT-ACT-UPDATE   VALUE 'U'.               00130000
001400     10  PA905-CLR-EVNT-ID               PIC  9(10).              00140000
001500     10  PA905-FSCL-YR-NBR               PIC  9(04).              00150000
001600     10  PA905-SEA-DESC                  PIC  X(06).              00160000
001700     10  PA905-CLR-EVNT-NM               PIC  X(20).              00170000
001800     10  PA905-MD1-CLR-FRST-EFF-DTE      PIC  X(10).              00180000
001900     10  PA905-MD1-CLR-LAST-EFF-DTE      PIC  X(10).              00190000
002000     10  PA905-MD2-CLR-FRST-EFF-DTE      PIC  X(10).              00200000
002100     10  PA905-MD2-CLR-LAST-EFF-DTE      PIC  X(10).              00210000
002200     10  PA905-MD3-CLR-FRST-EFF-DTE      PIC  X(10).              00220000
002300     10  PA905-MD3-CLR-LAST-EFF-DTE      PIC  X(10).              00230000
002200     10  PA905-MD4-CLR-FRST-EFF-DTE      PIC  X(10).              00231000
002300     10  PA905-MD4-CLR-LAST-EFF-DTE      PIC  X(10).              00232000
002200     10  PA905-MD5-CLR-FRST-EFF-DTE      PIC  X(10).              00233000
002300     10  PA905-MD5-CLR-LAST-EFF-DTE      PIC  X(10).              00234000
002200     10  PA905-MD6-CLR-FRST-EFF-DTE      PIC  X(10).              00235000
002300     10  PA905-MD6-CLR-LAST-EFF-DTE      PIC  X(10).              00236000
002400     10  PA905-MOS-CLR-FRST-EFF-DTE      PIC  X(10).              00240000
002500     10  PA905-MOS-CLR-LAST-EFF-DTE      PIC  X(10).              00250000
002600     10  PA905-GUI-LOD-ID                PIC  9(10).              00260000
002700     10  PA905-LY-GUI-LOD-ID             PIC  9(10).              00270000
002700     10  PA905-LY-CLR-EVNT-ID            PIC  9(10).              00271000
002800     10  PA905-CLR-EVNT-STATUS-IND       PIC  X(01).              00280000
002900         88  PA905-CLR-EVNT-ACTIVE       VALUE 'A'.               00290000
003000         88  PA905-CLR-EVNT-INACTIVE     VALUE 'I'.               00300000
003100*********************  END COPYBOOK  *****************************00310000
