*          DATA SET PCKM112    AT LEVEL 004 AS OF 11/15/95                      
*          DATA SET PCKM112    AT LEVEL 002 AS OF 07/12/95              00001   
*          DATA SET PCKM112    AT LEVEL 012 AS OF 06/20/94              00002   
*          DATA SET PCKM112    AT LEVEL 004 AS OF 04/22/94              00003   
*          DATA SET PCKM112    AT LEVEL 001 AS OF 09/30/93              00004   
*          DATA SET PCKM112    AT LEVEL 001 AS OF 04/28/93              00005   
*          DATA SET PCKM112    AT LEVEL 011 AS OF 03/24/93              00006   
  PRINT  NOGEN                                                          00007   
*-------------------------------------------------------------------*   00008   
*                                                                   *   00009   
*        MAPSET  PCKM112                                            *   00010   
*        MAP     PC112A                                             *   00011   
*        PROGRAM PCKCS112                                           *   00012   
*        TRANSID E112                                               *   00013   
*        SYSTEM  CICS ARCHITECTURE - CARTON LABELS                  *   00014   
*                                                                   *   00015   
*-------------------------------------------------------------------*   00016   
PCKM112 DFHMSD TYPE=DSECT,                                             X00017   
               LANG=COBOL,                                             X00018   
               MODE=INOUT,                                             X00019   
               STORAGE=AUTO,                                           X00020   
               TIOAPFX=YES,                                            X00021   
               TERM=3270-2                                              00022   
PC112A  DFHMDI LINE=2,COLUMN=1,                                        X00023   
               SIZE=(19,80),                                           X00024   
               CTRL=(FREEKB),                                          X00025   
               MAPATTS=(COLOR,HILIGHT),                                X00026   
               DSATTS=(COLOR,HILIGHT)                                   00027   
*                                                                       00028   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00029   
               INITIAL='OPERATING UNIT...........:',                   X00030**3
               LENGTH=26,                                              X00031**3
               POS=(02,15)                                              00032**3
AOPUNIT DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033   
               LENGTH=4,                                               X00034   
               COLOR=GREEN,                                            X00035   
               HILIGHT=UNDERLINE,                                      X00036   
               POS=(02,42)                                              00037   
AOPDESC DFHMDF ATTRB=(ASKIP),                                          X00038   
               LENGTH=24,                                              X00039   
               COLOR=BLUE,                                             X00040   
               POS=(02,47)                                              00041   
*                                                                       00042   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00043   
               INITIAL='FACILITY.................:',                   X00044**3
               LENGTH=26,                                              X00045**3
               POS=(03,15)                                              00046**3
AFACIL  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00047   
               LENGTH=4,                                               X00048   
               COLOR=GREEN,                                            X00049   
               HILIGHT=UNDERLINE,                                      X00050   
               POS=(03,42)                                              00051   
AFACDES DFHMDF ATTRB=(ASKIP),                                          X00052   
               LENGTH=24,                                              X00053   
               COLOR=BLUE,                                             X00054   
               POS=(03,47)                                              00055   
*                                                                       00056   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00057   
               INITIAL='PRINTER NUMBER...........:',                   X00058**3
               LENGTH=26,                                              X00059**3
               POS=(04,15)                                              00060**3
APRTR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00061   
               LENGTH=3,                                               X00062   
               COLOR=GREEN,                                            X00063   
               HILIGHT=UNDERLINE,                                      X00064   
               POS=(04,42)                                              00065**4
APRDESC DFHMDF ATTRB=(ASKIP),                                          X00066   
               LENGTH=25,                                              X00067   
               COLOR=BLUE,                                             X00068   
               POS=(04,46)                                              00069**4
*                                                                       00070   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00071   
               INITIAL='PO NUMBER................:',                   X00072**3
               LENGTH=26,                                              X00073**3
               POS=(05,15)                                              00074**3
APO     DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00075   
               LENGTH=8,                                               X00076   
               COLOR=GREEN,                                            X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               POS=(05,42)                                              00079   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00080   
               INITIAL=' ',                                            X00081   
               LENGTH=1,                                               X00082   
               POS=(05,51)                                              00083   
*                                                                       00084   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00085   
               INITIAL='RECEIVER SEQUENCE NO.....:',                   X00086**3
               LENGTH=26,                                              X00087**3
               POS=(06,15)                                              00088**3
ASEQ    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00089   
               LENGTH=3,                                               X00090   
               COLOR=GREEN,                                            X00091   
               HILIGHT=UNDERLINE,                                      X00092   
               POS=(06,42)                                              00093   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00094   
               INITIAL=' ',                                            X00095   
               LENGTH=1,                                               X00096   
               POS=(06,46)                                              00097   
*                                                                       00098   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00099   
               INITIAL='PROCESS AREA.............:',                   X00100**3
               LENGTH=26,                                              X00101**3
               POS=(07,15)                                              00102**3
AAREA   DFHMDF ATTRB=(UNPROT,NORM),                                    X00103   
               LENGTH=6,                                               X00104   
               COLOR=GREEN,                                            X00105   
               HILIGHT=UNDERLINE,                                      X00106   
               POS=(07,42)                                              00107   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00108   
               INITIAL=' ',                                            X00109   
               LENGTH=1,                                               X00110   
               POS=(07,49)                                              00111   
*                                                                       00112   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00113   
               INITIAL='OF TOTAL NUMBER..........:',                   X00114**3
               LENGTH=26,                                              X00115**3
               POS=(08,15)                                              00116**3
ACRTN   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00117   
               LENGTH=4,                                               X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE,                                      X00120   
               POS=(08,42)                                              00121   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00122   
               INITIAL=' ',                                            X00123   
               LENGTH=1,                                               X00124   
               POS=(08,47)                                              00125   
*                                                                       00126   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00127   
               INITIAL='RECEIVED DATE............:',                   X00128**3
               LENGTH=26,                                              X00129**3
               POS=(09,15)                                              00130**3
ARCVDMM DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00131   
               LENGTH=2,                                               X00132   
               COLOR=GREEN,                                            X00133   
               HILIGHT=UNDERLINE,                                      X00134   
               POS=(09,42)                                              00135   
ARCVDDD DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00136   
               LENGTH=2,                                               X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X00139   
               POS=(09,45)                                              00140   
ARCVDYY DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00141   
               LENGTH=2,                                               X00142   
               COLOR=GREEN,                                            X00143   
               HILIGHT=UNDERLINE,                                      X00144   
               POS=(09,48)                                              00145   
ARCVDES DFHMDF ATTRB=(ASKIP,BRT),                                      X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=7,                                               X00148   
               POS=(09,51)                                              00149   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1,                                               X00152   
               POS=(09,59)                                              00153   
*                                                                       00154   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00155   
               INITIAL='VENDOR NAME..............:',                   X00156**3
               LENGTH=26,                                              X00157**3
               POS=(10,15)                                              00158**3
AVNDR   DFHMDF ATTRB=(UNPROT,NORM),                                    X00159   
               LENGTH=25,                                              X00160   
               COLOR=GREEN,                                            X00161   
               HILIGHT=UNDERLINE,                                      X00162   
               POS=(10,42)                                              00163   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00164   
               INITIAL=' ',                                            X00165   
               LENGTH=1,                                               X00166   
               POS=(10,68)                                              00167   
*                                                                       00168   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00169   
               INITIAL='AD DATE..................:',                   X00170**3
               LENGTH=26,                                              X00171**3
               POS=(11,15)                                              00172**3
AADMM   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00173   
               LENGTH=2,                                               X00174   
               COLOR=GREEN,                                            X00175   
               HILIGHT=UNDERLINE,                                      X00176   
               POS=(11,42)                                              00177   
AADDD   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00178   
               LENGTH=2,                                               X00179   
               COLOR=GREEN,                                            X00180   
               HILIGHT=UNDERLINE,                                      X00181   
               POS=(11,45)                                              00182   
AADYY   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00183   
               LENGTH=2,                                               X00184   
               COLOR=GREEN,                                            X00185   
               HILIGHT=UNDERLINE,                                      X00186   
               POS=(11,48)                                              00187   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00188   
               INITIAL=' ',                                            X00189   
               LENGTH=1,                                               X00190   
               POS=(11,51)                                              00191   
*                                                                       00192   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00193   
               INITIAL='PICTURED INFORMATION.....:',                   X00194**3
               LENGTH=26,                                              X00195**3
               POS=(12,15)                                              00196**3
APIC    DFHMDF ATTRB=(UNPROT,NORM),                                    X00197   
               LENGTH=8,                                               X00198   
               COLOR=GREEN,                                            X00199   
               HILIGHT=UNDERLINE,                                      X00200   
               POS=(12,42)                                              00201   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00202   
               INITIAL=' ',                                            X00203   
               LENGTH=1,                                               X00204   
               POS=(12,51)                                              00205   
*                                                                       00206   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00207   
               INITIAL='SPECIAL INSTRUCTIONS.....:',                   X00208**3
               LENGTH=26,                                              X00209**3
               POS=(13,15)                                              00210**3
ASPCL   DFHMDF ATTRB=(UNPROT,NORM),                                    X00211   
               LENGTH=25,                                              X00212   
               COLOR=GREEN,                                            X00213   
               HILIGHT=UNDERLINE,                                      X00214   
               POS=(13,42)                                              00215   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00216   
               INITIAL=' ',                                            X00217   
               LENGTH=1,                                               X00218   
               POS=(13,68)                                              00219   
*                                                                       00220   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00221   
               INITIAL='MULTIPLE SHIPMENTS? (Y/N):',                   X00222   
               LENGTH=26,                                              X00223   
               POS=(14,15)                                              00224   
AMSHIP  DFHMDF ATTRB=(UNPROT,NORM),                                    X00225   
               LENGTH=1,                                               X00226   
               COLOR=GREEN,                                            X00227   
               HILIGHT=UNDERLINE,                                      X00228   
               POS=(14,42)                                              00229   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00230   
               INITIAL=' ',                                            X00231   
               LENGTH=1,                                               X00232   
               POS=(14,44)                                              00233   
*                                                                       00234   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00235   
               INITIAL='PRE TICKETED? (Y/N)......:',                   X00236**3
               LENGTH=26,                                              X00237**3
               POS=(15,15)                                              00238**3
APRETKT DFHMDF ATTRB=(UNPROT,NORM),                                    X00239   
               LENGTH=1,                                               X00240   
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X00242   
               POS=(15,42)                                              00243   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00244   
               INITIAL=' ',                                            X00245   
               LENGTH=1,                                               X00246   
               POS=(15,44)                                              00247   
*                                                                       00248   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00249   
               INITIAL='PACKED BY STORE? (Y/N)...:',                   X00250**3
               LENGTH=26,                                              X00251**3
               POS=(16,15)                                              00252**3
APACK   DFHMDF ATTRB=(UNPROT,NORM),                                    X00253   
               LENGTH=1,                                               X00254   
               COLOR=GREEN,                                            X00255   
               HILIGHT=UNDERLINE,                                      X00256   
               POS=(16,42)                                              00257   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00258   
               INITIAL=' ',                                            X00259   
               LENGTH=1,                                               X00260   
               POS=(16,44)                                              00261   
*                                                                       00262   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00263   
               INITIAL='DETAIL CHECK? (Y/N)......:',                   X00264**3
               LENGTH=26,                                              X00265**3
               POS=(17,15)                                              00266**3
ADTL    DFHMDF ATTRB=(UNPROT,NORM),                                    X00267   
               LENGTH=1,                                               X00268   
               COLOR=GREEN,                                            X00269   
               HILIGHT=UNDERLINE,                                      X00270   
               POS=(17,42)                                              00271   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00272   
               INITIAL=' ',                                            X00273   
               LENGTH=1,                                               X00274   
               POS=(17,44)                                              00275   
*                                                                       00276   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00263   
               INITIAL='GARMENT ON HANGER? (Y/N).:',                   X00264**3
               LENGTH=26,                                              X00265**3
               POS=(18,15)                                              00266**3
AHANGR  DFHMDF ATTRB=(UNPROT,NORM),                                    X00267   
               LENGTH=1,                                               X00268   
               COLOR=GREEN,                                            X00269   
               HILIGHT=UNDERLINE,                                      X00270   
               POS=(18,42)                                              00271   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00272   
               INITIAL=' ',                                            X00273   
               LENGTH=1,                                               X00274   
               POS=(18,44)                                              00275   
*                                                                       00276   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00277   
               INITIAL='TICKET TYPE..............:',                   X00278**3
               LENGTH=26,                                              X00279**3
               POS=(19,15)                                              00280**3
ATKT    DFHMDF ATTRB=(UNPROT,NORM),                                    X00281   
               LENGTH=6,                                               X00282   
               COLOR=GREEN,                                            X00283   
               HILIGHT=UNDERLINE,                                      X00284   
               POS=(19,42)                                              00285   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00286   
               INITIAL=' ',                                            X00287   
               LENGTH=1,                                               X00288   
               POS=(19,49)                                              00289   
*                                                                       00290   
        DFHMSD TYPE=FINAL                                               00291   
        END                                                             00292   
