*          DATA SET PCKM136    AT LEVEL 004 AS OF 04/09/94                      
*          DATA SET PCKM136    AT LEVEL 012 AS OF 01/26/94              00001   
*          DATA SET PCKM136    AT LEVEL 002 AS OF 08/13/92              00002   
        PRINT  NOGEN                                                    00003   
PCKM136 DFHMSD TYPE=DSECT,                                             C00004   
               LANG=COBOL,                                             C00005   
               MODE=INOUT,                                             C00006   
               STORAGE=AUTO,                                           C00007   
               TERM=3270-2,                                            C00008   
               TIOAPFX=YES                                              00009   
**************                                                          00010   
PC136A  DFHMDI LINE=2,COLUMN=1,                                        C00011   
               SIZE=(19,80),                                           C00012   
               CTRL=(FREEKB),                                          C00013   
               MAPATTS=(COLOR,HILIGHT),                                C00014   
               DSATTS=(COLOR,HILIGHT)                                   00015   
**************                                                          00016   
AOPERID DFHMDF POS=(01,01),LENGTH=04,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=BLUE,                                             C00018   
               PICOUT='ZZZ9'                                            00019   
AFCLTYI DFHMDF POS=(01,06),LENGTH=04,ATTRB=(ASKIP,NORM),               C00020   
               COLOR=BLUE,                                             C00021   
               PICOUT='ZZZ9'                                            00022   
*                                                                       00023   
        DFHMDF POS=(02,14),LENGTH=19,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,                                          C00025   
               INITIAL='FACILITY /OPERATION'                            00026   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00027   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00028   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00029   
               COLOR=GREEN,                                            C00030   
               HILIGHT=UNDERLINE,                                      C00031   
               PICOUT='ZZZZ9'                                           00032   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00033   
               COLOR=NEUTRAL,                                          C00034   
               INITIAL='TO'                                             00035   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00036   
               COLOR=BLUE,                                             C00037   
               PICOUT='ZZZZ9'                                           00038   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00039   
               COLOR=NEUTRAL,                                          C00040   
               INITIAL='OF'                                             00041   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00042   
               COLOR=BLUE,                                             C00043   
               PICOUT='ZZZZ9'                                           00044   
*                                                                       00045   
        DFHMDF POS=(03,01),LENGTH=03,ATTRB=(PROT,NORM),                C00046   
               COLOR=NEUTRAL,                                          C00047   
               INITIAL='SEL'                                            00048   
        DFHMDF POS=(03,06),LENGTH=03,ATTRB=(PROT,NORM),                C00049   
               COLOR=NEUTRAL,                                          C00050   
               INITIAL='ACT'                                            00051   
        DFHMDF POS=(03,12),LENGTH=23,ATTRB=(PROT,NORM),                C00052   
               COLOR=NEUTRAL,                                          C00053   
               INITIAL='INSTRUCTION DESCRIPTION'                        00054   
        DFHMDF POS=(03,48),LENGTH=18,ATTRB=(PROT,NORM),                C00055**2
               COLOR=NEUTRAL,                                          C00056   
               INITIAL='PROC FCLTY AREA ID'                             00057   
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                C00058   
               COLOR=NEUTRAL,                                          C00059   
               INITIAL='---'                                            00060   
        DFHMDF POS=(04,06),LENGTH=03,ATTRB=(PROT,NORM),                C00061   
               COLOR=NEUTRAL,                                          C00062   
               INITIAL='---'                                            00063   
        DFHMDF POS=(04,12),LENGTH=23,ATTRB=(PROT,NORM),                C00064   
               COLOR=NEUTRAL,                                          C00065   
               INITIAL='-----------------------'                        00066   
        DFHMDF POS=(04,48),LENGTH=18,ATTRB=(PROT,NORM),                C00067**2
               COLOR=NEUTRAL,                                          C00068   
               INITIAL='------------------'                             00069   
*                                                                       00070   
ASEL01  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00071   
               HILIGHT=UNDERLINE,                                      C00072   
               COLOR=GREEN                                              00073   
        DFHMDF POS=(05,04),LENGTH=01,ATTRB=(ASKIP)                      00074   
AACT01  DFHMDF POS=(05,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00075   
               COLOR=BLUE                                               00076   
AODES01 DFHMDF POS=(05,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00077   
               COLOR=BLUE                                               00078   
APFID01 DFHMDF POS=(05,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00079**4
               COLOR=BLUE                                               00080   
*                                                                       00081   
ASEL02  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00082   
               HILIGHT=UNDERLINE,                                      C00083   
               COLOR=GREEN                                              00084   
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00085   
AACT02  DFHMDF POS=(06,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00086   
               COLOR=BLUE                                               00087   
AODES02 DFHMDF POS=(06,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00088   
               COLOR=BLUE                                               00089   
APFID02 DFHMDF POS=(06,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00090**4
               COLOR=BLUE                                               00091   
*                                                                       00092   
ASEL03  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00093   
               HILIGHT=UNDERLINE,                                      C00094   
               COLOR=GREEN                                              00095   
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00096   
AACT03  DFHMDF POS=(07,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00097   
               COLOR=BLUE                                               00098   
AODES03 DFHMDF POS=(07,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
APFID03 DFHMDF POS=(07,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00101**4
               COLOR=BLUE                                               00102   
*                                                                       00103   
ASEL04  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00104   
               HILIGHT=UNDERLINE,                                      C00105   
               COLOR=GREEN                                              00106   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00107   
AACT04  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00108   
               COLOR=BLUE                                               00109   
AODES04 DFHMDF POS=(08,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00110   
               COLOR=BLUE                                               00111   
APFID04 DFHMDF POS=(08,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00112**4
               COLOR=BLUE                                               00113   
*                                                                       00114   
ASEL05  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00115   
               HILIGHT=UNDERLINE,                                      C00116   
               COLOR=GREEN                                              00117   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00118   
AACT05  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00119   
               COLOR=BLUE                                               00120   
AODES05 DFHMDF POS=(09,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00121   
               COLOR=BLUE                                               00122   
APFID05 DFHMDF POS=(09,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00123**4
               COLOR=BLUE                                               00124   
*                                                                       00125   
ASEL06  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00126   
               HILIGHT=UNDERLINE,                                      C00127   
               COLOR=GREEN                                              00128   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00129   
AACT06  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00130   
               COLOR=BLUE                                               00131   
AODES06 DFHMDF POS=(10,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00132   
               COLOR=BLUE                                               00133   
APFID06 DFHMDF POS=(10,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00134**4
               COLOR=BLUE                                               00135   
*                                                                       00136   
ASEL07  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00137   
               HILIGHT=UNDERLINE,                                      C00138   
               COLOR=GREEN                                              00139   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00140   
AACT07  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00141   
               COLOR=BLUE                                               00142   
AODES07 DFHMDF POS=(11,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00143   
               COLOR=BLUE                                               00144   
APFID07 DFHMDF POS=(11,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00145**4
               COLOR=BLUE                                               00146   
*                                                                       00147   
ASEL08  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00148   
               HILIGHT=UNDERLINE,                                      C00149   
               COLOR=GREEN                                              00150   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00151   
AACT08  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00152   
               COLOR=BLUE                                               00153   
AODES08 DFHMDF POS=(12,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00154   
               COLOR=BLUE                                               00155   
APFID08 DFHMDF POS=(12,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00156**4
               COLOR=BLUE                                               00157   
*                                                                       00158   
ASEL09  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00159   
               HILIGHT=UNDERLINE,                                      C00160   
               COLOR=GREEN                                              00161   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00162   
AACT09  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00163   
               COLOR=BLUE                                               00164   
AODES09 DFHMDF POS=(13,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00165   
               COLOR=BLUE                                               00166   
APFID09 DFHMDF POS=(13,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00167**4
               COLOR=BLUE                                               00168   
*                                                                       00169   
ASEL10  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00170   
               HILIGHT=UNDERLINE,                                      C00171   
               COLOR=GREEN                                              00172   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00173   
AACT10  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00174   
               COLOR=BLUE                                               00175   
AODES10 DFHMDF POS=(14,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00176   
               COLOR=BLUE                                               00177   
APFID10 DFHMDF POS=(14,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00178**4
               COLOR=BLUE                                               00179   
*                                                                       00180   
ASEL11  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00181   
               HILIGHT=UNDERLINE,                                      C00182   
               COLOR=GREEN                                              00183   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00184   
AACT11  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00185   
               COLOR=BLUE                                               00186   
AODES11 DFHMDF POS=(15,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00187   
               COLOR=BLUE                                               00188   
APFID11 DFHMDF POS=(15,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00189**4
               COLOR=BLUE                                               00190   
*                                                                       00191   
ASEL12  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00192   
               HILIGHT=UNDERLINE,                                      C00193   
               COLOR=GREEN                                              00194   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00195   
AACT12  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00196   
               COLOR=BLUE                                               00197   
AODES12 DFHMDF POS=(16,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00198   
               COLOR=BLUE                                               00199   
APFID12 DFHMDF POS=(16,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00200**4
               COLOR=BLUE                                               00201   
*                                                                       00202   
ASEL13  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00203   
               HILIGHT=UNDERLINE,                                      C00204   
               COLOR=GREEN                                              00205   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00206   
AACT13  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00207   
               COLOR=BLUE                                               00208   
AODES13 DFHMDF POS=(17,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00209   
               COLOR=BLUE                                               00210   
APFID13 DFHMDF POS=(17,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00211**4
               COLOR=BLUE                                               00212   
*                                                                       00213   
ASEL14  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00214   
               HILIGHT=UNDERLINE,                                      C00215   
               COLOR=GREEN                                              00216   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00217   
AACT14  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00218   
               COLOR=BLUE                                               00219   
AODES14 DFHMDF POS=(18,12),LENGTH=35,ATTRB=(ASKIP,NORM),               C00220   
               COLOR=BLUE                                               00221   
APFID14 DFHMDF POS=(18,48),LENGTH=06,ATTRB=(ASKIP,NORM),               C00222**4
               COLOR=BLUE                                               00223   
*                                                                       00224   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00225   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00226   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00227   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00228   
*                                                                       00229   
**************                                                          00230   
        DFHMSD TYPE=FINAL                                               00231   
**************                                                          00232   
        END                                                             00233   
