*          DATA SET PCKM901                                             00010002
PCKM901  DFHMSD TYPE=MAP,                                              X00020002
               LANG=COBOL,                                             X00030002
               MODE=INOUT,                                             X00040002
               TIOAPFX=YES,                                            X00050002
               CTRL=FREEKB                                              00060002
*                                                                       00070002
PC901A   DFHMDI SIZE=(16,23),                                          X00080002
               LINE=1,                                                 X00090002
               COLUMN=1,                                               X00100002
               MAPATTS=HILIGHT,                                        X00110002
               DSATTS=HILIGHT                                           00120002
*                                                                       00130002
ABARCODE DFHMDF POS=(01,01),                                           X00140002
               LENGTH=020,                                             X00150002
               ATTRB=(UNPROT,NORM)                                      00160002
*                                                                       00170002
         DFHMDF POS=(01,22),                                           X00180002
               LENGTH=001,                                             X00190002
               ATTRB=(ASKIP)                                            00200002
*                                                                       00210002
         DFHMDF POS=(02,01),                                           X00220002
               LENGTH=003,                                             X00230002
               ATTRB=(ASKIP,NORM),                                     X00240002
               INITIAL='PO:'                                            00250002
*                                                                       00260002
APONBR   DFHMDF POS=(02,05),                                           X00270002
               LENGTH=008,                                             X00280002
               ATTRB=(UNPROT,NORM)                                      00290002
*                                                                       00300002
         DFHMDF POS=(02,14),                                           X00310002
               LENGTH=001,                                             X00320002
               ATTRB=(ASKIP,NORM),                                     X00330002
               INITIAL='-'                                              00340002
*                                                                       00350002
ARCVR    DFHMDF POS=(02,16),                                           X00360002
               LENGTH=004,                                             X00370002
               ATTRB=(UNPROT,NORM)                                      00380002
*                                                                       00390002
         DFHMDF POS=(02,21),                                           X00400002
               LENGTH=001,                                             X00410002
               ATTRB=(ASKIP)                                            00420002
*                                                                       00430002
         DFHMDF POS=(03,01),                                           X00440002
               LENGTH=006,                                             X00450002
               ATTRB=(ASKIP,NORM),                                     X00460002
               INITIAL='CRTNS:'                                         00470002
*                                                                       00480002
ACRTNS   DFHMDF POS=(03,08),                                           X00490002
               LENGTH=006,                                             X00500002
               ATTRB=(ASKIP,NORM)                                       00510002
*                                                                       00520002
         DFHMDF POS=(04,01),                                           X00530002
               LENGTH=006,                                             X00540002
               ATTRB=(ASKIP,NORM),                                     X00550002
               INITIAL='UNITS:'                                         00560002
*                                                                       00570002
AUNITS   DFHMDF POS=(04,08),                                           X00580002
               LENGTH=006,                                             X00590002
               ATTRB=(ASKIP,NORM)                                       00600002
                                                                        00610002
ADIRLOC  DFHMDF POS=(04,15),                                           X00620002
               LENGTH=005,                                             X00630002
               ATTRB=(ASKIP,NORM)                                       00640002
*                                                                       00650002
         DFHMDF POS=(05,01),                                           X00660002
               LENGTH=004,                                             X00670002
               ATTRB=(ASKIP,NORM),                                     X00680002
               INITIAL='LOC:'                                           00690002
*                                                                       00700002
ALOC     DFHMDF POS=(05,08),                                           X00710002
               LENGTH=005,                                             X00720002
               ATTRB=(ASKIP,NORM)                                       00730002
*                                                                       00740002
ANEWLOC  DFHMDF POS=(05,14),                                           X00750002
               LENGTH=005,                                             X00760002
               ATTRB=(UNPROT,NORM)                                      00770002
*                                                                       00780002
         DFHMDF POS=(05,20),                                           X00790002
               LENGTH=001,                                             X00800002
               ATTRB=(ASKIP,NORM)                                       00810002
*                                                                       00820002
         DFHMDF POS=(06,01),                                           X00830002
               LENGTH=006,                                             X00840002
               ATTRB=(ASKIP,NORM),                                     X00850002
               INITIAL='OPSET:'                                         00860002
*                                                                       00870002
AOPERSET DFHMDF POS=(06,08),                                           X00880002
               LENGTH=003,                                             X00890002
               ATTRB=(ASKIP,NORM)                                       00900002
*                                                                       00910002
ANEWOPST DFHMDF POS=(06,14),                                           X00920002
               LENGTH=003,                                             X00930002
               ATTRB=(UNPROT,NORM)                                      00940002
*                                                                       00950002
         DFHMDF POS=(06,18),                                           X00960002
               LENGTH=001,                                             X00970002
               ATTRB=(ASKIP,NORM)                                       00980002
*                                                                       00990002
AOPSTDS  DFHMDF POS=(07,01),                                           X01000002
               LENGTH=020,                                             X01010002
               ATTRB=(ASKIP,NORM)                                       01020002
*                                                                       01030002
         DFHMDF POS=(08,01),                                           X01040002
               LENGTH=009,                                             X01050002
               ATTRB=(ASKIP,NORM),                                     X01060002
               INITIAL='NEW STR.:'                                      01070002
*                                                                       01080002
ANEWSTR  DFHMDF POS=(08,11),                                           X01090002
               LENGTH=001,                                             X01100002
               ATTRB=(ASKIP,NORM)                                       01110002
*                                                                       01120002
RFIDCTN  DFHMDF POS=(08,13),                                           X01130002
               LENGTH=009,                                             X01140005
               ATTRB=(ASKIP,NORM)                                       01150002
*                                                                       01160002
         DFHMDF POS=(09,01),                                           X01170002
               LENGTH=011,                                             X01180002
               ATTRB=(ASKIP,NORM),                                     X01190002
               INITIAL='PICTURE AD:'                                    01200002
*                                                                       01210002
APICTAD  DFHMDF POS=(09,13),                                           X01220002
               LENGTH=001,                                             X01230002
               ATTRB=(ASKIP,NORM)                                       01240002
*                                                                       01250002
         DFHMDF POS=(10,01),                                           X01260002
               LENGTH=011,                                             X01270002
               ATTRB=(ASKIP,NORM),                                     X01280002
               INITIAL='SEASON SET:'                                    01290002
*                                                                       01300002
ASEASET  DFHMDF POS=(10,13),                                           X01310002
               LENGTH=005,                                             X01320002
               ATTRB=(ASKIP,NORM)                                       01330002
*                                                                       01340002
         DFHMDF POS=(11,01),                                           X01350002
               LENGTH=005,                                             X01360002
               ATTRB=(ASKIP,NORM),                                     X01370002
               INITIAL='TRBL:'                                          01380002
*                                                                       01390002
ATRBL    DFHMDF POS=(11,07),                                           X01400002
               LENGTH=010,                                             X01410002
               ATTRB=(ASKIP,NORM)                                       01420002
*                                                                       01430002
ASMLCDE  DFHMDF POS=(12,01),                                           X01440002
               LENGTH=022,                                             X01450002
               ATTRB=(ASKIP,NORM)                                       01460002
*                                                                       01470002
AMSGLN1  DFHMDF POS=(13,01),                                           X01480002
               LENGTH=019,                                             X01490002
               ATTRB=(ASKIP,NORM)                                       01500002
*                                                                       01510002
AMSGLN2  DFHMDF POS=(14,01),                                           X01520002
               LENGTH=019,                                             X01530002
               ATTRB=(ASKIP,NORM)                                       01540002
         DFHMSD TYPE=FINAL                                              01550002
         END                                                            01560002
