*          DATA SET PCKM171    AT LEVEL 001 AS OF 12/05/95                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  PCKM171                                            *   00004   
*        MAP     PC171A                                             *   00005   
*        PROGRAM PCKCS171                                           *   00006   
*        TRANSID E171 - MOPS CRITERIA SPEC                          *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
PCKM171 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
PC171A  DFHMDI LINE=2,COLUMN=1,                                        X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028   
               INITIAL='OPERATING ID..........:',                      X00029   
               LENGTH=23,                                              X00030   
               COLOR=NEUTRAL,                                          X00031   
               POS=(06,18)                                              00032   
AOPER   DFHMDF ATTRB=(ASKIP),                                          X00033   
               LENGTH=4,                                               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZ9',                                          X00036   
               POS=(06,42)                                              00037   
AOPNAME DFHMDF ATTRB=(ASKIP),                                          X00038   
               LENGTH=25,                                              X00039   
               COLOR=BLUE,                                             X00040   
               POS=(06,47)                                              00041   
*                                                                       00042   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00043   
               INITIAL='FACILITY ID...........:',                      X00044   
               LENGTH=23,                                              X00045   
               COLOR=NEUTRAL,                                          X00046   
               POS=(07,18)                                              00047   
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00048   
               LENGTH=4,                                               X00049   
               COLOR=BLUE,                                             X00050   
               PICOUT='ZZZ9',                                          X00051   
               POS=(07,42)                                              00052   
*                                                                       00053   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00054   
               INITIAL='P.O. NUMBER...........:',                      X00055   
               LENGTH=23,                                              X00056   
               COLOR=NEUTRAL,                                          X00057   
               POS=(08,18)                                              00058   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00059   
               LENGTH=8,                                               X00060   
               COLOR=BLUE,                                             X00061   
               PICOUT='9(8)',                                          X00062   
               POS=(08,42)                                              00063   
*                                                                       00064   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00065   
               INITIAL='RECEIVER SEQUENCE NBR.:',                      X00066   
               LENGTH=23,                                              X00067   
               COLOR=NEUTRAL,                                          X00068   
               POS=(09,18)                                              00069   
ARCNBR  DFHMDF ATTRB=(ASKIP),                                          X00070   
               LENGTH=3,                                               X00071   
               COLOR=BLUE,                                             X00072   
               PICOUT='9(3)',                                          X00073   
               POS=(09,42)                                              00074   
*                                                                       00075   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00076   
               INITIAL='LINE NUMBER...........:',                      X00077   
               LENGTH=23,                                              X00078   
               COLOR=NEUTRAL,                                          X00079   
               POS=(10,18)                                              00080   
APOLNBR DFHMDF ATTRB=(ASKIP),                                          X00081   
               LENGTH=3,                                               X00082   
               COLOR=BLUE,                                             X00083   
               PICOUT='9(3)',                                          X00084   
               POS=(10,42)                                              00085   
*                                                                       00086   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00087   
               INITIAL='MASTER PURCHASE ORDER.:',                      X00088   
               LENGTH=23,                                              X00089   
               COLOR=NEUTRAL,                                          X00090   
               POS=(11,18)                                              00091   
AMASTPO DFHMDF ATTRB=(UNPROT,NORM),                                    X00092   
               LENGTH=1,                                               X00093   
               COLOR=GREEN,                                            X00094   
               HILIGHT=UNDERLINE,                                      X00095   
               POS=(11,42)                                              00096   
        DFHMDF ATTRB=(ASKIP),                                          X00097   
               LENGTH=1,                                               X00098   
               COLOR=NEUTRAL,                                          X00099   
               POS=(11,44)                                              00100   
*                                                                       00101   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00117   
               INITIAL='MERCHANDISE LOCATION..:',                      X00118   
               LENGTH=23,                                              X00119   
               COLOR=NEUTRAL,                                          X00120   
               POS=(12,18)                                              00121   
AMLOC   DFHMDF ATTRB=(UNPROT,NORM),                                    X00122   
               LENGTH=15,                                              X00123   
               COLOR=GREEN,                                            X00124   
               HILIGHT=UNDERLINE,                                      X00125   
               POS=(12,42)                                              00126   
        DFHMDF ATTRB=(ASKIP),                                          X00127   
               LENGTH=1,                                               X00128   
               COLOR=NEUTRAL,                                          X00129   
               POS=(12,58)                                              00130   
*                                                                       00131   
         DFHMSD TYPE=FINAL                                              00132   
         END                                                            00133   
