        PRINT NOGEN                                                     00001   
PCKM857  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC857A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='INVALID FAST NUMBER'                            00015*29
*                                                                       00011   
AFAST    DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM,FSET)                                  00014*24
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='ENTER TO CONFIRM   '                            00015*29
*                                                                       00016   
         DFHMDF POS=(06,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='  NBR AND PROCEED  '                            00015*29
*                                                                       00016   
         DFHMDF POS=(07,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='OR F3 TO SCAN/KEY  '                            00015*29
*                                                                       00016   
         DFHMDF POS=(08,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='     AGAIN         '                            00015*29
*                                                                       00016   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
