*********************************************************************** 00030001
*          DATA SET PCKM751                                             00040001
  PRINT  NOGEN                                                          00050001
*-------------------------------------------------------------------*   00060001
*                                                                   *   00070001
*        MAPSET  PCKM751                                            *   00080001
*        MAP     PC751A                                             *   00090001
*        PROGRAM PCKCS751                                           *   00100001
*        TRANSID E751 - UNITS WORKED BY PROCESS GROUP LIST          *   00110001
*        SYSTEM  PROCESS CONTROL (PC)                               *   00120001
*                                                                   *   00130001
*-------------------------------------------------------------------*   00140001
PCKM751 DFHMSD TYPE=DSECT,                                             X00150001
               LANG=COBOL,                                             X00160001
               MODE=INOUT,                                             X00170001
               STORAGE=AUTO,                                           X00180001
               TERM=3270-2,                                            X00190001
               TIOAPFX=YES                                              00200001
*********************************************************************** 00210001
PC751A  DFHMDI LINE=2,COLUMN=1,                                        X00220001
               SIZE=(19,80),                                           X00230001
               CTRL=(FREEKB),                                          X00240001
               MAPATTS=(COLOR,HILIGHT),                                X00250001
               DSATTS=(COLOR,HILIGHT)                                   00260001
*********************************************************************** 00270001
        DFHMDF POS=(02,02),                                            X00280001
               LENGTH=11,                                              X00290001
               ATTRB=(ASKIP,NORM),                                     X00300001
               COLOR=NEUTRAL,                                          X00310001
               INITIAL='OPER UNIT.:'                                    00320001
AOPER   DFHMDF POS=(02,14),                                            X00330001
               LENGTH=04,                                              X00340001
               ATTRB=(ASKIP,NORM),                                     X00350001
               COLOR=BLUE                                               00360001
ADESC   DFHMDF POS=(02,19),                                            X00370001
               LENGTH=25,                                              X00380001
               ATTRB=(ASKIP,NORM),                                     X00390001
               COLOR=BLUE                                               00400001
*********************************************************************** 00410001
        DFHMDF POS=(03,02),                                            X00420001
               LENGTH=11,                                              X00430001
               ATTRB=(ASKIP,NORM),                                     X00440001
               COLOR=NEUTRAL,                                          X00450001
               INITIAL='TOTAL OPER:'                                    00460001
        DFHMDF POS=(03,15),                                            X00470001
               LENGTH=04,                                              X00480001
               ATTRB=(ASKIP,NORM),                                     X00490001
               COLOR=NEUTRAL,                                          X00500001
               INITIAL='3RD:'                                           00510001
A3TOTL  DFHMDF POS=(03,20),                                            X00520001
               LENGTH=15,                                              X00530005
               ATTRB=(ASKIP,NORM),                                     X00540001
               COLOR=BLUE                                               00550005
A3PRCT  DFHMDF POS=(03,36),                                            X00570005
               LENGTH=06,                                              X00580001
               ATTRB=(ASKIP,NORM),                                     X00590001
               COLOR=BLUE                                               00600001
        DFHMDF POS=(03,45),                                            X00610005
               LENGTH=04,                                              X00620001
               ATTRB=(ASKIP,NORM),                                     X00630001
               COLOR=NEUTRAL,                                          X00640001
               INITIAL='1ST:'                                           00650001
A1TOTL  DFHMDF POS=(03,50),                                            X00660005
               LENGTH=15,                                              X00670005
               ATTRB=(ASKIP,NORM),                                     X00680001
               COLOR=BLUE                                               00690005
A1PRCT  DFHMDF POS=(03,66),                                            X00710005
               LENGTH=06,                                              X00720001
               ATTRB=(ASKIP,NORM),                                     X00730001
               COLOR=BLUE                                               00740001
        DFHMDF POS=(03,73),                                            X00750005
               LENGTH=01,                                              X00760001
               ATTRB=(ASKIP,DRK)                                        00770001
*********************************************************************** 00780001
        DFHMDF POS=(04,15),                                            X00790001
               LENGTH=04,                                              X00800001
               ATTRB=(ASKIP,NORM),                                     X00810001
               COLOR=NEUTRAL,                                          X00820001
               INITIAL='2ND:'                                           00830001
A2TOTL  DFHMDF POS=(04,20),                                            X00840001
               LENGTH=15,                                              X00850005
               ATTRB=(ASKIP,NORM),                                     X00860001
               COLOR=BLUE                                               00870005
A2PRCT  DFHMDF POS=(04,36),                                            X00890005
               LENGTH=06,                                              X00900001
               ATTRB=(ASKIP,NORM),                                     X00910001
               COLOR=BLUE                                               00920001
        DFHMDF POS=(04,45),                                            X00930005
               LENGTH=04,                                              X00940001
               ATTRB=(ASKIP,NORM),                                     X00950001
               COLOR=NEUTRAL,                                          X00960001
               INITIAL='TOT:'                                           00970001
ATTOTL  DFHMDF POS=(04,50),                                            X00980005
               LENGTH=15,                                              X00990005
               ATTRB=(ASKIP,NORM),                                     X01000001
               COLOR=BLUE                                               01010005
        DFHMDF POS=(04,66),                                            X01030005
               LENGTH=01,                                              X01040001
               ATTRB=(ASKIP,DRK)                                        01050001
*********************************************************************** 01060001
ADATE   DFHMDF POS=(05,02),                                            X01070001
               LENGTH=45,                                              X01080001
               ATTRB=(ASKIP,NORM),                                     X01090001
               COLOR=YELLOW                                             01100001
        DFHMDF POS=(05,49),                                            X01110001
               LENGTH=05,                                              X01120001
               ATTRB=(ASKIP,NORM),                                     X01130001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01140001
ASTRTIT DFHMDF POS=(05,55),                                            X01150001
               LENGTH=05,                                              X01160001
               ATTRB=(NUM,UNPROT,NORM),                                X01170001
               COLOR=GREEN,                                            X01180001
               PICOUT='ZZZZ9',                                         X01190001
               HILIGHT=UNDERLINE                                        01200001
        DFHMDF POS=(05,61),                                            X01210001
               LENGTH=02,                                              X01220001
               ATTRB=(ASKIP,NORM),                                     X01230001
               COLOR=NEUTRAL,                                          X01240001
               INITIAL='TO'                                             01250001
AENDIT  DFHMDF POS=(05,64),                                            X01260001
               LENGTH=05,                                              X01270001
               ATTRB=(ASKIP,NORM),                                     X01280001
               COLOR=BLUE,                                             X01290001
               PICOUT='ZZZZ9'                                           01300001
        DFHMDF POS=(05,70),                                            X01310001
               LENGTH=02,                                              X01320001
               ATTRB=(ASKIP,NORM),                                     X01330001
               COLOR=NEUTRAL,                                          X01340001
               INITIAL='OF'                                             01350001
ATOTIT  DFHMDF POS=(05,73),                                            X01360001
               LENGTH=05,                                              X01370001
               ATTRB=(ASKIP,NORM),                                     X01380001
               COLOR=BLUE,                                             X01390001
               PICOUT='ZZZZ9'                                           01400001
*********************************************************************** 01410001
        DFHMDF POS=(06,19),                                            X01420001
               LENGTH=09,                                              X01430001
               ATTRB=(ASKIP,NORM),                                     X01440001
               COLOR=NEUTRAL,                                          X01450001
               INITIAL='3RD   3RD'                                      01460001
        DFHMDF POS=(06,36),                                            X01470001
               LENGTH=09,                                              X01480001
               ATTRB=(ASKIP,NORM),                                     X01490001
               COLOR=NEUTRAL,                                          X01500001
               INITIAL='1ST   1ST'                                      01510001
        DFHMDF POS=(06,53),                                            X01520001
               LENGTH=09,                                              X01530001
               ATTRB=(ASKIP,NORM),                                     X01540001
               COLOR=NEUTRAL,                                          X01550001
               INITIAL='2ND   2ND'                                      01560001
        DFHMDF POS=(06,68),                                            X01570002
               LENGTH=11,                                              X01580001
               ATTRB=(ASKIP,NORM),                                     X01590001
               COLOR=NEUTRAL,                                          X01600001
               INITIAL='TOTAL  % TO'                                    01610001
*********************************************************************** 01620001
        DFHMDF POS=(07,05),                                            X01630001
               LENGTH=27,                                              X01640001
               ATTRB=(ASKIP,NORM),                                     X01650001
               COLOR=NEUTRAL,                                          X01660001
               INITIAL='PROCESS     SHIFT  % TO'                        01670001
        DFHMDF POS=(07,34),                                            X01680001
               LENGTH=28,                                              X01690001
               ATTRB=(ASKIP,NORM),                                     X01700001
               COLOR=NEUTRAL,                                          X01710001
               INITIAL='SHIFT  % TO      SHIFT  % TO'                   01720001
        DFHMDF POS=(07,68),                                            X01730002
               LENGTH=11,                                              X01740001
               ATTRB=(ASKIP,NORM),                                     X01750001
               COLOR=NEUTRAL,                                          X01760001
               INITIAL='GROUP  OPER'                                    01770001
*********************************************************************** 01780001
        DFHMDF POS=(08,01),                                            X01790001
               LENGTH=10,                                              X01800001
               ATTRB=(ASKIP,NORM),                                     X01810001
               COLOR=NEUTRAL,                                          X01820001
               INITIAL='S    GROUP'                                     01830003
        DFHMDF POS=(08,17),                                            X01840001
               LENGTH=28,                                              X01850001
               ATTRB=(ASKIP,NORM),                                     X01860001
               COLOR=NEUTRAL,                                          X01870001
               INITIAL='UNITS GROUP      UNITS GROUP'                   01880004
        DFHMDF POS=(08,51),                                            X01890001
               LENGTH=29,                                              X01900002
               ATTRB=(ASKIP,NORM),                                     X01910001
               COLOR=NEUTRAL,                                          X01920001
               INITIAL='UNITS GROUP      UNITS  TOTAL'                  01930004
*********************************************************************** 01940001
ASEL01  DFHMDF POS=(09,01),                                            X01950003
               LENGTH=01,                                              X01960001
               ATTRB=(UNPROT,NORM),                                    X01970001
               HILIGHT=UNDERLINE,                                      X01980001
               COLOR=GREEN                                              01990001
        DFHMDF POS=(09,03),                                            X02000003
               LENGTH=01,                                              X02010001
               ATTRB=(ASKIP,DRK)                                        02020001
AGROP01 DFHMDF POS=(09,05),                                            X02030001
               LENGTH=06,                                              X02040001
               ATTRB=(ASKIP,NORM),                                     X02050001
               COLOR=BLUE                                               02060001
A3UNT01 DFHMDF POS=(09,12),                                            X02070001
               LENGTH=10,                                              X02080001
               ATTRB=(ASKIP,NORM),                                     X02090001
               PICOUT='ZZZZZZZZZ9',                                    X02100001
               COLOR=BLUE                                               02110001
A3PCT01 DFHMDF POS=(09,23),                                            X02120001
               LENGTH=05,                                              X02130001
               ATTRB=(ASKIP,NORM),                                     X02140001
               COLOR=BLUE                                               02150001
A1UNT01 DFHMDF POS=(09,29),                                            X02160001
               LENGTH=10,                                              X02170001
               ATTRB=(ASKIP,NORM),                                     X02180001
               PICOUT='ZZZZZZZZZ9',                                    X02190001
               COLOR=BLUE                                               02200001
A1PCT01 DFHMDF POS=(09,40),                                            X02210001
               LENGTH=05,                                              X02220001
               ATTRB=(ASKIP,NORM),                                     X02230001
               COLOR=BLUE                                               02240001
A2UNT01 DFHMDF POS=(09,46),                                            X02250001
               LENGTH=10,                                              X02260001
               ATTRB=(ASKIP,NORM),                                     X02270001
               PICOUT='ZZZZZZZZZ9',                                    X02280001
               COLOR=BLUE                                               02290001
A2PCT01 DFHMDF POS=(09,57),                                            X02300001
               LENGTH=05,                                              X02310001
               ATTRB=(ASKIP,NORM),                                     X02320001
               COLOR=BLUE                                               02330001
ATUNT01 DFHMDF POS=(09,63),                                            X02340001
               LENGTH=11,                                              X02350002
               ATTRB=(ASKIP,NORM),                                     X02360001
               PICOUT='ZZZZZZZZZZ9',                                   X02370002
               COLOR=BLUE                                               02380001
ATPCT01 DFHMDF POS=(09,75),                                            X02390002
               LENGTH=05,                                              X02400001
               ATTRB=(ASKIP,NORM),                                     X02410001
               COLOR=BLUE                                               02420001
*********************************************************************** 02430001
ASEL02  DFHMDF POS=(10,01),                                            X02440003
               LENGTH=01,                                              X02450001
               ATTRB=(UNPROT,NORM),                                    X02460001
               HILIGHT=UNDERLINE,                                      X02470001
               COLOR=GREEN                                              02480001
        DFHMDF POS=(10,03),                                            X02490003
               LENGTH=01,                                              X02500001
               ATTRB=(ASKIP,DRK)                                        02510001
AGROP02 DFHMDF POS=(10,05),                                            X02520001
               LENGTH=06,                                              X02530001
               ATTRB=(ASKIP,NORM),                                     X02540001
               COLOR=BLUE                                               02550001
A3UNT02 DFHMDF POS=(10,12),                                            X02560001
               LENGTH=10,                                              X02570001
               ATTRB=(ASKIP,NORM),                                     X02580001
               PICOUT='ZZZZZZZZZ9',                                    X02590001
               COLOR=BLUE                                               02600001
A3PCT02 DFHMDF POS=(10,23),                                            X02610001
               LENGTH=05,                                              X02620001
               ATTRB=(ASKIP,NORM),                                     X02630001
               COLOR=BLUE                                               02640001
A1UNT02 DFHMDF POS=(10,29),                                            X02650001
               LENGTH=10,                                              X02660001
               ATTRB=(ASKIP,NORM),                                     X02670001
               PICOUT='ZZZZZZZZZ9',                                    X02680001
               COLOR=BLUE                                               02690001
A1PCT02 DFHMDF POS=(10,40),                                            X02700001
               LENGTH=05,                                              X02710001
               ATTRB=(ASKIP,NORM),                                     X02720001
               COLOR=BLUE                                               02730001
A2UNT02 DFHMDF POS=(10,46),                                            X02740001
               LENGTH=10,                                              X02750001
               ATTRB=(ASKIP,NORM),                                     X02760001
               PICOUT='ZZZZZZZZZ9',                                    X02770001
               COLOR=BLUE                                               02780001
A2PCT02 DFHMDF POS=(10,57),                                            X02790001
               LENGTH=05,                                              X02800001
               ATTRB=(ASKIP,NORM),                                     X02810001
               COLOR=BLUE                                               02820001
ATUNT02 DFHMDF POS=(10,63),                                            X02830001
               LENGTH=11,                                              X02840002
               ATTRB=(ASKIP,NORM),                                     X02850001
               PICOUT='ZZZZZZZZZZ9',                                   X02860002
               COLOR=BLUE                                               02870001
ATPCT02 DFHMDF POS=(10,75),                                            X02880002
               LENGTH=05,                                              X02890001
               ATTRB=(ASKIP,NORM),                                     X02900001
               COLOR=BLUE                                               02910001
*********************************************************************** 02920001
ASEL03  DFHMDF POS=(11,01),                                            X02930003
               LENGTH=01,                                              X02940001
               ATTRB=(UNPROT,NORM),                                    X02950001
               HILIGHT=UNDERLINE,                                      X02960001
               COLOR=GREEN                                              02970001
        DFHMDF POS=(11,03),                                            X02980003
               LENGTH=01,                                              X02990001
               ATTRB=(ASKIP,DRK)                                        03000001
AGROP03 DFHMDF POS=(11,05),                                            X03010001
               LENGTH=06,                                              X03020001
               ATTRB=(ASKIP,NORM),                                     X03030001
               COLOR=BLUE                                               03040001
A3UNT03 DFHMDF POS=(11,12),                                            X03050001
               LENGTH=10,                                              X03060001
               ATTRB=(ASKIP,NORM),                                     X03070001
               PICOUT='ZZZZZZZZZ9',                                    X03080001
               COLOR=BLUE                                               03090001
A3PCT03 DFHMDF POS=(11,23),                                            X03100001
               LENGTH=05,                                              X03110001
               ATTRB=(ASKIP,NORM),                                     X03120001
               COLOR=BLUE                                               03130001
A1UNT03 DFHMDF POS=(11,29),                                            X03140001
               LENGTH=10,                                              X03150001
               ATTRB=(ASKIP,NORM),                                     X03160001
               PICOUT='ZZZZZZZZZ9',                                    X03170001
               COLOR=BLUE                                               03180001
A1PCT03 DFHMDF POS=(11,40),                                            X03190001
               LENGTH=05,                                              X03200001
               ATTRB=(ASKIP,NORM),                                     X03210001
               COLOR=BLUE                                               03220001
A2UNT03 DFHMDF POS=(11,46),                                            X03230001
               LENGTH=10,                                              X03240001
               ATTRB=(ASKIP,NORM),                                     X03250001
               PICOUT='ZZZZZZZZZ9',                                    X03260001
               COLOR=BLUE                                               03270001
A2PCT03 DFHMDF POS=(11,57),                                            X03280001
               LENGTH=05,                                              X03290001
               ATTRB=(ASKIP,NORM),                                     X03300001
               COLOR=BLUE                                               03310001
ATUNT03 DFHMDF POS=(11,63),                                            X03320001
               LENGTH=11,                                              X03330002
               ATTRB=(ASKIP,NORM),                                     X03340001
               PICOUT='ZZZZZZZZZZ9',                                   X03350002
               COLOR=BLUE                                               03360001
ATPCT03 DFHMDF POS=(11,75),                                            X03370002
               LENGTH=05,                                              X03380001
               ATTRB=(ASKIP,NORM),                                     X03390001
               COLOR=BLUE                                               03400001
*********************************************************************** 03410001
ASEL04  DFHMDF POS=(12,01),                                            X03420003
               LENGTH=01,                                              X03430001
               ATTRB=(UNPROT,NORM),                                    X03440001
               HILIGHT=UNDERLINE,                                      X03450001
               COLOR=GREEN                                              03460001
        DFHMDF POS=(12,03),                                            X03470003
               LENGTH=01,                                              X03480001
               ATTRB=(ASKIP,DRK)                                        03490001
AGROP04 DFHMDF POS=(12,05),                                            X03500001
               LENGTH=06,                                              X03510001
               ATTRB=(ASKIP,NORM),                                     X03520001
               COLOR=BLUE                                               03530001
A3UNT04 DFHMDF POS=(12,12),                                            X03540001
               LENGTH=10,                                              X03550001
               ATTRB=(ASKIP,NORM),                                     X03560001
               PICOUT='ZZZZZZZZZ9',                                    X03570001
               COLOR=BLUE                                               03580001
A3PCT04 DFHMDF POS=(12,23),                                            X03590001
               LENGTH=05,                                              X03600001
               ATTRB=(ASKIP,NORM),                                     X03610001
               COLOR=BLUE                                               03620001
A1UNT04 DFHMDF POS=(12,29),                                            X03630001
               LENGTH=10,                                              X03640001
               ATTRB=(ASKIP,NORM),                                     X03650001
               PICOUT='ZZZZZZZZZ9',                                    X03660001
               COLOR=BLUE                                               03670001
A1PCT04 DFHMDF POS=(12,40),                                            X03680001
               LENGTH=05,                                              X03690001
               ATTRB=(ASKIP,NORM),                                     X03700001
               COLOR=BLUE                                               03710001
A2UNT04 DFHMDF POS=(12,46),                                            X03720001
               LENGTH=10,                                              X03730001
               ATTRB=(ASKIP,NORM),                                     X03740001
               PICOUT='ZZZZZZZZZ9',                                    X03750001
               COLOR=BLUE                                               03760001
A2PCT04 DFHMDF POS=(12,57),                                            X03770001
               LENGTH=05,                                              X03780001
               ATTRB=(ASKIP,NORM),                                     X03790001
               COLOR=BLUE                                               03800001
ATUNT04 DFHMDF POS=(12,63),                                            X03810001
               LENGTH=11,                                              X03820002
               ATTRB=(ASKIP,NORM),                                     X03830001
               PICOUT='ZZZZZZZZZZ9',                                   X03840002
               COLOR=BLUE                                               03850001
ATPCT04 DFHMDF POS=(12,75),                                            X03860002
               LENGTH=05,                                              X03870001
               ATTRB=(ASKIP,NORM),                                     X03880001
               COLOR=BLUE                                               03890001
*********************************************************************** 03900001
ASEL05  DFHMDF POS=(13,01),                                            X03910003
               LENGTH=01,                                              X03920001
               ATTRB=(UNPROT,NORM),                                    X03930001
               HILIGHT=UNDERLINE,                                      X03940001
               COLOR=GREEN                                              03950001
        DFHMDF POS=(13,03),                                            X03960003
               LENGTH=01,                                              X03970001
               ATTRB=(ASKIP,DRK)                                        03980001
AGROP05 DFHMDF POS=(13,05),                                            X03990001
               LENGTH=06,                                              X04000001
               ATTRB=(ASKIP,NORM),                                     X04010001
               COLOR=BLUE                                               04020001
A3UNT05 DFHMDF POS=(13,12),                                            X04030001
               LENGTH=10,                                              X04040001
               ATTRB=(ASKIP,NORM),                                     X04050001
               PICOUT='ZZZZZZZZZ9',                                    X04060001
               COLOR=BLUE                                               04070001
A3PCT05 DFHMDF POS=(13,23),                                            X04080001
               LENGTH=05,                                              X04090001
               ATTRB=(ASKIP,NORM),                                     X04100001
               COLOR=BLUE                                               04110001
A1UNT05 DFHMDF POS=(13,29),                                            X04120001
               LENGTH=10,                                              X04130001
               ATTRB=(ASKIP,NORM),                                     X04140001
               PICOUT='ZZZZZZZZZ9',                                    X04150001
               COLOR=BLUE                                               04160001
A1PCT05 DFHMDF POS=(13,40),                                            X04170001
               LENGTH=05,                                              X04180001
               ATTRB=(ASKIP,NORM),                                     X04190001
               COLOR=BLUE                                               04200001
A2UNT05 DFHMDF POS=(13,46),                                            X04210001
               LENGTH=10,                                              X04220001
               ATTRB=(ASKIP,NORM),                                     X04230001
               PICOUT='ZZZZZZZZZ9',                                    X04240001
               COLOR=BLUE                                               04250001
A2PCT05 DFHMDF POS=(13,57),                                            X04260001
               LENGTH=05,                                              X04270001
               ATTRB=(ASKIP,NORM),                                     X04280001
               COLOR=BLUE                                               04290001
ATUNT05 DFHMDF POS=(13,63),                                            X04300001
               LENGTH=11,                                              X04310002
               ATTRB=(ASKIP,NORM),                                     X04320001
               PICOUT='ZZZZZZZZZZ9',                                   X04330002
               COLOR=BLUE                                               04340001
ATPCT05 DFHMDF POS=(13,75),                                            X04350002
               LENGTH=05,                                              X04360001
               ATTRB=(ASKIP,NORM),                                     X04370001
               COLOR=BLUE                                               04380001
*********************************************************************** 04390001
ASEL06  DFHMDF POS=(14,01),                                            X04400003
               LENGTH=01,                                              X04410001
               ATTRB=(UNPROT,NORM),                                    X04420001
               HILIGHT=UNDERLINE,                                      X04430001
               COLOR=GREEN                                              04440001
        DFHMDF POS=(14,03),                                            X04450003
               LENGTH=01,                                              X04460001
               ATTRB=(ASKIP,DRK)                                        04470001
AGROP06 DFHMDF POS=(14,05),                                            X04480001
               LENGTH=06,                                              X04490001
               ATTRB=(ASKIP,NORM),                                     X04500001
               COLOR=BLUE                                               04510001
A3UNT06 DFHMDF POS=(14,12),                                            X04520001
               LENGTH=10,                                              X04530001
               ATTRB=(ASKIP,NORM),                                     X04540001
               PICOUT='ZZZZZZZZZ9',                                    X04550001
               COLOR=BLUE                                               04560001
A3PCT06 DFHMDF POS=(14,23),                                            X04570001
               LENGTH=05,                                              X04580001
               ATTRB=(ASKIP,NORM),                                     X04590001
               COLOR=BLUE                                               04600001
A1UNT06 DFHMDF POS=(14,29),                                            X04610001
               LENGTH=10,                                              X04620001
               ATTRB=(ASKIP,NORM),                                     X04630001
               PICOUT='ZZZZZZZZZ9',                                    X04640001
               COLOR=BLUE                                               04650001
A1PCT06 DFHMDF POS=(14,40),                                            X04660001
               LENGTH=05,                                              X04670001
               ATTRB=(ASKIP,NORM),                                     X04680001
               COLOR=BLUE                                               04690001
A2UNT06 DFHMDF POS=(14,46),                                            X04700001
               LENGTH=10,                                              X04710001
               ATTRB=(ASKIP,NORM),                                     X04720001
               PICOUT='ZZZZZZZZZ9',                                    X04730001
               COLOR=BLUE                                               04740001
A2PCT06 DFHMDF POS=(14,57),                                            X04750001
               LENGTH=05,                                              X04760001
               ATTRB=(ASKIP,NORM),                                     X04770001
               COLOR=BLUE                                               04780001
ATUNT06 DFHMDF POS=(14,63),                                            X04790001
               LENGTH=11,                                              X04800002
               ATTRB=(ASKIP,NORM),                                     X04810001
               PICOUT='ZZZZZZZZZZ9',                                   X04820002
               COLOR=BLUE                                               04830001
ATPCT06 DFHMDF POS=(14,75),                                            X04840002
               LENGTH=05,                                              X04850001
               ATTRB=(ASKIP,NORM),                                     X04860001
               COLOR=BLUE                                               04870001
*********************************************************************** 04880001
ASEL07  DFHMDF POS=(15,01),                                            X04890003
               LENGTH=01,                                              X04900001
               ATTRB=(UNPROT,NORM),                                    X04910001
               HILIGHT=UNDERLINE,                                      X04920001
               COLOR=GREEN                                              04930001
        DFHMDF POS=(15,03),                                            X04940003
               LENGTH=01,                                              X04950001
               ATTRB=(ASKIP,DRK)                                        04960001
AGROP07 DFHMDF POS=(15,05),                                            X04970001
               LENGTH=06,                                              X04980001
               ATTRB=(ASKIP,NORM),                                     X04990001
               COLOR=BLUE                                               05000001
A3UNT07 DFHMDF POS=(15,12),                                            X05010001
               LENGTH=10,                                              X05020001
               ATTRB=(ASKIP,NORM),                                     X05030001
               PICOUT='ZZZZZZZZZ9',                                    X05040001
               COLOR=BLUE                                               05050001
A3PCT07 DFHMDF POS=(15,23),                                            X05060001
               LENGTH=05,                                              X05070001
               ATTRB=(ASKIP,NORM),                                     X05080001
               COLOR=BLUE                                               05090001
A1UNT07 DFHMDF POS=(15,29),                                            X05100001
               LENGTH=10,                                              X05110001
               ATTRB=(ASKIP,NORM),                                     X05120001
               PICOUT='ZZZZZZZZZ9',                                    X05130001
               COLOR=BLUE                                               05140001
A1PCT07 DFHMDF POS=(15,40),                                            X05150001
               LENGTH=05,                                              X05160001
               ATTRB=(ASKIP,NORM),                                     X05170001
               COLOR=BLUE                                               05180001
A2UNT07 DFHMDF POS=(15,46),                                            X05190001
               LENGTH=10,                                              X05200001
               ATTRB=(ASKIP,NORM),                                     X05210001
               PICOUT='ZZZZZZZZZ9',                                    X05220001
               COLOR=BLUE                                               05230001
A2PCT07 DFHMDF POS=(15,57),                                            X05240001
               LENGTH=05,                                              X05250001
               ATTRB=(ASKIP,NORM),                                     X05260001
               COLOR=BLUE                                               05270001
ATUNT07 DFHMDF POS=(15,63),                                            X05280001
               LENGTH=11,                                              X05290002
               ATTRB=(ASKIP,NORM),                                     X05300001
               PICOUT='ZZZZZZZZZZ9',                                   X05310002
               COLOR=BLUE                                               05320001
ATPCT07 DFHMDF POS=(15,75),                                            X05330002
               LENGTH=05,                                              X05340001
               ATTRB=(ASKIP,NORM),                                     X05350001
               COLOR=BLUE                                               05360001
*********************************************************************** 05370001
ASEL08  DFHMDF POS=(16,01),                                            X05380003
               LENGTH=01,                                              X05390001
               ATTRB=(UNPROT,NORM),                                    X05400001
               HILIGHT=UNDERLINE,                                      X05410001
               COLOR=GREEN                                              05420001
        DFHMDF POS=(16,03),                                            X05430003
               LENGTH=01,                                              X05440001
               ATTRB=(ASKIP,DRK)                                        05450001
AGROP08 DFHMDF POS=(16,05),                                            X05460001
               LENGTH=06,                                              X05470001
               ATTRB=(ASKIP,NORM),                                     X05480001
               COLOR=BLUE                                               05490001
A3UNT08 DFHMDF POS=(16,12),                                            X05500001
               LENGTH=10,                                              X05510001
               ATTRB=(ASKIP,NORM),                                     X05520001
               PICOUT='ZZZZZZZZZ9',                                    X05530001
               COLOR=BLUE                                               05540001
A3PCT08 DFHMDF POS=(16,23),                                            X05550001
               LENGTH=05,                                              X05560001
               ATTRB=(ASKIP,NORM),                                     X05570001
               COLOR=BLUE                                               05580001
A1UNT08 DFHMDF POS=(16,29),                                            X05590001
               LENGTH=10,                                              X05600001
               ATTRB=(ASKIP,NORM),                                     X05610001
               PICOUT='ZZZZZZZZZ9',                                    X05620001
               COLOR=BLUE                                               05630001
A1PCT08 DFHMDF POS=(16,40),                                            X05640001
               LENGTH=05,                                              X05650001
               ATTRB=(ASKIP,NORM),                                     X05660001
               COLOR=BLUE                                               05670001
A2UNT08 DFHMDF POS=(16,46),                                            X05680001
               LENGTH=10,                                              X05690001
               ATTRB=(ASKIP,NORM),                                     X05700001
               PICOUT='ZZZZZZZZZ9',                                    X05710001
               COLOR=BLUE                                               05720001
A2PCT08 DFHMDF POS=(16,57),                                            X05730001
               LENGTH=05,                                              X05740001
               ATTRB=(ASKIP,NORM),                                     X05750001
               COLOR=BLUE                                               05760001
ATUNT08 DFHMDF POS=(16,63),                                            X05770001
               LENGTH=11,                                              X05780002
               ATTRB=(ASKIP,NORM),                                     X05790001
               PICOUT='ZZZZZZZZZZ9',                                   X05800002
               COLOR=BLUE                                               05810001
ATPCT08 DFHMDF POS=(16,75),                                            X05820002
               LENGTH=05,                                              X05830001
               ATTRB=(ASKIP,NORM),                                     X05840001
               COLOR=BLUE                                               05850001
*********************************************************************** 05860001
ASEL09  DFHMDF POS=(17,01),                                            X05870003
               LENGTH=01,                                              X05880001
               ATTRB=(UNPROT,NORM),                                    X05890001
               HILIGHT=UNDERLINE,                                      X05900001
               COLOR=GREEN                                              05910001
        DFHMDF POS=(17,03),                                            X05920003
               LENGTH=01,                                              X05930001
               ATTRB=(ASKIP,DRK)                                        05940001
AGROP09 DFHMDF POS=(17,05),                                            X05950001
               LENGTH=06,                                              X05960001
               ATTRB=(ASKIP,NORM),                                     X05970001
               COLOR=BLUE                                               05980001
A3UNT09 DFHMDF POS=(17,12),                                            X05990001
               LENGTH=10,                                              X06000001
               ATTRB=(ASKIP,NORM),                                     X06010001
               PICOUT='ZZZZZZZZZ9',                                    X06020001
               COLOR=BLUE                                               06030001
A3PCT09 DFHMDF POS=(17,23),                                            X06040001
               LENGTH=05,                                              X06050001
               ATTRB=(ASKIP,NORM),                                     X06060001
               COLOR=BLUE                                               06070001
A1UNT09 DFHMDF POS=(17,29),                                            X06080001
               LENGTH=10,                                              X06090001
               ATTRB=(ASKIP,NORM),                                     X06100001
               PICOUT='ZZZZZZZZZ9',                                    X06110001
               COLOR=BLUE                                               06120001
A1PCT09 DFHMDF POS=(17,40),                                            X06130001
               LENGTH=05,                                              X06140001
               ATTRB=(ASKIP,NORM),                                     X06150001
               COLOR=BLUE                                               06160001
A2UNT09 DFHMDF POS=(17,46),                                            X06170001
               LENGTH=10,                                              X06180001
               ATTRB=(ASKIP,NORM),                                     X06190001
               PICOUT='ZZZZZZZZZ9',                                    X06200001
               COLOR=BLUE                                               06210001
A2PCT09 DFHMDF POS=(17,57),                                            X06220001
               LENGTH=05,                                              X06230001
               ATTRB=(ASKIP,NORM),                                     X06240001
               COLOR=BLUE                                               06250001
ATUNT09 DFHMDF POS=(17,63),                                            X06260001
               LENGTH=11,                                              X06270002
               ATTRB=(ASKIP,NORM),                                     X06280001
               PICOUT='ZZZZZZZZZZ9',                                   X06290002
               COLOR=BLUE                                               06300001
ATPCT09 DFHMDF POS=(17,75),                                            X06310002
               LENGTH=05,                                              X06320001
               ATTRB=(ASKIP,NORM),                                     X06330001
               COLOR=BLUE                                               06340001
*********************************************************************** 06350001
ASEL10  DFHMDF POS=(18,01),                                            X06360003
               LENGTH=01,                                              X06370001
               ATTRB=(UNPROT,NORM),                                    X06380001
               HILIGHT=UNDERLINE,                                      X06390001
               COLOR=GREEN                                              06400001
        DFHMDF POS=(18,03),                                            X06410003
               LENGTH=01,                                              X06420001
               ATTRB=(ASKIP,DRK)                                        06430001
AGROP10 DFHMDF POS=(18,05),                                            X06440001
               LENGTH=06,                                              X06450001
               ATTRB=(ASKIP,NORM),                                     X06460001
               COLOR=BLUE                                               06470001
A3UNT10 DFHMDF POS=(18,12),                                            X06480001
               LENGTH=10,                                              X06490001
               ATTRB=(ASKIP,NORM),                                     X06500001
               PICOUT='ZZZZZZZZZ9',                                    X06510001
               COLOR=BLUE                                               06520001
A3PCT10 DFHMDF POS=(18,23),                                            X06530001
               LENGTH=05,                                              X06540001
               ATTRB=(ASKIP,NORM),                                     X06550001
               COLOR=BLUE                                               06560001
A1UNT10 DFHMDF POS=(18,29),                                            X06570001
               LENGTH=10,                                              X06580001
               ATTRB=(ASKIP,NORM),                                     X06590001
               PICOUT='ZZZZZZZZZ9',                                    X06600001
               COLOR=BLUE                                               06610001
A1PCT10 DFHMDF POS=(18,40),                                            X06620001
               LENGTH=05,                                              X06630001
               ATTRB=(ASKIP,NORM),                                     X06640001
               COLOR=BLUE                                               06650001
A2UNT10 DFHMDF POS=(18,46),                                            X06660001
               LENGTH=10,                                              X06670001
               ATTRB=(ASKIP,NORM),                                     X06680001
               PICOUT='ZZZZZZZZZ9',                                    X06690001
               COLOR=BLUE                                               06700001
A2PCT10 DFHMDF POS=(18,57),                                            X06710001
               LENGTH=05,                                              X06720001
               ATTRB=(ASKIP,NORM),                                     X06730001
               COLOR=BLUE                                               06740001
ATUNT10 DFHMDF POS=(18,63),                                            X06750001
               LENGTH=11,                                              X06760002
               ATTRB=(ASKIP,NORM),                                     X06770001
               PICOUT='ZZZZZZZZZZ9',                                   X06780002
               COLOR=BLUE                                               06790001
ATPCT10 DFHMDF POS=(18,75),                                            X06800002
               LENGTH=05,                                              X06810001
               ATTRB=(ASKIP,NORM),                                     X06820001
               COLOR=BLUE                                               06830001
*********************************************************************** 06840001
*********************************************************************** 06850001
        DFHMDF POS=(19,45),                                            X06860001
               LENGTH=25,                                              X06870001
               ATTRB=(ASKIP,NORM),                                     X06880001
               COLOR=NEUTRAL,                                          X06890001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      06900001
ASELIT  DFHMDF POS=(19,72),                                            X06910001
               LENGTH=07,                                              X06920001
               ATTRB=(ASKIP,NORM),                                     X06930001
               COLOR=BLUE,                                             X06940001
               PICOUT='ZZZ,ZZ9'                                         06950001
        DFHMSD TYPE=FINAL                                               06960001
        END                                                             06970001
