*          DATA SET PCKM769    AT LEVEL 000 AS OF   /  /                        
***********************************************************************         
        PRINT NOGEN                                                             
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  PCKM769                                            *           
*        MAP     PC769A                                             *           
*        PROGRAM PCKCS769                                           *           
*        TRANSID E769 - PO-SET LIST                                 *           
*        SYSTEM  PC -- PROCESS CONTROLS                             *           
*                                                                   *           
*-------------------------------------------------------------------*           
PCKM769 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES                                                      
PC769A  DFHMDI SIZE=(19,80),                                           X        
               LINE=2,COLUMN=1,                                        X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               CTRL=(FREEKB,FRSET)                                              
***********************************************************************         
*   SCREEN LINE 5                                                               
***********************************************************************         
        DFHMDF POS=(5,16),                                             X        
               LENGTH=19,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SEASONAL SET YEAR :'                                    
MYEAR   DFHMDF POS=(5,36),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ'                                                    
        DFHMDF POS=(5,41),                                             X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 7                                                               
***********************************************************************         
        DFHMDF POS=(7,16),                                             X        
               LENGTH=37,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SEASONAL SET CODE   SEASONAL SET NAME'                  
***********************************************************************         
*   SCREEN LINE 8                                                               
***********************************************************************         
MCOL01  DFHMDF POS=(8,18),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 1.'                                                    
MCDE01  DFHMDF POS=(8,22),                                             X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(8,28),                                             X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME01  DFHMDF POS=(8,36),                                             X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 9                                                               
***********************************************************************         
MCOL02  DFHMDF POS=(9,18),                                             X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 2.'                                                    
MCDE02  DFHMDF POS=(9,22),                                             X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(9,28),                                             X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME02  DFHMDF POS=(9,36),                                             X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 10                                                              
***********************************************************************         
MCOL03  DFHMDF POS=(10,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 3.'                                                    
MCDE03  DFHMDF POS=(10,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(10,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME03  DFHMDF POS=(10,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 11                                                              
***********************************************************************         
MCOL04  DFHMDF POS=(11,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 4.'                                                    
MCDE04  DFHMDF POS=(11,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(11,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME04  DFHMDF POS=(11,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 12                                                              
***********************************************************************         
MCOL12  DFHMDF POS=(12,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 5.'                                                    
MCDE05  DFHMDF POS=(12,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(12,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME05  DFHMDF POS=(12,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 13                                                              
***********************************************************************         
MCOL13  DFHMDF POS=(13,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 6.'                                                    
MCDE06  DFHMDF POS=(13,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(13,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME06  DFHMDF POS=(13,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 14                                                              
***********************************************************************         
MCOL14  DFHMDF POS=(14,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 7.'                                                    
MCDE07  DFHMDF POS=(14,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(14,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME07  DFHMDF POS=(14,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 15                                                              
***********************************************************************         
MCOL15  DFHMDF POS=(15,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 8.'                                                    
MCDE08  DFHMDF POS=(15,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(15,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME08  DFHMDF POS=(15,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 16                                                              
***********************************************************************         
MCOL16  DFHMDF POS=(16,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' 9.'                                                    
MCDE09  DFHMDF POS=(16,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(16,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME09  DFHMDF POS=(16,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 17                                                              
***********************************************************************         
MCOL17  DFHMDF POS=(17,18),                                            X        
               LENGTH=3,                                               X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='10.'                                                    
MCDE10  DFHMDF POS=(17,22),                                            X        
               LENGTH=05,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='     '                                                  
        DFHMDF POS=(17,28),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
MNME10  DFHMDF POS=(17,36),                                            X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               ATTRB=ASKIP                                                      
***********************************************************************         
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
