*********************************************************************** 00010000
*          DATA SET PCKM746                                             00020000
  PRINT  NOGEN                                                          00030000
*-------------------------------------------------------------------*   00040000
*                                                                   *   00050000
*        MAPSET  PCKM746                                            *   00060000
*        MAP     PC746A                                             *   00070000
*        PROGRAM PCKCS746                                           *   00080000
*        TRANSID E746 - IN-TRANSIT SKU STORE LIST SCREEN            *   00090000
*        SYSTEM  PROCESS CONTROL (PC)                               *   00100000
*                                                                   *   00110000
*-------------------------------------------------------------------*   00120000
PCKM746 DFHMSD TYPE=DSECT,                                             X00130000
               LANG=COBOL,                                             X00140000
               MODE=INOUT,                                             X00150000
               STORAGE=AUTO,                                           X00160000
               TERM=3270-2,                                            X00170000
               TIOAPFX=YES                                              00180000
*********************************************************************** 00190000
PC746A  DFHMDI LINE=2,COLUMN=1,                                        X00200000
               SIZE=(19,80),                                           X00210000
               CTRL=(FREEKB),                                          X00220000
               MAPATTS=(COLOR,HILIGHT),                                X00230000
               DSATTS=(COLOR,HILIGHT)                                   00240000
*********************************************************************** 00250000
        DFHMDF POS=(02,02),                                            X00260006
               LENGTH=04,                                              X00270000
               ATTRB=(ASKIP,NORM),                                     X00280000
               COLOR=NEUTRAL,                                          X00290000
               INITIAL='SKU:'                                           00300000
ASKU    DFHMDF POS=(02,07),                                            X00310006
               LENGTH=08,                                              X00320000
               ATTRB=(ASKIP,NORM),                                     X00330000
               COLOR=BLUE                                               00340000
ADESC   DFHMDF POS=(02,17),                                            X00350006
               LENGTH=24,                                              X00360000
               ATTRB=(ASKIP,NORM),                                     X00370000
               COLOR=BLUE                                               00380000
*********************************************************************** 00420000
        DFHMDF POS=(03,01),                                            X00430006
               LENGTH=22,                                              X00440006
               ATTRB=(ASKIP,NORM),                                     X00450000
               COLOR=NEUTRAL,                                          X00460000
               INITIAL='TOTAL FASHION ON-HAND:'                         00470004
AFASH   DFHMDF POS=(03,25),                                            X00480006
               LENGTH=09,                                              X00490000
               ATTRB=(ASKIP,NORM),                                     X00500000
               PICOUT='ZZZZZZZ9-',                                     X00510000
               COLOR=BLUE                                               00520000
        DFHMDF POS=(03,38),                                            X00530006
               LENGTH=20,                                              X00540006
               ATTRB=(ASKIP,NORM),                                     X00550000
               COLOR=NEUTRAL,                                          X00560000
               INITIAL='TOTAL IN-TRANSIT...:'                           00570000
ATRAN   DFHMDF POS=(03,60),                                            X00580006
               LENGTH=09,                                              X00590000
               ATTRB=(ASKIP,NORM),                                     X00600000
               PICOUT='ZZZZZZZ9-',                                     X00610000
               COLOR=BLUE                                               00620000
*********************************************************************** 00660000
        DFHMDF POS=(04,01),                                            X00661006
               LENGTH=22,                                              X00662006
               ATTRB=(ASKIP,NORM),                                     X00663000
               COLOR=NEUTRAL,                                          X00664000
               INITIAL='TOTAL STORE EXPECTED.:'                         00665003
AEXPT   DFHMDF POS=(04,25),                                            X00666006
               LENGTH=09,                                              X00667000
               ATTRB=(ASKIP,NORM),                                     X00668000
               PICOUT='ZZZZZZZ9-',                                     X00669000
               COLOR=BLUE                                               00669100
        DFHMDF POS=(04,38),                                            X00669206
               LENGTH=20,                                              X00669306
               ATTRB=(ASKIP,NORM),                                     X00669400
               COLOR=NEUTRAL,                                          X00669500
               INITIAL='TOTAL STORE ON-HAND:'                           00669700
ASTOR   DFHMDF POS=(04,60),                                            X00669806
               LENGTH=09,                                              X00669900
               ATTRB=(ASKIP,NORM),                                     X00670000
               PICOUT='ZZZZZZZ9-',                                     X00670100
               COLOR=BLUE                                               00670200
*********************************************************************** 00670300
        DFHMDF POS=(05,51),                                            X00671006
               LENGTH=05,                                              X00680000
               ATTRB=(ASKIP,NORM),                                     X00690000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00700000
ASTRTIT DFHMDF POS=(05,57),                                            X00710006
               LENGTH=05,                                              X00720000
               ATTRB=(NUM,UNPROT,NORM),                                X00730000
               COLOR=GREEN,                                            X00740000
               PICOUT='ZZZZ9',                                         X00750000
               HILIGHT=UNDERLINE                                        00760000
        DFHMDF POS=(05,63),                                            X00770006
               LENGTH=02,                                              X00780000
               ATTRB=(ASKIP,NORM),                                     X00790000
               COLOR=NEUTRAL,                                          X00800000
               INITIAL='TO'                                             00810000
AENDIT  DFHMDF POS=(05,66),                                            X00820006
               LENGTH=05,                                              X00830000
               ATTRB=(ASKIP,NORM),                                     X00840000
               COLOR=BLUE,                                             X00850000
               PICOUT='ZZZZ9'                                           00860000
        DFHMDF POS=(05,72),                                            X00870006
               LENGTH=02,                                              X00880000
               ATTRB=(ASKIP,NORM),                                     X00890000
               COLOR=NEUTRAL,                                          X00900000
               INITIAL='OF'                                             00910000
ATOTIT  DFHMDF POS=(05,75),                                            X00920006
               LENGTH=05,                                              X00930000
               ATTRB=(ASKIP,NORM),                                     X00940000
               COLOR=BLUE,                                             X00950000
               PICOUT='ZZZZ9'                                           00960000
*********************************************************************** 00970000
ATITLE  DFHMDF POS=(06,01),                                            X00971015
               LENGTH=20,                                              X00972015
               ATTRB=(ASKIP,NORM),                                     X00973015
               COLOR=YELLOW                                             00974016
*********************************************************************** 00976015
        DFHMDF POS=(07,09),                                            X00980014
               LENGTH=07,                                              X00990013
               ATTRB=(ASKIP,NORM),                                     X01000000
               COLOR=NEUTRAL,                                          X01010000
               INITIAL='STR  DC'                                        01020013
        DFHMDF POS=(07,32),                                            X01021013
               LENGTH=07,                                              X01022000
               ATTRB=(ASKIP,NORM),                                     X01023000
               COLOR=NEUTRAL,                                          X01024000
               INITIAL='FASHION'                                        01025000
        DFHMDF POS=(07,41),                                            X01030013
               LENGTH=16,                                              X01040007
               ATTRB=(ASKIP,NORM),                                     X01050000
               COLOR=NEUTRAL,                                          X01060000
               INITIAL='INTRANSIT  STORE'                               01070007
        DFHMDF POS=(07,62),                                            X01080013
               LENGTH=05,                                              X01090000
               ATTRB=(ASKIP,NORM),                                     X01100000
               COLOR=NEUTRAL,                                          X01110000
               INITIAL='STORE'                                          01120000
        DFHMDF POS=(07,71),                                            X01121013
               LENGTH=05,                                              X01122011
               ATTRB=(ASKIP,NORM),                                     X01123000
               COLOR=NEUTRAL,                                          X01124000
               INITIAL=' LAST '                                         01126011
*********************************************************************** 01131001
        DFHMDF POS=(08,01),                                            X01142006
               LENGTH=18,                                              X01150009
               ATTRB=(ASKIP,NORM),                                     X01160000
               COLOR=NEUTRAL,                                          X01170000
               INITIAL='SEL ACT NBR  NBR'                               01180013
        DFHMDF POS=(08,20),                                            X01190009
               LENGTH=19,                                              X01200010
               ATTRB=(ASKIP,NORM),                                     X01210000
               COLOR=NEUTRAL,                                          X01220000
               INITIAL='STORE NAME  ON-HAND'                            01230009
        DFHMDF POS=(08,41),                                            X01231013
               LENGTH=18,                                              X01232001
               ATTRB=(ASKIP,NORM),                                     X01233001
               COLOR=NEUTRAL,                                          X01234001
               INITIAL='QUANTITY  EXPECTED'                             01236001
        DFHMDF POS=(08,61),                                            X01240013
               LENGTH=07,                                              X01250001
               ATTRB=(ASKIP,NORM),                                     X01260000
               COLOR=NEUTRAL,                                          X01270000
               INITIAL='ON-HAND'                                        01280001
        DFHMDF POS=(08,71),                                            X01281013
               LENGTH=07,                                              X01282011
               ATTRB=(ASKIP,NORM),                                     X01283001
               COLOR=NEUTRAL,                                          X01284001
               INITIAL='UPDATED'                                        01286011
*********************************************************************** 01290000
ASEL01  DFHMDF POS=(09,02),                                            X01300000
               LENGTH=01,                                              X01310000
               ATTRB=(UNPROT,NORM),                                    X01320000
               HILIGHT=UNDERLINE,                                      X01330000
               COLOR=GREEN                                              01340000
        DFHMDF POS=(09,004),                                           X01341014
               ATTRB=(ASKIP),                                          X01342014
               LENGTH=000                                               01343014
AACT01  DFHMDF POS=(09,05),                                            X01344013
               LENGTH=03,                                              X01345000
               ATTRB=(ASKIP,NORM),                                     X01346000
               COLOR=BLUE                                               01347000
ASTOR01 DFHMDF POS=(09,09),                                            X01348001
               LENGTH=04,                                              X01349000
               ATTRB=(ASKIP,NORM),                                     X01350000
               PICOUT='ZZZZ',                                          X01360000
               COLOR=BLUE                                               01370000
ADC01   DFHMDF POS=(09,14),                                            X01371008
               LENGTH=04,                                              X01372008
               ATTRB=(ASKIP,NORM),                                     X01373008
               PICOUT='ZZZZ',                                          X01374008
               COLOR=BLUE                                               01375008
ANAME01 DFHMDF POS=(09,20),                                            X01380008
               LENGTH=10,                                              X01390000
               ATTRB=(ASKIP,NORM),                                     X01400000
               COLOR=BLUE                                               01410000
AFASH01 DFHMDF POS=(09,32),                                            X01420008
               LENGTH=08,                                              X01430008
               ATTRB=(ASKIP,NORM),                                     X01440000
               PICOUT='ZZZZZZ9-',                                      X01450008
               COLOR=BLUE                                               01460000
ATRAN01 DFHMDF POS=(09,42),                                            X01470008
               LENGTH=07,                                              X01480001
               ATTRB=(ASKIP,NORM),                                     X01490000
               PICOUT='ZZZZZ9-',                                       X01500001
               COLOR=BLUE                                               01510000
AEXPT01 DFHMDF POS=(09,51),                                            X01511008
               LENGTH=08,                                              X01512008
               ATTRB=(ASKIP,NORM),                                     X01513001
               PICOUT='ZZZZZZ9-',                                      X01514008
               COLOR=BLUE                                               01515001
ASTON01 DFHMDF POS=(09,61),                                            X01516008
               LENGTH=08,                                              X01517008
               ATTRB=(ASKIP,NORM),                                     X01518001
               PICOUT='ZZZZZZ9-',                                      X01519008
               COLOR=BLUE                                               01519101
ADATE01 DFHMDF POS=(09,71),                                            X01520008
               LENGTH=08,                                              X01530012
               ATTRB=(ASKIP,NORM),                                     X01540000
               COLOR=BLUE                                               01550000
*********************************************************************** 01800000
ASEL02  DFHMDF POS=(10,02),                                            X01810008
               LENGTH=01,                                              X01820008
               ATTRB=(UNPROT,NORM),                                    X01830008
               HILIGHT=UNDERLINE,                                      X01840008
               COLOR=GREEN                                              01850008
        DFHMDF POS=(10,004),                                           X01851014
               ATTRB=(ASKIP),                                          X01852014
               LENGTH=000                                               01853014
AACT02  DFHMDF POS=(10,05),                                            X01854014
               LENGTH=03,                                              X01855014
               ATTRB=(ASKIP,NORM),                                     X01856014
               COLOR=BLUE                                               01857014
ASTOR02 DFHMDF POS=(10,09),                                            X01900008
               LENGTH=04,                                              X01910008
               ATTRB=(ASKIP,NORM),                                     X01920008
               PICOUT='ZZZZ',                                          X01930008
               COLOR=BLUE                                               01940008
ADC02   DFHMDF POS=(10,14),                                            X01950008
               LENGTH=04,                                              X01960008
               ATTRB=(ASKIP,NORM),                                     X01970008
               PICOUT='ZZZZ',                                          X01980008
               COLOR=BLUE                                               01990008
ANAME02 DFHMDF POS=(10,20),                                            X02000008
               LENGTH=10,                                              X02010008
               ATTRB=(ASKIP,NORM),                                     X02020008
               COLOR=BLUE                                               02030008
AFASH02 DFHMDF POS=(10,32),                                            X02040008
               LENGTH=08,                                              X02050008
               ATTRB=(ASKIP,NORM),                                     X02060008
               PICOUT='ZZZZZZ9-',                                      X02070008
               COLOR=BLUE                                               02080008
ATRAN02 DFHMDF POS=(10,42),                                            X02090008
               LENGTH=07,                                              X02100008
               ATTRB=(ASKIP,NORM),                                     X02110008
               PICOUT='ZZZZZ9-',                                       X02120008
               COLOR=BLUE                                               02130008
AEXPT02 DFHMDF POS=(10,51),                                            X02140008
               LENGTH=08,                                              X02150008
               ATTRB=(ASKIP,NORM),                                     X02160008
               PICOUT='ZZZZZZ9-',                                      X02170008
               COLOR=BLUE                                               02180008
ASTON02 DFHMDF POS=(10,61),                                            X02190008
               LENGTH=08,                                              X02200008
               ATTRB=(ASKIP,NORM),                                     X02210008
               PICOUT='ZZZZZZ9-',                                      X02220008
               COLOR=BLUE                                               02230008
ADATE02 DFHMDF POS=(10,71),                                            X02240008
               LENGTH=08,                                              X02250012
               ATTRB=(ASKIP,NORM),                                     X02260008
               COLOR=BLUE                                               02270008
*********************************************************************** 02280008
ASEL03  DFHMDF POS=(11,02),                                            X02290008
               LENGTH=01,                                              X02300008
               ATTRB=(UNPROT,NORM),                                    X02310008
               HILIGHT=UNDERLINE,                                      X02320008
               COLOR=GREEN                                              02330008
        DFHMDF POS=(11,004),                                           X02331014
               ATTRB=(ASKIP),                                          X02332014
               LENGTH=000                                               02333014
AACT03  DFHMDF POS=(11,05),                                            X02334014
               LENGTH=03,                                              X02335014
               ATTRB=(ASKIP,NORM),                                     X02336014
               COLOR=BLUE                                               02337014
ASTOR03 DFHMDF POS=(11,09),                                            X02380008
               LENGTH=04,                                              X02390008
               ATTRB=(ASKIP,NORM),                                     X02400008
               PICOUT='ZZZZ',                                          X02410008
               COLOR=BLUE                                               02420008
ADC03   DFHMDF POS=(11,14),                                            X02430008
               LENGTH=04,                                              X02440008
               ATTRB=(ASKIP,NORM),                                     X02450008
               PICOUT='ZZZZ',                                          X02460008
               COLOR=BLUE                                               02470008
ANAME03 DFHMDF POS=(11,20),                                            X02480008
               LENGTH=10,                                              X02490008
               ATTRB=(ASKIP,NORM),                                     X02500008
               COLOR=BLUE                                               02510008
AFASH03 DFHMDF POS=(11,32),                                            X02520008
               LENGTH=08,                                              X02530008
               ATTRB=(ASKIP,NORM),                                     X02540008
               PICOUT='ZZZZZZ9-',                                      X02550008
               COLOR=BLUE                                               02560008
ATRAN03 DFHMDF POS=(11,42),                                            X02570008
               LENGTH=07,                                              X02580008
               ATTRB=(ASKIP,NORM),                                     X02590008
               PICOUT='ZZZZZ9-',                                       X02600008
               COLOR=BLUE                                               02610008
AEXPT03 DFHMDF POS=(11,51),                                            X02620008
               LENGTH=08,                                              X02630008
               ATTRB=(ASKIP,NORM),                                     X02640008
               PICOUT='ZZZZZZ9-',                                      X02650008
               COLOR=BLUE                                               02660008
ASTON03 DFHMDF POS=(11,61),                                            X02670008
               LENGTH=08,                                              X02680008
               ATTRB=(ASKIP,NORM),                                     X02690008
               PICOUT='ZZZZZZ9-',                                      X02700008
               COLOR=BLUE                                               02710008
ADATE03 DFHMDF POS=(11,71),                                            X02720008
               LENGTH=08,                                              X02730012
               ATTRB=(ASKIP,NORM),                                     X02740008
               COLOR=BLUE                                               02750008
*********************************************************************** 02760008
ASEL04  DFHMDF POS=(12,02),                                            X02770008
               LENGTH=01,                                              X02780008
               ATTRB=(UNPROT,NORM),                                    X02790008
               HILIGHT=UNDERLINE,                                      X02800008
               COLOR=GREEN                                              02810008
        DFHMDF POS=(12,004),                                           X02811014
               ATTRB=(ASKIP),                                          X02812014
               LENGTH=000                                               02813014
AACT04  DFHMDF POS=(12,05),                                            X02814014
               LENGTH=03,                                              X02815014
               ATTRB=(ASKIP,NORM),                                     X02816014
               COLOR=BLUE                                               02817014
ASTOR04 DFHMDF POS=(12,09),                                            X02860008
               LENGTH=04,                                              X02870008
               ATTRB=(ASKIP,NORM),                                     X02880008
               PICOUT='ZZZZ',                                          X02890008
               COLOR=BLUE                                               02900008
ADC04   DFHMDF POS=(12,14),                                            X02910008
               LENGTH=04,                                              X02920008
               ATTRB=(ASKIP,NORM),                                     X02930008
               PICOUT='ZZZZ',                                          X02940008
               COLOR=BLUE                                               02950008
ANAME04 DFHMDF POS=(12,20),                                            X02960008
               LENGTH=10,                                              X02970008
               ATTRB=(ASKIP,NORM),                                     X02980008
               COLOR=BLUE                                               02990008
AFASH04 DFHMDF POS=(12,32),                                            X03000008
               LENGTH=08,                                              X03010008
               ATTRB=(ASKIP,NORM),                                     X03020008
               PICOUT='ZZZZZZ9-',                                      X03030008
               COLOR=BLUE                                               03040008
ATRAN04 DFHMDF POS=(12,42),                                            X03050008
               LENGTH=07,                                              X03060008
               ATTRB=(ASKIP,NORM),                                     X03070008
               PICOUT='ZZZZZ9-',                                       X03080008
               COLOR=BLUE                                               03090008
AEXPT04 DFHMDF POS=(12,51),                                            X03100008
               LENGTH=08,                                              X03110008
               ATTRB=(ASKIP,NORM),                                     X03120008
               PICOUT='ZZZZZZ9-',                                      X03130008
               COLOR=BLUE                                               03140008
ASTON04 DFHMDF POS=(12,61),                                            X03150008
               LENGTH=08,                                              X03160008
               ATTRB=(ASKIP,NORM),                                     X03170008
               PICOUT='ZZZZZZ9-',                                      X03180008
               COLOR=BLUE                                               03190008
ADATE04 DFHMDF POS=(12,71),                                            X03200008
               LENGTH=08,                                              X03210012
               ATTRB=(ASKIP,NORM),                                     X03220008
               COLOR=BLUE                                               03230008
*********************************************************************** 03240008
ASEL05  DFHMDF POS=(13,02),                                            X03250008
               LENGTH=01,                                              X03260008
               ATTRB=(UNPROT,NORM),                                    X03270008
               HILIGHT=UNDERLINE,                                      X03280008
               COLOR=GREEN                                              03290008
        DFHMDF POS=(13,004),                                           X03291014
               ATTRB=(ASKIP),                                          X03292014
               LENGTH=000                                               03293014
AACT05  DFHMDF POS=(13,05),                                            X03294014
               LENGTH=03,                                              X03295014
               ATTRB=(ASKIP,NORM),                                     X03296014
               COLOR=BLUE                                               03297014
ASTOR05 DFHMDF POS=(13,09),                                            X03340008
               LENGTH=04,                                              X03350008
               ATTRB=(ASKIP,NORM),                                     X03360008
               PICOUT='ZZZZ',                                          X03370008
               COLOR=BLUE                                               03380008
ADC05   DFHMDF POS=(13,14),                                            X03390008
               LENGTH=04,                                              X03400008
               ATTRB=(ASKIP,NORM),                                     X03410008
               PICOUT='ZZZZ',                                          X03420008
               COLOR=BLUE                                               03430008
ANAME05 DFHMDF POS=(13,20),                                            X03440008
               LENGTH=10,                                              X03450008
               ATTRB=(ASKIP,NORM),                                     X03460008
               COLOR=BLUE                                               03470008
AFASH05 DFHMDF POS=(13,32),                                            X03480008
               LENGTH=08,                                              X03490008
               ATTRB=(ASKIP,NORM),                                     X03500008
               PICOUT='ZZZZZZ9-',                                      X03510008
               COLOR=BLUE                                               03520008
ATRAN05 DFHMDF POS=(13,42),                                            X03530008
               LENGTH=07,                                              X03540008
               ATTRB=(ASKIP,NORM),                                     X03550008
               PICOUT='ZZZZZ9-',                                       X03560008
               COLOR=BLUE                                               03570008
AEXPT05 DFHMDF POS=(13,51),                                            X03580008
               LENGTH=08,                                              X03590008
               ATTRB=(ASKIP,NORM),                                     X03600008
               PICOUT='ZZZZZZ9-',                                      X03610008
               COLOR=BLUE                                               03620008
ASTON05 DFHMDF POS=(13,61),                                            X03630008
               LENGTH=08,                                              X03640008
               ATTRB=(ASKIP,NORM),                                     X03650008
               PICOUT='ZZZZZZ9-',                                      X03660008
               COLOR=BLUE                                               03670008
ADATE05 DFHMDF POS=(13,71),                                            X03680008
               LENGTH=08,                                              X03690012
               ATTRB=(ASKIP,NORM),                                     X03700008
               COLOR=BLUE                                               03710008
*********************************************************************** 03720008
ASEL06  DFHMDF POS=(14,02),                                            X03730008
               LENGTH=01,                                              X03740008
               ATTRB=(UNPROT,NORM),                                    X03750008
               HILIGHT=UNDERLINE,                                      X03760008
               COLOR=GREEN                                              03770008
        DFHMDF POS=(14,004),                                           X03771014
               ATTRB=(ASKIP),                                          X03772014
               LENGTH=000                                               03773014
AACT06  DFHMDF POS=(14,05),                                            X03774014
               LENGTH=03,                                              X03775014
               ATTRB=(ASKIP,NORM),                                     X03776014
               COLOR=BLUE                                               03777014
ASTOR06 DFHMDF POS=(14,09),                                            X03820008
               LENGTH=04,                                              X03830008
               ATTRB=(ASKIP,NORM),                                     X03840008
               PICOUT='ZZZZ',                                          X03850008
               COLOR=BLUE                                               03860008
ADC06   DFHMDF POS=(14,14),                                            X03870008
               LENGTH=04,                                              X03880008
               ATTRB=(ASKIP,NORM),                                     X03890008
               PICOUT='ZZZZ',                                          X03900008
               COLOR=BLUE                                               03910008
ANAME06 DFHMDF POS=(14,20),                                            X03920008
               LENGTH=10,                                              X03930008
               ATTRB=(ASKIP,NORM),                                     X03940008
               COLOR=BLUE                                               03950008
AFASH06 DFHMDF POS=(14,32),                                            X03960008
               LENGTH=08,                                              X03970008
               ATTRB=(ASKIP,NORM),                                     X03980008
               PICOUT='ZZZZZZ9-',                                      X03990008
               COLOR=BLUE                                               04000008
ATRAN06 DFHMDF POS=(14,42),                                            X04010008
               LENGTH=07,                                              X04020008
               ATTRB=(ASKIP,NORM),                                     X04030008
               PICOUT='ZZZZZ9-',                                       X04040008
               COLOR=BLUE                                               04050008
AEXPT06 DFHMDF POS=(14,51),                                            X04060008
               LENGTH=08,                                              X04070008
               ATTRB=(ASKIP,NORM),                                     X04080008
               PICOUT='ZZZZZZ9-',                                      X04090008
               COLOR=BLUE                                               04100008
ASTON06 DFHMDF POS=(14,61),                                            X04110008
               LENGTH=08,                                              X04120008
               ATTRB=(ASKIP,NORM),                                     X04130008
               PICOUT='ZZZZZZ9-',                                      X04140008
               COLOR=BLUE                                               04150008
ADATE06 DFHMDF POS=(14,71),                                            X04160008
               LENGTH=08,                                              X04170012
               ATTRB=(ASKIP,NORM),                                     X04180008
               COLOR=BLUE                                               04190008
*********************************************************************** 04200008
ASEL07  DFHMDF POS=(15,02),                                            X04210008
               LENGTH=01,                                              X04220008
               ATTRB=(UNPROT,NORM),                                    X04230008
               HILIGHT=UNDERLINE,                                      X04240008
               COLOR=GREEN                                              04250008
        DFHMDF POS=(15,004),                                           X04251014
               ATTRB=(ASKIP),                                          X04252014
               LENGTH=000                                               04253014
AACT07  DFHMDF POS=(15,05),                                            X04254014
               LENGTH=03,                                              X04255014
               ATTRB=(ASKIP,NORM),                                     X04256014
               COLOR=BLUE                                               04257014
ASTOR07 DFHMDF POS=(15,09),                                            X04300008
               LENGTH=04,                                              X04310008
               ATTRB=(ASKIP,NORM),                                     X04320008
               PICOUT='ZZZZ',                                          X04330008
               COLOR=BLUE                                               04340008
ADC07   DFHMDF POS=(15,14),                                            X04350008
               LENGTH=04,                                              X04360008
               ATTRB=(ASKIP,NORM),                                     X04370008
               PICOUT='ZZZZ',                                          X04380008
               COLOR=BLUE                                               04390008
ANAME07 DFHMDF POS=(15,20),                                            X04400008
               LENGTH=10,                                              X04410008
               ATTRB=(ASKIP,NORM),                                     X04420008
               COLOR=BLUE                                               04430008
AFASH07 DFHMDF POS=(15,32),                                            X04440008
               LENGTH=08,                                              X04450008
               ATTRB=(ASKIP,NORM),                                     X04460008
               PICOUT='ZZZZZZ9-',                                      X04470008
               COLOR=BLUE                                               04480008
ATRAN07 DFHMDF POS=(15,42),                                            X04490008
               LENGTH=07,                                              X04500008
               ATTRB=(ASKIP,NORM),                                     X04510008
               PICOUT='ZZZZZ9-',                                       X04520008
               COLOR=BLUE                                               04530008
AEXPT07 DFHMDF POS=(15,51),                                            X04540008
               LENGTH=08,                                              X04550008
               ATTRB=(ASKIP,NORM),                                     X04560008
               PICOUT='ZZZZZZ9-',                                      X04570008
               COLOR=BLUE                                               04580008
ASTON07 DFHMDF POS=(15,61),                                            X04590008
               LENGTH=08,                                              X04600008
               ATTRB=(ASKIP,NORM),                                     X04610008
               PICOUT='ZZZZZZ9-',                                      X04620008
               COLOR=BLUE                                               04630008
ADATE07 DFHMDF POS=(15,71),                                            X04640008
               LENGTH=08,                                              X04650012
               ATTRB=(ASKIP,NORM),                                     X04660008
               COLOR=BLUE                                               04670008
*********************************************************************** 04680008
ASEL08  DFHMDF POS=(16,02),                                            X04690008
               LENGTH=01,                                              X04700008
               ATTRB=(UNPROT,NORM),                                    X04710008
               HILIGHT=UNDERLINE,                                      X04720008
               COLOR=GREEN                                              04730008
        DFHMDF POS=(16,004),                                           X04731014
               ATTRB=(ASKIP),                                          X04732014
               LENGTH=000                                               04733014
AACT08  DFHMDF POS=(16,05),                                            X04734014
               LENGTH=03,                                              X04735014
               ATTRB=(ASKIP,NORM),                                     X04736014
               COLOR=BLUE                                               04737014
ASTOR08 DFHMDF POS=(16,09),                                            X04780008
               LENGTH=04,                                              X04790008
               ATTRB=(ASKIP,NORM),                                     X04800008
               PICOUT='ZZZZ',                                          X04810008
               COLOR=BLUE                                               04820008
ADC08   DFHMDF POS=(16,14),                                            X04830008
               LENGTH=04,                                              X04840008
               ATTRB=(ASKIP,NORM),                                     X04850008
               PICOUT='ZZZZ',                                          X04860008
               COLOR=BLUE                                               04870008
ANAME08 DFHMDF POS=(16,20),                                            X04880008
               LENGTH=10,                                              X04890008
               ATTRB=(ASKIP,NORM),                                     X04900008
               COLOR=BLUE                                               04910008
AFASH08 DFHMDF POS=(16,32),                                            X04920008
               LENGTH=08,                                              X04930008
               ATTRB=(ASKIP,NORM),                                     X04940008
               PICOUT='ZZZZZZ9-',                                      X04941008
               COLOR=BLUE                                               04942008
ATRAN08 DFHMDF POS=(16,42),                                            X04943008
               LENGTH=07,                                              X04944008
               ATTRB=(ASKIP,NORM),                                     X04945008
               PICOUT='ZZZZZ9-',                                       X04946008
               COLOR=BLUE                                               04947008
AEXPT08 DFHMDF POS=(16,51),                                            X04948008
               LENGTH=08,                                              X04949008
               ATTRB=(ASKIP,NORM),                                     X04949108
               PICOUT='ZZZZZZ9-',                                      X04949208
               COLOR=BLUE                                               04949308
ASTON08 DFHMDF POS=(16,61),                                            X04949408
               LENGTH=08,                                              X04949508
               ATTRB=(ASKIP,NORM),                                     X04949608
               PICOUT='ZZZZZZ9-',                                      X04949708
               COLOR=BLUE                                               04949808
ADATE08 DFHMDF POS=(16,71),                                            X04949908
               LENGTH=08,                                              X04950012
               ATTRB=(ASKIP,NORM),                                     X04950108
               COLOR=BLUE                                               04950208
*********************************************************************** 04950308
ASEL09  DFHMDF POS=(17,02),                                            X04950408
               LENGTH=01,                                              X04950508
               ATTRB=(UNPROT,NORM),                                    X04950608
               HILIGHT=UNDERLINE,                                      X04950708
               COLOR=GREEN                                              04950808
        DFHMDF POS=(17,004),                                           X04950914
               ATTRB=(ASKIP),                                          X04951014
               LENGTH=000                                               04951114
AACT09  DFHMDF POS=(17,05),                                            X04951214
               LENGTH=03,                                              X04951314
               ATTRB=(ASKIP,NORM),                                     X04951414
               COLOR=BLUE                                               04951514
ASTOR09 DFHMDF POS=(17,09),                                            X04952008
               LENGTH=04,                                              X04952108
               ATTRB=(ASKIP,NORM),                                     X04952208
               PICOUT='ZZZZ',                                          X04952308
               COLOR=BLUE                                               04952408
ADC09   DFHMDF POS=(17,14),                                            X04952508
               LENGTH=04,                                              X04952608
               ATTRB=(ASKIP,NORM),                                     X04952708
               PICOUT='ZZZZ',                                          X04952808
               COLOR=BLUE                                               04952908
ANAME09 DFHMDF POS=(17,20),                                            X04953008
               LENGTH=10,                                              X04953108
               ATTRB=(ASKIP,NORM),                                     X04953208
               COLOR=BLUE                                               04953308
AFASH09 DFHMDF POS=(17,32),                                            X04953408
               LENGTH=08,                                              X04953508
               ATTRB=(ASKIP,NORM),                                     X04953608
               PICOUT='ZZZZZZ9-',                                      X04953708
               COLOR=BLUE                                               04953808
ATRAN09 DFHMDF POS=(17,42),                                            X04953908
               LENGTH=07,                                              X04954008
               ATTRB=(ASKIP,NORM),                                     X04954108
               PICOUT='ZZZZZ9-',                                       X04954208
               COLOR=BLUE                                               04954308
AEXPT09 DFHMDF POS=(17,51),                                            X04954408
               LENGTH=08,                                              X04954508
               ATTRB=(ASKIP,NORM),                                     X04954608
               PICOUT='ZZZZZZ9-',                                      X04954708
               COLOR=BLUE                                               04954808
ASTON09 DFHMDF POS=(17,61),                                            X04954908
               LENGTH=08,                                              X04955008
               ATTRB=(ASKIP,NORM),                                     X04955108
               PICOUT='ZZZZZZ9-',                                      X04955208
               COLOR=BLUE                                               04955308
ADATE09 DFHMDF POS=(17,71),                                            X04955408
               LENGTH=08,                                              X04955512
               ATTRB=(ASKIP,NORM),                                     X04955608
               COLOR=BLUE                                               04955708
*********************************************************************** 04955808
ASEL10  DFHMDF POS=(18,02),                                            X04955908
               LENGTH=01,                                              X04956008
               ATTRB=(UNPROT,NORM),                                    X04956108
               HILIGHT=UNDERLINE,                                      X04956208
               COLOR=GREEN                                              04956308
        DFHMDF POS=(18,004),                                           X04956414
               ATTRB=(ASKIP),                                          X04956514
               LENGTH=000                                               04956614
AACT10  DFHMDF POS=(18,05),                                            X04956714
               LENGTH=03,                                              X04956814
               ATTRB=(ASKIP,NORM),                                     X04956914
               COLOR=BLUE                                               04957014
ASTOR10 DFHMDF POS=(18,09),                                            X04957508
               LENGTH=04,                                              X04957608
               ATTRB=(ASKIP,NORM),                                     X04957708
               PICOUT='ZZZZ',                                          X04957808
               COLOR=BLUE                                               04957908
ADC10   DFHMDF POS=(18,14),                                            X04958008
               LENGTH=04,                                              X04958108
               ATTRB=(ASKIP,NORM),                                     X04958208
               PICOUT='ZZZZ',                                          X04958308
               COLOR=BLUE                                               04958408
ANAME10 DFHMDF POS=(18,20),                                            X04958508
               LENGTH=10,                                              X04958608
               ATTRB=(ASKIP,NORM),                                     X04958708
               COLOR=BLUE                                               04958808
AFASH10 DFHMDF POS=(18,32),                                            X04958908
               LENGTH=08,                                              X04959008
               ATTRB=(ASKIP,NORM),                                     X04959108
               PICOUT='ZZZZZZ9-',                                      X04959208
               COLOR=BLUE                                               04959308
ATRAN10 DFHMDF POS=(18,42),                                            X04959408
               LENGTH=07,                                              X04959508
               ATTRB=(ASKIP,NORM),                                     X04959608
               PICOUT='ZZZZZ9-',                                       X04959708
               COLOR=BLUE                                               04959808
AEXPT10 DFHMDF POS=(18,51),                                            X04959908
               LENGTH=08,                                              X04960008
               ATTRB=(ASKIP,NORM),                                     X04960108
               PICOUT='ZZZZZZ9-',                                      X04960208
               COLOR=BLUE                                               04960308
ASTON10 DFHMDF POS=(18,61),                                            X04960408
               LENGTH=08,                                              X04960508
               ATTRB=(ASKIP,NORM),                                     X04960608
               PICOUT='ZZZZZZ9-',                                      X04960708
               COLOR=BLUE                                               04960808
ADATE10 DFHMDF POS=(18,71),                                            X04960908
               LENGTH=08,                                              X04961012
               ATTRB=(ASKIP,NORM),                                     X04961108
               COLOR=BLUE                                               04961208
*********************************************************************** 04962008
*********************************************************************** 04964708
        DFHMDF POS=(19,45),                                            X04964808
               LENGTH=25,                                              X04965008
               ATTRB=(ASKIP,NORM),                                     X04970000
               COLOR=NEUTRAL,                                          X04980000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      04990000
ASELIT  DFHMDF POS=(19,72),                                            X05000000
               LENGTH=07,                                              X05010000
               ATTRB=(ASKIP,NORM),                                     X05020000
               COLOR=BLUE,                                             X05030000
               PICOUT='ZZZ,ZZ9'                                         05040000
        DFHMSD TYPE=FINAL                                               05050000
        END                                                             05060000
