*          DATA SET PCKM117    AT LEVEL 011 AS OF 06/20/94                      
*          DATA SET PCKM117    AT LEVEL 003 AS OF 07/02/93              00001**3
  PRINT  NOGEN                                                          00002**3
*-------------------------------------------------------------------*   00003**3
*                                                                   *   00004**3
*        MAPSET  PCKM117                                            *   00005**3
*        MAP     PC117A                                             *   00006**3
*        PROGRAM PCKCS117                                           *   00007**3
*        TRANSID E117                                               *   00008**3
*        SYSTEM  CICS ARCHITECTURE - USERID LABELS                  *   00009**3
*                                                                   *   00010**3
*-------------------------------------------------------------------*   00011**3
PCKM117 DFHMSD TYPE=DSECT,                                             X00012**3
               LANG=COBOL,                                             X00013**3
               MODE=INOUT,                                             X00014**3
               STORAGE=AUTO,                                           X00015**3
               TERM=3270-2,                                            X00016**3
               TIOAPFX=YES                                              00017**3
PC117A  DFHMDI LINE=2,COLUMN=1,                                        X00018**3
               SIZE=(19,80),                                           X00019**3
               CTRL=(FREEKB),                                          X00020**3
               MAPATTS=(COLOR,HILIGHT),                                X00021**3
               DSATTS=(COLOR,HILIGHT)                                   00022**3
*                                                                       00023**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00024**3
               INITIAL='OPERATING UNIT:',                              X00025**3
               LENGTH=15,                                              X00026**3
               POS=(02,22)                                              00027**3
AOPUNIT DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00028*10
               LENGTH=4,                                               X00029**3
               COLOR=GREEN,                                            X00030**3
               HILIGHT=UNDERLINE,                                      X00031**3
               POS=(02,38)                                              00032**3
AOPDESC DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=24,                                              X00034**3
               COLOR=BLUE,                                             X00035**3
               POS=(02,43)                                              00036**5
*                                                                       00037**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00038**3
               INITIAL='FACILITY......:',                              X00039**3
               LENGTH=15,                                              X00040**3
               POS=(03,22)                                              00041**3
AFACIL  DFHMDF ATTRB=(UNPROT,NORM),                                    X00042*11
               LENGTH=4,                                               X00043**3
               COLOR=GREEN,                                            X00044**3
               HILIGHT=UNDERLINE,                                      X00045**3
               POS=(03,38)                                              00046**3
AFACDES DFHMDF ATTRB=(ASKIP),                                          X00047**3
               LENGTH=24,                                              X00048**3
               COLOR=BLUE,                                             X00049**3
               POS=(03,43)                                              00050**5
*                                                                       00051**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00052**3
               INITIAL='PRINTER NUMBER:',                              X00053**3
               LENGTH=15,                                              X00054**3
               POS=(04,22)                                              00055**3
APRTR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00056**3
               LENGTH=3,                                               X00057**3
               COLOR=GREEN,                                            X00058**3
               HILIGHT=UNDERLINE,                                      X00059**3
               POS=(04,39)                                              00060**9
APRDESC DFHMDF ATTRB=ASKIP,                                            X00061**3
               LENGTH=25,                                              X00062**3
               COLOR=BLUE,                                             X00063**3
               POS=(04,43)                                              00064**8
*                                                                       00065**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00066**3
               INITIAL='USERID........:',                              X00067**3
               LENGTH=15,                                              X00068**3
               POS=(05,22)                                              00069**3
AUSER   DFHMDF ATTRB=(UNPROT,NORM),                                    X00070**3
               LENGTH=8,                                               X00071**3
               COLOR=GREEN,                                            X00072**3
               HILIGHT=UNDERLINE,                                      X00073**3
               POS=(05,38)                                              00074**3
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00075**3
               INITIAL=' ',                                            X00076**3
               LENGTH=1,                                               X00077**3
               POS=(05,47)                                              00078**3
*                                                                       00079**3
         DFHMSD TYPE=FINAL                                              00080**3
         END                                                            00081**3
