        PRINT NOGEN                                                     00001   
PCKM874  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC874A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                       00011   
         DFHMDF POS=(01,03),                                           X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='CONVEYOR CUTOFF'                                00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='DOOR/DEST'                                      00015*29
ADOOR    DFHMDF POS=(02,11),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
ADEST    DFHMDF POS=(02,16),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
*                                                                       00072**5
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SRL NBR'                                        00015*29
ASERIAL  DFHMDF POS=(03,11),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
*                                                                       00041*22
ASCAC    DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
ATRLR    DFHMDF POS=(04,06),                                           X00034*22
               LENGTH=012,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
*                                                                       00041*22
         DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=007,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='TRIP ID:'                                       00015*29
ATRIP    DFHMDF POS=(05,11),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00053   
*                                                                       00041*22
ATYPE    DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=016,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='FIRST CARTON ID:'                               00015*29
*                                                                       00041*22
ASML     DFHMDF POS=(07,01),                                           X00034*22
               LENGTH=020,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC,FSET)                              00053   
*                                                                       00041*22
AMSGLN   DFHMDF POS=(08,02),                                           X00073*22
               LENGTH=018,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00055   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
