*          DATA SET PCKM155    AT LEVEL 003 AS OF 03/20/94                      
*          DATA SET PCKM155    AT LEVEL 014 AS OF 02/14/94              00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*  BMS MAPSET :  PCKM155                                                00005   
*      MAP    :  PC155A                                                 00006   
************************************************************            00007   
PCKM155  DFHMSD TYPE=DSECT,                                            X00008   
               LANG=COBOL,                                             X00009   
               CTRL=(FREEKB),                                          X00010   
               MODE=INOUT,                                             X00011   
               TERM=3270-2,                                            X00012   
               TIOAPFX=YES,                                            X00013   
               STORAGE=AUTO                                             00014   
PC155A   DFHMDI LINE=2,COLUMN=1,                                       X00015   
               SIZE=(19,80),                                           X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT)                                   00018   
*                                                                       00019   
*  SCREEN LINE 02                                                       00020   
*                                                                       00021   
AOPERID  DFHMDF ATTRB=(ASKIP),                                         X00022   
               COLOR=BLUE,                                             X00023   
               PICOUT='ZZZ9',                                          X00024   
               LENGTH=4,                                               X00025   
               POS=(01,02)                                              00026   
AFACLID  DFHMDF ATTRB=(ASKIP),                                         X00027   
               COLOR=BLUE,                                             X00028   
               PICOUT='ZZZ9',                                          X00029   
               LENGTH=4,                                               X00030   
               POS=(01,07)                                              00031   
*                                                                       00032   
*  SCREEN LINE 04                                                       00033   
*                                                                       00034   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00035   
               INITIAL='RECEIVER NUMBER......:',                       X00036   
               COLOR=NEUTRAL,                                          X00037   
               LENGTH=22,                                              X00038   
               POS=(03,7)                                               00039   
ARECVR   DFHMDF ATTRB=(ASKIP),                                         X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZZZZ9',                                      X00042   
               LENGTH=8,                                               X00043   
               POS=(03,30)                                              00044   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00045   
               INITIAL='-',                                            X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=1,                                               X00048   
               POS=(03,39)                                              00049   
AHSEQ    DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='999',                                           X00052   
               LENGTH=3,                                               X00053   
               POS=(03,41)                                              00054   
*                                                                       00055   
*  SCREEN LINE 05                                                       00056   
*                                                                       00057   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00058   
               INITIAL='P.O. LINE NMBR.......:',                       X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=22,                                              X00061   
               POS=(04,7)                                               00062   
ALINE    DFHMDF ATTRB=(ASKIP),                                         X00063   
               COLOR=BLUE,                                             X00064   
               PICOUT='ZZZ9',                                          X00065   
               LENGTH=4,                                               X00066   
               POS=(04,30)                                              00067   
*                                                                       00068   
*  SCREEN LINE 06                                                       00069   
*                                                                       00070   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00071   
               INITIAL='WORK ORDER NMBR......:',                       X00072   
               COLOR=NEUTRAL,                                          X00073   
               LENGTH=22,                                              X00074   
               POS=(05,7)                                               00075   
AWORDER  DFHMDF ATTRB=(ASKIP),                                         X00076   
               COLOR=BLUE,                                             X00077   
               PICOUT='ZZ9',                                           X00078   
               LENGTH=3,                                               X00079   
               POS=(05,31)                                              00080   
*                                                                       00081   
*  SCREEN LINE 07                                                       00082   
*                                                                       00083   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00084   
               INITIAL='SCREEN SEQUENCE NBR..:',                       X00085   
               COLOR=NEUTRAL,                                          X00086   
               LENGTH=22,                                              X00087   
               POS=(06,7)                                               00088   
ASSEQ    DFHMDF ATTRB=(ASKIP),                                         X00089   
               COLOR=BLUE,                                             X00090   
               PICOUT='ZZ9',                                           X00091   
               LENGTH=3,                                               X00092   
               POS=(06,31)                                              00093   
*                                                                       00094   
*  SCREEN LINE 08                                                       00095   
*                                                                       00096   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00097   
               INITIAL='OPERATING UNIT ID....:',                       X00098   
               COLOR=NEUTRAL,                                          X00099   
               LENGTH=22,                                              X00100   
               POS=(07,7)                                               00101   
AOPUNID  DFHMDF ATTRB=(ASKIP,NUM),                                     X00102   
               COLOR=BLUE,                                             X00103   
               PICOUT='ZZZ9',                                          X00104   
               PICIN='9999',                                           X00105   
               LENGTH=4,                                               X00106   
               POS=(07,30)                                              00107   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00108   
               LENGTH=01,                                              X00109   
               POS=(07,35)                                              00110   
*                                                                       00111   
*  SCREEN LINE 9                                                        00112   
*                                                                       00113   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00114   
               INITIAL='FACILITY ID..........:',                       X00115   
               COLOR=NEUTRAL,                                          X00116   
               LENGTH=22,                                              X00117   
               POS=(08,7)                                               00118   
AFACID   DFHMDF ATTRB=(ASKIP,NUM),                                     X00119   
               COLOR=BLUE,                                             X00120   
               PICOUT='ZZZ9',                                          X00121   
               PICIN='9999',                                           X00122   
               LENGTH=4,                                               X00123   
               POS=(08,30)                                              00124   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00125   
               LENGTH=01,                                              X00126   
               POS=(08,35)                                              00127   
*                                                                       00128   
*  SCREEN LINE 10                                                       00129   
*                                                                       00130   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00131   
               INITIAL='OPERATION ID.........:',                       X00132   
               COLOR=NEUTRAL,                                          X00133   
               LENGTH=22,                                              X00134   
               POS=(09,7)                                               00135   
AOPER    DFHMDF ATTRB=(ASKIP,NUM),                                     X00136   
               COLOR=BLUE,                                             X00137   
               PICOUT='ZZZ9',                                          X00138   
               PICIN='9999',                                           X00139   
               LENGTH=4,                                               X00140   
               POS=(09,30)                                              00141   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00142   
               LENGTH=01,                                              X00143   
               POS=(09,35)                                              00144   
*                                                                       00145   
*  SCREEN LINE 11                                                       00146   
*                                                                       00147   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00148   
               INITIAL='FACILITY AREA ID.....:',                       X00149   
               COLOR=NEUTRAL,                                          X00150   
               LENGTH=22,                                              X00151   
               POS=(10,7)                                               00152   
AFACAID  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=6,                                               X00155   
               POS=(10,30)                                              00156   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00157   
               LENGTH=01,                                              X00158   
               POS=(10,37)                                              00159   
*                                                                       00160   
*  SCREEN LINE 12                                                       00161   
*                                                                       00162   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00163   
               INITIAL='W.O. DESCRIPTION.....:',                       X00164   
               COLOR=NEUTRAL,                                          X00165   
               LENGTH=22,                                              X00166   
               POS=(11,7)                                               00167   
AWODESC  DFHMDF ATTRB=(ASKIP),                                         X00168   
               COLOR=BLUE,                                             X00169   
               LENGTH=32,                                              X00170   
               POS=(11,30)                                              00171   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00172   
               LENGTH=01,                                              X00173   
               POS=(11,63)                                              00174   
*                                                                       00175**2
*  SCREEN LINE 13                                                       00176**2
*                                                                       00177**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00178**2
               INITIAL='PROCESS FCLTY AREA ID:',                       X00179**2
               COLOR=NEUTRAL,                                          X00180**2
               LENGTH=22,                                              X00181**2
               POS=(12,7)                                               00182**3
APRFAID  DFHMDF ATTRB=(ASKIP),                                         X00183**2
               COLOR=BLUE,                                             X00184**2
               LENGTH=06,                                              X00185**2
               POS=(12,30)                                              00186**3
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00187**2
               LENGTH=01,                                              X00188**2
               POS=(12,37)                                              00189**3
*                                                                       00190   
*  SCREEN LINE 14                                                       00191   
*                                                                       00192   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00193   
               INITIAL='LINE LOCATION CODE...:',                       X00194   
               COLOR=NEUTRAL,                                          X00195   
               LENGTH=22,                                              X00196   
               POS=(13,7)                                               00197   
ALINLOC  DFHMDF ATTRB=(UNPROT,NORM),                                   X00198   
               COLOR=GREEN,                                            X00199   
               LENGTH=5,                                               X00200   
               POS=(13,30)                                              00201   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00202   
               LENGTH=01,                                              X00203   
               POS=(13,36)                                              00204   
*                                                                       00205   
*  SCREEN LINE 16                                                       00206   
*                                                                       00207   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00208   
               INITIAL='EXPECTED CARTON COUNT:',                       X00209   
               COLOR=NEUTRAL,                                          X00210   
               LENGTH=22,                                              X00211   
               POS=(15,7)                                               00212   
AECTCNT  DFHMDF ATTRB=(ASKIP),                                         X00213   
               COLOR=BLUE,                                             X00214   
               LENGTH=05,                                              X00215   
               PICOUT='ZZZZ9',                                         X00216   
               PICIN='99999',                                          X00217   
               POS=(15,30)                                              00218   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00219   
               LENGTH=01,                                              X00220   
               POS=(15,36)                                              00221   
*                                                                       00222   
*  SCREEN LINE 17                                                       00223   
*                                                                       00224   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00225   
               INITIAL='ACTUAL CARTON COUNT..:',                       X00226   
               COLOR=NEUTRAL,                                          X00227   
               LENGTH=22,                                              X00228   
               POS=(16,7)                                               00229   
AACTCNT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00230   
               COLOR=GREEN,                                            X00231   
               LENGTH=05,                                              X00232   
               PICOUT='ZZZZ9',                                         X00233   
               PICIN='99999',                                          X00234   
               POS=(16,30)                                              00235   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00236   
               LENGTH=01,                                              X00237   
               POS=(16,36)                                              00238   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00239   
               INITIAL='REPACKED CARTONS.....:',                       X00240   
               COLOR=NEUTRAL,                                          X00241   
               LENGTH=22,                                              X00242   
               POS=(16,41)                                              00243   
ARPKCTN  DFHMDF ATTRB=(UNPROT),                                        X00244   
               COLOR=GREEN,                                            X00245   
               LENGTH=01,                                              X00246   
               POS=(16,64)                                              00247   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00248   
               LENGTH=01,                                              X00249   
               POS=(16,66)                                              00250   
*                                                                       00251   
*  SCREEN LINE 19                                                       00252   
*                                                                       00253   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00254   
               INITIAL='START DATE AND TIME',                          X00255   
               COLOR=NEUTRAL,                                          X00256   
               LENGTH=19,                                              X00257   
               POS=(18,10)                                              00258   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00259   
               INITIAL='COMPLETE DATE AND TIME',                       X00260   
               COLOR=NEUTRAL,                                          X00261   
               LENGTH=22,                                              X00262   
               POS=(18,41)                                              00263   
*                                                                       00264   
*  SCREEN LINE 20                                                       00265   
*                                                                       00266   
ASDATE   DFHMDF ATTRB=(ASKIP),                                         X00267   
               COLOR=BLUE,                                             X00268   
               LENGTH=08,                                              X00269   
               POS=(19,10)                                              00270   
ASTIME   DFHMDF ATTRB=(ASKIP),                                         X00271   
               COLOR=BLUE,                                             X00272   
               LENGTH=08,                                              X00273   
               POS=(19,22)                                              00274   
AEDATE   DFHMDF ATTRB=(ASKIP),                                         X00275   
               COLOR=BLUE,                                             X00276   
               LENGTH=08,                                              X00277   
               POS=(19,43)                                              00278   
AETIME   DFHMDF ATTRB=(ASKIP),                                         X00279   
               COLOR=BLUE,                                             X00280   
               LENGTH=08,                                              X00281   
               POS=(19,55)                                              00282   
*                                                                       00283   
         DFHMSD TYPE=FINAL                                              00284   
         END                                                            00285   
