*********************************************************************** 00010001
*                                                                       00020001
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030001
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040001
*********************************************************************** 00050001
        PRINT NOGEN                                                     00060001
PCKM865  DFHMSD TYPE=MAP,                                              X00070001
               LANG=COBOL,                                             X00080001
               MODE=INOUT,                                             X00090001
               TIOAPFX=YES,                                            X00100001
               CTRL=FREEKB                                              00110001
PC865A   DFHMDI SIZE=(08,22),                                          X00120001
               LINE=1,                                                 X00130001
               COLUMN=1,                                               X00140001
               MAPATTS=(COLOR,HILIGHT),                                X00150001
               DSATTS=(COLOR,HILIGHT)                                   00160001
*********************************************************************** 00170001
ACARTN   DFHMDF POS=(01,01),                                           X00180001
               LENGTH=020,                                             X00190001
               ATTRB=(ASKIP,NORM,FSET)                                  00200011
         DFHMDF POS=(01,22),                                           X00210001
               LENGTH=000,                                             X00220001
               ATTRB=(ASKIP)                                            00230001
*********************************************************************** 00240001
         DFHMDF POS=(02,03),                                           X00250001
               LENGTH=016,                                             X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               INITIAL='SCAN/KEY BARCODE'                               00280001
         DFHMDF POS=(02,20),                                           X00290001
               LENGTH=000,                                             X00300001
               ATTRB=(ASKIP)                                            00310001
*********************************************************************** 00320001
ABRCDE   DFHMDF POS=(03,01),                                           X00330005
               LENGTH=020,                                             X00340001
               ATTRB=(UNPROT,NORM,FSET),                               X00350011
               HILIGHT=UNDERLINE                                        00360001
         DFHMDF POS=(03,22),                                           X00370001
               LENGTH=000,                                             X00380001
               ATTRB=(ASKIP)                                            00390001
*********************************************************************** 00400001
         DFHMDF POS=(04,01),                                           X00410001
               LENGTH=009,                                             X00420001
               ATTRB=(ASKIP,NORM),                                     X00430001
               INITIAL='DEST STR:'                                      00440001
ASTR     DFHMDF POS=(04,11),                                           X00450001
               LENGTH=004,                                             X00460001
               ATTRB=(ASKIP,NORM,FSET)                                  00470010
         DFHMDF POS=(04,16),                                           X00480001
               LENGTH=000,                                             X00490001
               ATTRB=(ASKIP)                                            00500001
*********************************************************************** 00510001
         DFHMDF POS=(05,01),                                           X00520001
               LENGTH=014,                                             X00530001
               ATTRB=(ASKIP,NORM),                                     X00540001
               INITIAL='CTNS IN MASTER'                                 00550001
ACTNMSTR DFHMDF POS=(05,16),                                           X00560002
               LENGTH=004,                                             X00570001
               ATTRB=(ASKIP,NORM,FSET),                                X00580010
               PICOUT='9999'                                            00590001
         DFHMDF POS=(05,21),                                           X00600002
               LENGTH=000,                                             X00610001
               ATTRB=(ASKIP)                                            00620001
*********************************************************************** 00630001
         DFHMDF POS=(07,01),                                           X00720001
               LENGTH=010,                                             X00730001
               ATTRB=(ASKIP,NORM),                                     X00740001
               INITIAL='F5-REPRINT'                                     00750001
APRTR    DFHMDF POS=(07,12),                                           X00760007
               LENGTH=003,                                             X00770009
               ATTRB=(UNPROT,NORM,FSET),                               X00780011
               HILIGHT=UNDERLINE                                        00790008
         DFHMDF POS=(07,16),                                           X00800009
               LENGTH=000,                                             X00810001
               ATTRB=(ASKIP)                                            00820001
*********************************************************************** 00830001
AMSGLN   DFHMDF POS=(08,01),                                           X00840001
               LENGTH=019,                                             X00850001
               ATTRB=(ASKIP,NORM)                                       00860001
*********************************************************************** 00870001
*********************************************************************** 00880001
         DFHMSD TYPE=FINAL                                              00890012
         END                                                            00900001
