        PRINT NOGEN                                                     00001   
PCKM855  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC855A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL=' SCAN/KEY FAST NBR '                            00015*29
*                                                                       00016   
AFAST    DFHMDF POS=(02,04),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC,FSET)                              00053   
         DFHMDF POS=(02,18),                                           X00034*22
               LENGTH=001,                                             X00035*22
               ATTRB=(ASKIP,DRK)                                        00036*14
*                                                                       00041*22
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='  TO ASSOCIATE TO  '                            00015*29
*                                                                       00041*22
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='    CURRENT SML    '                            00015*29
*                                                                       00041*22
ASML     DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=018,                                             X00035*22
               PICOUT='9(18)',                                         X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
*                                                                       00041*22
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='STORE:'                                         00015*29
ASTORE   DFHMDF POS=(06,08),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
         DFHMDF POS=(06,13),                                           X00034*22
               LENGTH=001,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='('                                              00015*29
ACOUNT   DFHMDF POS=(06,15),                                           X00034*22
               LENGTH=003,                                             X00035*22
               PICOUT='ZZ9',                                           X00035*22
               ATTRB=(ASKIP,NORM,FSET)                                  00036*14
         DFHMDF POS=(06,19),                                           X00034*22
               LENGTH=001,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL=')'                                              00015*29
*                                                                       00072**5
AMSGLN   DFHMDF POS=(07,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM,FSET)                                  00075*24
*                                                                       00055   
         DFHMDF POS=(08,02),                                           X00034*22
               LENGTH=014,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F3 = END'                                       00015*29
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
