*          DATA SET PCKM887                                             00010082
        PRINT NOGEN                                                     00020081
PCKM887  DFHMSD TYPE=MAP,                                              X00030081
               LANG=COBOL,                                             X00040081
               MODE=INOUT,                                             X00050081
               TIOAPFX=YES,                                            X00060081
               CTRL=FREEKB                                              00070081
PC887A   DFHMDI SIZE=(16,20),                                          X00090081
               LINE=1,                                                 X00100081
               COLUMN=1,                                               X00110081
               MAPATTS=HILIGHT,                                        X00120081
               DSATTS=HILIGHT                                           00130081
         DFHMDF POS=(01,01),                                           X00131182
               LENGTH=018,                                             X00131282
               ATTRB=(ASKIP,NORM),                                     X00131382
               INITIAL='CRTN DIVERT STATUS'                             00131482
ACARTNID DFHMDF POS=(02,01),                                           X00132082
               LENGTH=020,                                             X00133091
               ATTRB=(UNPROT,NORM)                                      00133185
ADVRTMSG DFHMDF POS=(03,02),                                           X00134291
               LENGTH=018,                                             X00134391
               ATTRB=(ASKIP,NORM)                                       00134482
         DFHMDF POS=(04,01),                                           X00136082
               LENGTH=010,                                             X00137082
               ATTRB=(ASKIP,NORM),                                     X00138081
               INITIAL='# DIVERTS:'                                     00139082
ADIVERTS DFHMDF POS=(04,12),                                           X00150082
               LENGTH=004,                                             X00160082
               ATTRB=(ASKIP,NORM)                                       00170081
ADTETIM  DFHMDF POS=(05,001),                                          X00171182
               ATTRB=(ASKIP,NORM),                                     X00171282
               LENGTH=017                                               00171382
         DFHMDF POS=(06,01),                                           X00171582
               LENGTH=05,                                              X00171682
               ATTRB=(ASKIP,NORM),                                     X00171782
               INITIAL='D-STR'                                          00171882
ADSTORE  DFHMDF POS=(06,07),                                           X00172083
               LENGTH=004,                                             X00172182
               ATTRB=(ASKIP,NORM)                                       00172282
         DFHMDF POS=(06,12),                                           X00172482
               LENGTH=02,                                              X00172582
               ATTRB=(ASKIP,NORM),                                     X00172682
               INITIAL='DR'                                             00172782
                                                                        00172882
ADOOR    DFHMDF POS=(06,15),                                           X00172982
               LENGTH=004,                                             X00173082
               ATTRB=(ASKIP,NORM)                                       00173182
         DFHMDF POS=(07,01),                                           X00173382
               LENGTH=003,                                             X00173493
               ATTRB=(ASKIP,NORM),                                     X00174082
               INITIAL='STR'                                            00175094
ASTORE   DFHMDF POS=(07,05),                                           X00175193
               LENGTH=004,                                             X00175282
               ATTRB=(ASKIP,NORM)                                       00175382
         DFHMDF POS=(07,12),                                           X00175493
               LENGTH=002,                                             X00175593
               ATTRB=(ASKIP,NORM),                                     X00175693
               INITIAL='DC'                                             00175793
ADC      DFHMDF POS=(07,15),                                           X00175893
               LENGTH=004,                                             X00175993
               ATTRB=(ASKIP,NORM)                                       00176093
AMSGLN   DFHMDF POS=(08,01),                                           X00176286
               LENGTH=019,                                             X00176386
               ATTRB=(ASKIP,NORM)                                       00177086
         DFHMDF POS=(09,001),                                          X00181082
               ATTRB=(ASKIP,NORM),                                     X00182082
               LENGTH=003,                                             X00183082
               INITIAL='PO:'                                            00184082
                                                                        00185082
APORCVR  DFHMDF POS=(09,005),                                          X00186082
               ATTRB=(ASKIP,NORM),                                     X00187082
               LENGTH=013                                               00188089
ALNEPCK  DFHMDF POS=(10,001),                                          X00189182
               ATTRB=(ASKIP,NORM),                                     X00189282
               LENGTH=004                                               00189382
ATEXT    DFHMDF POS=(10,006),                                          X00189582
               ATTRB=(ASKIP,NORM),                                     X00189682
               LENGTH=0004                                              00189782
AUNTPCK  DFHMDF POS=(11,01),                                           X00189982
               LENGTH=019,                                             X00190082
               ATTRB=(ASKIP,NORM)                                       00191082
         DFHMDF POS=(12,01),                                           X00191286
               LENGTH=013,                                             X00191386
               ATTRB=(ASKIP,NORM),                                     X00191486
               INITIAL='LAST ACTIVITY'                                  00191686
ALSTACT  DFHMDF POS=(13,01),                                           X00192086
               LENGTH=019,                                             X00193082
               ATTRB=(ASKIP,NORM)                                       00194082
         DFHMDF POS=(14,01),                                           X00196082
               LENGTH=005,                                             X00197082
               ATTRB=(ASKIP,NORM),                                     X00198082
               INITIAL='SCAC:'                                          00199082
ASCAC    DFHMDF POS=(14,08),                                           X00199282
               LENGTH=004,                                             X00199382
               ATTRB=(ASKIP,NORM)                                       00199482
         DFHMDF POS=(15,001),                                          X00199682
               ATTRB=(ASKIP,NORM),                                     X00199782
               LENGTH=007,                                             X00199882
               INITIAL='SRLNBR:'                                        00199982
ANBR     DFHMDF POS=(15,009),                                          X00201082
               ATTRB=(ASKIP,NORM),                                     X00202082
               LENGTH=009                                               00203082
AFKMSG   DFHMDF POS=(16,01),                                           X00500090
               LENGTH=019,                                             X00510081
               ATTRB=(ASKIP,NORM),                                     X00520088
               INITIAL='F8-CARTON STATUS'                               00521092
         DFHMSD TYPE=FINAL                                              00630093
         END                                                            00640081
