        PRINT NOGEN                                                             
PCKM870  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
PC870A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
         DFHMDF POS=(01,03),                                           X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='OPEN TRAILER'                                           
*                                                                               
         DFHMDF POS=(02,01),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DOOR:'                                                  
ADOOR    DFHMDF POS=(02,09),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(UNPROT,NORM,IC,FSET)                                      
         DFHMDF POS=(02,14),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
         DFHMDF POS=(03,01),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DEST:'                                                  
ADEST    DFHMDF POS=(03,09),                                           X        
               LENGTH=004,                                             X        
               PICOUT='ZZZZ',                                          X        
               ATTRB=(UNPROT,NORM,NUM,FSET)                                     
         DFHMDF POS=(03,14),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TL:'                                                    
ALENGTH  DFHMDF POS=(03,18),                                           X        
               LENGTH=002,                                             X        
               PICOUT='ZZ',                                            X        
               ATTRB=(ASKIP,NORM,FSET)                                          
*                                                                               
         DFHMDF POS=(04,01),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='SRL NBR'                                                
ASERIAL  DFHMDF POS=(04,09),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(UNPROT,NORM,NUM,FSET)                                     
         DFHMDF POS=(04,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
ASCAC    DFHMDF POS=(05,01),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
ATRLR    DFHMDF POS=(05,06),                                           X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
*                                                                               
         DFHMDF POS=(06,01),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRIP ID:'                                               
ATRIP    DFHMDF POS=(06,09),                                           X        
               LENGTH=009,                                             X        
               PICOUT='Z(9)',                                          X        
               ATTRB=(UNPROT,NORM,FSET,NUM)                                     
         DFHMDF POS=(06,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
         DFHMDF POS=(07,01),                                           X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='NBR PALLETS:'                                           
APALL    DFHMDF POS=(07,14),                                           X        
               LENGTH=004,                                             X        
               PICOUT='Z(4)',                                          X        
               ATTRB=(UNPROT,NORM,FSET,NUM)                                     
         DFHMDF POS=(07,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
                                                                                
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
                                                                                
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
