        PRINT NOGEN                                                             
PCKM743  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
PC743A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
         DFHMDF POS=(01,03),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRAILER ASSOCIATE'                                      
*                                                                               
         DFHMDF POS=(02,01),                                           X        
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='USER ID:'                                               
AUSER    DFHMDF POS=(02,10),                                           X        
               LENGTH=008,                                             X        
               ATTRB=(UNPROT,NORM,IC,FSET)                                      
         DFHMDF POS=(02,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
         DFHMDF POS=(03,01),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='SCAN/KEY DOOR # OR'                                     
         DFHMDF POS=(04,01),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRAILER SERIAL # '                                      
*                                                                               
ADOOR    DFHMDF POS=(05,01),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(UNPROT,NORM,FSET)                                         
         DFHMDF POS=(05,11),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
         DFHMDF POS=(06,01),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRIP ID:'                                               
ATRIP    DFHMDF POS=(06,09),                                           X        
               LENGTH=009,                                             X        
               PICOUT='Z(9)',                                          X        
               ATTRB=(ASKIP,NORM,FSET)                                          
                                                                                
AMSGLN   DFHMDF POS=(07,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
                                                                                
         DFHMDF POS=(08,01),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM,FSET),                                X        
               INITIAL='F2 TO CONTINUE'                                         
                                                                                
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
