  PRINT  NOGEN                                                          00010019
*-------------------------------------------------------------------*   00020019
*                                                                   *   00030019
*        MAPSET  PCKM717                                            *   00040019
*        MAP     PC717A                                             *   00050019
*        PROGRAM PCKCS717                                           *   00060019
*        TRANSID E717                                               *   00070019
*        SYSTEM  CICS ARCHITECTURE - PROC CNTL PRINT MISC LABEL     *   00080019
*                                                                   *   00090019
*-------------------------------------------------------------------*   00100019
PCKM717 DFHMSD TYPE=DSECT,                                             X00110019
               LANG=COBOL,                                             X00120019
               MODE=INOUT,                                             X00130019
               STORAGE=AUTO,                                           X00140019
               TERM=3270-2,                                            X00150019
               TIOAPFX=YES                                              00160019
PC717A  DFHMDI LINE=2,COLUMN=1,                                        X00170019
               SIZE=(19,80),                                           X00180019
               CTRL=(FREEKB),                                          X00190019
               MAPATTS=(COLOR,HILIGHT),                                X00200019
               DSATTS=(COLOR,HILIGHT)                                   00210019
*                                                                       00220019
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00230019
               INITIAL='OPERATING UNIT.:',                             X00240019
               LENGTH=16,                                              X00250019
               POS=(02,24)                                              00260019
AOPUNIT DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00270019
               LENGTH=4,                                               X00280019
               COLOR=GREEN,                                            X00290019
               HILIGHT=UNDERLINE,                                      X00300019
               POS=(02,41)                                              00310019
AOPDESC DFHMDF ATTRB=(ASKIP),                                          X00320019
               LENGTH=24,                                              X00330019
               COLOR=BLUE,                                             X00340019
               POS=(02,46)                                              00350019
*                                                                       00360019
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00370019
               INITIAL='FACILITY.......:',                             X00380019
               LENGTH=16,                                              X00390019
               POS=(03,24)                                              00400019
AFACIL  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00410019
               LENGTH=4,                                               X00420019
               COLOR=GREEN,                                            X00430019
               HILIGHT=UNDERLINE,                                      X00440019
               POS=(03,41)                                              00450019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00460019
               INITIAL=' ',                                            X00470019
               LENGTH=01,                                              X00480019
               POS=(03,46)                                              00481019
*                                                                       00482019
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00483019
               INITIAL='PRINTER NUMBER.:',                             X00484019
               LENGTH=16,                                              X00485019
               POS=(04,24)                                              00486019
APRTR   DFHMDF ATTRB=(UNPROT,NORM,NUM,IC),                             X00487019
               LENGTH=3,                                               X00488019
               COLOR=GREEN,                                            X00489019
               HILIGHT=UNDERLINE,                                      X00490019
               POS=(04,42)                                              00500019
APRDESC DFHMDF ATTRB=ASKIP,                                            X00510019
               LENGTH=25,                                              X00520019
               COLOR=BLUE,                                             X00530019
               POS=(04,46)                                              00540019
*                                                                       00550019
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00560019
               INITIAL='SETS OF LABELS.:',                             X00570019
               LENGTH=16,                                              X00580019
               POS=(05,24)                                              00590019
ASETS   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00600019
               LENGTH=4,                                               X00610019
               COLOR=GREEN,                                            X00620019
               HILIGHT=UNDERLINE,                                      X00630019
               POS=(05,41)                                              00640019
*                                                                       00650019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00660019
               INITIAL=' ',                                            X00670019
               LENGTH=01,                                              X00670119
               POS=(05,46)                                              00670219
*                                                                       00670319
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00670419
               INITIAL='QUALIFIER',                                    X00670519
               LENGTH=09,                                              X00670619
               POS=(07,04)                                              00670719
*                                                                       00670819
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00670919
               INITIAL='RANGE (IF NUMERIC)',                           X00671019
               LENGTH=18,                                              X00672019
               POS=(07,18)                                              00673019
*                                                                       00674019
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00675019
               INITIAL='SEPARATOR (FOR PRINTING)',                     X00676019
               LENGTH=24,                                              X00677019
               POS=(07,38)                                              00678019
*                                                                       00679019
AQLFR1  DFHMDF ATTRB=(UNPROT,NORM),                                    X00680019
               LENGTH=12,                                              X00690019
               COLOR=GREEN,                                            X00700019
               HILIGHT=UNDERLINE,                                      X00710019
               POS=(08,04)                                              00720019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00730019
               INITIAL=' ',                                            X00740019
               LENGTH=01,                                              X00740119
               POS=(08,17)                                              00740219
*                                                                       00740319
AQLFR2  DFHMDF ATTRB=(UNPROT,NORM),                                    X00740419
               LENGTH=12,                                              X00740519
               COLOR=GREEN,                                            X00740619
               HILIGHT=UNDERLINE,                                      X00740719
               POS=(09,04)                                              00740819
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00740919
               INITIAL=' ',                                            X00741019
               LENGTH=01,                                              X00742019
               POS=(09,17)                                              00743019
*                                                                       00744019
AQLFR3  DFHMDF ATTRB=(UNPROT,NORM),                                    X00745019
               LENGTH=12,                                              X00746019
               COLOR=GREEN,                                            X00747019
               HILIGHT=UNDERLINE,                                      X00748019
               POS=(10,04)                                              00749019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00749119
               INITIAL=' ',                                            X00749219
               LENGTH=01,                                              X00749319
               POS=(10,17)                                              00749419
*                                                                       00749519
AQLFR4  DFHMDF ATTRB=(UNPROT,NORM),                                    X00749619
               LENGTH=12,                                              X00749719
               COLOR=GREEN,                                            X00749819
               HILIGHT=UNDERLINE,                                      X00749919
               POS=(11,04)                                              00750019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00750119
               INITIAL=' ',                                            X00750219
               LENGTH=01,                                              X00750319
               POS=(11,17)                                              00750419
*                                                                       00750519
ARANGE1 DFHMDF ATTRB=(UNPROT,NORM),                                    X00750619
               LENGTH=12,                                              X00750719
               COLOR=GREEN,                                            X00750819
               HILIGHT=UNDERLINE,                                      X00750919
               POS=(08,18)                                              00751019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00752019
               INITIAL=' ',                                            X00753019
               LENGTH=01,                                              X00754019
               POS=(08,31)                                              00754119
*                                                                       00754219
ARANGE2 DFHMDF ATTRB=(UNPROT,NORM),                                    X00754319
               LENGTH=12,                                              X00754419
               COLOR=GREEN,                                            X00754519
               HILIGHT=UNDERLINE,                                      X00754619
               POS=(09,18)                                              00754719
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00754819
               INITIAL=' ',                                            X00754919
               LENGTH=01,                                              X00755019
               POS=(09,31)                                              00756019
*                                                                       00757019
ARANGE3 DFHMDF ATTRB=(UNPROT,NORM),                                    X00758019
               LENGTH=12,                                              X00759019
               COLOR=GREEN,                                            X00759119
               HILIGHT=UNDERLINE,                                      X00759219
               POS=(10,18)                                              00759319
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00759419
               INITIAL=' ',                                            X00759519
               LENGTH=01,                                              X00759619
               POS=(10,31)                                              00759719
*                                                                       00759819
ARANGE4 DFHMDF ATTRB=(UNPROT,NORM),                                    X00759919
               LENGTH=12,                                              X00760019
               COLOR=GREEN,                                            X00761019
               HILIGHT=UNDERLINE,                                      X00762019
               POS=(11,18)                                              00763019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00763119
               INITIAL=' ',                                            X00763219
               LENGTH=01,                                              X00763319
               POS=(11,31)                                              00763419
*                                                                       00763519
ASEPR1  DFHMDF ATTRB=(UNPROT,NORM),                                    X00763619
               LENGTH=01,                                              X00763719
               COLOR=GREEN,                                            X00763819
               HILIGHT=UNDERLINE,                                      X00763919
               POS=(08,41)                                              00764019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00765019
               INITIAL=' ',                                            X00766019
               LENGTH=01,                                              X00767019
               POS=(08,43)                                              00768019
*                                                                       00769019
ASEPR2  DFHMDF ATTRB=(UNPROT,NORM),                                    X00769119
               LENGTH=01,                                              X00769219
               COLOR=GREEN,                                            X00769319
               HILIGHT=UNDERLINE,                                      X00769419
               POS=(09,41)                                              00769519
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00769619
               INITIAL=' ',                                            X00769719
               LENGTH=01,                                              X00769819
               POS=(09,43)                                              00769919
*                                                                       00770019
ASEPR3  DFHMDF ATTRB=(UNPROT,NORM),                                    X00770119
               LENGTH=01,                                              X00770219
               COLOR=GREEN,                                            X00770319
               HILIGHT=UNDERLINE,                                      X00770419
               POS=(10,41)                                              00770519
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00770619
               INITIAL=' ',                                            X00770719
               LENGTH=01,                                              X00770819
               POS=(10,43)                                              00770919
*                                                                       00771019
ASEPR4  DFHMDF ATTRB=(UNPROT,NORM),                                    X00772019
               LENGTH=01,                                              X00773019
               COLOR=GREEN,                                            X00774019
               HILIGHT=UNDERLINE,                                      X00775019
               POS=(11,41)                                              00776019
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00777019
               INITIAL=' ',                                            X00778019
               LENGTH=01,                                              X00778119
               POS=(11,43)                                              00778219
*                                                                       00778319
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00778419
               INITIAL='PRINT BARCODE:',                               X00778519
               LENGTH=14,                                              X00778619
               POS=(14,04)                                              00778719
*                                                                       00778819
APRTBR1 DFHMDF ATTRB=(UNPROT,NORM),                                    X00778919
               LENGTH=01,                                              X00779019
               COLOR=GREEN,                                            X00779119
               HILIGHT=UNDERLINE,                                      X00779219
               POS=(14,20)                                              00779319
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00779419
               LENGTH=05,                                              X00779519
               COLOR=NEUTRAL,                                          X00779619
               POS=(14,22),                                            X00779719
               INITIAL='(Y/N)'                                          00779819
*                                                                       00779919
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00780019
               INITIAL='LABEL COMMENTS',                               X00780119
               LENGTH=14,                                              X00780219
               POS=(16,04)                                              00780319
*                                                                       00780419
ACMNT1  DFHMDF ATTRB=(UNPROT,NORM),                                    X00780519
               LENGTH=30,                                              X00780619
               COLOR=GREEN,                                            X00780719
               HILIGHT=UNDERLINE,                                      X00780819
               POS=(17,04)                                              00780919
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00781019
               INITIAL=' ',                                            X00781119
               LENGTH=01,                                              X00781219
               POS=(17,35)                                              00781319
*                                                                       00781419
ACMNT2  DFHMDF ATTRB=(UNPROT,NORM),                                    X00781519
               LENGTH=30,                                              X00781619
               COLOR=GREEN,                                            X00781719
               HILIGHT=UNDERLINE,                                      X00781819
               POS=(18,04)                                              00781919
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00782019
               INITIAL=' ',                                            X00783019
               LENGTH=01,                                              X00784019
               POS=(18,35)                                              00785019
*                                                                       00786019
ACMNT3  DFHMDF ATTRB=(UNPROT,NORM),                                    X00786119
               LENGTH=30,                                              X00786219
               COLOR=GREEN,                                            X00786319
               HILIGHT=UNDERLINE,                                      X00786419
               POS=(19,04)                                              00786519
*                                                                       00786619
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00786719
               INITIAL=' ',                                            X00786819
               LENGTH=01,                                              X00786919
               POS=(19,35)                                              00787019
*                                                                       00788019
*                                                                       00789019
         DFHMSD TYPE=FINAL                                              00789119
         END                                                            00789219
