*          DATA SET PCKM156    AT LEVEL 004 AS OF 11/21/95                      
*          DATA SET PCKM156    AT LEVEL 029 AS OF 02/24/94              00001   
*********************************************************************** 00002   
*                                                                       00003   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00004   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00005   
*********************************************************************** 00006   
        PRINT NOGEN                                                     00007   
PCKM156 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00008   
PC156A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00009   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00010   
*********************************************************************** 00011   
AOPUNT  DFHMDF POS=(1,01),LENGTH=04,ATTRB=(ASKIP,NORM),                X00012   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00013   
AFACTY  DFHMDF POS=(1,07),LENGTH=04,ATTRB=(ASKIP,NORM),                X00014   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00015   
**********************************************************************  00016   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00017   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00018   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00019   
               COLOR=GREEN,                                            X00020   
               HILIGHT=UNDERLINE,                                      X00021   
               PICOUT='ZZZZ9'                                           00022   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00023   
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TO'                                             00025   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00026   
               COLOR=BLUE,                                             X00027   
               PICOUT='ZZZZ9'                                           00028   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00029   
               COLOR=NEUTRAL,                                          X00030   
               INITIAL='OF'                                             00031   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00032   
               COLOR=BLUE,                                             X00033   
               PICOUT='ZZZZ9'                                           00034   
**********************************************************************  00035   
        DFHMDF POS=(04,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00036   
               INITIAL='P.O. NUMBER.....:'                              00037   
APONBR  DFHMDF POS=(04,19),LENGTH=08,ATTRB=(ASKIP,NORM),               X00038   
               COLOR=BLUE                                               00039   
        DFHMDF POS=(04,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00040   
               INITIAL='EXPTED CART QTY:'                               00041   
AEXQTY  DFHMDF POS=(04,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00042   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00043   
        DFHMDF POS=(04,60),LENGTH=07,ATTRB=(ASKIP,BRT),                X00044   
               INITIAL='STATUS:'                                        00045   
ASTAT   DFHMDF POS=(04,68),LENGTH=02,ATTRB=(ASKIP,NORM),               X00046   
               COLOR=BLUE                                               00047   
**********************************************************************  00048   
        DFHMDF POS=(05,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00049   
               INITIAL='SEQUENCE NBR....:'                              00050   
ASEQNBR DFHMDF POS=(05,19),LENGTH=03,ATTRB=(ASKIP,NORM),               X00051   
               COLOR=BLUE                                               00052   
        DFHMDF POS=(05,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00053   
               INITIAL='ACTUAL CART QTY:'                               00054   
AACQTY  DFHMDF POS=(05,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00056   
        DFHMDF POS=(05,58),LENGTH=09,ATTRB=(ASKIP,BRT),                X00057**4
               INITIAL='TRBL RSN:'                                      00058**2
ATRBL   DFHMDF POS=(05,68),LENGTH=11,ATTRB=(ASKIP,NORM),               X00059**4
               COLOR=YELLOW                                             00060   
**********************************************************************  00061   
        DFHMDF POS=(06,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00062   
               INITIAL='DEPT............:'                                      
ADEPT   DFHMDF POS=(06,19),LENGTH=03,ATTRB=(ASKIP,NORM),               X00062   
               COLOR=BLUE                                                       
        DFHMDF POS=(06,26),LENGTH=02,ATTRB=(ASKIP,BRT),                X00062   
               INITIAL='  '                                             00063   
        DFHMDF POS=(06,29),LENGTH=1,ATTRB=ASKIP                         00064   
        DFHMDF POS=(06,68),LENGTH=11,ATTRB=(ASKIP,BRT),                X00065   
               INITIAL='NBR  WRKORD'                                    00066   
**********************************************************************  00067   
        DFHMDF POS=(07,09),LENGTH=04,ATTRB=(ASKIP,BRT),                X00068   
               INITIAL='LINE'                                           00069   
        DFHMDF POS=(07,15),LENGTH=1,ATTRB=ASKIP                         00070   
        DFHMDF POS=(07,26),LENGTH=06,ATTRB=(ASKIP,BRT),                X00071   
               INITIAL='WO OTR'                                         00072   
        DFHMDF POS=(07,33),LENGTH=1,ATTRB=ASKIP                         00073   
        DFHMDF POS=(07,36),LENGTH=41,ATTRB=(ASKIP,BRT),                X00074   
               INITIAL='PS   DETAL VERFY  CREATE CREATE WORK CART'      00075   
        DFHMDF POS=(07,78),LENGTH=1,ATTRB=ASKIP                         00076   
**********************************************************************  00077   
        DFHMDF POS=(08,05),LENGTH=29,ATTRB=(ASKIP,BRT),                X00078   
               INITIAL='S   NUMB CL   SKU    ST ITEM '                  00079   
        DFHMDF POS=(08,35),LENGTH=41,ATTRB=(ASKIP,BRT),                X00080   
               INITIAL='ITEM  ITEM  ITEM    DATE   TIME  ORDS QTY'      00081   
        DFHMDF POS=(08,77),LENGTH=1,ATTRB=ASKIP                         00082   
**********************************************************************  00083   
        DFHMDF POS=(09,5),LENGTH=29,ATTRB=(ASKIP,BRT),                 X00084   
               INITIAL='-   ---- -- -------- -- ---- '                  00085   
        DFHMDF POS=(09,35),LENGTH=43,ATTRB=(ASKIP,BRT),                X00086   
               INITIAL='----- ----- ----- -------- ----- ---- -----'    00087   
        DFHMDF POS=(09,79),LENGTH=1,ATTRB=ASKIP                         00088   
**********************************************************************  00089   
ASEL01  DFHMDF POS=(10,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(10,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN01  DFHMDF POS=(10,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS01  DFHMDF POS=(10,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU01  DFHMDF POS=(10,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT01  DFHMDF POS=(10,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR01  DFHMDF POS=(10,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI01  DFHMDF POS=(10,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI01  DFHMDF POS=(10,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI01  DFHMDF POS=(10,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT01  DFHMDF POS=(10,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM01  DFHMDF POS=(10,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK01  DFHMDF POS=(10,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ01  DFHMDF POS=(10,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(10,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
**********************************************************************  00089   
ASEL02  DFHMDF POS=(11,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(11,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN02  DFHMDF POS=(11,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS02  DFHMDF POS=(11,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU02  DFHMDF POS=(11,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT02  DFHMDF POS=(11,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR02  DFHMDF POS=(11,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI02  DFHMDF POS=(11,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI02  DFHMDF POS=(11,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI02  DFHMDF POS=(11,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT02  DFHMDF POS=(11,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM02  DFHMDF POS=(11,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK02  DFHMDF POS=(11,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ02  DFHMDF POS=(11,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(11,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL03  DFHMDF POS=(12,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(12,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN03  DFHMDF POS=(12,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS03  DFHMDF POS=(12,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU03  DFHMDF POS=(12,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT03  DFHMDF POS=(12,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR03  DFHMDF POS=(12,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI03  DFHMDF POS=(12,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI03  DFHMDF POS=(12,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI03  DFHMDF POS=(12,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT03  DFHMDF POS=(12,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM03  DFHMDF POS=(12,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK03  DFHMDF POS=(12,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ03  DFHMDF POS=(12,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(12,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL04  DFHMDF POS=(13,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(13,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN04  DFHMDF POS=(13,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS04  DFHMDF POS=(13,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU04  DFHMDF POS=(13,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT04  DFHMDF POS=(13,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR04  DFHMDF POS=(13,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI04  DFHMDF POS=(13,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI04  DFHMDF POS=(13,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI04  DFHMDF POS=(13,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT04  DFHMDF POS=(13,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM04  DFHMDF POS=(13,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK04  DFHMDF POS=(13,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ04  DFHMDF POS=(13,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(13,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL05  DFHMDF POS=(14,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(14,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN05  DFHMDF POS=(14,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS05  DFHMDF POS=(14,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU05  DFHMDF POS=(14,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT05  DFHMDF POS=(14,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR05  DFHMDF POS=(14,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI05  DFHMDF POS=(14,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI05  DFHMDF POS=(14,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI05  DFHMDF POS=(14,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT05  DFHMDF POS=(14,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM05  DFHMDF POS=(14,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK05  DFHMDF POS=(14,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ05  DFHMDF POS=(14,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(14,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL06  DFHMDF POS=(15,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(15,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN06  DFHMDF POS=(15,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS06  DFHMDF POS=(15,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU06  DFHMDF POS=(15,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT06  DFHMDF POS=(15,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR06  DFHMDF POS=(15,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI06  DFHMDF POS=(15,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI06  DFHMDF POS=(15,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI06  DFHMDF POS=(15,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT06  DFHMDF POS=(15,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM06  DFHMDF POS=(15,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK06  DFHMDF POS=(15,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ06  DFHMDF POS=(15,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(15,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL07  DFHMDF POS=(16,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(16,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN07  DFHMDF POS=(16,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS07  DFHMDF POS=(16,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU07  DFHMDF POS=(16,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT07  DFHMDF POS=(16,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR07  DFHMDF POS=(16,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI07  DFHMDF POS=(16,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI07  DFHMDF POS=(16,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI07  DFHMDF POS=(16,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT07  DFHMDF POS=(16,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM07  DFHMDF POS=(16,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK07  DFHMDF POS=(16,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ07  DFHMDF POS=(16,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(16,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL08  DFHMDF POS=(17,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(17,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN08  DFHMDF POS=(17,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS08  DFHMDF POS=(17,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU08  DFHMDF POS=(17,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT08  DFHMDF POS=(17,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR08  DFHMDF POS=(17,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI08  DFHMDF POS=(17,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI08  DFHMDF POS=(17,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI08  DFHMDF POS=(17,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT08  DFHMDF POS=(17,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM08  DFHMDF POS=(17,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK08  DFHMDF POS=(17,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ08  DFHMDF POS=(17,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(17,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00117   
ASEL09  DFHMDF POS=(18,05),LENGTH=01,ATTRB=(UNPROT,NORM),              X00090   
               HILIGHT=UNDERLINE,                                      X00091   
               COLOR=GREEN                                              00092   
        DFHMDF POS=(18,07),LENGTH=1,ATTRB=ASKIP                         00093   
ALNN09  DFHMDF POS=(18,09),LENGTH=04,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00095   
ACLS09  DFHMDF POS=(18,14),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094   
               COLOR=BLUE,PICOUT='99'                                   00095   
ASKU09  DFHMDF POS=(18,17),LENGTH=08,ATTRB=(ASKIP,NORM),               X00096   
               COLOR=BLUE                                               00097   
ASTT09  DFHMDF POS=(18,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00098   
               COLOR=BLUE                                               00099   
AOTR09  DFHMDF POS=(18,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
APSI09  DFHMDF POS=(18,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00102   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00103   
ADTI09  DFHMDF POS=(18,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00104   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00105   
AVFI09  DFHMDF POS=(18,47),LENGTH=05,ATTRB=(ASKIP,NORM),               X00106   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00107   
ACDT09  DFHMDF POS=(18,53),LENGTH=08,ATTRB=(ASKIP,NORM),               X00108   
               COLOR=BLUE                                               00109   
ACTM09  DFHMDF POS=(18,62),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE                                               00111   
ANWK09  DFHMDF POS=(18,68),LENGTH=04,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00113   
ANCQ09  DFHMDF POS=(18,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
        DFHMDF POS=(18,79),LENGTH=01,ATTRB=(ASKIP)                      00116   
*********************************************************************** 00342   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00343   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00344   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00345   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00346   
*********************************************************************** 00347   
*********************************************************************** 00348   
        DFHMSD TYPE=FINAL                                               00349   
        PRINT NOGEN                                                     00350   
        END                                                             00351   
