***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
PCKM711 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES                       
PCK711  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X        
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)                   
***********************************************************************         
***********************************************************************         
        DFHMDF POS=(2,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OPER/FACLITY:'                                          
AOPER   DFHMDF POS=(02,16),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
        DFHMDF POS=(2,21),                                             X        
               LENGTH=01,                                              X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='-'                                                      
AFCLTY  DFHMDF POS=(02,23),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
        DFHMDF POS=(2,49),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATED BY.:'                                           
ACREBY  DFHMDF POS=(2,62),                                             X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP),                                          X        
               LENGTH=08                                                        
***********************************************************************         
        DFHMDF POS=(3,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PO/RECEIVER.:'                                          
APONBR  DFHMDF POS=(3,16),                                             X        
               LENGTH=08,                                              X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP),                                          X        
               PICOUT='99999999'                                                
        DFHMDF POS=(3,25),                                             X        
               LENGTH=01,                                              X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='-'                                                      
ARECVR  DFHMDF POS=(3,27),                                             X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               PICOUT='9999'                                                    
         DFHMDF POS=(03,32),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
        DFHMDF POS=(3,49),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATE DATE:'                                           
ACREDTE DFHMDF POS=(3,62),                                             X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP),                                          X        
               LENGTH=10                                                        
***********************************************************************         
***********************************************************************         
        DFHMDF POS=(4,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='STORE NBR...:'                                          
ASTRNBR DFHMDF POS=(4,16),                                             X        
               LENGTH=04,                                              X        
               ATTRB=ASKIP,                                            X        
               COLOR=BLUE,                                             X        
               PICOUT='Z999'                                                    
        DFHMDF POS=(4,49),                                             X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATE TIME:'                                           
ACRETME DFHMDF POS=(4,62),                                             X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP),                                          X        
               LENGTH=08                                                        
***********************************************************************         
        DFHMDF POS=(05,02),                                            X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='NBR OF UNITS:'                                          
AUNITS  DFHMDF POS=(05,16),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               PICOUT='ZZZ9',                                          X        
               ATTRB=(ASKIP)                                                    
         DFHMDF POS=(05,21),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
***********************************************************************         
        DFHMDF POS=(07,02),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CURRENT NUMBER OF CARTONS..:'                           
ACCTNS  DFHMDF POS=(07,31),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               PICOUT='ZZZZ9',                                         X        
               ATTRB=(ASKIP)                                                    
         DFHMDF POS=(07,37),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
**********************************************************************          
***********************************************************************         
        DFHMDF POS=(08,02),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PREVIOUS NUMBER OF CARTONS.:'                           
APCTNS  DFHMDF POS=(08,31),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               PICOUT='ZZZZ9',                                         X        
               ATTRB=(ASKIP)                                                    
         DFHMDF POS=(08,37),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
**********************************************************************          
***********************************************************************         
        DFHMDF POS=(10,02),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ADJUST NUMBER OF CARTONS TO:'                           
AADJUST DFHMDF POS=(10,31),                                            X        
               LENGTH=05,                                              X        
               PICOUT='ZZZZZ',                                         X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(10,37),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
**********************************************************************          
        DFHMDF POS=(12,02),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SML PRINTER ID.............:'                           
APRTR   DFHMDF POS=(12,31),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM)                                               
        DFHMDF POS=(12,37),                                            X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP                                                      
**********************************************************************          
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
