*          DATA SET PCKM895    AT LEVEL 030 AS OF 07/07/01                      
        PRINT NOGEN                                                     00001   
PCKM895  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
PC895A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='TRL SRL:'                                       00015*29
ATRLR    DFHMDF POS=(01,10),                                           X00034*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               LENGTH=009                                               00035*22
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=011,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='AUDIT TYPE:'                                    00015*29
*                                                                       00016   
ATYPE    DFHMDF POS=(02,13),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='AUD NBR:'                                       00015*29
*                                                                       00016   
AAUDNBR  DFHMDF POS=(03,10),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='1. AUD TO DIFF TRLR'                            00015*29
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='2. AUD TO SAME TRLR'                            00015*29
*                                                                       00016   
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='3. AUD TO CONVEYOR '                            00015*29
*                                                                       00016   
*                                                                       00055   
         DFHMDF POS=(07,01),                                           X00064**9
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='SELECTION'                                      00067**5
*                                                                       00072**5
ASELECT  DFHMDF POS=(07,11),                                           X00064**9
               LENGTH=001,                                             X00065*10
               ATTRB=(UNPROT,NORM,IC)                                           
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
