*          DATA SET PCKM116    AT LEVEL 021 AS OF 06/20/94                      
*          DATA SET PCKM116    AT LEVEL 005 AS OF 03/15/93              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  PCKM116                                            *   00005   
*        MAP     PC116A                                             *   00006   
*        PROGRAM PCKCS116                                           *   00007   
*        TRANSID E116                                               *   00008   
*        SYSTEM  CICS ARCHITECTURE - CARTON LABELS                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
PCKM116 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TERM=3270-2,                                            X00016   
               TIOAPFX=YES                                              00017   
PC116A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00024**2
               INITIAL='OPER UNT ID............:',                     X00025**3
               LENGTH=24,                                              X00026**3
               POS=(02,13)                                              00027**7
AOPUNIT DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00028*21
               LENGTH=4,                                               X00029**2
               COLOR=GREEN,                                            X00030**2
               HILIGHT=UNDERLINE,                                      X00031**2
               POS=(02,38)                                              00032**9
AOPDESC DFHMDF ATTRB=(ASKIP),                                          X00033**2
               LENGTH=24,                                              X00034**2
               COLOR=BLUE,                                             X00035**2
               POS=(02,43)                                              00036*11
*                                                                       00037**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00038**2
               INITIAL='FACILITY...............:',                     X00039**3
               LENGTH=24,                                              X00040**3
               POS=(03,13)                                              00041**7
AFACIL  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00042**2
               LENGTH=4,                                               X00043**2
               COLOR=GREEN,                                            X00044**2
               HILIGHT=UNDERLINE,                                      X00045**2
               POS=(03,38)                                              00046**9
AFACDES DFHMDF ATTRB=(ASKIP),                                          X00047**2
               LENGTH=24,                                              X00048**2
               COLOR=BLUE,                                             X00049**2
               POS=(03,43)                                              00050*12
*                                                                       00051   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00052   
               INITIAL='PRINTER NUMBER.........:',                     X00053   
               LENGTH=24,                                              X00054   
               POS=(04,13)                                              00055**7
APRTR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00056**2
               LENGTH=3,                                               X00057*20
               COLOR=GREEN,                                            X00058   
               HILIGHT=UNDERLINE,                                      X00059   
               POS=(04,38)                                              00060*20
APRDESC DFHMDF ATTRB=ASKIP,                                            X00061   
               LENGTH=25,                                              X00062   
               COLOR=BLUE,                                             X00063   
               POS=(04,42)                                              00064*18
*                                                                       00065   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00066   
               INITIAL='STORE..................:',                     X00067   
               LENGTH=24,                                              X00068   
               POS=(05,13)                                              00069   
ASTR    DFHMDF ATTRB=(UNPROT,NORM),                                    X00070   
               LENGTH=4,                                               X00071*16
               COLOR=GREEN,                                            X00072   
               HILIGHT=UNDERLINE,                                      X00073   
               POS=(05,38)                                              00074   
ASTRNM  DFHMDF ATTRB=(ASKIP),                                          X00075   
               LENGTH=26,                                              X00076*16
               COLOR=BLUE,                                             X00077   
               POS=(05,43)                                              00078*17
*                                                                       00079   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='NUMBER OF LABELS.......:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(06,13)                                              00083   
ALBLS   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00084   
               LENGTH=4,                                               X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(06,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(06,43)                                              00092   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SEASONAL SET YEAR......:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(07,13)                                              00083   
SSYR    DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=4,                                               X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(07,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(07,43)                                              00092   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SEASONAL SET SHORT NAME:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(08,13)                                              00083   
SSNM    DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=5,                                               X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(08,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(08,44)                                              00092   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SPECIAL INSTRUCTIONS...:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(09,13)                                              00083   
INST1   DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=17,                                              X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(09,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(09,56)                                              00092   
*                                                                       00093   
INST2   DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=17,                                              X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(10,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(10,56)                                              00092   
*                                                                       00093   
*** DMH 2/10/2016 - BEGIN                                               00093   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='SHIPPING DOOR ON LABEL.:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(12,13)                                              00083   
SHDR    DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=01,                                              X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(12,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(12,40)                                              00092   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='Y/N',                                          X00081   
               LENGTH=24,                                              X00082   
               POS=(12,42)                                              00083   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='LABEL ORDER FOR ALL....:',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(13,13)                                              00083   
LBLORD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00084   
               LENGTH=01,                                              X00085   
               COLOR=GREEN,                                            X00086   
               HILIGHT=UNDERLINE,                                      X00087   
               POS=(13,38)                                              00088   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089   
               INITIAL=' ',                                            X00090   
               LENGTH=1,                                               X00091   
               POS=(13,40)                                              00092   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='S - STORE ORDER         ',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(13,42)                                              00083   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='D - SHIPPING DOOR ORDER ',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(14,42)                                              00083   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='P - PACK-TO-LIGHT ORDER ',                     X00081   
               LENGTH=24,                                              X00082   
               POS=(15,42)                                              00083   
*                                                                       00093   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00080   
               INITIAL='A - P2L SEPHORA STORE ORDER ',                 X00081   
               LENGTH=28,                                              X00082   
               POS=(16,42)                                              00083   
*                                                                       00093   
         DFHMSD TYPE=FINAL                                              00094   
         END                                                            00095   
