        PRINT NOGEN                                                     00030001
PCKM879  DFHMSD TYPE=MAP,                                              X00040001
               LANG=COBOL,                                             X00050001
               MODE=INOUT,                                             X00060001
               TIOAPFX=YES,                                            X00070001
               CTRL=FREEKB                                              00080001
*                                                                       00090001
PC879A   DFHMDI SIZE=(08,20),                                          X00100001
               LINE=1,                                                 X00110001
               COLUMN=1,                                               X00120001
               MAPATTS=(COLOR,HILIGHT),                                X00130001
               DSATTS=(COLOR,HILIGHT)                                   00140001
*                                                                       00150001
ATITLE   DFHMDF POS=(01,01),                                           X00160001
               LENGTH=019,                                             X00170001
               ATTRB=(ASKIP,NORM,FSET),                                X00180002
               INITIAL=' SCAN ON CONTAINER '                            00190006
*                                                                       00200001
         DFHMDF POS=(02,01),                                           X00210001
               LENGTH=007,                                             X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               INITIAL='SRL NBR'                                        00240004
ASERIAL  DFHMDF POS=(02,09),                                           X00250001
               LENGTH=009,                                             X00260001
               ATTRB=(UNPROT,NORM,NUM,FSET,IC)                          00270001
         DFHMDF POS=(02,19),                                           X00280001
               LENGTH=001,                                             X00290001
               ATTRB=(ASKIP,DRK)                                        00300001
*                                                                       00310001
         DFHMDF POS=(03,01),                                           X00320001
               LENGTH=009,                                             X00330001
               ATTRB=(ASKIP,NORM),                                     X00340001
               INITIAL='DOOR/DEST'                                      00350001
ADOOR    DFHMDF POS=(03,11),                                           X00360001
               LENGTH=004,                                             X00370001
               ATTRB=(ASKIP,NORM,FSET)                                  00380001
ADEST    DFHMDF POS=(03,16),                                           X00390001
               LENGTH=004,                                             X00400001
               ATTRB=(ASKIP,NORM,FSET)                                  00410001
*                                                                       00420001
ASCAC    DFHMDF POS=(04,01),                                           X00550005
               LENGTH=004,                                             X00560001
               ATTRB=(ASKIP,NORM,FSET)                                  00570001
ATRLR    DFHMDF POS=(04,06),                                           X00570105
               LENGTH=012,                                             X00570205
               ATTRB=(ASKIP,NORM,FSET)                                  00570305
*                                                                       00571001
         DFHMDF POS=(05,01),                                           X00572001
               LENGTH=013,                                             X00573001
               ATTRB=(ASKIP,NORM),                                     X00574001
               INITIAL='CONTAINER ID:'                                  00575001
ASML     DFHMDF POS=(06,01),                                           X00575101
               LENGTH=020,                                             X00575201
               ATTRB=(UNPROT,NORM,FSET,IC)                              00575301
*                                                                       00575401
ALEGEND  DFHMDF POS=(07,02),                                           X00800001
               LENGTH=018,                                             X00810001
               ATTRB=(ASKIP,NORM,FSET),                                X00820002
               INITIAL='F4-TURN SCAN OFF'                               00830007
*                                                                       00831001
AMSGLN   DFHMDF POS=(08,01),                                           X00832001
               LENGTH=019,                                             X00833001
               ATTRB=(ASKIP,NORM,FSET)                                  00834003
*                                                                       00840001
         DFHMSD TYPE=FINAL                                              00850008
         END                                                            00860001
