*********************************************************************** 00010079
*                                                                       00020036
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030036
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040036
*********************************************************************** 00050036
        PRINT NOGEN                                                     00060036
PCKM861  DFHMSD TYPE=MAP,                                              X00070050
               LANG=COBOL,                                             X00080036
               MODE=INOUT,                                             X00090036
               TIOAPFX=YES,                                            X00100036
               CTRL=FREEKB                                              00110036
PC861A   DFHMDI SIZE=(08,20),                                          X00120083
               LINE=1,                                                 X00130036
               COLUMN=1,                                               X00140036
               MAPATTS=(COLOR,HILIGHT),                                X00150052
               DSATTS=(COLOR,HILIGHT)                                   00160052
*********************************************************************** 00170036
         DFHMDF POS=(01,02),                                           X00180052
               LENGTH=019,                                             X00190052
               ATTRB=(ASKIP,NORM),                                     X00200036
               INITIAL='ADJUST CARTON UNITS'                            00210052
         DFHMDF POS=(01,22),                                           X00220060
               LENGTH=000,                                             X00230062
               ATTRB=(ASKIP)                                            00240060
*********************************************************************** 00250036
ACARTN   DFHMDF POS=(03,01),                                           X00260066
               LENGTH=020,                                             X00270036
               ATTRB=(UNPROT,NORM)                                      00280082
*********************************************************************** 00330036
         DFHMDF POS=(04,02),                                           X00340084
               LENGTH=009,                                             X00350052
               ATTRB=(ASKIP,NORM),                                     X00360052
               INITIAL='DEST STR:'                                      00370052
ASTR     DFHMDF POS=(04,12),                                           X00380084
               LENGTH=004,                                             X00390052
               ATTRB=(ASKIP,NORM)                                       00400084
*********************************************************************** 00440036
         DFHMDF POS=(05,02),                                           X00450084
               LENGTH=012,                                             X00460052
               ATTRB=(ASKIP,NORM),                                     X00470052
               INITIAL='NBR SKU CTN:'                                   00480052
ASKUCTN  DFHMDF POS=(05,15),                                           X00490084
               LENGTH=004,                                             X00500052
               ATTRB=(ASKIP,NORM),                                     X00510085
               PICOUT='9999'                                            00520071
*********************************************************************** 00560036
         DFHMDF POS=(06,02),                                           X00570084
               LENGTH=013,                                             X00580052
               ATTRB=(ASKIP,NORM),                                     X00590052
               INITIAL='UNITS IN CTN:'                                  00600069
AUNTCTN  DFHMDF POS=(06,16),                                           X00610084
               LENGTH=004,                                             X00620052
               ATTRB=(ASKIP,NORM),                                     X00630084
               PICOUT='9999'                                            00640071
*********************************************************************** 00680036
         DFHMDF POS=(07,01),                                           X00690072
               LENGTH=007,                                             X00700076
               ATTRB=(ASKIP,NORM),                                     X00710052
               INITIAL='F4-CONT'                                        00720076
*********************************************************************** 00760049
AMSGLN   DFHMDF POS=(08,01),                                           X00770036
               LENGTH=019,                                             X00780036
               ATTRB=(ASKIP,NORM,FSET)                                  00790077
*********************************************************************** 00800036
*********************************************************************** 00810036
         DFHMSD TYPE=FINAL                                              00820086
         END                                                            00830036
