*********************************************************************** 00001000
*          DATA SET PCKM754                                             00002001
  PRINT  NOGEN                                                          00003000
*-------------------------------------------------------------------*   00004000
*                                                                   *   00005000
*        MAPSET  PCKM754                                            *   00006001
*        MAP     PC754A                                             *   00007001
*        PROGRAM PCKCS754                                           *   00008001
*        TRANSID E754 - SHIFT HOURS BY DC                           *   00009001
*        SYSTEM  PROCESS CONTROL (PC)                               *   00009100
*                                                                   *   00009200
*-------------------------------------------------------------------*   00009300
PCKM754 DFHMSD TYPE=DSECT,                                             X00009401
               LANG=COBOL,                                             X00009500
               MODE=INOUT,                                             X00009600
               STORAGE=AUTO,                                           X00009700
               TERM=3270-2,                                            X00009800
               TIOAPFX=YES                                              00009900
*********************************************************************** 00010000
PC754A  DFHMDI LINE=2,COLUMN=1,                                        X00020001
               SIZE=(19,80),                                           X00030000
               CTRL=(FREEKB),                                          X00040000
               MAPATTS=(COLOR,HILIGHT),                                X00050000
               DSATTS=(COLOR,HILIGHT)                                   00060000
*********************************************************************** 00070000
        DFHMDF POS=(03,02),                                            X00080000
               LENGTH=04,                                              X00090000
               ATTRB=(ASKIP,NORM),                                     X00100000
               COLOR=NEUTRAL,                                          X00110000
               INITIAL='OPER'                                           00120002
        DFHMDF POS=(03,07),                                            X00130008
               LENGTH=04,                                              X00140008
               ATTRB=(ASKIP,NORM),                                     X00150008
               COLOR=NEUTRAL,                                          X00160008
               INITIAL='OPER'                                           00170008
        DFHMDF POS=(03,15),                                            X00201008
               LENGTH=04,                                              X00202002
               ATTRB=(ASKIP,NORM),                                     X00203000
               COLOR=NEUTRAL,                                          X00204000
               INITIAL='TIME'                                           00205002
        DFHMDF POS=(03,22),                                            X00206008
               LENGTH=18,                                              X00207002
               ATTRB=(ASKIP,NORM),                                     X00208002
               COLOR=NEUTRAL,                                          X00209002
               INITIAL='---- 3RD SHIFT ---'                             00210002
        DFHMDF POS=(03,42),                                            X00220008
               LENGTH=18,                                              X00230002
               ATTRB=(ASKIP,NORM),                                     X00231002
               COLOR=NEUTRAL,                                          X00232002
               INITIAL='---- 1ST SHIFT ---'                             00233002
        DFHMDF POS=(03,62),                                            X00234008
               LENGTH=18,                                              X00235002
               ATTRB=(ASKIP,NORM),                                     X00236002
               COLOR=NEUTRAL,                                          X00237002
               INITIAL='---- 2ND SHIFT ---'                             00238002
*********************************************************************** 00240000
        DFHMDF POS=(04,02),                                            X00250000
               LENGTH=04,                                              X00260008
               ATTRB=(ASKIP,NORM),                                     X00270000
               COLOR=NEUTRAL,                                          X00280000
               INITIAL='UNIT'                                           00290008
        DFHMDF POS=(04,07),                                            X00300008
               LENGTH=05,                                              X00310008
               ATTRB=(ASKIP,NORM),                                     X00320008
               COLOR=NEUTRAL,                                          X00321008
               INITIAL='DESCR'                                          00322008
        DFHMDF POS=(04,15),                                            X00323008
               LENGTH=04,                                              X00324002
               ATTRB=(ASKIP,NORM),                                     X00325000
               COLOR=NEUTRAL,                                          X00326000
               INITIAL='ZONE'                                           00327002
        DFHMDF POS=(04,22),                                            X00328008
               LENGTH=18,                                              X00329003
               ATTRB=(ASKIP,NORM),                                     X00329103
               COLOR=NEUTRAL,                                          X00329203
               INITIAL=' START       END  '                             00329303
        DFHMDF POS=(04,42),                                            X00329408
               LENGTH=18,                                              X00329503
               ATTRB=(ASKIP,NORM),                                     X00329603
               COLOR=NEUTRAL,                                          X00329703
               INITIAL=' START       END  '                             00329803
        DFHMDF POS=(04,62),                                            X00329908
               LENGTH=18,                                              X00330003
               ATTRB=(ASKIP,NORM),                                     X00330103
               COLOR=NEUTRAL,                                          X00330203
               INITIAL=' START       END  '                             00330303
*********************************************************************** 00330703
AOPID01 DFHMDF POS=(05,02),                                            X00401008
               LENGTH=04,                                              X00402008
               ATTRB=(ASKIP,NORM),                                     X00403004
               COLOR=BLUE                                               00404004
AOPDS01 DFHMDF POS=(05,07),                                            X00405008
               LENGTH=05,                                              X00406008
               ATTRB=(ASKIP,NORM),                                     X00407008
               COLOR=BLUE                                               00408008
ATMZN01 DFHMDF POS=(05,13),                                            X00940008
               LENGTH=08,                                              X00950004
               ATTRB=(ASKIP,NORM),                                     X00960000
               COLOR=BLUE                                               00970000
AST3D01 DFHMDF POS=(05,22),                                            X00980008
               LENGTH=08,                                              X00990004
               ATTRB=(ASKIP,NORM),                                     X01000000
               COLOR=BLUE                                               01010000
AEN3D01 DFHMDF POS=(05,32),                                            X01020008
               LENGTH=08,                                              X01030004
               ATTRB=(ASKIP,NORM),                                     X01040004
               COLOR=BLUE                                               01050004
AST1D01 DFHMDF POS=(05,42),                                            X01060008
               LENGTH=08,                                              X01070004
               ATTRB=(ASKIP,NORM),                                     X01080004
               COLOR=BLUE                                               01090004
AEN1D01 DFHMDF POS=(05,52),                                            X01100008
               LENGTH=08,                                              X01110004
               ATTRB=(ASKIP,NORM),                                     X01120004
               COLOR=BLUE                                               01130004
AST2D01 DFHMDF POS=(05,62),                                            X01140008
               LENGTH=08,                                              X01150004
               ATTRB=(ASKIP,NORM),                                     X01160004
               COLOR=BLUE                                               01170004
AEN2D01 DFHMDF POS=(05,72),                                            X01180008
               LENGTH=08,                                              X01190004
               ATTRB=(ASKIP,NORM),                                     X01200004
               COLOR=BLUE                                               01210004
*********************************************************************** 01298000
AOPID02 DFHMDF POS=(06,02),                                            X01298108
               LENGTH=04,                                              X01298208
               ATTRB=(ASKIP,NORM),                                     X01298305
               COLOR=BLUE                                               01298405
AOPDS02 DFHMDF POS=(06,07),                                            X01298508
               LENGTH=05,                                              X01298608
               ATTRB=(ASKIP,NORM),                                     X01298708
               COLOR=BLUE                                               01298808
ATMZN02 DFHMDF POS=(06,13),                                            X01298908
               LENGTH=08,                                              X01299008
               ATTRB=(ASKIP,NORM),                                     X01299108
               COLOR=BLUE                                               01299208
AST3D02 DFHMDF POS=(06,22),                                            X01299308
               LENGTH=08,                                              X01299408
               ATTRB=(ASKIP,NORM),                                     X01299508
               COLOR=BLUE                                               01299608
AEN3D02 DFHMDF POS=(06,32),                                            X01299708
               LENGTH=08,                                              X01299808
               ATTRB=(ASKIP,NORM),                                     X01299908
               COLOR=BLUE                                               01300008
AST1D02 DFHMDF POS=(06,42),                                            X01300108
               LENGTH=08,                                              X01300208
               ATTRB=(ASKIP,NORM),                                     X01300308
               COLOR=BLUE                                               01300408
AEN1D02 DFHMDF POS=(06,52),                                            X01300508
               LENGTH=08,                                              X01300608
               ATTRB=(ASKIP,NORM),                                     X01300708
               COLOR=BLUE                                               01300808
AST2D02 DFHMDF POS=(06,62),                                            X01300908
               LENGTH=08,                                              X01301008
               ATTRB=(ASKIP,NORM),                                     X01301108
               COLOR=BLUE                                               01301208
AEN2D02 DFHMDF POS=(06,72),                                            X01301308
               LENGTH=08,                                              X01301408
               ATTRB=(ASKIP,NORM),                                     X01301508
               COLOR=BLUE                                               01301608
*********************************************************************** 01301708
AOPID03 DFHMDF POS=(07,02),                                            X01301808
               LENGTH=04,                                              X01301908
               ATTRB=(ASKIP,NORM),                                     X01302008
               COLOR=BLUE                                               01302108
AOPDS03 DFHMDF POS=(07,07),                                            X01302208
               LENGTH=05,                                              X01302308
               ATTRB=(ASKIP,NORM),                                     X01302408
               COLOR=BLUE                                               01302508
ATMZN03 DFHMDF POS=(07,13),                                            X01302608
               LENGTH=08,                                              X01302708
               ATTRB=(ASKIP,NORM),                                     X01302808
               COLOR=BLUE                                               01303005
AST3D03 DFHMDF POS=(07,22),                                            X01304008
               LENGTH=08,                                              X01305005
               ATTRB=(ASKIP,NORM),                                     X01306005
               COLOR=BLUE                                               01307005
AEN3D03 DFHMDF POS=(07,32),                                            X01308008
               LENGTH=08,                                              X01309005
               ATTRB=(ASKIP,NORM),                                     X01310005
               COLOR=BLUE                                               01320005
AST1D03 DFHMDF POS=(07,42),                                            X01330008
               LENGTH=08,                                              X01340005
               ATTRB=(ASKIP,NORM),                                     X01350005
               COLOR=BLUE                                               01360005
AEN1D03 DFHMDF POS=(07,52),                                            X01370008
               LENGTH=08,                                              X01380005
               ATTRB=(ASKIP,NORM),                                     X01390005
               COLOR=BLUE                                               01400005
AST2D03 DFHMDF POS=(07,62),                                            X01410008
               LENGTH=08,                                              X01420005
               ATTRB=(ASKIP,NORM),                                     X01430005
               COLOR=BLUE                                               01440005
AEN2D03 DFHMDF POS=(07,72),                                            X01450008
               LENGTH=08,                                              X01460005
               ATTRB=(ASKIP,NORM),                                     X01470005
               COLOR=BLUE                                               01480005
*********************************************************************** 01480105
AOPID04 DFHMDF POS=(08,02),                                            X01481008
               LENGTH=04,                                              X01482008
               ATTRB=(ASKIP,NORM),                                     X01483005
               COLOR=BLUE                                               01484005
AOPDS04 DFHMDF POS=(08,07),                                            X01484108
               LENGTH=05,                                              X01484208
               ATTRB=(ASKIP,NORM),                                     X01484308
               COLOR=BLUE                                               01484408
ATMZN04 DFHMDF POS=(08,13),                                            X01485008
               LENGTH=08,                                              X01486005
               ATTRB=(ASKIP,NORM),                                     X01487005
               COLOR=BLUE                                               01488005
AST3D04 DFHMDF POS=(08,22),                                            X01489008
               LENGTH=08,                                              X01489105
               ATTRB=(ASKIP,NORM),                                     X01489205
               COLOR=BLUE                                               01489305
AEN3D04 DFHMDF POS=(08,32),                                            X01489408
               LENGTH=08,                                              X01489505
               ATTRB=(ASKIP,NORM),                                     X01489605
               COLOR=BLUE                                               01489705
AST1D04 DFHMDF POS=(08,42),                                            X01489808
               LENGTH=08,                                              X01489905
               ATTRB=(ASKIP,NORM),                                     X01490005
               COLOR=BLUE                                               01491005
AEN1D04 DFHMDF POS=(08,52),                                            X01492008
               LENGTH=08,                                              X01493005
               ATTRB=(ASKIP,NORM),                                     X01494005
               COLOR=BLUE                                               01495005
AST2D04 DFHMDF POS=(08,62),                                            X01496008
               LENGTH=08,                                              X01497005
               ATTRB=(ASKIP,NORM),                                     X01498005
               COLOR=BLUE                                               01499005
AEN2D04 DFHMDF POS=(08,72),                                            X01499108
               LENGTH=08,                                              X01499205
               ATTRB=(ASKIP,NORM),                                     X01499305
               COLOR=BLUE                                               01499405
*********************************************************************** 01499505
AOPID05 DFHMDF POS=(09,02),                                            X01499608
               LENGTH=04,                                              X01499708
               ATTRB=(ASKIP,NORM),                                     X01499805
               COLOR=BLUE                                               01499905
AOPDS05 DFHMDF POS=(09,07),                                            X01500008
               LENGTH=05,                                              X01500108
               ATTRB=(ASKIP,NORM),                                     X01500208
               COLOR=BLUE                                               01500308
ATMZN05 DFHMDF POS=(09,13),                                            X01501008
               LENGTH=08,                                              X01510005
               ATTRB=(ASKIP,NORM),                                     X01520005
               COLOR=BLUE                                               01530005
AST3D05 DFHMDF POS=(09,22),                                            X01540008
               LENGTH=08,                                              X01550005
               ATTRB=(ASKIP,NORM),                                     X01560005
               COLOR=BLUE                                               01570005
AEN3D05 DFHMDF POS=(09,32),                                            X01580008
               LENGTH=08,                                              X01590005
               ATTRB=(ASKIP,NORM),                                     X01600005
               COLOR=BLUE                                               01610005
AST1D05 DFHMDF POS=(09,42),                                            X01620008
               LENGTH=08,                                              X01630005
               ATTRB=(ASKIP,NORM),                                     X01640005
               COLOR=BLUE                                               01650005
AEN1D05 DFHMDF POS=(09,52),                                            X01660008
               LENGTH=08,                                              X01670005
               ATTRB=(ASKIP,NORM),                                     X01680005
               COLOR=BLUE                                               01690005
AST2D05 DFHMDF POS=(09,62),                                            X01700008
               LENGTH=08,                                              X01710005
               ATTRB=(ASKIP,NORM),                                     X01720005
               COLOR=BLUE                                               01730005
AEN2D05 DFHMDF POS=(09,72),                                            X01740008
               LENGTH=08,                                              X01750005
               ATTRB=(ASKIP,NORM),                                     X01760005
               COLOR=BLUE                                               01770005
*********************************************************************** 01780005
AOPID06 DFHMDF POS=(10,02),                                            X01790008
               LENGTH=04,                                              X01800008
               ATTRB=(ASKIP,NORM),                                     X01810005
               COLOR=BLUE                                               01820005
AOPDS06 DFHMDF POS=(10,07),                                            X01821008
               LENGTH=05,                                              X01822008
               ATTRB=(ASKIP,NORM),                                     X01823008
               COLOR=BLUE                                               01824008
ATMZN06 DFHMDF POS=(10,13),                                            X01830008
               LENGTH=08,                                              X01840005
               ATTRB=(ASKIP,NORM),                                     X01850005
               COLOR=BLUE                                               01860005
AST3D06 DFHMDF POS=(10,22),                                            X01870008
               LENGTH=08,                                              X01880005
               ATTRB=(ASKIP,NORM),                                     X01890005
               COLOR=BLUE                                               01900005
AEN3D06 DFHMDF POS=(10,32),                                            X01910008
               LENGTH=08,                                              X01920005
               ATTRB=(ASKIP,NORM),                                     X01930005
               COLOR=BLUE                                               01940005
AST1D06 DFHMDF POS=(10,42),                                            X01950008
               LENGTH=08,                                              X01960005
               ATTRB=(ASKIP,NORM),                                     X01970005
               COLOR=BLUE                                               01980005
AEN1D06 DFHMDF POS=(10,52),                                            X01990008
               LENGTH=08,                                              X02000005
               ATTRB=(ASKIP,NORM),                                     X02010005
               COLOR=BLUE                                               02020005
AST2D06 DFHMDF POS=(10,62),                                            X02030008
               LENGTH=08,                                              X02040005
               ATTRB=(ASKIP,NORM),                                     X02050005
               COLOR=BLUE                                               02060005
AEN2D06 DFHMDF POS=(10,72),                                            X02070008
               LENGTH=08,                                              X02080005
               ATTRB=(ASKIP,NORM),                                     X02090005
               COLOR=BLUE                                               02100005
*********************************************************************** 02110005
AOPID07 DFHMDF POS=(11,02),                                            X02120008
               LENGTH=04,                                              X02130008
               ATTRB=(ASKIP,NORM),                                     X02140005
               COLOR=BLUE                                               02150005
AOPDS07 DFHMDF POS=(11,07),                                            X02151008
               LENGTH=05,                                              X02152008
               ATTRB=(ASKIP,NORM),                                     X02153008
               COLOR=BLUE                                               02154008
ATMZN07 DFHMDF POS=(11,13),                                            X02160008
               LENGTH=08,                                              X02170005
               ATTRB=(ASKIP,NORM),                                     X02180005
               COLOR=BLUE                                               02190005
AST3D07 DFHMDF POS=(11,22),                                            X02200008
               LENGTH=08,                                              X02210005
               ATTRB=(ASKIP,NORM),                                     X02220005
               COLOR=BLUE                                               02230005
AEN3D07 DFHMDF POS=(11,32),                                            X02240008
               LENGTH=08,                                              X02250005
               ATTRB=(ASKIP,NORM),                                     X02260005
               COLOR=BLUE                                               02270005
AST1D07 DFHMDF POS=(11,42),                                            X02280008
               LENGTH=08,                                              X02290005
               ATTRB=(ASKIP,NORM),                                     X02300005
               COLOR=BLUE                                               02310005
AEN1D07 DFHMDF POS=(11,52),                                            X02320008
               LENGTH=08,                                              X02330005
               ATTRB=(ASKIP,NORM),                                     X02340005
               COLOR=BLUE                                               02350005
AST2D07 DFHMDF POS=(11,62),                                            X02360008
               LENGTH=08,                                              X02361005
               ATTRB=(ASKIP,NORM),                                     X02362005
               COLOR=BLUE                                               02362105
AEN2D07 DFHMDF POS=(11,72),                                            X02362208
               LENGTH=08,                                              X02362305
               ATTRB=(ASKIP,NORM),                                     X02362405
               COLOR=BLUE                                               02362505
*********************************************************************** 02362605
AOPID08 DFHMDF POS=(12,02),                                            X02362708
               LENGTH=04,                                              X02362808
               ATTRB=(ASKIP,NORM),                                     X02362905
               COLOR=BLUE                                               02363005
AOPDS08 DFHMDF POS=(12,07),                                            X02363108
               LENGTH=05,                                              X02363208
               ATTRB=(ASKIP,NORM),                                     X02363308
               COLOR=BLUE                                               02363408
ATMZN08 DFHMDF POS=(12,13),                                            X02363508
               LENGTH=08,                                              X02363608
               ATTRB=(ASKIP,NORM),                                     X02363708
               COLOR=BLUE                                               02363808
AST3D08 DFHMDF POS=(12,22),                                            X02363908
               LENGTH=08,                                              X02364008
               ATTRB=(ASKIP,NORM),                                     X02364108
               COLOR=BLUE                                               02364208
AEN3D08 DFHMDF POS=(12,32),                                            X02364308
               LENGTH=08,                                              X02364408
               ATTRB=(ASKIP,NORM),                                     X02364508
               COLOR=BLUE                                               02364608
AST1D08 DFHMDF POS=(12,42),                                            X02364708
               LENGTH=08,                                              X02364808
               ATTRB=(ASKIP,NORM),                                     X02364908
               COLOR=BLUE                                               02365008
AEN1D08 DFHMDF POS=(12,52),                                            X02365108
               LENGTH=08,                                              X02365208
               ATTRB=(ASKIP,NORM),                                     X02365308
               COLOR=BLUE                                               02365408
AST2D08 DFHMDF POS=(12,62),                                            X02365508
               LENGTH=08,                                              X02365608
               ATTRB=(ASKIP,NORM),                                     X02365708
               COLOR=BLUE                                               02365808
AEN2D08 DFHMDF POS=(12,72),                                            X02365908
               LENGTH=08,                                              X02366008
               ATTRB=(ASKIP,NORM),                                     X02366108
               COLOR=BLUE                                               02366208
*********************************************************************** 02366308
AOPID09 DFHMDF POS=(13,02),                                            X02366408
               LENGTH=04,                                              X02366508
               ATTRB=(ASKIP,NORM),                                     X02366608
               COLOR=BLUE                                               02366708
AOPDS09 DFHMDF POS=(13,07),                                            X02366808
               LENGTH=05,                                              X02366908
               ATTRB=(ASKIP,NORM),                                     X02367008
               COLOR=BLUE                                               02367108
ATMZN09 DFHMDF POS=(13,13),                                            X02367208
               LENGTH=08,                                              X02367308
               ATTRB=(ASKIP,NORM),                                     X02367408
               COLOR=BLUE                                               02367508
AST3D09 DFHMDF POS=(13,22),                                            X02367608
               LENGTH=08,                                              X02367708
               ATTRB=(ASKIP,NORM),                                     X02367808
               COLOR=BLUE                                               02367908
AEN3D09 DFHMDF POS=(13,32),                                            X02368008
               LENGTH=08,                                              X02368108
               ATTRB=(ASKIP,NORM),                                     X02368208
               COLOR=BLUE                                               02368308
AST1D09 DFHMDF POS=(13,42),                                            X02368408
               LENGTH=08,                                              X02368508
               ATTRB=(ASKIP,NORM),                                     X02368608
               COLOR=BLUE                                               02368708
AEN1D09 DFHMDF POS=(13,52),                                            X02368808
               LENGTH=08,                                              X02368908
               ATTRB=(ASKIP,NORM),                                     X02369008
               COLOR=BLUE                                               02369108
AST2D09 DFHMDF POS=(13,62),                                            X02369208
               LENGTH=08,                                              X02369308
               ATTRB=(ASKIP,NORM),                                     X02369408
               COLOR=BLUE                                               02369508
AEN2D09 DFHMDF POS=(13,72),                                            X02369608
               LENGTH=08,                                              X02369708
               ATTRB=(ASKIP,NORM),                                     X02369808
               COLOR=BLUE                                               02369908
*********************************************************************** 02370008
AOPID10 DFHMDF POS=(14,02),                                            X02370108
               LENGTH=04,                                              X02370208
               ATTRB=(ASKIP,NORM),                                     X02370308
               COLOR=BLUE                                               02370408
AOPDS10 DFHMDF POS=(14,07),                                            X02370508
               LENGTH=05,                                              X02370608
               ATTRB=(ASKIP,NORM),                                     X02370708
               COLOR=BLUE                                               02370808
ATMZN10 DFHMDF POS=(14,13),                                            X02370908
               LENGTH=08,                                              X02371008
               ATTRB=(ASKIP,NORM),                                     X02371108
               COLOR=BLUE                                               02371208
AST3D10 DFHMDF POS=(14,22),                                            X02371308
               LENGTH=08,                                              X02371408
               ATTRB=(ASKIP,NORM),                                     X02371508
               COLOR=BLUE                                               02371608
AEN3D10 DFHMDF POS=(14,32),                                            X02371708
               LENGTH=08,                                              X02371808
               ATTRB=(ASKIP,NORM),                                     X02371908
               COLOR=BLUE                                               02372008
AST1D10 DFHMDF POS=(14,42),                                            X02372108
               LENGTH=08,                                              X02372208
               ATTRB=(ASKIP,NORM),                                     X02372308
               COLOR=BLUE                                               02372408
AEN1D10 DFHMDF POS=(14,52),                                            X02372508
               LENGTH=08,                                              X02372608
               ATTRB=(ASKIP,NORM),                                     X02372708
               COLOR=BLUE                                               02372808
AST2D10 DFHMDF POS=(14,62),                                            X02372908
               LENGTH=08,                                              X02373008
               ATTRB=(ASKIP,NORM),                                     X02373108
               COLOR=BLUE                                               02373208
AEN2D10 DFHMDF POS=(14,72),                                            X02373308
               LENGTH=08,                                              X02373408
               ATTRB=(ASKIP,NORM),                                     X02373508
               COLOR=BLUE                                               02373608
*********************************************************************** 02373708
AOPID11 DFHMDF POS=(15,02),                                            X02373808
               LENGTH=04,                                              X02373908
               ATTRB=(ASKIP,NORM),                                     X02374008
               COLOR=BLUE                                               02374108
AOPDS11 DFHMDF POS=(15,07),                                            X02374208
               LENGTH=05,                                              X02374308
               ATTRB=(ASKIP,NORM),                                     X02374408
               COLOR=BLUE                                               02374508
ATMZN11 DFHMDF POS=(15,13),                                            X02374608
               LENGTH=08,                                              X02374708
               ATTRB=(ASKIP,NORM),                                     X02374808
               COLOR=BLUE                                               02374908
AST3D11 DFHMDF POS=(15,22),                                            X02375008
               LENGTH=08,                                              X02375108
               ATTRB=(ASKIP,NORM),                                     X02375208
               COLOR=BLUE                                               02375308
AEN3D11 DFHMDF POS=(15,32),                                            X02375408
               LENGTH=08,                                              X02375508
               ATTRB=(ASKIP,NORM),                                     X02375608
               COLOR=BLUE                                               02375708
AST1D11 DFHMDF POS=(15,42),                                            X02375808
               LENGTH=08,                                              X02375908
               ATTRB=(ASKIP,NORM),                                     X02376008
               COLOR=BLUE                                               02376108
AEN1D11 DFHMDF POS=(15,52),                                            X02376208
               LENGTH=08,                                              X02376308
               ATTRB=(ASKIP,NORM),                                     X02376408
               COLOR=BLUE                                               02376508
AST2D11 DFHMDF POS=(15,62),                                            X02376608
               LENGTH=08,                                              X02376708
               ATTRB=(ASKIP,NORM),                                     X02376808
               COLOR=BLUE                                               02376908
AEN2D11 DFHMDF POS=(15,72),                                            X02377008
               LENGTH=08,                                              X02377108
               ATTRB=(ASKIP,NORM),                                     X02377208
               COLOR=BLUE                                               02377308
*********************************************************************** 02377408
AOPID12 DFHMDF POS=(16,02),                                            X02377508
               LENGTH=04,                                              X02377608
               ATTRB=(ASKIP,NORM),                                     X02377708
               COLOR=BLUE                                               02377808
AOPDS12 DFHMDF POS=(16,07),                                            X02377908
               LENGTH=05,                                              X02378008
               ATTRB=(ASKIP,NORM),                                     X02378108
               COLOR=BLUE                                               02378208
ATMZN12 DFHMDF POS=(16,13),                                            X02378308
               LENGTH=08,                                              X02378408
               ATTRB=(ASKIP,NORM),                                     X02378508
               COLOR=BLUE                                               02378608
AST3D12 DFHMDF POS=(16,22),                                            X02378708
               LENGTH=08,                                              X02378808
               ATTRB=(ASKIP,NORM),                                     X02378908
               COLOR=BLUE                                               02379008
AEN3D12 DFHMDF POS=(16,32),                                            X02379108
               LENGTH=08,                                              X02379208
               ATTRB=(ASKIP,NORM),                                     X02379308
               COLOR=BLUE                                               02379408
AST1D12 DFHMDF POS=(16,42),                                            X02379508
               LENGTH=08,                                              X02379608
               ATTRB=(ASKIP,NORM),                                     X02379708
               COLOR=BLUE                                               02379808
AEN1D12 DFHMDF POS=(16,52),                                            X02379908
               LENGTH=08,                                              X02380008
               ATTRB=(ASKIP,NORM),                                     X02380108
               COLOR=BLUE                                               02380208
AST2D12 DFHMDF POS=(16,62),                                            X02380308
               LENGTH=08,                                              X02380408
               ATTRB=(ASKIP,NORM),                                     X02380508
               COLOR=BLUE                                               02380608
AEN2D12 DFHMDF POS=(16,72),                                            X02380708
               LENGTH=08,                                              X02380808
               ATTRB=(ASKIP,NORM),                                     X02380908
               COLOR=BLUE                                               02381008
*********************************************************************** 02381108
AOPID13 DFHMDF POS=(17,02),                                            X02381208
               LENGTH=04,                                              X02381308
               ATTRB=(ASKIP,NORM),                                     X02381408
               COLOR=BLUE                                               02381508
AOPDS13 DFHMDF POS=(17,07),                                            X02381608
               LENGTH=05,                                              X02381708
               ATTRB=(ASKIP,NORM),                                     X02381808
               COLOR=BLUE                                               02381908
ATMZN13 DFHMDF POS=(17,13),                                            X02382008
               LENGTH=08,                                              X02382108
               ATTRB=(ASKIP,NORM),                                     X02382208
               COLOR=BLUE                                               02382308
AST3D13 DFHMDF POS=(17,22),                                            X02382408
               LENGTH=08,                                              X02382508
               ATTRB=(ASKIP,NORM),                                     X02382608
               COLOR=BLUE                                               02382708
AEN3D13 DFHMDF POS=(17,32),                                            X02382808
               LENGTH=08,                                              X02382908
               ATTRB=(ASKIP,NORM),                                     X02383008
               COLOR=BLUE                                               02383108
AST1D13 DFHMDF POS=(17,42),                                            X02383208
               LENGTH=08,                                              X02383308
               ATTRB=(ASKIP,NORM),                                     X02383408
               COLOR=BLUE                                               02383508
AEN1D13 DFHMDF POS=(17,52),                                            X02383608
               LENGTH=08,                                              X02383708
               ATTRB=(ASKIP,NORM),                                     X02383808
               COLOR=BLUE                                               02383908
AST2D13 DFHMDF POS=(17,62),                                            X02384008
               LENGTH=08,                                              X02384108
               ATTRB=(ASKIP,NORM),                                     X02384208
               COLOR=BLUE                                               02384308
AEN2D13 DFHMDF POS=(17,72),                                            X02384408
               LENGTH=08,                                              X02384508
               ATTRB=(ASKIP,NORM),                                     X02384608
               COLOR=BLUE                                               02384708
*********************************************************************** 02384808
AOPID14 DFHMDF POS=(18,02),                                            X02384908
               LENGTH=04,                                              X02385008
               ATTRB=(ASKIP,NORM),                                     X02385108
               COLOR=BLUE                                               02385208
AOPDS14 DFHMDF POS=(18,07),                                            X02385308
               LENGTH=05,                                              X02385408
               ATTRB=(ASKIP,NORM),                                     X02385508
               COLOR=BLUE                                               02385608
ATMZN14 DFHMDF POS=(18,13),                                            X02385708
               LENGTH=08,                                              X02385808
               ATTRB=(ASKIP,NORM),                                     X02385908
               COLOR=BLUE                                               02386008
AST3D14 DFHMDF POS=(18,22),                                            X02386108
               LENGTH=08,                                              X02386208
               ATTRB=(ASKIP,NORM),                                     X02386308
               COLOR=BLUE                                               02386408
AEN3D14 DFHMDF POS=(18,32),                                            X02386508
               LENGTH=08,                                              X02386608
               ATTRB=(ASKIP,NORM),                                     X02386708
               COLOR=BLUE                                               02386808
AST1D14 DFHMDF POS=(18,42),                                            X02386908
               LENGTH=08,                                              X02387008
               ATTRB=(ASKIP,NORM),                                     X02387108
               COLOR=BLUE                                               02387208
AEN1D14 DFHMDF POS=(18,52),                                            X02387308
               LENGTH=08,                                              X02387408
               ATTRB=(ASKIP,NORM),                                     X02387508
               COLOR=BLUE                                               02387608
AST2D14 DFHMDF POS=(18,62),                                            X02387708
               LENGTH=08,                                              X02387808
               ATTRB=(ASKIP,NORM),                                     X02387908
               COLOR=BLUE                                               02388008
AEN2D14 DFHMDF POS=(18,72),                                            X02388108
               LENGTH=08,                                              X02388208
               ATTRB=(ASKIP,NORM),                                     X02388308
               COLOR=BLUE                                               02388408
*********************************************************************** 02388508
AOPID15 DFHMDF POS=(19,02),                                            X02388608
               LENGTH=04,                                              X02388708
               ATTRB=(ASKIP,NORM),                                     X02388808
               COLOR=BLUE                                               02388908
AOPDS15 DFHMDF POS=(19,07),                                            X02389008
               LENGTH=05,                                              X02389108
               ATTRB=(ASKIP,NORM),                                     X02389208
               COLOR=BLUE                                               02389308
ATMZN15 DFHMDF POS=(19,13),                                            X02389408
               LENGTH=08,                                              X02389508
               ATTRB=(ASKIP,NORM),                                     X02389608
               COLOR=BLUE                                               02389708
AST3D15 DFHMDF POS=(19,22),                                            X02389808
               LENGTH=08,                                              X02389908
               ATTRB=(ASKIP,NORM),                                     X02390008
               COLOR=BLUE                                               02390108
AEN3D15 DFHMDF POS=(19,32),                                            X02390208
               LENGTH=08,                                              X02390308
               ATTRB=(ASKIP,NORM),                                     X02390408
               COLOR=BLUE                                               02390508
AST1D15 DFHMDF POS=(19,42),                                            X02390608
               LENGTH=08,                                              X02390708
               ATTRB=(ASKIP,NORM),                                     X02390808
               COLOR=BLUE                                               02390908
AEN1D15 DFHMDF POS=(19,52),                                            X02391008
               LENGTH=08,                                              X02391108
               ATTRB=(ASKIP,NORM),                                     X02391208
               COLOR=BLUE                                               02391308
AST2D15 DFHMDF POS=(19,62),                                            X02391408
               LENGTH=08,                                              X02391508
               ATTRB=(ASKIP,NORM),                                     X02391608
               COLOR=BLUE                                               02391708
AEN2D15 DFHMDF POS=(19,72),                                            X02391808
               LENGTH=08,                                              X02391908
               ATTRB=(ASKIP,NORM),                                     X02392008
               COLOR=BLUE                                               02392108
*********************************************************************** 02392208
*********************************************************************** 02392305
*********************************************************************** 02392405
        DFHMSD TYPE=FINAL                                               02393005
        END                                                             02400005
