***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
PCKM700 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES                       
PC700A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X        
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)                   
***********************************************************************         
        DFHMDF POS=(2,2),                                              X        
               LENGTH=42,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER THE PO, RECEIVER AND LINE (OPTIONAL)'             
        DFHMDF POS=(2,45),                                             X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='TO BUILD A LIST OF LINES FOR'                           
***********************************************************************         
        DFHMDF POS=(3,2),                                              X        
               LENGTH=42,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATING LABELS.  ENTER ALL THREE FOR LINE'             
        DFHMDF POS=(3,45),                                             X        
               LENGTH=30,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='MAINTENANCE OR LABEL REPRINTS.'                         
***********************************************************************         
        DFHMDF POS=(5,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OPER UNIT ID:'                                          
MOPID   DFHMDF POS=(5,16),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,FSET)                                               
MOPDESC DFHMDF POS=(5,27),                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
***********************************************************************         
        DFHMDF POS=(6,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PO/RCVR NBR.:'                                          
MPONBR  DFHMDF POS=(6,16),                                             X        
               LENGTH=08,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZZZ'                                                
        DFHMDF POS=(6,25),                                             X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='-'                                                      
MRECVR  DFHMDF POS=(6,27),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='9999'                                                    
MPKGCD  DFHMDF POS=(6,32),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=06,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(6,40),                                             X        
               LENGTH=11,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LINE NBR..:'                                            
MLINE   DFHMDF POS=(6,52),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ'                                                    
MLINEST DFHMDF POS=(6,57),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               ATTRB=ASKIP                                                      
MUCC128 DFHMDF POS=(6,67),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=12,                                              X        
               ATTRB=ASKIP                                                      
***********************************************************************         
        DFHMDF POS=(7,02),                                             X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CURR OPER ID:'                                          
MCOPID  DFHMDF POS=(7,16),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,FSET)                                               
MCOPDSC DFHMDF POS=(7,27),                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
**********************************************************************          
        DFHMDF POS=(09,02),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SML/P2L PRTR ID:'                                       
MDEST1  DFHMDF POS=(09,19),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(09,28),                                            X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(09,30),                                            X        
               LENGTH=14,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PGYBK PRTR ID:'                                         
MDEST2  DFHMDF POS=(09,45),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(09,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(09,56),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='USE UCC128 DATA:'                                       
USE128  DFHMDF POS=(09,73),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(09,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(Y/N)'                                                  
***********************************************************************         
        DFHMDF POS=(10,02),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATE LBL OPT.:'                                       
MLBLOPT DFHMDF POS=(10,19),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,FSET),                                    X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(10,21),                                            X        
               LENGTH=23,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(P-P2L, C-CSEPK, B-BTH)'                                
        DFHMDF POS=(10,56),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PRT P2L HD/FT..:'                                       
MHDRFT  DFHMDF POS=(10,73),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,FSET),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL='Y'                                                      
        DFHMDF POS=(10,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(Y/N)'                                                  
**********************************************************************          
        DFHMDF POS=(11,02),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LABEL PRT ORDER:'                                       
MPRTORD DFHMDF POS=(11,19),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,FSET),                                    X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(11,21),                                            X        
               LENGTH=32,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(S-SHFLD, R-STR ORD, D-DOOR SEQ)'                       
***********************************************************************         
        DFHMDF POS=(12,02),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CSEPK PRCS AREA:'                                       
MCSEPK  DFHMDF POS=(12,19),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT,FSET),                                    X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(12,26),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' '                                                      
**********************************************************************          
        DFHMDF POS=(14,2),                                             X        
               LENGTH=41,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER OPTIONAL DEFAULT DATA TO BE APPLIED'              
        DFHMDF POS=(14,44),                                            X        
               LENGTH=20,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='TO ALL LINES LISTED:'                                   
**********************************************************************          
        DFHMDF POS=(15,02),                                            X        
               LENGTH=14,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='MODULE NUMBER:'                                         
MP2LMOD DFHMDF POS=(15,17),                                            X        
               LENGTH=03,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZ'                                                     
        DFHMDF POS=(15,21),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT)                                                
        DFHMDF POS=(15,23),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='('                                                      
        DFHMDF POS=(15,25),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='STR ZONE:'                                              
MZONE   DFHMDF POS=(15,35),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(15,42),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='MODS:'                                                  
MMOD1   DFHMDF POS=(15,48),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               ATTRB=ASKIP                                                      
MMOD2   DFHMDF POS=(15,53),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               ATTRB=ASKIP                                                      
MMOD3   DFHMDF POS=(15,58),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               ATTRB=ASKIP                                                      
MMOD4   DFHMDF POS=(15,63),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               ATTRB=ASKIP                                                      
MMOD5   DFHMDF POS=(15,68),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(15,72),                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP,                                            X        
               INITIAL=')'                                                      
**********************************************************************          
        DFHMDF POS=(16,02),                                            X        
               LENGTH=14,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SEASONAL SET.:'                                         
MSETNM  DFHMDF POS=(16,17),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               ATTRB=ASKIP                                                      
        DFHMDF POS=(16,23),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' '                                                      
***********************************************************************         
        DFHMDF POS=(17,02),                                            X        
               LENGTH=14,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CARTON COUNT.:'                                         
MCTNCNT DFHMDF POS=(17,17),                                            X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ'                                                    
        DFHMDF POS=(17,22),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' OUTER PACK QTY:'                                       
MOUTPCK DFHMDF POS=(17,39),                                            X        
               LENGTH=03,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZ'                                                     
        DFHMDF POS=(17,43),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT)                                                
        DFHMDF POS=(17,46),                                            X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='INNER PACK QTY:'                                        
MINPACK DFHMDF POS=(17,62),                                            X        
               LENGTH=03,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZ'                                                     
        DFHMDF POS=(17,66),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT)                                                
***********************************************************************         
        DFHMDF POS=(19,2),                                             X        
               LENGTH=40,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SPECIAL INSTRUCTION (OVERRIDE STORE ZONE'               
        DFHMDF POS=(19,43),                                            X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ON LABEL):'                                             
MINSTR  DFHMDF POS=(19,54),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT,FSET),                                    X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(19,60),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL=' '                                                      
**********************************************************************          
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
