        PRINT NOGEN                                                     00010000
PCKM900  DFHMSD TYPE=MAP,                                              X00020000
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               TIOAPFX=YES,                                            X00050000
               CTRL=FREEKB                                              00060000
*                                                                       00070000
PC900A   DFHMDI SIZE=(09,20),                                          X00080009
               LINE=1,                                                 X00090000
               COLUMN=1,                                               X00100000
               MAPATTS=(COLOR,HILIGHT),                                X00110000
               DSATTS=(COLOR,HILIGHT)                                   00120000
*                                                                       00130000
ATITLE   DFHMDF POS=(01,01),                                           X00140005
               LENGTH=019,                                             X00150006
               ATTRB=(ASKIP,NORM)                                       00160005
*                                                                       00170000
         DFHMDF POS=(02,01),                                           X00180000
               LENGTH=019,                                             X00190000
               ATTRB=(ASKIP,NORM),                                     X00200000
               INITIAL='ON MULT PO/RCVR/LNE'                            00210000
*                                                                       00220001
         DFHMDF POS=(03,01),                                           X00230000
               LENGTH=017,                                             X00240000
               ATTRB=(ASKIP,NORM),                                     X00250000
               INITIAL='PLEASE SUPPLY THE'                              00260000
         DFHMDF POS=(04,01),                                           X00270000
               LENGTH=009,                                             X00280000
               ATTRB=(ASKIP,NORM),                                     X00290000
               INITIAL='FOLLOWING'                                      00300000
*                                                                       00310000
         DFHMDF POS=(05,01),                                           X00320000
               LENGTH=002,                                             X00330008
               ATTRB=(ASKIP,NORM),                                     X00340000
               INITIAL='PO'                                             00350008
APO      DFHMDF POS=(05,04),                                           X00360008
               LENGTH=008,                                             X00370008
               PICOUT='ZZZZZZZZ',                                      X00380008
               ATTRB=(UNPROT,NUM,NORM,IC,FSET)                          00390000
         DFHMDF POS=(06,01),                                           X00400008
               LENGTH=004,                                             X00410008
               ATTRB=(ASKIP,NORM),                                     X00420008
               INITIAL='RCVR'                                           00430008
ARCVR    DFHMDF POS=(06,06),                                           X00440008
               LENGTH=004,                                             X00450008
               PICOUT='ZZZZ',                                          X00460008
               ATTRB=(UNPROT,NUM,NORM,FSET)                             00470001
*                                                                       00480001
AHDG     DFHMDF POS=(07,01),                                           X00490008
               LENGTH=004,                                             X00500002
               ATTRB=(ASKIP,NORM),                                     X00510001
               INITIAL='LINE'                                           00520002
ALINE    DFHMDF POS=(07,11),                                           X00530008
               LENGTH=004,                                             X00540001
               PICOUT='ZZZZ',                                          X00550007
               ATTRB=(UNPROT,NUM,NORM,FSET)                             00560001
         DFHMDF POS=(07,16),                                           X00570008
               LENGTH=001,                                             X00580001
               ATTRB=(ASKIP,DRK)                                        00590001
*                                                                       00600001
         DFHMDF POS=(08,01),                                           X00610008
               LENGTH=017,                                             X00620001
               ATTRB=(ASKIP,NORM),                                     X00630001
               INITIAL='ENTER TO CONTINUE'                              00640001
*                                                                       00650000
AMSGLN   DFHMDF POS=(09,01),                                           X00660008
               LENGTH=019,                                             X00670001
               ATTRB=(ASKIP,NORM,FSET),                                X00680001
               INITIAL='F3-IGNORE'                                      00690001
*                                                                       00700000
         DFHMSD TYPE=FINAL                                              00710000
         END                                                            00720000
