*********************************************************************** 00030001
*          DATA SET PCKM750                                             00040001
  PRINT  NOGEN                                                          00050001
*-------------------------------------------------------------------*   00060001
*                                                                   *   00070001
*        MAPSET  PCKM750                                            *   00080001
*        MAP     PC750A                                             *   00090001
*        PROGRAM PCKCS750                                           *   00100001
*        TRANSID E750 - UNITS WORKED BY PROCESS AREA LIST           *   00110001
*        SYSTEM  PROCESS CONTROL (PC)                               *   00120001
*                                                                   *   00130001
*-------------------------------------------------------------------*   00140001
PCKM750 DFHMSD TYPE=DSECT,                                             X00150001
               LANG=COBOL,                                             X00160001
               MODE=INOUT,                                             X00170001
               STORAGE=AUTO,                                           X00180001
               TERM=3270-2,                                            X00190001
               TIOAPFX=YES                                              00200001
*********************************************************************** 00210001
PC750A  DFHMDI LINE=2,COLUMN=1,                                        X00220001
               SIZE=(19,80),                                           X00230001
               CTRL=(FREEKB),                                          X00240001
               MAPATTS=(COLOR,HILIGHT),                                X00250001
               DSATTS=(COLOR,HILIGHT)                                   00260001
*********************************************************************** 00270001
        DFHMDF POS=(02,02),                                            X00280001
               LENGTH=11,                                              X00290001
               ATTRB=(ASKIP,NORM),                                     X00300001
               COLOR=NEUTRAL,                                          X00310001
               INITIAL='OPER UNIT.:'                                    00320001
AOPER   DFHMDF POS=(02,14),                                            X00330001
               LENGTH=04,                                              X00340001
               ATTRB=(ASKIP,NORM),                                     X00350001
               COLOR=BLUE                                               00360001
ADESC   DFHMDF POS=(02,19),                                            X00380001
               LENGTH=25,                                              X00390001
               ATTRB=(ASKIP,NORM),                                     X00400001
               COLOR=BLUE                                               00410001
*********************************************************************** 00421001
        DFHMDF POS=(03,02),                                            X00422001
               LENGTH=11,                                              X00423001
               ATTRB=(ASKIP,NORM),                                     X00424001
               COLOR=NEUTRAL,                                          X00425001
               INITIAL='TOTAL OPER:'                                    00426001
        DFHMDF POS=(03,15),                                            X00427001
               LENGTH=04,                                              X00428001
               ATTRB=(ASKIP,NORM),                                     X00429001
               COLOR=NEUTRAL,                                          X00429101
               INITIAL='3RD:'                                           00429201
A3TOTL  DFHMDF POS=(03,20),                                            X00429301
               LENGTH=15,                                              X00429420
               ATTRB=(ASKIP,NORM),                                     X00429501
               COLOR=BLUE                                               00429720
A3PRCT  DFHMDF POS=(03,36),                                            X00430020
               LENGTH=06,                                              X00440001
               ATTRB=(ASKIP,NORM),                                     X00450001
               COLOR=BLUE                                               00460001
        DFHMDF POS=(03,45),                                            X00470020
               LENGTH=04,                                              X00480001
               ATTRB=(ASKIP,NORM),                                     X00490001
               COLOR=NEUTRAL,                                          X00500001
               INITIAL='1ST:'                                           00510001
A1TOTL  DFHMDF POS=(03,50),                                            X00520020
               LENGTH=15,                                              X00530020
               ATTRB=(ASKIP,NORM),                                     X00540001
               COLOR=BLUE                                               00550020
A1PRCT  DFHMDF POS=(03,66),                                            X00570020
               LENGTH=06,                                              X00580001
               ATTRB=(ASKIP,NORM),                                     X00590001
               COLOR=BLUE                                               00600001
        DFHMDF POS=(03,73),                                            X00610020
               LENGTH=01,                                              X00620001
               ATTRB=(ASKIP,DRK)                                        00630001
*********************************************************************** 00640001
        DFHMDF POS=(04,15),                                            X00650004
               LENGTH=04,                                              X00660001
               ATTRB=(ASKIP,NORM),                                     X00670001
               COLOR=NEUTRAL,                                          X00680001
               INITIAL='2ND:'                                           00690001
A2TOTL  DFHMDF POS=(04,20),                                            X00700004
               LENGTH=15,                                              X00710020
               ATTRB=(ASKIP,NORM),                                     X00720001
               COLOR=BLUE                                               00730020
A2PRCT  DFHMDF POS=(04,36),                                            X00750020
               LENGTH=06,                                              X00760001
               ATTRB=(ASKIP,NORM),                                     X00770001
               COLOR=BLUE                                               00780001
        DFHMDF POS=(04,45),                                            X00790020
               LENGTH=04,                                              X00800001
               ATTRB=(ASKIP,NORM),                                     X00810001
               COLOR=NEUTRAL,                                          X00820001
               INITIAL='TOT:'                                           00830001
ATTOTL  DFHMDF POS=(04,50),                                            X00840020
               LENGTH=15,                                              X00850020
               ATTRB=(ASKIP,NORM),                                     X00860001
               COLOR=BLUE                                               00870020
        DFHMDF POS=(04,73),                                            X00890020
               LENGTH=01,                                              X00900001
               ATTRB=(ASKIP,DRK)                                        00910001
*********************************************************************** 00920001
ADATE   DFHMDF POS=(05,02),                                            X00930004
               LENGTH=45,                                              X00940001
               ATTRB=(ASKIP,NORM),                                     X00950001
               COLOR=YELLOW                                             00960001
        DFHMDF POS=(05,49),                                            X00970004
               LENGTH=05,                                              X00980001
               ATTRB=(ASKIP,NORM),                                     X00990001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01000001
ASTRTIT DFHMDF POS=(05,55),                                            X01010004
               LENGTH=05,                                              X01020001
               ATTRB=(NUM,UNPROT,NORM),                                X01030001
               COLOR=GREEN,                                            X01040001
               PICOUT='ZZZZ9',                                         X01050001
               HILIGHT=UNDERLINE                                        01060001
        DFHMDF POS=(05,61),                                            X01070004
               LENGTH=02,                                              X01080001
               ATTRB=(ASKIP,NORM),                                     X01090001
               COLOR=NEUTRAL,                                          X01100001
               INITIAL='TO'                                             01110001
AENDIT  DFHMDF POS=(05,64),                                            X01120004
               LENGTH=05,                                              X01130001
               ATTRB=(ASKIP,NORM),                                     X01140001
               COLOR=BLUE,                                             X01150001
               PICOUT='ZZZZ9'                                           01160001
        DFHMDF POS=(05,70),                                            X01170004
               LENGTH=02,                                              X01180001
               ATTRB=(ASKIP,NORM),                                     X01190001
               COLOR=NEUTRAL,                                          X01200001
               INITIAL='OF'                                             01210001
ATOTIT  DFHMDF POS=(05,73),                                            X01220004
               LENGTH=05,                                              X01230001
               ATTRB=(ASKIP,NORM),                                     X01240001
               COLOR=BLUE,                                             X01250001
               PICOUT='ZZZZ9'                                           01260001
*********************************************************************** 01270001
        DFHMDF POS=(06,19),                                            X01280009
               LENGTH=09,                                              X01290001
               ATTRB=(ASKIP,NORM),                                     X01300001
               COLOR=NEUTRAL,                                          X01310001
               INITIAL='3RD   3RD'                                      01320001
        DFHMDF POS=(06,36),                                            X01330009
               LENGTH=09,                                              X01340001
               ATTRB=(ASKIP,NORM),                                     X01350001
               COLOR=NEUTRAL,                                          X01360001
               INITIAL='1ST   1ST'                                      01370001
        DFHMDF POS=(06,53),                                            X01380009
               LENGTH=09,                                              X01390001
               ATTRB=(ASKIP,NORM),                                     X01400001
               COLOR=NEUTRAL,                                          X01410001
               INITIAL='2ND   2ND'                                      01420001
        DFHMDF POS=(06,68),                                            X01430012
               LENGTH=12,                                              X01440013
               ATTRB=(ASKIP,NORM),                                     X01450001
               COLOR=NEUTRAL,                                          X01460001
               INITIAL='TOTAL   % TO'                                   01470013
*********************************************************************** 01480001
        DFHMDF POS=(07,05),                                            X01490009
               LENGTH=27,                                              X01500001
               ATTRB=(ASKIP,NORM),                                     X01510001
               COLOR=NEUTRAL,                                          X01520001
               INITIAL='PROCESS     SHIFT  % TO'                        01530004
        DFHMDF POS=(07,34),                                            X01540009
               LENGTH=28,                                              X01550008
               ATTRB=(ASKIP,NORM),                                     X01560001
               COLOR=NEUTRAL,                                          X01570001
               INITIAL='SHIFT  % TO      SHIFT  % TO'                   01580008
        DFHMDF POS=(07,68),                                            X01590012
               LENGTH=12,                                              X01600013
               ATTRB=(ASKIP,NORM),                                     X01610001
               COLOR=NEUTRAL,                                          X01620001
               INITIAL='AREA    OPER'                                   01630013
*********************************************************************** 01640001
        DFHMDF POS=(08,01),                                            X01650004
               LENGTH=09,                                              X01660010
               ATTRB=(ASKIP,NORM),                                     X01670001
               COLOR=NEUTRAL,                                          X01680001
               INITIAL='S    AREA'                                      01690017
        DFHMDF POS=(08,17),                                            X01691010
               LENGTH=28,                                              X01692010
               ATTRB=(ASKIP,NORM),                                     X01693010
               COLOR=NEUTRAL,                                          X01694010
               INITIAL='UNITS  AREA      UNITS  AREA'                   01695019
        DFHMDF POS=(08,51),                                            X01700010
               LENGTH=29,                                              X01710013
               ATTRB=(ASKIP,NORM),                                     X01720001
               COLOR=NEUTRAL,                                          X01730001
               INITIAL='UNITS  AREA     UNITS   TOTAL'                  01740019
*********************************************************************** 01750001
ASEL01  DFHMDF POS=(09,01),                                            X01760017
               LENGTH=01,                                              X01770001
               ATTRB=(UNPROT,NORM),                                    X01780001
               HILIGHT=UNDERLINE,                                      X01790001
               COLOR=GREEN                                              01800001
        DFHMDF POS=(09,03),                                            X01801017
               LENGTH=01,                                              X01802017
               ATTRB=(ASKIP,DRK)                                        01803017
AAREA01 DFHMDF POS=(09,05),                                            X01810010
               LENGTH=06,                                              X01820004
               ATTRB=(ASKIP,NORM),                                     X01830001
               COLOR=BLUE                                               01840001
A3UNT01 DFHMDF POS=(09,12),                                            X01850010
               LENGTH=10,                                              X01860005
               ATTRB=(ASKIP,NORM),                                     X01870001
               COLOR=BLUE                                               01890001
A3PCT01 DFHMDF POS=(09,23),                                            X01900010
               LENGTH=05,                                              X01910001
               ATTRB=(ASKIP,NORM),                                     X01920001
               COLOR=BLUE                                               01930001
A1UNT01 DFHMDF POS=(09,29),                                            X01940010
               LENGTH=10,                                              X01950005
               ATTRB=(ASKIP,NORM),                                     X01960001
               COLOR=BLUE                                               01980001
A1PCT01 DFHMDF POS=(09,40),                                            X01990010
               LENGTH=05,                                              X02000001
               ATTRB=(ASKIP,NORM),                                     X02010001
               COLOR=BLUE                                               02020001
A2UNT01 DFHMDF POS=(09,46),                                            X02030010
               LENGTH=10,                                              X02040005
               ATTRB=(ASKIP,NORM),                                     X02050001
               COLOR=BLUE                                               02070001
A2PCT01 DFHMDF POS=(09,57),                                            X02080010
               LENGTH=05,                                              X02090001
               ATTRB=(ASKIP,NORM),                                     X02100001
               COLOR=BLUE                                               02110001
ATUNT01 DFHMDF POS=(09,63),                                            X02120010
               LENGTH=11,                                              X02130012
               ATTRB=(ASKIP,NORM),                                     X02140001
               COLOR=BLUE                                               02160001
ATPCT01 DFHMDF POS=(09,75),                                            X02170012
               LENGTH=05,                                              X02180001
               ATTRB=(ASKIP,NORM),                                     X02190001
               COLOR=BLUE                                               02200001
*********************************************************************** 02201004
ASEL02  DFHMDF POS=(10,01),                                            X02202017
               LENGTH=01,                                              X02203004
               ATTRB=(UNPROT,NORM),                                    X02204004
               HILIGHT=UNDERLINE,                                      X02205004
               COLOR=GREEN                                              02206004
        DFHMDF POS=(10,03),                                            X02206117
               LENGTH=01,                                              X02206217
               ATTRB=(ASKIP,DRK)                                        02206317
AAREA02 DFHMDF POS=(10,05),                                            X02207010
               LENGTH=06,                                              X02208004
               ATTRB=(ASKIP,NORM),                                     X02209004
               COLOR=BLUE                                               02209104
A3UNT02 DFHMDF POS=(10,12),                                            X02209210
               LENGTH=10,                                              X02209305
               ATTRB=(ASKIP,NORM),                                     X02209404
               COLOR=BLUE                                               02209604
A3PCT02 DFHMDF POS=(10,23),                                            X02209710
               LENGTH=05,                                              X02209804
               ATTRB=(ASKIP,NORM),                                     X02209904
               COLOR=BLUE                                               02210004
A1UNT02 DFHMDF POS=(10,29),                                            X02211010
               LENGTH=10,                                              X02212005
               ATTRB=(ASKIP,NORM),                                     X02213004
               COLOR=BLUE                                               02215004
A1PCT02 DFHMDF POS=(10,40),                                            X02216010
               LENGTH=05,                                              X02217004
               ATTRB=(ASKIP,NORM),                                     X02218004
               COLOR=BLUE                                               02219004
A2UNT02 DFHMDF POS=(10,46),                                            X02219110
               LENGTH=10,                                              X02219205
               ATTRB=(ASKIP,NORM),                                     X02219304
               COLOR=BLUE                                               02219504
A2PCT02 DFHMDF POS=(10,57),                                            X02219610
               LENGTH=05,                                              X02219704
               ATTRB=(ASKIP,NORM),                                     X02219804
               COLOR=BLUE                                               02219904
ATUNT02 DFHMDF POS=(10,63),                                            X02220010
               LENGTH=11,                                              X02221012
               ATTRB=(ASKIP,NORM),                                     X02222004
               COLOR=BLUE                                               02224004
ATPCT02 DFHMDF POS=(10,75),                                            X02225012
               LENGTH=05,                                              X02226004
               ATTRB=(ASKIP,NORM),                                     X02227004
               COLOR=BLUE                                               02228004
*********************************************************************** 02229004
ASEL03  DFHMDF POS=(11,01),                                            X02229117
               LENGTH=01,                                              X02229204
               ATTRB=(UNPROT,NORM),                                    X02229304
               HILIGHT=UNDERLINE,                                      X02229404
               COLOR=GREEN                                              02229504
        DFHMDF POS=(11,03),                                            X02229617
               LENGTH=01,                                              X02229717
               ATTRB=(ASKIP,DRK)                                        02229817
AAREA03 DFHMDF POS=(11,05),                                            X02229910
               LENGTH=06,                                              X02230004
               ATTRB=(ASKIP,NORM),                                     X02230104
               COLOR=BLUE                                               02230204
A3UNT03 DFHMDF POS=(11,12),                                            X02230310
               LENGTH=10,                                              X02231005
               ATTRB=(ASKIP,NORM),                                     X02232004
               COLOR=BLUE                                               02234004
A3PCT03 DFHMDF POS=(11,23),                                            X02235010
               LENGTH=05,                                              X02236004
               ATTRB=(ASKIP,NORM),                                     X02237004
               COLOR=BLUE                                               02238004
A1UNT03 DFHMDF POS=(11,29),                                            X02239010
               LENGTH=10,                                              X02239105
               ATTRB=(ASKIP,NORM),                                     X02239204
               COLOR=BLUE                                               02239404
A1PCT03 DFHMDF POS=(11,40),                                            X02239510
               LENGTH=05,                                              X02239604
               ATTRB=(ASKIP,NORM),                                     X02239704
               COLOR=BLUE                                               02239804
A2UNT03 DFHMDF POS=(11,46),                                            X02239910
               LENGTH=10,                                              X02240005
               ATTRB=(ASKIP,NORM),                                     X02241004
               COLOR=BLUE                                               02243004
A2PCT03 DFHMDF POS=(11,57),                                            X02244010
               LENGTH=05,                                              X02245004
               ATTRB=(ASKIP,NORM),                                     X02246004
               COLOR=BLUE                                               02247004
ATUNT03 DFHMDF POS=(11,63),                                            X02248010
               LENGTH=11,                                              X02249012
               ATTRB=(ASKIP,NORM),                                     X02249104
               COLOR=BLUE                                               02249304
ATPCT03 DFHMDF POS=(11,75),                                            X02249412
               LENGTH=05,                                              X02249504
               ATTRB=(ASKIP,NORM),                                     X02249604
               COLOR=BLUE                                               02249704
*********************************************************************** 02249804
ASEL04  DFHMDF POS=(12,01),                                            X02249917
               LENGTH=01,                                              X02250004
               ATTRB=(UNPROT,NORM),                                    X02251004
               HILIGHT=UNDERLINE,                                      X02252004
               COLOR=GREEN                                              02253004
        DFHMDF POS=(12,03),                                            X02253117
               LENGTH=01,                                              X02253217
               ATTRB=(ASKIP,DRK)                                        02253317
AAREA04 DFHMDF POS=(12,05),                                            X02254010
               LENGTH=06,                                              X02255004
               ATTRB=(ASKIP,NORM),                                     X02256004
               COLOR=BLUE                                               02257004
A3UNT04 DFHMDF POS=(12,12),                                            X02258010
               LENGTH=10,                                              X02259005
               ATTRB=(ASKIP,NORM),                                     X02259104
               COLOR=BLUE                                               02259304
A3PCT04 DFHMDF POS=(12,23),                                            X02259410
               LENGTH=05,                                              X02259504
               ATTRB=(ASKIP,NORM),                                     X02259604
               COLOR=BLUE                                               02259704
A1UNT04 DFHMDF POS=(12,29),                                            X02259810
               LENGTH=10,                                              X02259905
               ATTRB=(ASKIP,NORM),                                     X02260004
               COLOR=BLUE                                               02262004
A1PCT04 DFHMDF POS=(12,40),                                            X02263010
               LENGTH=05,                                              X02264004
               ATTRB=(ASKIP,NORM),                                     X02265004
               COLOR=BLUE                                               02266004
A2UNT04 DFHMDF POS=(12,46),                                            X02267010
               LENGTH=10,                                              X02268005
               ATTRB=(ASKIP,NORM),                                     X02269004
               COLOR=BLUE                                               02269204
A2PCT04 DFHMDF POS=(12,57),                                            X02269310
               LENGTH=05,                                              X02269404
               ATTRB=(ASKIP,NORM),                                     X02269504
               COLOR=BLUE                                               02269604
ATUNT04 DFHMDF POS=(12,63),                                            X02269710
               LENGTH=11,                                              X02269812
               ATTRB=(ASKIP,NORM),                                     X02269904
               COLOR=BLUE                                               02271004
ATPCT04 DFHMDF POS=(12,75),                                            X02272012
               LENGTH=05,                                              X02273004
               ATTRB=(ASKIP,NORM),                                     X02274004
               COLOR=BLUE                                               02275004
*********************************************************************** 02276004
ASEL05  DFHMDF POS=(13,01),                                            X02277017
               LENGTH=01,                                              X02278004
               ATTRB=(UNPROT,NORM),                                    X02279004
               HILIGHT=UNDERLINE,                                      X02279104
               COLOR=GREEN                                              02279204
        DFHMDF POS=(13,03),                                            X02279317
               LENGTH=01,                                              X02279417
               ATTRB=(ASKIP,DRK)                                        02279517
AAREA05 DFHMDF POS=(13,05),                                            X02279610
               LENGTH=06,                                              X02279704
               ATTRB=(ASKIP,NORM),                                     X02279804
               COLOR=BLUE                                               02279904
A3UNT05 DFHMDF POS=(13,12),                                            X02280010
               LENGTH=10,                                              X02280105
               ATTRB=(ASKIP,NORM),                                     X02280204
               COLOR=BLUE                                               02281004
A3PCT05 DFHMDF POS=(13,23),                                            X02282010
               LENGTH=05,                                              X02283004
               ATTRB=(ASKIP,NORM),                                     X02284004
               COLOR=BLUE                                               02285004
A1UNT05 DFHMDF POS=(13,29),                                            X02286010
               LENGTH=10,                                              X02287005
               ATTRB=(ASKIP,NORM),                                     X02288004
               COLOR=BLUE                                               02289104
A1PCT05 DFHMDF POS=(13,40),                                            X02289210
               LENGTH=05,                                              X02289304
               ATTRB=(ASKIP,NORM),                                     X02289404
               COLOR=BLUE                                               02289504
A2UNT05 DFHMDF POS=(13,46),                                            X02289610
               LENGTH=10,                                              X02289705
               ATTRB=(ASKIP,NORM),                                     X02289804
               COLOR=BLUE                                               02290004
A2PCT05 DFHMDF POS=(13,57),                                            X02291010
               LENGTH=05,                                              X02292004
               ATTRB=(ASKIP,NORM),                                     X02293004
               COLOR=BLUE                                               02294004
ATUNT05 DFHMDF POS=(13,63),                                            X02295010
               LENGTH=11,                                              X02296012
               ATTRB=(ASKIP,NORM),                                     X02297004
               COLOR=BLUE                                               02299004
ATPCT05 DFHMDF POS=(13,75),                                            X02299112
               LENGTH=05,                                              X02299204
               ATTRB=(ASKIP,NORM),                                     X02299304
               COLOR=BLUE                                               02299404
*********************************************************************** 02299504
ASEL06  DFHMDF POS=(14,01),                                            X02299617
               LENGTH=01,                                              X02299704
               ATTRB=(UNPROT,NORM),                                    X02299804
               HILIGHT=UNDERLINE,                                      X02299904
               COLOR=GREEN                                              02300004
        DFHMDF POS=(14,03),                                            X02300117
               LENGTH=01,                                              X02300217
               ATTRB=(ASKIP,DRK)                                        02300317
AAREA06 DFHMDF POS=(14,05),                                            X02301010
               LENGTH=06,                                              X02302004
               ATTRB=(ASKIP,NORM),                                     X02303004
               COLOR=BLUE                                               02304004
A3UNT06 DFHMDF POS=(14,12),                                            X02305010
               LENGTH=10,                                              X02306005
               ATTRB=(ASKIP,NORM),                                     X02307004
               COLOR=BLUE                                               02309004
A3PCT06 DFHMDF POS=(14,23),                                            X02309110
               LENGTH=05,                                              X02309204
               ATTRB=(ASKIP,NORM),                                     X02309304
               COLOR=BLUE                                               02309404
A1UNT06 DFHMDF POS=(14,29),                                            X02309510
               LENGTH=10,                                              X02309605
               ATTRB=(ASKIP,NORM),                                     X02309704
               COLOR=BLUE                                               02309904
A1PCT06 DFHMDF POS=(14,40),                                            X02310010
               LENGTH=05,                                              X02311004
               ATTRB=(ASKIP,NORM),                                     X02312004
               COLOR=BLUE                                               02313004
A2UNT06 DFHMDF POS=(14,46),                                            X02314010
               LENGTH=10,                                              X02315006
               ATTRB=(ASKIP,NORM),                                     X02316004
               COLOR=BLUE                                               02318004
A2PCT06 DFHMDF POS=(14,57),                                            X02319010
               LENGTH=05,                                              X02319104
               ATTRB=(ASKIP,NORM),                                     X02319204
               COLOR=BLUE                                               02319304
ATUNT06 DFHMDF POS=(14,63),                                            X02319410
               LENGTH=11,                                              X02319512
               ATTRB=(ASKIP,NORM),                                     X02319604
               COLOR=BLUE                                               02319804
ATPCT06 DFHMDF POS=(14,75),                                            X02319912
               LENGTH=05,                                              X02320004
               ATTRB=(ASKIP,NORM),                                     X02321004
               COLOR=BLUE                                               02322004
*********************************************************************** 02323004
ASEL07  DFHMDF POS=(15,01),                                            X02324017
               LENGTH=01,                                              X02325004
               ATTRB=(UNPROT,NORM),                                    X02326004
               HILIGHT=UNDERLINE,                                      X02327004
               COLOR=GREEN                                              02328004
        DFHMDF POS=(15,03),                                            X02328117
               LENGTH=01,                                              X02328217
               ATTRB=(ASKIP,DRK)                                        02328317
AAREA07 DFHMDF POS=(15,05),                                            X02329010
               LENGTH=06,                                              X02329104
               ATTRB=(ASKIP,NORM),                                     X02329204
               COLOR=BLUE                                               02329304
A3UNT07 DFHMDF POS=(15,12),                                            X02329410
               LENGTH=10,                                              X02329506
               ATTRB=(ASKIP,NORM),                                     X02329604
               COLOR=BLUE                                               02329804
A3PCT07 DFHMDF POS=(15,23),                                            X02329910
               LENGTH=05,                                              X02330004
               ATTRB=(ASKIP,NORM),                                     X02331004
               COLOR=BLUE                                               02332004
A1UNT07 DFHMDF POS=(15,29),                                            X02333010
               LENGTH=10,                                              X02334006
               ATTRB=(ASKIP,NORM),                                     X02335004
               COLOR=BLUE                                               02337004
A1PCT07 DFHMDF POS=(15,40),                                            X02338010
               LENGTH=05,                                              X02339004
               ATTRB=(ASKIP,NORM),                                     X02339104
               COLOR=BLUE                                               02339204
A2UNT07 DFHMDF POS=(15,46),                                            X02339310
               LENGTH=10,                                              X02339406
               ATTRB=(ASKIP,NORM),                                     X02339504
               COLOR=BLUE                                               02339704
A2PCT07 DFHMDF POS=(15,57),                                            X02339810
               LENGTH=05,                                              X02339904
               ATTRB=(ASKIP,NORM),                                     X02340004
               COLOR=BLUE                                               02341004
ATUNT07 DFHMDF POS=(15,63),                                            X02342010
               LENGTH=11,                                              X02343012
               ATTRB=(ASKIP,NORM),                                     X02344004
               COLOR=BLUE                                               02346004
ATPCT07 DFHMDF POS=(15,75),                                            X02347012
               LENGTH=05,                                              X02348004
               ATTRB=(ASKIP,NORM),                                     X02349004
               COLOR=BLUE                                               02349104
*********************************************************************** 02349204
ASEL08  DFHMDF POS=(16,01),                                            X02349317
               LENGTH=01,                                              X02349404
               ATTRB=(UNPROT,NORM),                                    X02349504
               HILIGHT=UNDERLINE,                                      X02349604
               COLOR=GREEN                                              02349704
        DFHMDF POS=(16,03),                                            X02349817
               LENGTH=01,                                              X02349917
               ATTRB=(ASKIP,DRK)                                        02350017
AAREA08 DFHMDF POS=(16,05),                                            X02350110
               LENGTH=06,                                              X02350204
               ATTRB=(ASKIP,NORM),                                     X02350304
               COLOR=BLUE                                               02351004
A3UNT08 DFHMDF POS=(16,12),                                            X02352010
               LENGTH=10,                                              X02353006
               ATTRB=(ASKIP,NORM),                                     X02354004
               COLOR=BLUE                                               02356004
A3PCT08 DFHMDF POS=(16,23),                                            X02357010
               LENGTH=05,                                              X02358004
               ATTRB=(ASKIP,NORM),                                     X02359004
               COLOR=BLUE                                               02359104
A1UNT08 DFHMDF POS=(16,29),                                            X02359210
               LENGTH=10,                                              X02359306
               ATTRB=(ASKIP,NORM),                                     X02359404
               COLOR=BLUE                                               02359604
A1PCT08 DFHMDF POS=(16,40),                                            X02359710
               LENGTH=05,                                              X02359804
               ATTRB=(ASKIP,NORM),                                     X02359904
               COLOR=BLUE                                               02360004
A2UNT08 DFHMDF POS=(16,46),                                            X02361010
               LENGTH=10,                                              X02362006
               ATTRB=(ASKIP,NORM),                                     X02363004
               COLOR=BLUE                                               02365004
A2PCT08 DFHMDF POS=(16,57),                                            X02366010
               LENGTH=05,                                              X02367004
               ATTRB=(ASKIP,NORM),                                     X02368004
               COLOR=BLUE                                               02369004
ATUNT08 DFHMDF POS=(16,63),                                            X02369110
               LENGTH=11,                                              X02369212
               ATTRB=(ASKIP,NORM),                                     X02369304
               COLOR=BLUE                                               02369504
ATPCT08 DFHMDF POS=(16,75),                                            X02369612
               LENGTH=05,                                              X02369704
               ATTRB=(ASKIP,NORM),                                     X02369804
               COLOR=BLUE                                               02369904
*********************************************************************** 02370004
ASEL09  DFHMDF POS=(17,01),                                            X02371017
               LENGTH=01,                                              X02372004
               ATTRB=(UNPROT,NORM),                                    X02373004
               HILIGHT=UNDERLINE,                                      X02374004
               COLOR=GREEN                                              02375004
        DFHMDF POS=(17,03),                                            X02375117
               LENGTH=01,                                              X02375217
               ATTRB=(ASKIP,DRK)                                        02375317
AAREA09 DFHMDF POS=(17,05),                                            X02376010
               LENGTH=06,                                              X02377004
               ATTRB=(ASKIP,NORM),                                     X02378004
               COLOR=BLUE                                               02379004
A3UNT09 DFHMDF POS=(17,12),                                            X02379110
               LENGTH=10,                                              X02379206
               ATTRB=(ASKIP,NORM),                                     X02379304
               COLOR=BLUE                                               02379504
A3PCT09 DFHMDF POS=(17,23),                                            X02379610
               LENGTH=05,                                              X02379704
               ATTRB=(ASKIP,NORM),                                     X02379804
               COLOR=BLUE                                               02379904
A1UNT09 DFHMDF POS=(17,29),                                            X02380010
               LENGTH=10,                                              X02381006
               ATTRB=(ASKIP,NORM),                                     X02382004
               COLOR=BLUE                                               02384004
A1PCT09 DFHMDF POS=(17,40),                                            X02385010
               LENGTH=05,                                              X02386004
               ATTRB=(ASKIP,NORM),                                     X02387004
               COLOR=BLUE                                               02388004
A2UNT09 DFHMDF POS=(17,46),                                            X02389010
               LENGTH=10,                                              X02389106
               ATTRB=(ASKIP,NORM),                                     X02389204
               COLOR=BLUE                                               02389404
A2PCT09 DFHMDF POS=(17,57),                                            X02389510
               LENGTH=05,                                              X02389604
               ATTRB=(ASKIP,NORM),                                     X02389704
               COLOR=BLUE                                               02389804
ATUNT09 DFHMDF POS=(17,63),                                            X02389910
               LENGTH=11,                                              X02390012
               ATTRB=(ASKIP,NORM),                                     X02391004
               COLOR=BLUE                                               02393004
ATPCT09 DFHMDF POS=(17,75),                                            X02394012
               LENGTH=05,                                              X02395004
               ATTRB=(ASKIP,NORM),                                     X02396004
               COLOR=BLUE                                               02397004
*********************************************************************** 02398004
ASEL10  DFHMDF POS=(18,01),                                            X02399017
               LENGTH=01,                                              X02399104
               ATTRB=(UNPROT,NORM),                                    X02399204
               HILIGHT=UNDERLINE,                                      X02399304
               COLOR=GREEN                                              02399404
        DFHMDF POS=(18,03),                                            X02399517
               LENGTH=01,                                              X02399617
               ATTRB=(ASKIP,DRK)                                        02399717
AAREA10 DFHMDF POS=(18,05),                                            X02399810
               LENGTH=06,                                              X02399904
               ATTRB=(ASKIP,NORM),                                     X02400004
               COLOR=BLUE                                               02400104
A3UNT10 DFHMDF POS=(18,12),                                            X02400210
               LENGTH=10,                                              X02400306
               ATTRB=(ASKIP,NORM),                                     X02401004
               COLOR=BLUE                                               02403004
A3PCT10 DFHMDF POS=(18,23),                                            X02404010
               LENGTH=05,                                              X02405004
               ATTRB=(ASKIP,NORM),                                     X02406004
               COLOR=BLUE                                               02407004
A1UNT10 DFHMDF POS=(18,29),                                            X02408010
               LENGTH=10,                                              X02409006
               ATTRB=(ASKIP,NORM),                                     X02409104
               COLOR=BLUE                                               02409304
A1PCT10 DFHMDF POS=(18,40),                                            X02409410
               LENGTH=05,                                              X02409504
               ATTRB=(ASKIP,NORM),                                     X02409604
               COLOR=BLUE                                               02409704
A2UNT10 DFHMDF POS=(18,46),                                            X02409810
               LENGTH=10,                                              X02409906
               ATTRB=(ASKIP,NORM),                                     X02410004
               COLOR=BLUE                                               02412004
A2PCT10 DFHMDF POS=(18,57),                                            X02413010
               LENGTH=05,                                              X02414004
               ATTRB=(ASKIP,NORM),                                     X02415004
               COLOR=BLUE                                               02416004
ATUNT10 DFHMDF POS=(18,63),                                            X02417010
               LENGTH=11,                                              X02418012
               ATTRB=(ASKIP,NORM),                                     X02419004
               COLOR=BLUE                                               02419204
ATPCT10 DFHMDF POS=(18,75),                                            X02419312
               LENGTH=05,                                              X02419404
               ATTRB=(ASKIP,NORM),                                     X02419504
               COLOR=BLUE                                               02419604
*********************************************************************** 02420004
*********************************************************************** 06820001
        DFHMDF POS=(19,45),                                            X06830001
               LENGTH=25,                                              X06840001
               ATTRB=(ASKIP,NORM),                                     X06850001
               COLOR=NEUTRAL,                                          X06860001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      06870001
ASELIT  DFHMDF POS=(19,72),                                            X06880001
               LENGTH=07,                                              X06890001
               ATTRB=(ASKIP,NORM),                                     X06900001
               COLOR=BLUE,                                             X06910001
               PICOUT='ZZZ,ZZ9'                                         06920001
        DFHMSD TYPE=FINAL                                               06930001
        END                                                             06940001
