*          DATA SET PCKM892    AT LEVEL 030 AS OF 06/18/01                      
        PRINT NOGEN                                                     00001   
PCKM892  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC892A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,04),                                           X00012**5
               LENGTH=013,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='TRAILER AUDIT'                                  00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='AUD NBR:'                                       00015*29
*                                                                       00016   
ACNTL    DFHMDF POS=(02,10),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC)                                   00053   
         DFHMDF POS=(02,20),                                           X00034*22
               LENGTH=000,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SRL NBR:'                                       00015*29
*                                                                       00016   
ATRLR    DFHMDF POS=(03,10),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC)                                   00053   
         DFHMDF POS=(03,20),                                           X00034*22
               LENGTH=000,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=017,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SELECT AUDIT TYPE'                              00015*29
*                                                                       00041*22
A100     DFHMDF POS=(05,01),                                           X00042**8
               LENGTH=01,                                              X00043**5
               ATTRB=(UNPROT,NORM)                                      00053   
         DFHMDF POS=(05,03),                                           X00042**8
               LENGTH=10,                                              X00043**5
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='100% CHECK'                                     00015*29
*                                                                       00041*22
ASPOT    DFHMDF POS=(06,01),                                           X00042**8
               LENGTH=01,                                              X00043**5
               ATTRB=(UNPROT,NORM)                                      00053   
         DFHMDF POS=(06,03),                                           X00042**8
               LENGTH=10,                                              X00043**5
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SPOT CHECK'                                     00015*29
*                                                                       00055   
AKEYS    DFHMDF POS=(07,01),                                           X00064**9
               LENGTH=019,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='F2-CONT.  F4-CREATE'                            00067**5
*                                                                       00072**5
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
