*          DATA SET PCKM704    AT LEVEL 000 AS OF   /  /                        
***********************************************************************         
        PRINT NOGEN                                                             
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  PCKM704                                            *           
*        MAP     PC704A                                             *           
*        PROGRAM PCKCS704                                           *           
*        TRANSID E704 - PACK-TO-LIGHT STATUS REPORTS                *           
*        SYSTEM  PC -- PROCESS CONTROLS                             *           
*                                                                   *           
*-------------------------------------------------------------------*           
PCKM704 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES                                                      
PC704A  DFHMDI SIZE=(19,80),                                           X        
               LINE=2,COLUMN=1,                                        X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               CTRL=(FREEKB,FRSET)                                              
***********************************************************************         
*   SCREEN LINE 6                                                               
***********************************************************************         
        DFHMDF POS=(6,23),                                             X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OPERATING ID........:'                                  
MOPID   DFHMDF POS=(6,45),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ'                                                    
        DFHMDF POS=(6,50),                                             X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP                                                      
MOPDESC DFHMDF POS=(6,52),                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=024                                                       
***********************************************************************         
*   SCREEN LINE 7                                                               
***********************************************************************         
        DFHMDF POS=(7,23),                                             X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='FACILITY ID.........:'                                  
MFACID  DFHMDF POS=(7,45),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ'                                                    
        DFHMDF POS=(7,50),                                             X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 10                                                              
***********************************************************************         
        DFHMDF POS=(10,16),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATE THE STATUS REPORT BY:'                           
***********************************************************************         
*   SCREEN LINE 12                                                              
***********************************************************************         
        DFHMDF POS=(12,23),                                            X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='STORE ZONE..........:'                                  
MZONE   DFHMDF POS=(12,45),                                            X        
               LENGTH=1,                                               X        
               ATTRB=(UNPROT,IC),                                      X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(12,47),                                            X        
               LENGTH=30,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(S=ENTIRE RPT, X=SUMMARY ONLY)'                         
***********************************************************************         
*   SCREEN LINE 13                                                              
***********************************************************************         
        DFHMDF POS=(13,23),                                            X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PACK-TO-LIGHT MODULE:'                                  
MP2L    DFHMDF POS=(13,45),                                            X        
               LENGTH=1,                                               X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(13,47),                                            X        
               LENGTH=30,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(S=ENTIRE RPT, X=SUMMARY ONLY)'                         
***********************************************************************         
*   SCREEN LINE 15                                                              
***********************************************************************         
        DFHMDF POS=(15,16),                                            X        
               LENGTH=28,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PRINT REPORT TO............:'                           
***********************************************************************         
*   SCREEN LINE 16                                                              
***********************************************************************         
        DFHMDF POS=(16,23),                                            X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='RDS (Y/N)...........:'                                  
MINFO   DFHMDF POS=(16,45),                                            X        
               LENGTH=1,                                               X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(16,47),                                            X        
               LENGTH=32,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(REPORT ID PCK91005 OR PCK91010)'                       
        DFHMDF POS=(16,80),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
***********************************************************************         
*   SCREEN LINE 17                                                              
***********************************************************************         
        DFHMDF POS=(17,23),                                            X        
               LENGTH=21,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='REMOTE PRINTER ID...:'                                  
MPRTID  DFHMDF POS=(17,45),                                            X        
               LENGTH=8,                                               X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(17,54),                                            X        
               LENGTH=1,                                               X        
               ATTRB=ASKIP                                                      
***********************************************************************         
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
