*          DATA SET PCKM151    AT LEVEL 001 AS OF 03/21/94                      
*          DATA SET PCKM151    AT LEVEL 041 AS OF 02/24/94              00001   
*          DATA SET PCKM151A1  AT LEVEL 005 AS OF 12/16/93              00002   
*********************************************************************** 00003   
*                                                                       00004   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00005   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00006   
*********************************************************************** 00007   
        PRINT NOGEN                                                     00008   
PCKM151 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00009   
PC151A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00010   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00011   
*********************************************************************** 00012   
*********************************************************************** 00013   
AOPUNT  DFHMDF POS=(1,01),LENGTH=04,ATTRB=(ASKIP,NORM),                X00014   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00015   
AFACTY  DFHMDF POS=(1,07),LENGTH=04,ATTRB=(ASKIP,NORM),                X00016   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00017   
**********************************************************************  00018   
**********************************************************************  00019   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00020   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00021   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00022   
               COLOR=GREEN,                                            X00023   
               HILIGHT=UNDERLINE,                                      X00024   
               PICOUT='ZZZZ9'                                           00025   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='TO'                                             00028   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00029   
               COLOR=BLUE,                                             X00030   
               PICOUT='ZZZZ9'                                           00031   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00032   
               COLOR=NEUTRAL,                                          X00033   
               INITIAL='OF'                                             00034   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00035   
               COLOR=BLUE,                                             X00036   
               PICOUT='ZZZZ9'                                           00037   
**********************************************************************  00038   
        DFHMDF POS=(4,23),LENGTH=38,ATTRB=(ASKIP,BRT),                 X00039   
               INITIAL='RCVR RCVR EXPTED ACTUAL EXPTED  VERFYD'         00040   
        DFHMDF POS=(4,63),LENGTH=04,ATTRB=(ASKIP,BRT),                 X00041   
               INITIAL='RCVR'                                           00042   
        DFHMDF POS=(4,68),LENGTH=1,ATTRB=ASKIP                          00043   
**********************************************************************  00044   
        DFHMDF POS=(5,05),LENGTH=41,ATTRB=(ASKIP,BRT),                 X00045   
               INITIAL='OPER       P.O.    SEQ STAT CARTON CARTON'      00046   
*       DFHMDF POS=(5,52),LENGTH=1,ATTRB=ASKIP                          00047   
        DFHMDF POS=(5,48),LENGTH=28,ATTRB=(ASKIP,BRT),                 X00048   
               INITIAL='ITEM   ITEM   CREATE    USER'                   00049   
        DFHMDF POS=(5,77),LENGTH=1,ATTRB=ASKIP                          00050   
**********************************************************************  00051   
        DFHMDF POS=(6,1),LENGTH=36,ATTRB=(ASKIP,BRT),                  X00052   
               INITIAL='SEL  ID  FAC  NUMBER   NBR CODE  QTY'           00053   
        DFHMDF POS=(6,38),LENGTH=1,ATTRB=ASKIP                          00054   
        DFHMDF POS=(6,41),LENGTH=34,ATTRB=(ASKIP,BRT),                 X00055   
               INITIAL='QTY     QTY    QTY    DATE      ID'             00056   
        DFHMDF POS=(6,77),LENGTH=1,ATTRB=ASKIP                          00057   
**********************************************************************  00058   
        DFHMDF POS=(7,1),LENGTH=37,ATTRB=(ASKIP,BRT),                  X00059   
               INITIAL='--- ---- --- --------  --- ----  -----'         00060   
        DFHMDF POS=(7,41),LENGTH=37,ATTRB=(ASKIP,BRT),                 X00061   
               INITIAL='-----  -----  ----- -------- --------'          00062   
        DFHMDF POS=(7,79),LENGTH=1,ATTRB=ASKIP                          00063   
**********************************************************************  00064   
ASEL01  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00065   
               HILIGHT=UNDERLINE,                                      X00066   
               COLOR=GREEN                                              00067   
        DFHMDF POS=(08,03),LENGTH=01,ATTRB=(ASKIP)                      00068   
AOPR01  DFHMDF POS=(08,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00069   
               COLOR=BLUE                                               00070   
AFAC01  DFHMDF POS=(08,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00071   
               COLOR=BLUE                                               00072   
APON01  DFHMDF POS=(08,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00073   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00074   
ARSQ01  DFHMDF POS=(08,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00075   
               COLOR=BLUE                                               00076   
ASTT01  DFHMDF POS=(08,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00077   
               COLOR=BLUE                                               00078   
        DFHMDF POS=(08,32),LENGTH=01,ATTRB=(ASKIP)                      00079   
AEQT01  DFHMDF POS=(08,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00080   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00081   
AAQT01  DFHMDF POS=(08,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00082   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00083   
AEIQ01  DFHMDF POS=(08,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00085   
AAIQ01  DFHMDF POS=(08,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00086   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00087   
ACDT01  DFHMDF POS=(08,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00088   
               COLOR=BLUE                                               00089   
AUSR01  DFHMDF POS=(08,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00090   
               COLOR=BLUE                                               00091   
        DFHMDF POS=(08,79),LENGTH=01,ATTRB=(ASKIP)                      00092   
*********************************************************************** 00093   
**********************************************************************  00094   
ASEL02  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00095   
               HILIGHT=UNDERLINE,                                      X00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(09,03),LENGTH=01,ATTRB=(ASKIP)                      00098   
AOPR02  DFHMDF POS=(09,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
AFAC02  DFHMDF POS=(09,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
APON02  DFHMDF POS=(09,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00103   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00104   
ARSQ02  DFHMDF POS=(09,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00105   
               COLOR=BLUE                                               00106   
ASTT02  DFHMDF POS=(09,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00107   
               COLOR=BLUE                                               00108   
        DFHMDF POS=(09,32),LENGTH=01,ATTRB=(ASKIP)                      00109   
AEQT02  DFHMDF POS=(09,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00110   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00111   
AAQT02  DFHMDF POS=(09,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00112   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00113   
AEIQ02  DFHMDF POS=(09,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00114   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00115   
AAIQ02  DFHMDF POS=(09,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00116   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00117   
ACDT02  DFHMDF POS=(09,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00118   
               COLOR=BLUE                                               00119   
AUSR02  DFHMDF POS=(09,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00120   
               COLOR=BLUE                                               00121   
        DFHMDF POS=(09,79),LENGTH=01,ATTRB=(ASKIP)                      00122   
*********************************************************************** 00123   
ASEL03  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00124   
               HILIGHT=UNDERLINE,                                      X00125   
               COLOR=GREEN                                              00126   
        DFHMDF POS=(10,03),LENGTH=01,ATTRB=(ASKIP)                      00127   
AOPR03  DFHMDF POS=(10,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00128   
               COLOR=BLUE                                               00129   
AFAC03  DFHMDF POS=(10,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00130   
               COLOR=BLUE                                               00131   
APON03  DFHMDF POS=(10,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00132   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00133   
ARSQ03  DFHMDF POS=(10,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00134   
               COLOR=BLUE                                               00135   
ASTT03  DFHMDF POS=(10,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00136   
               COLOR=BLUE                                               00137   
        DFHMDF POS=(10,32),LENGTH=01,ATTRB=(ASKIP)                      00138   
AEQT03  DFHMDF POS=(10,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00139   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00140   
AAQT03  DFHMDF POS=(10,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00141   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00142   
AEIQ03  DFHMDF POS=(10,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00143   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00144   
AAIQ03  DFHMDF POS=(10,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00145   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00146   
ACDT03  DFHMDF POS=(10,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00147   
               COLOR=BLUE                                               00148   
AUSR03  DFHMDF POS=(10,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00149   
               COLOR=BLUE                                               00150   
        DFHMDF POS=(10,79),LENGTH=01,ATTRB=(ASKIP)                      00151   
*********************************************************************** 00152   
ASEL04  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00153   
               HILIGHT=UNDERLINE,                                      X00154   
               COLOR=GREEN                                              00155   
        DFHMDF POS=(11,03),LENGTH=01,ATTRB=(ASKIP)                      00156   
AOPR04  DFHMDF POS=(11,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00157   
               COLOR=BLUE                                               00158   
AFAC04  DFHMDF POS=(11,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00159   
               COLOR=BLUE                                               00160   
APON04  DFHMDF POS=(11,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00161   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00162   
ARSQ04  DFHMDF POS=(11,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00163   
               COLOR=BLUE                                               00164   
ASTT04  DFHMDF POS=(11,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00165   
               COLOR=BLUE                                               00166   
        DFHMDF POS=(11,32),LENGTH=01,ATTRB=(ASKIP)                      00167   
AEQT04  DFHMDF POS=(11,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00168   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00169   
AAQT04  DFHMDF POS=(11,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00170   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00171   
AEIQ04  DFHMDF POS=(11,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00172   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00173   
AAIQ04  DFHMDF POS=(11,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00174   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00175   
ACDT04  DFHMDF POS=(11,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00176   
               COLOR=BLUE                                               00177   
AUSR04  DFHMDF POS=(11,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00178   
               COLOR=BLUE                                               00179   
        DFHMDF POS=(11,79),LENGTH=01,ATTRB=(ASKIP)                      00180   
*********************************************************************** 00181   
ASEL05  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00182   
               HILIGHT=UNDERLINE,                                      X00183   
               COLOR=GREEN                                              00184   
        DFHMDF POS=(12,03),LENGTH=01,ATTRB=(ASKIP)                      00185   
AOPR05  DFHMDF POS=(12,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00186   
               COLOR=BLUE                                               00187   
AFAC05  DFHMDF POS=(12,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00188   
               COLOR=BLUE                                               00189   
APON05  DFHMDF POS=(12,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00190   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00191   
ARSQ05  DFHMDF POS=(12,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00192   
               COLOR=BLUE                                               00193   
ASTT05  DFHMDF POS=(12,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00194   
               COLOR=BLUE                                               00195   
        DFHMDF POS=(12,32),LENGTH=01,ATTRB=(ASKIP)                      00196   
AEQT05  DFHMDF POS=(12,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00197   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00198   
AAQT05  DFHMDF POS=(12,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00199   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00200   
AEIQ05  DFHMDF POS=(12,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00201   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00202   
AAIQ05  DFHMDF POS=(12,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00203   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00204   
ACDT05  DFHMDF POS=(12,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00205   
               COLOR=BLUE                                               00206   
AUSR05  DFHMDF POS=(12,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00207   
               COLOR=BLUE                                               00208   
        DFHMDF POS=(12,79),LENGTH=01,ATTRB=(ASKIP)                      00209   
*********************************************************************** 00210   
ASEL06  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00211   
               HILIGHT=UNDERLINE,                                      X00212   
               COLOR=GREEN                                              00213   
        DFHMDF POS=(13,03),LENGTH=01,ATTRB=(ASKIP)                      00214   
AOPR06  DFHMDF POS=(13,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00215   
               COLOR=BLUE                                               00216   
AFAC06  DFHMDF POS=(13,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00217   
               COLOR=BLUE                                               00218   
APON06  DFHMDF POS=(13,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00219   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00220   
ARSQ06  DFHMDF POS=(13,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00221   
               COLOR=BLUE                                               00222   
ASTT06  DFHMDF POS=(13,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00223   
               COLOR=BLUE                                               00224   
        DFHMDF POS=(13,32),LENGTH=01,ATTRB=(ASKIP)                      00225   
AEQT06  DFHMDF POS=(13,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00226   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00227   
AAQT06  DFHMDF POS=(13,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00228   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00229   
AEIQ06  DFHMDF POS=(13,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00230   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00231   
AAIQ06  DFHMDF POS=(13,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00232   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00233   
ACDT06  DFHMDF POS=(13,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00234   
               COLOR=BLUE                                               00235   
AUSR06  DFHMDF POS=(13,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00236   
               COLOR=BLUE                                               00237   
        DFHMDF POS=(13,79),LENGTH=01,ATTRB=(ASKIP)                      00238   
*********************************************************************** 00239   
ASEL07  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00240   
               HILIGHT=UNDERLINE,                                      X00241   
               COLOR=GREEN                                              00242   
        DFHMDF POS=(14,03),LENGTH=01,ATTRB=(ASKIP)                      00243   
AOPR07  DFHMDF POS=(14,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00244   
               COLOR=BLUE                                               00245   
AFAC07  DFHMDF POS=(14,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00246   
               COLOR=BLUE                                               00247   
APON07  DFHMDF POS=(14,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00248   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00249   
ARSQ07  DFHMDF POS=(14,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00250   
               COLOR=BLUE                                               00251   
ASTT07  DFHMDF POS=(14,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00252   
               COLOR=BLUE                                               00253   
        DFHMDF POS=(14,32),LENGTH=01,ATTRB=(ASKIP)                      00254   
AEQT07  DFHMDF POS=(14,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00255   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00256   
AAQT07  DFHMDF POS=(14,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00257   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00258   
AEIQ07  DFHMDF POS=(14,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00259   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00260   
AAIQ07  DFHMDF POS=(14,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00261   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00262   
ACDT07  DFHMDF POS=(14,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00263   
               COLOR=BLUE                                               00264   
AUSR07  DFHMDF POS=(14,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00265   
               COLOR=BLUE                                               00266   
        DFHMDF POS=(14,79),LENGTH=01,ATTRB=(ASKIP)                      00267   
*********************************************************************** 00268   
ASEL08  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00269   
               HILIGHT=UNDERLINE,                                      X00270   
               COLOR=GREEN                                              00271   
        DFHMDF POS=(15,03),LENGTH=01,ATTRB=(ASKIP)                      00272   
AOPR08  DFHMDF POS=(15,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00273   
               COLOR=BLUE                                               00274   
AFAC08  DFHMDF POS=(15,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00275   
               COLOR=BLUE                                               00276   
APON08  DFHMDF POS=(15,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00277   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00278   
ARSQ08  DFHMDF POS=(15,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00279   
               COLOR=BLUE                                               00280   
ASTT08  DFHMDF POS=(15,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00281   
               COLOR=BLUE                                               00282   
        DFHMDF POS=(15,32),LENGTH=01,ATTRB=(ASKIP)                      00283   
AEQT08  DFHMDF POS=(15,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00284   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00285   
AAQT08  DFHMDF POS=(15,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00286   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00287   
AEIQ08  DFHMDF POS=(15,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00288   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00289   
AAIQ08  DFHMDF POS=(15,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00290   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00291   
ACDT08  DFHMDF POS=(15,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00292   
               COLOR=BLUE                                               00293   
AUSR08  DFHMDF POS=(15,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00294   
               COLOR=BLUE                                               00295   
        DFHMDF POS=(15,79),LENGTH=01,ATTRB=(ASKIP)                      00296   
*********************************************************************** 00297   
ASEL09  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00298   
               HILIGHT=UNDERLINE,                                      X00299   
               COLOR=GREEN                                              00300   
        DFHMDF POS=(16,03),LENGTH=01,ATTRB=(ASKIP)                      00301   
AOPR09  DFHMDF POS=(16,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE                                               00303   
AFAC09  DFHMDF POS=(16,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00304   
               COLOR=BLUE                                               00305   
APON09  DFHMDF POS=(16,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00306   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00307   
ARSQ09  DFHMDF POS=(16,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00308   
               COLOR=BLUE                                               00309   
ASTT09  DFHMDF POS=(16,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00310   
               COLOR=BLUE                                               00311   
        DFHMDF POS=(16,32),LENGTH=01,ATTRB=(ASKIP)                      00312   
AEQT09  DFHMDF POS=(16,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00313   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00314   
AAQT09  DFHMDF POS=(16,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00315   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00316   
AEIQ09  DFHMDF POS=(16,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00317   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00318   
AAIQ09  DFHMDF POS=(16,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00319   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00320   
ACDT09  DFHMDF POS=(16,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00321   
               COLOR=BLUE                                               00322   
AUSR09  DFHMDF POS=(16,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00323   
               COLOR=BLUE                                               00324   
        DFHMDF POS=(16,79),LENGTH=01,ATTRB=(ASKIP)                      00325   
*********************************************************************** 00326   
ASEL10  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00327   
               HILIGHT=UNDERLINE,                                      X00328   
               COLOR=GREEN                                              00329   
        DFHMDF POS=(17,03),LENGTH=01,ATTRB=(ASKIP)                      00330   
AOPR10  DFHMDF POS=(17,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00331   
               COLOR=BLUE                                               00332   
AFAC10  DFHMDF POS=(17,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00333   
               COLOR=BLUE                                               00334   
APON10  DFHMDF POS=(17,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00335   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00336   
ARSQ10  DFHMDF POS=(17,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00337   
               COLOR=BLUE                                               00338   
ASTT10  DFHMDF POS=(17,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00339   
               COLOR=BLUE                                               00340   
        DFHMDF POS=(17,32),LENGTH=01,ATTRB=(ASKIP)                      00341   
AEQT10  DFHMDF POS=(17,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00342   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00343   
AAQT10  DFHMDF POS=(17,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00344   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00345   
AEIQ10  DFHMDF POS=(17,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00346   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00347   
AAIQ10  DFHMDF POS=(17,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00348   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00349   
ACDT10  DFHMDF POS=(17,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00350   
               COLOR=BLUE                                               00351   
AUSR10  DFHMDF POS=(17,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00352   
               COLOR=BLUE                                               00353   
        DFHMDF POS=(17,79),LENGTH=01,ATTRB=(ASKIP)                      00354   
*********************************************************************** 00355   
ASEL11  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00356   
               HILIGHT=UNDERLINE,                                      X00357   
               COLOR=GREEN                                              00358   
        DFHMDF POS=(18,03),LENGTH=01,ATTRB=(ASKIP)                      00359   
AOPR11  DFHMDF POS=(18,05),LENGTH=04,ATTRB=(ASKIP,NORM),               X00360   
               COLOR=BLUE                                               00361   
AFAC11  DFHMDF POS=(18,10),LENGTH=03,ATTRB=(ASKIP,NORM),               X00362   
               COLOR=BLUE                                               00363   
APON11  DFHMDF POS=(18,14),LENGTH=08,ATTRB=(ASKIP,NORM),               X00364   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00365   
ARSQ11  DFHMDF POS=(18,24),LENGTH=03,ATTRB=(ASKIP,NORM),               X00366   
               COLOR=BLUE                                               00367   
ASTT11  DFHMDF POS=(18,29),LENGTH=02,ATTRB=(ASKIP,NORM),               X00368   
               COLOR=BLUE                                               00369   
        DFHMDF POS=(18,32),LENGTH=01,ATTRB=(ASKIP)                      00370   
AEQT11  DFHMDF POS=(18,34),LENGTH=05,ATTRB=(ASKIP,NORM),               X00371   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00372   
AAQT11  DFHMDF POS=(18,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00373   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00374   
AEIQ11  DFHMDF POS=(18,48),LENGTH=05,ATTRB=(ASKIP,NORM),               X00375   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00376   
AAIQ11  DFHMDF POS=(18,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00377   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00378   
ACDT11  DFHMDF POS=(18,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00379   
               COLOR=BLUE                                               00380   
AUSR11  DFHMDF POS=(18,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00381   
               COLOR=BLUE                                               00382   
        DFHMDF POS=(18,79),LENGTH=01,ATTRB=(ASKIP)                      00383   
*********************************************************************** 00384   
*********************************************************************** 00385   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00386   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00387   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00388   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00389   
*********************************************************************** 00390   
*********************************************************************** 00391   
        DFHMSD TYPE=FINAL                                               00392   
        PRINT NOGEN                                                     00393   
        END                                                             00394   
