***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
PCKM710 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
**********************************************************************          
PCK710  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
**********************************************************************          
        DFHMDF POS=(02,02),                                            X        
               LENGTH=012,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO/RECEIVER:'                                           
APONBR  DFHMDF POS=(2,15),                                             X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(2,24),                                             X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               INITIAL='-'                                                      
ARECVR  DFHMDF POS=(2,26),                                             X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,30),                                            X        
               LENGTH=012,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OPER UNT ID:'                                           
AOPER   DFHMDF POS=(02,43),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='9999'                                                    
        DFHMDF POS=(2,48),                                             X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               INITIAL='-'                                                      
AFCLTY  DFHMDF POS=(02,50),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='9999'                                                    
        DFHMDF POS=(02,55),                                            X        
               LENGTH=015,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SML PRINTER ID:'                                        
APRTR   DFHMDF POS=(02,71),                                            X        
               LENGTH=008,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(02,80),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
**********************************************************************          
        DFHMDF POS=(03,02),                                            X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='VENDOR NAME:'                                           
AVNDNME  DFHMDF POS=(03,015),                                          X        
               LENGTH=023,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,41),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DEPT:'                                                  
ADEPT   DFHMDF POS=(03,47),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='9999'                                                    
**********************************************************************          
**********************************************************************          
        DFHMDF POS=(04,02),                                            X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL CART.:'                                           
ATOTCRT  DFHMDF POS=(04,015),                                          X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
        DFHMDF POS=(04,25),                                            X        
               LENGTH=011,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL UNTS:'                                            
ATOTUNT DFHMDF POS=(04,37),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZ9'                                                 
        DFHMDF POS=(04,47),                                            X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               INITIAL='STORES IN YELLOW ARE MISDIRECT'                         
**********************************************************************          
**********************************************************************          
AUCC128 DFHMDF POS=(5,02),                                             X        
               COLOR=YELLOW,                                           X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
        DFHMDF POS=(05,43),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ITEMS'                                                  
ASTRTIT DFHMDF POS=(05,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(05,055),                                          X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(05,58),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(05,064),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(05,67),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
**********************************************************************          
        DFHMDF POS=(06,12),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NBR'                                                    
        DFHMDF POS=(06,19),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NBR'                                                    
        DFHMDF POS=(06,25),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STR'                                                    
**********************************************************************          
**********************************************************************          
        DFHMDF POS=(07,002),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SEL'                                                    
        DFHMDF POS=(07,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ACT'                                                    
        DFHMDF POS=(07,011),                                           X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CTNS'                                                   
        DFHMDF POS=(07,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='UNITS'                                                  
        DFHMDF POS=(07,025),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NBR'                                                    
        DFHMDF POS=(07,030),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STORE NAME'                                             
        DFHMDF POS=(07,056),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STATUS'                                                 
         DFHMDF POS=(07,065),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
**********************************************************************          
ASEL01  DFHMDF POS=(08,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(08,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT01  DFHMDF POS=(08,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS01 DFHMDF POS=(08,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS01 DFHMDF POS=(08,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR01  DFHMDF POS=(08,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME01 DFHMDF POS=(08,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT01 DFHMDF POS=(08,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
**********************************************************************          
ASEL02  DFHMDF POS=(09,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(09,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT02  DFHMDF POS=(09,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS02 DFHMDF POS=(09,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS02 DFHMDF POS=(09,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR02  DFHMDF POS=(09,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME02 DFHMDF POS=(09,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT02 DFHMDF POS=(09,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
**********************************************************************          
**********************************************************************          
ASEL03  DFHMDF POS=(10,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(10,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT03  DFHMDF POS=(10,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS03 DFHMDF POS=(10,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS03 DFHMDF POS=(10,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR03  DFHMDF POS=(10,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME03 DFHMDF POS=(10,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT03 DFHMDF POS=(10,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL04  DFHMDF POS=(11,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(11,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT04  DFHMDF POS=(11,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS04 DFHMDF POS=(11,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS04 DFHMDF POS=(11,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR04  DFHMDF POS=(11,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME04 DFHMDF POS=(11,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT04 DFHMDF POS=(11,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL05  DFHMDF POS=(12,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(12,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT05  DFHMDF POS=(12,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS05 DFHMDF POS=(12,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS05 DFHMDF POS=(12,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR05  DFHMDF POS=(12,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME05 DFHMDF POS=(12,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT05 DFHMDF POS=(12,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL06  DFHMDF POS=(13,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(13,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT06  DFHMDF POS=(13,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS06 DFHMDF POS=(13,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS06 DFHMDF POS=(13,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR06  DFHMDF POS=(13,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME06 DFHMDF POS=(13,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT06 DFHMDF POS=(13,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL07  DFHMDF POS=(14,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(14,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT07  DFHMDF POS=(14,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS07 DFHMDF POS=(14,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS07 DFHMDF POS=(14,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR07  DFHMDF POS=(14,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME07 DFHMDF POS=(14,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT07 DFHMDF POS=(14,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL08  DFHMDF POS=(15,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(15,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT08  DFHMDF POS=(15,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS08 DFHMDF POS=(15,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS08 DFHMDF POS=(15,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR08  DFHMDF POS=(15,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME08 DFHMDF POS=(15,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT08 DFHMDF POS=(15,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL09  DFHMDF POS=(16,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(16,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT09  DFHMDF POS=(16,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS09 DFHMDF POS=(16,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS09 DFHMDF POS=(16,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR09  DFHMDF POS=(16,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME09 DFHMDF POS=(16,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT09 DFHMDF POS=(16,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL10  DFHMDF POS=(17,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(17,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT10  DFHMDF POS=(17,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS10 DFHMDF POS=(17,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS10 DFHMDF POS=(17,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR10  DFHMDF POS=(17,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME10 DFHMDF POS=(17,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT10 DFHMDF POS=(17,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL11  DFHMDF POS=(18,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(18,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT11  DFHMDF POS=(18,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACTNS11 DFHMDF POS=(18,011),                                           X        
               LENGTH=05,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9'                                                   
AUNTS11 DFHMDF POS=(18,017),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR11  DFHMDF POS=(18,024),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASNME11 DFHMDF POS=(18,030),                                           X        
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT11 DFHMDF POS=(18,056),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
         DFHMDF POS=(19,039),                                          X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT   DFHMDF POS=(19,065),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
**********************************************************************          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
