*********************************************************************** 00010036
*                                                                       00020036
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030036
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040036
*********************************************************************** 00050036
        PRINT NOGEN                                                     00060036
PCKM863  DFHMSD TYPE=MAP,                                              X00070054
               LANG=COBOL,                                             X00080036
               MODE=INOUT,                                             X00090036
               TIOAPFX=YES,                                            X00100036
               CTRL=FREEKB                                              00110036
PC863A   DFHMDI SIZE=(08,22),                                          X00120099
               LINE=1,                                                 X00130036
               COLUMN=1,                                               X00140036
               MAPATTS=(COLOR,HILIGHT),                                X00150052
               DSATTS=(COLOR,HILIGHT)                                   00160052
*********************************************************************** 00170036
ACARTN   DFHMDF POS=(01,01),                                           X00180068
               LENGTH=020,                                             X00190099
               ATTRB=(ASKIP,NORM,FSET)                                  00200099
         DFHMDF POS=(01,22),                                           X00210063
               LENGTH=000,                                             X00220062
               ATTRB=(ASKIP,DRK)                                        00230063
*********************************************************************** 00240036
         DFHMDF POS=(02,01),                                           X00250053
               LENGTH=003,                                             X00260099
               ATTRB=(ASKIP,NORM),                                     X00270053
               INITIAL='UPC'                                            00280099
AUPC     DFHMDF POS=(02,05),                                           X00290099
               LENGTH=015,                                             X00300064
               HILIGHT=UNDERLINE,                                      X00310054
               ATTRB=(UNPROT,NORM,FSET)                                 00320099
         DFHMDF POS=(02,21),                                           X00330099
               LENGTH=000,                                             X00340061
               ATTRB=(ASKIP)                                            00350054
*********************************************************************** 00360053
         DFHMDF POS=(03,01),                                           X00370053
               LENGTH=006,                                             X00380099
               ATTRB=(ASKIP,NORM),                                     X00390053
               INITIAL='OR SKU'                                         00400099
ASKU     DFHMDF POS=(03,08),                                           X00410099
               LENGTH=008,                                             X00420054
               HILIGHT=UNDERLINE,                                      X00430054
               ATTRB=(UNPROT,NORM,FSET)                                 00440099
         DFHMDF POS=(03,17),                                           X00450099
               LENGTH=000,                                             X00460061
               ATTRB=(ASKIP)                                            00470054
*********************************************************************** 00480053
ASKUDSC  DFHMDF POS=(04,01),                                           X00490059
               LENGTH=020,                                             X00500065
               ATTRB=(ASKIP,NORM,FSET)                                  00510099
         DFHMDF POS=(04,22),                                           X00520065
               LENGTH=000,                                             X00530064
               ATTRB=(ASKIP)                                            00540064
*********************************************************************** 00550053
         DFHMDF POS=(05,01),                                           X00560099
               LENGTH=003,                                             X00570099
               ATTRB=(ASKIP,NORM),                                     X00580054
               INITIAL='QTY'                                            00590099
AUNTSKU  DFHMDF POS=(05,05),                                           X00600099
               LENGTH=004,                                             X00610054
               PICOUT='ZZZ9',                                          X00620071
               ATTRB=(ASKIP,NORM,FSET)                                  00630099
         DFHMDF POS=(05,10),                                           X00640099
               LENGTH=003,                                             X00650099
               ATTRB=(ASKIP,NORM),                                     X00660081
               INITIAL='ADJ'                                            00670099
AADJQTY  DFHMDF POS=(05,14),                                           X00680099
               LENGTH=004,                                             X00690081
               HILIGHT=UNDERLINE,                                      X00700083
               ATTRB=(UNPROT,NORM,FSET)                                 00710099
         DFHMDF POS=(05,19),                                           X00720099
               LENGTH=000,                                             X00730098
               ATTRB=(ASKIP)                                            00740098
*********************************************************************** 00750053
         DFHMDF POS=(06,01),                                           X00760054
               LENGTH=014,                                             X00770099
               ATTRB=(ASKIP,NORM),                                     X00780054
               INITIAL='TOT UNT IN CTN'                                 00790099
AUNTCTN  DFHMDF POS=(06,16),                                           X00800099
               LENGTH=004,                                             X00810081
               PICOUT='ZZZ9',                                          X00820081
               ATTRB=(ASKIP,NORM,FSET)                                  00830099
         DFHMDF POS=(06,21),                                           X00840099
               LENGTH=000,                                             X00850090
               ATTRB=(ASKIP)                                            00860090
*********************************************************************** 00870054
         DFHMDF POS=(07,01),                                           X00880079
               LENGTH=006,                                             X00890054
               ATTRB=(ASKIP,NORM),                                     X00900054
               INITIAL='F3-END'                                         00910054
         DFHMDF POS=(07,08),                                           X00920080
               LENGTH=006,                                             X00930054
               ATTRB=(ASKIP,NORM),                                     X00940054
               INITIAL='F5-UPD'                                         00950054
*********************************************************************** 00960079
AMSGLN   DFHMDF POS=(08,01),                                           X00970079
               LENGTH=019,                                             X00980079
               ATTRB=(ASKIP,NORM,FSET)                                  00990099
         DFHMDF POS=(08,21),                                           X01000079
               LENGTH=000,                                             X01010079
               ATTRB=(ASKIP)                                            01020079
*********************************************************************** 01030036
*********************************************************************** 01040036
         DFHMSD TYPE=FINAL                                              01050099
         END                                                            01060036
