        PRINT NOGEN                                                     00030001
PCKM876  DFHMSD TYPE=MAP,                                              X00040001
               LANG=COBOL,                                             X00050001
               MODE=INOUT,                                             X00060001
               TIOAPFX=YES,                                            X00070001
               CTRL=FREEKB                                              00080001
*                                                                       00090001
PC876A   DFHMDI SIZE=(08,20),                                          X00100001
               LINE=1,                                                 X00110001
               COLUMN=1,                                               X00120001
               MAPATTS=(COLOR,HILIGHT),                                X00130001
               DSATTS=(COLOR,HILIGHT)                                   00140001
*                                                                       00150001
         DFHMDF POS=(01,03),                                           X00160001
               LENGTH=013,                                             X00170001
               ATTRB=(ASKIP,NORM),                                     X00180001
               INITIAL='CLOSE TRAILER'                                  00190001
*                                                                       00200001
         DFHMDF POS=(02,01),                                           X00210001
               LENGTH=005,                                             X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               INITIAL='DOOR:'                                          00240001
ADOOR    DFHMDF POS=(02,09),                                           X00250001
               LENGTH=004,                                             X00260001
               ATTRB=(UNPROT,NORM,IC,FSET)                              00270001
         DFHMDF POS=(02,14),                                           X00280001
               LENGTH=001,                                             X00290001
               ATTRB=(ASKIP,DRK)                                        00300001
*                                                                       00310001
         DFHMDF POS=(03,01),                                           X00320001
               LENGTH=005,                                             X00330001
               ATTRB=(ASKIP,NORM),                                     X00340001
               INITIAL='DEST:'                                          00350001
ADEST    DFHMDF POS=(03,09),                                           X00360001
               LENGTH=004,                                             X00370001
               PICOUT='ZZZZ',                                          X00380001
               ATTRB=(UNPROT,NORM,NUM,FSET)                             00390001
         DFHMDF POS=(03,14),                                           X00400001
               LENGTH=001,                                             X00410001
               ATTRB=(ASKIP,DRK)                                        00420001
*                                                                       00430001
         DFHMDF POS=(04,01),                                           X00440001
               LENGTH=007,                                             X00450001
               ATTRB=(ASKIP,NORM),                                     X00460001
               INITIAL='SRL NBR'                                        00470002
ASERIAL  DFHMDF POS=(04,09),                                           X00480001
               LENGTH=009,                                             X00490001
               ATTRB=(UNPROT,NORM,NUM,FSET)                             00500001
         DFHMDF POS=(04,19),                                           X00510001
               LENGTH=001,                                             X00520001
               ATTRB=(ASKIP,DRK)                                        00530001
*                                                                       00540001
ASCAC    DFHMDF POS=(05,01),                                           X00590003
               LENGTH=004,                                             X00600001
               ATTRB=(ASKIP,NORM,FSET)                                  00610003
ATRLR    DFHMDF POS=(05,06),                                           X00620003
               LENGTH=012,                                             X00630003
               ATTRB=(ASKIP,NORM,FSET)                                  00640003
*                                                                       00650001
         DFHMDF POS=(06,01),                                           X00660001
               LENGTH=007,                                             X00670001
               ATTRB=(ASKIP,NORM),                                     X00680001
               INITIAL='TRIP ID:'                                       00690001
ATRIP    DFHMDF POS=(06,09),                                           X00700001
               LENGTH=009,                                             X00710001
               ATTRB=(ASKIP,NORM,FSET)                                  00720005
*                                                                       00760001
AMSGLN   DFHMDF POS=(07,01),                                           X00770001
               LENGTH=019,                                             X00780001
               ATTRB=(ASKIP,NORM,FSET)                                  00790001
*                                                                       00800001
         DFHMDF POS=(08,02),                                           X00810001
               LENGTH=008,                                             X00820001
               ATTRB=(ASKIP,NORM),                                     X00830001
               INITIAL='F4=CLOSE'                                       00840001
*                                                                       00850001
         DFHMSD TYPE=FINAL                                              00900006
         END                                                            00910001
