        PRINT NOGEN                                                     00001   
PCKM886  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC886A   DFHMDI SIZE=(16,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                       00011   
         DFHMDF POS=(01,03),                                           X00012**5
               LENGTH=011,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='MASTER TYPE'                                    00015*29
*                                                                       00016   
         DFHMDF POS=(02,02),                                           X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='1. FINE JEWELRY'                                00015*29
*                                                                       00016   
         DFHMDF POS=(03,02),                                           X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='2.             '                                00015*29
*              INITIAL='2. BULK JEWELRY'                                00015*29
*                                                                       00041*22
         DFHMDF POS=(04,02),                                           X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='3. CPBS JEWELRY'                                00015*29
*                                                                       00041*22
         DFHMDF POS=(05,02),                                           X00034*22
               LENGTH=016,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='4. LARGE NON CON'                               00015*29
*                                                                       00041*22
         DFHMDF POS=(06,02),                                           X00034*22
               LENGTH=016,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='5. SMALL NON CON'                               00015*29
*                                                                       00041*22
         DFHMDF POS=(07,02),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='6. OTHER'                                       00015*29
*                                                                       00041*22
         DFHMDF POS=(09,02),                                           X00064**9
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='SELECTION'                                      00067**5
*                                                                       00068   
ASELECT  DFHMDF POS=(09,12),                                           X00051   
               LENGTH=001,                                             X00052   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00072**5
         DFHMDF POS=(09,14),                                           X00055   
               LENGTH=001,                                             X00056   
               ATTRB=(ASKIP)                                            00057   
*                                                                       00072**5
AMSGLN   DFHMDF POS=(10,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
