***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
PCKM709 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES                       
PC709A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X        
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)                   
***********************************************************************         
        DFHMDF POS=(2,2),                                              X        
               LENGTH=42,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER THE PO, RECEIVER AND STORE(OPTIONAL)'             
        DFHMDF POS=(2,45),                                             X        
               LENGTH=31,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='TO BUILD A LIST OF STORE(S) FOR'                        
***********************************************************************         
        DFHMDF POS=(3,2),                                              X        
               LENGTH=44,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CREATING LABELS.  ENTER ALL THREE FOR CARTON'           
        DFHMDF POS=(3,47),                                             X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LIST.'                                                  
***********************************************************************         
        DFHMDF POS=(5,02),                                             X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OPER UNIT ID..:'                                        
MOPID   DFHMDF POS=(5,18),                                             X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,FSET)                                               
MOPDESC DFHMDF POS=(5,29),                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
***********************************************************************         
        DFHMDF POS=(7,02),                                             X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PO/RECEIVER...:'                                        
MPONBR  DFHMDF POS=(7,18),                                             X        
               LENGTH=08,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZZZ'                                                
        DFHMDF POS=(7,27),                                             X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='-'                                                      
MRECVR  DFHMDF POS=(7,29),                                             X        
               LENGTH=04,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='9999'                                                    
         DFHMDF POS=(07,34),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
MUCC128 DFHMDF POS=(7,42),                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
         DFHMDF POS=(07,68),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=ASKIP                                              00050**8
***********************************************************************         
***********************************************************************         
        DFHMDF POS=(8,02),                                             X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='STORE NBR.....:'                                        
MSTRNBR DFHMDF POS=(8,18),                                             X        
               LENGTH=08,                                              X        
               ATTRB=UNPROT,                                           X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZZZ'                                                
         DFHMDF POS=(08,27),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP)                                            00050**8
***********************************************************************         
        DFHMDF POS=(10,02),                                            X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CURR OPER ID..:'                                        
MCOPID  DFHMDF POS=(10,18),                                            X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,FSET)                                               
MCOPDSC DFHMDF POS=(10,29),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=25                                                        
**********************************************************************          
        DFHMDF POS=(12,02),                                            X        
               LENGTH=15,                                              X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SML PRINTER ID:'                                        
MDEST1  DFHMDF POS=(12,18),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE                                                
MPRTDSC DFHMDF POS=(12,29),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=30                                                        
        DFHMDF POS=(12,60),                                            X        
               LENGTH=01,                                              X        
               ATTRB=ASKIP                                                      
**********************************************************************          
        DFHMSD TYPE=FINAL                                                       
        PRINT NOGEN                                                             
        END                                                                     
