        PRINT NOGEN                                                     00010000
PCKM744  DFHMSD TYPE=MAP,                                              X00020001
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               TIOAPFX=YES,                                            X00050000
               CTRL=FREEKB                                              00060000
*                                                                       00070000
PC744A   DFHMDI SIZE=(08,20),                                          X00080001
               LINE=1,                                                 X00090000
               COLUMN=1,                                               X00100000
               MAPATTS=(COLOR,HILIGHT),                                X00110000
               DSATTS=(COLOR,HILIGHT)                                   00120000
*                                                                       00130000
ATITLE   DFHMDF POS=(01,01),                                           X00140004
               LENGTH=018,                                             X00150000
               ATTRB=(ASKIP,NORM,FSET),                                X00160006
               INITIAL=' TRAILER DETAIL   '                             00170001
*                                                                       00180000
         DFHMDF POS=(02,01),                                           X00190000
               LENGTH=007,                                             X00200000
               ATTRB=(ASKIP,NORM),                                     X00210000
               INITIAL='SRL NBR'                                        00220011
ASERIAL  DFHMDF POS=(02,09),                                           X00230000
               LENGTH=009,                                             X00240000
               ATTRB=(ASKIP,NORM,FSET)                                  00250005
*                                                                       00260000
         DFHMDF POS=(03,01),                                           X00270001
               LENGTH=009,                                             X00280001
               ATTRB=(ASKIP,NORM),                                     X00290001
               INITIAL='CRTN CNT:'                                      00300001
ACOUNT   DFHMDF POS=(03,11),                                           X00310003
               LENGTH=007,                                             X00320001
               PICOUT='ZZZZZZ9',                                       X00330001
               ATTRB=(ASKIP,NORM,FSET)                                  00340007
*                                                                       00350001
         DFHMDF POS=(04,01),                                           X00360001
               LENGTH=007,                                             X00370019
               ATTRB=(ASKIP,NORM),                                     X00380024
               INITIAL='EST WT:'                                        00390019
AWGT     DFHMDF POS=(04,09),                                           X00400023
               LENGTH=006,                                             X00410017
               PICOUT='ZZZZZ9',                                        X00420017
               ATTRB=(ASKIP,NORM,FSET)                                  00430027
         DFHMDF POS=(04,16),                                           X00440023
               LENGTH=003,                                             X00450008
               ATTRB=(ASKIP,NORM),                                     X00460022
               INITIAL='LBS'                                            00470008
*                                                                       00480000
         DFHMDF POS=(05,01),                                           X00490001
               LENGTH=007,                                             X00500000
               ATTRB=(ASKIP,NORM),                                     X00510000
               INITIAL='STATUS:'                                        00520000
ASTATUS  DFHMDF POS=(05,09),                                           X00530001
               LENGTH=010,                                             X00540000
               ATTRB=(ASKIP,NORM,FSET)                                  00550000
*                                                                       00560000
         DFHMDF POS=(06,01),                                           X00570001
               LENGTH=007,                                             X00580001
               ATTRB=(ASKIP,NORM),                                     X00590001
               INITIAL='ST DTE:'                                        00600001
ASTDATE  DFHMDF POS=(06,09),                                           X00610001
               LENGTH=010,                                             X00620001
               ATTRB=(ASKIP,NORM,FSET)                                  00630001
*                                                                       00640000
AMSGLN   DFHMDF POS=(08,01),                                           X00650000
               LENGTH=019,                                             X00660000
               ATTRB=(ASKIP,NORM),                                     X00670000
               INITIAL='ENTER TO CONTINUE  '                            00680001
*                                                                       00690000
         DFHMSD TYPE=FINAL                                              00700028
         END                                                            00710000
