*          DATA SET PCKM135    AT LEVEL 012 AS OF 01/27/94                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  PCKM135                                            *   00004**2
*        MAP     PC135A                                             *   00005**2
*        PROGRAM PCKCS135                                           *   00006**2
*        TRANSID E135 - MNEMONIC CRITERIA SPEC                      *   00007**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
PCKM135 DFHMSD TYPE=MAP,                                               X00011**2
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
PC135A  DFHMDI LINE=2,COLUMN=1,                                        X00016**2
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='OPERATING UNIT ID....:',                       X00022**8
               LENGTH=22,                                              X00023**3
               COLOR=NEUTRAL,                                          X00024   
               POS=(07,21)                                              00025**3
AOPERID DFHMDF ATTRB=(ASKIP,NORM),                                     X00026**4
               LENGTH=4,                                               X00027**3
               POS=(07,45),                                            X00028**3
               PICOUT='ZZZ9',                                          X00029*10
               COLOR=BLUE                                               00030**4
        DFHMDF ATTRB=(ASKIP),                                          X00031   
               LENGTH=1,                                               X00032   
               COLOR=NEUTRAL,                                          X00033   
               POS=(07,50)                                              00034**3
*                                                                       00035   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00036**3
               INITIAL='FACILITY ID..........:',                       X00037**3
               LENGTH=22,                                              X00038**3
               COLOR=NEUTRAL,                                          X00039**3
               POS=(09,21)                                              00040**3
AFCLTYI DFHMDF ATTRB=(ASKIP,NORM),                                     X00041**4
               LENGTH=4,                                               X00042**3
               POS=(09,45),                                            X00043**3
               PICOUT='ZZZ9',                                          X00044*10
               COLOR=BLUE                                               00045**4
        DFHMDF ATTRB=(ASKIP),                                          X00046**3
               LENGTH=1,                                               X00047**3
               COLOR=NEUTRAL,                                          X00048**3
               POS=(09,50)                                              00049**3
*                                                                       00050**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00051**3
               INITIAL='FACILITY AREA ID.....:',                       X00052**3
               LENGTH=22,                                              X00053**3
               COLOR=NEUTRAL,                                          X00054**3
               POS=(11,21)                                              00055**3
AFCLTYA DFHMDF ATTRB=(UNPROT,NORM),                                    X00056*12
               LENGTH=6,                                               X00057**3
               COLOR=GREEN,                                            X00058**3
               HILIGHT=UNDERLINE,                                      X00059**3
               POS=(11,45),                                            X00060**3
               PICOUT='XXXXXX'                                          00061**3
        DFHMDF ATTRB=(ASKIP),                                          X00062**3
               LENGTH=1,                                               X00063**3
               COLOR=NEUTRAL,                                          X00064**3
               POS=(11,52)                                              00065**3
*                                                                       00066**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00067**3
               INITIAL='OPERATION DESCRIPTION:',                       X00068**3
               LENGTH=22,                                              X00069**3
               COLOR=NEUTRAL,                                          X00070**3
               POS=(13,21)                                              00071**3
AOPDESC DFHMDF ATTRB=(UNPROT,NORM),                                    X00072*11
               LENGTH=25,                                              X00073**3
               COLOR=GREEN,                                            X00074**3
               HILIGHT=UNDERLINE,                                      X00075**3
               POS=(13,45),                                            X00076**3
               PICOUT='XXXXXXXXXXXXXXXXXXXXXXXXX'                       00077**6
        DFHMDF ATTRB=(ASKIP),                                          X00078**3
               LENGTH=1,                                               X00079**3
               COLOR=NEUTRAL,                                          X00080**3
               POS=(13,71)                                              00081**7
         DFHMSD TYPE=FINAL                                              00082   
         END                                                            00083   
