        PRINT NOGEN                                                     00030001
PCKM869  DFHMSD TYPE=MAP,                                              X00040001
               LANG=COBOL,                                             X00050001
               MODE=INOUT,                                             X00060001
               TIOAPFX=YES,                                            X00070001
               CTRL=FREEKB                                              00080001
*                                                                       00090001
PC869A   DFHMDI SIZE=(08,20),                                          X00100001
               LINE=1,                                                 X00110001
               COLUMN=1,                                               X00120001
               MAPATTS=(COLOR,HILIGHT),                                X00130001
               DSATTS=(COLOR,HILIGHT)                                   00140001
*                                                                       00150001
         DFHMDF POS=(01,01),                                           X00160002
               LENGTH=019,                                             X00170001
               ATTRB=(ASKIP,NORM),                                     X00180001
               INITIAL='MANAGE TRAILER MENU'                            00190002
*                                                                       00200001
         DFHMDF POS=(02,01),                                           X00210001
               LENGTH=016,                                             X00220001
               ATTRB=(ASKIP,NORM),                                     X00230001
               INITIAL='1. OPEN TRAILER '                               00240001
*                                                                       00250001
         DFHMDF POS=(03,01),                                           X00260001
               LENGTH=016,                                             X00270001
               ATTRB=(ASKIP,NORM),                                     X00280001
               INITIAL='2. CLOSE TRAILER'                               00290001
*                                                                       00300001
         DFHMDF POS=(04,01),                                           X00310001
               LENGTH=019,                                             X00320001
               ATTRB=(ASKIP,NORM),                                     X00330001
               INITIAL='3. CONVEYOR CUTOFF'                             00340003
*                                                                       00350001
         DFHMDF POS=(05,01),                                           X00360001
               LENGTH=019,                                             X00370001
               ATTRB=(ASKIP,NORM),                                     X00380001
               INITIAL='4. SCN ON-OFF CNTNR'                            00390005
*                                                                       00400001
         DFHMDF POS=(06,01),                                           X00401001
               LENGTH=019,                                             X00402001
               ATTRB=(ASKIP,NORM),                                     X00403001
               INITIAL='5. TRAILER STATUS  '                            00404001
*                                                                       00405001
         DFHMDF POS=(07,01),                                           X00410001
               LENGTH=009,                                             X00420001
               ATTRB=(ASKIP,NORM),                                     X00430001
               INITIAL='SELECTION'                                      00440001
*                                                                       00450001
ASELECT  DFHMDF POS=(07,11),                                           X00460001
               LENGTH=001,                                             X00470001
               HILIGHT=UNDERLINE,                                      X00480001
               ATTRB=(UNPROT,NORM,IC)                                   00490001
*                                                                       00500001
         DFHMDF POS=(07,13),                                           X00510001
               LENGTH=001,                                             X00520001
               ATTRB=(ASKIP)                                            00530001
*                                                                       00540001
AMSGLN   DFHMDF POS=(08,01),                                           X00550001
               LENGTH=019,                                             X00560001
               ATTRB=(ASKIP,NORM)                                       00570001
*                                                                       00580001
         DFHMSD TYPE=FINAL                                              00590006
         END                                                            00600001
