*********************************************************************** 00010036
*                                                                       00020036
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00030036
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00040036
*********************************************************************** 00050036
        PRINT NOGEN                                                     00060036
PCKM862  DFHMSD TYPE=MAP,                                              X00070053
               LANG=COBOL,                                             X00080036
               MODE=INOUT,                                             X00090036
               TIOAPFX=YES,                                            X00100036
               CTRL=FREEKB                                              00110036
PC862A   DFHMDI SIZE=(08,22),                                          X00120053
               LINE=1,                                                 X00130036
               COLUMN=1,                                               X00140036
               MAPATTS=(COLOR,HILIGHT),                                X00150052
               DSATTS=(COLOR,HILIGHT)                                   00160052
*********************************************************************** 00170036
         DFHMDF POS=(01,01),                                           X00180053
               LENGTH=018,                                             X00190057
               ATTRB=(ASKIP,NORM),                                     X00200053
               INITIAL='1. UNIT ADJUSTMENT'                             00210057
*********************************************************************** 00220036
         DFHMDF POS=(02,01),                                           X00230053
               LENGTH=016,                                             X00240057
               ATTRB=(ASKIP,NORM),                                     X00250053
               INITIAL='2. DAMAGED UNITS'                               00260057
*********************************************************************** 00270053
         DFHMDF POS=(03,01),                                           X00280053
               LENGTH=011,                                             X00290055
               ATTRB=(ASKIP,NORM),                                     X00300053
               INITIAL='3.         '                                    00310057
*********************************************************************** 00320053
         DFHMDF POS=(04,01),                                           X00330053
               LENGTH=012,                                             X00340056
               ATTRB=(ASKIP,NORM),                                     X00350053
               INITIAL='4.          '                                   00360057
*********************************************************************** 00370053
         DFHMDF POS=(05,01),                                           X00380053
               LENGTH=012,                                             X00390056
               ATTRB=(ASKIP,NORM),                                     X00400053
               INITIAL='5.          '                                   00410057
*********************************************************************** 00420053
         DFHMDF POS=(06,01),                                           X00430053
               LENGTH=012,                                             X00440056
               ATTRB=(ASKIP,NORM),                                     X00450053
               INITIAL='6.          '                                   00460057
*********************************************************************** 00470053
         DFHMDF POS=(07,01),                                           X00480053
               LENGTH=009,                                             X00490053
               ATTRB=(ASKIP,NORM),                                     X00500053
               INITIAL='SELECTION'                                      00510053
ASELECT  DFHMDF POS=(07,11),                                           X00520053
               LENGTH=001,                                             X00530053
               HILIGHT=UNDERLINE,                                      X00540053
               ATTRB=(UNPROT,NORM,IC,FSET)                              00550058
         DFHMDF POS=(07,13),                                           X00560053
               LENGTH=000,                                             X00570054
               ATTRB=(ASKIP)                                            00580053
*********************************************************************** 00590049
AMSGLN   DFHMDF POS=(08,01),                                           X00600036
               LENGTH=019,                                             X00610036
               ATTRB=(ASKIP,NORM,FSET)                                  00620058
*********************************************************************** 00630036
*********************************************************************** 00640036
         DFHMSD TYPE=FINAL                                              00650059
         END                                                            00660036
