*********************************************************************** 00010000
*          DATA SET PCKM745                                             00020000
  PRINT  NOGEN                                                          00030000
*-------------------------------------------------------------------*   00040000
*                                                                   *   00050000
*        MAPSET  PCKM745                                            *   00060000
*        MAP     PC745A                                             *   00070000
*        PROGRAM PCKCS745                                           *   00080000
*        TRANSID E745 - IN-TRANSIT CRITERIAL SPECIFICATION          *   00090000
*        SYSTEM  PROCESS CONTROL (PC)                               *   00100000
*                                                                   *   00110000
*-------------------------------------------------------------------*   00120000
PCKM745  DFHMSD TYPE=&&SYSPARM,                                        X00130000
               CTRL=(FREEKB),                                          X00140000
               LANG=COBOL,                                             X00150000
               MODE=INOUT,                                             X00160000
               TIOAPFX=YES                                              00170000
PC745A   DFHMDI SIZE=(19,080),                                         X00180000
               MAPATTS=(COLOR,HILIGHT),                                X00190000
               DSATTS=(COLOR,HILIGHT),                                 X00200000
               LINE=02,                                                X00210000
               COLUMN=01                                                00220000
*********************************************************************** 00230000
         DFHMDF POS=(05,002),                                          X00240000
               COLOR=NEUTRAL,                                          X00250000
               ATTRB=(ASKIP,BRT),                                      X00260000
               LENGTH=040,                                             X00270000
               INITIAL='ENTER SKU TO CREATE A LIST OF IN-TRANSIT'       00280000
         DFHMDF POS=(05,043),                                          X00281000
               COLOR=NEUTRAL,                                          X00282000
               ATTRB=(ASKIP,BRT),                                      X00283000
               LENGTH=007,                                             X00284000
               INITIAL='STORES:'                                        00285000
*********************************************************************** 00286000
         DFHMDF POS=(08,020),                                          X00287000
               COLOR=NEUTRAL,                                          X00288000
               ATTRB=(ASKIP,BRT),                                      X00289000
               LENGTH=013,                                             X00290000
               INITIAL='SKU.........:'                                  00300000
ASKU     DFHMDF POS=(08,034),                                          X00310000
               COLOR=GREEN,                                            X00320000
               ATTRB=(UNPROT),                                         X00330000
               HILIGHT=UNDERLINE,                                      X00340000
               LENGTH=008,                                             X00350000
               PICOUT='ZZZZZZZZ'                                        00351000
         DFHMDF POS=(08,43),                                           X00352000
               LENGTH=01,                                              X00353000
               ATTRB=(ASKIP,DRK)                                        00354000
*********************************************************************** 00355000
         DFHMDF POS=(09,020),                                          X00356000
               COLOR=NEUTRAL,                                          X00357000
               ATTRB=(ASKIP,BRT),                                      X00358000
               LENGTH=013,                                             X00359000
               INITIAL='DESCRIPTION.:'                                  00360000
ADESC    DFHMDF POS=(09,034),                                          X00370000
               COLOR=BLUE,                                             X00380000
               ATTRB=(ASKIP),                                          X00390000
               LENGTH=018                                               00400000
         DFHMDF POS=(09,55),                                           X00410000
               LENGTH=01,                                              X00420000
               ATTRB=(ASKIP,DRK)                                        00430000
*********************************************************************** 00440000
         DFHMDF POS=(11,020),                                          X00450000
               COLOR=NEUTRAL,                                          X00460000
               ATTRB=(ASKIP),                                          X00470000
               LENGTH=013,                                             X00480000
               INITIAL='STORE NUMBER:'                                  00490000
ASTORE   DFHMDF POS=(11,034),                                          X00500000
               COLOR=GREEN,                                            X00510000
               ATTRB=(UNPROT),                                         X00520000
               HILIGHT=UNDERLINE,                                      X00530000
               LENGTH=004                                               00540000
         DFHMDF POS=(11,39),                                           X00550000
               LENGTH=01,                                              X00560000
               ATTRB=(ASKIP,DRK)                                        00570000
ANAME    DFHMDF POS=(11,41),                                           X00580000
               LENGTH=25,                                              X00590000
               COLOR=BLUE,                                             X00600000
               ATTRB=(ASKIP)                                            00610000
         DFHMDF POS=(11,68),                                           X00620000
               LENGTH=01,                                              X00630000
               ATTRB=(ASKIP,DRK)                                        00640000
*********************************************************************** 00641001
         DFHMDF POS=(13,020),                                          X00642001
               COLOR=NEUTRAL,                                          X00643001
               ATTRB=(ASKIP),                                          X00644001
               LENGTH=013,                                             X00645001
               INITIAL='PO NUMBER...:'                                  00646001
APONBR   DFHMDF POS=(13,034),                                          X00647001
               COLOR=GREEN,                                            X00648001
               ATTRB=(UNPROT),                                         X00649001
               HILIGHT=UNDERLINE,                                      X00649101
               LENGTH=009                                               00649201
         DFHMDF POS=(13,44),                                           X00649301
               LENGTH=01,                                              X00649401
               ATTRB=(ASKIP,DRK)                                        00649501
*********************************************************************** 00649601
         DFHMDF POS=(14,020),                                          X00649701
               COLOR=NEUTRAL,                                          X00649801
               ATTRB=(ASKIP),                                          X00649901
               LENGTH=013,                                             X00650001
               INITIAL='RCVR NUMBER.:'                                  00650101
ARCVR    DFHMDF POS=(14,34),                                           X00650201
               COLOR=GREEN,                                            X00650301
               ATTRB=(UNPROT),                                         X00650401
               HILIGHT=UNDERLINE,                                      X00650501
               LENGTH=04                                                00650601
         DFHMDF POS=(14,39),                                           X00650701
               LENGTH=01,                                              X00650801
               ATTRB=(ASKIP,DRK)                                        00650901
*********************************************************************** 00651001
*********************************************************************** 00660000
         DFHMSD TYPE=FINAL                                              00670000
         END                                                            00680000
