*          DATA SET PCKM161    AT LEVEL 007 AS OF 04/27/94                      
*          DATA SET PCKM161    AT LEVEL 013 AS OF 03/24/94              00001   
*          DATA SET PCKM161A1  AT LEVEL 012 AS OF 02/11/94              00002   
PCKM161  DFHMSD TYPE=&&SYSPARM,                                        X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               TIOAPFX=YES                                              00006   
PC161A   DFHMDI SIZE=(19,080),                                         X00007   
               MAPATTS=(COLOR,HILIGHT),                                X00008   
               DSATTS=(COLOR,HILIGHT),                                 X00009   
               LINE=02,                                                X00010   
               COLUMN=01,                                              X00011   
               CTRL=(FREEKB,FRSET)                                      00012   
*                                                                       00013   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00014**4
               INITIAL='ABOUT TO COMPLETE ALL SKUS FOR THE W.O.',      X00015**5
               COLOR=NEUTRAL,                                          X00016**4
               LENGTH=39,                                              X00017**5
               POS=(06,20)                                              00018**7
*                                                                       00019   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00020**6
               INITIAL='            PF2 TO CONFIRM             ',      X00021**7
               COLOR=NEUTRAL,                                          X00022**6
               LENGTH=39,                                              X00023**6
               POS=(08,20)                                              00024**7
*                                                                       00025**6
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026**7
               INITIAL='            PF3 TO BACKOUT             ',      X00027**7
               COLOR=NEUTRAL,                                          X00028**7
               LENGTH=39,                                              X00029**7
               POS=(10,20)                                              00030**7
*                                                                       00031**7
         DFHMSD TYPE=FINAL                                              00032   
         END                                                            00033   
