        PRINT NOGEN                                                     00001   
PCKM854  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
PC854A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='FST'                                            00015*29
AFAST    DFHMDF POS=(01,05),                                           X00012**5
               LENGTH=013,                                             X00013*29
               ATTRB=(ASKIP,NORM,FSET)                                  00014*24
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='DEST STR    :'                                  00015*29
ASTORE   DFHMDF POS=(03,15),                                           X00012**5
               LENGTH=004,                                             X00013*29
               PICOUT='ZZZZ',                                          X00013*29
               ATTRB=(UNPROT,NORM,IC,FSET)                              00014*24
*                                                                       00041*22
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='NBR LABELS  :'                                  00015*29
ALABELS  DFHMDF POS=(04,15),                                           X00012**5
               LENGTH=004,                                             X00013*29
               INITIAL='1',                                            X00013*29
               PICOUT='ZZZZ',                                          X00013*29
               ATTRB=(UNPROT,NORM,FSET)                                 00014*24
*                                                                       00041*22
         DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='MULT XFERS  :'                                  00015*29
AMULT    DFHMDF POS=(05,15),                                           X00012**5
               LENGTH=001,                                             X00013*29
               INITIAL='N',                                            X00013*29
               ATTRB=(UNPROT,NORM,FSET)                                 00014*24
         DFHMDF POS=(05,17),                                           X00034*22
               LENGTH=001,                                             X00035*22
               ATTRB=(ASKIP,DRK)                                        00036*14
*                                                                       00041*22
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SML PRTR NBR:'                                  00015*29
APRTR    DFHMDF POS=(06,15),                                           X00012**5
               LENGTH=004,                                             X00013*29
               ATTRB=(UNPROT,NORM,FSET)                                 00014*24
*                                                                       00072**5
AMSGLN   DFHMDF POS=(07,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM,FSET)                                  00075*24
*                                                                       00055   
         DFHMDF POS=(08,02),                                           X00034*22
               LENGTH=014,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='ENTER TO CONT'                                  00015*29
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
