*          DATA SET PCKM113    AT LEVEL 001 AS OF 07/12/95                      
*          DATA SET PCKM113    AT LEVEL 016 AS OF 06/20/94              00001   
*          DATA SET PCKM113    AT LEVEL 008 AS OF 03/15/93              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  PCKM113                                            *   00006   
*        MAP     PC113A                                             *   00007   
*        PROGRAM PCKCS113                                           *   00008   
*        TRANSID E113                                               *   00009   
*        SYSTEM  CICS ARCHITECTURE - CARTON LABELS                  *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
PCKM113 DFHMSD TYPE=DSECT,                                             X00013   
               LANG=COBOL,                                             X00014   
               MODE=INOUT,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TERM=3270-2,                                            X00017   
               TIOAPFX=YES                                              00018   
PC113A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               CTRL=(FREEKB),                                          X00021   
               MAPATTS=(COLOR,HILIGHT),                                X00022   
               DSATTS=(COLOR,HILIGHT)                                   00023   
*                                                                       00024   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00025   
               INITIAL='OPERATING UNIT.:',                             X00026   
               LENGTH=16,                                              X00027   
               POS=(02,24)                                              00028   
AOPUNIT DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00029   
               LENGTH=4,                                               X00030   
               COLOR=GREEN,                                            X00031   
               HILIGHT=UNDERLINE,                                      X00032   
               POS=(02,41)                                              00033   
AOPDESC DFHMDF ATTRB=(ASKIP),                                          X00034   
               LENGTH=24,                                              X00035   
               COLOR=BLUE,                                             X00036   
               POS=(02,46)                                              00037   
*                                                                       00038   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00039   
               INITIAL='FACILITY.......:',                             X00040   
               LENGTH=16,                                              X00041   
               POS=(03,24)                                              00042   
AFACIL  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00043   
               LENGTH=4,                                               X00044   
               COLOR=GREEN,                                            X00045   
               HILIGHT=UNDERLINE,                                      X00046   
               POS=(03,41)                                              00047   
AFACDES DFHMDF ATTRB=(ASKIP),                                          X00048   
               LENGTH=24,                                              X00049   
               COLOR=BLUE,                                             X00050   
               POS=(03,47)                                              00051   
*                                                                       00052   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00053   
               INITIAL='PRINTER NUMBER.:',                             X00054   
               LENGTH=16,                                              X00055   
               POS=(04,24)                                              00056   
APRTR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00057   
               LENGTH=3,                                               X00058   
               COLOR=GREEN,                                            X00059   
               HILIGHT=UNDERLINE,                                      X00060   
               POS=(04,42)                                              00061   
APRDESC DFHMDF ATTRB=ASKIP,                                            X00062   
               LENGTH=25,                                              X00063   
               COLOR=BLUE,                                             X00064   
               POS=(04,46)                                              00065   
*                                                                       00066   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00067   
               INITIAL='PO NUMBER......:',                             X00068   
               LENGTH=16,                                              X00069   
               POS=(05,24)                                              00070   
APO     DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00071   
               LENGTH=8,                                               X00072   
               COLOR=GREEN,                                            X00073   
               HILIGHT=UNDERLINE,                                      X00074   
               POS=(05,41)                                              00075   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00076   
               INITIAL=' ',                                            X00077   
               LENGTH=1,                                               X00078   
               POS=(05,50)                                              00079   
*                                                                       00080   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00081   
               INITIAL='RCVR SEQ NBR...:',                             X00082   
               LENGTH=16,                                              X00083   
               POS=(06,24)                                              00084   
ASEQ    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00085   
               LENGTH=3,                                               X00086   
               COLOR=GREEN,                                            X00087   
               HILIGHT=UNDERLINE,                                      X00088   
               POS=(06,41)                                              00089   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00090   
               INITIAL=' ',                                            X00091   
               LENGTH=1,                                               X00092   
               POS=(06,45)                                              00093   
*                                                                       00094   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00095   
               INITIAL='PO LINE NUMBER.:',                             X00096   
               LENGTH=16,                                              X00097   
               POS=(07,24)                                              00098   
APOLNE  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00099   
               LENGTH=4,                                               X00100   
               COLOR=GREEN,                                            X00101   
               HILIGHT=UNDERLINE,                                      X00102   
               POS=(07,41)                                              00103   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00104   
               INITIAL=' ',                                            X00105   
               LENGTH=1,                                               X00106   
               POS=(07,46)                                              00107   
*                                                                       00108   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00109   
               INITIAL='PROCESS AREA...:',                             X00110   
               LENGTH=16,                                              X00111   
               POS=(08,24)                                              00112   
AAREA   DFHMDF ATTRB=(UNPROT,NORM),                                    X00113   
               LENGTH=6,                                               X00114   
               COLOR=GREEN,                                            X00115   
               HILIGHT=UNDERLINE,                                      X00116   
               POS=(08,41)                                              00117   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00118   
               INITIAL=' ',                                            X00119   
               LENGTH=1,                                               X00120   
               POS=(08,48)                                              00121   
*                                                                       00122   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00123   
               INITIAL='RECEIVED DATE..:',                             X00124   
               LENGTH=16,                                              X00125   
               POS=(09,24)                                              00126   
ARCVDMM DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00127   
               LENGTH=2,                                               X00128   
               COLOR=GREEN,                                            X00129   
               HILIGHT=UNDERLINE,                                      X00130   
               POS=(09,41)                                              00131   
ARCVDDD DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00132   
               LENGTH=2,                                               X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               POS=(09,44)                                              00136   
ARCVDYY DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00137   
               LENGTH=2,                                               X00138   
               COLOR=GREEN,                                            X00139   
               HILIGHT=UNDERLINE,                                      X00140   
               POS=(09,47)                                              00141   
ARCVDES DFHMDF ATTRB=(ASKIP,BRT),                                      X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=7,                                               X00144   
               POS=(09,50)                                              00145   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00146   
               INITIAL=' ',                                            X00147   
               LENGTH=1,                                               X00148   
               POS=(09,58)                                              00149   
*                                                                       00150   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00151   
               INITIAL='START VALUE....:',                             X00152   
               LENGTH=16,                                              X00153   
               POS=(10,24)                                              00154   
ASTRT   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00155   
               LENGTH=4,                                               X00156   
               COLOR=GREEN,                                            X00157   
               HILIGHT=UNDERLINE,                                      X00158   
               POS=(10,41)                                              00159   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00160   
               INITIAL=' ',                                            X00161   
               LENGTH=1,                                               X00162   
               POS=(10,46)                                              00163   
*                                                                       00164   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00165   
               INITIAL='OF TOTAL NO....:',                             X00166   
               LENGTH=16,                                              X00167   
               POS=(11,24)                                              00168   
AEND    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00169   
               LENGTH=4,                                               X00170   
               COLOR=GREEN,                                            X00171   
               HILIGHT=UNDERLINE,                                      X00172   
               POS=(11,41)                                              00173   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00174   
               INITIAL=' ',                                            X00175   
               LENGTH=1,                                               X00176   
               POS=(11,46)                                              00177   
*                                                                       00178   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00179   
               INITIAL='TOTAL LABELS...:',                             X00180   
               LENGTH=16,                                              X00181   
               POS=(12,24)                                              00182   
ALBLS   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00183   
               LENGTH=4,                                               X00184   
               COLOR=GREEN,                                            X00185   
               HILIGHT=UNDERLINE,                                      X00186   
               POS=(12,41)                                              00187   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00188   
               INITIAL=' ',                                            X00189   
               LENGTH=1,                                               X00190   
               POS=(12,46)                                              00191   
*                                                                       00192   
         DFHMSD TYPE=FINAL                                              00193   
         END                                                            00194   
