000100***************************************************************** 00010099
000200 IDENTIFICATION DIVISION.                                         00020099
000300***************************************************************** 00030099
000400                                                                  00040099
000500 PROGRAM-ID.             PCKRP035.                                00050099
000600 AUTHOR.                 STEVE ANDERSON (CODEWORKS).              00060099
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070099
000800 DATE-WRITTEN            OCTOBER, 2011.                           00080099
000900 DATE-COMPILED.                                                   00090099
001000                                                                  00100099
001100***************************************************************** 00110099
001200*                                                               * 00120099
001300* THIS PROGRAM WILL CREATE/PRINT THE DC INBOUND CARTON FORECAST * 00130099
001400* BY TRAILER SUMMARY REPORT.                                    * 00140099
001500*                     11                                        * 00150099
001600***************************************************************** 00160099
001700*  CHANGE LOG.                                                    00170099
001800*  DATE         CHANGED BY      DESC                              00180099
001900*  -----------  --------------  --------------------------------- 00190099
001910*  04/03/2012   B. ROCKWELL    ADD HANGING PACKSLIP TOTAL LINE    00191099
001920*                              PROJ ID:  3347A                    00192099
001930*                              WR/IR#:   WR40796                  00193099
001940*  10/10/2011   S. ANDERSON   - EFC OPTIMIZATION AND HOLIDAY PREP 00194099
001950*                               NEW PROGRAM  PROJ ID:   3253      00195099
001960*                                             WR/IR#:   WR40392   00196099
001970*  03/26/2013   C. PARMLEY     INCLUDE RFID # CARTONS AND UNITS   00197099
001980*                              ON REPORT, INCREASE REPORT SIZE    00198099
001990*                              TO 200.                            00199099
002000*                              PROJ ID:   5148B                   00200099
002100*                              WR/IR#:   CRQ0000000?????          00210099
002200*  01/16/2014   R. SREEDHAREN  INCLUDE RFID Q AND U CTNS AND      00220099
002210*                              100% RFID AUD CTNS                 00221099
002220*                              PROJ ID:   5148D                   00222099
002230***************************************************************** 00223099
002240/                                                                 00224099
002250***************************************************************** 00225099
002260 ENVIRONMENT DIVISION.                                            00226099
002270***************************************************************** 00227099
002280                                                                  00228099
002290 CONFIGURATION SECTION.                                           00229099
002300 SOURCE-COMPUTER.        IBM-3090.                                00230099
002400 OBJECT-COMPUTER.        IBM-3090.                                00240099
002500                                                                  00250099
002600 INPUT-OUTPUT SECTION.                                            00260099
002700                                                                  00270099
002800 FILE-CONTROL.                                                    00280099
002900                                                                  00290099
003000     SELECT INPUT01-FILE       ASSIGN TO INP01.                   00300099
003100     SELECT REPORT-FILE        ASSIGN TO RPT01.                   00310099
003200                                                                  00320099
003300***************************************************************** 00330099
003400 DATA DIVISION.                                                   00340099
003500***************************************************************** 00350099
003600                                                                  00360099
003700 FILE SECTION.                                                    00370099
003800                                                                  00380099
003900* CLP 06/05/13 PR# 5148B START                                    00390099
004000 FD  INPUT01-FILE                                                 00400099
004100     LABEL RECORDS ARE STANDARD                                   00410099
004200     RECORDING MODE IS F                                          00420099
004300     BLOCK CONTAINS 0 RECORDS                                     00430099
004400     RECORD CONTAINS 400 CHARACTERS.                              00440099
004500 01  INPUT01-RECORD                  PIC X(400).                  00450099
004600                                                                  00460099
004700 FD  REPORT-FILE                                                  00470099
004800     RECORDING MODE IS F                                          00480099
004900     BLOCK CONTAINS 0  RECORDS.                                   00490099
005000 01  REPORT-RECORD                   PIC  X(250).                 00500099
005100* CLP 06/05/13 PR# 5148B END                                      00510099
005200/                                                                 00520099
005300 WORKING-STORAGE SECTION.                                         00530099
005400                                                                  00540099
005500 01  PROGRAM-SWITCHES.                                            00550099
005600     05  PS-END-OF-INPUT-SW          PIC  X(01)    VALUE 'N'.     00560099
005700         88  PS-END-OF-INPUT                       VALUE 'Y'.     00570099
005800     05  PS-FIRST-TIME-SW            PIC  X(01)    VALUE 'Y'.     00580099
005900         88  PS-FIRST-TIME                         VALUE 'Y'.     00590099
006000     05  PS-FIRST-TIME-PO-SW         PIC  X(01)    VALUE 'Y'.     00600099
006100         88  PS-FIRST-TIME-PO                      VALUE 'Y'.     00610099
006200         88  PS-FIRST-TIME-PO-NO                   VALUE 'N'.     00620099
006300     05  PS-FIRST-TIME-SHPMT-SW      PIC  X(01)    VALUE 'Y'.     00630099
006400         88  PS-FIRST-TIME-SHPMT                   VALUE 'Y'.     00640099
006500         88  PS-FIRST-TIME-SHPMT-NO                VALUE 'N'.     00650099
006600     05  PS-NEW-TRIP-SW              PIC  X(01)    VALUE 'Y'.     00660099
006700         88  PS-NEW-TRIP-YES                       VALUE 'Y'.     00670099
006800         88  PS-NEW-TRIP-NO                        VALUE 'N'.     00680099
006900     05  PS-IN-DOORS-SW              PIC  X(01)    VALUE 'N'.     00690099
007000         88  PS-IN-DOORS-DATA-FOUND                VALUE 'Y'.     00700099
007100     05  PS-YARD-SW                  PIC  X(01)    VALUE 'N'.     00710099
007200         88  PS-YARD-DATA-FOUND                    VALUE 'Y'.     00720099
007300     05  PS-ENROUTE-SW               PIC  X(01)    VALUE 'N'.     00730099
007400         88  PS-ENROUTE-DATA-FOUND                 VALUE 'Y'.     00740099
007500     05  PS-PCKSLIPSH-SW             PIC  X(01)    VALUE 'N'.     00750099
007600         88  PS-PCKSLIPSH-DATA-FOUND               VALUE 'Y'.     00760099
007700     05  PS-REPLEN-SW                PIC  X(01)    VALUE 'N'.     00770099
007800         88  PS-REPLEN-DATA-FOUND                  VALUE 'Y'.     00780099
007900         88  PS-REPLEN-DATA-NO                     VALUE 'N'.     00790099
008000                                                                  00800099
008100 01  PC-CONSTANTS.                                                00810099
008200     05  PC-PROGRAM-NAME             PIC  X(08)    VALUE          00820099
008300                           'PCKRP035'.                            00830099
008400     05  PC-REPORT-NBR               PIC  X(02)    VALUE          00840099
008500                           '-1'.                                  00850099
008600     05  PC-ENROUTE                  PIC  X(20)    VALUE          00860099
008700         'ENROUTE        '.                                       00870099
008800     05  PC-IN-DOORS                 PIC  X(20)    VALUE          00880099
008900         'IN DOORS       '.                                       00890099
009000     05  PC-YARD                     PIC  X(20)    VALUE          00900099
009100         'YARD           '.                                       00910099
009200     05  PC-PACK-SLIPS-HANGING       PIC  X(20)    VALUE          00920099
009300         'PCKSLPS HANGING'.                                       00930099
009400                                                                  00940099
009500 01  PV-MISC-FIELDS.                                              00950099
009600     05  PV-LINE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00960099
009700     05  PV-NBR-OF-LINES             PIC S9(05) COMP-3 VALUE +0.  00970099
009800     05  PV-LINE-LIMIT               PIC S9(03) COMP-3 VALUE +57. 00980099
009900     05  PV-PAGE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00990099
010000     05  PV-USER-NAME                PIC X(25)     VALUE SPACES.  01000099
010100     05  PV-TODAYS-DATE.                                          01010099
010200         10  PV-TODAYS-DATE-CCYY     PIC  9(04)    VALUE ZERO.    01020099
010300         10  PV-TODAYS-DATE-MM       PIC  9(02)    VALUE ZERO.    01030099
010400         10  PV-TODAYS-DATE-DD       PIC  9(02)    VALUE ZERO.    01040099
010500     05  PV-TODAYS-TIME.                                          01050099
010600         10  PV-TODAYS-TIME-HH       PIC  9(02)    VALUE ZERO.    01060099
010700         10  PV-TODAYS-TIME-MM       PIC  9(02)    VALUE ZERO.    01070099
010800         10  PV-TODAYS-TIME-SS       PIC  9(02)    VALUE ZERO.    01080099
010900         10  FILLER                  PIC  9(02)    VALUE ZERO.    01090099
011000     05  PV-FORMAT-DATE.                                          01100099
011100         10  PV-FORMAT-DATE-MM       PIC  X(02)    VALUE SPACES.  01110099
011200         10  FILLER                  PIC  X(01)    VALUE '/'.     01120099
011300         10  PV-FORMAT-DATE-DD       PIC  X(02)    VALUE SPACES.  01130099
011400         10  FILLER                  PIC  X(01)    VALUE '/'.     01140099
011500         10  PV-FORMAT-DATE-YYYY     PIC  X(04)    VALUE SPACES.  01150099
011600     05  PV-IN-RECS                  PIC S9(09) COMP-3 VALUE +0.  01160099
011700     05  PV-IN-RECZ                  PIC ZZZ,ZZZ,ZZ9              01170099
011800                                                BLANK WHEN ZERO.  01180099
011900     05  PV-DC-LOCATION              PIC 9(04)         VALUE 0.   01190099
012000     05  PV-PROC-GROUP               PIC 9(01)         VALUE 0.   01200099
012100     05  PV-SLOC-IND                 PIC X(01)     VALUE SPACES.  01210099
012200     05  PV-STATUS-GROUP             PIC X(01)     VALUE SPACES.  01220099
012300     05  PV-PREV-LOC                 PIC X(05)     VALUE SPACES.  01230099
012400     05  PV-PCNT-FIELD               PIC 999V99        VALUE 0.   01240099
012500     05  PV-HOLD-PCNT-SCANNED        PIC ZZ9.                     01250099
012600* STATUS GROUP TOTALS                                             01260099
012700 01  PV-SG-ACCUM-TABLE.                                           01270099
012800   05  PV-SG-ACCUMULATORS OCCURS 4 TIMES INDEXED BY PV-IDX.       01280099
012900     10  PV-SG-LOC-IND               PIC X  VALUE SPACES.         01290099
013000     10  PV-SG-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   01300099
013100     10  PV-SG-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   01310099
013200     10  PV-SG-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   01320099
013300     10  PV-SG-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   01330099
013400     10  PV-SG-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01340099
013500     10  PV-SG-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01350099
013600     10  PV-SG-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   01360099
013700     10  PV-SG-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01370099
013800     10  PV-SG-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   01380099
013900     10  PV-SG-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01390099
014000     10  PV-SG-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01400099
014100     10  PV-SG-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   01410099
014200     10  PV-SG-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   01420099
014300     10  PV-SG-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01430099
014400     10  PV-SG-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01440099
014500* CLP 06/05/13 PR# 5148B START                                    01450099
014600     10  PV-SG-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01460099
014700     10  PV-SG-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01470099
014800* CLP 06/05/13 PR# 5148B END                                      01480099
014810* DMH 07/2014 CONTROLLED FLOW                                     01481099
014820     10  PV-SG-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01482099
014830     10  PV-SG-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01483099
014840* DMH 07/2014 HAZARDOUS COUNT                                     01484099
014850     10  PV-SG-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01485099
014860     10  PV-SG-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01486099
014900*SB 01/16/14 - BEGIN PR#5148D                                     01490099
014910     10  PV-SG-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   01491099
014920     10  PV-SG-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01492099
014930     10  PV-SG-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   01493099
014940*SB 01/16/14 - END PR#5148D                                       01494099
014950 01  PV-EFC-NBR                      PIC 999 VALUE 0.             01495099
014960* DC TOTALS                                                       01496099
014970 01  PV-DC-ACCUMULATORS.                                          01497099
014980     05  PV-DC-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   01498099
014990     05  PV-DC-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   01499099
015000     05  PV-DC-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   01500099
015100     05  PV-DC-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   01510099
015200     05  PV-DC-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01520099
015300     05  PV-DC-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01530099
015400     05  PV-DC-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   01540099
015500     05  PV-DC-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01550099
015600     05  PV-DC-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   01560099
015700     05  PV-DC-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01570099
015800     05  PV-DC-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01580099
015900     05  PV-DC-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   01590099
016000     05  PV-DC-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   01600099
016100     05  PV-DC-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01610099
016200     05  PV-DC-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01620099
016300* CLP 06/05/13 PR# 5148B START                                    01630099
016400     05  PV-DC-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01640099
016500     05  PV-DC-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01650099
016600* CLP 06/05/13 PR# 5148B END                                      01660099
016610* DMH 07/2014 CONTROLLED FLOW                                     01661099
016620     05  PV-DC-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01662099
016630     05  PV-DC-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01663099
016640* DMH 07/2014 HAZARDOUS COUNTS                                    01664099
016650     05  PV-DC-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01665099
016660     05  PV-DC-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01666099
016700*SB 01/16/14 - BEGIN PR#5148D                                     01670099
016710     05  PV-DC-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   01671099
016720     05  PV-DC-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01672099
016730     05  PV-DC-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   01673099
016740*SB 01/16/14 - END PR#5148D                                       01674099
016750* IN DOOR GRAND TOTALS                                            01675099
016760 01  PV-ID-ACCUMULATORS.                                          01676099
016770     05  PV-ID-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   01677099
016780     05  PV-ID-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   01678099
016790     05  PV-ID-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   01679099
016800     05  PV-ID-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   01680099
016900     05  PV-ID-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01690099
017000     05  PV-ID-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01700099
017100     05  PV-ID-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   01710099
017200     05  PV-ID-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01720099
017300     05  PV-ID-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   01730099
017400     05  PV-ID-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01740099
017500     05  PV-ID-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01750099
017600     05  PV-ID-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   01760099
017700     05  PV-ID-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   01770099
017800     05  PV-ID-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01780099
017900     05  PV-ID-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01790099
018000* CLP 06/05/13 PR# 5148B START                                    01800099
018100     05  PV-ID-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01810099
018200     05  PV-ID-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01820099
018300* CLP 06/05/13 PR# 5148B END                                      01830099
018310* DMH 07/2014 CONTROLLED FLOW                                     01831099
018320     05  PV-ID-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01832099
018330     05  PV-ID-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01833099
018340* DMH 07/2014 HAZARDOUS COUNT                                     01834099
018350     05  PV-ID-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01835099
018360     05  PV-ID-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01836099
018400*SB 01/16/14 - BEGIN PR#5148D                                     01840099
018410     05  PV-ID-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   01841099
018420     05  PV-ID-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01842099
018430     05  PV-ID-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   01843099
018440*SB 01/16/14 - END PR#5148D                                       01844099
018450* YARD GRAND TOTALS                                               01845099
018460 01  PV-YD-ACCUMULATORS.                                          01846099
018470     05  PV-YD-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   01847099
018480     05  PV-YD-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   01848099
018490     05  PV-YD-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   01849099
018500     05  PV-YD-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   01850099
018600     05  PV-YD-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01860099
018700     05  PV-YD-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   01870099
018800     05  PV-YD-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   01880099
018900     05  PV-YD-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01890099
019000     05  PV-YD-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   01900099
019100     05  PV-YD-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01910099
019200     05  PV-YD-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   01920099
019300     05  PV-YD-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   01930099
019400     05  PV-YD-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   01940099
019500     05  PV-YD-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   01950099
019600     05  PV-YD-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   01960099
019700* CLP 06/05/13 PR#4158B START                                     01970099
019800     05  PV-YD-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   01980099
019900     05  PV-YD-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   01990099
020000* CLP 06/05/13 PR#4158B END                                       02000099
020010* DMH 07/2014 CONTROLLED FLOW                                     02001099
020020     05  PV-YD-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02002099
020030     05  PV-YD-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   02003099
020040* DMH 07/2014 HAZARDOUS COUNT                                     02004099
020050     05  PV-YD-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02005099
020060     05  PV-YD-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   02006099
020100*SB 01/16/14 - BEGIN PR#5148D                                     02010099
020110     05  PV-YD-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   02011099
020120     05  PV-YD-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   02012099
020130     05  PV-YD-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   02013099
020140*SB 01/16/14 - END PR#5148D                                       02014099
020150* ENROUTE GRAND TOTALS                                            02015099
020160 01  PV-ER-ACCUMULATORS.                                          02016099
020170     05  PV-ER-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   02017099
020180     05  PV-ER-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   02018099
020190     05  PV-ER-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   02019099
020200     05  PV-ER-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   02020099
020300     05  PV-ER-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   02030099
020400     05  PV-ER-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   02040099
020500     05  PV-ER-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   02050099
020600     05  PV-ER-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02060099
020700     05  PV-ER-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   02070099
020800     05  PV-ER-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02080099
020900     05  PV-ER-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   02090099
021000     05  PV-ER-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   02100099
021100     05  PV-ER-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   02110099
021200     05  PV-ER-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02120099
021300     05  PV-ER-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   02130099
021400* CLP 06/05/13 PR#4158B START                                     02140099
021500     05  PV-ER-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02150099
021600     05  PV-ER-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   02160099
021700* CLP 06/05/13 PR#4158B END                                       02170099
021710* DMH 07/2014 CONTROLLED FLOW                                     02171099
021720     05  PV-ER-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02172099
021730     05  PV-ER-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   02173099
021740* DMH 07/2014 HAZARDOUS COUNT                                     02174099
021750     05  PV-ER-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02175099
021760     05  PV-ER-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   02176099
021800*SB 01/16/14 - BEGIN PR#5148D                                     02180099
021810     05  PV-ER-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   02181099
021820     05  PV-ER-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   02182099
021830     05  PV-ER-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   02183099
021840*SB 01/16/14 - END PR#5148D                                       02184099
021850* PACKSLIPS HANGING GRAND TOTALS                                  02185099
021860 01  PV-PH-ACCUMULATORS.                                          02186099
021870     05  PV-PH-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   02187099
021880     05  PV-PH-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   02188099
021890     05  PV-PH-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   02189099
021900* FINAL GRAND TOTALS                                              02190099
022000 01  PV-FG-ACCUMULATORS.                                          02200099
022100     05  PV-FG-TRLR-CNT              PIC S9(9) COMP-3 VALUE +0.   02210099
022200     05  PV-FG-PO-TOT                PIC S9(9) COMP-3 VALUE +0.   02220099
022300     05  PV-FG-CTNS-TOT              PIC S9(9) COMP-3 VALUE +0.   02230099
022400     05  PV-FG-UNTS-TOT              PIC S9(9) COMP-3 VALUE +0.   02240099
022500     05  PV-FG-Q-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   02250099
022600     05  PV-FG-U-CTNS-TOT            PIC S9(9) COMP-3 VALUE +0.   02260099
022700     05  PV-FG-CRSDK-CTNS-TOT        PIC S9(9) COMP-3 VALUE +0.   02270099
022800     05  PV-FG-P2L-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02280099
022900     05  PV-FG-PROC-CNT-TOT          PIC S9(9) COMP-3 VALUE +0.   02290099
023000     05  PV-FG-TRBL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02300099
023100     05  PV-FG-SET-DVT-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   02310099
023200     05  PV-FG-PCNT-AUD-CTN-TOT      PIC S9(9) COMP-3 VALUE +0.   02320099
023300     05  PV-FG-EFC-PO-TOT            PIC S9(9) COMP-3 VALUE +0.   02330099
023400     05  PV-FG-EFC-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02340099
023500     05  PV-FG-EFC-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   02350099
023600* CLP 06/05/13 PR#4158B START                                     02360099
023700     05  PV-FG-RFID-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02370099
023800     05  PV-FG-RFID-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   02380099
023900* CLP 06/05/13 PR#4158B END                                       02390099
023910* DMH 07/2014 CONTROLLED FLOW                                     02391099
023920     05  PV-FG-CNTL-CTNS-TOT         PIC S9(9) COMP-3 VALUE +0.   02392099
023930     05  PV-FG-CNTL-UNTS-TOT         PIC S9(9) COMP-3 VALUE +0.   02393099
023940* DMH 07/2014 HAZARDOUS COUNTS                                    02394099
023950     05  PV-FG-HAZ-CTNS-TOT          PIC S9(9) COMP-3 VALUE +0.   02395099
023960     05  PV-FG-HAZ-UNTS-TOT          PIC S9(9) COMP-3 VALUE +0.   02396099
024000*SB 01/16/14 - BEGIN PR#5148D                                     02400099
024100     05  PV-FG-RFID-Q-CTNS-TOT       PIC S9(9) COMP-3 VALUE +0.   02410099
024200     05  PV-FG-COMBO-Q-CTNS-TOT      PIC S9(9) COMP-3 VALUE +0.   02420099
024300     05  PV-FG-RFID-PCNT-AUD-CTN-TOT PIC S9(9) COMP-3 VALUE +0.   02430099
024400*SB 01/16/14 - END PR#5148D                                       02440099
024500/                                                                 02450099
024600****************************************************              02460099
024700* INPUT01 COPYBOOK                                 *              02470099
024800****************************************************              02480099
024900     COPY PCRD068.                                                02490099
025000/                                                                 02500099
025010******************************************************************02501099
025011* INCREASE REPORT TO 250 - TO ALLOW FOR HAZ AND CONTROLLED FLOW  *02501199
025012* 7/24/14 - DMH                                                  *02501299
025013******************************************************************02501399
025020*    STANDARD HEADER FOR 250 COLUMN REPORT                       *02502099
025030******************************************************************02503099
025040     COPY DPWS250O.                                               02504099
025700/                                                                 02570099
025800 01  HDR-LINES.                                                   02580099
025900     05  HDR01-LINE.                                              02590099
026000         10  FILLER                  PIC  X(52)    VALUE SPACES.  02600099
026100         10  FILLER                  PIC  X(45)    VALUE          02610099
026200             '     DC INBOUND CARTON FORECAST SUMMARY      '.     02620099
026300         10  FILLER                  PIC  X(53)    VALUE SPACES.  02630099
026400     05  HDR02-LINE.                                              02640099
026500         10  FILLER                  PIC  X(50)    VALUE          02650099
026600         '-----TRAILER INFORMATION------  ---PO CNTS--------'.    02660099
026700* CLP 06/05/13 PR#4158B START                                     02670099
026800         10  FILLER                  PIC  X(41)    VALUE          02680099
026900         '-----  -----------EST AUDIT--------------'.             02690099
027000         10  FILLER                  PIC  X(20)    VALUE          02700099
027100         '  -CRSDK-  --P2L--  '.                                  02710099
027200         10  FILLER                  PIC  X(16)    VALUE          02720099
027300         '--RFID COUNTS-- '.                                      02730099
027301* DMH 7/2014 CONTROLLED FLOW                                      02730199
027310         10  FILLER                  PIC  X(16)    VALUE          02731099
027320         '---CNTL FLOW--- '.                                      02732099
027330* DMH 7/2014 HAZARDOUS COUNTS                                     02733099
027340         10  FILLER                  PIC  X(16)    VALUE          02734099
027350         '--HAZ COUNTS -- '.                                      02735099
027400         10  FILLER                  PIC  X(06)    VALUE          02740099
027500         ' -----'.                                                02750099
027600         10  FILLER                  PIC  X(34)    VALUE          02760099
027700         '--------------OTHER---------------'.                    02770099
027800         10  FILLER                  PIC  X(52)    VALUE          02780099
027810         '    -------EFC PO CNTS-------'.                         02781099
027820     05  HDR03-LINE.                                              02782099
027830         10  FILLER                  PIC  X(50)    VALUE          02783099
027840         '                                                  '.    02784099
027850         10  FILLER                  PIC  X(41)    VALUE          02785099
027860         '           #       #      #            '.               02786099
027870*SB 01/16/14 - BEGIN PR#5148D                                     02787099
027880         10  FILLER                  PIC  X(18)    VALUE          02788099
027890         '     #        #   '.                                    02789099
027900*SB 01/16/14 - END PR#5148D                                       02790099
028000         10  FILLER                  PIC  X(18)    VALUE          02800099
028100         '     #        #   '.                                    02810099
028101*DMH 7/2014 - CNTL FLOW                                           02810199
028110         10  FILLER                  PIC  X(14)    VALUE          02811099
028120         '  #        #  '.                                        02812099
028130*DMH 7/2014 - HAZ COUNTS                                          02813099
028140         10  FILLER                  PIC  X(19)    VALUE          02814099
028150         '      #        #   '.                                   02815099
028200         10  FILLER                  PIC  X(05)    VALUE          02820099
028300         '   # '.                                                 02830099
028400         10  FILLER                  PIC  X(50)    VALUE          02840099
028500         '   #       #CTN     100%     100%               '.      02850099
028600     05  HDR04-LINE.                                              02860099
028700         10  FILLER                  PIC  X(50)    VALUE          02870099
028800         '                       TRAILER    #      #        '.    02880099
028900         10  FILLER                  PIC  X(40)    VALUE          02890099
029000         '#         QC     RFID   COMBO       #  '.               02900099
029001         10  FILLER                  PIC  X(35)    VALUE          02900199
029002         '    CRSDK    P2L      RFID    RFID'.                    02900299
029003*DMH 7/2014 - CNTL FLOW & HAZARDOUS COUNTS                        02900399
029004         10  FILLER                  PIC  X(33)    VALUE          02900499
029006         '  CNTLFL   CNTLFL    HAZ     HAZ '.                     02900699
029007         10  FILLER                  PIC  X(08)    VALUE          02900799
029008         '   PROC '.                                              02900899
029009         10  FILLER                  PIC  X(54)    VALUE          02900999
029010         ' CTNS    W/ST      QC      RFID       #         #'.     02901099
029011         10  FILLER                  PIC  X(06)    VALUE          02901199
029012         '    # '.                                                02901299
029013     05  HDR05-LINE.                                              02901399
029014         10  FILLER                  PIC  X(50)    VALUE          02901499
029020         'LOC  STATUS             COUNT    POS    CTNS     U'.    02902099
029030         10  FILLER                  PIC  X(43)    VALUE          02903099
029040         'NITS    Q CTN   Q CTN   Q CTNS   U CTNS    '.           02904099
029050         10  FILLER                  PIC  X(17)   VALUE           02905099
029060         ' CTNS    CTNS    '.                                     02906099
029070         10  FILLER                  PIC  X(15)    VALUE          02907099
029080         '  CNTS    UNITS'.                                       02908099
029081*DMH 7/2014 - CNTL FLOW                                           02908199
029082         10  FILLER                  PIC  X(17)    VALUE          02908299
029083         '   CNTS    UNITS '.                                     02908399
029084*DMH 7/2014 - HAZARDOUS COUNTS                                    02908499
029085         10  FILLER                  PIC  X(16)    VALUE          02908599
029086         '   CNTS    UNITS'.                                      02908699
029090         10  FILLER                  PIC  X(08)    VALUE          02909099
029100         '   CNTS '.                                              02910099
029200         10  FILLER                  PIC  X(54)    VALUE          02920099
029300         ' TRBL    &DVT    AUD CNT  AUD CNT    POS      CTNS   '. 02930099
029400         10  FILLER                  PIC  X(08)    VALUE          02940099
029500         '  UNITS '.                                              02950099
029600     05  HDR06-LINE.                                              02960099
029700         10  FILLER                  PIC  X(50)    VALUE          02970099
029800         '---- -----------------  ------  ----- -------   --'.    02980099
029900         10  FILLER                  PIC  X(40)    VALUE          02990099
030000         '-----   -----   -----  -------   ------ '.              03000099
030100         10  FILLER                  PIC  X(18)    VALUE          03010099
030200         '   ------   ------'.                                    03020099
030300         10  FILLER                  PIC  X(09)    VALUE          03030099
030400         '   ------'.                                             03040099
030401         10  FILLER                  PIC  X(08)    VALUE          03040199
030402         '   -----'.                                              03040299
030410* CLP 06/05/13 PR#4158B END                                       03041099
030411*DMH 7/2014 - CONTROLLED FLOW                                     03041199
030412         10  FILLER                  PIC  X(17)    VALUE          03041299
030413         '  ------   ----- '.                                     03041399
030414*DMH 7/2014 - HAZARDOUS COUNTS                                    03041499
030415         10  FILLER                  PIC  X(16)    VALUE          03041599
030416         '  ------   -----'.                                      03041699
030417*OTHER COUNTS                                                     03041799
030420         10  FILLER                  PIC  X(43)    VALUE          03042099
030430         '  ------ -----   -----   -------  -------'.             03043099
030440         10  FILLER                  PIC  X(28)    VALUE          03044099
030450         '  -----    ------  --------'.                           03045099
030460*                                                                 03046099
030470     05  BLANK-LINE                 PIC X(160)    VALUE SPACES.   03047099
030480*                                                                 03048099
030490     05  DC-HDR-LINE.                                             03049099
030500         10  DC-HDR-LOC-ID          PIC  9(04)    VALUE ZEROES.   03050099
030600         10  FILLER                 PIC  X(01)    VALUE SPACES.   03060099
030700         10  DC-HDR-NAME            PIC  X(45)    VALUE SPACES.   03070099
030800         10  FILLER                 PIC  X(50)    VALUE SPACES.   03080099
030900         10  FILLER                 PIC  X(58)    VALUE SPACES.   03090099
031000         10  DC-HDR-EFC-LABEL       PIC  X(05)    VALUE SPACES.   03100099
031100         10  DC-HDR-EFC-NBR         PIC  X(03)    VALUE ZEROES.   03110099
031200         10  FILLER                 PIC  X(20)    VALUE SPACES.   03120099
031300*                                                                 03130099
031400*                                                                 03140099
031500     05  STATUS-GROUP-TOTAL-LINE.                                 03150099
031600         10  SG-TOT-LOC-ID          PIC  9(04)    VALUE ZEROES.   03160099
031700         10  FILLER                 PIC  X(01)    VALUE SPACES.   03170099
031800         10  SG-TOT-DESCRIPTION     PIC  X(18)    VALUE SPACES.   03180099
031900         10  FILLER                 PIC  X(02)    VALUE SPACES.   03190099
032000         10  SG-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 03200099
032100         10  FILLER                 PIC  X(02)    VALUE SPACES.   03210099
032200         10  SG-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 03220099
032300         10  FILLER                 PIC  X(01)    VALUE SPACES.   03230099
032400         10  SG-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 03240099
032500         10  FILLER                 PIC  X(02)    VALUE SPACES.   03250099
032600         10  SG-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 03260099
032700         10  FILLER                 PIC  X(03)    VALUE SPACES.   03270099
032800         10  SG-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 03280099
032900         10  FILLER                 PIC  X(03)    VALUE SPACES.   03290099
033000         10  SG-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 03300099
033100         10  FILLER                 PIC  X(03)    VALUE SPACES.   03310099
033200         10  SG-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 03320099
033300         10  FILLER                 PIC  X(03)    VALUE SPACES.   03330099
033400         10  SG-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 03340099
033500         10  FILLER                 PIC  X(03)    VALUE SPACES.   03350099
033600         10  SG-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 03360099
033700         10  FILLER                 PIC  X(03)    VALUE SPACES.   03370099
033800         10  SG-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 03380099
033900         10  FILLER                 PIC  X(03)    VALUE SPACES.   03390099
034000* CLP 06/05/13 PR#4158B START                                     03400099
034100         10  SG-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03410099
034200         10  FILLER                 PIC  X(02)    VALUE SPACES.   03420099
034300         10  SG-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 03430099
034400         10  FILLER                 PIC  X(02)    VALUE SPACES.   03440099
034500* CLP 06/05/13 PR#4158B END                                       03450099
034510* DMH 07/2014 CONTROLLED FLOW                                     03451099
034520         10  SG-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03452099
034530         10  FILLER                 PIC  X(02)    VALUE SPACES.   03453099
034540         10  SG-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 03454099
034550         10  FILLER                 PIC  X(02)    VALUE SPACES.   03455099
034560* DMH 07/2014 HAZARDOUS COUNT                                     03456099
034570         10  SG-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 03457099
034580         10  FILLER                 PIC  X(02)    VALUE SPACES.   03458099
034590         10  SG-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03459099
034592         10  FILLER                 PIC  X(02)    VALUE SPACES.   03459299
034593* OTHER COUNTS                                                    03459399
034600         10  SG-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 03460099
034700         10  FILLER                 PIC  X(01)    VALUE SPACES.   03470099
034800         10  SG-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 03480099
034900         10  FILLER                 PIC  X(02)    VALUE SPACES.   03490099
035000         10  SG-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03500099
035100         10  FILLER                 PIC  X(06)    VALUE SPACES.   03510099
035200         10  SG-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 03520099
035300         10  FILLER                 PIC  X(05)    VALUE SPACES.   03530099
035400*SB 01/16/14 - BEGIN PR#5148D                                     03540099
035500         10  SG-TOT-RFID-AUDIT-CNT  PIC  ZZZ9    BLANK WHEN ZERO. 03550099
035600         10  FILLER                 PIC  X(04)    VALUE SPACES.   03560099
035700*SB 01/16/14 - BEGIN PR#5148D                                     03570099
035800         10  SG-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 03580099
035900         10  FILLER                 PIC  X(03)    VALUE SPACES.   03590099
036000         10  SG-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 03600099
036100         10  FILLER                 PIC  X(03)    VALUE SPACES.   03610099
036200         10  SG-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 03620099
036300         10  FILLER                 PIC  X(04)    VALUE SPACES.   03630099
036400*                                                                 03640099
036500     05  DC-TOTAL-LINE.                                           03650099
036600         10  FILLER                 PIC  X(25)    VALUE           03660099
036700             'TOTALS                   '.                         03670099
036800         10  DC-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 03680099
036900         10  FILLER                 PIC  X(02)    VALUE SPACES.   03690099
037000         10  DC-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 03700099
037100         10  FILLER                 PIC  X(01)    VALUE SPACES.   03710099
037200         10  DC-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 03720099
037300         10  FILLER                 PIC  X(02)    VALUE SPACES.   03730099
037400         10  DC-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 03740099
037500         10  FILLER                 PIC  X(03)    VALUE SPACES.   03750099
037600         10  DC-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 03760099
037700         10  FILLER                 PIC  X(03)    VALUE SPACES.   03770099
037800         10  DC-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 03780099
037900         10  FILLER                 PIC  X(03)    VALUE SPACES.   03790099
038000         10  DC-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 03800099
038100         10  FILLER                 PIC  X(03)    VALUE SPACES.   03810099
038200         10  DC-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 03820099
038300         10  FILLER                 PIC  X(03)    VALUE SPACES.   03830099
038400         10  DC-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 03840099
038500         10  FILLER                 PIC  X(03)    VALUE SPACES.   03850099
038600         10  DC-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 03860099
038700         10  FILLER                 PIC  X(03)    VALUE SPACES.   03870099
038800* CLP 06/05/13 PR#4158B START                                     03880099
038900         10  DC-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03890099
039000         10  FILLER                 PIC  X(02)    VALUE SPACES.   03900099
039010         10  DC-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 03901099
039020         10  FILLER                 PIC  X(02)    VALUE SPACES.   03902099
039030* CLP 06/05/13 PR#4158B END                                       03903099
039031* DMH 07/2014 CONTROLLED FLOW COUNTS                              03903199
039032         10  DC-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03903299
039034         10  FILLER                 PIC  X(02)    VALUE SPACES.   03903499
039035         10  DC-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 03903599
039037         10  FILLER                 PIC  X(02)    VALUE SPACES.   03903799
039038* DMH 07/2014 HAZARDOUS COUNTS                                    03903899
039039         10  DC-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 03903999
039041         10  FILLER                 PIC  X(02)    VALUE SPACES.   03904199
039042         10  DC-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03904299
039044         10  FILLER                 PIC  X(02)    VALUE SPACES.   03904499
039045* OTHER COUNTS                                                    03904599
039046         10  DC-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 03904699
039050         10  FILLER                 PIC  X(01)    VALUE SPACES.   03905099
039060         10  DC-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 03906099
039070         10  FILLER                 PIC  X(02)    VALUE SPACES.   03907099
039071         10  DC-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 03907199
039073         10  FILLER                 PIC  X(06)    VALUE SPACES.   03907399
039074         10  DC-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 03907499
039076         10  FILLER                 PIC  X(05)    VALUE SPACES.   03907699
039077*SB 01/16/14 - BEGIN PR#5148D                                     03907799
039078         10  DC-TOT-RFID-AUDIT-CNT   PIC  ZZZ9    BLANK WHEN ZERO.03907899
039080         10  FILLER                 PIC  X(04)    VALUE SPACES.   03908099
039081*SB 01/16/14 - END PR#5148D                                       03908199
039082         10  DC-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 03908299
039084         10  FILLER                 PIC  X(03)   VALUE SPACES.    03908499
039085         10  DC-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 03908599
039087         10  FILLER                 PIC  X(03)   VALUE SPACES.    03908799
039088         10  DC-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 03908899
039090         10  FILLER                 PIC  X(05)   VALUE SPACES.    03909099
039091     05  GT-HDR-LINE.                                             03909199
039092         10  FILLER           PIC  X(012)  VALUE 'GRAND TOTALS'.  03909299
039093         10  FILLER           PIC  X(138)  VALUE SPACES.          03909399
039094*                                                                 03909499
039095     05  IN-DOORS-GRAND-TOTAL-LINE.                               03909599
039096         10  FILLER                 PIC  X(25)    VALUE           03909699
039100             'ALL  IN DOORS            '.                         03910099
039200         10  ID-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 03920099
039300         10  FILLER                 PIC  X(02)    VALUE SPACES.   03930099
039400         10  ID-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 03940099
039500         10  FILLER                 PIC  X(01)    VALUE SPACES.   03950099
039600         10  ID-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 03960099
039700         10  FILLER                 PIC  X(02)    VALUE SPACES.   03970099
039800         10  ID-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 03980099
039900         10  FILLER                 PIC  X(03)    VALUE SPACES.   03990099
040000         10  ID-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 04000099
040100         10  FILLER                 PIC  X(03)    VALUE SPACES.   04010099
040200         10  ID-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 04020099
040300         10  FILLER                 PIC  X(03)    VALUE SPACES.   04030099
040400         10  ID-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 04040099
040500         10  FILLER                 PIC  X(03)    VALUE SPACES.   04050099
040600         10  ID-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 04060099
040700         10  FILLER                 PIC  X(03)    VALUE SPACES.   04070099
040800         10  ID-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 04080099
040900         10  FILLER                 PIC  X(03)    VALUE SPACES.   04090099
041000         10  ID-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04100099
041100         10  FILLER                 PIC  X(03)    VALUE SPACES.   04110099
041200* CLP 06/05/13 PR#4158B START                                     04120099
041210         10  ID-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04121099
041220         10  FILLER                 PIC  X(02)    VALUE SPACES.   04122099
041230         10  ID-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04123099
041240         10  FILLER                 PIC  X(02)    VALUE SPACES.   04124099
041250* CLP 06/05/13 PR#4158B END                                       04125099
041251* DMH 07/2014 CONTROLLED FLOW COUNTS                              04125199
041252         10  ID-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04125299
041294         10  FILLER                 PIC  X(02)    VALUE SPACES.   04129499
041295         10  ID-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04129599
041297         10  FILLER                 PIC  X(02)    VALUE SPACES.   04129799
041298* DMH 07/2014 HAZARDOUS COUNTS                                    04129899
041299         10  ID-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04129999
041301         10  FILLER                 PIC  X(02)    VALUE SPACES.   04130199
041302         10  ID-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04130299
041304         10  FILLER                 PIC  X(02)    VALUE SPACES.   04130499
041305* OTHER COUNTS                                                    04130599
041306         10  ID-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 04130699
041308         10  FILLER                 PIC  X(01)    VALUE SPACES.   04130899
041309         10  ID-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 04130999
041311         10  FILLER                 PIC  X(02)    VALUE SPACES.   04131199
041320         10  ID-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04132099
041400         10  FILLER                 PIC  X(06)    VALUE SPACES.   04140099
041500         10  ID-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 04150099
041600         10  FILLER                 PIC  X(05)    VALUE SPACES.   04160099
041700*SB 01/16/14 - BEGIN PR#5148D                                     04170099
041800         10  ID-TOT-RFID-AUDIT-CNT  PIC  ZZZ9    BLANK WHEN ZERO. 04180099
041900         10  FILLER                 PIC  X(04)    VALUE SPACES.   04190099
042000*SB 01/16/14 - END PR#5148D                                       04200099
042100         10  ID-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 04210099
042200         10  FILLER                 PIC  X(03)    VALUE SPACES.   04220099
042300         10  ID-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 04230099
042400         10  FILLER                 PIC  X(03)    VALUE SPACES.   04240099
042500         10  ID-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 04250099
042600         10  FILLER                 PIC  X(05)    VALUE SPACES.   04260099
042700*                                                                 04270099
042800     05  YARD-GRAND-TOTAL-LINE.                                   04280099
042900         10  FILLER                 PIC  X(25)    VALUE           04290099
043000             'ALL  YARD                '.                         04300099
043100         10  YD-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 04310099
043200         10  FILLER                 PIC  X(02)    VALUE SPACES.   04320099
043300         10  YD-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 04330099
043400         10  FILLER                 PIC  X(01)    VALUE SPACES.   04340099
043500         10  YD-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 04350099
043600         10  FILLER                 PIC  X(02)    VALUE SPACES.   04360099
043700         10  YD-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 04370099
043800         10  FILLER                 PIC  X(03)    VALUE SPACES.   04380099
043900         10  YD-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 04390099
044000         10  FILLER                 PIC  X(03)    VALUE SPACES.   04400099
044010         10  YD-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 04401099
044020         10  FILLER                 PIC  X(03)    VALUE SPACES.   04402099
044030         10  YD-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 04403099
044040         10  FILLER                 PIC  X(03)    VALUE SPACES.   04404099
044050         10  YD-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 04405099
044060         10  FILLER                 PIC  X(03)    VALUE SPACES.   04406099
044070         10  YD-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 04407099
044080         10  FILLER                 PIC  X(03)    VALUE SPACES.   04408099
044090         10  YD-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04409099
044100         10  FILLER                 PIC  X(03)    VALUE SPACES.   04410099
044200* CLP 06/05/13 PR#4158B START                                     04420099
044300         10  YD-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04430099
044400         10  FILLER                 PIC  X(02)    VALUE SPACES.   04440099
044500         10  YD-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04450099
044600         10  FILLER                 PIC  X(02)    VALUE SPACES.   04460099
044610* CLP 06/05/13 PR#4158B END                                       04461099
044611* DMH 07/2014 CONTROLLED FLOW COUNTS                              04461199
044612         10  YD-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04461299
044614         10  FILLER                 PIC  X(02)    VALUE SPACES.   04461499
044615         10  YD-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04461599
044617         10  FILLER                 PIC  X(02)    VALUE SPACES.   04461799
044618* DMH 07/2014 HAZARDOUS COUNTS                                    04461899
044619         10  YD-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04461999
044621         10  FILLER                 PIC  X(02)    VALUE SPACES.   04462199
044622         10  YD-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04462299
044624         10  FILLER                 PIC  X(02)    VALUE SPACES.   04462499
044625* OTHER                                                           04462599
044626         10  YD-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 04462699
044630         10  FILLER                 PIC  X(01)    VALUE SPACES.   04463099
044640         10  YD-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 04464099
044650         10  FILLER                 PIC  X(02)    VALUE SPACES.   04465099
044660         10  YD-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04466099
044670         10  FILLER                 PIC  X(06)    VALUE SPACES.   04467099
044680         10  YD-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 04468099
044690         10  FILLER                 PIC  X(05)    VALUE SPACES.   04469099
044700*SB 01/16/14 - BEGIN PR#5148D                                     04470099
044800         10  YD-TOT-RFID-AUDIT-CNT  PIC  ZZZ9    BLANK WHEN ZERO. 04480099
044900         10  FILLER                 PIC  X(04)    VALUE SPACES.   04490099
045000*SB 01/16/14 - END PR#5148D                                       04500099
045100         10  YD-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 04510099
045200         10  FILLER                 PIC  X(03)   VALUE SPACES.    04520099
045300         10  YD-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 04530099
045400         10  FILLER                 PIC  X(03)   VALUE SPACES.    04540099
045500         10  YD-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 04550099
045600         10  FILLER                 PIC  X(05)   VALUE SPACES.    04560099
045700*                                                                 04570099
045800     05  ENROUTE-GRAND-TOTAL-LINE.                                04580099
045900         10  FILLER                 PIC  X(25)    VALUE           04590099
046000             'ALL  ENROUTE             '.                         04600099
046100         10  ER-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 04610099
046200         10  FILLER                 PIC  X(02)    VALUE SPACES.   04620099
046300         10  ER-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 04630099
046400         10  FILLER                 PIC  X(01)    VALUE SPACES.   04640099
046500         10  ER-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 04650099
046600         10  FILLER                 PIC  X(02)    VALUE SPACES.   04660099
046700         10  ER-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 04670099
046800         10  FILLER                 PIC  X(03)    VALUE SPACES.   04680099
046900         10  ER-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 04690099
047000         10  FILLER                 PIC  X(03)    VALUE SPACES.   04700099
047100         10  ER-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 04710099
047200         10  FILLER                 PIC  X(03)    VALUE SPACES.   04720099
047300         10  ER-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 04730099
047400         10  FILLER                 PIC  X(03)    VALUE SPACES.   04740099
047500         10  ER-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 04750099
047600         10  FILLER                 PIC  X(03)    VALUE SPACES.   04760099
047700         10  ER-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 04770099
047800         10  FILLER                 PIC  X(03)    VALUE SPACES.   04780099
047900         10  ER-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04790099
048000         10  FILLER                 PIC  X(03)    VALUE SPACES.   04800099
048001* CLP 06/05/13 PR#4158B START                                     04800199
048002         10  ER-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04800299
048004         10  FILLER                 PIC  X(02)    VALUE SPACES.   04800499
048005         10  ER-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04800599
048007         10  FILLER                 PIC  X(02)    VALUE SPACES.   04800799
048008* CLP 06/05/13 PR#4158B END                                       04800899
048009* DMH 07/2014 CONTROLLED FLOW                                     04800999
048010         10  ER-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04801099
048011         10  FILLER                 PIC  X(02)    VALUE SPACES.   04801199
048012         10  ER-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 04801299
048013         10  FILLER                 PIC  X(02)    VALUE SPACES.   04801399
048014* DMH 07/2014 HAZARDOUS COUNT                                     04801499
048015         10  ER-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 04801599
048016         10  FILLER                 PIC  X(02)    VALUE SPACES.   04801699
048017         10  ER-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04801799
048018         10  FILLER                 PIC  X(02)    VALUE SPACES.   04801899
048019* OTHER                                                           04801999
048020         10  ER-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 04802099
048021         10  FILLER                 PIC  X(01)    VALUE SPACES.   04802199
048022         10  ER-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 04802299
048023         10  FILLER                 PIC  X(02)    VALUE SPACES.   04802399
048024         10  ER-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 04802499
048030         10  FILLER                 PIC  X(06)    VALUE SPACES.   04803099
048040         10  ER-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 04804099
048050         10  FILLER                 PIC  X(05)    VALUE SPACES.   04805099
048060*SB 01/16/14 - BEGIN PR#5148D                                     04806099
048070         10  ER-TOT-RFID-AUDIT-CNT  PIC  ZZZ9    BLANK WHEN ZERO. 04807099
048080         10  FILLER                 PIC  X(04)    VALUE SPACES.   04808099
048090*SB 01/16/14 - END PR#5148D                                       04809099
048100         10  ER-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 04810099
048200         10  FILLER                 PIC  X(03)    VALUE SPACES.   04820099
048300         10  ER-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 04830099
048400         10  FILLER                 PIC  X(03)    VALUE SPACES.   04840099
048500         10  ER-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 04850099
048600         10  FILLER                 PIC  X(05)    VALUE SPACES.   04860099
048700*                                                                 04870099
048800     05  PCKSLPS-HANGING-GRAND-TOT-LINE.                          04880099
048900         10  FILLER                 PIC  X(25)    VALUE           04890099
049000             'ALL  PACKSLIPS HANGING   '.                         04900099
049100         10  FILLER                 PIC  X(07)    VALUE SPACES.   04910099
049200         10  PH-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 04920099
049300         10  FILLER                 PIC  X(01)    VALUE SPACES.   04930099
049400         10  PH-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 04940099
049500         10  FILLER                 PIC  X(02)    VALUE SPACES.   04950099
049600         10  PH-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 04960099
049700         10  FILLER                 PIC  X(03)    VALUE SPACES.   04970099
049800*                                                                 04980099
049900     05  FINAL-GRAND-TOTAL-LINE.                                  04990099
050000         10  FILLER                 PIC  X(25)    VALUE           05000099
050100             'TOTALS                '.                            05010099
050200         10  FG-TOT-TRLR-CNT        PIC  ZZZZ9   BLANK WHEN ZERO. 05020099
050300         10  FILLER                 PIC  X(02)    VALUE SPACES.   05030099
050400         10  FG-TOT-POS             PIC  ZZZZ9   BLANK WHEN ZERO. 05040099
050500         10  FILLER                 PIC  X(01)    VALUE SPACES.   05050099
050600         10  FG-TOT-CTNS            PIC  ZZZZZZ9 BLANK WHEN ZERO. 05060099
050700         10  FILLER                 PIC  X(02)    VALUE SPACES.   05070099
050800         10  FG-TOT-UNITS           PIC ZZZZZZZ9 BLANK WHEN ZERO. 05080099
050900         10  FILLER                 PIC  X(03)    VALUE SPACES.   05090099
051000         10  FG-TOT-Q-CTNS          PIC  ZZZZ9   BLANK WHEN ZERO. 05100099
051100         10  FILLER                 PIC  X(03)    VALUE SPACES.   05110099
051200         10  FG-TOT-RFID-Q-CTNS     PIC  ZZZZ9   BLANK WHEN ZERO. 05120099
051300         10  FILLER                 PIC  X(03)    VALUE SPACES.   05130099
051400         10  FG-TOT-COMBO-Q-CTNS    PIC  ZZZZZ9  BLANK WHEN ZERO. 05140099
051500         10  FILLER                 PIC  X(03)    VALUE SPACES.   05150099
051600         10  FG-TOT-U-CTNS          PIC  ZZZZZ9  BLANK WHEN ZERO. 05160099
051700         10  FILLER                 PIC  X(03)    VALUE SPACES.   05170099
051800         10  FG-TOT-CRSDK-CTNS      PIC  ZZZZZZ9 BLANK WHEN ZERO. 05180099
051900         10  FILLER                 PIC  X(03)    VALUE SPACES.   05190099
052000         10  FG-TOT-P2L-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 05200099
052100         10  FILLER                 PIC  X(03)    VALUE SPACES.   05210099
052200* CLP 06/05/13 PR#4158B START                                     05220099
052300         10  FG-TOT-RFID-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 05230099
052400         10  FILLER                 PIC  X(02)    VALUE SPACES.   05240099
052500         10  FG-TOT-RFID-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 05250099
052600         10  FILLER                 PIC  X(02)    VALUE SPACES.   05260099
052700* CLP 06/05/13 PR#4158B END                                       05270099
052710* DMH 07/2014 CONTROLLED FLOW                                     05271099
052720         10  FG-TOT-CNTL-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 05272099
052730         10  FILLER                 PIC  X(02)    VALUE SPACES.   05273099
052740         10  FG-TOT-CNTL-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO. 05274099
052750         10  FILLER                 PIC  X(02)    VALUE SPACES.   05275099
052760* DMH 07/2014 HAZARDOUS COUNTS                                    05276099
052770         10  FG-TOT-HAZ-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO. 05277099
052780         10  FILLER                 PIC  X(02)    VALUE SPACES.   05278099
052790         10  FG-TOT-HAZ-UNITS       PIC  ZZZZZ9  BLANK WHEN ZERO. 05279099
052791         10  FILLER                 PIC  X(02)    VALUE SPACES.   05279199
052792* OTHER                                                           05279299
052800         10  FG-TOT-PROC-CNT        PIC  ZZZZZ9  BLANK WHEN ZERO. 05280099
052900         10  FILLER                 PIC  X(01)    VALUE SPACES.   05290099
053000         10  FG-TOT-TRBL-CTNS       PIC  ZZZZ9   BLANK WHEN ZERO. 05300099
053100         10  FILLER                 PIC  X(02)    VALUE SPACES.   05310099
053200         10  FG-TOT-WSTD-CTNS       PIC  ZZZZZ9  BLANK WHEN ZERO. 05320099
053300         10  FILLER                 PIC  X(06)    VALUE SPACES.   05330099
053400         10  FG-TOT-AUDIT-CNT       PIC  ZZZ9    BLANK WHEN ZERO. 05340099
053500         10  FILLER                 PIC  X(05)    VALUE SPACES.   05350099
053600*SB 01/16/14 - BEGIN PR#5148D                                     05360099
053700         10  FG-TOT-RFID-AUDIT-CNT  PIC  ZZZ9    BLANK WHEN ZERO. 05370099
053800         10  FILLER                 PIC  X(04)    VALUE SPACES.   05380099
053900*SB 01/16/14 - END PR#5148D                                       05390099
054000         10  FG-TOT-EFC-POS         PIC  ZZZZ9   BLANK WHEN ZERO. 05400099
054100         10  FILLER                 PIC  X(03)    VALUE SPACES.   05410099
054200         10  FG-TOT-EFC-CTNS        PIC  ZZZZZZ9 BLANK WHEN ZERO. 05420099
054300         10  FILLER                 PIC  X(03)    VALUE SPACES.   05430099
054400         10  FG-TOT-EFC-UNITS       PIC  ZZZZZZ9 BLANK WHEN ZERO. 05440099
054500         10  FILLER                 PIC  X(05)    VALUE SPACES.   05450099
054600*                                                                 05460099
054700     05  END-OF-REPORT-LINE.                                      05470099
054800         10  FILLER                  PIC  X(44)    VALUE SPACES.  05480099
054900         10  FILLER                  PIC  X(45)    VALUE          05490099
055000             '*******   E N D   O F   R E P O R T   *******'.     05500099
055100         10  FILLER                  PIC  X(43)    VALUE SPACES.  05510099
055200*                                                                 05520099
055300     05  NO-DATA-TO-REPORT-LINE.                                  05530099
055400         10  FILLER                  PIC  X(40)    VALUE SPACES.  05540099
055500         10  FILLER                  PIC  X(52)    VALUE          05550099
055600         '*******  N O   D A T A   T O   R E P O R T   *******'.  05560099
055700         10  FILLER                  PIC  X(40)    VALUE SPACES.  05570099
055800/                                                                 05580099
055900******************************************************            05590099
056000*  XLT00010 - DC LOCATION TABLE                      *            05600099
056100******************************************************            05610099
056200     EXEC SQL                                                     05620099
056300          INCLUDE XLT00010                                        05630099
056400     END-EXEC.                                                    05640099
056500/                                                                 05650099
056600******************************************************            05660099
056700*  DB2 AREA FOR COMMUNICATIONS                       *            05670099
056800******************************************************            05680099
056900     EXEC SQL                                                     05690099
057000          INCLUDE SQLCA                                           05700099
057100     END-EXEC.                                                    05710099
057200                                                                  05720099
057300     COPY SQLCA2.                                                 05730099
057400/                                                                 05740099
057500 PROCEDURE DIVISION.                                              05750099
057600                                                                  05760099
057700     DISPLAY '*** PROGRAM PCKRP035 BEGINS ***********'.           05770099
057800******************************************************            05780099
057900* 0000-MAINLINE.                                     *            05790099
058000******************************************************            05800099
058100 0000-MAINLINE.                                                   05810099
058200                                                                  05820099
058300     PERFORM 0010-INITIALIZATION.                                 05830099
058400                                                                  05840099
058500     PERFORM 1000-PROCESS-INPUT                                   05850099
058600        THRU 1000-PROCESS-INPUT-EXIT                              05860099
058700         UNTIL ( PS-END-OF-INPUT ).                               05870099
058800                                                                  05880099
058900     PERFORM 0020-END-PROGRAM.                                    05890099
059000                                                                  05900099
059100     DISPLAY '*** PROGRAM PCKRP035 ENDS   ***********'.           05910099
059200     GOBACK.                                                      05920099
059300/                                                                 05930099
059400******************************************************            05940099
059500* 0010-INITIALIZATION.                               *            05950099
059600******************************************************            05960099
059700 0010-INITIALIZATION.                                             05970099
059800                                                                  05980099
059900     OPEN INPUT  INPUT01-FILE                                     05990099
060000          OUTPUT REPORT-FILE.                                     06000099
060100                                                                  06010099
060200     MOVE FUNCTION CURRENT-DATE (1:8) TO PV-TODAYS-DATE.          06020099
060300     ACCEPT PV-TODAYS-TIME   FROM TIME.                           06030099
060400                                                                  06040099
060500* CLP 06/05/13 PR#4158B START                                     06050099
060600     MOVE PV-TODAYS-DATE-MM      TO DP250O-RUN-MONTH.             06060099
060700     MOVE PV-TODAYS-DATE-DD      TO DP250O-RUN-DAY.               06070099
060800     MOVE PV-TODAYS-DATE-CCYY    TO DP250O-RUN-YEAR.              06080099
060900     MOVE PV-TODAYS-TIME-HH      TO DP250O-RUN-HOUR.              06090099
061000     MOVE PV-TODAYS-TIME-MM      TO DP250O-RUN-MINUTE.            06100099
061100     MOVE PC-PROGRAM-NAME        TO DP250O-PROGRAM-NAME.          06110099
061200     MOVE PC-REPORT-NBR          TO DP250O-REPORT-NUMBER.         06120099
061300* CLP 06/05/13 PR#4158B END                                       06130099
061400                                                                  06140099
061500     PERFORM 9050-REPORT-HEADERS.                                 06150099
061600/                                                                 06160099
061700******************************************************            06170099
061800* 0020-END-PROGRAM.                                  *            06180099
061900******************************************************            06190099
062000 0020-END-PROGRAM.                                                06200099
062100                                                                  06210099
062200     PERFORM 9010-DC-HEADER.                                      06220099
062300     PERFORM 4000-STATUS-GROUP-BREAK                              06230099
062400             VARYING PV-IDX FROM 1 BY 1                           06240099
062500             UNTIL PV-IDX > 4.                                    06250099
062600     PERFORM 5000-DC-LOCATION-BREAK.                              06260099
062700     PERFORM 6000-GRAND-TOTALS.                                   06270099
062800                                                                  06280099
062900     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           06290099
063000         PERFORM 9050-REPORT-HEADERS                              06300099
063100     END-IF.                                                      06310099
063200                                                                  06320099
063300     IF ( PS-FIRST-TIME )                                         06330099
063400         WRITE REPORT-RECORD FROM NO-DATA-TO-REPORT-LINE          06340099
063500              AFTER ADVANCING 2 LINES                             06350099
063600     END-IF.                                                      06360099
063700                                                                  06370099
063800     WRITE REPORT-RECORD FROM END-OF-REPORT-LINE                  06380099
063900          AFTER ADVANCING 3 LINES.                                06390099
064000                                                                  06400099
064100     MOVE PV-IN-RECS TO PV-IN-RECZ.                               06410099
064200                                                                  06420099
064300     DISPLAY '***                                   '.            06430099
064400     DISPLAY '*** TOTAL INPUT RECS READ:  ' PV-IN-RECZ.           06440099
064500     DISPLAY '***                                   '.            06450099
064600                                                                  06460099
064700     CLOSE INPUT01-FILE                                           06470099
064800           REPORT-FILE.                                           06480099
064900/                                                                 06490099
065000******************************************************            06500099
065100* 1000-PROCESS-INPUT.                                *            06510099
065200******************************************************            06520099
065300 1000-PROCESS-INPUT.                                              06530099
065400                                                                  06540099
065500     READ INPUT01-FILE INTO PC068-RECORD-LAYOUT                   06550099
065600         AT END MOVE 'Y' TO PS-END-OF-INPUT-SW                    06560099
065700                GO TO 1000-PROCESS-INPUT-EXIT.                    06570099
065800     ADD 1 TO PV-IN-RECS.                                         06580099
065900                                                                  06590099
066000     IF ( PS-FIRST-TIME )                                         06600099
066100         MOVE 'N' TO PS-FIRST-TIME-SW                             06610099
066200         MOVE PC068-OPER-UNT-ID     TO PV-DC-LOCATION             06620099
066300                                       DC-HDR-LOC-ID              06630099
066400                                       SG-TOT-LOC-ID              06640099
066500         MOVE PC068-PROCESS-GROUP   TO PV-PROC-GROUP              06650099
066600         MOVE PC068-SORT-BY-LOC-IND TO PV-SLOC-IND                06660099
066700         PERFORM 2000-VALIDATE-DC                                 06670099
066800         PERFORM 9040-PAGE-HEADERS                                06680099
066900     END-IF.                                                      06690099
067000                                                                  06700099
067100     IF PC068-OPER-UNT-ID NOT = PV-DC-LOCATION                    06710099
067200         PERFORM 9010-DC-HEADER                                   06720099
067300         PERFORM 4000-STATUS-GROUP-BREAK                          06730099
067400                 VARYING PV-IDX FROM 1 BY 1                       06740099
067500                 UNTIL PV-IDX > 4                                 06750099
067600         PERFORM 5000-DC-LOCATION-BREAK                           06760099
067700         INITIALIZE PV-SG-ACCUM-TABLE                             06770099
067800         MOVE 0 TO PV-EFC-NBR                                     06780099
067900         MOVE PC068-OPER-UNT-ID     TO PV-DC-LOCATION             06790099
068000                                       DC-HDR-LOC-ID              06800099
068100                                       SG-TOT-LOC-ID              06810099
068200         MOVE PC068-PROCESS-GROUP   TO PV-PROC-GROUP              06820099
068300         MOVE PC068-SORT-BY-LOC-IND TO PV-SLOC-IND                06830099
068400         PERFORM 2000-VALIDATE-DC                                 06840099
068500     END-IF.                                                      06850099
068600                                                                  06860099
068700     EVALUATE PC068-SORT-BY-LOC-IND                               06870099
068800         WHEN '1'                                                 06880099
068900             SET PV-IDX TO 1                                      06890099
069000         WHEN '2'                                                 06900099
069100             SET PV-IDX TO 2                                      06910099
069200         WHEN '3'                                                 06920099
069300             SET PV-IDX TO 3                                      06930099
069400         WHEN 'X'                                                 06940099
069500             SET PV-IDX TO 4                                      06950099
069600         WHEN OTHER                                               06960099
069700             SET PV-IDX TO 1                                      06970099
069800     END-EVALUATE.                                                06980099
069900                                                                  06990099
070000     IF PC068-STORE-ZONE = 'REPLE'                                07000099
070100         PERFORM 1500-ACCUM-REPLEN-PROC-CNTS                      07010099
070200     ELSE                                                         07020099
070300         IF PC068-SORT-BY-LOC-IND = 'X'                           07030099
070400             PERFORM 3200-UPDATE-PKSLIP-TOTALS                    07040099
070500         ELSE                                                     07050099
070600         IF PC068-STORE-ZONE = SPACES                             07060099
070700             PERFORM 3000-UPDATE-TOTALS                           07070099
070800         ELSE                                                     07080099
070900             GO TO 1000-PROCESS-INPUT-EXIT                        07090099
071000         END-IF                                                   07100099
071100         END-IF                                                   07110099
071200     END-IF.                                                      07120099
071300                                                                  07130099
071400                                                                  07140099
071500 1000-PROCESS-INPUT-EXIT.                                         07150099
071600     EXIT.                                                        07160099
071700/                                                                 07170099
071800******************************************************            07180099
071900 1500-ACCUM-REPLEN-PROC-CNTS.                                     07190099
072000******************************************************            07200099
072100     ADD PC068-REPLEN-CARTON-CNT TO PV-SG-PROC-CNT-TOT(PV-IDX).   07210099
072200     SET PS-REPLEN-DATA-FOUND TO TRUE.                            07220099
072300                                                                  07230099
072400/                                                                 07240099
072500******************************************************            07250099
072600 2000-VALIDATE-DC.                                                07260099
072700******************************************************            07270099
072800                                                                  07280099
072900     MOVE PV-DC-LOCATION TO XLT00010-LOC-NBR.                     07290099
073000                                                                  07300099
073100     EXEC SQL                                                     07310099
073200         SELECT A.LOC_NM                                          07320099
073300           INTO :XLT00010-LOC-NM                                  07330099
073400           FROM XLT_LOC A                                         07340099
073500          WHERE A.LOC_NBR     = :XLT00010-LOC-NBR                 07350099
073600           WITH UR                                                07360099
073700     END-EXEC.                                                    07370099
073800                                                                  07380099
073900     EVALUATE TRUE                                                07390099
074000       WHEN SQLCODE = ZERO                                        07400099
074100           MOVE XLT00010-LOC-NM TO DC-HDR-NAME                    07410099
074200       WHEN OTHER                                                 07420099
074300           MOVE SPACES          TO DC-HDR-NAME                    07430099
074400     END-EVALUATE.                                                07440099
074500/                                                                 07450099
074600******************************************************            07460099
074700 2500-CHECK-STATUS-LOC.                                           07470099
074800******************************************************            07480099
074900                                                                  07490099
075000     EVALUATE TRUE                                                07500099
075100       WHEN PC068-SORT-BY-LOC-IND = '1'                           07510099
075200           MOVE 'Y'             TO PS-IN-DOORS-SW                 07520099
075300       WHEN PC068-SORT-BY-LOC-IND = '2'                           07530099
075400           MOVE 'Y'             TO PS-YARD-SW                     07540099
075500       WHEN PC068-SORT-BY-LOC-IND = '3'                           07550099
075600           MOVE 'Y'             TO PS-ENROUTE-SW                  07560099
075700       WHEN PC068-SORT-BY-LOC-IND = 'X'                           07570099
075800           MOVE 'Y'             TO PS-PCKSLIPSH-SW                07580099
075900     END-EVALUATE.                                                07590099
076000                                                                  07600099
076100******************************************************            07610099
076200 3000-UPDATE-TOTALS.                                              07620099
076300******************************************************            07630099
076400                                                                  07640099
076500     PERFORM 3100-CALC-PERCENT-SCANNED.                           07650099
076600     IF PV-HOLD-PCNT-SCANNED = 100                                07660099
076700         CONTINUE                                                 07670099
076800     ELSE                                                         07680099
076900         PERFORM 2500-CHECK-STATUS-LOC                            07690099
077000         MOVE PC068-SORT-BY-LOC-IND     TO PV-SG-LOC-IND(PV-IDX)  07700099
077100         ADD +1                         TO PV-SG-TRLR-CNT(PV-IDX) 07710099
077200         ADD PC068-PO-CNT-TRLR          TO PV-SG-PO-TOT(PV-IDX)   07720099
077300         ADD PC068-TOT-CTN-CNT          TO PV-SG-CTNS-TOT(PV-IDX) 07730099
077400* CLP 06/05/13 PR#4158B START                                     07740099
077500         ADD PC068-RFID-CTN-CNT   TO PV-SG-RFID-CTNS-TOT(PV-IDX)  07750099
077600         ADD PC068-RFID-UNT-CNT   TO PV-SG-RFID-UNTS-TOT(PV-IDX)  07760099
077700* CLP 06/05/13 PR#4158B END                                       07770099
077710* DMH 07/2014 CONTROLLED FLOW                                     07771099
077711* DMH 9/30/14 - BEGIN                                             07771199
077712         EVALUATE TRUE                                            07771299
077713             WHEN PC068-CNTL-FLOW-CTN-CNT NUMERIC                 07771399
077714                  CONTINUE                                        07771499
077715             WHEN OTHER                                           07771599
077716                  MOVE  ZERO  TO  PC068-CNTL-FLOW-CTN-CNT         07771699
077717                                  PC068-CNTL-FLOW-UNT-CNT         07771799
077718         END-EVALUATE                                             07771899
077719* DMH 9/30/14 - BEGIN                                             07771999
077720                                                                  07772099
077721         ADD PC068-CNTL-FLOW-CTN-CNT                              07772199
077722                                  TO PV-SG-CNTL-CTNS-TOT(PV-IDX)  07772299
077730         ADD PC068-CNTL-FLOW-UNT-CNT                              07773099
077731                                  TO PV-SG-CNTL-UNTS-TOT(PV-IDX)  07773199
077740* DMH 07/2014 HAZARDOUS                                           07774099
077741* DMH 9/30/14 - BEGIN                                             07774199
077742         EVALUATE TRUE                                            07774299
077744             WHEN PC068-HAZ-CTN-CNT NUMERIC                       07774499
077745                  CONTINUE                                        07774599
077746             WHEN OTHER                                           07774699
077747                  MOVE  ZERO  TO  PC068-HAZ-CTN-CNT               07774799
077748                                  PC068-HAZ-UNT-CNT               07774899
077749         END-EVALUATE                                             07774999
077750* DMH 9/30/14 - BEGIN                                             07775099
077751         ADD PC068-HAZ-CTN-CNT    TO PV-SG-HAZ-CTNS-TOT(PV-IDX)   07775199
077760         ADD PC068-HAZ-UNT-CNT    TO PV-SG-HAZ-UNTS-TOT(PV-IDX)   07776099
077800*SB 01/16/14 - BEGIN PR#5148D                                     07780099
077900         ADD PC068-RFID-AUD-CRTNS-TRLR  TO PV-SG-RFID-Q-CTNS-TOT  07790099
078000                                           (PV-IDX)               07800099
078100*        ADD PC068-RFID-AUD-CRTNS-TRLR-U TO PV-SG-RFID-U-CTNS-TOT 07810099
078200*                                          (PV-IDX)               07820099
078300         ADD PC068-COMB-AUD-CRTNS-TRLR  TO PV-SG-COMBO-Q-CTNS-TOT 07830099
078400                                           (PV-IDX)               07840099
078410         ADD PC068-RFID-AUD-CRTNS-100-TRLR    TO                  07841099
078420                     PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)          07842099
078430*SB 01/16/14 - END PR#5148D                                       07843099
078440         IF PC068-UNIT-CNT-TRLR NUMERIC                           07844099
078450             ADD PC068-UNIT-CNT-TRLR    TO PV-SG-UNTS-TOT(PV-IDX) 07845099
078460         END-IF                                                   07846099
078470         ADD PC068-AUD-CRTNS-TRLR       TO PV-SG-Q-CTNS-TOT       07847099
078480                                           (PV-IDX)               07848099
078490         ADD PC068-AUD-CRTNS-TRLR-U     TO PV-SG-U-CTNS-TOT       07849099
078500                                           (PV-IDX)               07850099
078600         ADD PC068-XDCK-CTN-CNT         TO PV-SG-CRSDK-CTNS-TOT   07860099
078700                                           (PV-IDX)               07870099
078800         ADD PC068-P2L-CTN-CNT          TO PV-SG-P2L-CTNS-TOT     07880099
078900                                           (PV-IDX)               07890099
079000         ADD PC068-TRBLE-CTN-CNT-TRLR   TO PV-SG-TRBL-CTNS-TOT    07900099
079100                                           (PV-IDX)               07910099
079200         ADD PC068-SET-DIVERT-CNT-TRLR  TO PV-SG-SET-DVT-CTNS-TOT 07920099
079300                                           (PV-IDX)               07930099
079400         ADD PC068-AUD-CRTNS-100-TRLR   TO PV-SG-PCNT-AUD-CTN-TOT 07940099
079500                                           (PV-IDX)               07950099
079600         IF PC068-EFC-NBR > 0                                     07960099
079700             ADD PC068-EFC-PO-CNT-TRLR  TO PV-SG-EFC-PO-TOT       07970099
079800                                           (PV-IDX)               07980099
079900             ADD PC068-EFC-CTN-CNT-TRLR TO PV-SG-EFC-CTNS-TOT     07990099
080000                                           (PV-IDX)               08000099
080100             ADD PC068-EFC-UNT-CNT-TRLR TO PV-SG-EFC-UNTS-TOT     08010099
080200                                           (PV-IDX)               08020099
080300             IF PC068-EFC-NBR > 0                                 08030099
080400                 MOVE PC068-EFC-NBR     TO PV-EFC-NBR             08040099
080500             END-IF                                               08050099
080600         END-IF                                                   08060099
080700     END-IF.                                                      08070099
080800     SET PS-REPLEN-DATA-NO    TO TRUE.                            08080099
080900                                                                  08090099
081000******************************************************            08100099
081100 3100-CALC-PERCENT-SCANNED.                                       08110099
081200******************************************************            08120099
081300                                                                  08130099
081400     INITIALIZE PV-PCNT-FIELD.                                    08140099
081500     IF PC068-CRTNS-TO-SCAN-TRLR > ZERO AND                       08150099
081600        PC068-TOT-CTN-CNT > ZERO                                  08160099
081700         COMPUTE PV-PCNT-FIELD =                                  08170099
081800              ((PC068-TOT-CTN-CNT - PC068-CRTNS-TO-SCAN-TRLR) /   08180099
081900                PC068-TOT-CTN-CNT) * 100                          08190099
082000         MOVE PV-PCNT-FIELD TO PV-HOLD-PCNT-SCANNED               08200099
082100     ELSE                                                         08210099
082200         IF PC068-TOT-CTN-CNT = 0                                 08220099
082300             MOVE 0         TO PV-HOLD-PCNT-SCANNED               08230099
082400         ELSE                                                     08240099
082500             MOVE 100       TO PV-HOLD-PCNT-SCANNED               08250099
082600     END-IF.                                                      08260099
082700     IF PS-REPLEN-DATA-FOUND                                      08270099
082800         MOVE 0 TO PV-HOLD-PCNT-SCANNED                           08280099
082900     END-IF.                                                      08290099
083000                                                                  08300099
083100******************************************************            08310099
083200 3200-UPDATE-PKSLIP-TOTALS.                                       08320099
083300******************************************************            08330099
083400                                                                  08340099
083500     PERFORM 2500-CHECK-STATUS-LOC.                               08350099
083600     MOVE PC068-SORT-BY-LOC-IND     TO PV-SG-LOC-IND(PV-IDX).     08360099
083610     ADD +1                         TO PV-SG-TRLR-CNT(PV-IDX).    08361099
083620     ADD PC068-PO-CNT-TRLR          TO PV-SG-PO-TOT(PV-IDX).      08362099
083630     ADD PC068-TOT-CTN-CNT          TO PV-SG-CTNS-TOT(PV-IDX).    08363099
083640     IF PC068-UNIT-CNT-TRLR NUMERIC                               08364099
083650         ADD PC068-UNIT-CNT-TRLR    TO PV-SG-UNTS-TOT(PV-IDX)     08365099
083660     END-IF.                                                      08366099
083670******************************************************            08367099
083680 4000-STATUS-GROUP-BREAK.                                         08368099
083690******************************************************            08369099
083700                                                                  08370099
083800* ADD STATUS/GROUP TOTALS TO DC TOTALS                            08380099
083900     IF PV-SG-TRLR-CNT(PV-IDX) > 0                                08390099
084000       PERFORM 4010-DETERMINE-SG-DESCRIPTION                      08400099
084100       IF  PV-SG-LOC-IND(PV-IDX) = 'X'                            08410099
084200           CONTINUE                                               08420099
084300       ELSE                                                       08430099
084400           ADD PV-SG-TRLR-CNT(PV-IDX)   TO PV-DC-TRLR-CNT         08440099
084410       END-IF                                                     08441099
084411* CLP 06/05/13 PR#4158B START                                     08441199
084412       ADD PV-SG-RFID-CTNS-TOT(PV-IDX) TO PV-DC-RFID-CTNS-TOT     08441299
084413       ADD PV-SG-RFID-UNTS-TOT(PV-IDX) TO PV-DC-RFID-UNTS-TOT     08441399
084414* CLP 06/05/13 PR#4158B END                                       08441499
084415* DMH 07/2014 CONTROLLED FLOW                                     08441599
084416       ADD PV-SG-CNTL-CTNS-TOT(PV-IDX) TO PV-DC-CNTL-CTNS-TOT     08441699
084417       ADD PV-SG-CNTL-UNTS-TOT(PV-IDX) TO PV-DC-CNTL-UNTS-TOT     08441799
084418* DMH 07/2014 HAZARDOUS COUNTS                                    08441899
084419       ADD PV-SG-HAZ-CTNS-TOT(PV-IDX) TO PV-DC-HAZ-CTNS-TOT       08441999
084420       ADD PV-SG-HAZ-UNTS-TOT(PV-IDX) TO PV-DC-HAZ-UNTS-TOT       08442099
084421*SB 01/16/14 - BEGIN PR#5148D                                     08442199
084422       ADD PV-SG-RFID-Q-CTNS-TOT(PV-IDX)                          08442299
084423                                    TO PV-DC-RFID-Q-CTNS-TOT      08442399
084424*      ADD PV-SG-RFID-U-CTNS-TOT(PV-IDX)                          08442499
084425*                                   TO PV-DC-RFID-U-CTNS-TOT      08442599
084426       ADD PV-SG-COMBO-Q-CTNS-TOT(PV-IDX)                         08442699
084430                                    TO PV-DC-COMBO-Q-CTNS-TOT     08443099
084440       ADD PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)                    08444099
084450                                TO PV-DC-RFID-PCNT-AUD-CTN-TOT    08445099
084460*SB 01/16/14 - END PR#5148D                                       08446099
084470       ADD PV-SG-PO-TOT(PV-IDX)     TO PV-DC-PO-TOT               08447099
084480       ADD PV-SG-CTNS-TOT(PV-IDX)   TO PV-DC-CTNS-TOT             08448099
084490       ADD PV-SG-UNTS-TOT(PV-IDX)   TO PV-DC-UNTS-TOT             08449099
084500       ADD PV-SG-Q-CTNS-TOT(PV-IDX) TO PV-DC-Q-CTNS-TOT           08450099
084600       ADD PV-SG-U-CTNS-TOT(PV-IDX)                               08460099
084700                                TO PV-DC-U-CTNS-TOT               08470099
084800       ADD PV-SG-CRSDK-CTNS-TOT(PV-IDX)                           08480099
084900                                TO PV-DC-CRSDK-CTNS-TOT           08490099
085000       ADD PV-SG-P2L-CTNS-TOT(PV-IDX)                             08500099
085100                                TO PV-DC-P2L-CTNS-TOT             08510099
085200       ADD PV-SG-PROC-CNT-TOT(PV-IDX)                             08520099
085300                                TO PV-DC-PROC-CNT-TOT             08530099
085400       ADD PV-SG-TRBL-CTNS-TOT(PV-IDX)                            08540099
085500                                TO PV-DC-TRBL-CTNS-TOT            08550099
085600       ADD PV-SG-SET-DVT-CTNS-TOT(PV-IDX)                         08560099
085700                                TO PV-DC-SET-DVT-CTNS-TOT         08570099
085800       ADD PV-SG-PCNT-AUD-CTN-TOT(PV-IDX)                         08580099
085900                                TO PV-DC-PCNT-AUD-CTN-TOT         08590099
086000       ADD PV-SG-EFC-PO-TOT(PV-IDX)                               08600099
086100                                TO PV-DC-EFC-PO-TOT               08610099
086200       ADD PV-SG-EFC-CTNS-TOT(PV-IDX)                             08620099
086300                                TO PV-DC-EFC-CTNS-TOT             08630099
086400       ADD PV-SG-EFC-UNTS-TOT(PV-IDX)                             08640099
086500                                TO PV-DC-EFC-UNTS-TOT             08650099
086600                                                                  08660099
086700* DEPENDING UPON SORT LOC INDICATOR, ADD REC INTO GRAND TOTALS    08670099
086800       EVALUATE TRUE                                              08680099
086900         WHEN PV-SG-LOC-IND(PV-IDX) = '1'                         08690099
087000            PERFORM 4020-UPDATE-DOOR-GRAND-TOT                    08700099
087100         WHEN PV-SG-LOC-IND(PV-IDX) = '2'                         08710099
087200            PERFORM 4030-UPDATE-YARD-GRAND-TOT                    08720099
087300         WHEN PV-SG-LOC-IND(PV-IDX) = '3'                         08730099
087400            PERFORM 4040-UPDATE-ENROUTE-GRAND-TOT                 08740099
087500         WHEN PV-SG-LOC-IND(PV-IDX) = 'X'                         08750099
087600            PERFORM 4050-UPDATE-HANGPCK-GRAND-TOT                 08760099
087700       END-EVALUATE                                               08770099
087800                                                                  08780099
087900       IF ( PV-LINE-CNT > PV-LINE-LIMIT )                         08790099
088000         PERFORM 9050-REPORT-HEADERS                              08800099
088100         PERFORM 9040-PAGE-HEADERS                                08810099
088200       END-IF                                                     08820099
088300                                                                  08830099
088400* FORMAT AND PRINT STATUS/GROUP TOTAL LINE                        08840099
088500       IF  PV-SG-LOC-IND(PV-IDX) = 'X'                            08850099
088600           MOVE ZEROES                 TO SG-TOT-TRLR-CNT         08860099
088700       ELSE                                                       08870099
088710           MOVE PV-SG-TRLR-CNT(PV-IDX) TO SG-TOT-TRLR-CNT         08871099
088720       END-IF                                                     08872099
088730* CLP 06/05/13 PR#4158B START                                     08873099
088740       MOVE PV-SG-RFID-CTNS-TOT(PV-IDX) TO SG-TOT-RFID-CTNS       08874099
088750       MOVE PV-SG-RFID-UNTS-TOT(PV-IDX) TO SG-TOT-RFID-UNITS      08875099
088760* CLP 06/05/13 PR#4158B END                                       08876099
088761* DMH 07/2014 CONTROLLED FLOW                                     08876199
088762       MOVE PV-SG-CNTL-CTNS-TOT(PV-IDX) TO SG-TOT-CNTL-CTNS       08876299
088763       MOVE PV-SG-CNTL-UNTS-TOT(PV-IDX) TO SG-TOT-CNTL-UNITS      08876399
088764* DMH 07/2014 HAZARDOUS COUNTS                                    08876499
088765       MOVE PV-SG-HAZ-CTNS-TOT(PV-IDX) TO SG-TOT-HAZ-CTNS         08876599
088766       MOVE PV-SG-HAZ-UNTS-TOT(PV-IDX) TO SG-TOT-HAZ-UNITS        08876699
088770*SB 01/16/14 - BEGIN PR#5148D                                     08877099
088780       MOVE PV-SG-RFID-Q-CTNS-TOT(PV-IDX)                         08878099
088790                                 TO SG-TOT-RFID-Q-CTNS            08879099
088800*      MOVE PV-SG-RFID-U-CTNS-TOT(PV-IDX)                         08880099
088810*                                TO SG-TOT-RFID-U-CTNS            08881099
088811       MOVE PV-SG-COMBO-Q-CTNS-TOT(PV-IDX)                        08881199
088812                                 TO SG-TOT-COMBO-Q-CTNS           08881299
088813*SB 01/16/14 - END PR#5148D                                       08881399
088814       MOVE PV-SG-PO-TOT(PV-IDX)   TO SG-TOT-POS                  08881499
088815       MOVE PV-SG-CTNS-TOT(PV-IDX) TO SG-TOT-CTNS                 08881599
088816       MOVE PV-SG-UNTS-TOT(PV-IDX) TO SG-TOT-UNITS                08881699
088817       MOVE PV-SG-Q-CTNS-TOT(PV-IDX)                              08881799
088818                                 TO SG-TOT-Q-CTNS                 08881899
088819       MOVE PV-SG-U-CTNS-TOT(PV-IDX)                              08881999
088820                                 TO SG-TOT-U-CTNS                 08882099
088830       MOVE PV-SG-CRSDK-CTNS-TOT(PV-IDX)                          08883099
088840                                 TO SG-TOT-CRSDK-CTNS             08884099
088850       MOVE PV-SG-P2L-CTNS-TOT(PV-IDX)                            08885099
088860                                 TO SG-TOT-P2L-CTNS               08886099
088870       MOVE PV-SG-PROC-CNT-TOT(PV-IDX)                            08887099
088880                                 TO SG-TOT-PROC-CNT               08888099
088890       MOVE PV-SG-TRBL-CTNS-TOT(PV-IDX)                           08889099
088900                                 TO SG-TOT-TRBL-CTNS              08890099
089000       MOVE PV-SG-SET-DVT-CTNS-TOT(PV-IDX)                        08900099
089100                                 TO SG-TOT-WSTD-CTNS              08910099
089200       MOVE PV-SG-PCNT-AUD-CTN-TOT(PV-IDX)                        08920099
089300                                 TO SG-TOT-AUDIT-CNT              08930099
089400       MOVE PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)                   08940099
089500                                 TO SG-TOT-RFID-AUDIT-CNT         08950099
089600       MOVE PV-SG-EFC-PO-TOT(PV-IDX)                              08960099
089700                                 TO SG-TOT-EFC-POS                08970099
089800       MOVE PV-SG-EFC-CTNS-TOT(PV-IDX)                            08980099
089900                                 TO SG-TOT-EFC-CTNS               08990099
090000       MOVE PV-SG-EFC-UNTS-TOT(PV-IDX)                            09000099
090100                                 TO SG-TOT-EFC-UNITS              09010099
090200                                                                  09020099
090300       WRITE REPORT-RECORD FROM STATUS-GROUP-TOTAL-LINE           09030099
090400            AFTER ADVANCING 1 LINE                                09040099
090500                                                                  09050099
090600       ADD  +1 TO PV-LINE-CNT                                     09060099
090700                  PV-NBR-OF-LINES                                 09070099
090800     END-IF.                                                      09080099
090900                                                                  09090099
091000******************************************************            09100099
091100 4010-DETERMINE-SG-DESCRIPTION.                                   09110099
091200******************************************************            09120099
091300                                                                  09130099
091400     EVALUATE TRUE                                                09140099
091500      WHEN PV-SG-LOC-IND(PV-IDX) = '1'                            09150099
091600          MOVE PC-IN-DOORS           TO SG-TOT-DESCRIPTION        09160099
091700      WHEN PV-SG-LOC-IND(PV-IDX) = '2'                            09170099
091800          MOVE PC-YARD               TO SG-TOT-DESCRIPTION        09180099
091900      WHEN PV-SG-LOC-IND(PV-IDX) = '3'                            09190099
092000          MOVE PC-ENROUTE            TO SG-TOT-DESCRIPTION        09200099
092100      WHEN PV-SG-LOC-IND(PV-IDX) = 'X'                            09210099
092200          MOVE PC-PACK-SLIPS-HANGING TO SG-TOT-DESCRIPTION        09220099
092300      WHEN OTHER                                                  09230099
092400          MOVE 'UNKNOWN            ' TO SG-TOT-DESCRIPTION        09240099
092500     END-EVALUATE.                                                09250099
092600/                                                                 09260099
092700******************************************************            09270099
092800 4020-UPDATE-DOOR-GRAND-TOT.                                      09280099
092900******************************************************            09290099
093000                                                                  09300099
093100* CLP 06/05/13 PR#4158B START                                     09310099
093200     ADD PV-SG-RFID-CTNS-TOT(PV-IDX) TO PV-ID-RFID-CTNS-TOT.      09320099
093300     ADD PV-SG-RFID-UNTS-TOT(PV-IDX) TO PV-ID-RFID-UNTS-TOT.      09330099
093400* CLP 06/05/13 PR#4158B END                                       09340099
093410* DMH 07/2014 CONTROLLED FLOW                                     09341099
093420     ADD PV-SG-CNTL-CTNS-TOT(PV-IDX) TO PV-ID-CNTL-CTNS-TOT.      09342099
093430     ADD PV-SG-CNTL-UNTS-TOT(PV-IDX) TO PV-ID-CNTL-UNTS-TOT.      09343099
093440* DMH 07/2014 HAZARDOUS COUNTS                                    09344099
093450     ADD PV-SG-HAZ-CTNS-TOT(PV-IDX) TO PV-ID-HAZ-CTNS-TOT.        09345099
093460     ADD PV-SG-HAZ-UNTS-TOT(PV-IDX) TO PV-ID-HAZ-UNTS-TOT.        09346099
093500*SB 01/16/14 - BEGIN PR#5148D                                     09350099
093600     ADD PV-SG-RFID-Q-CTNS-TOT(PV-IDX)                            09360099
093700                                TO PV-ID-RFID-Q-CTNS-TOT.         09370099
093800*    ADD PV-SG-RFID-U-CTNS-TOT(PV-IDX)                            09380099
093900*                               TO PV-ID-RFID-U-CTNS-TOT.         09390099
094000     ADD PV-SG-COMBO-Q-CTNS-TOT(PV-IDX)                           09400099
094100                                TO PV-ID-COMBO-Q-CTNS-TOT.        09410099
094200     ADD PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)                      09420099
094300                                TO PV-ID-RFID-PCNT-AUD-CTN-TOT.   09430099
094310*SB 01/16/14 - END PR#5148D                                       09431099
094320     ADD PV-SG-TRLR-CNT(PV-IDX) TO PV-ID-TRLR-CNT.                09432099
094330     ADD PV-SG-PO-TOT(PV-IDX)   TO PV-ID-PO-TOT.                  09433099
094340     ADD PV-SG-CTNS-TOT(PV-IDX) TO PV-ID-CTNS-TOT.                09434099
094350     ADD PV-SG-UNTS-TOT(PV-IDX) TO PV-ID-UNTS-TOT.                09435099
094360     ADD PV-SG-Q-CTNS-TOT(PV-IDX)                                 09436099
094370                                TO PV-ID-Q-CTNS-TOT.              09437099
094380     ADD PV-SG-U-CTNS-TOT(PV-IDX)                                 09438099
094390                                TO PV-ID-U-CTNS-TOT.              09439099
094400     ADD PV-SG-CRSDK-CTNS-TOT(PV-IDX)                             09440099
094500                                TO PV-ID-CRSDK-CTNS-TOT.          09450099
094600     ADD PV-SG-P2L-CTNS-TOT(PV-IDX)                               09460099
094700                                TO PV-ID-P2L-CTNS-TOT.            09470099
094800     ADD PV-SG-PROC-CNT-TOT(PV-IDX)                               09480099
094900                                TO PV-ID-PROC-CNT-TOT.            09490099
095000     ADD PV-SG-TRBL-CTNS-TOT(PV-IDX)                              09500099
095100                                TO PV-ID-TRBL-CTNS-TOT.           09510099
095200     ADD PV-SG-SET-DVT-CTNS-TOT(PV-IDX)                           09520099
095300                                TO PV-ID-SET-DVT-CTNS-TOT.        09530099
095400     ADD PV-SG-PCNT-AUD-CTN-TOT(PV-IDX)                           09540099
095500                                TO PV-ID-PCNT-AUD-CTN-TOT.        09550099
095600     ADD PV-SG-EFC-PO-TOT(PV-IDX)                                 09560099
095700                                TO PV-ID-EFC-PO-TOT.              09570099
095800     ADD PV-SG-EFC-CTNS-TOT(PV-IDX)                               09580099
095900                                TO PV-ID-EFC-CTNS-TOT.            09590099
096000     ADD PV-SG-EFC-UNTS-TOT(PV-IDX)                               09600099
096100                                TO PV-ID-EFC-UNTS-TOT.            09610099
096200/                                                                 09620099
096300******************************************************            09630099
096400 4030-UPDATE-YARD-GRAND-TOT.                                      09640099
096500******************************************************            09650099
096600                                                                  09660099
096700* CLP 06/05/13 PR#4158B START                                     09670099
096800     ADD PV-SG-RFID-CTNS-TOT(PV-IDX) TO PV-YD-RFID-CTNS-TOT.      09680099
096900     ADD PV-SG-RFID-UNTS-TOT(PV-IDX) TO PV-YD-RFID-UNTS-TOT.      09690099
097000* CLP 06/05/13 PR#4158B END                                       09700099
097010* DMH 07/2014 CONTROLLED FLOW                                     09701099
097020     ADD PV-SG-CNTL-CTNS-TOT(PV-IDX) TO PV-YD-CNTL-CTNS-TOT.      09702099
097030     ADD PV-SG-CNTL-UNTS-TOT(PV-IDX) TO PV-YD-CNTL-UNTS-TOT.      09703099
097040* DMH 07/2014 HAZARDOUS COUNTS                                    09704099
097050     ADD PV-SG-HAZ-CTNS-TOT(PV-IDX) TO PV-YD-HAZ-CTNS-TOT.        09705099
097060     ADD PV-SG-HAZ-UNTS-TOT(PV-IDX) TO PV-YD-HAZ-UNTS-TOT.        09706099
097100*SB 01/16/14 - BEGIN PR#5148D                                     09710099
097200     ADD PV-SG-RFID-Q-CTNS-TOT(PV-IDX)                            09720099
097300                                TO PV-YD-RFID-Q-CTNS-TOT.         09730099
097310*    ADD PV-SG-RFID-U-CTNS-TOT(PV-IDX)                            09731099
097320*                               TO PV-YD-RFID-U-CTNS-TOT.         09732099
097330     ADD PV-SG-COMBO-Q-CTNS-TOT(PV-IDX)                           09733099
097340                                TO PV-YD-COMBO-Q-CTNS-TOT.        09734099
097341     ADD PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)                      09734199
097342                                TO PV-YD-RFID-PCNT-AUD-CTN-TOT.   09734299
097343*SB 01/16/14 - END PR#5148D                                       09734399
097344     ADD PV-SG-TRLR-CNT(PV-IDX) TO PV-YD-TRLR-CNT.                09734499
097345     ADD PV-SG-PO-TOT(PV-IDX)   TO PV-YD-PO-TOT.                  09734599
097346     ADD PV-SG-CTNS-TOT(PV-IDX) TO PV-YD-CTNS-TOT.                09734699
097347     ADD PV-SG-UNTS-TOT(PV-IDX) TO PV-YD-UNTS-TOT.                09734799
097348     ADD PV-SG-Q-CTNS-TOT(PV-IDX)                                 09734899
097349                                TO PV-YD-Q-CTNS-TOT.              09734999
097350     ADD PV-SG-U-CTNS-TOT(PV-IDX)                                 09735099
097360                                TO PV-YD-U-CTNS-TOT.              09736099
097370     ADD PV-SG-CRSDK-CTNS-TOT(PV-IDX)                             09737099
097380                                TO PV-YD-CRSDK-CTNS-TOT.          09738099
097390     ADD PV-SG-P2L-CTNS-TOT(PV-IDX)                               09739099
097400                                TO PV-YD-P2L-CTNS-TOT.            09740099
097500     ADD PV-SG-PROC-CNT-TOT(PV-IDX)                               09750099
097600                                TO PV-YD-PROC-CNT-TOT.            09760099
097700     ADD PV-SG-TRBL-CTNS-TOT(PV-IDX)                              09770099
097800                                TO PV-YD-TRBL-CTNS-TOT.           09780099
097900     ADD PV-SG-SET-DVT-CTNS-TOT(PV-IDX)                           09790099
098000                                TO PV-YD-SET-DVT-CTNS-TOT.        09800099
098100     ADD PV-SG-PCNT-AUD-CTN-TOT(PV-IDX)                           09810099
098200                                TO PV-YD-PCNT-AUD-CTN-TOT.        09820099
098300     ADD PV-SG-EFC-PO-TOT(PV-IDX)                                 09830099
098400                                TO PV-YD-EFC-PO-TOT.              09840099
098500     ADD PV-SG-EFC-CTNS-TOT(PV-IDX)                               09850099
098600                                TO PV-YD-EFC-CTNS-TOT.            09860099
098700     ADD PV-SG-EFC-UNTS-TOT(PV-IDX)                               09870099
098800                                TO PV-YD-EFC-UNTS-TOT.            09880099
098900/                                                                 09890099
099000******************************************************            09900099
099100 4040-UPDATE-ENROUTE-GRAND-TOT.                                   09910099
099200******************************************************            09920099
099300                                                                  09930099
099400* CLP 06/05/13 PR#4158B START                                     09940099
099500     ADD PV-SG-RFID-CTNS-TOT(PV-IDX) TO PV-ER-RFID-CTNS-TOT.      09950099
099600     ADD PV-SG-RFID-UNTS-TOT(PV-IDX) TO PV-ER-RFID-UNTS-TOT.      09960099
099700* CLP 06/05/13 PR#4158B END                                       09970099
099710* DMH 07/2014 CONTROLLED FLOW                                     09971099
099720     ADD PV-SG-CNTL-CTNS-TOT(PV-IDX) TO PV-ER-CNTL-CTNS-TOT.      09972099
099730     ADD PV-SG-CNTL-UNTS-TOT(PV-IDX) TO PV-ER-CNTL-UNTS-TOT.      09973099
099740* DMH 07/2014 HAZARDOUS COUNTS                                    09974099
099750     ADD PV-SG-HAZ-CTNS-TOT(PV-IDX) TO PV-ER-HAZ-CTNS-TOT.        09975099
099760     ADD PV-SG-HAZ-UNTS-TOT(PV-IDX) TO PV-ER-HAZ-UNTS-TOT.        09976099
099800*SB 01/16/14 - BEGIN PR#5148D                                     09980099
099900     ADD PV-SG-RFID-Q-CTNS-TOT(PV-IDX)                            09990099
100000                                TO PV-ER-RFID-Q-CTNS-TOT.         10000099
100100*    ADD PV-SG-RFID-U-CTNS-TOT(PV-IDX)                            10010099
100200*                               TO PV-ER-RFID-U-CTNS-TOT.         10020099
100300     ADD PV-SG-COMBO-Q-CTNS-TOT(PV-IDX)                           10030099
100400                                TO PV-ER-COMBO-Q-CTNS-TOT.        10040099
100410     ADD PV-SG-RFID-PCNT-AUD-CTN-TOT(PV-IDX)                      10041099
100420                                TO PV-ER-RFID-PCNT-AUD-CTN-TOT.   10042099
100430*SB 01/16/14 - END PR#5148D                                       10043099
100440     ADD PV-SG-TRLR-CNT(PV-IDX) TO PV-ER-TRLR-CNT.                10044099
100450     ADD PV-SG-PO-TOT(PV-IDX)   TO PV-ER-PO-TOT.                  10045099
100460     ADD PV-SG-CTNS-TOT(PV-IDX) TO PV-ER-CTNS-TOT.                10046099
100470     ADD PV-SG-UNTS-TOT(PV-IDX) TO PV-ER-UNTS-TOT.                10047099
100480     ADD PV-SG-Q-CTNS-TOT(PV-IDX)                                 10048099
100490                                TO PV-ER-Q-CTNS-TOT.              10049099
100500     ADD PV-SG-U-CTNS-TOT(PV-IDX)                                 10050099
100600                                TO PV-ER-U-CTNS-TOT.              10060099
100700     ADD PV-SG-CRSDK-CTNS-TOT(PV-IDX)                             10070099
100800                                TO PV-ER-CRSDK-CTNS-TOT.          10080099
100900     ADD PV-SG-P2L-CTNS-TOT(PV-IDX)                               10090099
101000                                TO PV-ER-P2L-CTNS-TOT.            10100099
101100     ADD PV-SG-PROC-CNT-TOT(PV-IDX)                               10110099
101200                                TO PV-ER-PROC-CNT-TOT.            10120099
101300     ADD PV-SG-TRBL-CTNS-TOT(PV-IDX)                              10130099
101400                                TO PV-ER-TRBL-CTNS-TOT.           10140099
101500     ADD PV-SG-SET-DVT-CTNS-TOT(PV-IDX)                           10150099
101600                                TO PV-ER-SET-DVT-CTNS-TOT.        10160099
101700     ADD PV-SG-PCNT-AUD-CTN-TOT(PV-IDX)                           10170099
101800                                TO PV-ER-PCNT-AUD-CTN-TOT.        10180099
101900     ADD PV-SG-EFC-PO-TOT(PV-IDX)                                 10190099
102000                                TO PV-ER-EFC-PO-TOT.              10200099
102100     ADD PV-SG-EFC-CTNS-TOT(PV-IDX)                               10210099
102200                                TO PV-ER-EFC-CTNS-TOT.            10220099
102300     ADD PV-SG-EFC-UNTS-TOT(PV-IDX)                               10230099
102400                                TO PV-ER-EFC-UNTS-TOT.            10240099
102500/                                                                 10250099
102600******************************************************            10260099
102700 4050-UPDATE-HANGPCK-GRAND-TOT.                                   10270099
102800******************************************************            10280099
102900                                                                  10290099
103000     ADD PV-SG-PO-TOT(PV-IDX)   TO PV-PH-PO-TOT.                  10300099
103100     ADD PV-SG-CTNS-TOT(PV-IDX) TO PV-PH-CTNS-TOT.                10310099
103200     ADD PV-SG-UNTS-TOT(PV-IDX) TO PV-PH-UNTS-TOT.                10320099
103300/                                                                 10330099
103400******************************************************            10340099
103500 5000-DC-LOCATION-BREAK.                                          10350099
103600******************************************************            10360099
103700                                                                  10370099
103800* ADD DC TOTALS TO GRAND TOTALS                                   10380099
103900* CLP 06/05/13 PR#4158B START                                     10390099
104000     ADD PV-DC-RFID-CTNS-TOT    TO PV-FG-RFID-CTNS-TOT.           10400099
104100     ADD PV-DC-RFID-UNTS-TOT    TO PV-FG-RFID-UNTS-TOT.           10410099
104200* CLP 06/05/13 PR#4158B END                                       10420099
104210* DMH 07/2014 CONTROLLED FLOW                                     10421099
104220     ADD PV-DC-CNTL-CTNS-TOT    TO PV-FG-CNTL-CTNS-TOT.           10422099
104230     ADD PV-DC-CNTL-UNTS-TOT    TO PV-FG-CNTL-UNTS-TOT.           10423099
104240* DMH 07/2014 HAZARDOUS COUNTS                                    10424099
104250     ADD PV-DC-HAZ-CTNS-TOT    TO PV-FG-HAZ-CTNS-TOT.             10425099
104260     ADD PV-DC-HAZ-UNTS-TOT    TO PV-FG-HAZ-UNTS-TOT.             10426099
104300*SB 01/16/14 - BEGIN PR#5148D                                     10430099
104400     ADD PV-DC-RFID-Q-CTNS-TOT  TO PV-FG-RFID-Q-CTNS-TOT.         10440099
104500*    ADD PV-DC-RFID-U-CTNS-TOT  TO PV-FG-RFID-U-CTNS-TOT.         10450099
104600     ADD PV-DC-COMBO-Q-CTNS-TOT TO PV-FG-COMBO-Q-CTNS-TOT.        10460099
104700     ADD PV-DC-RFID-PCNT-AUD-CTN-TOT                              10470099
104800                                TO PV-FG-RFID-PCNT-AUD-CTN-TOT.   10480099
104900*    ADD PV-DC-RFID-PCNT-AUD-CTN-TOT                              10490099
105000*                               TO PV-FG-RFID-PCNT-AUD-CTN-TOT.   10500099
105100*SB 01/16/14 - END PR#5148D                                       10510099
105200     ADD PV-DC-TRLR-CNT         TO PV-FG-TRLR-CNT.                10520099
105300     ADD PV-DC-PO-TOT           TO PV-FG-PO-TOT.                  10530099
105400     ADD PV-DC-CTNS-TOT         TO PV-FG-CTNS-TOT.                10540099
105500     ADD PV-DC-UNTS-TOT         TO PV-FG-UNTS-TOT.                10550099
105600     ADD PV-DC-Q-CTNS-TOT       TO PV-FG-Q-CTNS-TOT.              10560099
105700     ADD PV-DC-U-CTNS-TOT       TO PV-FG-U-CTNS-TOT.              10570099
105800     ADD PV-DC-CRSDK-CTNS-TOT   TO PV-FG-CRSDK-CTNS-TOT.          10580099
105900     ADD PV-DC-P2L-CTNS-TOT     TO PV-FG-P2L-CTNS-TOT.            10590099
106000     ADD PV-DC-PROC-CNT-TOT     TO PV-FG-PROC-CNT-TOT.            10600099
106100     ADD PV-DC-TRBL-CTNS-TOT    TO PV-FG-TRBL-CTNS-TOT.           10610099
106200     ADD PV-DC-SET-DVT-CTNS-TOT TO PV-FG-SET-DVT-CTNS-TOT.        10620099
106300     ADD PV-DC-PCNT-AUD-CTN-TOT TO PV-FG-PCNT-AUD-CTN-TOT.        10630099
106400     ADD PV-DC-EFC-PO-TOT       TO PV-FG-EFC-PO-TOT.              10640099
106500     ADD PV-DC-EFC-CTNS-TOT     TO PV-FG-EFC-CTNS-TOT.            10650099
106600     ADD PV-DC-EFC-UNTS-TOT     TO PV-FG-EFC-UNTS-TOT.            10660099
106700                                                                  10670099
106800     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           10680099
106900         PERFORM 9050-REPORT-HEADERS                              10690099
107000         PERFORM 9040-PAGE-HEADERS                                10700099
107100     END-IF.                                                      10710099
107200                                                                  10720099
107300* FORMAT AND PRINT DC TOTAL LINE                                  10730099
107400     MOVE PV-DC-TRLR-CNT         TO DC-TOT-TRLR-CNT.              10740099
107500     MOVE PV-DC-PO-TOT           TO DC-TOT-POS.                   10750099
107600     MOVE PV-DC-CTNS-TOT         TO DC-TOT-CTNS                   10760099
107700     MOVE PV-DC-UNTS-TOT         TO DC-TOT-UNITS.                 10770099
107800     MOVE PV-DC-Q-CTNS-TOT       TO DC-TOT-Q-CTNS.                10780099
107900     MOVE PV-DC-U-CTNS-TOT       TO DC-TOT-U-CTNS.                10790099
108000     MOVE PV-DC-CRSDK-CTNS-TOT   TO DC-TOT-CRSDK-CTNS.            10800099
108100     MOVE PV-DC-P2L-CTNS-TOT     TO DC-TOT-P2L-CTNS.              10810099
108200     MOVE PV-DC-PROC-CNT-TOT     TO DC-TOT-PROC-CNT.              10820099
108300     MOVE PV-DC-TRBL-CTNS-TOT    TO DC-TOT-TRBL-CTNS.             10830099
108400     MOVE PV-DC-SET-DVT-CTNS-TOT TO DC-TOT-WSTD-CTNS.             10840099
108500     MOVE PV-DC-PCNT-AUD-CTN-TOT TO DC-TOT-AUDIT-CNT.             10850099
108600     MOVE PV-DC-EFC-PO-TOT       TO DC-TOT-EFC-POS.               10860099
108700     MOVE PV-DC-EFC-CTNS-TOT     TO DC-TOT-EFC-CTNS.              10870099
108800     MOVE PV-DC-EFC-UNTS-TOT     TO DC-TOT-EFC-UNITS.             10880099
108900* CLP 06/05/13 PR#4158B START                                     10890099
109000     MOVE PV-DC-RFID-CTNS-TOT    TO DC-TOT-RFID-CTNS.             10900099
109100     MOVE PV-DC-RFID-UNTS-TOT    TO DC-TOT-RFID-UNITS.            10910099
109200* CLP 06/05/13 PR#4158B END                                       10920099
109210* DMH 07/2014 CONTROLLED FLOW                                     10921099
109220     MOVE PV-DC-CNTL-CTNS-TOT    TO DC-TOT-CNTL-CTNS.             10922099
109230     MOVE PV-DC-CNTL-UNTS-TOT    TO DC-TOT-CNTL-UNITS.            10923099
109240* DMH 07/2014 HAZARDOUS COUNTS                                    10924099
109250     MOVE PV-DC-HAZ-CTNS-TOT     TO DC-TOT-HAZ-CTNS.              10925099
109260     MOVE PV-DC-HAZ-UNTS-TOT     TO DC-TOT-HAZ-UNITS.             10926099
109300*SB 01/16/14 - BEGIN PR#5148D                                     10930099
109400     MOVE PV-DC-RFID-Q-CTNS-TOT  TO DC-TOT-RFID-Q-CTNS.           10940099
109500*    MOVE PV-DC-RFID-U-CTNS-TOT  TO DC-TOT-RFID-U-CTNS.           10950099
109600     MOVE PV-DC-COMBO-Q-CTNS-TOT TO DC-TOT-COMBO-Q-CTNS.          10960099
109700     MOVE PV-DC-RFID-PCNT-AUD-CTN-TOT                             10970099
109800                                 TO DC-TOT-RFID-AUDIT-CNT.        10980099
109900*SB 01/16/14 - END PR#5148D                                       10990099
110000                                                                  11000099
110100     WRITE REPORT-RECORD FROM DC-TOTAL-LINE                       11010099
110200            AFTER ADVANCING 1 LINE.                               11020099
110300                                                                  11030099
110400     ADD  +1 TO PV-LINE-CNT                                       11040099
110500                PV-NBR-OF-LINES.                                  11050099
110600                                                                  11060099
110700* ZERO OUT DC LOC TOTALS                                          11070099
110800     INITIALIZE PV-DC-ACCUMULATORS.                               11080099
110900/                                                                 11090099
111000******************************************************            11100099
111100 6000-GRAND-TOTALS.                                               11110099
111200******************************************************            11120099
111300                                                                  11130099
111400     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           11140099
111500         PERFORM 9050-REPORT-HEADERS                              11150099
111600         PERFORM 9040-PAGE-HEADERS                                11160099
111700     END-IF.                                                      11170099
111800                                                                  11180099
111900     WRITE REPORT-RECORD FROM GT-HDR-LINE                         11190099
112000            AFTER ADVANCING 2 LINES.                              11200099
112100                                                                  11210099
112200     ADD  +2 TO PV-LINE-CNT                                       11220099
112300                PV-NBR-OF-LINES.                                  11230099
112400                                                                  11240099
112500     IF PS-IN-DOORS-DATA-FOUND                                    11250099
112600         PERFORM 6020-PRINT-DOOR-GRAND-TOT                        11260099
112700     END-IF.                                                      11270099
112800     IF PS-YARD-DATA-FOUND                                        11280099
112900         PERFORM 6030-PRINT-YARD-GRAND-TOT                        11290099
113000     END-IF.                                                      11300099
113100     IF PS-ENROUTE-DATA-FOUND                                     11310099
113200         PERFORM 6040-PRINT-ENROUTE-GRAND-TOT                     11320099
113300     END-IF.                                                      11330099
113400     IF PS-PCKSLIPSH-DATA-FOUND                                   11340099
113500         PERFORM 6050-PRINT-HANGPCK-GRAND-TOT                     11350099
113600     END-IF.                                                      11360099
113700                                                                  11370099
113800     PERFORM 6060-PRINT-FINAL-GRAND-TOT.                          11380099
113900/                                                                 11390099
114000******************************************************            11400099
114100 6020-PRINT-DOOR-GRAND-TOT.                                       11410099
114200******************************************************            11420099
114300                                                                  11430099
114400     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           11440099
114500         PERFORM 9050-REPORT-HEADERS                              11450099
114600         PERFORM 9040-PAGE-HEADERS                                11460099
114700     END-IF.                                                      11470099
114800                                                                  11480099
114900* FORMAT AND PRINT IN DOOR GRAND TOTAL LINE                       11490099
115000     MOVE PV-ID-TRLR-CNT         TO ID-TOT-TRLR-CNT.              11500099
115100     MOVE PV-ID-PO-TOT           TO ID-TOT-POS.                   11510099
115200     MOVE PV-ID-CTNS-TOT         TO ID-TOT-CTNS                   11520099
115300     MOVE PV-ID-UNTS-TOT         TO ID-TOT-UNITS.                 11530099
115400     MOVE PV-ID-Q-CTNS-TOT       TO ID-TOT-Q-CTNS.                11540099
115500     MOVE PV-ID-U-CTNS-TOT       TO ID-TOT-U-CTNS.                11550099
115600     MOVE PV-ID-CRSDK-CTNS-TOT   TO ID-TOT-CRSDK-CTNS.            11560099
115700     MOVE PV-ID-P2L-CTNS-TOT     TO ID-TOT-P2L-CTNS.              11570099
115800     MOVE PV-ID-PROC-CNT-TOT     TO ID-TOT-PROC-CNT.              11580099
115900     MOVE PV-ID-TRBL-CTNS-TOT    TO ID-TOT-TRBL-CTNS.             11590099
116000     MOVE PV-ID-SET-DVT-CTNS-TOT TO ID-TOT-WSTD-CTNS.             11600099
116100     MOVE PV-ID-PCNT-AUD-CTN-TOT TO ID-TOT-AUDIT-CNT.             11610099
116200     MOVE PV-ID-EFC-PO-TOT       TO ID-TOT-EFC-POS.               11620099
116300     MOVE PV-ID-EFC-CTNS-TOT     TO ID-TOT-EFC-CTNS.              11630099
116400     MOVE PV-ID-EFC-UNTS-TOT     TO ID-TOT-EFC-UNITS.             11640099
116500* CLP 06/05/13 PR#4158B START                                     11650099
116600     MOVE PV-ID-RFID-CTNS-TOT    TO ID-TOT-RFID-CTNS.             11660099
116700     MOVE PV-ID-RFID-UNTS-TOT    TO ID-TOT-RFID-UNITS.            11670099
116800* CLP 06/05/13 PR#4158B END                                       11680099
116810* DMH 07/2014 CONTROLLED FLOW                                     11681099
116820     MOVE PV-ID-CNTL-CTNS-TOT    TO ID-TOT-CNTL-CTNS.             11682099
116830     MOVE PV-ID-CNTL-UNTS-TOT    TO ID-TOT-CNTL-UNITS.            11683099
116840* DMH 07/2014 HAZARDOUS COUNTS                                    11684099
116850     MOVE PV-ID-HAZ-CTNS-TOT     TO ID-TOT-HAZ-CTNS.              11685099
116860     MOVE PV-ID-HAZ-UNTS-TOT     TO ID-TOT-HAZ-UNITS.             11686099
116900*SB 01/16/14 - BEGIN PR#5148D                                     11690099
116910     MOVE PV-ID-RFID-Q-CTNS-TOT  TO ID-TOT-RFID-Q-CTNS.           11691099
116920*    MOVE PV-ID-RFID-U-CTNS-TOT  TO ID-TOT-RFID-U-CTNS.           11692099
116930     MOVE PV-ID-COMBO-Q-CTNS-TOT TO ID-TOT-COMBO-Q-CTNS.          11693099
116940     MOVE PV-ID-RFID-PCNT-AUD-CTN-TOT                             11694099
116941                                 TO ID-TOT-RFID-AUDIT-CNT.        11694199
116942*SB 01/16/14 - END PR#5148D                                       11694299
116943                                                                  11694399
116944     WRITE REPORT-RECORD FROM IN-DOORS-GRAND-TOTAL-LINE           11694499
116945            AFTER ADVANCING 1 LINE.                               11694599
116946                                                                  11694699
116947     ADD  +1 TO PV-LINE-CNT                                       11694799
116948                PV-NBR-OF-LINES.                                  11694899
116949                                                                  11694999
116950/                                                                 11695099
116960******************************************************            11696099
116970 6030-PRINT-YARD-GRAND-TOT.                                       11697099
116980******************************************************            11698099
116990                                                                  11699099
117000     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           11700099
117100         PERFORM 9050-REPORT-HEADERS                              11710099
117200         PERFORM 9040-PAGE-HEADERS                                11720099
117300     END-IF.                                                      11730099
117400                                                                  11740099
117500* FORMAT AND PRINT YARD GRAND TOTAL LINE                          11750099
117600     MOVE PV-YD-TRLR-CNT         TO YD-TOT-TRLR-CNT.              11760099
117700     MOVE PV-YD-PO-TOT           TO YD-TOT-POS.                   11770099
117800     MOVE PV-YD-CTNS-TOT         TO YD-TOT-CTNS                   11780099
117900     MOVE PV-YD-UNTS-TOT         TO YD-TOT-UNITS.                 11790099
118000     MOVE PV-YD-Q-CTNS-TOT       TO YD-TOT-Q-CTNS.                11800099
118100     MOVE PV-YD-U-CTNS-TOT       TO YD-TOT-U-CTNS.                11810099
118200     MOVE PV-YD-CRSDK-CTNS-TOT   TO YD-TOT-CRSDK-CTNS.            11820099
118300     MOVE PV-YD-P2L-CTNS-TOT     TO YD-TOT-P2L-CTNS.              11830099
118400     MOVE PV-YD-PROC-CNT-TOT     TO YD-TOT-PROC-CNT.              11840099
118500     MOVE PV-YD-TRBL-CTNS-TOT    TO YD-TOT-TRBL-CTNS.             11850099
118600     MOVE PV-YD-SET-DVT-CTNS-TOT TO YD-TOT-WSTD-CTNS.             11860099
118700     MOVE PV-YD-PCNT-AUD-CTN-TOT TO YD-TOT-AUDIT-CNT.             11870099
118800     MOVE PV-YD-EFC-PO-TOT       TO YD-TOT-EFC-POS.               11880099
118900     MOVE PV-YD-EFC-CTNS-TOT     TO YD-TOT-EFC-CTNS.              11890099
119000     MOVE PV-YD-EFC-UNTS-TOT     TO YD-TOT-EFC-UNITS.             11900099
119100     MOVE PV-YD-RFID-CTNS-TOT    TO YD-TOT-RFID-CTNS.             11910099
119200     MOVE PV-YD-RFID-UNTS-TOT    TO YD-TOT-RFID-UNITS.            11920099
119201*DMH 07/2014 CONTROLLED FLOW                                      11920199
119210     MOVE PV-YD-CNTL-CTNS-TOT    TO YD-TOT-CNTL-CTNS.             11921099
119220     MOVE PV-YD-CNTL-UNTS-TOT    TO YD-TOT-CNTL-UNITS.            11922099
119230*DMH 07/2014 HAZARDOUS COUNTS                                     11923099
119240     MOVE PV-YD-HAZ-CTNS-TOT     TO YD-TOT-HAZ-CTNS.              11924099
119250     MOVE PV-YD-HAZ-UNTS-TOT     TO YD-TOT-HAZ-UNITS.             11925099
119300*SB 01/16/14 - BEGIN PR#5148D                                     11930099
119400     MOVE PV-YD-RFID-Q-CTNS-TOT  TO YD-TOT-RFID-Q-CTNS.           11940099
119500*    MOVE PV-YD-RFID-U-CTNS-TOT  TO YD-TOT-RFID-U-CTNS.           11950099
119600     MOVE PV-YD-COMBO-Q-CTNS-TOT TO YD-TOT-COMBO-Q-CTNS.          11960099
119700     MOVE PV-YD-RFID-PCNT-AUD-CTN-TOT                             11970099
119800                                 TO YD-TOT-RFID-AUDIT-CNT.        11980099
119900*SB 01/16/14 - END PR#5148D                                       11990099
120000                                                                  12000099
120100     WRITE REPORT-RECORD FROM YARD-GRAND-TOTAL-LINE               12010099
120200            AFTER ADVANCING 1 LINE.                               12020099
120300                                                                  12030099
120400     ADD  +1 TO PV-LINE-CNT                                       12040099
120500                PV-NBR-OF-LINES.                                  12050099
120600                                                                  12060099
120700/                                                                 12070099
120800******************************************************            12080099
120900 6040-PRINT-ENROUTE-GRAND-TOT.                                    12090099
121000******************************************************            12100099
121100                                                                  12110099
121200     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           12120099
121300         PERFORM 9050-REPORT-HEADERS                              12130099
121400         PERFORM 9040-PAGE-HEADERS                                12140099
121500     END-IF.                                                      12150099
121600                                                                  12160099
121700* FORMAT AND PRINT ENROUTE GRAND TOTAL LINE                       12170099
121800     MOVE PV-ER-TRLR-CNT         TO ER-TOT-TRLR-CNT.              12180099
121900     MOVE PV-ER-PO-TOT           TO ER-TOT-POS.                   12190099
122000     MOVE PV-ER-CTNS-TOT         TO ER-TOT-CTNS                   12200099
122100     MOVE PV-ER-UNTS-TOT         TO ER-TOT-UNITS.                 12210099
122200     MOVE PV-ER-Q-CTNS-TOT       TO ER-TOT-Q-CTNS.                12220099
122300     MOVE PV-ER-U-CTNS-TOT       TO ER-TOT-U-CTNS.                12230099
122400     MOVE PV-ER-CRSDK-CTNS-TOT   TO ER-TOT-CRSDK-CTNS.            12240099
122500     MOVE PV-ER-P2L-CTNS-TOT     TO ER-TOT-P2L-CTNS.              12250099
122600     MOVE PV-ER-PROC-CNT-TOT     TO ER-TOT-PROC-CNT.              12260099
122700     MOVE PV-ER-TRBL-CTNS-TOT    TO ER-TOT-TRBL-CTNS.             12270099
122800     MOVE PV-ER-SET-DVT-CTNS-TOT TO ER-TOT-WSTD-CTNS.             12280099
122900     MOVE PV-ER-PCNT-AUD-CTN-TOT TO ER-TOT-AUDIT-CNT.             12290099
123000     MOVE PV-ER-EFC-PO-TOT       TO ER-TOT-EFC-POS.               12300099
123100     MOVE PV-ER-EFC-CTNS-TOT     TO ER-TOT-EFC-CTNS.              12310099
123200     MOVE PV-ER-EFC-UNTS-TOT     TO ER-TOT-EFC-UNITS.             12320099
123300* CLP 06/05/13 PR#4158B START                                     12330099
123400     MOVE PV-ER-RFID-CTNS-TOT    TO ER-TOT-RFID-CTNS.             12340099
123500     MOVE PV-ER-RFID-UNTS-TOT    TO ER-TOT-RFID-UNITS.            12350099
123510* CLP 06/05/13 PR#4158B END                                       12351099
123511* DMH 07/2014 CONTROLLED FLOW                                     12351199
123512     MOVE PV-ER-CNTL-CTNS-TOT    TO ER-TOT-CNTL-CTNS.             12351299
123513     MOVE PV-ER-CNTL-UNTS-TOT    TO ER-TOT-CNTL-UNITS.            12351399
123514* DMH 07/2014 HAZARDOUS COUNT                                     12351499
123515     MOVE PV-ER-HAZ-CTNS-TOT     TO ER-TOT-HAZ-CTNS.              12351599
123516     MOVE PV-ER-HAZ-UNTS-TOT     TO ER-TOT-HAZ-UNITS.             12351699
123520*SB 01/16/14 - BEGIN PR#5148D                                     12352099
123530     MOVE PV-ER-RFID-Q-CTNS-TOT  TO ER-TOT-RFID-Q-CTNS.           12353099
123540*    MOVE PV-ER-RFID-U-CTNS-TOT  TO ER-TOT-RFID-U-CTNS.           12354099
123550     MOVE PV-ER-COMBO-Q-CTNS-TOT TO ER-TOT-COMBO-Q-CTNS.          12355099
123551     MOVE PV-ER-RFID-PCNT-AUD-CTN-TOT                             12355199
123552                                 TO ER-TOT-RFID-AUDIT-CNT.        12355299
123553*SB 01/16/14 - END PR#5148D                                       12355399
123554                                                                  12355499
123555     WRITE REPORT-RECORD FROM ENROUTE-GRAND-TOTAL-LINE            12355599
123556            AFTER ADVANCING 1 LINE.                               12355699
123557                                                                  12355799
123558     ADD  +1 TO PV-LINE-CNT                                       12355899
123559                PV-NBR-OF-LINES.                                  12355999
123560                                                                  12356099
123570/                                                                 12357099
123580******************************************************            12358099
123590 6050-PRINT-HANGPCK-GRAND-TOT.                                    12359099
123600******************************************************            12360099
123700                                                                  12370099
123800     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           12380099
123900         PERFORM 9050-REPORT-HEADERS                              12390099
124000         PERFORM 9040-PAGE-HEADERS                                12400099
124100     END-IF.                                                      12410099
124200                                                                  12420099
124300     INITIALIZE PCKSLPS-HANGING-GRAND-TOT-LINE.                   12430099
124400* FORMAT AND PRINT PACKINGSLIP HANGING GRAND TOTAL LINE           12440099
124500     MOVE PV-PH-PO-TOT           TO PH-TOT-POS.                   12450099
124600     MOVE PV-PH-CTNS-TOT         TO PH-TOT-CTNS                   12460099
124700     MOVE PV-PH-UNTS-TOT         TO PH-TOT-UNITS.                 12470099
124800                                                                  12480099
124900     WRITE REPORT-RECORD FROM PCKSLPS-HANGING-GRAND-TOT-LINE      12490099
125000            AFTER ADVANCING 1 LINE.                               12500099
125100                                                                  12510099
125200     ADD  +1 TO PV-LINE-CNT                                       12520099
125300                PV-NBR-OF-LINES.                                  12530099
125400                                                                  12540099
125500/                                                                 12550099
125600******************************************************            12560099
125700 6060-PRINT-FINAL-GRAND-TOT.                                      12570099
125800******************************************************            12580099
125900                                                                  12590099
126000     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           12600099
126100         PERFORM 9050-REPORT-HEADERS                              12610099
126200         PERFORM 9040-PAGE-HEADERS                                12620099
126300     END-IF.                                                      12630099
126400                                                                  12640099
126500* FORMAT AND PRINT FINAL GRAND TOTAL LINE                         12650099
126600     MOVE PV-FG-TRLR-CNT         TO FG-TOT-TRLR-CNT.              12660099
126700     MOVE PV-FG-PO-TOT           TO FG-TOT-POS.                   12670099
126800     MOVE PV-FG-CTNS-TOT         TO FG-TOT-CTNS                   12680099
126900     MOVE PV-FG-UNTS-TOT         TO FG-TOT-UNITS.                 12690099
127000     MOVE PV-FG-Q-CTNS-TOT       TO FG-TOT-Q-CTNS.                12700099
127100     MOVE PV-FG-U-CTNS-TOT       TO FG-TOT-U-CTNS.                12710099
127200     MOVE PV-FG-CRSDK-CTNS-TOT   TO FG-TOT-CRSDK-CTNS.            12720099
127300     MOVE PV-FG-P2L-CTNS-TOT     TO FG-TOT-P2L-CTNS.              12730099
127400     MOVE PV-FG-PROC-CNT-TOT     TO FG-TOT-PROC-CNT.              12740099
127500     MOVE PV-FG-TRBL-CTNS-TOT    TO FG-TOT-TRBL-CTNS.             12750099
127600     MOVE PV-FG-SET-DVT-CTNS-TOT TO FG-TOT-WSTD-CTNS.             12760099
127700     MOVE PV-FG-PCNT-AUD-CTN-TOT TO FG-TOT-AUDIT-CNT.             12770099
127800     MOVE PV-FG-EFC-PO-TOT       TO FG-TOT-EFC-POS.               12780099
127900     MOVE PV-FG-EFC-CTNS-TOT     TO FG-TOT-EFC-CTNS.              12790099
128000     MOVE PV-FG-EFC-UNTS-TOT     TO FG-TOT-EFC-UNITS.             12800099
128100* CLP 06/05/13 PR#4158B START                                     12810099
128200     MOVE PV-FG-RFID-CTNS-TOT    TO FG-TOT-RFID-CTNS.             12820099
128300     MOVE PV-FG-RFID-UNTS-TOT    TO FG-TOT-RFID-UNITS.            12830099
128400* CLP 06/05/13 PR#4158B END                                       12840099
128410* DMH 07/2014 CONTROLLED FLOW                                     12841099
128420     MOVE PV-FG-CNTL-CTNS-TOT    TO FG-TOT-CNTL-CTNS.             12842099
128430     MOVE PV-FG-CNTL-UNTS-TOT    TO FG-TOT-CNTL-UNITS.            12843099
128440* DMH 07/2014 HAZARDOUS COUNTS                                    12844099
128450     MOVE PV-FG-HAZ-CTNS-TOT     TO FG-TOT-HAZ-CTNS.              12845099
128460     MOVE PV-FG-HAZ-UNTS-TOT     TO FG-TOT-HAZ-UNITS.             12846099
128500*SB 01/16/14 - BEGIN PR#5148D                                     12850099
128600     MOVE PV-FG-RFID-Q-CTNS-TOT  TO FG-TOT-RFID-Q-CTNS.           12860099
128700*    MOVE PV-FG-RFID-U-CTNS-TOT  TO FG-TOT-RFID-U-CTNS.           12870099
128800     MOVE PV-FG-COMBO-Q-CTNS-TOT TO FG-TOT-COMBO-Q-CTNS.          12880099
128900     MOVE PV-FG-RFID-PCNT-AUD-CTN-TOT                             12890099
129000                                 TO FG-TOT-RFID-AUDIT-CNT.        12900099
129100*SB 01/16/14 - END PR#5148D                                       12910099
129200                                                                  12920099
129300     WRITE REPORT-RECORD FROM FINAL-GRAND-TOTAL-LINE              12930099
129400            AFTER ADVANCING 1 LINE.                               12940099
129500                                                                  12950099
129600     ADD  +1 TO PV-LINE-CNT                                       12960099
129700                PV-NBR-OF-LINES.                                  12970099
129800                                                                  12980099
129900/                                                                 12990099
130000******************************************************            13000099
130100* 9010-DC-HEADER.                                    *            13010099
130200******************************************************            13020099
130300 9010-DC-HEADER.                                                  13030099
130400                                                                  13040099
130500     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           13050099
130600         PERFORM 9050-REPORT-HEADERS                              13060099
130700         PERFORM 9040-PAGE-HEADERS                                13070099
130800     END-IF.                                                      13080099
130900                                                                  13090099
131000     IF PV-EFC-NBR NOT = 0                                        13100099
131100         MOVE 'EFC: '       TO DC-HDR-EFC-LABEL                   13110099
131200         MOVE PV-EFC-NBR    TO DC-HDR-EFC-NBR                     13120099
131300     ELSE                                                         13130099
131400         MOVE SPACES        TO DC-HDR-EFC-LABEL                   13140099
131500                               DC-HDR-EFC-NBR                     13150099
131600     END-IF.                                                      13160099
131700                                                                  13170099
131800     WRITE REPORT-RECORD FROM DC-HDR-LINE                         13180099
131900            AFTER ADVANCING 2 LINES.                              13190099
132000                                                                  13200099
132100     ADD  +2 TO PV-LINE-CNT                                       13210099
132200                PV-NBR-OF-LINES.                                  13220099
132300                                                                  13230099
132400/                                                                 13240099
132500******************************************************            13250099
132600* 9040-PAGE-HEADERS.                                 *            13260099
132700******************************************************            13270099
132800 9040-PAGE-HEADERS.                                               13280099
132900                                                                  13290099
133000     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           13300099
133100         PERFORM 9050-REPORT-HEADERS                              13310099
133200     END-IF.                                                      13320099
133300                                                                  13330099
133400     WRITE REPORT-RECORD FROM HDR02-LINE                          13340099
133500            AFTER ADVANCING 2 LINES.                              13350099
133600     WRITE REPORT-RECORD FROM HDR03-LINE                          13360099
133700            AFTER ADVANCING 1 LINE.                               13370099
133800     WRITE REPORT-RECORD FROM HDR04-LINE                          13380099
133900            AFTER ADVANCING 1 LINE.                               13390099
134000     WRITE REPORT-RECORD FROM HDR05-LINE                          13400099
134100            AFTER ADVANCING 1 LINE.                               13410099
134200     WRITE REPORT-RECORD FROM HDR06-LINE                          13420099
134300            AFTER ADVANCING 1 LINES.                              13430099
134400                                                                  13440099
134500     ADD  +7 TO PV-LINE-CNT.                                      13450099
134600/                                                                 13460099
134700******************************************************            13470099
134800* 9050-REPORT-HEADERS.                               *            13480099
134900******************************************************            13490099
135000 9050-REPORT-HEADERS.                                             13500099
135100                                                                  13510099
135200     ADD +1           TO PV-PAGE-CNT.                             13520099
135300* CLP 06/05/13 PR#4158B START                                     13530099
135400     MOVE PV-PAGE-CNT TO DP250O-PAGE-NUMBER.                      13540099
135500                                                                  13550099
135600     WRITE REPORT-RECORD FROM DP250O-STANDRD-HEADER-250-COLS      13560099
135700* CLP 06/05/13 PR#4158B END                                       13570099
135800            AFTER ADVANCING PAGE.                                 13580099
135900     WRITE REPORT-RECORD FROM HDR01-LINE                          13590099
136000            AFTER ADVANCING 1 LINE.                               13600099
136100                                                                  13610099
136200     MOVE +2 TO PV-LINE-CNT.                                      13620099
136300/                                                                 13630099
