000100 IDENTIFICATION DIVISION.                                         00010000
000200 TITLE 'MANIFESTING - AUDIT FUNCTION SUB MENU'.                   00020000
000500                                                                  00050000
000600 PROGRAM-ID.             PCKRF895.                                00060000
000700 AUTHOR.                 GERMAN BANDA.                            00070000
000800 INSTALLATION.           KOHLS.                                   00080000
000900 DATE-WRITTEN            JULY,2001.                               00090000
001000 DATE-COMPILED.                                                   00100000
001100                                                                  00110000
001200******************************************************************00120000
001300 ENVIRONMENT DIVISION.                                            00130000
001400******************************************************************00140000
001500                                                                  00150000
001600******************************************************************00160000
001700 DATA DIVISION.                                                   00170000
001800******************************************************************00180000
001900                                                                  00190000
002000******************************************************************00200000
002100 WORKING-STORAGE SECTION.                                         00210000
002200******************************************************************00220000
002300 01  CA-COMMAREA.                                                 00230000
002310     COPY PCWS233.                                                00231000
003000     05  CA-PROGRAM-DATA.                                         00300000
003100         10  CA-SELECTION-X              PIC  X(01)  VALUE SPACE. 00310000
003200         10  CA-SELECTION  REDEFINES  CA-SELECTION-X              00320000
003300                                         PIC  9(01).              00330000
003400             88  CA-VALID-SELECTION                  VALUE        00340000
003500                 1 2 3.                                           00350000
003600             88  CA-SELECTION-ONE                    VALUE 1.     00360000
003700             88  CA-SELECTION-TWO                    VALUE 2.     00370000
003710             88  CA-SELECTION-THREE                  VALUE 3.     00371000
003800                                                                  00380000
003900 01  PC-PROGRAM-CONSTANTS.                                        00390000
004200     05  PC-TRANSFER-DOWN-LENGTH         PIC S9(04)  VALUE +9     00420000
004300                                                     COMP.        00430000
004400     05  PC-CURRENT-PROGRAM-NAME         PIC  X(08)  VALUE        00440000
004500         'PCKRF895'.                                              00450000
004700     05  PC-PREV-MENU-PROGRAM            PIC  X(08)               00470000
004800                                              VALUE  'PCKRF892'.  00480000
004810     05  PC-OPEN-TRAILER-SCREEN          PIC  X(08)               00481000
004820                                              VALUE 'PCKRF870'.   00482000
004830     05  PC-STARTED-TRLR-AUDIT           PIC  X(08)               00483000
004840                                              VALUE 'PCKRF893'.   00484000
004900     05  PC-MENU-TRANID                  PIC  X(04)  VALUE 'E892'.00490000
005000     05  PC-CURRENT-TRANID               PIC  X(04)  VALUE 'E895'.00500000
005200     05  PC-END-OF-SESSION-MSG           PIC  X(19)  VALUE        00520000
005300         'END OF SESSION     '.                                   00530000
005400     05  PC-INVALID-SELECTION-MSG        PIC  X(19)  VALUE        00540000
005500         'INVALID SELECTION  '.                                   00550000
005600     05  PC-UNRECOGNIZED-PF-KEY-MSG      PIC  X(19)  VALUE        00560000
005700         'UNRECOGNIZED PF KEY'.                                   00570000
005800     05  PC-ACCESS-NOT-ALLOWED-MSG       PIC  X(19)  VALUE        00580000
005900         'USER NOT AUTHORIZED'.                                   00590000
006000     05  PC-NON-NUMERIC-SELECTION-MSG    PIC  X(19)  VALUE        00600000
006100         'NUMERIC VALUE REQ. '.                                   00610000
006200     05  PC-PROGRAM-FUNCTION-KEYS        PIC  X(19)  VALUE        00620000
006300         'F0 =END            '.                                   00630000
006400     05  PC-TRANS-UNAVAILABLE-MSG        PIC  X(19)  VALUE        00640000
006500         'TRANS NOT AVAILABLE'.                                   00650000
006600     05  PC-CICS-ABEND-MSG               PIC  X(19)  VALUE        00660000
006700         'CICS ABEND -CALL DP'.                                   00670000
006800     05  PC-CICSAUTH-MSG                 PIC  X(19)  VALUE        00680000
006900         'CICSAUTH BAD RETURN'.                                   00690000
007000     05  PC-UNAVAIL-SELECTION-MSG        PIC X(19)   VALUE        00700000
007100         'SELECTION NOT AVAIL'.                                   00710000
007200                                                                  00720000
007300                                                                  00730000
008400                                                                  00840000
008500 01  PS-PROGRAM-SWITCHES.                                         00850000
008600     05  PS-ACCESS-ALLOWED-IND           PIC  X(01)  VALUE 'N'.   00860000
008700         88  PS-NO-ACCESS-ALLOWED                    VALUE 'N'.   00870000
008800         88  PS-ACCESS-ALLOWED                       VALUE 'Y'.   00880000
008900                                                                  00890000
009000                                                                  00900000
009100 01  PV-PROGRAM-VARIABLES.                                        00910000
009200     05  PV-MESSAGE-AREA                 PIC  X(19)  VALUE SPACE. 00920000
009300     05  PV-CICS-RESPONSE                PIC S9(08)  VALUE ZEROS  00930000
009400                                                     COMP SYNC.   00940000
009500     05  PV-TRANSFER-PROGRAM             PIC  X(08)  VALUE SPACE. 00950000
009510     05  PV-COMMAREA-LENGTH              PIC S9(04)  VALUE +0     00951000
009520                                                     COMP SYNC.   00952000
009600                                                                  00960000
009700******************************************************************00970000
009800*  LAYOUT FOR THE AUDIT PROCESS SCREENS                           00980000
009900******************************************************************00990000
010000     COPY PCWS045.                                                01000000
010100                                                                  01010000
010110******************************************************************01011000
010120*  LAYOUT FOR THE ABEND MODULE COMMUNICATIONS AREA.               01012000
010130******************************************************************01013000
010140     COPY DPWS013.                                                01014000
010150                                                                  01015000
010200******************************************************************01020000
010300*    COPY BOOK FOR THE CICSAUTH SUBROUTINE                        01030000
010400******************************************************************01040000
010500     COPY DPWS008.                                                01050000
010600                                                                  01060000
010700******************************************************************01070000
010800*  SENDING/RECEIVING AREA FOR THE NUMERIC EDIT ROUTINE (DPKUT100) 01080000
010900******************************************************************01090000
011000     COPY DPWS010I.                                               01100000
011100                                                                  01110000
011200******************************************************************01120000
011300*  GENERATED DSECT FOR THE PCKM895 MAPSET                         01130000
011400******************************************************************01140000
011500     COPY PCKM895.                                                01150000
011600                                                                  01160000
011700******************************************************************01170000
011800*  KOHL'S STANDARD ATTRIBUTE AND PRINTER CONTROL CHARACTER LIST   01180000
011900******************************************************************01190000
012000     COPY DPWS015.                                                01200000
012100                                                                  01210000
012200******************************************************************01220000
012300*  KOHL'S STANDARD ATTENTION IDENTIFIER LIST                      01230000
012400******************************************************************01240000
012500     COPY DFHAID.                                                 01250000
012600                                                                  01260000
012610******************************************************************01261000
012620*  DCLGEN LAYOUT AND COBOL DECLARATION FOR THE SHIPPING UNIT      01262000
012630*  AUDIT TABLE (TSUNAUD)                                          01263000
012640******************************************************************01264000
012641     EXEC SQL                                                     01264100
012642         INCLUDE TSUNAUD                                          01264200
012643     END-EXEC.                                                    01264300
012680                                                                  01268000
012690******************************************************************01269000
012691*  COMMUNICATIONS AREA FOR DB2                                    01269100
012692******************************************************************01269200
012693     EXEC SQL                                                     01269300
012694       INCLUDE SQLCA                                              01269400
012695     END-EXEC.                                                    01269500
012696                                                                  01269600
012700******************************************************************01270000
012800 LINKAGE SECTION.                                                 01280000
012900******************************************************************01290000
013010 01  DFHCOMMAREA.                                                 01301000
013020     05  FILLER                         OCCURS  1 TO 4072 TIMES   01302000
013030                                      DEPENDING ON EIBCALEN.      01303000
013040         10  FILLER                   PIC X.                      01304000
013100                                                                  01310000
013200******************************************************************01320000
013300 PROCEDURE DIVISION.                                              01330000
013400******************************************************************01340000
013500 0000-PROGRAM-MAINLINE.                                           01350000
013510     INITIALIZE  CA-COMMAREA                                      01351000
013511                 PC045-COMMAREA-REC.                              01351100
013520     MOVE DFHCOMMAREA                TO CA-COMMAREA.              01352000
013530     MOVE PC233-HOST-SAVE-AREA       TO PC045-COMMAREA-REC.       01353000
013700     MOVE LOW-VALUES                 TO PC895AI.                  01370000
013800                                                                  01380000
013900     EVALUATE TRUE                                                01390000
014000         WHEN EIBCALEN = ZERO                                     01400000
014100         WHEN EIBAID = DFHCLEAR                                   01410000
014200         WHEN PC233-INITIALIZE-SCREEN                             01420000
014210              SET PC233-PROCESS-SCREEN  TO TRUE                   01421000
014300              MOVE PC045-TRLR-SRL-NBR   TO ATRLRO                 01430000
014400              MOVE PC045-AUDIT-CNTL-NBR TO AAUDNBRO               01440000
014500              IF PC045-100-AUDIT-CHECK                            01450000
014510                 MOVE '100%'            TO ATYPEO                 01451000
014520              ELSE                                                01452000
014530                 MOVE 'SPOT'            TO ATYPEO                 01453000
014540              END-IF                                              01454000
014600              PERFORM 8000-SEND-MAP                               01460000
014700              PERFORM 8200-RETURN-TRANID                          01470000
014800         WHEN EIBAID = DFHENTER                                   01480000
014900              PERFORM 1000-RECEIVE-MAP                            01490000
015000              PERFORM 1100-EDIT-SELECTION                         01500000
015100                                                                  01510000
015200         WHEN EIBAID = DFHPF3                                     01520000
015210*             SHOULD XCTL TO PCKRF892                             01521001
015300              MOVE PC233-ROOT-PROGRAM                             01530000
015400                                     TO PV-TRANSFER-PROGRAM       01540000
015410              MOVE 'PCKRF895'                                     01541000
015420                                     TO PC233-LAST-PROGRAM        01542000
015500              PERFORM 2100-XCTL-TO-SELECTED-PROGRAM               01550000
015600                                                                  01560000
015700         WHEN OTHER                                               01570000
015800              MOVE PC-UNRECOGNIZED-PF-KEY-MSG                     01580000
015900                                     TO AMSGLNO                   01590000
016000              PERFORM 8100-SEND-DATA-ONLY                         01600000
016100              PERFORM 8200-RETURN-TRANID                          01610000
016200     END-EVALUATE.                                                01620000
016300                                                                  01630000
016400     GOBACK.                                                      01640000
016500*                                                                 01650000
016600*                                                                 01660000
016700 1000-RECEIVE-MAP.                                                01670000
016800     EXEC CICS                                                    01680000
016900         RECEIVE MAP    ('PC895A')                                01690000
017000                 MAPSET ('PCKM895')                               01700000
017100                 RESP   (PV-CICS-RESPONSE)                        01710000
017200     END-EXEC.                                                    01720000
017300                                                                  01730000
017400     EVALUATE TRUE                                                01740000
017500         WHEN PV-CICS-RESPONSE = DFHRESP (NORMAL)                 01750000
017600              PERFORM 1010-RECEIVE-SCREEN-FIELDS                  01760000
017700         WHEN PV-CICS-RESPONSE = DFHRESP (MAPFAIL)                01770000
017800              CONTINUE                                            01780000
017900         WHEN OTHER                                               01790000
018000              MOVE '1000-RECEIVE-MAP'                             01800000
018100                                     TO DP013-PARAGRAPH           01810000
018200              MOVE 'UNABLE TO RECEIVE MAP'                        01820000
018300                                     TO DP013-MESSAGE-TEXT (1)    01830000
018400              SET DP013-LOGIC-ABEND  TO TRUE                      01840000
018500              SET DP013-NO-ROLLBACK  TO TRUE                      01850000
018600              PERFORM 9999-WRITE-MESSAGE-TO-CICS-LOG              01860000
018700     END-EVALUATE.                                                01870000
018800*                                                                 01880000
018900*                                                                 01890000
019000 1010-RECEIVE-SCREEN-FIELDS.                                      01900000
019100     IF  ASELECTL > ZERO                                          01910000
019200         MOVE ASELECTI               TO CA-SELECTION-X            01920000
019300     END-IF.                                                      01930000
019400*                                                                 01940000
019500*                                                                 01950000
019600 1100-EDIT-SELECTION.                                             01960000
019700     MOVE CA-SELECTION-X             TO DP010I-UNEDITED-FIELD.    01970000
019800     MOVE 1                          TO DP010I-MAXIMUM-DIGITS.    01980000
019900     MOVE 0                          TO DP010I-MAXIMUM-DECIMALS.  01990000
020000     SET DP010I-NEGATIVE-NOT-ALLOWED TO TRUE.                     02000000
020100                                                                  02010000
020210     CALL DP010I-NUMERIC-EDIT-ROUTINE                             02021005
020220                         USING DP010I-NUMERIC-EDIT-AREA           02022005
020300                                                                  02030000
020400     IF  DP010I-ERROR-DETECTED                                    02040000
020500         MOVE PC-NON-NUMERIC-SELECTION-MSG                        02050000
020600                                     TO AMSGLNO                   02060000
020700         PERFORM 8100-SEND-DATA-ONLY                              02070000
020800         PERFORM 8200-RETURN-TRANID                               02080000
020900     ELSE                                                         02090000
021000         MOVE DP010I-NUMERIC-FIELD   TO CA-SELECTION              02100000
021100     END-IF.                                                      02110000
021110                                                                  02111000
021200     EVALUATE TRUE                                                02120000
021300     WHEN CA-VALID-SELECTION                                      02130000
021400         PERFORM 2200-PROCESS-SELECT-TYPE                         02140000
021410         PERFORM 2000-PROCESS-SELECTION                           02141000
021500     WHEN OTHER                                                   02150000
021600         MOVE DP015-UNP-NUM-BRT-MDT  TO ASELECTA                  02160000
021700         MOVE PC-INVALID-SELECTION-MSG                            02170000
021800                                     TO AMSGLNO                   02180000
021900         PERFORM 8100-SEND-DATA-ONLY                              02190000
022000         PERFORM 8200-RETURN-TRANID                               02200000
022100     END-EVALUATE.                                                02210000
022200*                                                                 02220000
022300*                                                                 02230000
022400 2000-PROCESS-SELECTION.                                          02240000
022500      IF CA-SELECTION-ONE                                         02250000
022600         MOVE PC045-OPER-UNT-ID TO PC233-OPER-UNT-ID              02260002
022700         MOVE PC045-USERID      TO PC233-USER-ID                  02270002
022900         MOVE PC-OPEN-TRAILER-SCREEN TO PV-TRANSFER-PROGRAM       02290000
023000         PERFORM 2100-XCTL-TO-SELECTED-PROGRAM                    02300000
023100      ELSE                                                        02310000
023110         MOVE PC-STARTED-TRLR-AUDIT  TO PV-TRANSFER-PROGRAM       02311000
023300         PERFORM 2100-XCTL-TO-SELECTED-PROGRAM                    02330000
023400      END-IF.                                                     02340000
024100*                                                                 02410000
024200*                                                                 02420000
024300 2100-XCTL-TO-SELECTED-PROGRAM.                                   02430000
024400     SET PC233-INITIALIZE-SCREEN     TO TRUE.                     02440000
024401     MOVE PC-CURRENT-PROGRAM-NAME    TO PC233-LAST-PROGRAM.       02440103
024402     MOVE PC045-COMMAREA-REC         TO PC233-HOST-SAVE-AREA.     02440203
024410     MOVE LENGTH OF CA-COMMAREA      TO PV-COMMAREA-LENGTH.       02441000
024600                                                                  02460000
024700     EXEC CICS                                                    02470000
024800         XCTL                                                     02480000
024900             PROGRAM   (PV-TRANSFER-PROGRAM)                      02490000
025000             COMMAREA  (CA-COMMAREA)                              02500000
025100             LENGTH    (PV-COMMAREA-LENGTH)                       02510000
025200             RESP      (PV-CICS-RESPONSE)                         02520000
025300     END-EXEC.                                                    02530000
025400                                                                  02540000
025500     EVALUATE TRUE                                                02550000
025600         WHEN PV-CICS-RESPONSE = DFHRESP (NORMAL)                 02560000
025700              CONTINUE                                            02570000
025800         WHEN OTHER                                               02580000
025900              MOVE '2100-XCTL-TO-SELECTED-PROGRAM'                02590000
026000                                     TO DP013-PARAGRAPH           02600000
026100              MOVE 'UNABLE TO XCTL THE FOLLOWING PROGRAM: '       02610000
026200                                     TO DP013-MESSAGE-TEXT (1)    02620000
026300              MOVE PV-TRANSFER-PROGRAM                            02630000
026400                                     TO DP013-MESSAGE-TEXT (2)    02640000
026500              SET DP013-CICS-ABEND   TO TRUE                      02650000
026600              SET DP013-NO-ROLLBACK  TO TRUE                      02660000
026700              PERFORM 9999-WRITE-MESSAGE-TO-CICS-LOG              02670000
026800              MOVE PC-TRANS-UNAVAILABLE-MSG                       02680000
026900                                     TO AMSGLNO                   02690000
027000              SET PC233-PROCESS-SCREEN  TO TRUE                   02700000
027100              PERFORM 8100-SEND-DATA-ONLY                         02710000
027200              PERFORM 8200-RETURN-TRANID                          02720000
027300     END-EVALUATE.                                                02730000
027400*                                                                 02740000
027410 2200-PROCESS-SELECT-TYPE.                                        02741000
027411                                                                  02741100
027412**WHEN AUDITING TO A DIFFERENT TRAILER, THE DEST TYP CDE IS       02741204
027413**UPDATED IN THE OPEN TRAILER PROGRAM(PCKRF870)                   02741304
027414**THIS IS DONE SO THE TABLE IS NOT INCORRECTLY UPDATED IF THE     02741404
027415**ASSOCIATE XCTL TO OPEN TRAILER AND THAN BACKS OUT(F3) WITHOUT   02741504
027416**CREATING THE DEST TRIP                                          02741604
027417                                                                  02741704
027418     EVALUATE TRUE                                                02741804
027419       WHEN CA-SELECTION-ONE                                      02741904
027420           MOVE 'D'  TO SUNAUD-DEST-TYP-CDE                       02742004
027421       WHEN CA-SELECTION-TWO                                      02742104
027422           MOVE 'S'  TO SUNAUD-DEST-TYP-CDE                       02742204
027423           PERFORM 2210-UPDATE-TSUNAUD                            02742304
027424       WHEN CA-SELECTION-THREE                                    02742404
027425           MOVE 'C'  TO SUNAUD-DEST-TYP-CDE                       02742504
027426           PERFORM 2210-UPDATE-TSUNAUD                            02742604
027427     END-EVALUATE.                                                02742704
027428                                                                  02742804
027429     MOVE SUNAUD-DEST-TYP-CDE   TO PC045-DEST-TYP-CDE.            02742904
027430                                                                  02743004
027431 2210-UPDATE-TSUNAUD.                                             02743100
027432                                                                  02743200
027433     MOVE PC045-AUDIT-CNTL-NBR TO  SUNAUD-AUD-CNTL-NBR.           02743300
027434                                                                  02743400
027435                                                                  02743500
027436     EXEC SQL                                                     02743600
027437          UPDATE TSUNAUD                                          02743700
027440             SET                                                  02744000
027450                  DEST_TYP_CDE       = :SUNAUD-DEST-TYP-CDE       02745000
027460           WHERE  AUD_CNTL_NBR       = :SUNAUD-AUD-CNTL-NBR       02746000
027470     END-EXEC.                                                    02747000
027471                                                                  02747100
027500*                                                                 02750000
027600 8000-SEND-MAP.                                                   02760000
027700     EXEC CICS                                                    02770000
027800         SEND MAP       ('PC895A')                                02780000
027900              MAPSET    ('PCKM895')                               02790000
028000              ERASE                                               02800000
028100              RESP      (PV-CICS-RESPONSE)                        02810000
028200     END-EXEC.                                                    02820000
028300                                                                  02830000
028400     EVALUATE TRUE                                                02840000
028500         WHEN PV-CICS-RESPONSE = DFHRESP (NORMAL)                 02850000
028600              CONTINUE                                            02860000
028700         WHEN OTHER                                               02870000
028800              MOVE '8000-SEND-MAP'   TO DP013-PARAGRAPH           02880000
028900              MOVE 'UNABLE TO SEND MAP'                           02890000
029000                                     TO DP013-MESSAGE-TEXT (1)    02900000
029100              SET DP013-CICS-ABEND   TO TRUE                      02910000
029200              SET DP013-NO-ROLLBACK  TO TRUE                      02920000
029300              PERFORM 9999-WRITE-MESSAGE-TO-CICS-LOG              02930000
029400     END-EVALUATE.                                                02940000
029500*                                                                 02950000
029600*                                                                 02960000
029700 8100-SEND-DATA-ONLY.                                             02970000
029800     MOVE -1 TO ASELECTL.                                         02980000
029900                                                                  02990000
030000     EXEC CICS                                                    03000000
030100         SEND MAP       ('PC895A')                                03010000
030200              MAPSET    ('PCKM895')                               03020000
030300              CURSOR                                              03030000
030400              DATAONLY                                            03040000
030500              RESP      (PV-CICS-RESPONSE)                        03050000
030600     END-EXEC.                                                    03060000
030700                                                                  03070000
030800     EVALUATE TRUE                                                03080000
030900         WHEN PV-CICS-RESPONSE = DFHRESP (NORMAL)                 03090000
031000              CONTINUE                                            03100000
031100         WHEN OTHER                                               03110000
031200              MOVE '8100-SEND-DATA-ONLY'                          03120000
031300                                     TO DP013-PARAGRAPH           03130000
031400              MOVE 'UNABLE TO SEND DATA'                          03140000
031500                                     TO DP013-MESSAGE-TEXT (1)    03150000
031600              SET DP013-CICS-ABEND   TO TRUE                      03160000
031700              SET DP013-NO-ROLLBACK  TO TRUE                      03170000
031800              PERFORM 9999-WRITE-MESSAGE-TO-CICS-LOG              03180000
031900     END-EVALUATE.                                                03190000
032000*                                                                 03200000
032100*                                                                 03210000
032200 8200-RETURN-TRANID.                                              03220000
032210     MOVE LENGTH OF CA-COMMAREA       TO PV-COMMAREA-LENGTH       03221000
032300     EXEC CICS                                                    03230000
032400         RETURN TRANSID   (PC-CURRENT-TRANID)                     03240000
032500                COMMAREA  (CA-COMMAREA)                           03250000
032600                LENGTH    (PV-COMMAREA-LENGTH)                    03260000
032700                RESP      (PV-CICS-RESPONSE)                      03270000
032800     END-EXEC.                                                    03280000
032900                                                                  03290000
033000     EVALUATE TRUE                                                03300000
033100         WHEN PV-CICS-RESPONSE = DFHRESP (NORMAL)                 03310000
033200              CONTINUE                                            03320000
033300         WHEN OTHER                                               03330000
033400              MOVE '8200-RETURN-TRANID'                           03340000
033500                                     TO DP013-PARAGRAPH           03350000
033600              MOVE 'UNABLE TO RETURN TO TRANID'                   03360000
033700                                     TO DP013-MESSAGE-TEXT (1)    03370000
033800              SET DP013-CICS-ABEND   TO TRUE                      03380000
033900              SET DP013-NO-ROLLBACK  TO TRUE                      03390000
034000              PERFORM 9999-WRITE-MESSAGE-TO-CICS-LOG              03400000
034100     END-EVALUATE.                                                03410000
034200*                                                                 03420000
038800*                                                                 03880000
038900 9999-WRITE-MESSAGE-TO-CICS-LOG.                                  03890000
039000     MOVE PC-CURRENT-PROGRAM-NAME    TO DP013-PROGRAM.            03900000
039100     MOVE DFHEIBLK                   TO DP013-DFHEIBLK.           03910000
039200     INITIALIZE DP013-SRC-TASK-NUMBER                             03920000
039300                DP013-STACK.                                      03930000
039400     SET DP013-LINK-RETURN           TO TRUE.                     03940000
039500                                                                  03950000
039600     EXEC CICS                                                    03960000
039700         LINK                                                     03970000
039800             PROGRAM   (DP013-NAME)                               03980000
039900             COMMAREA  (DP013-PARAMETERS)                         03990000
040000             LENGTH    (DP013-LENGTH)                             04000000
040100     END-EXEC.                                                    04010000
