000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300***************************************************************** 00030000
000400                                                                  00040000
000500 PROGRAM-ID.             PCKRP034.                                00050000
000600 AUTHOR.                 BRENDA ROCKWELL.                         00060000
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070000
000800 DATE-WRITTEN            DECEMBER, 2011.                          00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100***************************************************************** 00110000
001200*                                                               * 00120000
001300* THIS PROGRAM WILL CREATE/PRINT THE EFC INBOUND CARTON         * 00130000
001400* FORECAST SUMMARY REPORT.                                      * 00140000
001500*                                                               * 00150000
001600***************************************************************** 00160000
001700*  CHANGE LOG.                                                    00170000
001800*  DATE         CHANGED BY      DESC                              00180000
001900*  -----------  --------------  --------------------------------- 00190000
002000*  12/12/2011   B. ROCKWELL   - EFC OPTIMIZATION AND HOLIDAY PREP 00200000
002100*                               NEW PROGRAM  PROJ ID:   3253      00210000
002200*                                             WR/IR#:   WR40392   00220000
002300***************************************************************** 00230000
002400                                                                  00240000
002500***************************************************************** 00250000
002600 ENVIRONMENT DIVISION.                                            00260000
002700***************************************************************** 00270000
002800                                                                  00280000
002900 CONFIGURATION SECTION.                                           00290000
003000 SOURCE-COMPUTER.        IBM-3090.                                00300000
003100 OBJECT-COMPUTER.        IBM-3090.                                00310000
003200                                                                  00320000
003300 INPUT-OUTPUT SECTION.                                            00330000
003400                                                                  00340000
003500 FILE-CONTROL.                                                    00350000
003600                                                                  00360000
003700     SELECT INPUT01-FILE       ASSIGN TO INP01.                   00370000
003800     SELECT REPORT-FILE        ASSIGN TO RPT01.                   00380000
003900                                                                  00390000
004000***************************************************************** 00400000
004100 DATA DIVISION.                                                   00410000
004200***************************************************************** 00420000
004300                                                                  00430000
004400 FILE SECTION.                                                    00440000
004500                                                                  00450000
004600 FD  INPUT01-FILE                                                 00460000
004700     LABEL RECORDS ARE STANDARD                                   00470000
004800     RECORDING MODE IS F                                          00480000
004900     BLOCK CONTAINS 0 RECORDS                                     00490000
005000     RECORD CONTAINS 400 CHARACTERS.                              00500000
005100 01  INPUT01-RECORD                  PIC X(400).                  00510000
005200                                                                  00520000
005300 FD  REPORT-FILE                                                  00530000
005400     RECORDING MODE IS F                                          00540000
005500     BLOCK CONTAINS 0  RECORDS.                                   00550000
005600 01  REPORT-RECORD                   PIC  X(200).                 00560041
005700                                                                  00570000
005800 WORKING-STORAGE SECTION.                                         00580000
005900                                                                  00590000
006000 01  PROGRAM-SWITCHES.                                            00600000
006100     05  PS-END-OF-INPUT-SW          PIC  X(01)    VALUE 'N'.     00610000
006200         88  PS-END-OF-INPUT                       VALUE 'Y'.     00620000
006300     05  PS-FIRST-TIME-SW            PIC  X(01)    VALUE 'Y'.     00630000
006400         88  PS-FIRST-TIME                         VALUE 'Y'.     00640000
006500     05  PS-FIRST-TIME-UPF-SW        PIC  X(01)    VALUE 'Y'.     00650000
006600         88  PS-FIRST-TIME-UPF                     VALUE 'Y'.     00660000
006700         88  PS-FIRST-TIME-UPF-NO                  VALUE 'N'.     00670000
006800     05  PS-FIRST-TIME-PF-SW         PIC  X(01)    VALUE 'Y'.     00680000
006900         88  PS-FIRST-TIME-PF                      VALUE 'Y'.     00690000
007000         88  PS-FIRST-TIME-PF-NO                   VALUE 'N'.     00700000
007100                                                                  00710000
007200 01  PC-CONSTANTS.                                                00720000
007300     05  PC-PROGRAM-NAME             PIC  X(08) VALUE 'PCKRP034'. 00730000
007400     05  PC-REPORT-NBR               PIC  X(02) VALUE '-1'.       00740000
007500     05  PC-IN-DOORS                 PIC  X(26) VALUE             00750000
007600                                     'IN DOORS                  '.00760000
007700     05  PC-ENROUTE                  PIC  X(26) VALUE             00770000
007800                                     'ENROUTE                   '.00780000
007900     05  PC-YARD                     PIC  X(26) VALUE             00790000
008000                                     'YARD                      '.00800000
008100     05  PC-ENROUTE-TO-DC            PIC  X(26) VALUE             00810000
008200                                     'ENROUTE TO DC             '.00820000
008300     05  PC-IN-YARD-AT-DC            PIC  X(26) VALUE             00830000
008400                                     'IN YARD AT DC             '.00840000
008410     05  PC-IN-DOOR-AT-DC            PIC  X(26) VALUE             00841000
008420                                     'IN DOOR AT DC             '.00842000
008430     05  PC-DOOR-OPEN                PIC  X(26) VALUE             00843000
008440                                     'DOOR OPEN (DO)            '.00844000
008450     05  PC-DOOR-CLOSED              PIC  X(26) VALUE             00845000
008460                                     'DOOR CLOSED (DC)          '.00846000
008470     05  PC-DC-SHIPPED               PIC  X(26) VALUE             00847000
008480                                     'DC SHIPPED (DS)           '.00848000
008490     05  PC-STORE-OPEN               PIC  X(26) VALUE             00849000
008500                                     'STORE OPEN (SO)           '.00850000
008600                                                                  00860000
008700 01  PV-MISC-FIELDS.                                              00870000
008800     05  PV-LINE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00880000
008900     05  PV-NBR-OF-LINES             PIC S9(05) COMP-3 VALUE +0.  00890000
009000     05  PV-LINE-LIMIT               PIC S9(03) COMP-3 VALUE +57. 00900000
009100     05  PV-PAGE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00910000
009200     05  PV-COUNTERS.                                             00920000
009300         10  PV-NBR-TRAILERS         PIC S9(9) COMP-3 VALUE +0.   00930000
009400         10  PV-NBR-POS              PIC S9(9) COMP-3 VALUE +0.   00940000
009500         10  PV-NBR-CTNS             PIC S9(9) COMP-3 VALUE +0.   00950000
009600         10  PV-NBR-UNITS            PIC S9(9) COMP-3 VALUE +0.   00960000
009700         10  PV-NBR-NEW-SKUS         PIC S9(9) COMP-3 VALUE +0.   00970000
009800         10  PV-NBR-CTNS-TRBL        PIC S9(9) COMP-3 VALUE +0.   00980000
009801* DMH 07/2014 CONTROLLED FLOW                                     00980141
009810         10  PV-NBR-CTNS-CNTL        PIC S9(9) COMP-3 VALUE +0.   00981041
009821         10  PV-NBR-UNIT-CNTL        PIC S9(9) COMP-3 VALUE +0.   00982145
009823* DMH 07/2014 HAZARDOUS COUNTS                                    00982345
009830         10  PV-NBR-CTNS-HAZ         PIC S9(9) COMP-3 VALUE +0.   00983041
009840         10  PV-NBR-UNIT-HAZ        PIC S9(9) COMP-3 VALUE +0.    00984045
009900     05  PV-TOTALS.                                               00990000
010000         10  PV-TOT-TRAILERS         PIC S9(9) COMP-3 VALUE +0.   01000000
010010         10  PV-TOT-POS              PIC S9(9) COMP-3 VALUE +0.   01001000
010020         10  PV-TOT-CTNS             PIC S9(9) COMP-3 VALUE +0.   01002000
010030         10  PV-TOT-UNITS            PIC S9(9) COMP-3 VALUE +0.   01003000
010040         10  PV-TOT-NEW-SKUS         PIC S9(9) COMP-3 VALUE +0.   01004000
010050         10  PV-TOT-CTNS-TRBL        PIC S9(9) COMP-3 VALUE +0.   01005000
010051* DMH 07/2014 CONTROLLED FLOW                                     01005141
010052         10  PV-TOT-CTNS-CNTL        PIC S9(9) COMP-3 VALUE +0.   01005241
010053         10  PV-TOT-UNIT-CNTL        PIC S9(9) COMP-3 VALUE +0.   01005345
010055* DMH 07/2014 HAZARDOUS COUNTS                                    01005545
010056         10  PV-TOT-CTNS-HAZ         PIC S9(9) COMP-3 VALUE +0.   01005641
010057         10  PV-TOT-UNIT-HAZ         PIC S9(9) COMP-3 VALUE +0.   01005745
010060     05  PV-TODAYS-DATE.                                          01006000
010070         10  PV-TODAYS-DATE-CCYY     PIC  9(04)    VALUE ZERO.    01007000
010080         10  PV-TODAYS-DATE-MM       PIC  9(02)    VALUE ZERO.    01008000
010090         10  PV-TODAYS-DATE-DD       PIC  9(02)    VALUE ZERO.    01009000
010100     05  PV-TODAYS-TIME.                                          01010000
010200         10  PV-TODAYS-TIME-HH       PIC  9(02)    VALUE ZERO.    01020000
010300         10  PV-TODAYS-TIME-MM       PIC  9(02)    VALUE ZERO.    01030000
010400         10  PV-TODAYS-TIME-SS       PIC  9(02)    VALUE ZERO.    01040000
010500         10  FILLER                  PIC  9(02)    VALUE ZERO.    01050000
010600     05  PV-FORMAT-DATE.                                          01060000
010700         10  PV-FORMAT-DATE-MM       PIC  X(02)    VALUE SPACES.  01070000
010800         10  FILLER                  PIC  X(01)    VALUE '/'.     01080000
010900         10  PV-FORMAT-DATE-DD       PIC  X(02)    VALUE SPACES.  01090000
011000         10  FILLER                  PIC  X(01)    VALUE '/'.     01100000
011100         10  PV-FORMAT-DATE-YYYY     PIC  X(04)    VALUE SPACES.  01110000
011200     05  PV-PREV-LOCATION            PIC 9(04)         VALUE 0.   01120000
011300     05  PV-PREV-EFC                 PIC 9(04)         VALUE 0.   01130000
011400     05  PV-PREV-SLOC-IND            PIC X(01)     VALUE SPACES.  01140000
011500     05  PV-PREV-PROC-GROUP          PIC X(01)     VALUE SPACES.  01150000
011600****************************************************              01160000
011700* INPUT01 COPYBOOK                                 *              01170000
011800****************************************************              01180000
011900     COPY PCRD068.                                                01190000
012000****************************************************              01200000
012100* 132 BYTE REPORT HEADER                           *              01210000
012200****************************************************              01220000
012300     COPY DPWS200.                                                01230041
012400 01  HDR-LINES.                                                   01240000
012500     05  HDR01-LINE.                                              01250000
012600         10  FILLER                  PIC  X(30)    VALUE SPACES.  01260000
012700         10  FILLER                  PIC  X(35)    VALUE          01270000
012800             'EFC INBOUND CARTON FORECAST SUMMARY'.               01280000
012900         10  FILLER                  PIC  X(67)    VALUE SPACES.  01290000
013000     05  HDR02-LINE.                                              01300000
013100         10  FILLER                  PIC  X(50)    VALUE          01310000
013200         '-------TRAILER INFORMATION-------------------- ---'.    01320000
013300         10  FILLER                  PIC  X(39)    VALUE          01330041
013400         '------PO CNTS---------- --- OTHER ----'.                01340041
013401         10  FILLER                  PIC  X(19)    VALUE          01340153
013410         '---- CNTL FLOW ----'.                                   01341053
013420         10  FILLER                  PIC  X(20)    VALUE          01342055
013430         ' ----HAZ COUNTS ----'.                                  01343055
013500         10  FILLER                  PIC  X(25)    VALUE SPACES.  01350055
013600     05  HDR03-LINE.                                              01360000
013700         10  FILLER                  PIC  X(50)    VALUE SPACES.  01370000
013800         10  FILLER                  PIC  X(39)    VALUE          01380041
013900         '                         #      #      '.               01390041
013910         10  FILLER                  PIC  X(15)    VALUE          01391041
013920         '               '.                                       01392044
013930         10  FILLER                  PIC  X(15)    VALUE          01393041
013940         '               '.                                       01394044
014000         10  FILLER                  PIC  X(32)    VALUE SPACES.  01400000
014100     05  HDR04-LINE.                                              01410000
014200         10  FILLER                  PIC  X(50)    VALUE          01420000
014300         '                                       TRAILER   #'.    01430000
014400         10  FILLER                  PIC  X(39)    VALUE          01440041
014500         '     #         #         NEW    CTNS   '.               01450041
014510         10  FILLER                  PIC  X(17)    VALUE          01451053
014520         '     #        #  '.                                     01452055
014530         10  FILLER                  PIC  X(19)    VALUE          01453056
014540         '        #        # '.                                   01454055
014600         10  FILLER                  PIC  X(26)    VALUE SPACES.  01460056
014700     05  HDR05-LINE.                                              01470000
014800         10  FILLER                  PIC  X(50)    VALUE          01480000
014900         ' EFC   DC     STATUS                    COUNT   PO'.    01490000
015000         10  FILLER                  PIC  X(39)    VALUE          01500041
015100         'S    CTNS      UNITS     SKUS   TRBL   '.               01510041
015110         10  FILLER                  PIC  X(19)    VALUE          01511053
015120         '     CNTS     UNITS'.                                   01512055
015130         10  FILLER                  PIC  X(20)    VALUE          01513055
015140         '      CNTS     UNITS'.                                  01514055
015200         10  FILLER                  PIC  X(25)    VALUE SPACES.  01520055
015300     05  HDR06-LINE.                                              01530000
015400         10  FILLER                  PIC  X(50)    VALUE          01540000
015500         '----- ----- -------------------------- ------- ---'.    01550000
015600         10  FILLER                  PIC  X(39)    VALUE          01560047
015700*        '--- --------- --------- ------ -------            '.    01570047
015710         '--- --------- --------- ------ ------- '.               01571047
015800         10  FILLER                  PIC  X(43)    VALUE          01580049
015810         '--------- --------- --------- ---------    '.           01581051
015900     05  BLANK-LINE                  PIC X(132)    VALUE SPACES.  01590000
016000                                                                  01600000
016100     05  UNPROCESSED-FREIGHT-HDR.                                 01610000
016200         10  UPF-HDR-EFC             PIC  ZZZZ9.                  01620000
016300         10  FILLER                  PIC  X(50)    VALUE          01630000
016400             ' UNPROCESSED FREIGHT FROM VENDORS                 '.01640000
016500         10  FILLER                  PIC  X(77)    VALUE SPACES.  01650000
016600     05  UNPROCESSED-FREIGHT-TOTAL-LINE.                          01660000
016700         10  UPF-TOT-EFC             PIC  ZZZZ9.                  01670000
016800         10  FILLER                  PIC  X(08)    VALUE SPACES.  01680000
016900         10  UPF-TOT-STATUS          PIC  X(26).                  01690000
017000         10  UPF-TOT-TRAILERS        PIC  ZZ,ZZ9  BLANK WHEN ZERO.01700000
017100         10  FILLER                  PIC  X(02)    VALUE SPACES.  01710000
017200         10  UPF-TOT-POS-TOTAL       PIC  ZZ,ZZ9  BLANK WHEN ZERO.01720000
017300         10  FILLER                  PIC  X(01)    VALUE SPACES.  01730000
017400         10  UPF-TOT-CTN-TOTAL       PIC  Z,ZZZ,ZZ9               01740000
017410                                                  BLANK WHEN ZERO.01741000
017500         10  FILLER                  PIC  X(01)    VALUE SPACES.  01750000
017600         10  UPF-TOT-UNIT-TOTAL      PIC  Z,ZZZ,ZZ9               01760000
017601                                                  BLANK WHEN ZERO.01760100
017700         10  FILLER                  PIC  X(01)    VALUE SPACES.  01770000
017800         10  UPF-TOT-NEW-SKUS        PIC  ZZ,ZZ9  BLANK WHEN ZERO.01780000
017900         10  FILLER                  PIC  X(01)    VALUE SPACES.  01790000
018000         10  UPF-TOT-CTNS-TRBL       PIC  ZZZ,ZZ9 BLANK WHEN ZERO.01800057
018010         10  FILLER                  PIC  X(01)    VALUE SPACES.  01801041
018011* DMH 07/2014 CONTROLLED FLOW                                     01801141
018020         10  UPF-TOT-CTNS-CNTL       PIC  Z,ZZZ,ZZ9               01802057
018030                                                  BLANK WHEN ZERO.01803057
018040         10  FILLER                  PIC  X(01)    VALUE SPACES.  01804041
018050         10  UPF-TOT-UNIT-CNTL       PIC  Z,ZZZ,ZZ9               01805057
018060                                                  BLANK WHEN ZERO.01806057
018101* DMH 07/2014 HAZARDOUS COUNTS                                    01810141
018110         10  FILLER                  PIC  X(01)    VALUE SPACES.  01811041
018120         10  UPF-TOT-CTNS-HAZ        PIC  Z,ZZZ,ZZ9               01812057
018130                                                  BLANK WHEN ZERO.01813057
018140         10  FILLER                  PIC  X(01)    VALUE SPACES.  01814041
018150         10  UPF-TOT-UNIT-HAZ        PIC  Z,ZZZ,ZZ9               01815057
018160                                                  BLANK WHEN ZERO.01816057
018170         10  FILLER                  PIC  X(44)    VALUE SPACES.  01817041
018200     05  PCKSLPS-HANGING-TOTAL-LINE.                              01820000
018300         10  PK-TOT-EFC              PIC  ZZZZ9   BLANK WHEN ZERO.01830000
018400         10  FILLER                  PIC  X(27)    VALUE          01840000
018500             ' PACKSLIPS HANGING         '.                       01850000
018600         10  FILLER                  PIC  X(15)    VALUE SPACES.  01860000
018700         10  PK-TOT-POS-TOTAL        PIC  ZZ,ZZ9  BLANK WHEN ZERO.01870000
018800         10  FILLER                  PIC  X(01)    VALUE SPACES.  01880000
018900         10  PK-TOT-CTN-TOTAL        PIC  Z,ZZZ,ZZ9               01890000
018910                                                  BLANK WHEN ZERO.01891000
019000         10  FILLER                  PIC  X(01)    VALUE SPACES.  01900000
019100         10  PK-TOT-UNIT-TOTAL       PIC  Z,ZZZ,ZZ9               01910000
019110                                                  BLANK WHEN ZERO.01911000
019200         10  FILLER                  PIC  X(67)    VALUE SPACES.  01920000
019300     05  PROCESSED-FREIGHT-HDR.                                   01930000
019400         10  PF-HDR-EFC              PIC  ZZZZ9   BLANK WHEN ZERO.01940000
019500         10  FILLER                  PIC  X(27)    VALUE          01950000
019600             ' PROCESSED FREIGHT FROM DC '.                       01960000
019700         10  PF-HDR-DC               PIC  ZZZZ9   BLANK WHEN ZERO.01970000
019800         10  FILLER                  PIC  X(95)    VALUE SPACES.  01980000
019900     05  PROCESSED-FREIGHT-TOTAL-LINE.                            01990000
020000         10  PF-TOT-EFC              PIC  ZZZZ9   BLANK WHEN ZERO.02000000
020100         10  FILLER                  PIC  X(01)    VALUE SPACES.  02010000
020200         10  PF-TOT-DC               PIC  ZZZZ9   BLANK WHEN ZERO.02020000
020300         10  FILLER                  PIC  X(02)    VALUE SPACES.  02030000
020400         10  PF-TOT-STATUS           PIC  X(26).                  02040000
020500         10  PF-TOT-TRAILERS         PIC  ZZ,ZZ9  BLANK WHEN ZERO.02050000
020600         10  FILLER                  PIC  X(02)    VALUE SPACES.  02060000
020700         10  PF-TOT-POS-TOTAL        PIC  ZZ,ZZ9  BLANK WHEN ZERO.02070000
020800         10  FILLER                  PIC  X(01)    VALUE SPACES.  02080000
020900         10  PF-TOT-CTN-TOTAL        PIC  Z,ZZZ,ZZ9               02090000
020910                                                  BLANK WHEN ZERO.02091000
021000         10  FILLER                  PIC  X(01)    VALUE SPACES.  02100000
021100         10  PF-TOT-UNIT-TOTAL       PIC  Z,ZZZ,ZZ9               02110000
021110                                                  BLANK WHEN ZERO.02111000
021200         10  FILLER                  PIC  X(01)    VALUE SPACES.  02120000
021300         10  PF-TOT-NEW-SKUS         PIC  ZZ,ZZ9  BLANK WHEN ZERO.02130000
021400         10  FILLER                  PIC  X(01)    VALUE SPACES.  02140000
021500         10  PF-TOT-CTNS-TRBL        PIC  ZZZ,ZZ9 BLANK WHEN ZERO.02150000
021501         10  FILLER                  PIC  X(01)    VALUE SPACES.  02150141
021502* DMH 07/2014 CONTROLLED FLOW                                     02150241
021503         10  PF-TOT-CTNS-CNTL        PIC  Z,ZZZ,ZZ9               02150357
021504                                                  BLANK WHEN ZERO.02150457
021505         10  FILLER                  PIC  X(01)    VALUE SPACES.  02150541
021506         10  PF-TOT-UNIT-CNTL        PIC  Z,ZZZ,ZZ9               02150657
021507                                                  BLANK WHEN ZERO.02150757
021508         10  FILLER                  PIC  X(01)    VALUE SPACES.  02150841
021509* DMH 07/2014 HAZARDOUS COUNTS                                    02150941
021510         10  PF-TOT-CTNS-HAZ         PIC  Z,ZZZ,ZZ9               02151057
021511                                                  BLANK WHEN ZERO.02151157
021512         10  FILLER                  PIC  X(01)    VALUE SPACES.  02151241
021513         10  PF-TOT-UNIT-HAZ         PIC  Z,ZZZ,ZZ9               02151357
021514                                                  BLANK WHEN ZERO.02151457
021515         10  FILLER                  PIC  X(44)    VALUE SPACES.  02151500
021520     05  GRAND-TOTAL-LINE.                                        02152000
021530         10  GT-TOT-EFC              PIC  ZZZZ9   BLANK WHEN ZERO.02153000
021540         10  FILLER                  PIC  X(34)                   02154000
021550                       VALUE '                    GRAND TOTALS: '.02155000
021560         10  GT-TOT-TRAILERS         PIC  ZZ,ZZ9  BLANK WHEN ZERO.02156000
021570         10  FILLER                  PIC  X(02)    VALUE SPACES.  02157000
021580         10  GT-TOT-POS-TOTAL        PIC  ZZ,ZZ9  BLANK WHEN ZERO.02158000
021590         10  FILLER                  PIC  X(01)    VALUE SPACES.  02159000
021600         10  GT-TOT-CTN-TOTAL        PIC  Z,ZZZ,ZZ9               02160000
021610                                                  BLANK WHEN ZERO.02161000
021700         10  FILLER                  PIC  X(01)    VALUE SPACES.  02170000
021800         10  GT-TOT-UNIT-TOTAL       PIC  Z,ZZZ,ZZ9               02180000
021810                                                  BLANK WHEN ZERO.02181000
021900         10  FILLER                  PIC  X(01)    VALUE SPACES.  02190000
022000         10  GT-TOT-NEW-SKUS         PIC  ZZ,ZZ9  BLANK WHEN ZERO.02200000
022100         10  FILLER                  PIC  X(01)    VALUE SPACES.  02210000
022200         10  GT-TOT-CTNS-TRBL        PIC  ZZZ,ZZ9 BLANK WHEN ZERO.02220000
022210         10  FILLER                  PIC  X(01)    VALUE SPACES.  02221041
022211* DMH 07/2014 CONTROLLED FLOW                                     02221141
022220         10  GT-TOT-CTNS-CNTL        PIC  Z,ZZZ,ZZ9               02222057
022230                                                  BLANK WHEN ZERO.02223057
022240         10  FILLER                  PIC  X(01)    VALUE SPACES.  02224041
022250         10  GT-TOT-UNIT-CNTL        PIC  Z,ZZZ,ZZ9               02225057
022260                                                  BLANK WHEN ZERO.02226057
022270         10  FILLER                  PIC  X(01)    VALUE SPACES.  02227041
022280* DMH 07/2014 HAZARDOUS                                           02228041
022290         10  GT-TOT-CTNS-HAZ         PIC  Z,ZZZ,ZZ9               02229057
022291                                                  BLANK WHEN ZERO.02229157
022292         10  FILLER                  PIC  X(01)    VALUE SPACES.  02229241
022293         10  GT-TOT-UNIT-HAZ         PIC  Z,ZZZ,ZZ9               02229357
022294                                                  BLANK WHEN ZERO.02229457
022300         10  FILLER                  PIC  X(44)    VALUE SPACES.  02230000
022400     05  END-OF-REPORT-LINE.                                      02240000
022500         10  FILLER                  PIC  X(44)    VALUE SPACES.  02250000
022600         10  FILLER                  PIC  X(45)    VALUE          02260000
022700             '*******   E N D   O F   R E P O R T   *******'.     02270000
022800         10  FILLER                  PIC  X(43)    VALUE SPACES.  02280000
022900     05  NO-DATA-TO-REPORT-LINE.                                  02290000
023000         10  FILLER                  PIC  X(40)    VALUE SPACES.  02300000
023100         10  FILLER                  PIC  X(52)    VALUE          02310000
023200         '*******  N O   D A T A   T O   R E P O R T   *******'.  02320000
023300         10  FILLER                  PIC  X(40)    VALUE SPACES.  02330000
023400                                                                  02340000
023500                                                                  02350000
023600 PROCEDURE DIVISION.                                              02360000
023700                                                                  02370000
023800     DISPLAY '*** PROGRAM PCKRP034 BEGINS ***'.                   02380000
023900******************************************************            02390000
024000* 0000-MAINLINE.                                     *            02400000
024100******************************************************            02410000
024200 0000-MAINLINE.                                                   02420000
024300                                                                  02430000
024400     PERFORM 0010-INITIALIZATION.                                 02440000
024500                                                                  02450000
024600     PERFORM 1000-PROCESS-INPUT                                   02460000
024700        THRU 1000-PROCESS-INPUT-EXIT                              02470000
024800         UNTIL PS-END-OF-INPUT.                                   02480000
024900                                                                  02490000
025000     PERFORM 0020-END-PROGRAM.                                    02500000
025100     DISPLAY '*** PROGRAM PCKRP034 ENDS   ***'.                   02510000
025200     GOBACK.                                                      02520000
025300                                                                  02530000
025400******************************************************            02540000
025500* 0010-INITIALIZATION.                               *            02550000
025600******************************************************            02560000
025700 0010-INITIALIZATION.                                             02570000
025800                                                                  02580000
025900     OPEN INPUT  INPUT01-FILE                                     02590000
026000          OUTPUT REPORT-FILE.                                     02600000
026100                                                                  02610000
026200     MOVE FUNCTION CURRENT-DATE (1:8) TO PV-TODAYS-DATE.          02620000
026300     ACCEPT PV-TODAYS-TIME   FROM TIME.                           02630000
026400                                                                  02640000
026500     MOVE PV-TODAYS-DATE-MM      TO DP200-RUN-MONTH.              02650041
026600     MOVE PV-TODAYS-DATE-DD      TO DP200-RUN-DAY.                02660041
026700     MOVE PV-TODAYS-DATE-CCYY    TO DP200-RUN-YEAR.               02670041
026800     MOVE PV-TODAYS-TIME-HH      TO DP200-RUN-HOUR.               02680041
026900     MOVE PV-TODAYS-TIME-MM      TO DP200-RUN-MINUTE.             02690041
027000     MOVE PC-PROGRAM-NAME        TO DP200-PROGRAM-NAME.           02700041
027100     MOVE PC-REPORT-NBR          TO DP200-REPORT-NUMBER.          02710041
027200                                                                  02720000
027300     PERFORM 9050-REPORT-HEADERS.                                 02730000
027400                                                                  02740000
027500******************************************************            02750000
027600* 0020-END-PROGRAM.                                  *            02760000
027700******************************************************            02770000
027800 0020-END-PROGRAM.                                                02780000
027900                                                                  02790000
028000     PERFORM 4000-STATUS-GROUP-BREAK.                             02800000
028100     PERFORM 5000-EFC-LOCATION-BREAK.                             02810000
028200                                                                  02820000
028300     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           02830000
028400         PERFORM 9050-REPORT-HEADERS                              02840000
028500     END-IF.                                                      02850000
028600                                                                  02860000
028700     IF ( PS-FIRST-TIME )                                         02870000
028800         WRITE REPORT-RECORD FROM NO-DATA-TO-REPORT-LINE          02880000
028900              AFTER ADVANCING 2 LINES                             02890000
029000     END-IF.                                                      02900000
029100                                                                  02910000
029200     WRITE REPORT-RECORD FROM END-OF-REPORT-LINE                  02920000
029300          AFTER ADVANCING 3 LINES.                                02930000
029400                                                                  02940000
029500     CLOSE INPUT01-FILE                                           02950000
029600           REPORT-FILE.                                           02960000
029700                                                                  02970000
029800******************************************************            02980000
029900* 1000-PROCESS-INPUT.                                *            02990000
030000******************************************************            03000000
030100 1000-PROCESS-INPUT.                                              03010000
030200                                                                  03020000
030300     READ INPUT01-FILE INTO PC068-RECORD-LAYOUT                   03030000
030400         AT END MOVE 'Y' TO PS-END-OF-INPUT-SW                    03040000
030500                GO TO 1000-PROCESS-INPUT-EXIT.                    03050000
030600                                                                  03060000
030610*  BYPASS THE INPUT RECORD IF IT IS NOT TYPE 'DTL' OR 'TLR'       03061041
030620     IF PC068-DETAIL-RECORD OR PC068-TRAILER-RECORD               03062000
030621         CONTINUE                                                 03062100
030622     ELSE                                                         03062200
030630         GO TO 1000-PROCESS-INPUT-EXIT                            03063000
030631     END-IF.                                                      03063100
030640                                                                  03064000
030700     IF PS-FIRST-TIME                                             03070000
030800         MOVE 'N' TO PS-FIRST-TIME-SW                             03080000
030900         PERFORM 9040-PAGE-HEADERS                                03090000
031000     ELSE                                                         03100000
031100     IF PC068-OPER-UNT-ID NOT = PV-PREV-LOCATION AND              03110000
031200        PC068-OPER-UNT-ID NOT = PV-PREV-EFC AND                   03120000
031300        PC068-EFC-NBR     NOT = PV-PREV-LOCATION                  03130000
031400         PERFORM 4000-STATUS-GROUP-BREAK                          03140000
031500         PERFORM 5000-EFC-LOCATION-BREAK                          03150000
031600     ELSE                                                         03160000
031700         IF PC068-SORT-BY-LOC-IND NOT = PV-PREV-SLOC-IND          03170000
031800             PERFORM 4000-STATUS-GROUP-BREAK.                     03180000
031900                                                                  03190000
032000     PERFORM 3000-UPDATE-TOTALS.                                  03200000
032100                                                                  03210000
032200     MOVE PC068-OPER-UNT-ID     TO PV-PREV-LOCATION.              03220000
032300     MOVE PC068-EFC-NBR         TO PV-PREV-EFC.                   03230000
032400     MOVE PC068-PROCESS-GROUP   TO PV-PREV-PROC-GROUP.            03240000
032500     MOVE PC068-SORT-BY-LOC-IND TO PV-PREV-SLOC-IND.              03250000
032600                                                                  03260000
032700 1000-PROCESS-INPUT-EXIT.                                         03270000
032800     EXIT.                                                        03280000
032900******************************************************            03290000
033000 3000-UPDATE-TOTALS.                                              03300000
033100******************************************************            03310000
033200                                                                  03320000
033300     IF PC068-HANG-PKSLP                                          03330000
033400         CONTINUE                                                 03340000
033500     ELSE                                                         03350000
033600         ADD +1                       TO PV-NBR-TRAILERS          03360000
033700                                         PV-TOT-TRAILERS          03370000
033800         ADD PC068-NEW-SKU-CNT        TO PV-NBR-NEW-SKUS          03380000
033900                                         PV-TOT-NEW-SKUS          03390000
034000         ADD PC068-TRBLE-CTN-CNT-TRLR TO PV-NBR-CTNS-TRBL         03400000
034100                                         PV-TOT-CTNS-TRBL.        03410000
034101* DMH 07/2014 CONTROLLED FLOW                                     03410141
034102* DMH 09/30/14 - BEGIN                                            03410258
034103         EVALUATE TRUE                                            03410358
034104             WHEN PC068-CNTL-FLOW-CTN-CNT NUMERIC                 03410458
034105                  CONTINUE                                        03410558
034106             WHEN OTHER                                           03410658
034107                  MOVE ZEROES  TO PC068-CNTL-FLOW-CTN-CNT         03410758
034108                                  PC068-CNTL-FLOW-UNT-CNT         03410858
034109         END-EVALUATE                                             03410958
034110* DMH 09/30/14 - BEGIN                                            03411058
034111         ADD PC068-CNTL-FLOW-CTN-CNT  TO PV-NBR-CTNS-CNTL         03411141
034120                                         PV-TOT-CTNS-CNTL.        03412041
034121         ADD PC068-CNTL-FLOW-UNT-CNT  TO PV-NBR-UNIT-CNTL         03412141
034122                                         PV-TOT-UNIT-CNTL.        03412241
034123* DMH 07/2014 HAZARDOUS COUNTS                                    03412345
034124* DMH 09/30/14 - BEGIN                                            03412458
034125         EVALUATE TRUE                                            03412558
034126             WHEN PC068-HAZ-CTN-CNT       NUMERIC                 03412658
034127                  CONTINUE                                        03412758
034128             WHEN OTHER                                           03412858
034129                  MOVE ZEROES  TO PC068-HAZ-CTN-CNT               03412958
034130                                  PC068-HAZ-UNT-CNT               03413058
034131         END-EVALUATE                                             03413158
034132* DMH 09/30/14 - BEGIN                                            03413258
034133         ADD PC068-HAZ-CTN-CNT        TO PV-NBR-CTNS-HAZ          03413341
034140                                         PV-TOT-CTNS-HAZ.         03414041
034150         ADD PC068-HAZ-UNT-CNT        TO PV-NBR-UNIT-HAZ          03415041
034160                                         PV-TOT-UNIT-HAZ.         03416041
034200     IF PC068-PROCESSED                                           03420000
034300         ADD PC068-EFC-PO-CNT-TRLR  TO PV-NBR-POS                 03430000
034400                                       PV-TOT-POS                 03440000
034500         ADD PC068-EFC-CTN-CNT-TRLR TO PV-NBR-CTNS                03450000
034600                                       PV-TOT-CTNS                03460000
034700         ADD PC068-EFC-UNT-CNT-TRLR TO PV-NBR-UNITS               03470000
034800                                       PV-TOT-UNITS               03480000
034900     ELSE                                                         03490000
035000         ADD PC068-PO-CNT-TRLR      TO PV-NBR-POS                 03500000
035100                                       PV-TOT-POS                 03510000
035200         ADD PC068-TOT-CTN-CNT      TO PV-NBR-CTNS                03520000
035300                                       PV-TOT-CTNS                03530000
035400         ADD PC068-UNIT-CNT-TRLR    TO PV-NBR-UNITS               03540000
035500                                       PV-TOT-UNITS.              03550000
035600                                                                  03560000
035700******************************************************            03570000
035800 4000-STATUS-GROUP-BREAK.                                         03580000
035900******************************************************            03590000
036000                                                                  03600000
036100     IF PV-LINE-CNT > PV-LINE-LIMIT                               03610000
036200         PERFORM 9050-REPORT-HEADERS                              03620000
036300         PERFORM 9040-PAGE-HEADERS.                               03630000
036400                                                                  03640000
036500     EVALUATE TRUE                                                03650000
036600      WHEN PV-PREV-SLOC-IND = '1'                                 03660000
036700          MOVE PC-IN-DOORS           TO UPF-TOT-STATUS            03670000
036800          PERFORM 4010-UNPROCESSED-LINE                           03680000
036900      WHEN PV-PREV-SLOC-IND = '2'                                 03690000
037000          MOVE PC-YARD               TO UPF-TOT-STATUS            03700000
037100          PERFORM 4010-UNPROCESSED-LINE                           03710000
037200      WHEN PV-PREV-SLOC-IND = '3'                                 03720000
037300          MOVE PC-ENROUTE            TO UPF-TOT-STATUS            03730000
037400          PERFORM 4010-UNPROCESSED-LINE                           03740000
037500      WHEN PV-PREV-SLOC-IND = 'A'                                 03750000
037600          MOVE PC-ENROUTE-TO-DC      TO PF-TOT-STATUS             03760000
037700          PERFORM 4020-PROCESSED-LINE                             03770000
037800      WHEN PV-PREV-SLOC-IND = 'B'                                 03780000
037900          MOVE PC-IN-YARD-AT-DC      TO PF-TOT-STATUS             03790000
038000          PERFORM 4020-PROCESSED-LINE                             03800000
038100      WHEN PV-PREV-SLOC-IND = 'C'                                 03810000
038200          MOVE PC-IN-DOOR-AT-DC      TO PF-TOT-STATUS             03820000
038300          PERFORM 4020-PROCESSED-LINE                             03830000
038400      WHEN PV-PREV-SLOC-IND = 'D'                                 03840000
038500          MOVE PC-DOOR-OPEN          TO PF-TOT-STATUS             03850000
038600          PERFORM 4020-PROCESSED-LINE                             03860000
038700      WHEN PV-PREV-SLOC-IND = 'E'                                 03870000
038800          MOVE PC-DOOR-CLOSED        TO PF-TOT-STATUS             03880000
038900          PERFORM 4020-PROCESSED-LINE                             03890000
039000      WHEN PV-PREV-SLOC-IND = 'F'                                 03900000
039100          MOVE PC-DC-SHIPPED         TO PF-TOT-STATUS             03910000
039200          PERFORM 4020-PROCESSED-LINE                             03920000
039300      WHEN PV-PREV-SLOC-IND = 'G'                                 03930000
039400          MOVE PC-STORE-OPEN         TO PF-TOT-STATUS             03940000
039500          PERFORM 4020-PROCESSED-LINE                             03950000
039600      WHEN PV-PREV-SLOC-IND = 'X'                                 03960000
039700          PERFORM 4030-HANGING-PKSLIP-LINE                        03970000
039800     END-EVALUATE.                                                03980000
039900                                                                  03990000
040000     INITIALIZE PV-COUNTERS.                                      04000000
040100                                                                  04010000
040200******************************************************            04020000
040300 4010-UNPROCESSED-LINE.                                           04030000
040400******************************************************            04040000
040500                                                                  04050000
040600     MOVE PV-PREV-LOCATION      TO UPF-TOT-EFC.                   04060000
040700     MOVE PV-NBR-TRAILERS       TO UPF-TOT-TRAILERS.              04070000
040800     MOVE PV-NBR-POS            TO UPF-TOT-POS-TOTAL.             04080000
040900     MOVE PV-NBR-CTNS           TO UPF-TOT-CTN-TOTAL.             04090000
041000     MOVE PV-NBR-UNITS          TO UPF-TOT-UNIT-TOTAL.            04100000
041100     MOVE PV-NBR-NEW-SKUS       TO UPF-TOT-NEW-SKUS.              04110000
041200     MOVE PV-NBR-CTNS-TRBL      TO UPF-TOT-CTNS-TRBL.             04120000
041201* DMH 07/2014 CONTROLLED FLOW                                     04120141
041210     MOVE PV-NBR-CTNS-CNTL      TO UPF-TOT-CTNS-CNTL.             04121041
041220     MOVE PV-NBR-UNIT-CNTL      TO UPF-TOT-UNIT-CNTL.             04122041
041221* DMH 07/2014 HAZARDOUS                                           04122141
041230     MOVE PV-NBR-CTNS-HAZ       TO UPF-TOT-CTNS-HAZ.              04123041
041240     MOVE PV-NBR-UNIT-HAZ       TO UPF-TOT-UNIT-HAZ.              04124041
041300                                                                  04130000
041400***  WRITE THE UNPROCESSED FREIGHT HEADER IF NEEDED               04140000
041500     IF PS-FIRST-TIME-UPF                                         04150000
041600         MOVE PV-PREV-LOCATION TO UPF-HDR-EFC                     04160000
041700         MOVE 'N'              TO PS-FIRST-TIME-UPF-SW            04170000
041800         WRITE REPORT-RECORD FROM UNPROCESSED-FREIGHT-HDR         04180000
041900              AFTER ADVANCING 2 LINES                             04190000
042000         ADD  +2 TO PV-LINE-CNT                                   04200000
042100                    PV-NBR-OF-LINES.                              04210000
042200                                                                  04220000
042300     WRITE REPORT-RECORD FROM UNPROCESSED-FREIGHT-TOTAL-LINE      04230000
042400          AFTER ADVANCING 1 LINE.                                 04240000
042500                                                                  04250000
042600     ADD  +1 TO PV-LINE-CNT                                       04260000
042700                PV-NBR-OF-LINES.                                  04270000
042800                                                                  04280000
042900******************************************************            04290000
043000 4020-PROCESSED-LINE.                                             04300000
043100******************************************************            04310000
043200                                                                  04320000
043300     MOVE PV-PREV-EFC           TO PF-TOT-EFC.                    04330000
043400     MOVE PV-PREV-LOCATION      TO PF-TOT-DC.                     04340000
043500     MOVE PV-NBR-TRAILERS       TO PF-TOT-TRAILERS.               04350000
043600     MOVE PV-NBR-POS            TO PF-TOT-POS-TOTAL.              04360000
043700     MOVE PV-NBR-CTNS           TO PF-TOT-CTN-TOTAL.              04370000
043800     MOVE PV-NBR-UNITS          TO PF-TOT-UNIT-TOTAL.             04380000
043900     MOVE PV-NBR-NEW-SKUS       TO PF-TOT-NEW-SKUS.               04390000
044000     MOVE PV-NBR-CTNS-TRBL      TO PF-TOT-CTNS-TRBL.              04400000
044010* DMH 07/2014 CONTROLLED FLOW                                     04401041
044020     MOVE PV-NBR-CTNS-CNTL      TO PF-TOT-CTNS-CNTL.              04402041
044030     MOVE PV-NBR-UNIT-CNTL      TO PF-TOT-UNIT-CNTL.              04403041
044040* DMH 07/2014 HAZARDOUS                                           04404041
044050     MOVE PV-NBR-CTNS-HAZ       TO PF-TOT-CTNS-HAZ.               04405041
044060     MOVE PV-NBR-UNIT-HAZ       TO PF-TOT-UNIT-HAZ.               04406041
044100                                                                  04410000
044200***  WRITE THE PROCESSED FREIGHT HEADER IF NEEDED                 04420000
044300     IF PS-FIRST-TIME-PF                                          04430000
044400         MOVE PV-PREV-EFC      TO PF-HDR-EFC                      04440000
044500         MOVE PV-PREV-LOCATION TO PF-HDR-DC                       04450000
044600         MOVE 'N'              TO PS-FIRST-TIME-PF-SW             04460000
044700         WRITE REPORT-RECORD FROM PROCESSED-FREIGHT-HDR           04470000
044800              AFTER ADVANCING 1 LINE                              04480000
044900         ADD  +1 TO PV-LINE-CNT                                   04490000
045000                    PV-NBR-OF-LINES.                              04500000
045100                                                                  04510000
045200     WRITE REPORT-RECORD FROM PROCESSED-FREIGHT-TOTAL-LINE        04520000
045300          AFTER ADVANCING 1 LINE.                                 04530000
045400                                                                  04540000
045500     ADD  +1 TO PV-LINE-CNT                                       04550000
045600                PV-NBR-OF-LINES.                                  04560000
045700                                                                  04570000
045800******************************************************            04580000
045900 4030-HANGING-PKSLIP-LINE.                                        04590000
046000******************************************************            04600000
046100                                                                  04610000
046200     MOVE PV-NBR-POS            TO PK-TOT-POS-TOTAL.              04620000
046300     MOVE PV-NBR-CTNS           TO PK-TOT-CTN-TOTAL.              04630000
046400     MOVE PV-NBR-UNITS          TO PK-TOT-UNIT-TOTAL.             04640000
046500     MOVE PV-PREV-LOCATION      TO PK-TOT-EFC.                    04650000
046600                                                                  04660000
046700     WRITE REPORT-RECORD FROM PCKSLPS-HANGING-TOTAL-LINE          04670000
046800          AFTER ADVANCING 1 LINE.                                 04680000
046900                                                                  04690000
047000     ADD  +1 TO PV-LINE-CNT                                       04700000
047100                PV-NBR-OF-LINES.                                  04710000
047200                                                                  04720000
047300******************************************************            04730000
047400 5000-EFC-LOCATION-BREAK.                                         04740000
047500******************************************************            04750000
047600                                                                  04760000
047700     IF PV-LINE-CNT > PV-LINE-LIMIT                               04770000
047800         PERFORM 9050-REPORT-HEADERS                              04780000
047900         PERFORM 9040-PAGE-HEADERS                                04790000
048000     END-IF.                                                      04800000
048100                                                                  04810000
048200* FORMAT AND PRINT DC TOTAL LINE                                  04820000
048300     MOVE PV-TOT-TRAILERS        TO GT-TOT-TRAILERS.              04830000
048400     MOVE PV-TOT-POS             TO GT-TOT-POS-TOTAL.             04840000
048500     MOVE PV-TOT-CTNS            TO GT-TOT-CTN-TOTAL.             04850000
048600     MOVE PV-TOT-UNITS           TO GT-TOT-UNIT-TOTAL.            04860000
048700     MOVE PV-TOT-NEW-SKUS        TO GT-TOT-NEW-SKUS.              04870000
048800     MOVE PV-TOT-CTNS-TRBL       TO GT-TOT-CTNS-TRBL.             04880000
048900     MOVE PV-PREV-LOCATION       TO GT-TOT-EFC.                   04890000
048910* DMH 07/2014 CONTROLLED FLOW                                     04891041
048920     MOVE PV-TOT-CTNS-CNTL       TO GT-TOT-CTNS-CNTL.             04892041
048930     MOVE PV-TOT-UNIT-CNTL       TO GT-TOT-UNIT-CNTL.             04893041
048940* DMH 07/2014 HAZARDOUS                                           04894041
048950     MOVE PV-TOT-CTNS-HAZ        TO GT-TOT-CTNS-HAZ.              04895041
048960     MOVE PV-TOT-UNIT-HAZ        TO GT-TOT-UNIT-HAZ.              04896041
049000                                                                  04900000
049100     WRITE REPORT-RECORD FROM GRAND-TOTAL-LINE                    04910000
049200            AFTER ADVANCING 1 LINE.                               04920000
049300                                                                  04930000
049400     ADD  +1 TO PV-LINE-CNT                                       04940000
049500                PV-NBR-OF-LINES.                                  04950000
049600                                                                  04960000
049700     INITIALIZE PV-TOTALS.                                        04970000
049800     MOVE 'Y' TO PS-FIRST-TIME-PF-SW                              04980000
049900                 PS-FIRST-TIME-UPF-SW.                            04990000
050000                                                                  05000000
050100******************************************************            05010000
050200* 9040-PAGE-HEADERS.                                 *            05020000
050300******************************************************            05030000
050400 9040-PAGE-HEADERS.                                               05040000
050500                                                                  05050000
050600     IF PV-LINE-CNT > PV-LINE-LIMIT                               05060000
050700         PERFORM 9050-REPORT-HEADERS                              05070000
050800     END-IF.                                                      05080000
050900                                                                  05090000
051000     WRITE REPORT-RECORD FROM HDR02-LINE                          05100000
051100            AFTER ADVANCING 2 LINES.                              05110000
051200     WRITE REPORT-RECORD FROM HDR03-LINE                          05120000
051300            AFTER ADVANCING 1 LINE.                               05130000
051400     WRITE REPORT-RECORD FROM HDR04-LINE                          05140000
051500            AFTER ADVANCING 1 LINE.                               05150000
051600     WRITE REPORT-RECORD FROM HDR05-LINE                          05160000
051700            AFTER ADVANCING 1 LINE.                               05170000
051800     WRITE REPORT-RECORD FROM HDR06-LINE                          05180000
051900            AFTER ADVANCING 1 LINES.                              05190000
052000                                                                  05200000
052100     ADD  +7 TO PV-LINE-CNT.                                      05210000
052200                                                                  05220000
052300******************************************************            05230000
052400* 9050-REPORT-HEADERS.                               *            05240000
052500******************************************************            05250000
052600 9050-REPORT-HEADERS.                                             05260000
052700                                                                  05270000
052800     ADD +1           TO PV-PAGE-CNT.                             05280000
052900     MOVE PV-PAGE-CNT TO DP200-PAGE-NUMBER.                       05290045
053000                                                                  05300000
053100     WRITE REPORT-RECORD FROM DP200-STANDRD-HEADER-200-COLS       05310045
053200            AFTER ADVANCING PAGE.                                 05320000
053300     WRITE REPORT-RECORD FROM HDR01-LINE                          05330000
053400            AFTER ADVANCING 1 LINE.                               05340000
053500                                                                  05350000
053600     MOVE +2 TO PV-LINE-CNT.                                      05360000
053700                                                                  05370000
