000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300***************************************************************** 00030000
000400                                                                  00040000
000500 PROGRAM-ID.             PCKRP032.                                00050000
000600 AUTHOR.                 BRENDA ROCKWELL.                         00060000
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070000
000800 DATE-WRITTEN            DECEMBER, 2009.                          00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100***************************************************************** 00110000
001200*                                                               * 00120000
001300*  THIS PROGRAM WILL PRINT THE INBOUND TRAILER LEVEL REPORT     * 00130000
001400***************************************************************** 00140000
001500***************************************************************** 00150099
001600*  CHANGE LOG.                                                    00160099
001700*  DATE         CHANGED BY      DESC                              00170099
001800*  -----------  -------------- ---------------------------------- 00180099
001810*  04/03/2012   B. ROCKWELL    ADD CAN AND EFC COLUMNS TO REPORT  00181099
001820*                              PROJ ID:  3347A                    00182099
001830*                              WR/IR#:   WR40796                  00183099
001840*  10/31/2011   S. ANDERSON    EFC OPTIMIZATION AND HOLIDAY PREP  00184099
001850*               (CODEWORKS)     - ADD NEW REPORT COLUMN TO HOLD   00185099
001860*                                 NUMBER OF UNITS                 00186099
001870*                              PROJ ID:   3253                    00187099
001880*                              WR/IR#:   WR40392                  00188099
001890*  03/25/2013   C. PARMLEY     INCLUDE RFID # CARTONS AND UNITS   00189099
001900*                              ON REPORT                          00190099
002000*                              PROJ ID:   5148B                   00200099
002100*                              WR/IR#:   CRQ0000000?????          00210099
002200*  03/25/2013   VENKATESH S.   NEW FIELDS FOR RFID, COMBO AUDIT   00220099
002300*                              CARTONS AND PO EXCEPTION ARE ADDED 00230099
002310*                              TO THE REPORT INCREASING ITS LENGTH00231099
002320*                              TO 275                             00232099
002330*                              PROJ ID:   5148D                   00233099
002340*                              CHANGES TAGGED *VSH 03/07/14       00234099
002341*  06/27/2014   DENISE HAHN    REMOVED CAN & MANIFEST #           00234199
002342                               ADDED CARTON/UNIT QTY FOR HAZARDOUS00234299
002343*                              ADDED CARTON/UNIT QTY FOR CNTL FLOW00234399
002345*                              WR-42429                           00234599
002350***************************************************************** 00235099
002500/                                                                 00250000
002600***************************************************************** 00260000
002700 ENVIRONMENT DIVISION.                                            00270000
002800***************************************************************** 00280000
002900                                                                  00290000
003000 CONFIGURATION SECTION.                                           00300000
003100 SOURCE-COMPUTER.        IBM-3090.                                00310000
003200 OBJECT-COMPUTER.        IBM-3090.                                00320000
003300                                                                  00330000
003400 INPUT-OUTPUT SECTION.                                            00340000
003500                                                                  00350000
003600 FILE-CONTROL.                                                    00360000
003700                                                                  00370000
003800     SELECT INPUT01-FILE       ASSIGN TO INP01.                   00380000
003900     SELECT REPORT-FILE        ASSIGN TO RPT01.                   00390000
004000                                                                  00400000
004100***************************************************************** 00410000
004200 DATA DIVISION.                                                   00420000
004300***************************************************************** 00430000
004400                                                                  00440000
004500 FILE SECTION.                                                    00450000
004600                                                                  00460000
004700 FD  INPUT01-FILE                                                 00470000
004800     LABEL RECORDS ARE STANDARD                                   00480000
004900     RECORDING MODE IS F                                          00490000
005000     BLOCK CONTAINS 0 RECORDS                                     00500000
005010* CLP 06/05/13 PR# 5148B START                                    00501000
005020*VSH 03/07/14 - BEGIN PR#5148D                                    00502000
005100     RECORD CONTAINS 400 CHARACTERS.                              00510000
005200 01  INPUT01-RECORD                  PIC X(400).                  00520099
005201*VSH 03/07/14 - END PR#5148D                                      00520100
005210* CLP 06/05/13 PR# 5148B END                                      00521000
005300                                                                  00530000
005400 FD  REPORT-FILE                                                  00540000
005500     RECORDING MODE IS F                                          00550000
005600     BLOCK CONTAINS 0  RECORDS.                                   00560000
005700* RMK 6/2010 - REQUEST #3032B - ADD NOT ESS DATA                  00570000
005710*VSH 03/07/14 - BEGIN PR#5148D                                    00571000
005800 01  REPORT-RECORD                   PIC  X(275).                 00580000
005810*VSH 03/07/14 - END PR#5148D                                      00581000
005900* RMK 6/2010 - END                                                00590000
006000/                                                                 00600000
006100 WORKING-STORAGE SECTION.                                         00610000
006200                                                                  00620000
006300 01  PROGRAM-SWITCHES.                                            00630000
006400     05  PS-END-OF-INPUT-SW          PIC  X(01)    VALUE 'N'.     00640000
006500         88  PS-END-OF-INPUT                       VALUE 'Y'.     00650000
006600     05  PS-FIRST-TIME-SW            PIC  X(01)    VALUE 'Y'.     00660000
006700         88  PS-FIRST-TIME                         VALUE 'Y'.     00670000
006800     05  PS-FIRST-TIME-PO-SW         PIC  X(01)    VALUE 'Y'.     00680000
006900         88  PS-FIRST-TIME-PO                      VALUE 'Y'.     00690000
007000         88  PS-FIRST-TIME-PO-NO                   VALUE 'N'.     00700000
007100     05  PS-FIRST-TIME-SHPMT-SW      PIC  X(01)    VALUE 'Y'.     00710000
007200         88  PS-FIRST-TIME-SHPMT                   VALUE 'Y'.     00720000
007300         88  PS-FIRST-TIME-SHPMT-NO                VALUE 'N'.     00730000
007400     05  PS-NEW-TRIP-SW              PIC  X(01)    VALUE 'Y'.     00740000
007500         88  PS-NEW-TRIP-YES                       VALUE 'Y'.     00750000
007600         88  PS-NEW-TRIP-NO                        VALUE 'N'.     00760000
007610     05  PS-HANG-PKSLIP-SW           PIC  X(01)    VALUE 'N'.     00761000
007620         88  PS-HANG-PKSLIP-NEEDED                 VALUE 'Y'.     00762000
007700                                                                  00770000
007800 01  PC-CONSTANTS.                                                00780000
007900     05  PC-PROGRAM-NAME             PIC  X(08)    VALUE          00790000
008000                           'PCKRP032'.                            00800000
008100     05  PC-REPORT-NBR               PIC  X(02)    VALUE          00810000
008200                           '-1'.                                  00820000
008300     05  PC-ENROUTE                  PIC  X(05)    VALUE          00830000
008400                           'ENROU'.                               00840000
008500     05  PC-YARD                     PIC  X(05)    VALUE          00850000
008600                           'YARD '.                               00860000
008700                                                                  00870000
008800 01  PV-MISC-FIELDS.                                              00880000
008900     05  PV-LINE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00890000
009000     05  PV-NBR-OF-LINES             PIC S9(05) COMP-3 VALUE +0.  00900000
009100     05  PV-LINE-LIMIT               PIC S9(03) COMP-3 VALUE +57. 00910000
009200     05  PV-PAGE-CNT                 PIC S9(05) COMP-3 VALUE +0.  00920000
009300     05  PV-USER-NAME                PIC X(25)     VALUE SPACES.  00930000
009400     05  PV-HOLD-NUMERIC             PIC 9(9)      VALUE ZERO.    00940000
009500     05  PV-HOLD-PERCENT             PIC 9(9)V99   VALUE ZERO.    00950000
009600     05  PV-PO-TOTAL                 PIC S9(9) COMP-3 VALUE +0.   00960000
009700     05  PV-CTN-TOTAL                PIC S9(9) COMP-3 VALUE +0.   00970000
009800     05  PV-UNITS-TOTAL              PIC S9(9) COMP-3 VALUE +0.   00980000
009900* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  00990000
010000     05  PV-PRC-TOTAL                PIC S9(9) COMP-3 VALUE +0.   01000000
010100* RMK 6/2010 - END                                                01010000
010200* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               01020000
010300     05  PV-REPLEN-CRTN-CNT          PIC S9(9) COMP-3 VALUE +0.   01030000
010400     05  PV-CTNS-NOT-SCND            PIC S9(9) COMP-3 VALUE +0.   01040000
010500* JAK 8/2011 - END                                                01050000
010600     05  PV-AUD-CTN-TOTAL            PIC S9(9) COMP-3 VALUE +0.   01060000
010601*VSH 03/07/14 - BEGIN PR#5148D                                    01060100
010602     05  PV-DISPLAY                  PIC  9(9) VALUE 0.           01060200
010610     05  PV-RFID-AUD-CTN-TOTAL       PIC S9(9) COMP-3 VALUE +0.   01061000
010620     05  PV-COMB-AUD-CTN-TOTAL       PIC S9(9) COMP-3 VALUE +0.   01062000
010630     05  PV-U-RFID-CTN-TOTAL         PIC S9(9) COMP-3 VALUE +0.   01063000
010640     05  PV-U-COMB-CTN-TOTAL         PIC S9(9) COMP-3 VALUE +0.   01064000
010650*VSH 03/07/14 - END PR#5148D                                      01065000
010700     05  PV-PCNT-AUD-CTN-TOTAL       PIC 999       VALUE ZERO.    01070000
010800     05  PV-U-CTN-TOTAL              PIC S9(9) COMP-3 VALUE +0.   01080000
010900     05  PV-PCNT-U-CTN-TOTAL         PIC 999       VALUE ZERO.    01090000
011000     05  PV-CRSDK-CTN-TOTAL          PIC S9(9) COMP-3 VALUE +0.   01100000
011100     05  PV-PCNT-CRSDK-TOTAL         PIC 999       VALUE ZERO.    01110000
011200     05  PV-P2L-CTN-TOTAL            PIC S9(9) COMP-3 VALUE +0.   01120000
011300     05  PV-PCNT-P2L-CTN-TOTAL       PIC 999       VALUE ZERO.    01130000
011400     05  PV-TROUBLE-CTN-TOTAL        PIC S9(9) COMP-3 VALUE +0.   01140000
011500     05  PV-SET-DVT-CTN-TOTAL        PIC S9(9) COMP-3 VALUE +0.   01150000
011600     05  PV-TODAYS-DATE.                                          01160000
011700         10  PV-TODAYS-DATE-CCYY     PIC  9(04)    VALUE ZERO.    01170000
011800         10  PV-TODAYS-DATE-MM       PIC  9(02)    VALUE ZERO.    01180000
011900         10  PV-TODAYS-DATE-DD       PIC  9(02)    VALUE ZERO.    01190000
012000     05  PV-TODAYS-TIME.                                          01200000
012100         10  PV-TODAYS-TIME-HH       PIC  9(02)    VALUE ZERO.    01210000
012200         10  PV-TODAYS-TIME-MM       PIC  9(02)    VALUE ZERO.    01220000
012300         10  PV-TODAYS-TIME-SS       PIC  9(02)    VALUE ZERO.    01230000
012400         10  FILLER                  PIC  9(02)    VALUE ZERO.    01240000
012500     05  PV-FORMAT-DATE.                                          01250000
012600         10  PV-FORMAT-DATE-MM       PIC  X(02)    VALUE SPACES.  01260000
012700         10  FILLER                  PIC  X(01)    VALUE '/'.     01270000
012800         10  PV-FORMAT-DATE-DD       PIC  X(02)    VALUE SPACES.  01280000
012900         10  FILLER                  PIC  X(01)    VALUE '/'.     01290000
013000         10  PV-FORMAT-DATE-YYYY     PIC  X(04)    VALUE SPACES.  01300000
013100     05  PV-DC-LOCATION              PIC 9(04)         VALUE 0.   01310000
013200     05  PV-TRIP-ID                  PIC 9(09)         VALUE 0.   01320000
013300     05  PV-PO-NBR                   PIC 9(08)         VALUE 0.   01330000
013400     05  PV-REC-SEQ-NBR              PIC 9(04)         VALUE 0.   01340000
013500     05  PV-PREV-LOC                 PIC X(05)     VALUE SPACES.  01350000
013600     05  PV-PCNT-FIELD               PIC 999V99        VALUE 0.   01360000
013601* CLP 06/05/13 PR# 5148B START                                    01360100
013610     05  PV-RFID-CRTN-QTY            PIC 999999        VALUE 0.   01361000
013620     05  PV-RFID-UNIT-QTY            PIC 999999        VALUE 0.   01362000
013630* CLP 06/05/13 PR# 5148B END                                      01363000
013631                                                                  01363199
013632* DMH 6/27/14 BEGIN                                               01363299
013640     05  PV-HAZ-CRTN-QTY             PIC 999999        VALUE 0.   01364099
013650     05  PV-HAZ-UNIT-QTY             PIC 999999        VALUE 0.   01365099
013660     05  PV-CNTL-FLOW-CRTN-QTY       PIC 999999        VALUE 0.   01366099
013670     05  PV-CNTL-FLOW-UNIT-QTY       PIC 999999        VALUE 0.   01367099
013680* DMH 6/27/14 END                                                 01368099
013700/                                                                 01370000
013800****************************************************              01380000
013900* INPUT01 COPYBOOK                                 *              01390000
014000****************************************************              01400000
014100     COPY PCRD068.                                                01410000
014200/                                                                 01420000
014300* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  01430000
014400****************************************************              01440000
014500* 250 BYTE REPORT HEADER                           *              01450000
014600****************************************************              01460000
014700     COPY DPWS250O.                                               01470000
014800* RMK 6/2010 - END                                                01480000
014900/                                                                 01490000
015000 01  HDR-LINES.                                                   01500000
015100     05  HDR01-LINE.                                              01510000
015200         10  FILLER                  PIC  X(108)   VALUE SPACES.  01520000
015300         10  FILLER                  PIC  X(37)    VALUE          01530000
015400             'INBOUND CARTON FORECAST BY TRAILER'.                01540000
015500         10  FILLER                  PIC  X(54)    VALUE SPACES.  01550000
015600     05  HDR02-LINE.                                              01560000
015700         10  FILLER                  PIC  X(17)    VALUE          01570000
015800             'DC.............: '.                                 01580000
015900         10  HDR02-DC                PIC  ZZZZ9.                  01590000
016000         10  FILLER                  PIC  X(02)    VALUE SPACES.  01600000
016100         10  HDR02-DC-DESCRIPTION    PIC  X(40)    VALUE SPACES.  01610000
016200         10  FILLER                  PIC  X(68)    VALUE SPACES.  01620000
016300     05  HDR03-LINE.                                              01630000
016400         10  FILLER                  PIC  X(50)    VALUE          01640000
016500        '-------TRAILER INFORMATION------ ---PO CNTS-------'.     01650000
016510*VSH 03/07/14 - BEGIN PR#5148D                                    01651000
016600         10  FILLER                  PIC  X(34)    VALUE          01660000
016700        '--- ------EST AUDIT---------------'.                     01670000
016710         10  FILLER                  PIC  X(34)    VALUE          01671000
016720        '---- ---CRSDK--- ---P2L COUNTS--- '.                     01672000
016800* CLP 06/05/13 PR# 5148B START                                    01680000
017101         10  FILLER                  PIC  X(16)    VALUE          01710100
017102        '-RFID COUNTS- --'.                                       01710200
017103         10  FILLER                  PIC  X(44)    VALUE          01710300
017104        '-----------------OTHER----------------------'.           01710400
017110         10  FILLER                  PIC  X(46)    VALUE          01711000
017120        '------------------------------------  --STATUS'.         01712000
017121         10  FILLER                  PIC  X(08)    VALUE          01712100
017122        '- ---- E'.                                               01712200
017123*VSH 03/07/14 - END PR#5148D                                      01712300
017124* CLP 06/05/13 PR# 5148B END                                      01712400
017130         10  FILLER                  PIC  X(50)    VALUE          01713000
017140        'FC PO CNTS ----                                   '.     01714000
017200     05  HDR04-LINE.                                              01720000
017300         10  FILLER                  PIC  X(50)    VALUE          01730000
017400         '                                                  '.    01740000
017500*VSH 03/07/14 - BEGIN PR#5148D                                    01750000
017700         10  FILLER                  PIC  X(29)    VALUE          01770000
017800         '        #   #     #     %   '.                          01780000
017810         10  FILLER                  PIC  X(33)    VALUE          01781000
017820         '#      %      #           #   %  '.                     01782000
017900* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  01790000
017901* CLP 06/05/13 PR# 5148B START                                    01790100
017910         10  FILLER                  PIC  X(15)    VALUE          01791000
017920         '        #     #'.                                       01792000
017930* CLP 06/05/13 PR# 5148B END                                      01793000
018000         10  FILLER                  PIC  X(50)    VALUE          01800000
018100         '        #      #    #CTN 100%    AUD       #      '.    01810099
018110         10  FILLER                  PIC  X(50)    VALUE          01811000
018120         '#     CNTL   CNTL                      #CTNS      '.    01812099
018130         10  FILLER                  PIC  X(08)    VALUE          01813000
018140         '        '.                                              01814000
018150*VSH 03/07/14 - END PR#5148D                                      01815000
018200     05  HDR05-LINE.                                              01820000
018300         10  FILLER                  PIC  X(50)    VALUE          01830000
018400         '        ARRIVAL                    #       #      '.    01840000
018500*VSH 03/07/14 - BEGIN PR#5148D                                    01850000
018700         10  FILLER                  PIC  X(35)    VALUE          01870000
018800         '#       Q  RFID  COMB   Q    U     '.                   01880000
018801         10  FILLER                  PIC  X(27)    VALUE          01880100
018802         ' U    CRSDK  %    P2L  P2L '.                           01880200
018810* CLP 06/05/13 PR# 5148B START                                    01881000
018900         10  FILLER                  PIC  X(41)    VALUE          01890000
019000         'P2L   RFID   RFID    PROC   CTNS   W/ST  '.             01900000
019001         10  FILLER                  PIC  X(34)    VALUE          01900100
019002         'AUD    TYPE     HAZ    HAZ    FLOW'.                    01900299
019003* CLP 06/05/13 PR# 5148B END                                      01900300
019004         10  FILLER                  PIC  X(45)    VALUE          01900400
019005         '   FLOW                      NOT    %   #    '.         01900599
019006*VSH 03/07/14 - END PR#5148D                                      01900600
019007         10  FILLER                  PIC  X(50)    VALUE          01900700
019008         ' #       #                                        '.    01900800
019100     05  HDR06-LINE.                                              01910000
019200         10  FILLER                  PIC  X(50)    VALUE          01920000
019300         ' LOC     DATE    SCAC TRAILER #    POS    CTNS  UN'.    01930000
019400*VSH 03/07/14 - BEGIN PR#5148D                                    01940000
019600         10  FILLER                  PIC  X(35)    VALUE          01960000
019700         'ITS    CTN CTN   CTN   CTN  CTN    '.                   01970000
019701         10  FILLER                  PIC  X(27)    VALUE          01970100
019702         'CTN   CTNS  CRS   CTNS CTN'.                            01970200
019710* CLP 06/05/13 PR# 5148B START                                    01971000
019800         10  FILLER                  PIC  X(21)   VALUE           01980000
019900         'ZONE  CTNS   UNTS    '.                                 01990000
019901         10  FILLER                  PIC  X(50)   VALUE           01990100
019902         'CNTS   TRBL   &DVT  CNT (A,N,Q,R)   CTNS   UNTS   '.    01990299
019903* CLP 06/05/13 PR# 5148B END                                      01990300
019910         10  FILLER                  PIC  X(48)   VALUE           01991000
019911         'CTNS   UNTS                      SCND SCND  POS '.      01991199
019912         10  FILLER                  PIC  X(50)   VALUE           01991200
019920         '  CTNS   UNITS                                    '.    01992000
019921         10  FILLER                  PIC  X(50)   VALUE           01992100
019922         '    '.                                                  01992200
019923*VSH 03/07/14 - END PR#5148D                                      01992300
019930     05  HDR07-LINE.                                              01993000
019940         10  FILLER                  PIC  X(50)    VALUE          01994000
019950         '----- ---------- ---- ---------- ----- ------- ---'.    01995000
019951*VSH 03/07/14 - BEGIN PR#5148D                                    01995100
019960         10  FILLER                  PIC  X(35)    VALUE          01996000
019970         '--- ------ ----- ----- --- ------  '.                   01997000
019971         10  FILLER                  PIC  X(39)    VALUE          01997100
019972         '--- ------- --- ------ --- ----- ------'.               01997200
019973* CLP 06/05/13 PR# 5148B START                                    01997300
019980         10  FILLER                  PIC  X(20)   VALUE           01998000
019990         ' ------ ----- ------'.                                  01999000
019991         10  FILLER                  PIC  X(46)    VALUE          01999100
019992         ' ------ ----     -     ------ ------ ------ --'.        01999299
020000         10  FILLER                  PIC  X(42)   VALUE           02000000
020100         '----                      ----- --- ----- '.            02010099
020110* CLP 06/05/13 PR# 5148B END                                      02011000
020200         10  FILLER                  PIC  X(50)   VALUE           02020000
020300         '------- -------                                   '.    02030000
020900     05  BLANK-LINE                  PIC X(275)    VALUE SPACES.  02090000
020910*VSH 03/07/14 - END PR#5148D                                      02091000
021000* RMK 6/2010 - END                                                02100000
021100     05  END-OF-REPORT-LINE.                                      02110000
021200         10  FILLER                  PIC  X(44)    VALUE SPACES.  02120000
021300         10  FILLER                  PIC  X(45)    VALUE          02130000
021400             '*******   E N D   O F   R E P O R T   *******'.     02140000
021500         10  FILLER                  PIC  X(43)    VALUE SPACES.  02150000
021600     05  NO-DATA-TO-REPORT-LINE.                                  02160000
021700         10  FILLER                  PIC  X(40)    VALUE SPACES.  02170000
021800         10  FILLER                  PIC  X(52)    VALUE          02180000
021900         '*******  N O   D A T A   T O   R E P O R T   *******'.  02190000
022000         10  FILLER                  PIC  X(40)    VALUE SPACES.  02200000
022100/                                                                 02210000
022200 01  DETAIL-LINES.                                                02220000
022300     05  DTL01-LINE.                                              02230000
022400         10  DTL01-LOC               PIC  X(05)    VALUE SPACES.  02240000
022500         10  FILLER                  PIC  X(01)    VALUE SPACES.  02250000
022600         10  DTL01-ARRIVAL-DATE      PIC  X(10)    VALUE SPACES.  02260000
022700         10  FILLER                  PIC  X(01)    VALUE SPACES.  02270000
022800         10  DTL01-SCAC              PIC  X(04)    VALUE SPACES.  02280000
022900         10  FILLER                  PIC  X(01)    VALUE SPACES.  02290000
023000         10  DTL01-VEHICLE           PIC  X(10)    VALUE SPACES.  02300000
023100         10  FILLER                  PIC  X(01)    VALUE SPACES.  02310000
023200         10  DTL01-NBR-OF-POS        PIC  ZZZZ9   BLANK WHEN ZERO.02320000
023300*36                                                               02330000
023400         10  FILLER                  PIC  X(01)    VALUE SPACES.  02340000
023500         10  DTL01-NBR-OF-CTNS       PIC  ZZZZZZ9 BLANK WHEN ZERO.02350000
023600         10  FILLER                  PIC  X(01)    VALUE SPACES.  02360000
023700         10  DTL01-NBR-OF-UNITS      PIC  ZZZZZ9  BLANK WHEN ZERO.02370000
023800         10  FILLER                  PIC  X(02)    VALUE SPACES.  02380000
023900         10  DTL01-NBR-AUD-CTNS      PIC  ZZZZ9   BLANK WHEN ZERO.02390000
024000         10  FILLER                  PIC  X(01)    VALUE SPACES.  02400000
024001* VSH 03/07/14 PR# 5148D START                                    02400100
024010         10  DTL01-NBR-RF-AUD-CTNS   PIC  ZZZZ9   BLANK WHEN ZERO.02401000
024020         10  FILLER                  PIC  X(01)    VALUE SPACES.  02402000
024030         10  DTL01-NBR-COM-AUD-CTNS  PIC  ZZZZ9   BLANK WHEN ZERO.02403000
024040         10  FILLER                  PIC  X(01)    VALUE SPACES.  02404000
024050* VSH 03/07/14 PR# 5148D END                                      02405000
024100         10  DTL01-PCNT-AUD-CTNS     PIC  ZZ9    BLANK WHEN ZERO. 02410000
024200         10  FILLER                  PIC  X(01)    VALUE SPACES.  02420000
024300         10  DTL01-NBR-U-CTNS        PIC  ZZZZZ9  BLANK WHEN ZERO.02430000
024400         10  FILLER                  PIC  X(02)    VALUE SPACES.  02440000
024401* VSH 03/07/14 PR# 5148D START                                    02440100
024410*        10  DTL01-NBR-U-RFID-CTNS   PIC  ZZZZZ9  BLANK WHEN ZERO.02441000
024420*        10  FILLER                  PIC  X(02)    VALUE SPACES.  02442000
024430*        10  DTL01-NBR-U-COMB-CTNS   PIC  ZZZZZ9  BLANK WHEN ZERO.02443000
024440*        10  FILLER                  PIC  X(02)    VALUE SPACES.  02444000
024450* VSH 03/07/14 PR# 5148D END                                      02445000
024500         10  DTL01-PCNT-U-CTNS       PIC  ZZ9    BLANK WHEN ZERO. 02450000
024600         10  FILLER                  PIC  X(01)    VALUE SPACES.  02460000
024700         10  DTL01-NBR-XDCK-CTNS     PIC  ZZZZZZ9 BLANK WHEN ZERO.02470000
024800         10  FILLER                  PIC  X(01)    VALUE SPACES.  02480000
024900*69                                                               02490000
025000         10  DTL01-PCNT-XDCK-CTNS    PIC  ZZ9    BLANK WHEN ZERO. 02500000
025100         10  FILLER                  PIC  X(01)    VALUE SPACES.  02510000
025200         10  DTL01-NBR-P2L-CTNS      PIC  ZZZZZ9  BLANK WHEN ZERO.02520000
025300         10  FILLER                  PIC  X(01)    VALUE SPACES.  02530000
025400         10  DTL01-PCNT-P2L-CTNS     PIC  ZZ9    BLANK WHEN ZERO. 02540000
025500         10  FILLER                  PIC  X(01)    VALUE SPACES.  02550000
025600         10  DTL01-P2L-ZONE          PIC  X(05)    VALUE SPACES.  02560000
025700         10  FILLER                  PIC  X(01)    VALUE SPACES.  02570000
025701* CLP 06/05/13 PR# 5148B START                                    02570100
025720         10  DTL01-RFID-CTNS         PIC ZZZZZ9   BLANK WHEN ZERO.02572000
025730         10  FILLER                  PIC  X(01)    VALUE SPACES.  02573000
025740         10  DTL01-RFID-UNTS         PIC ZZZZZ9   BLANK WHEN ZERO.02574000
025750         10  FILLER                  PIC  X(01)    VALUE SPACES.  02575000
025760* CLP 06/05/13 PR# 5148B END                                      02576000
025800* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  02580000
025900         10  DTL01-REPLEN-CARTON-CNT PIC  ZZZZZ    VALUE SPACES.  02590000
026000         10  FILLER                  PIC  X(01)    VALUE SPACES.  02600000
026100* RMK 6/2010 - END                                                02610000
026200         10  DTL01-NBR-CTNS-TROUBLE  PIC  ZZZZZ9  BLANK WHEN ZERO.02620000
026300         10  FILLER                  PIC  X(01)    VALUE SPACES.  02630000
026400         10  DTL01-NBR-CTNS-ST-DVT   PIC  ZZZZZ9  BLANK WHEN ZERO.02640000
026500*97                                                               02650000
026600         10  FILLER                  PIC  X(01)    VALUE SPACES.  02660000
026700         10  DTL01-100-PCNT-AUD-CNT  PIC  ZZZ9    BLANK WHEN ZERO.02670000
026710* CLP 06/05/13 PR# 5148B START                                    02671000
026800         10  FILLER                  PIC  X(04)    VALUE SPACES.  02680000
026801* VSH 03/07/14 PR# 5148D START                                    02680100
026810         10  DTL01-AUD-TYP           PIC  X(01)    VALUE SPACES.  02681000
026820         10  FILLER                  PIC  X(06)    VALUE SPACES.  02682000
026830* VSH 03/07/14 PR# 5148D END                                      02683000
026900*103                                                              02690000
026910*                                                                 02691099
026920*** DMH 6/17/14 - BEGIN                                           02692099
026930         10  DTL01-HAZ-CTNS          PIC ZZZZZ9   BLANK WHEN ZERO.02693099
026940         10  FILLER                  PIC  X(01)    VALUE SPACES.  02694099
026950         10  DTL01-HAZ-UNTS          PIC ZZZZZ9   BLANK WHEN ZERO.02695099
026960         10  FILLER                  PIC  X(01)    VALUE SPACES.  02696099
026970         10  DTL01-CNTL-FLOW-CTNS    PIC ZZZZZ9   BLANK WHEN ZERO.02697099
026980         10  FILLER                  PIC  X(01)    VALUE SPACES.  02698099
026990         10  DTL01-CNTL-FLOW-UNTS    PIC ZZZZZ9   BLANK WHEN ZERO.02699099
026991         10  FILLER                  PIC  X(22)    VALUE SPACES.  02699199
027121*** DMH 6/17/14 - END                                             02712199
027122*                                                                 02712299
027130* CLP 06/05/13 PR# 5148B END                                      02713000
027200         10  DTL01-NBR-CTNS-NOT-SCN  PIC  ZZZZ9   BLANK WHEN ZERO.02720000
027300         10  FILLER                  PIC  X(01)    VALUE SPACES.  02730000
027400         10  DTL01-PCNT-SCANNED      PIC  ZZ9   BLANK WHEN ZERO.  02740000
027410         10  FILLER                  PIC  X(01)    VALUE SPACES.  02741000
027420         10  DTL01-EFC-POS           PIC  ZZZZ9 BLANK WHEN ZERO.  02742000
027430         10  FILLER                  PIC  X(01)    VALUE SPACES.  02743000
027440         10  DTL01-EFC-CTNS          PIC ZZZZZZ9 BLANK WHEN ZERO. 02744000
027450         10  FILLER                  PIC  X(01)    VALUE SPACES.  02745000
027460         10  DTL01-EFC-UNITS         PIC ZZZZZZ9 BLANK WHEN ZERO. 02746000
027470     05  DTL02-LINE.                                              02747000
027490         10  FILLER                  PIC  X(15)    VALUE SPACES.  02749000
027630         10  FILLER                  PIC  X(17)    VALUE          02763000
027631              'PACKSLIPS HANGING'.                                02763100
027640         10  FILLER                  PIC  X(01)    VALUE SPACES.  02764000
027650         10  DTL02-NBR-OF-POS        PIC  ZZZZ9   BLANK WHEN ZERO.02765000
027670         10  FILLER                  PIC  X(01)    VALUE SPACES.  02767000
027680         10  DTL02-NBR-OF-CTNS       PIC  ZZZZZZ9 BLANK WHEN ZERO.02768000
027690         10  FILLER                  PIC  X(01)    VALUE SPACES.  02769000
027691         10  DTL02-NBR-OF-UNITS     PIC ZZZZZZZZ9 BLANK WHEN ZERO.02769100
027740******************************************************            02774000
027800*  XLT00010 - DC LOCATION TABLE                      *            02780000
027900******************************************************            02790000
028000     EXEC SQL                                                     02800000
028100          INCLUDE XLT00010                                        02810000
028200     END-EXEC.                                                    02820000
028300******************************************************            02830000
028310*  TSHIPMT - TSHIPMT TABLE                           *            02831000
028320******************************************************            02832000
028330     EXEC SQL                                                     02833000
028340          INCLUDE TSHIPMT                                         02834000
028350     END-EXEC.                                                    02835000
028360******************************************************            02836000
028370*  TTRIPST - TTRIPST TABLE (TRIP STATUS)             *            02837000
028380******************************************************            02838000
028390     EXEC SQL                                                     02839000
028391          INCLUDE TTRIPST                                         02839100
028392     END-EXEC.                                                    02839200
028400******************************************************            02840000
028500*  DB2 AREA FOR COMMUNICATIONS                       *            02850000
028600******************************************************            02860000
028700     EXEC SQL                                                     02870000
028800          INCLUDE SQLCA                                           02880000
028900     END-EXEC.                                                    02890000
029000                                                                  02900000
029100     COPY SQLCA2.                                                 02910000
029200/                                                                 02920000
029300 PROCEDURE DIVISION.                                              02930000
029400                                                                  02940000
029500     DISPLAY '***BEGINNING PCKRP032***'.                          02950000
029600******************************************************            02960000
029700* 0000-MAINLINE.                                     *            02970000
029800******************************************************            02980000
029900 0000-MAINLINE.                                                   02990000
030000                                                                  03000000
030100     PERFORM 0010-INITIALIZATION.                                 03010000
030200                                                                  03020000
030300     PERFORM 1000-PROCESS-INPUT                                   03030000
030400        THRU 1000-PROCESS-INPUT-EXIT                              03040000
030500         UNTIL ( PS-END-OF-INPUT ).                               03050000
030600                                                                  03060000
030700     PERFORM 0020-END-PROGRAM.                                    03070000
030800     DISPLAY '***ENDING OF PCKRP032***'.                          03080000
030900     GOBACK.                                                      03090000
031000/                                                                 03100000
031100******************************************************            03110000
031200* 0010-INITIALIZATION.                               *            03120000
031300******************************************************            03130000
031400 0010-INITIALIZATION.                                             03140000
031500                                                                  03150000
031600     OPEN INPUT  INPUT01-FILE                                     03160000
031700          OUTPUT REPORT-FILE.                                     03170000
031800                                                                  03180000
031900     MOVE FUNCTION CURRENT-DATE (1:8) TO PV-TODAYS-DATE.          03190000
032000     ACCEPT PV-TODAYS-TIME   FROM TIME.                           03200000
032100                                                                  03210000
032200     MOVE PV-TODAYS-DATE-MM      TO DP250O-RUN-MONTH.             03220000
032300     MOVE PV-TODAYS-DATE-DD      TO DP250O-RUN-DAY.               03230000
032400     MOVE PV-TODAYS-DATE-CCYY    TO DP250O-RUN-YEAR.              03240000
032500     MOVE PV-TODAYS-TIME-HH      TO DP250O-RUN-HOUR.              03250000
032600     MOVE PV-TODAYS-TIME-MM      TO DP250O-RUN-MINUTE.            03260000
032700     MOVE PC-PROGRAM-NAME        TO DP250O-PROGRAM-NAME.          03270000
032800     MOVE PC-REPORT-NBR          TO DP250O-REPORT-NUMBER.         03280000
032900                                                                  03290000
033000     PERFORM 9050-REPORT-HEADERS.                                 03300000
033100/                                                                 03310000
033200******************************************************            03320000
033300* 0020-END-PROGRAM.                                  *            03330000
033400******************************************************            03340000
033500 0020-END-PROGRAM.                                                03350000
033600                                                                  03360000
033610     IF PS-HANG-PKSLIP-NEEDED                                     03361000
033620         PERFORM 3500-HANG-PKSLIP-RECORD                          03362000
033630     ELSE                                                         03363000
033700         PERFORM 3000-TOTAL-RECORD.                               03370000
033800                                                                  03380000
033900     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           03390000
034000         PERFORM 9050-REPORT-HEADERS                              03400000
034100     END-IF.                                                      03410000
034200                                                                  03420000
034300     IF ( PS-FIRST-TIME )                                         03430000
034400         WRITE REPORT-RECORD FROM NO-DATA-TO-REPORT-LINE          03440000
034500              AFTER ADVANCING 2 LINES                             03450000
034600     END-IF.                                                      03460000
034700                                                                  03470000
034800     WRITE REPORT-RECORD FROM END-OF-REPORT-LINE                  03480000
034900          AFTER ADVANCING 3 LINES.                                03490000
035000                                                                  03500000
035100     CLOSE INPUT01-FILE                                           03510000
035200           REPORT-FILE.                                           03520000
035300/                                                                 03530000
035400******************************************************            03540000
035500* 1000-PROCESS-INPUT.                                *            03550000
035600******************************************************            03560000
035700 1000-PROCESS-INPUT.                                              03570000
035800                                                                  03580000
035900     READ INPUT01-FILE INTO PC068-RECORD-LAYOUT                   03590000
036000         AT END MOVE 'Y' TO PS-END-OF-INPUT-SW                    03600000
036100                GO TO 1000-PROCESS-INPUT-EXIT.                    03610000
036200                                                                  03620000
036300**** THIS PROGRAM SHOULD ONLY PROCESS TRAILER LEVEL RECORD TYPES  03630000
036400     IF PC068-TRAILER-RECORD                                      03640000
036500         CONTINUE                                                 03650000
036600     ELSE                                                         03660000
036700         GO TO 1000-PROCESS-INPUT-EXIT.                           03670000
036800                                                                  03680000
036900     IF ( PS-FIRST-TIME )                                         03690000
037000         MOVE 'N' TO PS-FIRST-TIME-SW                             03700000
037100         MOVE PC068-OPER-UNT-ID TO PV-DC-LOCATION                 03710000
037200                                   HDR02-DC                       03720000
037300         MOVE PC068-TRLR-LOC    TO PV-PREV-LOC                    03730000
037400         PERFORM 2000-VALIDATE-DC                                 03740000
037500         PERFORM 9040-PAGE-HEADERS                                03750000
037600     END-IF.                                                      03760000
037700                                                                  03770000
037800     IF ( PC068-OPER-UNT-ID NOT = PV-DC-LOCATION )                03780000
037900         MOVE PC068-OPER-UNT-ID TO PV-DC-LOCATION                 03790000
038000                                   HDR02-DC                       03800000
038100         PERFORM 3000-TOTAL-RECORD                                03810000
038200         MOVE PC068-TRLR-LOC TO PV-PREV-LOC                       03820000
038300         PERFORM 2000-VALIDATE-DC                                 03830000
038400         PERFORM 9050-REPORT-HEADERS                              03840000
038500         PERFORM 9040-PAGE-HEADERS                                03850000
038600     ELSE                                                         03860000
038700         IF (PC068-TRLR-LOC NOT = PV-PREV-LOC)                    03870000
038800             IF PC068-TRLR-LOC =  (PC-ENROUTE OR PC-YARD) OR      03880000
038900                PV-PREV-LOC    =  (PC-ENROUTE OR PC-YARD)         03890000
039000                MOVE PC068-TRLR-LOC TO PV-PREV-LOC                03900000
039100                PERFORM 3000-TOTAL-RECORD                         03910000
039200             END-IF                                               03920000
039300         END-IF                                                   03930000
039400     END-IF.                                                      03940000
039500                                                                  03950000
039600* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  03960000
039700* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               03970000
039800*    IF PC068-STORE-ZONE = SPACES                                 03980000
039900*    OR PC068-STORE-ZONE = 'REPLE'                                03990000
040000*        PERFORM 9000-REPORT-DETAIL                               04000000
040100*    ELSE                                                         04010000
040200*        PERFORM 9010-ZONE-DETAIL.                                04020000
040300* RMK 6/2010 - END                                                04030000
040320     IF PC068-HANG-PKSLP                                          04032000
040330         PERFORM 5000-HANG-PKSLIP                                 04033000
040340     ELSE                                                         04034000
040400     IF PC068-STORE-ZONE = SPACES                                 04040000
040500         PERFORM 9000-REPORT-DETAIL                               04050000
040600     ELSE                                                         04060000
040700         IF PC068-STORE-ZONE = 'REPLE'                            04070000
040800             PERFORM 4000-SUM-REPLEN                              04080000
040900         ELSE                                                     04090000
041000             PERFORM 9010-ZONE-DETAIL                             04100000
041100         END-IF                                                   04110000
041200     END-IF.                                                      04120000
041300* JAK 8/2011 - END                                                04130000
041400                                                                  04140000
041500 1000-PROCESS-INPUT-EXIT.                                         04150000
041600     EXIT.                                                        04160000
041700/                                                                 04170000
041800******************************************************            04180000
041900* 2000-VALIDATE-DC.                                  *            04190000
042000******************************************************            04200000
042100 2000-VALIDATE-DC.                                                04210000
042200                                                                  04220000
042300     MOVE PV-DC-LOCATION TO XLT00010-LOC-NBR.                     04230000
042400                                                                  04240000
042500     EXEC SQL                                                     04250000
042600         SELECT A.LOC_NM                                          04260000
042700           INTO :XLT00010-LOC-NM                                  04270000
042800           FROM XLT_LOC A                                         04280000
042900          WHERE A.LOC_NBR     = :XLT00010-LOC-NBR                 04290000
043000           WITH UR                                                04300000
043100     END-EXEC.                                                    04310000
043200                                                                  04320000
043300     EVALUATE TRUE                                                04330000
043400       WHEN SQLCODE = ZERO                                        04340000
043500           MOVE XLT00010-LOC-NM TO HDR02-DC-DESCRIPTION           04350000
043600       WHEN OTHER                                                 04360000
043700           MOVE SPACES          TO HDR02-DC-DESCRIPTION           04370000
043800     END-EVALUATE.                                                04380000
043900/                                                                 04390000
044000******************************************************            04400000
044100 3000-TOTAL-RECORD.                                               04410000
044200                                                                  04420000
044300     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           04430000
044400         PERFORM 9050-REPORT-HEADERS                              04440000
044500         PERFORM 9040-PAGE-HEADERS                                04450000
044600     END-IF.                                                      04460000
044700                                                                  04470000
044800     MOVE SPACES                   TO DTL01-LOC.                  04480000
044900     MOVE SPACES                   TO DTL01-ARRIVAL-DATE.         04490000
045000     MOVE SPACES                   TO DTL01-SCAC.                 04500000
045100**   MOVE SPACES                   TO DTL01-VEHICLE.              04510000
045200     MOVE 'LOC TOTAL:'             TO DTL01-VEHICLE.              04520000
045300     MOVE PV-PO-TOTAL              TO DTL01-NBR-OF-POS.           04530000
045400     MOVE PV-CTN-TOTAL             TO DTL01-NBR-OF-CTNS.          04540000
045500     MOVE PV-UNITS-TOTAL           TO DTL01-NBR-OF-UNITS.         04550000
045510                                                                  04551099
045520** DMH - 6/27/17 - BEGIN                                          04552099
045530     MOVE PV-HAZ-CRTN-QTY         TO DTL01-HAZ-CTNS.              04553099
045540     MOVE PV-HAZ-UNIT-QTY         TO DTL01-HAZ-UNTS.              04554099
045550     MOVE PV-CNTL-FLOW-CRTN-QTY   TO DTL01-CNTL-FLOW-CTNS.        04555099
045560     MOVE PV-CNTL-FLOW-UNIT-QTY   TO DTL01-CNTL-FLOW-UNTS.        04556099
045570** DMH - 6/27/17 - BEGIN                                          04557099
045580                                                                  04558099
045600     MOVE PV-AUD-CTN-TOTAL         TO DTL01-NBR-AUD-CTNS.         04560000
045601*VSH 03/07/14 - BEGIN PR#5148D                                    04560100
045610     MOVE PV-RFID-AUD-CTN-TOTAL    TO DTL01-NBR-RF-AUD-CTNS.      04561000
045620     MOVE PV-COMB-AUD-CTN-TOTAL    TO DTL01-NBR-COM-AUD-CTNS.     04562000
045630*VSH 03/07/14 - END PR#5148D                                      04563000
045700     IF PV-PCNT-AUD-CTN-TOTAL > ZERO                              04570000
045800         COMPUTE PV-PCNT-FIELD =                                  04580000
045900                (PV-PCNT-AUD-CTN-TOTAL / PV-CTN-TOTAL)            04590000
046000*GB             (PV-PCNT-AUD-CTN-TOTAL / PV-NBR-OF-LINES)         04600000
046100         MOVE PV-PCNT-FIELD TO DTL01-PCNT-AUD-CTNS                04610000
046200     ELSE                                                         04620000
046300         MOVE ZERO          TO DTL01-PCNT-AUD-CTNS.               04630000
046400     MOVE PV-U-CTN-TOTAL           TO DTL01-NBR-U-CTNS.           04640000
046500     IF PV-PCNT-U-CTN-TOTAL > ZERO                                04650000
046600         COMPUTE PV-PCNT-FIELD =                                  04660000
046700                (PV-PCNT-U-CTN-TOTAL / PV-CTN-TOTAL)              04670000
046800*GB             (PV-PCNT-U-CTN-TOTAL / PV-NBR-OF-LINES)           04680000
046900         MOVE PV-PCNT-FIELD TO DTL01-PCNT-U-CTNS                  04690000
047000     ELSE                                                         04700000
047100         MOVE ZERO          TO DTL01-PCNT-U-CTNS.                 04710000
047200     MOVE PV-CRSDK-CTN-TOTAL       TO DTL01-NBR-XDCK-CTNS.        04720000
047300     IF PV-PCNT-CRSDK-TOTAL > ZERO                                04730000
047400         COMPUTE PV-PCNT-FIELD =                                  04740000
047500                 (PV-PCNT-CRSDK-TOTAL / PV-CTN-TOTAL)             04750000
047600*GB              (PV-PCNT-CRSDK-TOTAL / PV-NBR-OF-LINES)          04760000
047700         MOVE PV-PCNT-FIELD TO DTL01-PCNT-XDCK-CTNS               04770000
047800     ELSE                                                         04780000
047900         MOVE ZERO          TO DTL01-PCNT-XDCK-CTNS.              04790000
048000     MOVE PV-P2L-CTN-TOTAL         TO DTL01-NBR-P2L-CTNS.         04800000
048100     IF PV-PCNT-P2L-CTN-TOTAL > ZERO                              04810000
048200         COMPUTE PV-PCNT-FIELD =                                  04820000
048300**GB            (PV-PCNT-P2L-CTN-TOTAL / PV-NBR-OF-LINES)         04830000
048400                (PV-PCNT-P2L-CTN-TOTAL / PV-CTN-TOTAL)            04840000
048500         MOVE PV-PCNT-FIELD TO DTL01-PCNT-P2L-CTNS                04850000
048600     ELSE                                                         04860000
048700         MOVE ZERO          TO DTL01-PCNT-P2L-CTNS.               04870000
048800                                                                  04880000
048900* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  04890000
049000     MOVE SPACES                   TO DTL01-P2L-ZONE.             04900000
049100     MOVE PV-PRC-TOTAL             TO DTL01-REPLEN-CARTON-CNT.    04910000
049110     MOVE PV-RFID-CRTN-QTY         TO DTL01-RFID-CTNS.            04911000
049120     MOVE PV-RFID-UNIT-QTY         TO DTL01-RFID-UNTS.            04912000
049200* RMK 6/2010 - END                                                04920000
049420     MOVE SPACES                   TO DTL01-AUD-TYP.              04942000
049500     MOVE PV-TROUBLE-CTN-TOTAL     TO DTL01-NBR-CTNS-TROUBLE.     04950000
049600     MOVE PV-SET-DVT-CTN-TOTAL     TO DTL01-NBR-CTNS-ST-DVT.      04960000
049700     MOVE ZERO                     TO DTL01-100-PCNT-AUD-CNT.     04970000
049800     MOVE ZERO                     TO DTL01-NBR-CTNS-NOT-SCN.     04980000
049900     MOVE ZERO                     TO DTL01-PCNT-SCANNED          04990000
049910                                      DTL01-EFC-POS               04991000
049920                                      DTL01-EFC-CTNS              04992000
049930                                      DTL01-EFC-UNITS.            04993000
050000                                                                  05000000
050100     WRITE REPORT-RECORD FROM DTL01-LINE                          05010000
050200            AFTER ADVANCING 1 LINE.                               05020000
050300                                                                  05030000
050400     ADD  +1     TO PV-LINE-CNT.                                  05040000
050500                                                                  05050000
050600     MOVE ZERO TO PV-PO-TOTAL                                     05060000
050700                  PV-CTN-TOTAL                                    05070000
050800                  PV-UNITS-TOTAL                                  05080000
050900* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  05090000
051000                  PV-PRC-TOTAL                                    05100000
051100* RMK 6/2010 - END                                                05110000
051101* CLP 06/05/13 PR# 5148B START                                    05110100
051110                  PV-RFID-CRTN-QTY                                05111000
051120                  PV-RFID-UNIT-QTY                                05112000
051130* CLP 06/05/13 PR# 5148B END                                      05113000
051200                  PV-AUD-CTN-TOTAL                                05120000
051201*VSH 03/07/14 - BEGIN PR#5148D                                    05120100
051210                  PV-RFID-AUD-CTN-TOTAL                           05121000
051220                  PV-COMB-AUD-CTN-TOTAL                           05122000
051230                  PV-U-RFID-CTN-TOTAL                             05123000
051240                  PV-U-COMB-CTN-TOTAL                             05124000
051250*VSH 03/07/14 - END PR#5148D                                      05125000
051300                  PV-PCNT-AUD-CTN-TOTAL                           05130000
051400                  PV-U-CTN-TOTAL                                  05140000
051500                  PV-PCNT-U-CTN-TOTAL                             05150000
051600                  PV-CRSDK-CTN-TOTAL                              05160000
051700                  PV-PCNT-CRSDK-TOTAL                             05170000
051800                  PV-P2L-CTN-TOTAL                                05180000
051900                  PV-PCNT-P2L-CTN-TOTAL                           05190000
052000                  PV-TROUBLE-CTN-TOTAL                            05200000
052100                  PV-SET-DVT-CTN-TOTAL                            05210000
052200                  PV-NBR-OF-LINES                                 05220099
052210                  PV-HAZ-CRTN-QTY                                 05221099
052220                  PV-HAZ-UNIT-QTY                                 05222099
052230                  PV-CNTL-FLOW-CRTN-QTY                           05223099
052240                  PV-CNTL-FLOW-UNIT-QTY.                          05224099
052250                                                                  05225099
052300/                                                                 05230000
052310 3500-HANG-PKSLIP-RECORD.                                         05231000
052320                                                                  05232000
052330     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           05233000
052340         PERFORM 9050-REPORT-HEADERS                              05234000
052350         PERFORM 9040-PAGE-HEADERS                                05235000
052360     END-IF.                                                      05236000
052370                                                                  05237000
052371     MOVE 'N'                      TO PS-HANG-PKSLIP-SW.          05237100
052394     MOVE PV-PO-TOTAL              TO DTL02-NBR-OF-POS.           05239400
052395     MOVE PV-CTN-TOTAL             TO DTL02-NBR-OF-CTNS.          05239500
052396     MOVE PV-UNITS-TOTAL           TO DTL02-NBR-OF-UNITS.         05239600
052444                                                                  05244400
052445     WRITE REPORT-RECORD FROM DTL02-LINE                          05244500
052446            AFTER ADVANCING 2 LINES.                              05244600
052447                                                                  05244700
052448     ADD  +2   TO PV-LINE-CNT.                                    05244800
052449                                                                  05244900
052450     MOVE ZERO TO PV-PO-TOTAL                                     05245000
052451                  PV-CTN-TOTAL                                    05245100
052452                  PV-UNITS-TOTAL.                                 05245200
052467                                                                  05246700
052470* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               05247000
052500******************************************************            05250000
052600* 4000-SUM-REPLEN                                    *            05260000
052700******************************************************            05270000
052800 4000-SUM-REPLEN.                                                 05280000
052900                                                                  05290000
053000     MOVE PC068-REPLEN-CARTON-CNT  TO PV-REPLEN-CRTN-CNT.         05300000
053100                                                                  05310000
053200* JAK 8/2011 - END                                                05320000
053210******************************************************            05321000
053220* 5000-HANG-PKSLIP                                   *            05322000
053230******************************************************            05323000
053240 5000-HANG-PKSLIP.                                                05324000
053250                                                                  05325000
053251     MOVE 'Y'                      TO PS-HANG-PKSLIP-SW.          05325100
053261     ADD PC068-PO-CNT-TRLR         TO PV-PO-TOTAL.                05326100
053262     ADD PC068-TOT-CTN-CNT         TO PV-CTN-TOTAL.               05326200
053263     ADD PC068-UNIT-CNT-TRLR       TO PV-UNITS-TOTAL.             05326300
053270                                                                  05327000
053460******************************************************            05346000
053500* 9000-REPORT-DETAIL.                                *            05350000
053600******************************************************            05360000
053700 9000-REPORT-DETAIL.                                              05370000
053800                                                                  05380000
053810     MOVE ZERO                     TO DTL01-EFC-POS               05381000
053830                                      DTL01-EFC-CTNS              05383000
053840                                      DTL01-EFC-UNITS.            05384000
053900     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           05390000
054000         PERFORM 9050-REPORT-HEADERS                              05400000
054100         PERFORM 9040-PAGE-HEADERS                                05410000
054200     END-IF.                                                      05420000
054300                                                                  05430000
054320                                                                  05432000
054400     MOVE PC068-TRLR-LOC           TO DTL01-LOC.                  05440000
054500     IF ( PC068-ARRIVAL-DATE = '01-01-0001' )                     05450000
054600         MOVE 'ENROUTE   '             TO DTL01-ARRIVAL-DATE      05460000
054700     ELSE                                                         05470000
054800         MOVE PC068-ARRIVAL-DATE       TO DTL01-ARRIVAL-DATE.     05480000
054900     MOVE PC068-SCAC               TO DTL01-SCAC.                 05490000
055000     MOVE PC068-TRLR-NBR           TO DTL01-VEHICLE.              05500000
055100     MOVE PC068-PO-CNT-TRLR        TO DTL01-NBR-OF-POS.           05510000
055200     MOVE PC068-TOT-CTN-CNT        TO DTL01-NBR-OF-CTNS.          05520000
055300     IF PC068-UNIT-CNT NUMERIC                                    05530000
055400         MOVE PC068-UNIT-CNT-TRLR  TO DTL01-NBR-OF-UNITS          05540000
055500     ELSE                                                         05550000
055600         MOVE ZERO                 TO DTL01-NBR-OF-UNITS          05560000
055700     END-IF.                                                      05570000
055710*VSH 03/07/14 - BEGIN PR#5148D                                    05571000
055800     MOVE PC068-AUD-CRTNS-TRLR      TO DTL01-NBR-AUD-CTNS.        05580000
055810     MOVE PC068-RFID-AUD-CRTNS-TRLR TO DTL01-NBR-RF-AUD-CTNS.     05581000
055820     MOVE PC068-COMB-AUD-CRTNS-TRLR TO DTL01-NBR-COM-AUD-CTNS.    05582000
055900     IF (PC068-AUD-CRTNS-TRLR > ZERO AND PC068-TOT-CTN-CNT > ZERO)05590000
055910        OR (PC068-RFID-AUD-CRTNS-TRLR > ZERO                      05591000
055920        AND PC068-TOT-CTN-CNT > ZERO)                             05592000
056000         COMPUTE PV-PCNT-FIELD =                                  05600000
056100               ((PC068-AUD-CRTNS-TRLR + PC068-RFID-AUD-CRTNS-TRLR 05610000
056120         + PC068-COMB-AUD-CRTNS-TRLR) / PC068-TOT-CTN-CNT)        05612000
056130*VSH 03/07/14 - END PR#5148D                                      05613000
056200         MOVE PV-PCNT-FIELD TO DTL01-PCNT-AUD-CTNS                05620000
056300     ELSE                                                         05630000
056400         MOVE ZERO          TO DTL01-PCNT-AUD-CTNS.               05640000
056500     MOVE PC068-AUD-CRTNS-TRLR-U   TO DTL01-NBR-U-CTNS.           05650000
056600     IF PC068-AUD-CRTNS-TRLR-U > ZERO AND PC068-TOT-CTN-CNT > ZERO05660000
056700         COMPUTE PV-PCNT-FIELD =                                  05670000
056800               ((PC068-AUD-CRTNS-TRLR-U)/ PC068-TOT-CTN-CNT)      05680000
056900         MOVE PV-PCNT-FIELD TO DTL01-PCNT-U-CTNS                  05690000
057000     ELSE                                                         05700000
057100         MOVE ZERO          TO DTL01-PCNT-U-CTNS.                 05710000
057200     MOVE PC068-XDCK-CTN-CNT       TO DTL01-NBR-XDCK-CTNS.        05720000
057300     IF PC068-XDCK-CTN-CNT > ZERO AND PC068-TOT-CTN-CNT > ZERO    05730000
057400         COMPUTE PV-PCNT-FIELD =                                  05740000
057510                 (PC068-XDCK-CTN-CNT / PC068-TOT-CTN-CNT)         05751000
057600         MOVE PV-PCNT-FIELD TO DTL01-PCNT-XDCK-CTNS               05760000
057700     ELSE                                                         05770000
057800         MOVE ZERO          TO DTL01-PCNT-XDCK-CTNS.              05780000
057900     MOVE PC068-P2L-CTN-CNT        TO DTL01-NBR-P2L-CTNS.         05790000
058000*    IF PC068-STORE-ZONE = SPACE                                  05800000
058100        IF PC068-P2L-CTN-CNT > ZERO AND PC068-TOT-CTN-CNT > ZERO  05810000
058200            COMPUTE PV-PCNT-FIELD =                               05820000
058310                   (PC068-P2L-CTN-CNT / PC068-TOT-CTN-CNT)        05831000
058400            MOVE PV-PCNT-FIELD TO DTL01-PCNT-P2L-CTNS             05840000
058500        ELSE                                                      05850000
058600            MOVE ZERO          TO DTL01-PCNT-P2L-CTNS             05860000
058700        END-IF                                                    05870000
058800*GB   END-IF                                                      05880000
058900                                                                  05890000
059000* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               05900000
059100* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  05910000
059200*    IF PC068-STORE-ZONE = 'REPLE'                                05920000
059300*       MOVE SPACES                   TO DTL01-P2L-ZONE           05930000
059400*    ELSE                                                         05940000
059500*       MOVE PC068-STORE-ZONE         TO DTL01-P2L-ZONE           05950000
059600*    END-IF.                                                      05960000
059700*    MOVE PC068-STORE-ZONE         TO DTL01-P2L-ZONE.             05970000
059800*    MOVE PC068-REPLEN-CARTON-CNT  TO DTL01-REPLEN-CARTON-CNT.    05980000
059900* RMK 6/2010 - END                                                05990000
060000     MOVE SPACES                   TO DTL01-P2L-ZONE.             06000000
060100     MOVE PV-REPLEN-CRTN-CNT       TO DTL01-REPLEN-CARTON-CNT.    06010000
060200* JAK 8/2011 - END                                                06020000
060400     MOVE PC068-TRBLE-CTN-CNT-TRLR TO DTL01-NBR-CTNS-TROUBLE.     06040000
060500     MOVE PC068-SET-DIVERT-CNT-TRLR TO DTL01-NBR-CTNS-ST-DVT.     06050000
060600     MOVE PC068-AUD-CRTNS-100-TRLR TO DTL01-100-PCNT-AUD-CNT.     06060000
060601*VSH 03/07/14 - BEGIN PR#5148D                                    06060100
060610     IF DTL01-100-PCNT-AUD-CNT = 0                                06061000
060620        MOVE SPACES TO DTL01-AUD-TYP                              06062000
060630     ELSE                                                         06063000
060640         MOVE PC068-AUD-TYP TO DTL01-AUD-TYP                      06064000
060700     END-IF.                                                      06070000
060710*VSH 03/07/14 - END PR#5148D                                      06071000
060800     MOVE PC068-CRTNS-TO-SCAN-TRLR TO DTL01-NBR-CTNS-NOT-SCN.     06080000
060910     MOVE PC068-EFC-PO-CNT-TRLR    TO DTL01-EFC-POS.              06091000
061000     MOVE PC068-EFC-CTN-CNT-TRLR   TO DTL01-EFC-CTNS.             06100000
061100     MOVE PC068-EFC-UNT-CNT-TRLR   TO DTL01-EFC-UNITS.            06110000
061200     MOVE PC068-RFID-CTN-CNT   TO DTL01-RFID-CTNS.                06120000
061210     MOVE PC068-RFID-UNT-CNT   TO DTL01-RFID-UNTS.                06121000
061300     IF PC068-CRTNS-TO-SCAN-TRLR > ZERO AND                       06130000
061400        PC068-TOT-CTN-CNT > ZERO                                  06140000
061500         COMPUTE PV-PCNT-FIELD =                                  06150000
061600              ((PC068-TOT-CTN-CNT - PC068-CRTNS-TO-SCAN-TRLR) /   06160000
061710                PC068-TOT-CTN-CNT)                                06171000
061800         MOVE PV-PCNT-FIELD TO DTL01-PCNT-SCANNED                 06180000
061900     ELSE                                                         06190000
062000     IF PC068-TOT-CTN-CNT = ZERO                                  06200000
062100         MOVE ZERO          TO DTL01-PCNT-SCANNED                 06210000
062200     ELSE                                                         06220000
062310         MOVE 1             TO DTL01-PCNT-SCANNED.                06231000
062400                                                                  06240000
062600* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  06260000
062610* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               06261000
062700*    IF PC068-STORE-ZONE = 'REPLE'                                06270000
062710     IF PV-REPLEN-CRTN-CNT > 0                                    06271000
062800         MOVE ZERO TO DTL01-PCNT-SCANNED                          06280000
062900*        COMPUTE DTL01-NBR-CTNS-NOT-SCN =                         06290000
063000*          (PC068-XDCK-CTN-CNT + PC068-P2L-CTN-CNT +              06300000
063110*           PC068-TRBLE-CTN-CNT-TRLR)                             06311000
063200*        COMPUTE DTL01-NBR-OF-CTNS =                              06320000
063310*              (PC068-TOT-CTN-CNT - PV-REPLEN-CRTN-CNT)           06331000
063320* JAK 8/2011 - END                                                06332000
063400     END-IF.                                                      06340000
063500* RMK 6/2010 - END                                                06350000
063600                                                                  06360099
063610*** DMH 6/27/14 - BEGIN                                           06361099
063630     MOVE  PC068-HAZ-CTN-CNT        TO DTL01-HAZ-CTNS.            06363099
063650     MOVE  PC068-HAZ-UNT-CNT        TO DTL01-HAZ-UNTS.            06365099
063670     MOVE  PC068-CNTL-FLOW-CTN-CNT  TO DTL01-CNTL-FLOW-CTNS.      06367099
063690     MOVE  PC068-CNTL-FLOW-UNT-CNT  TO DTL01-CNTL-FLOW-UNTS.      06369099
063698*** DMH 6/27/14 - END                                             06369899
063699                                                                  06369999
063700     IF  DTL01-PCNT-SCANNED =    1                                06370000
063800        CONTINUE                                                  06380000
063900     ELSE                                                         06390000
064000       WRITE REPORT-RECORD FROM DTL01-LINE                        06400000
064100              AFTER ADVANCING 1 LINE                              06410000
064200                                                                  06420000
064300       ADD  +1 TO PV-LINE-CNT                                     06430000
064400                  PV-NBR-OF-LINES                                 06440000
064500                                                                  06450000
064600       COMPUTE PV-PO-TOTAL           =                            06460000
064700               PV-PO-TOTAL + PC068-PO-CNT-TRLR                    06470000
064800* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  06480000
064900       COMPUTE PV-CTN-TOTAL          =                            06490000
064910* JAK 8/2011 - REQUEST #3253 - DO NOT INCLUDE REPLEN IN TOT CNT   06491000
065000*              (PV-CTN-TOTAL + PC068-TOT-CTN-CNT -                06500000
065100*              PC068-REPLEN-CARTON-CNT )                          06510000
065110               (PV-CTN-TOTAL + PC068-TOT-CTN-CNT)                 06511000
065200       IF PC068-UNIT-CNT NUMERIC                                  06520000
065300           COMPUTE PV-UNITS-TOTAL    =                            06530000
065400                   PV-UNITS-TOTAL + PC068-UNIT-CNT-TRLR           06540000
065500       END-IF                                                     06550000
065700       COMPUTE PV-PRC-TOTAL          =                            06570000
065710* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               06571000
065800*              PV-PRC-TOTAL + PC068-REPLEN-CARTON-CNT             06580000
066000               PV-PRC-TOTAL + PV-REPLEN-CRTN-CNT                  06600000
066100* JAK 8/2011 - END                                                06610000
066200* RMK 6/2010 - END                                                06620000
066210* CLP 6/5/13 PR# 5148B START                                      06621000
066300       COMPUTE PV-RFID-CRTN-QTY      =                            06630000
066301               PV-RFID-CRTN-QTY + PC068-RFID-CTN-CNT              06630100
066302       COMPUTE PV-RFID-UNIT-QTY      =                            06630200
066303               PV-RFID-UNIT-QTY + PC068-RFID-UNT-CNT              06630300
066304* CLP 6/5/13 PR# 5148B END                                        06630400
066310       COMPUTE PV-AUD-CTN-TOTAL      =                            06631000
066400               PV-AUD-CTN-TOTAL + PC068-AUD-CRTNS-TRLR            06640000
066401*VSH 03/07/14 - BEGIN PR#5148D                                    06640100
066410       COMPUTE PV-RFID-AUD-CTN-TOTAL =                            06641000
066420               PV-RFID-AUD-CTN-TOTAL + PC068-RFID-AUD-CRTNS-TRLR  06642000
066430       COMPUTE PV-COMB-AUD-CTN-TOTAL =                            06643000
066440               PV-COMB-AUD-CTN-TOTAL + PC068-COMB-AUD-CRTNS-TRLR  06644000
066450*VSH 03/07/14 - END PR#5148D                                      06645000
066500       MOVE DTL01-PCNT-AUD-CTNS TO PV-HOLD-PERCENT                06650000
066600       COMPUTE PV-PCNT-AUD-CTN-TOTAL =                            06660000
066700               PV-PCNT-AUD-CTN-TOTAL + PV-HOLD-PERCENT            06670000
066800       COMPUTE PV-U-CTN-TOTAL        =                            06680000
066900               PV-U-CTN-TOTAL + PC068-AUD-CRTNS-TRLR-U            06690000
066901*VSH 03/07/14 - BEGIN PR#5148D                                    06690100
066910       COMPUTE PV-U-RFID-CTN-TOTAL   =                            06691000
066920               PV-U-RFID-CTN-TOTAL + PC068-RFID-AUD-CRTNS-TRLR-U  06692000
066930       COMPUTE PV-U-COMB-CTN-TOTAL   =                            06693000
066940               PV-U-COMB-CTN-TOTAL + PC068-COMB-AUD-CRTNS-TRLR-U  06694000
066950*VSH 03/07/14 - END PR#5148D                                      06695000
067000       MOVE DTL01-PCNT-U-CTNS   TO PV-HOLD-PERCENT                06700000
067100       COMPUTE PV-PCNT-U-CTN-TOTAL   =                            06710000
067200               PV-PCNT-U-CTN-TOTAL + PV-HOLD-PERCENT              06720000
067300       COMPUTE PV-CRSDK-CTN-TOTAL    =                            06730000
067400               PV-CRSDK-CTN-TOTAL + PC068-XDCK-CTN-CNT            06740000
067500       MOVE DTL01-PCNT-XDCK-CTNS TO PV-HOLD-PERCENT               06750000
067600       COMPUTE PV-PCNT-CRSDK-TOTAL   =                            06760000
067700               PV-PCNT-CRSDK-TOTAL + PV-HOLD-PERCENT              06770000
067800       COMPUTE PV-P2L-CTN-TOTAL      =                            06780000
067900               PV-P2L-CTN-TOTAL + PC068-P2L-CTN-CNT               06790000
068000       MOVE DTL01-PCNT-P2L-CTNS TO PV-HOLD-PERCENT                06800000
068100       COMPUTE PV-PCNT-P2L-CTN-TOTAL =                            06810000
068200               PV-PCNT-P2L-CTN-TOTAL + PV-HOLD-PERCENT            06820000
068300       COMPUTE PV-TROUBLE-CTN-TOTAL  =                            06830000
068400               PV-TROUBLE-CTN-TOTAL + PC068-TRBLE-CTN-CNT-TRLR    06840000
068500       COMPUTE PV-SET-DVT-CTN-TOTAL  =                            06850000
068600               PV-SET-DVT-CTN-TOTAL + PC068-SET-DIVERT-CNT-TRLR   06860000
068700* JAK 8/2011 - REQUEST #3253 - REWRITE REPLEN LOGIC               06870000
068800       MOVE ZERO                TO PV-REPLEN-CRTN-CNT             06880000
068900* JAK 8/2011 - END                                                06890000
069000     END-IF.                                                      06900000
069100/                                                                 06910000
069200******************************************************            06920000
069300* 9010-ZONE-DETAIL.                                  *            06930000
069400******************************************************            06940000
069500 9010-ZONE-DETAIL.                                                06950000
069600                                                                  06960000
069700     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           06970000
069800         PERFORM 9050-REPORT-HEADERS                              06980000
069900         PERFORM 9040-PAGE-HEADERS                                06990000
070000     END-IF.                                                      07000000
070100                                                                  07010000
070200     MOVE PC068-TRLR-LOC           TO DTL01-LOC.                  07020000
070300     IF ( PC068-ARRIVAL-DATE = '01-01-0001' )                     07030000
070400         MOVE 'ENROUTE   '             TO DTL01-ARRIVAL-DATE      07040000
070500     ELSE                                                         07050000
070600         MOVE PC068-ARRIVAL-DATE       TO DTL01-ARRIVAL-DATE.     07060000
070700     MOVE PC068-SCAC               TO DTL01-SCAC.                 07070000
070800     MOVE PC068-TRLR-NBR           TO DTL01-VEHICLE.              07080000
070910     MOVE SPACE                    TO DTL01-AUD-TYP.              07091099
071000     MOVE ZERO                     TO DTL01-NBR-OF-POS            07100000
071100                                      DTL01-NBR-OF-CTNS           07110000
071200                                      DTL01-NBR-OF-UNITS          07120000
071300                                      DTL01-NBR-AUD-CTNS          07130000
071301*VSH 03/07/14 - BEGIN PR#5148D                                    07130100
071310                                      DTL01-NBR-RF-AUD-CTNS       07131000
071320                                      DTL01-NBR-COM-AUD-CTNS      07132000
071330*VSH 03/07/14 - END PR#5148D                                      07133000
071400                                      DTL01-PCNT-AUD-CTNS         07140000
071500                                      DTL01-NBR-U-CTNS            07150000
071600                                      DTL01-PCNT-U-CTNS           07160000
071700                                      DTL01-NBR-XDCK-CTNS         07170000
071800                                      DTL01-PCNT-XDCK-CTNS        07180000
071900* RMK 6/2010 - REQUEST #3032B - ADD PROCESS DATA                  07190000
072000                                      DTL01-REPLEN-CARTON-CNT     07200000
072001* CLP 6/5/13 PR# 5148B START                                      07200100
072010                                      DTL01-RFID-CTNS             07201000
072020                                      DTL01-RFID-UNTS             07202000
072030* CLP 6/5/13 PR# 5148B END                                        07203000
072100* RMK 6/2010 - END                                                07210000
072200     MOVE PC068-P2L-CTN-CNT        TO DTL01-NBR-P2L-CTNS.         07220000
072300*GB  IF PC068-P2L-CTN-CNT > ZERO AND PC068-TOT-CTN-CNT > ZERO     07230000
072400*GB      COMPUTE PV-PCNT-FIELD =                                  07240000
072500*GB             (PC068-P2L-CTN-CNT / PC068-TOT-CTN-CNT) * 100     07250000
072600*GB      MOVE PV-PCNT-FIELD TO DTL01-PCNT-P2L-CTNS                07260000
072700*GB  ELSE                                                         07270000
072800     MOVE ZERO          TO DTL01-PCNT-P2L-CTNS                    07280000
072900     MOVE PC068-STORE-ZONE         TO DTL01-P2L-ZONE.             07290000
073000     MOVE ZERO                     TO DTL01-NBR-CTNS-TROUBLE      07300000
073100                                      DTL01-NBR-CTNS-ST-DVT       07310000
073200                                      DTL01-100-PCNT-AUD-CNT      07320000
073300                                      DTL01-NBR-CTNS-NOT-SCN      07330000
073400                                      DTL01-PCNT-SCANNED          07340000
073410                                      DTL01-EFC-POS               07341000
073420                                      DTL01-EFC-CTNS              07342000
073430                                      DTL01-EFC-UNITS             07343099
073440                                      DTL01-HAZ-CTNS              07344099
073460                                      DTL01-HAZ-UNTS              07346099
073480                                      DTL01-CNTL-FLOW-CTNS        07348099
073491                                      DTL01-CNTL-FLOW-UNTS.       07349199
073500                                                                  07350000
073600     WRITE REPORT-RECORD FROM DTL01-LINE                          07360000
073700            AFTER ADVANCING 1 LINE.                               07370000
073800                                                                  07380000
073900     ADD  +1 TO PV-LINE-CNT                                       07390000
074000                PV-NBR-OF-LINES.                                  07400000
074100                                                                  07410000
074200/                                                                 07420000
074300******************************************************            07430000
074400* 9040-PAGE-HEADERS.                                 *            07440000
074500******************************************************            07450000
074600 9040-PAGE-HEADERS.                                               07460000
074700                                                                  07470000
074800     IF ( PV-LINE-CNT > PV-LINE-LIMIT )                           07480000
074900         PERFORM 9050-REPORT-HEADERS                              07490000
075000     END-IF.                                                      07500000
075100                                                                  07510000
075200     WRITE REPORT-RECORD FROM HDR02-LINE                          07520000
075300            AFTER ADVANCING 2 LINES.                              07530000
075400     WRITE REPORT-RECORD FROM HDR03-LINE                          07540000
075500            AFTER ADVANCING 1 LINE.                               07550000
075600     WRITE REPORT-RECORD FROM HDR04-LINE                          07560000
075700            AFTER ADVANCING 1 LINE.                               07570000
075800     WRITE REPORT-RECORD FROM HDR05-LINE                          07580000
075900            AFTER ADVANCING 1 LINE.                               07590000
076000     WRITE REPORT-RECORD FROM HDR06-LINE                          07600000
076100            AFTER ADVANCING 1 LINES.                              07610000
076200     WRITE REPORT-RECORD FROM HDR07-LINE                          07620000
076300            AFTER ADVANCING 1 LINES.                              07630000
076400*    WRITE REPORT-RECORD FROM BLANK-LINE                          07640000
076500*           AFTER ADVANCING 1 LINE.                               07650000
076600                                                                  07660000
076700     ADD  +7 TO PV-LINE-CNT.                                      07670000
076800/                                                                 07680000
076900******************************************************            07690000
077000* 9050-REPORT-HEADERS.                               *            07700000
077100******************************************************            07710000
077200 9050-REPORT-HEADERS.                                             07720000
077300                                                                  07730000
077400     ADD +1           TO PV-PAGE-CNT.                             07740000
077500     MOVE PV-PAGE-CNT TO DP250O-PAGE-NUMBER.                      07750000
077600                                                                  07760000
077700     WRITE REPORT-RECORD FROM DP250O-STANDRD-HEADER-250-COLS      07770000
077800            AFTER ADVANCING PAGE.                                 07780000
077900     WRITE REPORT-RECORD FROM HDR01-LINE                          07790000
078000            AFTER ADVANCING 1 LINE.                               07800000
078100*    WRITE REPORT-RECORD FROM BLANK-LINE                          07810000
078200*           AFTER ADVANCING 1 LINE.                               07820000
078300                                                                  07830000
078400     MOVE +2 TO PV-LINE-CNT.                                      07840000
078500*    MOVE +3 TO PV-LINE-CNT.                                      07850000
078600/                                                                 07860000
