000100 IDENTIFICATION DIVISION.                                         00010001
000200 TITLE 'SUMMARIZE SE RECS BY PO/RCVR/UPC/LOC'.                    00020001
000300                                                                  00030001
000400 PROGRAM-ID.             PCKUT057.                                00040001
000500 AUTHOR.                 DENNIS STEFFEN.                          00050001
000600 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00060001
000700 DATE-WRITTEN            NOVEMBER 2005.                           00070001
000800 DATE-COMPILED.                                                   00080001
000900                                                                  00090001
001000 ENVIRONMENT DIVISION.                                            00100001
001100 CONFIGURATION SECTION.                                           00110001
001200                                                                  00120001
001300 SOURCE-COMPUTER.        IBM-3090.                                00130001
001400 OBJECT-COMPUTER.        IBM-3090.                                00140001
001500                                                                  00150001
001600 INPUT-OUTPUT SECTION.                                            00160001
001700                                                                  00170001
001800 FILE-CONTROL.                                                    00180001
001900                                                                  00190001
002000     SELECT ALL-INV-SE-FILE                                       00200001
002100         ASSIGN TO INP01.                                         00210001
002200                                                                  00220001
002300     SELECT SUMMARY-FILE                                          00230001
002400         ASSIGN TO OUT01.                                         00240001
002500                                                                  00250001
002600     SELECT LONESOME-FILE                                         00260001
002700         ASSIGN TO OUT02.                                         00270001
002800                                                                  00280001
002900 DATA DIVISION.                                                   00290001
003000 FILE SECTION.                                                    00300001
003100                                                                  00310001
003200                                                                  00320001
003300 FD  ALL-INV-SE-FILE                                              00330001
003400     RECORDING MODE IS F                                          00340001
003500     LABEL RECORDS ARE STANDARD                                   00350001
003600     BLOCK CONTAINS 0 RECORDS.                                    00360001
003700                                                                  00370001
003800 01  ALL-INV-SE-RECORD                PIC  X(040).                00380001
003900                                                                  00390001
004000 FD  SUMMARY-FILE                                                 00400001
004100     RECORDING MODE IS F                                          00410001
004200     LABEL RECORDS ARE STANDARD                                   00420001
004300     BLOCK CONTAINS 0 RECORDS.                                    00430001
004400                                                                  00440001
004500 01  SUMMARY-REC                      PIC X(080).                 00450001
004600                                                                  00460001
004700 FD  LONESOME-FILE                                                00470001
004800     RECORDING MODE IS F                                          00480001
004900     LABEL RECORDS ARE STANDARD                                   00490001
005000     BLOCK CONTAINS 0 RECORDS.                                    00500001
005100                                                                  00510001
005200 01  LONESOME-REC                     PIC X(080).                 00520001
005300                                                                  00530001
005400 WORKING-STORAGE SECTION.                                         00540001
005500                                                                  00550001
005600 01  FILLER.                                                      00560001
005700     05  FILLER                      PIC  X(36)    VALUE          00570001
005800         ' ***** WORKING STORAGE PGM=PCKUT057 '.                  00580001
005900     05  PGM-COMPILED                PIC  X(20)    VALUE SPACE.   00590001
006000                                                                  00600001
006100 01  PV-WHEN-COMPILED.                                            00610001
006200     05  PV-COMPILE-DATE          PIC X(08).                      00620001
006300     05  PV-COMPILE-TIME          PIC X(08).                      00630001
006400                                                                  00640001
006500 01  PS-SWITCHES.                                                 00650001
006600     05  PS-EOF-DETAIL-SW             PIC X(01) VALUE 'N'.        00660001
006700         88  PS-EOF-DETAIL-YES                  VALUE 'Y'.        00670001
006800         88  PS-EOF-DETAIL-NO                   VALUE 'N'.        00680001
006900     05  PS-EOF-CLEAN-SW              PIC X(01) VALUE 'N'.        00690001
007000         88  PS-CLEAN-FOUND-YES                 VALUE 'Y'.        00700001
007100         88  PS-CLEAN-FOUND-NO                  VALUE 'N'.        00710001
007200     05  PS-END-CSR-SW                PIC X(01) VALUE 'N'.        00720001
007300         88  PS-END-CSR-YES                     VALUE 'Y'.        00730001
007400         88  PS-END-CSR-NO                      VALUE 'N'.        00740001
007500                                                                  00750001
007600                                                                  00760001
007700*        THESE KEYS CONTROL THE OUTER LOOP OF PO/RCVR             00770001
007800 01  PV-MATCH-KEYS.                                               00780001
007900     05  PV-CURR-KEY.                                             00790001
008000         10  PV-CURR-PO               PIC S9(10) COMP VALUE ZERO. 00800001
008100         10  PV-CURR-RCVR             PIC S9(10) COMP VALUE ZERO. 00810001
008200         10  PV-CURR-UPC              PIC S9(10) COMP VALUE ZERO. 00820001
008300         10  PV-CURR-LOC              PIC S9(10) COMP VALUE ZERO. 00830001
008400                                                                  00840001
008500     05  PV-PREV-KEY.                                             00850001
008600         10  PV-PREV-PO               PIC S9(10) COMP VALUE ZERO. 00860001
008700         10  PV-PREV-RCVR             PIC S9(10) COMP VALUE ZERO. 00870001
008800         10  PV-PREV-UPC              PIC S9(10) COMP VALUE ZERO. 00880001
008900         10  PV-PREV-LOC              PIC S9(10) COMP VALUE ZERO. 00890001
009000                                                                  00900001
009100 01  PV-TYPE-TOTALS.                                              00910001
009200     05  PV-AR-TOTAL                  PIC S9(09) COMP-3           00920001
009300                                                 VALUE ZERO.      00930001
009400     05  PV-UN-TOTAL                  PIC S9(09) COMP-3           00940001
009500                                                 VALUE ZERO.      00950001
009600     05  PV-PERCENT                   PIC S9(04)V9(06) COMP-3     00960001
009700                                                 VALUE ZERO.      00970001
009800     05  PV-RCVR-REC-COUNT            PIC S9(09) COMP             00980001
009900                                                 VALUE ZERO.      00990001
010000     05  PV-GROUP-TOTAL               PIC S9(09) COMP-3           01000001
010100                                                 VALUE ZERO.      01010001
010200     05  PV-SKU-COUNT                 PIC S9(09) COMP             01020001
010300                                                 VALUE ZERO.      01030001
010400     05  PV-SKU-COUNT2                PIC S9(09) COMP             01040001
010500                                                 VALUE ZERO.      01050001
010600     05  PV-SKU-COUNT3                PIC S9(09) COMP             01060001
010700                                                 VALUE ZERO.      01070001
010800     05  PV-SKU-COUNT4                PIC S9(09) COMP             01080001
010900                                                 VALUE ZERO.      01090001
011000/                                                                 01100001
011100 01  PC-CONSTANTS.                                                01110001
011200     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          01120001
011300                                                   'PCKUT057'.    01130001
011400     05  PC-ILBOABN0                 PIC  X(08)    VALUE          01140001
011500                                                   'ILBOABN0'.    01150001
011600     05  PC-MAX-RETRIES              PIC S9(04)    VALUE  +3      01160001
011700                                                   COMP.          01170001
011800                                                                  01180001
011900 01  PV-MISC-STUFF.                                               01190001
012000     05  PV-SAVE-INV-DTE              PIC X(10) VALUE SPACES.     01200001
012100     05  PV-TMST                      PIC X(26).                  01210001
012200     05  PV-START-RCVR-DATE           PIC X(10).                  01220001
012300     05  PV-END-RCVR-DATE             PIC X(10).                  01230001
012400     05  PV-ABEND-PARAGRAPH           PIC  X(30) VALUE SPACES.    01240001
012500     05  PV-DB2-OPERATION-ATTEMPTED   PIC  X(60) VALUE SPACE.     01250001
012600     05  PV-SQL-CODE                  PIC  9(04) VALUE ZERO.      01260001
012700     05  PV-COMP-10                   PIC S9(10) VALUE ZERO       01270001
012800                                                   COMP SYNC.     01280001
012900     05  PV-COMP3-BIG                 PIC S9(18) VALUE ZERO       01290001
013000                                                   COMP-3.        01300001
013100     05  PV-COMP3-BIG-REDIF REDEFINES PV-COMP3-BIG.               01310001
013200         10  FILLER                   PIC X(04).                  01320001
013300         10  PV-UPC-BIG               PIC S9(09) COMP.            01330001
013400                                                                  01340001
013500     05  PV-DISP-BIG                  PIC ZZZ,ZZZ,ZZZ,ZZ9.        01350001
013600     05  PV-RETRY-COUNTER             PIC S9(04) VALUE ZERO       01360001
013700                                                 COMP SYNC.       01370001
013800     05  PV-ABEND-CODE                PIC S9(04) VALUE ZERO       01380001
013900                                                   COMP SYNC.     01390001
014000     05  PV-READ-COUNTER-DTL          PIC S9(09) COMP-3           01400001
014100                                              VALUE ZERO.         01410001
014200     05  PV-WRITE-1-COUNTER           PIC S9(09) COMP-3           01420001
014300                                              VALUE ZERO.         01430001
014400     05  PV-WRITE-2-COUNTER           PIC S9(09) COMP-3           01440001
014500                                              VALUE ZERO.         01450001
014600     05  PV-WRITE-3-COUNTER           PIC S9(09) COMP-3           01460001
014700                                              VALUE ZERO.         01470001
014800     05  PV-WRITE-4-COUNTER           PIC S9(09) COMP-3           01480001
014900                                              VALUE ZERO.         01490001
015000     05  PV-GROUP-MEMBER-COUNT        PIC S9(05) COMP-3           01500001
015100                                              VALUE ZERO.         01510001
015200     05  PV-DISP-NBR                  PIC ZZZ,ZZZ,ZZZ,ZZ9.        01520001
015300     05  PV-DISP-PERCENT              PIC ZZ9.9999.               01530001
015400     05  PV-ABEND-OPERATION           PIC X(20) VALUE SPACES.     01540001
015500     05  PV-ABEND-STRUCTURE-1         PIC X(20) VALUE SPACES.     01550001
015600                                                                  01560001
015700 01  ABEND-CODE                       PIC S9(04)     VALUE +0     01570001
015800                                                     COMP SYNC.   01580001
015900     88  ABEND-4001-WRITE-ERROR                      VALUE +4001. 01590001
016000     88  ABEND-4002-READ-ERROR                       VALUE +4002. 01600001
016100     88  ABEND-4003-CTRL-CARD-ERROR                  VALUE +4003. 01610001
016200     88  ABEND-4004-TABLE-ERROR                      VALUE +4004. 01620001
016300     88  ABEND-4005-OPEN-ERROR                       VALUE +4005. 01630001
016400     88  ABEND-4006-CLOSE-ERROR                      VALUE +4006. 01640001
016500     88  ABEND-4007-SEQUENCE-ERROR                   VALUE +4007. 01650001
016600     88  ABEND-4008-DATS-ERROR                       VALUE +4008. 01660001
016700     88  ABEND-4009-KEY-DATS-ERROR                   VALUE +4009. 01670001
016800     88  ABEND-4013-DB2-ERROR                        VALUE +4013. 01680001
016900                                                                  01690001
017000 01  PV-COUNT-MSG-1.                                              01700001
017100     05  FILLER                       PIC X(38) VALUE             01710001
017200         'PURGE RECORDS WRITTEN TO OUT01     = '.                 01720001
017300     05  FILLER                       PIC X(27) VALUE SPACES.     01730001
017400     05  PV-MSG-1-COUNT               PIC ZZZ,ZZZ,ZZZ,ZZ9.        01740001
017500                                                                  01750001
017600 01  PV-COUNT-MSG-4.                                              01760001
017700     05  FILLER                       PIC X(38) VALUE             01770001
017800         'LONESOME CLEANS WRITTEN TO OUT02   = '.                 01780001
017900     05  FILLER                       PIC X(27) VALUE SPACES.     01790001
018000     05  PV-MSG-4-COUNT               PIC ZZZ,ZZZ,ZZZ,ZZ9.        01800001
018100                                                                  01810001
018200 01  PV-COUNT-MSG-3.                                              01820001
018300     05  FILLER                       PIC X(38) VALUE             01830001
018400         'CLEAN GROUPS                       = '.                 01840001
018500     05  FILLER                       PIC X(27) VALUE SPACES.     01850001
018600     05  PV-MSG-3-COUNT               PIC ZZZ,ZZZ,ZZZ,ZZ9.        01860001
018700                                                                  01870001
018800 01  PV-COUNT-MSG-2.                                              01880001
018900     05  FILLER                       PIC X(38) VALUE             01890001
019000         'RECORDS READ FROM INP01            = '.                 01900001
019100     05  FILLER                       PIC X(27) VALUE SPACES.     01910001
019200     05  PV-MSG-READ-COUNT            PIC ZZZ,ZZZ,ZZZ,ZZ9.        01920001
019300                                                                  01930001
019400*    SE INVENTORY DETAILS                                         01940001
019500     COPY PCRD051.                                                01950001
019600                                                                  01960001
019700*    PO/RCVR/UPC/LOC SUMMARY                                      01970001
019800     COPY PCRD050.                                                01980001
020100/                                                                 02010001
020200                                                                  02020001
020300 PROCEDURE DIVISION.                                              02030001
020400                                                                  02040001
020500     PERFORM 1000-INITIALIZATION.                                 02050001
020600                                                                  02060001
020700     PERFORM 2000-PROCESS UNTIL PS-EOF-DETAIL-YES                 02070001
020800                                                                  02080001
020900     PERFORM 9000-QUIT.                                           02090001
021000                                                                  02100001
021100     GOBACK.                                                      02110001
021200/                                                                 02120001
021300 1000-INITIALIZATION.                                             02130001
021400     MOVE '1000-INITIALIZATION         '  TO PV-ABEND-PARAGRAPH.  02140001
021500*    DISPLAY PV-ABEND-PARAGRAPH                                   02150001
021600                                                                  02160001
021700     DISPLAY SPACES.                                              02170001
021800     DISPLAY ' STARTING PCKUT057'                                 02180001
021900                                                                  02190001
022000     MOVE WHEN-COMPILED               TO PV-WHEN-COMPILED         02200001
022100                                         PGM-COMPILED             02210001
022200     DISPLAY SPACES                                               02220001
022300     DISPLAY 'COMPILE DATE: ' PV-COMPILE-DATE                     02230001
022400             ' ' PV-COMPILE-TIME                                  02240001
022500                                                                  02250001
022600     OPEN INPUT ALL-INV-SE-FILE                                   02260001
022700          OUTPUT SUMMARY-FILE                                     02270001
022800                 LONESOME-FILE                                    02280001
022900                                                                  02290001
023000     PERFORM 8000-READ-DETAIL-EXTRACT                             02300001
023100     MOVE PV-CURR-KEY                 TO PV-PREV-KEY              02310001
023200                                                                  02320001
023300     IF PS-EOF-DETAIL-YES                                         02330001
023400         DISPLAY SPACES                                           02340001
023500         DISPLAY ALL '*'                                          02350001
023600         DISPLAY '  DETAIL INPUT FILE IS EMPTY '                  02360001
023700         DISPLAY ALL '*'                                          02370001
023800         DISPLAY SPACES                                           02380001
023900     ELSE                                                         02390001
024000         MOVE PV-CURR-KEY             TO PV-PREV-KEY              02400001
024100     END-IF.                                                      02410001
024200                                                                  02420001
024300     MOVE '9999-09-09'                TO PV-START-RCVR-DATE       02430001
024400     MOVE '0001-01-01'                TO PV-END-RCVR-DATE         02440001
024500                                                                  02450001
024600     INITIALIZE PV-GROUP-MEMBER-COUNT.                            02460001
024700/                                                                 02470001
024800 2000-PROCESS.                                                    02480001
024900                                                                  02490001
025000     MOVE '2000-PROCESS'                  TO PV-ABEND-PARAGRAPH.  02500001
025100*    DISPLAY PV-ABEND-PARAGRAPH                                   02510001
025200                                                                  02520001
025300     IF PV-CURR-KEY = PV-PREV-KEY                                 02530001
025400         PERFORM 2005-SAVE-RCVR-DATES                             02540001
025500         PERFORM 2006-ADD-TO-RCVR-TOTS                            02550001
025600     ELSE                                                         02560001
025700         PERFORM 2200-PO-RCVR-BREAK                               02570001
025800         PERFORM 2005-SAVE-RCVR-DATES                             02580001
025900         PERFORM 2006-ADD-TO-RCVR-TOTS                            02590001
026000     END-IF.                                                      02600001
026100                                                                  02610001
026200     PERFORM 8000-READ-DETAIL-EXTRACT.                            02620001
026300                                                                  02630001
026400 2005-SAVE-RCVR-DATES.                                            02640001
026500                                                                  02650001
026600     MOVE '2005-SAVE-RCVR-DATES'      TO PV-ABEND-PARAGRAPH       02660001
026700*    DISPLAY PV-ABEND-PARAGRAPH                                   02670001
026800                                                                  02680001
026900*    SAVE THE LATEST DATE OF THE GROUP                            02690001
027000     IF PC051-TRN-DTE  < PV-START-RCVR-DATE                       02700001
027100         MOVE PC051-TRN-DTE               TO PV-START-RCVR-DATE   02710001
027200     END-IF                                                       02720001
027300                                                                  02730001
027400*    SAVE THE EARLIEST DATE OF THE GROUP                          02740001
027500     IF PC051-TRN-DTE > PV-END-RCVR-DATE                          02750001
027600         MOVE PC051-TRN-DTE               TO PV-END-RCVR-DATE     02760001
027700     END-IF.                                                      02770001
027800                                                                  02780001
027900 2006-ADD-TO-RCVR-TOTS.                                           02790001
028000                                                                  02800001
028100     MOVE '2006-ADD-TO-RCVR-TOTS'     TO PV-ABEND-PARAGRAPH       02810001
028200*    DISPLAY PV-ABEND-PARAGRAPH                                   02820001
028300                                                                  02830001
028400*    WE WANT TO SEE IF THIS GROUP CONSISTS OF JUST 1 CLEAN REC    02840001
028500     IF PC051-TRN-TYP-CDE = 'CL'                                  02850001
028600         SET PS-CLEAN-FOUND-YES       TO TRUE                     02860001
028700     END-IF.                                                      02870001
028800                                                                  02880001
028801***************************************************************** 02880101
028802* STORE EXPECTED MEMO CODES                                    ** 02880201
028803*     UM - STORE UNLOAD MEMO                                   ** 02880301
028804*     NS - NOT SCANNED ON EXPTED TRLR                          ** 02880401
028805*     MM - STORE MISLOAD MEMO                                  ** 02880501
028806*     AM - ASSUMPTIVE UNLOAD MEMO                              ** 02880601
028807*     SM - STORE MISLOAD UNLOAD MEMO                           ** 02880701
028808***************************************************************** 02880801
028810     IF  PC051-TRN-TYP-CDE = 'UM' OR                              02881001
028811         PC051-TRN-TYP-CDE = 'NS' OR                              02881101
028812         PC051-TRN-TYP-CDE = 'MM' OR                              02881201
028813         PC051-TRN-TYP-CDE = 'AM' OR                              02881301
028814         PC051-TRN-TYP-CDE = 'SM'                                 02881401
028820         NEXT SENTENCE                                            02882001
028830     ELSE                                                         02883001
028840         ADD PC051-TRN-QTY            TO PV-GROUP-TOTAL           02884001
028850     END-IF.                                                      02885001
028860                                                                  02886001
028870     ADD 1                            TO PV-RCVR-REC-COUNT        02887001
028880                                         PV-GROUP-MEMBER-COUNT.   02888001
028890                                                                  02889001
028900 2200-PO-RCVR-BREAK.                                              02890001
029000                                                                  02900001
029100     MOVE '2200-PO-RCVR-BREAK'        TO PV-ABEND-PARAGRAPH       02910001
029200*    DISPLAY PV-ABEND-PARAGRAPH                                   02920001
029300                                                                  02930001
029400     INITIALIZE PC050-SE-SUMMARY-REC                              02940001
029500     MOVE PV-PREV-PO                  TO PC050-PO-NBR             02950001
029600     MOVE PV-PREV-RCVR                TO PC050-RCVR-SEQ-NBR       02960001
029700     MOVE PV-PREV-UPC                 TO PC050-INTR-UPC-ID        02970001
029800     MOVE PV-PREV-LOC                 TO PC050-LOC-NBR            02980001
029900     MOVE PV-GROUP-TOTAL              TO PC050-GROUP-BAL-QTY      02990001
030000     MOVE PV-END-RCVR-DATE            TO PC050-LATEST-TRN-DTE     03000001
030100     MOVE PV-SAVE-INV-DTE             TO PC050-LOC-INV-DTE        03010001
030200     MOVE PS-EOF-CLEAN-SW             TO PC050-ALL-CLEAN-GRP-SW   03020001
030300     MOVE PV-GROUP-MEMBER-COUNT       TO PC050-GRP-MEMBER-COUNT   03030001
030400     MOVE ZERO                        TO PC050-SKU-NBR            03040001
030500                                                                  03050001
030600     EVALUATE TRUE                                                03060001
030700         WHEN PV-GROUP-MEMBER-COUNT = 1 AND PS-CLEAN-FOUND-YES    03070001
030800*            (THIS GROUP CONSISTS OF 1 CLEAN REC ONLY)            03080001
030900             PERFORM 8200-WRITE-LONESOME-CLEAN                    03090001
031000             DISPLAY 'LONESOME CLEAN - PO='                       03100001
031100                  PV-PREV-PO ' RCVR='                             03110001
031200                  PV-PREV-RCVR ' UPC='                            03120001
031300                  PV-PREV-UPC ' LOC='                             03130001
031400                  PV-PREV-LOC                                     03140001
031500             ADD 1                    TO PV-WRITE-3-COUNTER       03150001
031600                                                                  03160001
031700         WHEN PC050-LOC-INV-DTE < PC050-LATEST-TRN-DTE            03170001
031800             CONTINUE                                             03180001
031900         WHEN PC050-GROUP-BAL-QTY NOT = ZERO                      03190001
032000             CONTINUE                                             03200001
032100                                                                  03210001
032200          WHEN OTHER                                              03220001
032300             PERFORM 8100-WRITE-PC050                             03230001
032400                                                                  03240001
032500     END-EVALUATE.                                                03250001
032600                                                                  03260001
032700     MOVE PV-CURR-KEY                 TO PV-PREV-KEY              03270001
032800     MOVE '9999-09-09'                TO PV-START-RCVR-DATE       03280001
032900     MOVE '0001-01-01'                TO PV-END-RCVR-DATE         03290001
033000     INITIALIZE PV-GROUP-MEMBER-COUNT                             03300001
033100     SET PS-CLEAN-FOUND-NO            TO TRUE                     03310001
033200                                                                  03320001
033300     MOVE ZERO                        TO PV-GROUP-TOTAL.          03330001
033400/                                                                 03340001
039900 8000-READ-DETAIL-EXTRACT.                                        03990001
040000                                                                  04000001
040100     MOVE '8000-READ-DETAIL-EXTRACT   '  TO PV-ABEND-PARAGRAPH.   04010001
040200*    DISPLAY PV-ABEND-PARAGRAPH                                   04020001
040300*                                                                 04030001
040400     MOVE PC051-INV-DTE               TO PV-SAVE-INV-DTE          04040001
040500                                                                  04050001
040600     READ ALL-INV-SE-FILE                                         04060001
040700         INTO                                                     04070001
040800             PC051-INV-DETAIL-REC                                 04080001
040900         AT END                                                   04090001
041000             SET PS-EOF-DETAIL-YES    TO TRUE                     04100001
041100*            DISPLAY 'EOF = ' PS-EOF-DETAIL-SW                    04110001
041200         NOT AT END                                               04120001
041300             ADD 1                    TO PV-READ-COUNTER-DTL      04130001
041400             MOVE PC051-PO-NBR        TO PV-COMP-10               04140001
041500             MOVE PV-COMP-10          TO PV-CURR-PO               04150001
041600                                                                  04160001
041700             MOVE PC051-RCVR-SEQ-NBR  TO PV-COMP-10               04170001
041800             MOVE PV-COMP-10          TO PV-CURR-RCVR             04180001
041900                                                                  04190001
042000                                                                  04200001
042100             MOVE PC051-INTR-UPC-ID   TO PV-CURR-UPC              04210001
042200                                                                  04220001
042300             MOVE PC051-LOC-NBR       TO PV-COMP-10               04230001
042400             MOVE PV-COMP-10          TO PV-CURR-LOC              04240001
042500*            DISPLAY PV-CURR-PO ' / '                             04250001
042600*                    PV-CURR-RCVR ' / '                           04260001
042700*                    PV-CURR-UPC ' / '                            04270001
042800*                    PV-CURR-LOC '   '                            04280001
042900*                    'EOF = ' PS-EOF-DETAIL-SW                    04290001
043000     END-READ.                                                    04300001
043100                                                                  04310001
043200 8100-WRITE-PC050.                                                04320001
043300     MOVE '8100-WRITE-PC050          ' TO PV-ABEND-PARAGRAPH.     04330001
043400*    DISPLAY PV-ABEND-PARAGRAPH                                   04340001
043500                                                                  04350001
043600     WRITE                                                        04360001
043700         SUMMARY-REC FROM PC050-SE-SUMMARY-REC                    04370001
043800     END-WRITE.                                                   04380001
043900     ADD 1                            TO PV-WRITE-1-COUNTER.      04390001
044000                                                                  04400001
044100 8200-WRITE-LONESOME-CLEAN.                                       04410001
044200     MOVE '8200-WRITE-LONESOME-CLEAN ' TO PV-ABEND-PARAGRAPH.     04420001
044300*    DISPLAY PV-ABEND-PARAGRAPH                                   04430001
044400                                                                  04440001
044500     WRITE                                                        04450001
044600         LONESOME-REC FROM PC050-SE-SUMMARY-REC                   04460001
044700     END-WRITE.                                                   04470001
044800     ADD 1                            TO PV-WRITE-4-COUNTER.      04480001
044900/                                                                 04490001
045000 9000-QUIT.                                                       04500001
045100                                                                  04510001
045200     MOVE '9000-QUIT'                  TO PV-ABEND-PARAGRAPH.     04520001
045300*    DISPLAY PV-ABEND-PARAGRAPH                                   04530001
045400                                                                  04540001
045500     PERFORM 2200-PO-RCVR-BREAK.                                  04550001
045600                                                                  04560001
045700     CLOSE ALL-INV-SE-FILE                                        04570001
045800           SUMMARY-FILE                                           04580001
045900           LONESOME-FILE                                          04590001
046000                                                                  04600001
046100     DISPLAY SPACES.                                              04610001
046200                                                                  04620001
046300*        'RECORDS READ FROM INP01            = '.                 04630001
046400     MOVE PV-READ-COUNTER-DTL         TO PV-MSG-READ-COUNT        04640001
046500     DISPLAY PV-COUNT-MSG-2.                                      04650001
046600                                                                  04660001
046700     DISPLAY SPACES                                               04670001
046800                                                                  04680001
046900*        CLEAN GROUPS =                                           04690001
047000     MOVE PV-WRITE-3-COUNTER          TO PV-MSG-3-COUNT           04700001
047100     DISPLAY PV-COUNT-MSG-3.                                      04710001
047200                                                                  04720001
047300*        PURGE RECORDS WRITTEN TO OUT01                           04730001
047400     MOVE PV-WRITE-1-COUNTER          TO PV-MSG-1-COUNT           04740001
047500     DISPLAY PV-COUNT-MSG-1.                                      04750001
047600                                                                  04760001
047700*        'LONESOME CLEANS WRITTEN TO OUT02   = '.                 04770001
047800     MOVE PV-WRITE-4-COUNTER          TO PV-MSG-4-COUNT           04780001
047900     DISPLAY PV-COUNT-MSG-4.                                      04790001
048000/                                                                 04800001
