       01  PC067-STORE-DATA-PURGE-EXTRACT.                                      
           05  PC067-STORE-START-NUM        PIC 9(04).                          
           05  PC067-STORE-END-NUM          PIC 9(04).                          
           05  PC067-PURGE-DATE             PIC X(10).                          
           05  PC067-OFFSET-DATE            PIC 9(04).                          
           05  PC067-PROCESSED-REC-SW       PIC X(01).                          
           05  FILLER                       PIC X(57).                          
