000100******************************************************************        
000200*    COPY MEMBER:  PCRD010                       LRECL = 100     *        
000300*                                                                *        
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR UPDATING THE     *        
000500*    PCT_IN_TRNST_QTY AND PCT_IN_TRNST_TRN TABLES                *        
000600*                                                                *        
000700*    7/16 - DP ADDED 88 LEVEL FOR TYPE CODE 'AR' AND 'VA'.       *        
000800*    6/21/04 DRS -                                               *        
000900*            ADD PC010-SHIP-UNLOAD-IND TO CARRY ORIGINAL FLAGS   *        
001000*            FROM SURD012.                                       *        
001100*                                                                *        
001200******************************************************************        
001300 01  PC010-PCT-INTRANSIT-REC.                                             
001400     05  PC010-INTR-UPC-ID          PIC  S9(9) COMP  VALUE ZEROS.         
001500*                                                                         
001600*  HAD TO DEFINE INTR-UPC-ID AS 10 DIGITS AND REDEFINES AS SHOWN          
001700*  BECAUSE S9(9) CAN ACTUALLY HOLD 10 DIGITS UP TO A CERTAIN              
001800*  POINT.  MOVING THE FIELD FROM DB2 DCLGEN TO A S9(9) WILL               
001900*  TRUNCATE THE LEFT MOST DIGIT, SO DEFINING AS BELOW WILL                
002000*  PREVENT TRUNCATION.                                                    
002100*    05  PC010-INTR-UPC-ID           PIC S9(10) COMP VALUE ZEROES.        
002200*    05  FILLER REDEFINES IN137-INTR-UPC-ID.                              
002300*        10  FILLER                  PIC X(04).                           
002400*        10  PC010-INTR-UPC-ID-4     PIC X(04).                           
002500*        10  PC010-INTR-UPC-ID-SPC REDEFINES PC010-INTR-UPC-ID-4          
002600*                                    PIC S9(9)  COMP.                     
002700*                                                                         
002800     05  PC010-STR-NBR              PIC  S9(4) COMP  VALUE ZEROS.         
002900     05  PC010-TRN-TYP-CDE          PIC  X(02)       VALUE SPACES.        
003000         88 PC010-STORE-VRFY-RECEIPT   VALUE 'AR'.                        
003100         88 PC010-CNTL-STOCK-RECEIPT   VALUE 'CS'.                        
003200         88 PC010-STORE-VRFY-ADJ       VALUE 'VA'.                        
003300         88 PC010-SHIPPD-DC            VALUE 'SH'.                        
003400         88 PC010-UNLOAD-ST            VALUE 'UN'.                        
               88 PC010-UNLOAD-MEMO          VALUE 'UM'.                        
               88 PC010-ASSUMPTIVE-UNLOAD    VALUE 'AU'.                        
               88 PC010-NOT-SCANNED-BY-STORE VALUE 'NS'.                        
               88 PC010-MISLOAD-MEMO         VALUE 'MM'.                        
               88 PC010-MISLOAD-UNLOAD       VALUE 'MU'.                        
               88 PC010-ASSUMPT-UNLOAD-MEMO  VALUE 'AM'.                        
               88 PC010-MISLOAD-UNLOAD-MEMO  VALUE 'SM'.                        
003500     05  PC010-IN-TRNST-QTY         PIC  S9(9) COMP  VALUE ZEROS.         
003600     05  PC010-UPD-USR-ID           PIC  X(08)       VALUE SPACES.        
003700     05  PC010-PO-NBR               PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  PC010-RCVR-SEQ-NBR         PIC  S9(9) COMP  VALUE ZEROS.         
003900     05  PC010-TRIP-ID              PIC  S9(9) COMP  VALUE ZEROS.         
004000     05  PC010-STAT-CDE-DS          PIC  9(01).                           
004100         88  PC010-SHIPPED-FROM-DC           VALUE 1.                     
004200         88  PC010-NOT-SHIPPED-FROM-DC       VALUE 0.                     
004300     05  PC010-STAT-CDE-SU            PIC  9(01).                         
004400         88  PC010-UNLOADED-AT-STORE         VALUE 1.                     
004500         88  PC010-NOT-UNLOADED-AT-STORE     VALUE 0.                     
004600     05  PC010-TRN-CLSN-CDE         PIC  X(02).                           
004700         88  PC010-TRN-IN-TRANSIT            VALUE 'IT'.                  
004800         88  PC010-TRN-STR-EXPECTED          VALUE 'SE'.                  
004900     05  PC010-UPC-NBR              PIC S9(15)V.                          
005000     05  PC010-EVENT-TMST           PIC  X(26).                           
005100     05  FILLER REDEFINES     PC010-EVENT-TMST.                           
005200         10 PC010-TMST-CC           PIC  9(02).                           
005300         10 PC010-TMST-YY           PIC  9(02).                           
005400         10 FILLER                  PIC  X(01).                           
005500         10 PC010-TMST-MM           PIC  9(02).                           
005600         10 FILLER                  PIC  X(01).                           
005700         10 PC010-TMST-DD           PIC  9(02).                           
005800         10 FILLER                  PIC  X(01).                           
005900         10 PC010-TMST-HH           PIC  9(02).                           
006000         10 FILLER                  PIC  X(01).                           
006100         10 PC010-TMST-MN           PIC  9(02).                           
006200         10 FILLER                  PIC  X(01).                           
006300         10 PC010-TMST-SS           PIC  9(02).                           
006400         10 FILLER                  PIC  X(07).                           
003800     05  PC010-TRN-LNE-NBR          PIC  S9(9) COMP  VALUE ZEROS.         
003800     05  PC010-OTB-TYP-CDE          PIC  X(2)        VALUE SPACES.        
003800     05  PC010-BOSS-INDICATOR       PIC  X(1)        VALUE SPACES.        
006500     05  FILLER                     PIC  X(16)       VALUE SPACES.        
