000100******************************************************************        
000200*    INPUT TO INTRANSIT ERROR QUEUE REPORT      LRECL=200                 
000300******************************************************************        
000400                                                                          
000500 01  PC013-IT-ERROR-RECORD.                                               
000600     05  PC013-RECORD-TYPE                  PIC X(03).                    
000700     05  PC013-FR-DEPT-NBR                  PIC 9(04).                    
000800     05  PC013-FR-MAJ-CL-NBR                PIC 9(04).                    
000900     05  PC013-FR-SUB-CL-NBR                PIC 9(04).                    
001000     05  PC013-FR-SKU-NBR                   PIC 9(08).                    
001100     05  PC013-STR-NBR                      PIC 9(04).                    
001200     05  PC013-MDSE-ADJ-ID                  PIC 9(10).                    
001300     05  PC013-ADJ-TYP-CDE                  PIC X(02).                    
001400     05  PC013-ADJ-ACTN-CDE                 PIC X(01).                    
001500     05  PC013-OH-UNT-ADJ-QTY               PIC 9(10).                    
001600     05  PC013-IN-TRNST-UNT-ADJ-QTY         PIC 9(10).                    
001700     05  PC013-FR-INTR-UPC-ID               PIC 9(10).                    
001800     05  PC013-TO-INTR-UPC-ID               PIC 9(10).                    
001900     05  PC013-TO-SKU-NBR                   PIC 9(08).                    
002000     05  PC013-ERROR-DESCRIPTION            PIC X(40).                    
002000     05  PC013-PO-NBR                       PIC X(10).                    
002000     05  PC013-RCVR-SEQ-NBR                 PIC X(10).                    
002100     05  FILLER                             PIC X(052).                   
