000100*  PCRD037 - EXTRACT LAYOUT FOR ALL TYPE 'SE' DETAIL RECS    *            
000200*      CREATED BY BMC UNLOAD IN PROC PCK1201                              
000300*  LRECL = 48                                                *            
000400*                                                            *            
000500 01  PC037-BMC-UNLOAD-SE-REC.                                             
000600     05  PC037-PO-NBR                 PIC S9(09) COMP.                    
000700     05  PC037-PO-NULL                PIC X(01).                          
000800     05  PC037-RCVR-SEQ-NBR           PIC S9(09) COMP.                    
000900     05  PC037-RCVR-NULL              PIC X(01).                          
001000     05  PC037-INTR-UPC-ID            PIC S9(09) COMP.                    
001100     05  PC037-LOC-NBR                PIC S9(04) COMP.                    
001200     05  PC037-IN-TRNST-TRN-TMST      PIC X(26).                          
001300     05  PC037-TRN-TYP-CDE            PIC X(02).                          
001400     05  PC037-TRN-CLSN-PRCG-QTY      PIC S9(09) COMP.                    
