000100**************************************************************    00010000
000200*   COPYBOOK NAME:    PCRD085                                *    00020000
000300*   COPYBOOK LENGTH:  215                                    *    00030012
000400*   THIS IS THE RECORD LAYOUT FOR A HEADINGS FILE THAT IS    *    00040012
000500*   USED IN COMBINATION WITH DETAIL LAYOUT(PCRD084) TO CREATE*    00050012
000600*   A COMMA DELIMITED FILE FOR RPA PROCESS                   *    00060012
000700**************************************************************    00070000
000800 01  PC085-HEADINGS-LAYOUT.                                       00080007
000900     05  PC085-CURR-OPER-UNT-ID              PIC  X(09)           00090002
000901                                         VALUE 'CURR OPER'.       00090108
000902     05  PC085-COMMA-1                       PIC  X(01) VALUE ','.00090200
000904     05  PC085-CRE-OPER-UNT-ID               PIC  X(08)           00090400
000905                                         VALUE 'CRE OPER'.        00090506
000906     05  PC085-COMMA-2                       PIC  X(01) VALUE ','.00090600
000907     05  PC085-PO-TYP-CDE                    PIC  X(06)           00090706
000908                                         VALUE 'PO TYP'.          00090806
000909     05  PC085-COMMA-3                       PIC  X(01) VALUE ','.00090900
000910     05  PC085-TRLR-LOC                      PIC  X(03)           00091000
000911                                         VALUE 'LOC'.             00091100
000912     05  PC085-COMMA-4                       PIC  X(01) VALUE ','.00091200
000913     05  PC085-ARRIVAL-DATE                  PIC  X(07)           00091306
000914                                         VALUE 'ARR_DTE'.         00091406
000915     05  PC085-COMMA-5                       PIC  X(01) VALUE ','.00091500
000916     05  PC085-SCAC                          PIC  X(04)           00091600
000917                                         VALUE 'SCAC'.            00091700
000920     05  PC085-COMMA-6                       PIC  X(01) VALUE ','.00092000
000930     05  PC085-TRLR-NBR                      PIC  X(04)           00093006
000931                                         VALUE 'TRLR'.            00093106
000940     05  PC085-COMMA-7                       PIC  X(01) VALUE ','.00094000
000950     05  PC085-VEND-NME                      PIC  X(04)           00095006
000951                                         VALUE 'VEND'.            00095106
000960     05  PC085-COMMA-8                       PIC  X(01) VALUE ','.00096000
000970     05  PC085-SEASET-SHRT-NM                PIC  X(07)           00097006
000971                                         VALUE 'SET CDE'.         00097106
000980     05  PC085-COMMA-9                       PIC  X(01) VALUE ','.00098000
000990     05  PC085-SEASET-YR                     PIC   X(08)          00099006
000991                                         VALUE 'SET YEAR'.        00099106
001000     05  PC085-COMMA-10                      PIC  X(01) VALUE ','.00100000
001100     05  PC085-PO-NBR                        PIC  X(02)           00110000
001110                                         VALUE 'PO'.              00111000
001200     05  PC085-COMMA-11                      PIC  X(01) VALUE ','.00120000
001300     05  PC085-REC-SEQ-NBR                   PIC  X(04)           00130003
001310                                         VALUE 'RECV'.            00131000
001400     05  PC085-COMMA-12                      PIC  X(01) VALUE ','.00140000
001500     05  PC085-PO-LNE-NBR                    PIC  X(03)           00150000
001510                                         VALUE 'LNE'.             00151000
001600     05  PC085-COMMA-13                      PIC  X(01) VALUE ','.00160000
001700     05  PC085-PACK-ID                       PIC  X(03)           00170000
001710                                         VALUE 'PCK'.             00171000
001800     05  PC085-COMMA-14                      PIC  X(01) VALUE ','.00180000
001900     05  PC085-SKU-NUMBER                    PIC  X(03)           00190004
001910                                         VALUE 'SKU'.             00191000
002000     05  PC085-COMMA-15                      PIC  X(01) VALUE ','.00200000
002100     05  PC085-OTPK-QTY                      PIC  X(03)           00210000
002101                                         VALUE 'PAK'.             00210100
002110     05  PC085-COMMA-16                      PIC  X(01) VALUE ','.00211000
002120     05  PC085-P2L-CTN-CNT                   PIC  X(07)           00212006
002121                                         VALUE 'P2L LBL'.         00212106
002130     05  PC085-COMMA-17                      PIC  X(01) VALUE ','.00213000
002140     05  PC085-XDCK-CTN-CNT                  PIC  X(08)           00214006
002141                                         VALUE 'SHIP LBL'.        00214106
002150     05  PC085-COMMA-18                      PIC  X(01) VALUE ','.00215000
002160     05  PC085-CASEPK-IND                    PIC  X(09)           00216006
002161                                         VALUE 'CSPK DWNL'.       00216106
002170     05  PC085-COMMA-19                      PIC  X(01) VALUE ','.00217000
002180     05  PC085-UCC128-IND                    PIC  X(06)           00218006
002181                                         VALUE 'UCC128'.          00218106
002190     05  PC085-COMMA-20                      PIC  X(01) VALUE ','.00219000
002200     05  PC085-PKG-TYPE                      PIC  X(07)           00220001
002210                                         VALUE 'PK TYPE'.         00221000
002300     05  PC085-COMMA-21                      PIC  X(01) VALUE ','.00230000
002400     05  PC085-STORE-ZONE                    PIC  X(08)           00240000
002410                                         VALUE 'P2L ZONE'.        00241000
002500     05  PC085-COMMA-22                      PIC  X(01) VALUE ','.00250000
002600     05  PC085-TRBLE-CTN-LINE                PIC  X(08)           00260006
002610                                         VALUE 'TRBL CTN'.        00261006
002700     05  PC085-COMMA-23                      PIC  X(01) VALUE ','.00270000
002800     05  PC085-CRTNS-TO-SCAN                 PIC  X(07)           00280006
002810                                         VALUE 'NOT SCN'.         00281006
002900     05  PC085-COMMA-24                      PIC  X(01) VALUE ','.00290000
003000     05  PC085-PERCENT-COMPLETE              PIC  X(07)           00300000
003010                                         VALUE '% SCNND'.         00301000
003100     05  PC085-COMMA-25                      PIC  X(01) VALUE ','.00310000
003200     05  PC085-CNTL-FLOW-CTN-CNT             PIC  X(09)           00320006
003210                                         VALUE 'FLOW CTNS'.       00321006
003300     05  PC085-COMMA-26                      PIC  X(01) VALUE ','.00330000
003400     05  PC085-CNTL-FLOW-UNT-CNT             PIC  X(09)           00340006
003410                                         VALUE 'FLOW UNTS'.       00341006
003411     05  PC085-COMMA-27                      PIC  X(01) VALUE ','.00341109
003412     05  PC085-HANG-FOLD-DESC                PIC  X(07)           00341209
003413                                         VALUE 'HNG/FLD'.         00341309
003414     05  PC085-COMMA-28                      PIC  X(01) VALUE ','.00341410
003415     05  PC085-MIXED-HNGFLD                 PIC  X(05)            00341511
003416                                         VALUE 'MIXED'.           00341610
003420     05  FILLER                           PIC  X(12) VALUE SPACES.00342011
