000100*    INTRANSIT BALANCE ROWS             LRECL=22                          
000200 01  PC900-EXTRACT-RECORD.                                                
000300     05  PC900-INTR-UPC-ID            PIC  S9(9) COMP.                    
000400     05  PC900-LOC-NBR                PIC  S9(4) COMP.                    
000500     05  PC900-TRN-CLSN-CDE           PIC   X(2).                         
000600     05  PC900-TRN-CLSN-QTY           PIC  S9(9) COMP.                    
000700     05  PC900-LAST-UPD-DTE           PIC   X(10).                        
