000100**************************************************************    00010000
000200*   COPYBOOK NAME:    PCRD068                                *    00020000
000300*   COPYBOOK LENGTH:  400                                    *    00030000
000400*   THIS IS THE RECORD LAYOUT FOR AN EXTRACT FILE CONTAINING *    00040000
000500*   THE PO/RCVR/LINE INFORMATION FOR A TRAILER TO CREATE     *    00050000
000600*   PLANNING RECORDS BASE ON A TRAILER ARRIVAL.              *    00060000
000700**************************************************************    00070000
000800 01  PC068-RECORD-LAYOUT.                                         00080000
000900     05  PC068-OPER-UNT-ID                   PIC S9(04) COMP.     00090000
001000     05  PC068-RECORD-TYPE                   PIC  X(03).          00100000
001100         88  PC068-DETAIL-RECORD                 VALUE 'DTL'.     00110000
001200         88  PC068-TRAILER-RECORD                VALUE 'TLR'.     00120000
001300     05  PC068-TRIP-ID                       PIC S9(09) COMP.     00130000
001400     05  PC068-SCAC                          PIC  X(04).          00140000
001500     05  PC068-TRLR-NBR                      PIC  X(10).          00150000
001600     05  PC068-TRLR-LOC                      PIC  X(05).          00160000
001700*SUT_INBD_TRIP_DOOR                                               00170000
001800     05  PC068-PO-NBR                        PIC S9(09) COMP.     00180000
001900     05  PC068-REC-SEQ-NBR                   PIC S9(09) COMP.     00190000
002000     05  PC068-PO-LNE-NBR                    PIC S9(09) COMP.     00200000
002100     05  PC068-PACK-ID                       PIC S9(09) COMP.     00210000
002200     05  PC068-DEPT-NBR                      PIC  X(03).          00220000
002300     05  PC068-MAJ-CL-NBR                    PIC  X(03).          00230000
002400     05  PC068-ARRIVAL-DATE                  PIC  X(10).          00240000
002500     05  PC068-ARRIVAL-TIME                  PIC  X(08).          00250000
002600     05  PC068-PBS-IND                       PIC  X(01).          00260000
002700         88  PC068-PBS-ORDER                     VALUE 'Y'.       00270000
002800     05  PC068-PKG-TYPE                      PIC  X(01).          00280000
002900         88  PC068-BULK-TYPE                     VALUE 'B'.       00290000
003000         88  PC068-CASE                          VALUE 'C'.       00300000
003100         88  PC068-INNER-PREPK                   VALUE 'I'.       00310000
003200         88  PC068-MULTI-PREPK                   VALUE 'M'.       00320000
003300     05  PC068-P2L-IND                       PIC  X(01)           00330000
003400                                                VALUE SPACES.     00340000
003500         88  PC068-P2L-CRTNS                     VALUE 'Y'.       00350000
003600     05  PC068-JEWELRY-IND                   PIC  X(01)           00360000
003700                                                VALUE SPACES.     00370000
003800         88  PC068-JEWELRY-ORDER                 VALUE 'Y'.       00380000
003900     05  PC068-STORE-ZONE                    PIC  X(05).          00390000
004000     05  PC068-HANG-FOLD-IND                 PIC  X(01)           00400000
004100                                                VALUE SPACES.     00410000
004200         88  PC068-HANG                      VALUE 'Y'.           00420000
004300     05  PC068-FLOWBACK-IND                  PIC  X(01)           00430000
004400                                                VALUE SPACES.     00440000
004500         88  PC068-FB-ORDER                  VALUE 'Y'.           00450000
004600     05  PC068-TRANSCRIBED-IND               PIC  X(01)           00460000
004700                                                VALUE 'Y'.        00470000
004800         88  PC068-TRANSCRIBED               VALUE 'Y'.           00480000
004900         88  PC068-NOT-TRANSCRIBED           VALUE 'N'.           00490000
005000     05  PC068-UCC128-IND                    PIC  X(01)           00500000
005100                                                VALUE SPACES.     00510000
005200         88  PC068-UCC128-IND-USED           VALUE 'Y'.           00520000
005300     05  PC068-CASEPK-IND                    PIC  X(01)           00530000
005400                                                VALUE SPACES.     00540000
005500         88  PC068-CASEPK-IND-USED           VALUE 'Y'.           00550000
005510     05  PC068-TOT-CTN-CNT                   PIC S9(09) COMP-3.   00551021
005700     05  PC068-P2L-CTN-CNT                   PIC S9(09) COMP-3.   00570000
005800     05  PC068-P2L-CTN-CNT-ZNE               PIC S9(09) COMP-3.   00580000
005900     05  PC068-P2L-UNIT-CNT                  PIC S9(09) COMP-3.   00590000
006000     05  PC068-XDCK-CTN-CNT                  PIC S9(09) COMP-3.   00600000
006100** TRLR LEVEL                                                     00610000
006200     05  PC068-PO-CNT-TRLR                   PIC S9(09) COMP-3.   00620000
006300     05  PC068-AUD-CRTNS-TRLR                PIC S9(09) COMP-3.   00630000
006400     05  PC068-AUD-CRTNS-TRLR-U              PIC S9(09) COMP-3.   00640000
006500     05  PC068-AUD-CRTNS-100-TRLR            PIC S9(09) COMP-3.   00650000
006600     05  PC068-TRBLE-CTN-CNT-TRLR            PIC S9(09) COMP-3.   00660000
006700     05  PC068-NONCON-CTN-CNT-TRLR           PIC S9(09) COMP-3.   00670000
006800     05  PC068-SET-DIVERT-CNT-TRLR           PIC S9(09) COMP-3.   00680000
006900     05  PC068-CRTNS-TO-SCAN-TRLR            PIC S9(09) COMP-3.   00690000
007000*** DETAIL LEVEL                                                  00700000
007100     05  PC068-PROMPTED-LINES                PIC S9(09) COMP-3.   00710000
007200     05  PC068-MIN-CRTN-CHECK                PIC S9(09) COMP-3.   00720000
007300     05  PC068-MAX-CRTN-CHECK                PIC S9(09) COMP-3.   00730000
007400     05  PC068-AUD-CRTNS-LINE                PIC S9(09) COMP-3.   00740000
007500     05  PC068-AUD-CRTNS-LINE-U              PIC S9(09) COMP-3.   00750000
007600     05  PC068-AUD-CRTNS-100-PO              PIC S9(09) COMP-3.   00760000
007700     05  PC068-SET-DIVERT-CNT-PO             PIC S9(09) COMP-3.   00770000
007800     05  PC068-CRTNS-TO-SCAN                 PIC S9(09) COMP-3.   00780000
007900     05  PC068-VENDOR-RANKING                PIC  X(06).          00790000
008000     05  PC068-ENT-ID                        PIC  S9(9) COMP.     00800000
008100     05  PC068-TRBLE-CTN-LINE                PIC S9(09) COMP-3.   00810000
008200     05  PC068-PCNT-TO-AUDIT                 PIC  9(03).          00820000
008300     05  PC068-AUD-COMPLETE                  PIC  X(01).          00830000
008400     05  PC068-PREV-AUD-FAIL                 PIC  X(01).          00840000
008500     05  PC068-UNITS-TO-AUDIT                PIC S9(09) COMP-3.   00850000
008600     05  PC068-SORT-BY-LOC-IND               PIC  X(01).          00860000
008700* SMA 10/2011 - WR40392 - ADDITIONAL DATA FOR SUMMARY RPTS        00870000
008800         88  PC068-UNP-DOOR                  VALUE '1'.           00880000
008900         88  PC068-UNP-YARD                  VALUE '2'.           00890000
009000         88  PC068-UNP-ENRT                  VALUE '3'.           00900000
009100         88  PC068-PRC-ENR-TO-DC             VALUE 'A'.           00910000
009200         88  PC068-PRC-IN-YARD               VALUE 'B'.           00920000
009300         88  PC068-PRC-IN-DOOR               VALUE 'C'.           00930000
009400         88  PC068-PRC-DOOR-OPEN             VALUE 'D'.           00940000
009500         88  PC068-PRC-DOOR-CLSD             VALUE 'E'.           00950000
009600         88  PC068-PRC-DC-SHIP               VALUE 'F'.           00960000
009700         88  PC068-PRC-STR-OPEN              VALUE 'G'.           00970000
009800         88  PC068-HNG-PCKSLP                VALUE 'X'.           00980000
009810*                                                                 00981015
009820*** DMH 6/2014 - WR-42429 - CONTROLLED FLOW                       00982015
009830* PER JOAN FLETCHER MNFST NBR IS NOT USED RECLAIMING THE SPACE    00983015
009840*                                                                 00984015
009850     05  PC068-HAZ-CTN-CNT                   PIC S9(09) COMP-3.   00985017
009860     05  PC068-HAZ-UNT-CNT                   PIC S9(09) COMP-3.   00986017
009861     05  PC068-HAZ-SW                        PIC  X(01) VALUE ' '.00986122
009863         88  PC068-HAZDS-YES                 VALUE 'Y'.           00986319
009864         88  PC068-HAZDS-NO                  VALUE ' '.           00986422
009870     05  FILLER                              PIC  X(04).          00987019
009910***  05  PC068-VHTRIP-MNFST-NBR              PIC  X(15).          00991017
009920*                                                                 00992017
009930*                                                                 00993017
010000* RMK 6/2010 - REQUEST #3032B - ADD PROCESS FILE                  01000000
010100     05  PC068-REPLEN-CARTON-CNT             PIC S9(09) COMP-3.   01010000
010200* SMA 10/2011 - WR40392 - ADDITIONAL DATA FOR SUMMARY RPTS        01020000
010300     05  PC068-PROCESS-GROUP                 PIC  9(01).          01030000
010400         88  PC068-UNPROCESSED               VALUE  1.            01040000
010500         88  PC068-HANG-PKSLP                VALUE  2.            01050000
010600         88  PC068-PROCESSED                 VALUE  3.            01060000
010700     05  PC068-CURR-LOC                      PIC  S9(04) COMP.    01070000
010800     05  PC068-UNIT-CNT                      PIC  S9(09) COMP-3.  01080000
010900     05  PC068-UNIT-CNT-TRLR                 PIC  S9(09) COMP-3.  01090000
011000     05  PC068-EFC-PO-CNT-TRLR               PIC  S9(09) COMP-3.  01100000
011100     05  PC068-EFC-CTN-CNT-TRLR              PIC  S9(09) COMP-3.  01110000
011200     05  PC068-EFC-UNT-CNT-TRLR              PIC  S9(09) COMP-3.  01120000
011300     05  PC068-EFC-NBR                       PIC  9(03).          01130000
011400     05  PC068-NEW-SKU-CNT                   PIC  S9(09) COMP-3.  01140000
011410     05  PC068-NBR-CTNS-DNLD                 PIC  S9(09) COMP-3.  01141000
011411     05  PC068-SKU-NUMBER                    PIC  X(08).          01141100
011412     05  PC068-TOT-SKU-CNT                   PIC  S9(09) COMP-3.  01141200
011413     05  PC068-INPK-QTY                      PIC S9(04) COMP.     01141300
011414     05  PC068-OTPK-QTY                      PIC S9(04) COMP.     01141400
011415     05  PC068-RFID-CTN-CNT                  PIC  S9(09) COMP-3.  01141514
011416     05  PC068-RFID-UNT-CNT                  PIC  S9(09) COMP-3.  01141600
011417******************************************************************01141700
011418     05  PC068-RFID-AUD-CRTNS-LINE           PIC S9(09) COMP-3.   01141800
011419     05  PC068-RFID-AUD-CRTNS-LINE-U         PIC S9(09) COMP-3.   01141900
011420     05  PC068-RFID-AUD-CRTNS-100-PO         PIC S9(09) COMP-3.   01142000
011421     05  PC068-RFID-UNITS-TO-AUDIT           PIC S9(09) COMP-3.   01142100
011422     05  PC068-RFID-PROMPTED-LINES           PIC S9(09) COMP-3.   01142200
011423     05  PC068-RFID-VENDOR-RANKING           PIC  X(06).          01142300
011424     05  PC068-RFID-MIN-CRTN-CHECK           PIC S9(09) COMP-3.   01142400
011425     05  PC068-RFID-MAX-CRTN-CHECK           PIC S9(09) COMP-3.   01142500
011426     05  PC068-RFID-PCNT-TO-AUDIT            PIC  9(03).          01142600
011427     05  PC068-RFID-PREV-AUD-FAIL            PIC  X(01).          01142700
011428     05  PC068-RFID-AUD-COMPLETE             PIC  X(01).          01142800
011429     05  PC068-COMB-AUD-CRTNS-LINE           PIC S9(09) COMP-3.   01142900
011430     05  PC068-COMB-AUD-CRTNS-LINE-U         PIC S9(09) COMP-3.   01143000
011431     05  PC068-RFID-AUD-CRTNS-TRLR           PIC S9(09) COMP-3.   01143100
011432     05  PC068-RFID-AUD-CRTNS-TRLR-U         PIC S9(09) COMP-3.   01143200
011433     05  PC068-RFID-AUD-CRTNS-100-TRLR       PIC S9(09) COMP-3.   01143300
011434     05  PC068-COMB-AUD-CRTNS-TRLR           PIC S9(09) COMP-3.   01143400
011435     05  PC068-COMB-AUD-CRTNS-TRLR-U         PIC S9(09) COMP-3.   01143500
011436     05  PC068-AUD-TYP                       PIC  X(01).          01143600
011437     05  PC068-RFID-STATUS                   PIC  X(01).          01143700
011438         88  PC068-COMPLIANT                 VALUE  'C'.          01143800
011439         88  PC068-TAGGING                   VALUE  'T'.          01143900
011440         88  PC068-NOT-TAGGING               VALUE  'N'.          01144000
011441*                                                                 01144118
011442*** DMH 6/2014 - WR-42429 - CONTROLLED FLOW                       01144218
011443     05  PC068-CNTL-FLOW-CTN-CNT             PIC S9(09) COMP-3.   01144318
011444     05  PC068-CNTL-FLOW-UNT-CNT             PIC S9(09) COMP-3.   01144418
011445     05  PC068-CNTL-FLOW-SW                  PIC  X(01) VALUE ' '.01144522
011446         88  PC068-CNTL-FLOW-YES             VALUE 'Y'.           01144620
011447         88  PC068-CNTL-FLOW-NO              VALUE ' '.           01144722
011448*                                                                 01144818
011450     05  FILLER                              PIC  X(05).          01145020
