000100 01  PC904-SPREADSHEET-REC.                                               
000200     05  PC904-PO-NBR                 PIC 9(10).                          
000300     05  PC904-COMMA1                 PIC X(01).                          
000400     05  PC904-RCVR-SEQ-NBR           PIC 9(10).                          
000500     05  PC904-COMMA2                 PIC X(01).                          
000600     05  PC904-INTR-UPC-ID            PIC 9(10).                          
000700     05  PC904-COMMA3                 PIC X(01).                          
000800     05  PC904-LOC-NBR                PIC 9(04).                          
000900     05  PC904-COMMA4                 PIC X(01).                          
001000     05  PC904-IN-TRNST-TRN-TMST      PIC X(26).                          
001100     05  PC904-COMMA5                 PIC X(01).                          
001200     05  PC904-TRN-TYP-CDE            PIC X(02).                          
001300     05  PC904-COMMA6                 PIC X(01).                          
001400     05  PC904-TRN-CLSN-PRCG-QTY      PIC 9(10).                          
001500     05  PC904-COMMA7                 PIC X(01).                          
001600     05  PC904-SKU-NBR                PIC 9(8).                           
001700     05  PC904-COMMA8                 PIC X(01).                          
001800     05  PC904-DEPT-NBR               PIC 9(4).                           
001900     05  PC904-COMMA9                 PIC X(01).                          
002000     05  PC904-MAJ-CL-NBR             PIC 9(4).                           
002100     05  PC904-COMMA10                PIC X(01).                          
002200                                                                          
