000100******************************************************************00010004
000200*    COPY MEMBER:  PCRD082                       LRECL = 189     *00020047
000300*                                                                *00030004
000400*    THIS MEMBER IS USED TO CREATE A COMMA DELIMITED FILE        *00040033
000500*    WHICH WILL BE SENT (VIA MFT) TO S:/SHARE.                   *00050050
000800*                                                                *00060033
001100******************************************************************00070004
001200 01  PC082-RECEIVER-EXT-RECORD.                                   00080033
002400     05  PC082-CURRENT-OPER              PIC  ZZZZ.               00090046
001310     05  PC082-COMMA-1                   PIC  X(01)  VALUE ','.   00100034
004820     05  PC082-TRLR-ARRIVAL-DTE          PIC  X(10).              00110033
001310     05  PC082-COMMA-2                   PIC  X(01)  VALUE ','.   00120034
004820     05  PC082-TRIP-ID                   PIC  ZZZZZZZZZ.          00130035
001310     05  PC082-COMMA-3                   PIC  X(01)  VALUE ','.   00140034
004820     05  PC082-SCAC                      PIC  X(04).              00150033
001310     05  PC082-COMMA-4                   PIC  X(01)  VALUE ','.   00160034
004820     05  PC082-TRAILER                   PIC  X(10).              00170033
001310     05  PC082-COMMA-5                   PIC  X(01)  VALUE ','.   00180034
001900     05  PC082-VNDR-NME                  PIC  X(25).              00190033
001310     05  PC082-COMMA-6                   PIC  X(01)  VALUE ','.   00200034
002000     05  PC082-DEPT-NBR                  PIC  X(03).              00210033
001310     05  PC082-COMMA-7                   PIC  X(01)  VALUE ','.   00220034
004810     05  PC082-OPEN-TO-BUY-PERIOD        PIC  X(05).              00230033
001310     05  PC082-COMMA-8                   PIC  X(01)  VALUE ','.   00240034
004820     05  PC082-OPEN-TO-BUY-WEEK-NBR      PIC  X(03).              00250041
001310     05  PC082-COMMA-9                   PIC  X(01)  VALUE ','.   00260034
001500     05  PC082-PO-NBR                    PIC  ZZZZZZZZ.           00270045
001310     05  PC082-COMMA-10                  PIC  X(01)  VALUE ','.   00280034
001600     05  PC082-REC-SEQ-NBR               PIC  ZZZZ.               00290035
001310     05  PC082-COMMA-11                  PIC  X(01)  VALUE ','.   00300034
001300     05  PC082-STATUS-CDE                PIC  X(02).              00310033
001310     05  PC082-COMMA-12                  PIC  X(01)  VALUE ','.   00320034
001800     05  PC082-EXPECT-CART-CNT           PIC  ZZZZZZZ9.           00330037
001310     05  PC082-COMMA-13                  PIC  X(01)  VALUE ','.   00340034
001800     05  PC082-ACTUAL-CART-CNT           PIC  ZZZZZZZ9.           00350048
001310     05  PC082-COMMA-14                  PIC  X(01)  VALUE ','.   00360034
001800     05  PC082-EXPECT-UNIT-CNT           PIC  ZZZZZZZ9.           00370037
001310     05  PC082-COMMA-15                  PIC  X(01)  VALUE ','.   00380034
004800     05  PC082-SEASET-NM                 PIC  X(05).              00390033
001310     05  PC082-COMMA-16                  PIC  X(01)  VALUE ','.   00400034
004200     05  PC082-PKGNG-CDE                 PIC  X(04).              00410038
001310     05  PC082-COMMA-17                  PIC  X(01)  VALUE ','.   00420034
001400     05  PC082-PROCESS-AREA              PIC  X(06).              00430033
001310     05  PC082-COMMA-18                  PIC  X(01)  VALUE ','.   00440034
070500     05  PC082-AUDIT-STATUS              PIC  X(04).              00450033
001310     05  PC082-COMMA-19                  PIC  X(01)  VALUE ','.   00460034
070500     05  PC082-FIRST-SCAN-DATE           PIC  X(10).              00470033
001310     05  PC082-COMMA-20                  PIC  X(01)  VALUE ','.   00480034
004200     05  PC082-XDOCK-OR-P2L              PIC  X(05).              00490042
001310     05  PC082-COMMA-21                  PIC  X(01)  VALUE ','.   00500034
004820     05  PC082-CARTONS-ON-HOLD           PIC  ZZZZZZ9.            00510037
001310     05  PC082-COMMA-22                  PIC  X(01)  VALUE ','.   00520034
004820     05  PC082-UNITS-ON-HOLD             PIC  ZZZZZZ9.            00530037
001310     05  PC082-COMMA-23                  PIC  X(01)  VALUE ','.   00540037
070500     05  PC082-PCT-ON-HOLD               PIC  X(04).              00550049
001310     05  PC082-COMMA-24                  PIC  X(01)  VALUE ','.   00560037
070500     05  PC082-AGED-IND                  PIC  X(01).              00570049
001310     05  PC082-COMMA-25                  PIC  X(01)  VALUE ','.   00580047
