000100 01  PC903-EXTRACT-RECORD.                                                
000200     05  PC903-PO-NBR                 PIC S9(09) COMP.                    
000300     05  PC903-PO-NULL                PIC X(01).                          
000400     05  PC903-RCVR-SEQ-NBR           PIC S9(09) COMP.                    
000500     05  PC903-RCVR-NULL              PIC X(01).                          
000600     05  PC903-INTR-UPC-ID            PIC S9(09) COMP.                    
000700     05  PC903-LOC-NBR                PIC S9(04) COMP.                    
000800     05  PC903-IN-TRNST-TRN-TMST      PIC X(26).                          
000900     05  PC903-TRN-TYP-CDE            PIC X(02).                          
001000     05  PC903-TRN-CLSN-PRCG-QTY      PIC S9(09) COMP.                    
001100     05  PC903-SKU-NBR                PIC S9(8)V COMP-3.                  
001200     05  PC903-DEPT-NBR               PIC S9(4)V COMP-3.                  
001300     05  PC903-MAJ-CL-NBR             PIC S9(4)V COMP-3.                  
001400                                                                          
