000100*  PCRD042 - PO/RCVR SUMMARY FILE                                         
000200*  LRECL = 70                                                *            
000300*                                                            *            
000400 01  PC042-PO-RCVR-SUMMARY-REC.                                           
000500     05  PC042-PO-NBR                 PIC S9(09) COMP.                    
000600     05  PC042-RCVR-SEQ-NBR           PIC S9(09) COMP.                    
000700     05  PC042-PERCENTAGE             PIC S9(03)V9(4) COMP-3.             
000800     05  PC042-AR-TOTAL               PIC S9(09) COMP.                    
000900     05  PC042-UN-TOTAL               PIC S9(09) COMP.                    
001000     05  PC042-PO-RCVR-START-DTE      PIC X(10).                          
001100     05  PC042-PO-RCVR-END-DTE        PIC X(10).                          
000900     05  PC042-REC-COUNT              PIC S9(09) COMP.                    
001200     05  FILLER                       PIC X(26).                          
