000100**************************************************************    00010009
000200*  PCRD038 - LAYOUT FOR UNBALANCED STORE EXPECTED            *    00020009
000300*            REPORT EXTRACT  LRECL = 150                     *    00030009
000400*                                                            *    00040009
000500* CHANGE HISTORY:                                            *    00050009
000600* WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060009
000700* ------- ---------- ----------- -----------------------------    00070009
000800* WR27701 04-29-2005 D.BRANTNER  ADDED OUTBOUND TRIP ID           00080009
000810* WR33744 02-28-2008 R.KRIER     ADDED POST INV REVERSE CDE       00081014
000820*                                      AFTER REV STR EXP UNITS    00082014
000830*                                      AFTER REV IN TRANS UNITS   00083014
000840*                                      AFTER REV CLEAN UNITS      00084014
000850*                                      AFTER REV CLEAN CODE       00085014
000900**************************************************************    00090009
001000 01  PC038-SE-UNBALANCED-RPT-REC.                                 00100009
001100     05  PC038-OPER-UNT-ID            PIC 9(04)  COMP.            00110009
001200     05  PC038-LOC-NBR                PIC 9(04)  COMP.            00120009
001300     05  PC038-PO-NBR                 PIC S9(9)  COMP.            00130009
001400     05  PC038-RCVR-SEQ-NBR           PIC S9(9)  COMP.            00140009
001500     05  PC038-SKU.                                               00150009
001600         10  PC038-SKU-9              PIC S9(08) COMP-3.          00160009
001700     05  PC038-STR-EXPECTED-UNITS     PIC S9(9)  COMP.            00170009
001800     05  PC038-INTRNST-TRN-DTE        PIC X(10).                  00180009
001900     05  PC038-EXTD-RTL-AMT           PIC S9(13)V9(2) VALUE ZEROES00190009
002000                                                 COMP-3.          00200009
002100     05  PC038-CLEAN-REASON           PIC X(40).                  00210009
002200     05  PC038-DEPT-NBR               PIC S9(4)V COMP-3.          00220009
002300     05  PC038-SUB-CL-NBR             PIC S9(4)V COMP-3.          00230009
002400     05  PC038-OTBND-TRIP.                                        00240009
002500         10  PC038-OTBND-TRIP-1       PIC S9(9) COMP.             00250009
002600         10  PC038-OTBND-TRIP-2       PIC S9(9) COMP.             00260009
002700         10  PC038-OTBND-TRIP-3       PIC S9(9) COMP.             00270009
002800     05  PC038-MULTIPLE-TRIP-IND      PIC X(01).                  00280009
002900     05  PC038-INTR-UPC-ID            PIC S9(09) COMP.            00290009
003000     05  PC038-REC-TYP-CDE            PIC X(02).                  00300009
003100     05  PC038-UNITS-VARIANCE         PIC 9(04).                  00310009
003200     05  PC038-APP-PO-LNE-NBR         PIC 9(04).                  00320009
003300     05  PC038-APP-PO-LNE-NBR-X REDEFINES PC038-APP-PO-LNE-NBR    00330009
003400                                      PIC X(04).                  00340009
003410     05  PC038-POST-INV-REVERSE-CDE   PIC X(01).                  00341011
003420         88  PC038-POST-INV-REVERSE             VALUE 'Y'.        00342011
003430         88  PC038-NO-POST-INV-REVERSE          VALUE 'N'.        00343011
003440     05  PC038-AFT-REV-STR-EXP-UNITS  PIC S9(9)  COMP.            00344012
003450     05  PC038-AFT-REV-IN-TRNS-UNITS  PIC S9(9)  COMP.            00345012
003460     05  PC038-AFT-REV-CLEAN-UNITS    PIC S9(9)  COMP.            00346012
003470     05  PC038-AFT-REV-CLEAN-CDE      PIC X(01).                  00347013
003480         88  PC038-AFT-REV-CLEAN-CREATED        VALUE 'Y'.        00348013
003490         88  PC038-AFT-REV-CLEAN-CREATED-NO     VALUE 'N'.        00349013
003491     05  PC038-SEPHORA-IND            PIC X(01).                  00349115
003492         88  PC038-SEPHORA                       VALUE 'S'.       00349215
003493     05  PC038-SEPHORA-DC             PIC X(01).                  00349315
003494         88  PC038-SEPHORA-SUPPORT-DC            VALUE 'S'.       00349415
003495         88  PC038-SEPHORA-DIFFERENT-DC          VALUE 'D'.       00349515
003500     05  FILLER                       PIC X(22).                  00350015
