      ******************************************************************        
      *    COPY MEMBER:  PCRD007                       LRECL = 330     *PCRD007 
      *                                                                *        
      *    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *        
      *    RECEIVER PACKSLIP CARTON SUMMARY FILE.                      *        
      *                                                                *        
      *    DATE  10/07/2014                                            *        
      *        CHANGE MADE: EXPAND PO-NBR TO 8 DIGITS.                 *        
      *        MADE BY: DAVID WELLER            WR/IR #: CHG0094517    *        
      ******************************************************************        
       01  PC007-CRTN-SUM-RECORD.                                               
           05  PC007-PO-NBR               PIC  9(09)    VALUE ZEROS.            
           05  PC007-SEQ-NBR              PIC  9(04)    VALUE ZEROS.            
           05  PC007-TABLE-ENTRIES        PIC  9(04)    VALUE ZEROES.           
           05  PC007-CRTN-SUM-TBL.                                              
               10  PC007-CRTN-SUM-ENTRY   OCCURS  50 TIMES                      
                                          INDEXED BY CRTN-IDX.                  
                   15  PC007-TBL-LNE-NBR  PIC S9(09)    VALUE ZEROS             
                                                        COMP.                   
                   15  PC007-TBL-QTY      PIC S9(04)    VALUE ZEROS             
                                                        COMP.                   
           05  FILLER                     PIC  X(13)    VALUE SPACES.           
       01  PC007-MAX-ENTRIES              PIC  9(04)    VALUE 50.               
