000100**************************************************************    00010000
000200*   COPYBOOK NAME:    PCRD071                                *    00020000
000300*   COPYBOOK LENGTH:  200                                    *    00030000
000400*   THIS IS THE RECORD LAYOUT FOR AN EXTRACT FILE CONTAINING *    00040000
000500*   NEW SKUS INBOUND TO AN EFC.  THIS FILE WILL BE USED      *    00050000
000600*   TO CREATE PCKRP037 - INBOUND NEW SKUS.                   *    00060000
000700**************************************************************    00070000
000800 01  PC071-RECORD-LAYOUT.                                         00080000
000900     05  PC071-OPER-UNT-ID                   PIC S9(04) COMP.     00090000
001000     05  PC071-TRIP-ID                       PIC S9(09) COMP.     00100000
001100     05  PC071-SCAC                          PIC  X(04).          00110000
001200     05  PC071-TRLR-NBR                      PIC  X(10).          00120000
001300     05  PC071-ARRIVAL-DATE                  PIC  X(10).          00130000
001400     05  PC071-TRLR-LOC                      PIC  X(05).          00140000
001500     05  PC071-DEPT-NBR                      PIC  X(03).          00150000
001600     05  PC071-DEPT-NAME                     PIC  X(20).          00160000
001700     05  PC071-PO-NBR                        PIC S9(09) COMP.     00170000
001800     05  PC071-REC-SEQ-NBR                   PIC S9(09) COMP.     00180000
001900     05  PC071-PO-LNE-NBR                    PIC S9(09) COMP.     00190000
002000     05  PC071-SKU-NBR                       PIC  X(08).          00200000
002100     05  PC071-SKU-DESC                      PIC  X(30).          00210000
002200     05  PC071-SKU-QTY                       PIC S9(09) COMP.     00220000
002300     05  PC071-SKU-LENGTH                   PIC S9(4)V9(3) COMP-3.00230000
002400     05  PC071-SKU-WIDTH                    PIC S9(4)V9(3) COMP-3.00240000
002500     05  PC071-SKU-HEIGHT                   PIC S9(4)V9(3) COMP-3.00250000
002600     05  PC071-SKU-WEIGHT                   PIC S9(4)V9(3) COMP-3.00260000
002700     05  PC071-SORT-NONSORT                  PIC  X(01).          00270000
002800     05  PC071-SHIPALONE-IND                 PIC  X(01).          00280000
002900     05  PC071-HAZ-IND                       PIC  X(01).          00290000
003000     05  PC071-BRKBL-IND                     PIC  X(01).          00300000
003010     05  PC071-INPK-QTY                      PIC S9(04) COMP.     00301000
003020     05  PC071-OTPK-QTY                      PIC S9(04) COMP.     00302000
003100     05  FILLER                              PIC  X(64).          00310001
