000100******************************************************************00010000
000200**                          PCRD032                             **00020000
000300**  THIS MEMBER CONTAINS THE RECORD FORMAT FOR THE RECEIVING    **00030000
000400**  TURN REPORT EXTRACT FILE.                                   **00040000
000500**     LENGTH: 150                                              **00050000
000600******************************************************************00060000
000700 01  PC032-TURN-RPT-EXTRACT-RECORD.                               00070000
000800     05  PC032-PO-NBR                PIC  9(08).                  00080000
000900     05  PC032-REC-SEQ-NBR           PIC  9(09).                  00090000
001000     05  PC032-DPT-NBR               PIC  9(03).                  00100000
001100     05  PC032-DATE-RECEIVED         PIC  9(06).                  00110000
001200     05  FILLER REDEFINES PC032-DATE-RECEIVED.                    00120000
001300         10  PC032-DR-MM             PIC  9(02).                  00130000
001400         10  PC032-DR-DD             PIC  9(02).                  00140000
001500         10  PC032-DR-YY             PIC  9(02).                  00150000
001600     05  PC032-DATE-VERIFIED         PIC  9(06).                  00160000
001700     05  FILLER REDEFINES PC032-DATE-VERIFIED.                    00170000
001800         10  PC032-DV-MM             PIC  9(02).                  00180000
001900         10  PC032-DV-DD             PIC  9(02).                  00190000
002000         10  PC032-DV-YY             PIC  9(02).                  00200000
002100     05  PC032-VND-NAME              PIC  X(25).                  00210000
002200     05  PC032-VND-NBR               PIC  X(09).                  00220000
002300     05  PC032-UNITS-RECVD           PIC  9(06).                  00230000
002400     05  PC032-RETAIL-EXTENSION      PIC  9(07)V99.               00240000
002500     05  PC032-PRCS-AREA             PIC  X(06).                  00250000
002600     05  PC032-OPER-UNT-ID           PIC  9(04).                  00260000
002700     05  PC032-FCLTY-ID              PIC  9(04).                  00270000
002800     05  PC032-CARTON-CNT            PIC  9(04).                  00280000
002900     05  PC032-TROUBLE-CNT           PIC  9(04).                  00290000
003000     05  PC032-PRCS-DAYS             PIC  9(04)V9.                00300000
003100     05  PC032-DAYS-IN-TRBL          PIC  9(04)V9.                00310000
003200     05  PC032-UNRSLVD-TRBL-IND      PIC  X(01).                  00320000
003300         88  PC032-UNRSLVD-TRBL      VALUE 'Y'.                   00330000
003400         88  PC032-NO-UNRSLVD-TRBL   VALUE 'N'.                   00340000
003500     05  FILLER                      PIC  X(36).                  00350000
