000100 01  PC054-UPC-STORE-EXTRACT.                                             
000200     05  PC054-INTR-UPC-ID            PIC S9(09) COMP.                    
000300     05  PC054-LOC-NBR                PIC S9(04) COMP.                    
000400     05  FILLER                       PIC X(04).                          
