000100******************************************************************00010000
000200* DETAIL LAYOUT OF EXTRACT FILE TO BE PURGED FROM PCT_TRN_CLSN_DTL00020000
000300* CREATED BY PCKUT987                                             00030000
000400******************************************************************00040000
000500 01  PC080-INTRNST-PURGE-REC.                                     00050000
000510     10 PC080-INTR-UPC-ID          PIC   9(10).                   00051001
000511     10 PC080-COMMA-01             PIC   X(01).                   00051100
000512     10 PC080-LOC-NBR              PIC   9(04).                   00051200
000513     10 PC080-COMMA-02             PIC   X(01).                   00051300
000514     10 PC080-TRN-CLSN-CDE         PIC   X(02).                   00051400
000515     10 PC080-COMMA-03             PIC   X(01).                   00051500
000516     10 PC080-PURGE-DATE           PIC   X(10).                   00051600
000517     10 PC080-COMMA-04             PIC   X(01).                   00051700
000518     10 PC080-INTR-UPC-ID-KEY      PIC  S9(9) COMP.               00051802
000519     10 PC080-COMMA-05             PIC   X(01).                   00051902
000595     10 FILLER                     PIC   X(15).                   00059502
000596*                                                                 00059600
000597******************************************************************00059700
