000100**    EXTRACT FOR INTRANSIT DETAIL PURGE                                  
000200**                          PCRD033                                       
000300**     LENGTH: 26                                                         
000400*                                                                         
000500 01  PC033-INTRANSIT-DTL-PURGE-REC.                                       
000600     05  PC033-INTR-UPC-ID           PIC  S9(09) COMP.                    
000700     05  PC033-LOC-NBR               PIC  S9(04) COMP.                    
000800     05  PC033-PO-NBR                PIC  S9(09) COMP.                    
000900     05  PC033-PO-NBR-NI             PIC  X(01).                          
001000     05  PC033-RCVR-SEQ-NBR          PIC  S9(09) COMP.                    
001100     05  PC033-RCVR-SEQ-NBR-NI       PIC  X(01).                          
001200     05  PC033-OTBND-TRIP-ID         PIC  S9(09) COMP.                    
001300     05  PC033-OTBND-TRIP-ID-NI      PIC  X(01).                          
001400     05  PC033-TRN-CLSN-PRCG-QTY     PIC  S9(09) COMP.                    
001500     05  FILLER                      PIC  X(01).                          
