000100**************************************************************    00010000
000200*   COPYBOOK NAME:    PCRD086                                *    00020001
000210*   COPYBOOK LENGTH:  300                                    *    00021011
000211*   THIS RECORD LAYOUT CONTAINS PICKMADE LABOR EVENT DATA    *    00021100
000212*   THAT WILL BE USED TO CREATE UNITS WORKED FOR             *    00021200
000213*   PACK-TO-LIGHT                                            *    00021300
000214*                                                            *    00021421
000217**************************************************************    00021722
000218 01  PC086-EXPORT-RECORD-LAYOUT.                                  00021822
000230     05  PC086-OPER-UNT-ID            PIC S9(04) COMP.            00023000
000240     05  PC086-ORD-NBR                PIC S9(09) COMP.            00024000
000250     05  PC086-RCVR-SEQ-NBR           PIC S9(09) COMP.            00025000
000260     05  PC086-ORD-LNE-NBR            PIC S9(09) COMP.            00026000
000261     05  PC086-PREPK-ID               PIC S9(09) COMP.            00026102
000270     05  PC086-STORE-NBR              PIC S9(04) COMP.            00027000
000271     05  PC086-CRE-BY-USR-ID          PIC  X(08).                 00027100
000272     05  PC086-CRE-PGM-NM             PIC  X(08).                 00027200
000273     05  PC086-P2L-CRE-TMST           PIC  X(26).                 00027323
000280     05  PC086-BUS-EVENT-TMST         PIC  X(26).                 00028023
000286     05  PC086-PICKED-QTY             PIC S9(05).                 00028620
000287     05  PC086-PICKED-QTY-SIGN        PIC  X(01).                 00028700
000288         88  PC086-PICKED-QTY-POS           VALUE 'P'.            00028800
000289         88  PC086-PICKED-QTY-NEG           VALUE 'N'.            00028900
000292     05  PC086-PREPK-LNE-PRC-CDE      PIC  X(01).                 00029200
000293     05  PC086-UCC128-DAT-USG-CDE     PIC  X(01).                 00029300
000294*                                                                 00029400
000298     05  PC086-ACTN-CDE               PIC  X(01).                 00029800
000299     05  PC086-WRKD-UNT-TMST          PIC  X(26).                 00029900
000300     05  PC086-BUS-DTE                PIC  X(10).                 00030016
000301     05  PC086-BUS-DTE-R REDEFINES PC086-BUS-DTE.                 00030116
000302         10  PC086-BUS-DTE-CC         PIC  9(2).                  00030216
000303         10  PC086-BUS-DTE-YY         PIC  9(2).                  00030316
000304         10  PC086-BUS-DASH-1         PIC  X(1).                  00030416
000305         10  PC086-BUS-DTE-MM         PIC  9(2).                  00030516
000306         10  PC086-BUS-DASH-2         PIC  X(1).                  00030616
000307         10  PC086-BUS-DTE-DD         PIC  9(2).                  00030716
000308     05  PC086-FSCL-DTE.                                          00030816
000309         10  PC086-FSCL-DTE-CC        PIC  9(2).                  00030916
000310         10  PC086-FSCL-DTE-YY        PIC  9(2).                  00031016
000311         10  PC086-FSCL-DASH-1        PIC  X(1).                  00031116
000312         10  PC086-FSUL-DTE-MM        PIC  9(2).                  00031216
000313         10  PC086-FSCL-DASH-2        PIC  X(1).                  00031316
000314         10  PC086-FSCL-DTE-DD        PIC  9(2).                  00031416
000315     05  PC086-FSCL-YR-NBR            PIC  X(4).                  00031516
000316     05  PC086-FSCL-MN-NBR            PIC  X(2).                  00031616
000317     05  PC086-FSCL-WK-NBR            PIC  X(2).                  00031716
000318     05  PC086-WK-IN-MN-NBR           PIC  X(1).                  00031816
000319     05  PC086-DAY-OF-WK-NBR          PIC  X(1).                  00031916
000320     05  PC086-LY-THIS-DAY-KY-DTE     PIC  X(10).                 00032016
000321     05  PC086-FSCL-MN-BEG-DTE        PIC  X(10).                 00032116
000322     05  PC086-FSCL-MN-END-DTE        PIC  X(10).                 00032216
000323     05  PC086-FSCL-WK-BEG-DTE        PIC  X(10).                 00032316
000324     05  PC086-FSCL-WK-END-DTE        PIC  X(10).                 00032416
000325*                                                                 00032516
000326     05  PC086-SHFT-NBR               PIC  9(04).                 00032616
000328     05  PC086-PRCG-AREA-CDE          PIC  X(06).                 00032800
000329     05  PC086-UNT-RETAIL-PRC         PIC S9(09)V9(2).            00032918
000330     05  FILLER                       PIC X.                      00033018
000331     05  PC086-EXTD-RTL-AMT           PIC S9(09)V9(2).            00033118
000332*                                                                 00033206
000340     05  FILLER                       PIC X(64).                  00034019
