000001******************************************************************10/18/95
000002*                         PCWS270                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE PCT_SUM_VRFD TABLE EXTRACT            *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 80 BYTES                                              RVWS010 
000008******************************************************************RVWS010 
000009 01  PC270-VRFD-BKUP-RECORD.                                              
000010     05  PC270-PURGE-TYPE             PIC  X(04).                         
000010     05  PC270-PURGE-KEY              PIC  X(10).                         
000010     05  PC270-BUS-DTE                PIC  X(10).                         
000011     05  PC270-OPER-UNT-ID            PIC  S9(04) COMP.                   
000012     05  PC270-SHFT-NBR               PIC  S9(04) COMP.                   
000014     05  PC270-UNT-VRFD-QTY           PIC  S9(09) COMP.                   
000015     05  PC270-CART-VRFD-QTY          PIC  S9(09) COMP.                   
000016     05  PC270-PO-RCVR-VRFD-QTY       PIC  S9(09) COMP.                   
000017     05  PC270-EXTD-RTL-VRFD-AMT      PIC  S9(07)V9(02) COMP-3.           
000019     05  FILLER                       PIC  X(12) VALUE SPACES.            
