000100******************************************************************        
000200*    COPY MEMBER:  PCRD024                       LRECL = 30      *        
000300*                                                                *        
000400*    INTRANSIT PURGE EXTRACT.                                    *        
000500*                                                                *        
000600******************************************************************        
000700 01  PC024-PURGE-EXTRACT.                                                 
000800     05  PC024-INTR-UPC-ID            PIC S9(9) COMP.                     
000900     05  PC024-LOC-NBR                PIC S9(4) COMP.                     
001000     05  PC024-TRN-CLSN-CDE           PIC X(2).                           
001100     05  PC024-TRN-CLSN-QTY           PIC S9(9) COMP.                     
001200     05  PC024-LAST-UPD-DTE           PIC X(10).                          
