000100************************************************************      00010000
000200* PCRD066                                                  *      00020000
W38216******************************************************************00021009
W38216*  CHANGE LOG                                                     00022009
W38216*  DATE       CHANGED BY    DESC                                  00023009
W38216*  ---------- ------------- --------------------------------------00024009
W38216*  07-06-2010 B. GRAHAM - KFORCE                                  00025010
W38216*                           WR 38216 EFC2 CHANGES                 00026009
W38216*                           SHOW ORIGINAL STORE NUMBER ON REPORT  00027009
W38216*                           ALL CHANGES TO THE PROGRAM CAN BE     00028009
W38216*                           FOUND BY DOING A FIND FOR 'W38216'    00029009
W38216*                           IN COLUMNS 1 THRU 6.                  00029109
W38216*                                                                 00029209
000300************************************************************      00030000
000400*    RECORD PURPOSE: RECORD FOR REPORTING ON STORE         *      00040002
000410*    EXPECTED ADJUSMENTS SENT FOR NOT FOUND CASES FROM WMOS*      00041002
000500*    RECORD LENGTH: 200                                    *      00050002
000700************************************************************      00070000
000800 01  PC066-SE-ADJ-TRAN-RECORD.                                    00080000
000900     05  PC066-TRANS-ADJ-CODE      PIC X(01).                     00090000
001000         88  PC066-APPLY-ADJUST                VALUE 'Y'.         00100000
001100         88  PC066-APPLY-ADJUST-NO             VALUE 'N'.         00110000
001441     05  PC066-CASE-NUMBER         PIC X(20).                     00144100
001442     05  PC066-PO-NUMBER           PIC 9(08).                     00144200
001443     05  PC066-REC-SEQ-NUMBER      PIC 9(04).                     00144300
001444     05  PC066-PO-LINE-NUMBER      PIC 9(04).                     00144400
001445     05  PC066-SKU-NUMBER          PIC 9(08).                     00144500
001446     05  PC066-CASE-SKU-QTY        PIC 9(05).                     00144600
001447     05  PC066-CURR-SE-QTY         PIC 9(05).                     00144700
001450     05  PC066-ORIG-SHIPMT-NBR     PIC X(20).                     00145000
001451     05  PC066-RCVD-SHPMT-NBR      PIC X(20).                     00145100
001453     05  PC066-DC-LOCATION         PIC 9(04).                     00145300
001454     05  PC066-STORE-NUMBER        PIC 9(04).                     00145400
001455     05  PC066-STATUS-CDE          PIC X(02).                     00145503
001456     05  PC066-TRAN-TYPE-CDE       PIC X(02).                     00145604
001457     05  PC066-PKGNG-CDE           PIC X(01).                     00145706
001458     05  PC066-CRE-USER-ID         PIC X(08).                     00145806
001459     05  PC066-CRE-TMST            PIC X(26).                     00145906
001460     05  PC066-CRE-PROGRAM         PIC X(8).                      00146006
001461     05  PC066-UNIT-RETAIL         PIC S9(7)V99 COMP-3.           00146107
001462     05  PC066-ADJ-RETAIL          PIC S9(7)V99 COMP-3.           00146207
W38216     05  PC066-ORIG-STORE-NUMBER   PIC 9(04).                     00146308
W38216     05  FILLER                    PIC X(36).                     00147008
