000100*  PCRD048 - ARCHIVE OF PURGED SE ROWS   LRECL=150                        
000200*                                                                         
000300 01  PC048-SE-ARCHIVE-REC.                                                
000400                                                                          
000500*    THIS SECTION COMES FROM PCRD045 WHICH IS A BMC                       
000600*    UNLOAD OF ALL 'SE' COLUMNS OF PCT_TRN_CLSN_DTL                       
000700                                                                          
000800     05  PC048-INTR-UPC-ID            PIC  S9(9) COMP.                    
000900     05  PC048-LOC-NBR                PIC  S9(4) COMP.                    
001000     05  PC048-TRN-CLSN-CDE           PIC   X(2).                         
001100     05  PC048-IN-TRNST-TRN-TMST      PIC   X(26).                        
001200     05  PC048-TRN-TYP-CDE            PIC   X(2).                         
001300     05  PC048-TRN-CLSN-PRCG-QTY      PIC  S9(9) COMP.                    
001400     05  PC048-TRN-CLSN-BAL-QTY       PIC  S9(9) COMP.                    
001500     05  PC048-UPD-USR-ID             PIC   X(8).                         
001600     05  PC048-OTBND-TRIP-ID          PIC  S9(9) COMP.                    
001700     05  PC048-NULL-1                 PIC   X(1).                         
001800     05  PC048-PO-NBR                 PIC  S9(9) COMP.                    
001900     05  PC048-NULL-2                 PIC   X(1).                         
002000     05  PC048-RCVR-SEQ-NBR           PIC  S9(9) COMP.                    
002100     05  PC048-NULL-3                 PIC   X(1).                         
002200     05  PC048-PROCESS-DTE            PIC   X(10).                        
002300     05  FILLER                       PIC   X(10).                        
002400                                                                          
002500*   THIS SECTION COMES FROM XLT_MDSE_INV_PARM OR IS CALCULATED            
002600*   BY PCKUT055 USING THAT TABLE                                          
002700     05  PC048-INV-DTE                PIC   X(10).                        
002800     05  PC048-PLND-INV-DTE           PIC   X(10).                        
002900     05  PC048-FIN-BK-DTE             PIC   X(10).                        
003000     05  PC048-FIN-DTE-ADJ-QTY        PIC   S9(04) COMP.                  
003100     05  PC048-FIN-BK-DTE-ADJ         PIC   X(10).                        
003200     05  PC048-BEGIN-DTE              PIC   X(10).                        
003300     05  PC048-END-DTE                PIC   X(10).                        
003400     05  FILLER                       PIC   X(11).                        
