000100******************************************************************        
000200*    COPY MEMBER:  PCRD004                       LRECL = 150     *        
000300*                                                                *        
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR A FILE WHICH       *        
000500*    IS CREATED FROM THE DISTRIBUTION TABLES (TDISTHD AND        *        
000600*    TDISTDT) FOR THE PURPOSE OF CREATING SOME PACK-TO-          *        
000700*    LIGHT STATUS REPORTS.                                       *        
000800*                                                                *        
000900******************************************************************        
001000 01  PC004-P2L-EXT-RECORD.                                                
001100     05  PC004-ORD-NBR                   PIC  9(08)  VALUE ZEROS.         
001200     05  PC004-REC-SEQ-NBR               PIC  9(04)  VALUE ZEROS.         
001300     05  PC004-ORD-LNE-NBR               PIC  9(04)  VALUE ZEROS.         
001400     05  PC004-REC-DATE.                                                  
001500         10  PC004-REC-DATE-MM           PIC  X(02)  VALUE SPACES.        
001600         10  FILLER                      PIC  X(01)  VALUE '/'.           
001700         10  PC004-REC-DATE-DD           PIC  X(02)  VALUE SPACES.        
001800         10  FILLER                      PIC  X(01)  VALUE '/'.           
001900         10  PC004-REC-DATE-CC           PIC  X(02)  VALUE SPACES.        
002000         10  PC004-REC-DATE-YY           PIC  X(02)  VALUE SPACES.        
002100     05  PC004-P2L-CART-CNT              PIC  9(07)  VALUE ZEROS.         
002200     05  PC004-P2L-UNIT-QTY              PIC  9(07)  VALUE ZEROS.         
002300     05  PC004-VNDR-NME                  PIC  X(30)  VALUE SPACE.         
002400     05  PC004-DEPT-NBR                  PIC  X(03)  VALUE SPACE.         
002500     05  PC004-PRCG-STAT-CDE             PIC  X(01)  VALUE SPACE.         
002600     05  PC004-CURRENT-OPER              PIC  9(04)  VALUE ZEROS.         
002700     05  PC004-CURRENT-FCLTY             PIC  9(04)  VALUE ZEROS.         
002800     05  PC004-PRC-AREA-MODU-ID          PIC  X(03)  VALUE SPACES.        
002900     05  PC004-STR-ZONE-ID               PIC  X(05)  VALUE SPACES.        
003000     05  PC004-SCAC-ID                   PIC  X(04)  VALUE SPACES.        
003100     05  PC004-VEH-NBR                   PIC  X(10)  VALUE SPACES.        
003200     05  PC004-LNE-LOC-CDE               PIC  X(05)  VALUE SPACES.        
003300     05  PC004-LNE-STATUS-CDE            PIC  X(01)  VALUE SPACES.        
003400         88  PC004-LNE-STATUS-READY                  VALUE 'D'.           
003500         88  PC004-LNE-STATUS-LAUNCHED               VALUE 'L'.           
003600     05  PC004-RECORD-TYPE-CDE           PIC  X(01)  VALUE SPACES.        
003610         88  PC004-ERROR-RECORD                      VALUE 'E'.           
003620         88  PC004-REPORT-RECORD                     VALUE 'R'.           
003700     05  FILLER                          PIC  X(39)  VALUE SPACES.        
