000005***************************************************************** 00000500
000006* PCWS253 - Casepack Physical SML - form                        * 00000600
000008* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00000800
000009*                    I M P O R T A N T                          * 00000900
000010* The label commands are strung together under only 4-05 levels * 00001000
000011* Each label command is separated by an end of text char-hex 03 * 00001100
000012* This was done to try to speed up transmission via new socket  * 00001200
000013* interface.  Systec's software separates 05 levels into        * 00001300
000014* statements.  The maximum length is 240.                       * 00001400
000015***************************************************************** 00001500
000016 01  PC253-SHIP-MFST-LBL-MAX-LN      PIC 9(03)    VALUE   9.      00001601
000017***                                                               00001700
000018***    NUMBER OF 05 LEVELS ------------------------------/\       00001800
000019***                                                               00001900
000020***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00002000
000021***               IN PC253-SML-FORM-LENGTH.                       00002101
000022***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00002200
000023***                                                               00002300
000024***************************************************************** 00002400
000025 01  PC253-SHIP-MFST-LBL.                                         00002501
000026* label line grouping 1                                           00002600
000027     05  FILLER.                                                  00002700
000028* c0000 - Continuous paper length - 0000 = normal operation       00002800
000029         10  FILLER                  PIC X(06)    VALUE           00002900
000030             'c0000'.                                            00003000
000031         10  FILLER                  PIC X(01)    VALUE  ''.     00003100
000032* e     - Select edge sensor - DEFAULT                            00003200
000033         10  FILLER                  PIC X(02)    VALUE           00003300
000034             'e'.                                                00003400
000035         10  FILLER                  PIC X(01)    VALUE  ''.     00003500
000036* M1030 - Maximum label length                                    00003600
000037         10  FILLER                  PIC X(06)    VALUE           00003700
000038             'M1030'.                                            00003800
000039         10  FILLER                  PIC X(01)    VALUE  ''.     00003900
000040*  Replaced a command with KcFMN to disable the feedback char     00004014
000041*  dmh 8/9/17                                                     00004114
000042* KcFMN - disable feedback characters to be transmitted (6)       00004214
000044         10  FILLER                  PIC X(06)    VALUE           00004414
000045             'KcFMN'.                                            00004514
000046         10  FILLER                  PIC X(01)    VALUE  ''.     00004600
000047* s     - Set up for 1 dot buffer                                 00004700
000048         10  FILLER                  PIC X(02)    VALUE           00004800
000049             's'.                                                00004900
000050         10  FILLER                  PIC X(01)    VALUE  ''.     00005000
000051* O0110 - Set form edge offset - 0110 = zero setting              00005100
000052         10  FILLER                  PIC X(06)    VALUE           00005200
000053             'O0110'.                                            00005300
000054         10  FILLER                  PIC X(01)    VALUE  ''.     00005400
000055* qA    - Clear memory module - A=upper slot                      00005500
000056         10  FILLER                  PIC X(03)    VALUE           00005600
000057             'qA'.                                               00005700
000058         10  FILLER                  PIC X(01)    VALUE  ''.     00005800
000059* L     - enter label formatting command input mode               00005900
000060         10  FILLER                  PIC X(02)    VALUE           00006000
000061             'L'.                                                00006100
000062         10  FILLER                  PIC X(01)    VALUE  ''.     00006200
000063* D11   - Set dot size - Horizontal(1) Vertical(1)                00006300
000064         10  FILLER                  PIC X(03)    VALUE           00006400
000065             'D11'.                                               00006500
000066         10  FILLER                  PIC X(01)    VALUE  ''.     00006600
000067* H11   - Heat setting for label                                  00006701
000068         10  FILLER                  PIC X(03)    VALUE           00006800
000069             'H11'.                                               00006900
000070         10  FILLER                  PIC X(01)    VALUE  ''.     00007000
000071* PK    - Max speed for print cycle - K=default (6 in.per sec)    00007100
000072         10  FILLER                  PIC X(02)    VALUE           00007200
000073             'PK'.                                                00007300
000074         10  FILLER                  PIC X(01)    VALUE  ''.     00007400
000075* SK    - Max slew rate speed - K= default (6 in.per sec)         00007500
000076         10  FILLER                  PIC X(02)    VALUE           00007600
000077             'SK'.                                                00007700
000078         10  FILLER                  PIC X(01)    VALUE  ''.     00007800
000079         10  FILLER                  PIC X(185)   VALUE  SPACES.  00007914
000080*                                                                 00008000
000081*                                                                 00008100
000082*****                                                             00008200
000083*                                                                 00008300
000084* label line grouping 2                                           00008400
000085     05  FILLER.                                                  00008500
000089*  store number (U01)                                             00008901
000090         10  FILLER                  PIC X(15)    VALUE           00009000
000091                                    '391200901150125'.            00009102
000092         10  FILLER                  PIC X(04)    VALUE  ZEROES.  00009200
000093         10  FILLER                  PIC X(01)    VALUE  ''.     00009300
000094*  door heading (U02)                                             00009401
000095         10  FILLER                  PIC X(15)    VALUE           00009501
000096                                    '331100100150110'.            00009602
000097         10  FILLER                  PIC X(05)    VALUE  '@@@@@'. 00009702
000098         10  FILLER                  PIC X(01)    VALUE  ''.     00009801
000099*  door number (U03)                                              00009901
000100         10  FILLER                  PIC X(15)    VALUE           00010001
000101                                    '331100100150065'.            00010102
000102         10  FILLER                  PIC X(04)    VALUE '@@@@'.   00010202
000104         10  FILLER                  PIC X(01)    VALUE  ''.     00010401
000105* PO heading  (U04)                                               00010502
000106         10  FILLER                  PIC X(18)    VALUE           00010602
000107                                    '331100400640310PO:'.         00010702
000108         10  FILLER                  PIC X(01)    VALUE  ''.     00010802
000109* po-receiver field (U05)                                         00010902
000110         10  FILLER                  PIC X(15)    VALUE           00011002
000111                                    '331100400640265'.            00011102
000112         10  PC253-PO-RCVR-NBR       PIC X(12)    VALUE           00011202
000113                                    '@@@@@@@@@@@@'.               00011302
000114         10  FILLER                  PIC X(01)    VALUE  ''.     00011402
000115* LINE or PACK heading - line (U06)                               00011502
000116         10  FILLER                  PIC X(15)    VALUE           00011602
000117                                    '331100400800310'.            00011702
000118         10  PC253-LINE-PACK-DESC    PIC X(05)    VALUE  '@@@@@'. 00011802
000120             88  PC253-LINE-HDG                   VALUE  'LINE:'. 00012002
000121             88  PC253-PACK-HDG                   VALUE  'PACK:'. 00012102
000122         10  FILLER                  PIC X(01)    VALUE  ''.     00012202
000123* LINE - field (U07)                                              00012302
000124         10  FILLER                  PIC X(15)    VALUE           00012402
000125                                    '331100400800265'.            00012502
000126         10  PC253-PO-LNE-NBR        PIC X(04)    VALUE  '@@@@'.  00012602
000128         10  FILLER                  PIC X(01)    VALUE  ''.     00012802
000129* SKU heading - line (U08)                                        00012902
000130         10  FILLER                  PIC X(19)    VALUE           00013002
000131                                    '331100400960310SKU:'.        00013102
000132         10  FILLER                  PIC X(01)    VALUE  ''.     00013202
000133* SKU - field (U09)                                               00013302
000134         10  FILLER                  PIC X(15)    VALUE           00013402
000135                                    '331100400960265'.            00013502
000136         10  PC253-SKU-NBR           PIC X(16)    VALUE           00013602
000137                                    '@@@@@@@@@@@@@@@@'.           00013702
000138         10  FILLER                  PIC X(01)    VALUE  ''.     00013802
000139         10  FILLER                  PIC X(39)    VALUE  spaces.  00013902
000140*                                                                 00014002
000141*                                                                 00014102
000142*****                                                             00014202
000143*                                                                 00014302
000144* label line grouping 3                                           00014402
000145     05  FILLER.                                                  00014502
000146* STYLE - line  (U10)                                             00014602
000147         10  FILLER                  PIC X(21)    VALUE           00014702
000148                                    '331100401120310STYLE:'.      00014802
000149         10  FILLER                  PIC X(01)    VALUE  ''.     00014902
000150* STYLE - field (U11)                                             00015002
000151         10  FILLER                  PIC X(15)    VALUE           00015102
000152                                    '331100401120265'.            00015202
000153         10  PC253-STYLE             PIC X(20)    VALUE           00015302
000154                                    '@@@@@@@@@@@@@@@@@@@@'.       00015402
000155         10  FILLER                  PIC X(01)    VALUE  ''.     00015502
000156******************************************************************00015602
000157*   program  should either set the following to PC253-inpk-convy *00015702
000158*   -box if nothing is to be printed                             *00015802
000159*            '1X1100001130150L000000'                            *00015902
000160*   or it should set the following to print a black box          *00016002
000161*            '1X1100001130150L164017'.                           *00016102
000162******************************************************************00016202
000163* inpk cnvy - BOX (U12)                                           00016302
000164         10  PC253-INPK-CONVY-BOX    PIC X(22).                   00016402
000165             88  PC253-FORM-INPK-BOX              VALUE           00016502
000166                                    '1X1100001130150L164017'.     00016602
000167             88  PC253-FORM-NO-INPK-BOX           VALUE           00016702
000168                                    '1X1100001130150L000000'.     00016802
000169         10  FILLER                  PIC X(01)    VALUE  ''.     00016902
000170******************************************************************00017002
000171*   program should either set the following to PC253-otpk-text   *00017102
000172*   if fullcase carton                                           *00017202
000173*            '331100401280310OUTER PK UNTS: '                    *00017302
000174*   or it should set the following to print the inner pack text  *00017402
000175*            '331100401280310INPK CNVY UNTS:'                    *00017502
000176******************************************************************00017602
000177* OUTER PK UNTS - INPK CNVY UNTS - heading (U13)                  00017702
000178         10  PC253-FILLER            PIC X(15)    VALUE           00017802
000179                                    '331100401280310'.            00017902
000180         10  PC253-OTPK-INPK-TEXT    PIC X(15).                   00018002
000181             88  PC253-FORM-OTPK-HDG              VALUE           00018102
000182                                    'OUTER PK UNTS: '.            00018202
000183             88  PC253-FORM-INPK-HDG              VALUE           00018302
000184                                    'INPK CNVY UNTS:'.            00018402
000185         10  FILLER                  PIC X(01)    VALUE  ''.     00018502
000186* OUTER PK UNTS - INPK CNVY UNTS - field   (U14)                  00018602
000187         10  PC253-FILLER            PIC X(15)    VALUE           00018702
000188                                    '331100401280188'.            00018802
000189         10  PC253-PACK-UNT          PIC X(04).                   00018902
000190         10  FILLER                  PIC X(01)    VALUE  ''.     00019002
000191****************************************************************  00019102
000192*  If this is for an odd carton then the following should be   *  00019202
000193*  moved to the PC253-odd-carton-box                           *  00019302
000194*                '1X1100001310244L0700017                      *  00019402
000195*  if this is not for an odd-carton then move the following    *  00019502
000196*  to PC253-odd-carton-box '1X1100001310244L000000  '          *  00019602
000197****************************************************************  00019702
000198* odd carton - BOX (U15)                                          00019802
000199         10  PC253-ODD-CARTON-BOX    PIC X(22)    VALUE  SPACES.  00019902
000200             88  PC253-FORM-ODD-CRTN-BOX          VALUE           00020002
000201                                    '1X1100001310244L070017'.     00020102
000202             88  PC253-FORM-NO-ODD-BOX            VALUE           00020202
000203                                    '1X1100001310244L000000'.     00020302
000204         10  FILLER                  PIC X(01)    VALUE  ''.     00020402
000205****************************************************************  00020502
000206*  If this is for an odd carton then the following should be   *  00020602
000207*  moved to the PC253-odd-carton-field  'ODD CRTN'             *  00020702
000208*  if this is not for an odd-carton then move the following    *  00020802
000209*  to PC253-odd-carton-field ' @@@@@@@@'                       *  00020902
000210****************************************************************  00021002
000211* odd carton - TEXT (U16)                                         00021102
000212         10  FILLER                  PIC X(15)    VALUE           00021202
000213                                    '331100401460310'.            00021302
000214         10  PC253-ODD-CARTON-FIELD  PIC X(08)    VALUE  SPACES.  00021402
000215             88  PC253-FORM-ODD-CRTN-FLD          VALUE           00021502
000216                                    'ODD CRTN'.                   00021602
000217             88  PC253-FORM-NO-ODD-FLD            VALUE           00021702
000218                                    '@@@@@@@@'.                   00021802
000219         10  FILLER                  PIC X(01)    VALUE  ''.     00021902
000220* plan-o-gram - program name (U17) - 1st line in box              00022002
000221         10  FILLER                  PIC X(15)    VALUE           00022102
000222                                    '341100402170390'.            00022202
000223         10  PC253-POG-PROGRAM-NAME  PIC X(35)    VALUE           00022302
000224             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00022402
000225             88  PC253-FORM-NO-POG-NAME           VALUE           00022502
000226             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00022602
000227         10  FILLER                  PIC X(01)    VALUE  ''.     00022702
000228         10  FILLER                  PIC X(10)    VALUE  spaces.  00022802
000229*                                                                 00022902
000230*                                                                 00023002
000231*****                                                             00023102
000232* label line grouping 4                                           00023202
000233     05  FILLER.                                                  00023302
000234* STORE ON HAND ZERO - MESSAGE   (U18) - 2nd line in box          00023402
000235         10  FILLER                  PIC X(15)    VALUE           00023502
000236                                    '341100402370390'.            00023602
000237         10  PC253-STORE-ON-HAND     PIC X(35)    VALUE           00023702
000238             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00023802
000239             88  PC253-FORM-NO-STORE-ON-HAND      VALUE           00023902
000240             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00024002
000241         10  FILLER                  PIC X(01)    VALUE  ''.     00024102
000242* Seasonal Set - heading  (U19)                                   00024202
000243         10  FILLER                  PIC X(15)    VALUE           00024302
000244*** 12/02/2010 dmh                  '331100401750300'.            00024406
000245                                    '331100401750310'.            00024506
000246         10  PC253-SEASET-TEXT       PIC X(04).                   00024606
000247             88  PC253-FORM-SEASET-HDG            VALUE  '@@@@'.  00024710
000248             88  PC253-FORM-SEASET-NO-HDG         VALUE  '@@@@'.  00024806
000249         10  FILLER                  PIC X(01)    VALUE  ''.     00024906
000250* Seasonal Set - Field  (U20)                                     00025006
000251         10  FILLER                  PIC X(15)    VALUE           00025106
000252*** 12/02/2010 dmh                  '331100401910300'.            00025206
000253                                    '331100401910310'.            00025306
000254         10  PC253-SEASONAL-SET      PIC X(25)    VALUE           00025406
000255                                    '@@@@@@@@@@@@@@@@@@@@@@@@@'.  00025506
000256             88  PC253-FORM-NO-SEASET             VALUE           00025606
000257                                    '@@@@@@@@@@@@@@@@@@@@@@@@@'.  00025706
000258         10  FILLER                  PIC X(01)    VALUE  ''.     00025806
000259* ZONE - heading  (U21) - 1st box left side of label              00025906
000260         10  FILLER                  PIC X(15)    VALUE           00026006
000261                                    '331100400600370'.            00026106
000262         10  FILLER                  PIC X(04)    VALUE  'ZONE'.  00026206
000263         10  FILLER                  PIC X(01)    VALUE  ''.     00026306
000264* ZONE/MDSE GROUP - FIELD   (U22) - 1ST BOX LEFT SIDE OF LABEL    00026406
000265         10  FILLER                  PIC X(15)    VALUE           00026506
000266                                    '332200400900370'.            00026606
000267         10  PC253-MDSE-GROUP        PIC X(02)    VALUE  '@@'.    00026706
000268         10  FILLER                  PIC X(01)    VALUE  ''.     00026806
000269* PRESENTATION   (U23) - 2ND BOX LEFT SIDE OF LABEL               00026906
000270         10  FILLER                  PIC X(15)    VALUE           00027006
000271                                    '332200401370390'.            00027106
000272         10  PC253-PRESENTATION      PIC X(04)    VALUE  '@@@@'.  00027206
000273             88  PC253-DEFLT-PRESENTATION         VALUE  '@@@@'.  00027306
000274             88  PC253-HANG                       VALUE  'HANG'.  00027406
000275             88  PC253-FOLD                       VALUE  'FOLD'.  00027506
000276         10  FILLER                  PIC X(01)    VALUE  ''.     00027606
000277* FIXTURE - heading  (U24)                                        00027706
000278         10  FILLER                  PIC X(15)    VALUE           00027806
000279*** 12/02/2010 dmh                  '331100401720384'.            00027906
000280                                    '341100401590310'.            00028006
000281         10  PC253-FIXTURE-HDG       PIC X(08)                    00028106
000282                                        VALUE  '@@@@@@@@'.        00028206
000283             88  PC253-FIXTURE-HDG-YES  VALUE  'FIXTURE#'.        00028306
000284             88  PC253-FIXTURE-HDG-NO   VALUE  '@@@@@@@@'.        00028406
000285         10  FILLER                  PIC X(01)    VALUE  ''.     00028503
000286* Fixture - Field    (U25)                                        00028603
000287         10  FILLER                  PIC X(15)    VALUE           00028703
000288*** 12/02/2010 dmh                  '331100401880384'.            00028806
000289                                    '341100401590225'.            00028911
000290         10  PC253-FIXTURE           PIC X(10)    VALUE           00029006
000291                                    '@@@@@@@@@@'.                 00029106
000292             88  PC253-FORM-NO-FIXTURE            VALUE           00029206
000293                                    '@@@@@@@@@@'.                 00029306
000294         10  FILLER                  PIC X(01)    VALUE  ''.     00029406
000295         10  FILLER                  PIC X(20)    VALUE  SPACES.  00029506
000296*                                                                 00029606
000297*                                                                 00029706
000298*****                                                             00029806
000299*                                                                 00029906
000300* label line grouping 5                                           00030006
000301     05  FILLER.                                                  00030106
000302* Text box - line 1  (U26) - 2nd box right side of label          00030206
000303         10  FILLER                  PIC X(15)    VALUE           00030306
000304                                    '331100401110115'.            00030406
000305         10  PC253-TEXT-LINE-1       PIC X(12)    VALUE           00030506
000306                                    '@@@@@@@@@@@@'.               00030606
000307             88  PC253-FORM-NO-TEXT-1             VALUE           00030706
000308                                    '@@@@@@@@@@@@'.               00030806
000309         10  FILLER                  PIC X(01)    VALUE  ''.     00030906
000310* Text box - line 2  (U27) - 2nd box right side of label          00031006
000311         10  FILLER                  PIC X(15)    VALUE           00031106
000312                                    '331100401270115'.            00031206
000313         10  PC253-TEXT-LINE-2       PIC X(12)    VALUE           00031306
000314                                    '@@@@@@@@@@@@'.               00031406
000315             88  PC253-FORM-NO-TEXT-2             VALUE           00031506
000316                                    '@@@@@@@@@@@@'.               00031606
000317         10  FILLER                  PIC X(01)    VALUE  ''.     00031706
000318* Text box - line 3  (U28) - 2nd box right side of label          00031806
000319         10  FILLER                  PIC X(15)    VALUE           00031906
000320                                    '331100401430115'.            00032006
000321         10  PC253-TEXT-LINE-3       PIC X(12)    VALUE           00032106
000322                                    '@@@@@@@@@@@@'.               00032206
000323             88  PC253-FORM-NO-TEXT-3             VALUE           00032306
000324                                    '@@@@@@@@@@@@'.               00032406
000325         10  FILLER                  PIC X(01)    VALUE  ''.     00032506
000326* Text box - line 4  (U29) - 2nd box right side of label          00032606
000327         10  FILLER                  PIC X(15)    VALUE           00032706
000328                                    '331100401590115'.            00032806
000329         10  PC253-TEXT-LINE-4       PIC X(12)    VALUE           00032906
000330                                    '@@@@@@@@@@@@'.               00033006
000331             88  PC253-FORM-NO-TEXT-4             VALUE           00033106
000332                                    '@@@@@@@@@@@@'.               00033206
000333         10  FILLER                  PIC X(01)    VALUE  ''.     00033306
000334* EAS - security tag needed - (U30) - 3rd box right side of label 00033406
000335         10  FILLER                  PIC X(15)    VALUE           00033506
000336*** 12/02/10 - dmh                  '332200401920090'.            00033608
000337                                    '332200401850365'.            00033708
000338         10  PC253-EAS-FIELD         PIC X(03)    VALUE  '@@@'.   00033808
000339             88  PC253-EAS-TAG-NEEDED             VALUE  'EAS'.   00033908
000340             88  PC253-EAS-TAG-NOT-NEEDED         VALUE  '@@@'.   00034008
000341         10  FILLER                  PIC X(01)    VALUE  ''.     00034108
000342*  # above bar code - (U31)                                       00034208
000343         10  FILLER                  PIC X(15)    VALUE           00034308
000344                                    '341100002600330'.            00034408
000345         10  FILLER                  PIC X(25)    VALUE           00034508
000346                                  '@@@@@@@@@@@@@@@@@@@@@@@@@'.    00034608
000347         10  FILLER                  PIC X(01)    VALUE  ''.     00034708
000348* increment previous field                                        00034808
000349         10  FILLER                  PIC X(03)    VALUE           00034908
000350             '+01'.                                               00035008
000351         10  FILLER                  PIC X(01)    VALUE  ''.     00035108
000352* long bar code across bottom of label - (U32)                    00035208
000353         10  FILLER                  PIC X(16)    VALUE           00035308
000354                                    '3e4410003790340C'.           00035408
000355         10  FILLER                  PIC X(20)    VALUE           00035508
000356                                    '@@@@@@@@@@@@@@@@@@@@'.       00035608
000357         10  FILLER                  PIC X(01)    VALUE  ''.     00035708
000358* increment previous field                                        00035808
000359         10  FILLER                  PIC X(03)    VALUE           00035908
000360             '+01'.                                               00036008
000361         10  FILLER                  PIC X(01)    VALUE  ''.     00036108
000362         10  FILLER                  PIC X(23)    VALUE  SPACES.  00036208
000363*                                                                 00036308
000364*                                                                 00036408
000365*****                                                             00036508
000366*                                                                 00036608
000367* label line grouping 6                                           00036708
000368     05  FILLER.                                                  00036808
000369**  User ID - above barcode (U33)                                 00036908
000370         10  FILLER                  PIC X(15)    VALUE           00037008
000371                                    '302200002600050'.            00037108
000372         10  PC253-USER-ID           PIC X(08)    VALUE SPACES.   00037208
000373         10  FILLER                  PIC X(01)    VALUE  ''.     00037308
000374* Printer # - line (U34) - across the bottom of label             00037408
000375         10  FILLER                  PIC X(15)    VALUE           00037508
000376                                    '302200003910390'.            00037608
000377         10  FILLER                  PIC X(07)    VALUE           00037708
000378                                    'PRTR # '.                    00037808
000379         10  PC253-SML-PRTR-NBR      PIC X(06)    VALUE           00037908
000380                                    'DC-@@@'.                     00038008
000381         10  FILLER                  PIC X(01)    VALUE  ''.     00038108
000382*  label # of field (U35) - across the bottom of label            00038208
000383         10  FILLER                  PIC X(15)    VALUE           00038308
000384                                    '302200003910285'.            00038408
000385         10  FILLER                  PIC 9(04)    VALUE  ZEROES.  00038508
000386         10  FILLER                  PIC X(01)    VALUE  ''.     00038608
000387* increment previous field                                        00038708
000388         10  PC253-AUTO-LBL-CNT      PIC X(03)    VALUE           00038808
000389             '+01'.                                               00038908
000390         10  FILLER                  PIC X(01)    VALUE  ''.     00039008
000391*  OF heading  (U36) - across the bottom of label                 00039108
000392         10  FILLER                  PIC X(15)    VALUE           00039208
000393                                    '302200003910257'.            00039308
000394         10  PC253-LABEL-CNT         PIC X(04)    value '@@@@'.   00039408
000395             88  PC253-FORM-OF                    VALUE  ' OF '.  00039508
000396             88  PC253-FORM-NO-OF                 VALUE  '@@@@'.  00039608
000397         10  FILLER                  PIC X(01)    VALUE  ''.     00039708
000398*  total label count (U37) - across the bottom of label           00039808
000399         10  FILLER                  PIC X(15)    VALUE           00039908
000400                                    '302200003910232'.            00040008
000401         10  PC253-TOT-LBL-CNT       PIC 9(04)    VALUE  ZEROES.  00040108
000402         10  FILLER                  PIC X(01)    VALUE  ''.     00040208
000403*  label print date    (U38) - across the bottom of label         00040308
000404         10  FILLER                  PIC X(15)    VALUE           00040408
000405                                    '302200003910180'.            00040508
000406         10  PC253-LBL-PRT-DATE      PIC X(08)    VALUE           00040608
000407                                    '@@@@@@@@'.                   00040708
000408         10  FILLER                  PIC X(01)    VALUE  ''.     00040808
000409*  label print time     (U39) - across the bottom of label        00040908
000410         10  FILLER                  PIC X(15)    VALUE           00041008
000411                                    '302200003910125'.            00041108
000412         10  PC253-LBL-PRT-TIME      PIC X(05)    VALUE  '@@@@@'. 00041208
000413         10  FILLER                  PIC X(01)    VALUE  ''.     00041308
000414* label description line  (U40) - across the bottom of label      00041408
000415         10  FILLER                  PIC X(15)    VALUE           00041508
000416                                    '302200003910080'.            00041608
000417         10  PC253-SML-LBL-DESC      PIC X(10)    VALUE           00041708
000418                                    '@@@@@@@@@@'.                 00041808
000419         10  FILLER                  PIC X(01)    VALUE  ''.     00041908
000420         10  FILLER                  PIC X(52)    VALUE  SPACES.  00042008
000421*                                                                 00042108
000422*                                                                 00042208
000423*****  label line grouping 7                                      00042308
000424*                                                                 00042408
000425*                                                                 00042508
000426     05  FILLER.                                                  00042608
000427******************************************************************00042708
000428*   program  should either set the following to PC253-reprint-box*00042808
000429*   if nothing is to be printed                                  *00042908
000430*            '1X1100000250220L000000'                            *00043008
000431*   or it should set the following to print a black box          *00043108
000432*            '1X1100000250220L070017'                            *00043208
000433******************************************************************00043308
000434* reprint - BOX (U41)                                             00043408
000435         10  PC253-REPRINT-BOX       PIC X(22).                   00043508
000436             88  PC253-FORM-REPRT-BOX         VALUE               00043608
000437                                   '1X1100000250220L070017'.      00043708
000438             88  PC253-FORM-NO-RPRT-BOX       VALUE               00043808
000439                                   '1X1100000250220L000000'.      00043908
000440         10  FILLER                  PIC X(01)    VALUE  ''.     00044008
000441******************************************************************00044108
000442*   program  should either set the following to PC253-reprint-tex*00044208
000443*   if nothing is to be printed                                  *00044308
000444*            '331100000200369@@@@@@@'.                           *00044408
000445*   or it should set one of the following if reprint should be   *00044508
000446*   should be printed.                                           *00044608
000447*            '331100000200369REPRINT'                            *00044708
000448******************************************************************00044808
000449* reprint - TEXT (U42)                                            00044908
000450         10  FILLER                  PIC X(15)    value           00045008
000451                                    '331100000400280'.            00045108
000452         10  PC253-REPRINT-TEXT      PIC X(07).                   00045208
000453             88  PC253-FORM-REPRT-FLD             VALUE           00045308
000454                                    'REPRINT'.                    00045408
000455            88  PC253-FORM-NO-RPRT-FLD            VALUE           00045508
000456                                    '@@@@@@@'.                    00045608
000457         10  FILLER                  PIC X(01)    VALUE  ''.     00045708
000458* box around plan-o-gram program name and zero on hand (U43)      00045808
000459         10  FILLER                PIC X(28)      VALUE           00045908
000460             '1X1100001960010B385043001001'.                      00046008
000461         10  FILLER                  PIC X(01)    VALUE  ''.     00046108
000462* horizontal line between store # and text box - right side (U44) 00046208
000463         10  FILLER                PIC X(22)      VALUE           00046308
000464             '1X1100000940015L108001'.                            00046408
000465         10  FILLER                  PIC X(01)    VALUE  ''.     00046508
000466* horizontal line between zone & hang/fold box - left  side (U45) 00046608
000467         10  FILLER                PIC X(22)      VALUE           00046708
000468             '1X1100000950315L110001'.                            00046808
000469         10  FILLER                  PIC X(01)    VALUE  ''.     00046908
000470* horizontal line between text & eas tag box -   right side (U46) 00047008
000471         10  FILLER                PIC X(22)      VALUE           00047108
000472             '1X1100001620015L108001'.                            00047208
000473         10  FILLER                  PIC X(01)    VALUE  ''.     00047308
000474* horizontal line between hang/fold & fixture box -left side (U47)00047408
000475         10  FILLER                PIC X(22)      VALUE           00047508
000476             '1X1100001500315L110001'.                            00047608
000477         10  FILLER                  PIC X(01)    VALUE  ''.     00047708
000478* horizontal line above zone box - left side (U48)                00047808
000479         10  FILLER                PIC X(22)      VALUE           00047908
000480             '1X1100000400315L110001'.                            00048008
000481         10  FILLER                  PIC X(01)    VALUE  ''.     00048108
000482* vertical line right side of label by store number (U49)         00048208
000483         10  FILLER                PIC X(22)      VALUE           00048308
000484             '1X1100000940121L001082'.                            00048408
000485         10  FILLER                  PIC X(01)    VALUE  ''.     00048508
000486* vertical line left side of label by zone box (U50)              00048608
000487         10  FILLER                PIC X(22)      VALUE           00048708
000488*** 12/02/10 '1X1100000390315L001130'.                            00048809
000489             '1X1100000390315L001157'.                            00048909
000490         10  FILLER                  PIC X(01)    VALUE  ''.     00049009
000491         10  FILLER                  PIC X(04)   VALUE  SPACES.   00049109
000492*                                                                 00049209
000493*                                                                 00049309
000494***** label line grouping 8                                       00049409
000495     05  FILLER.                                                  00049509
000496* black box around the manifest number above barcode (U51)        00049609
000497         10  FILLER                  PIC X(22)    VALUE           00049709
000498             '1X1100002410067L093020'.                            00049809
000499         10  FILLER                  PIC X(01)    VALUE  ''.     00049909
000500* black box/line across label just above barcode. (U52)           00050009
000501         10  FILLER                PIC X(22)      VALUE           00050109
000502             '1X1100002630000L405009'.                            00050209
000503         10  FILLER                  PIC X(01)    VALUE  ''.     00050309
000504* reverse image store number - BOX (U53)                          00050409
000505         10  filler                  PIC X(22)   VALUE            00050509
000506                                   '1X1100000170010L119077'.      00050609
000507         10  FILLER                  PIC X(01)    VALUE  ''.     00050709
000508* reverse image - STORE ON HAND ZERO - 2nd line in box (U54)      00050809
000509         10  FILLER                  PIC X(22)    VALUE SPACES.   00050909
000510             88 PC253-OH-ZERO-YES  VALUE '1X1100002180033L360020'.00051009
000511             88 PC253-OH-ZERO-NO   VALUE '1X1100002180033L000000'.00051109
000520         10  FILLER                  PIC X(01)    VALUE  ''.     00052008
000531* U55 - CASI                                                      00053113
000532* 05/02/2013 added dmh                                            00053213
000533         10  FILLER                  PIC X(15)                    00053313
000534                                     VALUE '374200600321395'.     00053413
000535         10  pc253-CASI              pic x(01)    value '@'.      00053513
000536         10  filler                  PIC X(01)    VALUE  ''.     00053613
000538         10  FILLER                  PIC X(131)  VALUE  SPACES.   00053813
000539*                                                                 00053912
000540*                                                                 00054012
000541***** label line grouping 9                                       00054112
000542     05  FILLER.                                                  00054212
000543* X     - Terminate field generation                              00054312
000544         10  FILLER                  PIC X(02)    VALUE           00054412
000545             'X '.                                                00054512
000546         10  FILLER                  PIC X(01)    VALUE  ''.     00054612
000547         10  FILLER                  PIC X(237)   VALUE  SPACES.  00054712
000548                                                                  00054812
000549                                                                  00054912
000550 01  PC253-SHIP-MFST-LBL-TABLE       REDEFINES                    00055012
000551     PC253-SHIP-MFST-LBL.                                         00055112
000552     05  PC253-SHIP-MFST-LBL-LINE    OCCURS  9 TIMES              00055212
000553                                     INDEXED BY PC253-IDX         00055312
000554                                     PIC X(240).                  00055412
000555                                                                  00055512
000556*----------------------------------------------------------------*00055612
000557* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00055712
000558*----------------------------------------------------------------*00055812
000559 01  PC253-SML-FORM-LENGTH.                                       00055912
000560     05  FILLER                        PIC 9(03)    VALUE   55.   00056014
000561     05  FILLER                        PIC 9(03)    VALUE  201.   00056112
000562     05  FILLER                        PIC 9(03)    VALUE  230.   00056212
000563     05  FILLER                        PIC 9(03)    VALUE  220.   00056312
000564     05  FILLER                        PIC 9(03)    VALUE  217.   00056412
000565     05  FILLER                        PIC 9(03)    VALUE  188.   00056512
000566     05  FILLER                        PIC 9(03)    VALUE  236.   00056612
000568     05  FILLER                        PIC 9(03)    VALUE  109.   00056813
000569     05  FILLER                        PIC 9(03)    VALUE    3.   00056912
000570                                                                  00057012
000571 01  PC253-SML-FORM-LNGTH-VALUES REDEFINES PC253-SML-FORM-LENGTH. 00057112
000572     05  PC253-SML-FORM-LINE-LENGTH   OCCURS 9 TIMES              00057212
000573                                      INDEXED BY PC253-IDX-2      00057312
000574                                      PIC 9(03).                  00057412
000580                                                                  00058002
