00001 ******************************************************************01/03/96
00002 **                        PCWS115                               **PCWS115 
00003 **                                                              **   LV001
00004 **  THESE TABLES ARE USED TO HOLD THE LABEL MATRIX FORMAT CODES **PCWS115 
00005 **  USED TO CREATE THE RETAIL TICKETS ON THE PIGGYBACK LABELS.  **PCWS115 
00006 **  TABLES ARE BEING USED TO HOLD THIS INFORMATION DUE TO THE   **PCWS115 
00007 **  VARIABLE NUMBER OF RETAIL TICKETS APPEARING ON THE PIGGYBACK**PCWS115 
00008 **  LABEL.  "VOIDED" RETAIL TICKETS ARE PRINTED ON ANY UNUSED   **PCWS115 
00009 **  RETAIL TICKETS ON THE PIGGYBACK LABEL.                      **PCWS115 
00010 **                                                              **PCWS115 
00011 **  NOTE:  THIS COPYBOOK IS NEEDED DUE TO THE LOWERCASE         **PCWS115 
00012 **         CHARACTERS FOUND IN SOME OF THE LABEL MATRIX         **PCWS115 
00013 **         FORMAT CODES.                                        **PCWS115 
00014 ******************************************************************PCWS115 
00015  01  PC115-PGBK-LM-FMT-LOGO.                                      PCWS115 
00016      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00017              '3911A1004810493'.                                   PCWS115 
00018      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00019              '3911A1004810356'.                                   PCWS115 
00020      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00021              '3911A1004810218'.                                   PCWS115 
00022      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00023              '3911A1005810493'.                                   PCWS115 
00024      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00025              '3911A1005810356'.                                   PCWS115 
00026      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00027              '3911A1005810218'.                                   PCWS115 
00028      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00029              '3911A1006790493'.                                   PCWS115 
00030      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00031              '3911A1006790356'.                                   PCWS115 
00032      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00033              '3911A1006790218'.                                   PCWS115 
00034      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00035              '3911A1007790493'.                                   PCWS115 
00036      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00037              '3911A1007790356'.                                   PCWS115 
00038      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00039              '3911A1007790218'.                                   PCWS115 
00040      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00041              '3911A1008790493'.                                   PCWS115 
00042      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00043              '3911A1008790356'.                                   PCWS115 
00044      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00045              '3911A1008790218'.                                   PCWS115 
00046 *                                                                 PCWS115 
00047  01  PC115-PGBK-LM-FMT-LOGO-TBL        REDEFINES                  PCWS115 
00048      PC115-PGBK-LM-FMT-LOGO.                                      PCWS115 
00049      05  PC115-PGBK-LM-FMT-LOGO-LINE   OCCURS 15  TIMES           PCWS115 
00050                                        PIC X(15).                 PCWS115 
00051 *                                                                 PCWS115 
00052 *                                                                 PCWS115 
00053  01  PC115-PGBK-LM-FMT-SKU.                                       PCWS115 
00054      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00055              '3911A1205030511'.                                   PCWS115 
00056      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00057              '3911A1205030374'.                                   PCWS115 
00058      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00059              '3911A1205030236'.                                   PCWS115 
00060      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00061              '3911A1206030511'.                                   PCWS115 
00062      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00063              '3911A1206030374'.                                   PCWS115 
00064      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00065              '3911A1206030236'.                                   PCWS115 
00066      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00067              '3911A1207000511'.                                   PCWS115 
00068      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00069              '3911A1207000374'.                                   PCWS115 
00070      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00071              '3911A1207000236'.                                   PCWS115 
00072      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00073              '3911A1208000511'.                                   PCWS115 
00074      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00075              '3911A1208000374'.                                   PCWS115 
00076      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00077              '3911A1208000236'.                                   PCWS115 
00078      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00079              '3911A1209000511'.                                   PCWS115 
00080      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00081              '3911A1209000374'.                                   PCWS115 
00082      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00083              '3911A1209000236'.                                   PCWS115 
00084 *                                                                 PCWS115 
00085  01  PC115-PGBK-LM-FMT-SKU-TBL         REDEFINES                  PCWS115 
00086      PC115-PGBK-LM-FMT-SKU.                                       PCWS115 
00087      05  PC115-PGBK-LM-FMT-SKU-LINE    OCCURS 15  TIMES           PCWS115 
00088                                        PIC X(15).                 PCWS115 
00089 *                                                                 PCWS115 
00090 *                                                                 PCWS115 
00091  01  PC115-PGBK-LM-FMT-UPC-BC.                                    PCWS115 
00092      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00093              '3f3301905250517'.                                   PCWS115 
00094      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00095              '3f3301905250379'.                                   PCWS115 
00096      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00097              '3f3301905250242'.                                   PCWS115 
00098      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00099              '3f3301906250517'.                                   PCWS115 
00100      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00101              '3f3301906250379'.                                   PCWS115 
00102      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00103              '3f3301906250242'.                                   PCWS115 
00104      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00105              '3f3301907230517'.                                   PCWS115 
00106      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00107              '3f3301907230379'.                                   PCWS115 
00108      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00109              '3f3301907230242'.                                   PCWS115 
00110      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00111              '3f3301908230517'.                                   PCWS115 
00112      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00113              '3f3301908230379'.                                   PCWS115 
00114      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00115              '3f3301908230242'.                                   PCWS115 
00116      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00117              '3f3301909230517'.                                   PCWS115 
00118      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00119              '3f3301909230379'.                                   PCWS115 
00120      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00121              '3f3301909230242'.                                   PCWS115 
00122 *                                                                 PCWS115 
00123  01  PC115-PGBK-RTL-UPC-BC-TBL         REDEFINES                  PCWS115 
00124      PC115-PGBK-LM-FMT-UPC-BC.                                    PCWS115 
00125      05  PC115-PGBK-LM-FMT-UPC-BC-LINE OCCURS 15  TIMES           PCWS115 
00126                                        PIC X(15).                 PCWS115 
00127 *                                                                 PCWS115 
00128 *                                                                 PCWS115 
00129  01  PC115-PGBK-LM-FMT-UPC-HR.                                    PCWS115 
00130      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00131              '302200005340509'.                                   PCWS115 
00132      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00133              '302200005340371'.                                   PCWS115 
00134      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00135              '302200005340234'.                                   PCWS115 
00136      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00137              '302200006340509'.                                   PCWS115 
00138      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00139              '302200006340371'.                                   PCWS115 
00140      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00141              '302200006340234'.                                   PCWS115 
00142      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00143              '302200007310509'.                                   PCWS115 
00144      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00145              '302200007310371'.                                   PCWS115 
00146      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00147              '302200007310234'.                                   PCWS115 
00148      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00149              '302200008310509'.                                   PCWS115 
00150      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00151              '302200008310371'.                                   PCWS115 
00152      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00153              '302200008310234'.                                   PCWS115 
00154      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00155              '302200009310509'.                                   PCWS115 
00156      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00157              '302200009310371'.                                   PCWS115 
00158      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00159              '302200009310234'.                                   PCWS115 
00160 *                                                                 PCWS115 
00161  01  PC115-PGBK-LM-FMT-UPC-HR-TBL      REDEFINES                  PCWS115 
00162      PC115-PGBK-LM-FMT-UPC-HR.                                    PCWS115 
00163      05  PC115-PGBK-LM-FMT-UPC-HR-LINE OCCURS 15  TIMES           PCWS115 
00164                                        PIC X(15).                 PCWS115 
00165 *                                                                 PCWS115 
00166 *                                                                 PCWS115 
00167  01  PC115-PGBK-LM-FMT-RTL-PRICE.                                 PCWS115 
00168      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00169              '3911A1005550496'.                                   PCWS115 
00170      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00171              '3911A1005550359'.                                   PCWS115 
00172      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00173              '3911A1005550221'.                                   PCWS115 
00174      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00175              '3911A1006550496'.                                   PCWS115 
00176      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00177              '3911A1006550359'.                                   PCWS115 
00178      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00179              '3911A1006550221'.                                   PCWS115 
00180      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00181              '3911A1007530496'.                                   PCWS115 
00182      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00183              '3911A1007530359'.                                   PCWS115 
00184      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00185              '3911A1007530221'.                                   PCWS115 
00186      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00187              '3911A1008530496'.                                   PCWS115 
00188      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00189              '3911A1008530359'.                                   PCWS115 
00190      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00191              '3911A1008530221'.                                   PCWS115 
00192      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00193              '3911A1009530496'.                                   PCWS115 
00194      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00195              '3911A1009530359'.                                   PCWS115 
00196      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00197              '3911A1009530221'.                                   PCWS115 
00198 *                                                                 PCWS115 
00199  01  PC115-PGBK-LM-FMT-RTL-PR-TBL      REDEFINES                  PCWS115 
00200      PC115-PGBK-LM-FMT-RTL-PRICE.                                 PCWS115 
00201      05  PC115-PGBK-LM-FMT-RTL-PR-LINE OCCURS 15  TIMES           PCWS115 
00202                                        PIC X(15).                 PCWS115 
00203 *                                                                 PCWS115 
00204 *                                                                 PCWS115 
00205  01  PC115-PGBK-LM-FMT-VOID.                                      PCWS115 
00206      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00207              '324400005360501'.                                   PCWS115 
00208      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00209              '324400005360363'.                                   PCWS115 
00210      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00211              '324400005360226'.                                   PCWS115 
00212      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00213              '324400006360501'.                                   PCWS115 
00214      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00215              '324400006360363'.                                   PCWS115 
00216      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00217              '324400006360226'.                                   PCWS115 
00218      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00219              '324400007360501'.                                   PCWS115 
00220      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00221              '324400007360363'.                                   PCWS115 
00222      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00223              '324400007360226'.                                   PCWS115 
00224      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00225              '324400008360501'.                                   PCWS115 
00226      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00227              '324400008360363'.                                   PCWS115 
00228      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00229              '324400008360226'.                                   PCWS115 
00230      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00231              '324400009330501'.                                   PCWS115 
00232      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00233              '324400009330363'.                                   PCWS115 
00234      05  FILLER                        PIC X(15)    VALUE         PCWS115 
00235              '324400009330226'.                                   PCWS115 
00236 *                                                                 PCWS115 
00237  01  PC115-PGBK-LM-FMT-VOID-TBL        REDEFINES                  PCWS115 
00238      PC115-PGBK-LM-FMT-VOID.                                      PCWS115 
00239      05  PC115-PGBK-LM-FMT-VOID-LINE   OCCURS 15  TIMES           PCWS115 
00240                                        PIC X(15).                 PCWS115 
