000100***************************************************************** 00010000
000200* PCWS178 - LABEL FORM RECORD - CHECK-IN SML USING 128 DATA     * 00020000
000210*                               INFO LABEL - NO BARCODE         * 00021000
000220*                                                               * 00022000
000230*  this is the layout for the FORM for the SML label used in    * 00023000
000240*  the check-in application when a batch printer is selected    * 00024000
000250*                                                               * 00025000
000260* IT MUST BE PRECEED THE DATA RECORDS DESCRIBED IN PCWS179.     * 00026000
000270*                                                               * 00027000
000280*  IMPORTANT - If line lengths change be sure to update length  * 00028000
000290*              in PC178-DTL-LBL-FORM-LENGTH                     * 00029000
000300*              ALSO if lines are added                          * 00030000
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040000
000500*                    I M P O R T A N T                          * 00050000
000600* The label commands are strung together under only 7-05 levels * 00060000
000700* Each label command is separated by an end Mf text char-hex 03 * 00070000
000800* This was done to try to speed up transmission via new socket  * 00080000
000900* interface.  Systec's software separates 05 levels into        * 00090000
001000* statements.  The maximum length is 240.                       * 00100000
001100***************************************************************** 00110000
001200 01  PC178-SML-BATCH-LBL-MAX-LN      PIC 9(03)    VALUE  08.      00120000
001300***                                                               00130000
001400***    NUMBER OF 05 LEVELS ------------------------------/\       00140000
001500***                                                               00150000
001600***    THIS NUMBER MUST MATCH THE NUMBER IN THE "OCCURS"          00160000
001700***    CLAUSE FOUND AT THE BOTTOM OF THIS COPYBOOK                00170000
001800***                                                               00180000
001900*-----------------------------------------------------------------00190000
002000***************************************************************** 00200000
002100 01  PC178-SML-BATCH-LBL.                                         00210000
002200***  LINE 1                                                       00220000
002300* c0000 - Continuous paper length - 0000 = normal operation       00230000
002400     05  FILLER.                                                  00240000
002500         10  FILLER                  PIC X(06)    VALUE           00250000
002600             'c0000'.                                            00260000
002700         10  FILLER                  PIC X(01)    VALUE  ''.     00270000
002800* e     - Select edge sensor - DEFAULT                            00280000
002900         10  FILLER                  PIC X(02)    VALUE           00290000
003000             'e'.                                                00300000
003100         10  FILLER                  PIC X(01)    VALUE  ''.     00310000
003200* M1030 - Maximum label length                                    00320000
003300         10  FILLER                  PIC X(06)    VALUE           00330000
003400             'M1030'.                                            00340000
003500         10  FILLER                  PIC X(01)    VALUE  ''.     00350000
003600*  Replaced a command with KcFMN to disable the feedback char     00360003
003700*  dmh 8/9/17                                                     00370003
003800* KcFMN - disable feedback characters to be transmitted (6)       00380003
003810         10  FILLER                  PIC X(06)    VALUE           00381003
003820             'KcFMN'.                                            00382003
003900         10  FILLER                  PIC X(01)    VALUE  ''.     00390000
004000* s     - Set up for 1 dot buffer                                 00400000
004100         10  FILLER                  PIC X(02)    VALUE           00410000
004200             's'.                                                00420000
004300         10  FILLER                  PIC X(01)    VALUE  ''.     00430000
004400* O0110 - Set form edge offset - 0110 = zero setting              00440000
004500         10  FILLER                  PIC X(06)    VALUE           00450000
004600             'O0110'.                                            00460000
004700         10  FILLER                  PIC X(01)    VALUE  ''.     00470000
004800* qA    - Clear memory module - A=upper slot                      00480000
004900         10  FILLER                  PIC X(03)    VALUE           00490000
005000             'qA'.                                               00500000
005100         10  FILLER                  PIC X(01)    VALUE  ''.     00510000
005200* L     - enter label formatting command input mode               00520000
005300         10  FILLER                    PIC X(02)    VALUE         00530000
005400             'L'.                                                00540000
005500         10  FILLER                    PIC X(01)    VALUE  ''.   00550000
005600* D11   - Set dot size - Horizontal(1) Vertical(1)                00560000
005700         10  FILLER                  PIC X(03)    VALUE           00570000
005800             'D11'.                                               00580000
005900         10  FILLER                  PIC X(01)    VALUE  ''.     00590000
006000* H     - Heat setting for label                                  00600000
006100         10  FILLER                  PIC X(03)    VALUE           00610000
006200             'H11'.                                               00620000
006300         10  FILLER                  PIC X(01)    VALUE  ''.     00630000
006400* PK    - Max speed for print cycle - K=default (6 in.per sec)    00640000
006500         10  FILLER                  PIC X(02)    VALUE           00650000
006600             'PK'.                                                00660000
006700         10  FILLER                  PIC X(01)    VALUE  ''.     00670000
006800* SK    - Max slew rate speed - K= default (6 in.per sec)         00680000
006900         10  FILLER                  PIC X(02)    VALUE           00690000
007000             'SK'.                                                00700000
007100         10  FILLER                  PIC X(01)    VALUE  ''.     00710000
007200         10  FILLER                  PIC X(185)   VALUE SPACES.   00720003
007300*                                                                 00730000
007400*** LINE 2                                                        00740000
007500*                                                                 00750000
007600     05  FILLER.                                                  00760000
007700* CRTN: - heading line                                            00770000
007800         10  FILLER                  PIC X(20)    VALUE           00780000
007900             '341100600230390CRTN:'.                              00790000
008000         10  FILLER                  PIC X(01)    VALUE  ''.     00800000
008100* CRTN: - data line                                               00810000
008200         10  FILLER                  PIC X(15)    VALUE           00820000
008300             '342100600230340'.                                   00830000
008400         10  PC178-CARTON-ID         PIC X(05)    VALUE  ZEROS.   00840000
008500         10  FILLER                  PIC X(01)    VALUE  ''.     00850000
008600* PO/RCVR - heading line                                          00860000
008700         10  FILLER                  PIC X(23)    VALUE           00870000
008800             '331100400480390PO-RCVR:'.                           00880000
008900         10  FILLER                  PIC X(01)    VALUE  ''.     00890000
009000* PO/RCVR - data line                                             00900000
009100         10  FILLER                  PIC X(15)    VALUE           00910000
009200             '331100400480320'.                                   00920000
009300         10  PC178-PO-RCVR-NBR       PIC X(12)    VALUE           00930000
009400             'XXXXXXXXXXXX'.                                      00940000
009500         10  FILLER                  PIC X(01)    VALUE  ''.     00950000
009600* LINE & PACK ID - heading line                                   00960000
009700         10  FILLER                  PIC X(15)    VALUE           00970000
009800             '331100400640390'.                                   00980000
009900         10  PC178-LNE-PCK-HDG       PIC X(08)    VALUE SPACES.   00990000
010000         10  FILLER                  PIC X(01)    VALUE  ''.     01000000
010100* LINE - data line                                                01010000
010200         10  FILLER                  PIC X(15)    VALUE           01020000
010300             '331100400640320'.                                   01030000
010400         10  PC178-PO-LNE-NBR        PIC 9(04)    VALUE  ZEROES.  01040000
010500         10  FILLER                  PIC X(01)    VALUE  ''.     01050000
010600* SKU: - heading line                                             01060000
010700         10  FILLER                  PIC X(19)    VALUE           01070000
010800             '331100400800390SKU:'.                               01080000
010900         10  FILLER                  PIC X(01)    VALUE  ''.     01090000
011000* SKU: - data line                                                01100000
011100         10  FILLER                  PIC X(15)    VALUE           01110000
011200             '331100400800320'.                                   01120000
011300         10  PC178-SKU-NBR           PIC X(16)    VALUE           01130000
011400             '(999-99)99999999'.                                  01140000
011500         10  FILLER                  PIC X(01)    VALUE  ''.     01150000
011600* STYLE: - heading line                                           01160000
011700         10  FILLER                  PIC X(21)    VALUE           01170000
011800             '331100400960390STYLE:'.                             01180000
011900         10  FILLER                  PIC X(01)    VALUE  ''.     01190000
012000         10  FILLER                  PIC X(28)    VALUE SPACES.   01200000
012100*                                                                 01210000
012200*** LINE 3                                                        01220000
012300*                                                                 01230000
012400     05  FILLER.                                                  01240000
012500* STYLE: - data line                                              01250000
012600         10  FILLER                  PIC X(15)    VALUE           01260000
012700             '331100400960320'.                                   01270000
012800         10  PC178-STYLE             PIC X(20)    VALUE           01280000
012900             'XXXXXXXXXXXXXXXXXXXX'.                              01290000
013000         10  FILLER                  PIC X(01)    VALUE  ''.     01300000
013100* OUTER PK UNTS: - heading Line                                   01310000
013200         10  PC178-OUTPK-UNTS-HDG    PIC X(29).                   01320000
013300         10  FILLER                  PIC X(01)    VALUE  ''.     01330000
013400* OUTER PK UNTS: - data Line                                      01340000
013500         10  FILLER                  PIC X(15)    VALUE           01350000
013600             '331100401120250'.                                   01360000
013700         10  PC178-OUTPK-UNTS        PIC 9(04)    VALUE  ZEROES.  01370000
013800         10  FILLER                  PIC X(01)    VALUE  ''.     01380000
013900* UNITS IN PACK - heading line                                    01390000
014000         10  FILLER                  PIC X(15)    VALUE           01400000
014100             '331100401280390'.                                   01410000
014200         10  PC178-PCK-UNTS-HDG      PIC X(14)    VALUE  SPACES.  01420000
014300         10  FILLER                  PIC X(01)    VALUE  ''.     01430000
014400* UNITS IN PACK - data Line                                       01440000
014500         10  FILLER                  PIC X(15)    VALUE           01450000
014600             '331100401280250'.                                   01460000
014700         10  PC178-PCK-UNTS          PIC X(04)    VALUE  '@@@@'.  01470000
014800         10  FILLER                  PIC X(01)    VALUE  ''.     01480000
014900* PACKS IN OUTER - HEADING LINE                                   01490000
015000         10  FILLER                  PIC X(15)    VALUE           01500000
015100             '331100401440390'.                                   01510000
015200         10  PC178-PKINOT-UNTS-HDG   PIC X(16)    VALUE  SPACES.  01520000
015300         10  FILLER                  PIC X(01)    VALUE  ''.     01530000
015400* PACKS IN OUTER- data Line                                       01540000
015500         10  FILLER                  PIC X(15)    VALUE           01550000
015600             '331100401440250'.                                   01560000
015700         10  PC178-PKINOUT-UNTS      PIC X(04)    VALUE  ZEROES.  01570000
015800         10  FILLER                  PIC X(01)    VALUE  ''.     01580000
016500         10  FILLER                  PIC X(52)    VALUE  SPACES.  01650000
016600*                                                                 01660000
016700*** LINE 4                                                        01670000
016800*                                                                 01680000
016900     05  FILLER.                                                  01690000
016910* DEPARTMENT/MAJOR CLASS DESCRIPTION (TOP LINE INSIDE OF BOX)     01691001
016920         10  FILLER                  PIC X(15)    VALUE           01692000
016930             '341100402450390'.                                   01693000
016940         10  PC178-DEPT-NAME         PIC X(35)    VALUE           01694000
016950           'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.                 01695002
016960         10  FILLER                  PIC X(01)    VALUE  ''.     01696000
017000* STORE ON HAND ZERO MESSAGE (2ND LINE INSIDE OF BOX)             01700001
017100         10  FILLER                  PIC X(15)    VALUE           01710000
017200             '341100402650390'.                                   01720000
017300         10  PC178-STR-ON-HAND       PIC X(35)    VALUE           01730002
017400           'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.                 01740002
017500         10  FILLER                  PIC X(01)    VALUE  ''.     01750000
017600* FIXTURE - heading       (3rd line inside of box)                01760000
017700         10  FILLER                  PIC X(23)    VALUE           01770000
017800             '331100401600390FIXTURE:'.                           01780000
017900         10  FILLER                  PIC X(01)    VALUE  ''.     01790000
018000* FIXTURE - data          (3rd line inside of box)                01800000
018100         10  FILLER                  PIC X(15)    VALUE           01810000
018200             '331100401600320'.                                   01820000
018300         10  PC178-FIXTURE           PIC X(05)    VALUE  '@@@@@'. 01830000
018400         10  FILLER                  PIC X(01)    VALUE  ''.     01840000
018500* SEASONAL SET - heading  (3rd line inside of box)                01850000
018600         10  FILLER                  PIC X(19)    VALUE           01860000
018700             '331100401600270SET:'.                               01870000
018800         10  FILLER                  PIC X(01)    VALUE  ''.     01880000
018900* SEASONAL SET - data     (3rd line inside of box)                01890000
019000         10  FILLER                  PIC X(15)    VALUE           01900000
019100             '331100401600230'.                                   01910000
019200         10  PC178-SET               PIC X(25)    VALUE           01920000
019300           '@@@@@@@@@@@@@@@@@@@@@@@@@'.                           01930000
019400         10  FILLER                  PIC X(01)    VALUE  ''.     01940000
020100         10  FILLER                  PIC X(32)    VALUE  SPACES.  02010000
020200*                                                                 02020000
020300*** LINE 5                                                        02030000
020400*                                                                 02040000
020500     05  FILLER.                                                  02050000
020510* ERROR MESSAGE 1 - line                                          02051000
020520         10  FILLER                  PIC X(15)    VALUE           02052000
020530             '341100402010390'.                                   02053000
020540         10  PC178-ERROR-MSG-1       PIC X(35)    VALUE           02054000
020550             'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.               02055000
020560         10  FILLER                  PIC X(01)    VALUE  ''.     02056000
020600* ERROR MESSAGE 2 - line                                          02060000
020700         10  FILLER                  PIC X(15)    VALUE           02070000
020800             '341100402210390'.                                   02080000
020801         10  PC178-ERROR-MSG-2       PIC X(35)    VALUE           02080100
020802             'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.               02080200
020803         10  FILLER                  PIC X(01)    VALUE  ''.     02080300
020804* TRIP ID - HEADING                                               02080400
020805         10  FILLER                  PIC X(23)    VALUE           02080500
020806             '331100402850390TRIP ID:'.                           02080600
020807         10  FILLER                  PIC X(01)    VALUE  ''.     02080700
020808* TRIP ID - DATA                                                  02080800
020809         10  FILLER                  PIC X(15)    VALUE           02080900
020810             '331100402850320'.                                   02081000
020811         10  PC178-TRIP-ID           PIC X(09)    VALUE SPACES.   02081100
020812                                                                  02081200
020813         10  FILLER                  PIC X(01)    VALUE  ''.     02081300
020814         10  FILLER                  PIC X(89)    VALUE  SPACES.  02081400
020815*                                                                 02081500
020816*** LINE 6                                                        02081600
020817*                                                                 02081700
020818     05  FILLER.                                                  02081800
020819* 8 Character information message                                 02081900
020820         10  FILLER                  PIC X(15)    VALUE           02082000
020821             '335501003700380'.                                   02082100
020822         10  filler                  PIC X(09)    VALUE           02082200
020823           '@@@@@@@@@'.                                           02082300
020824         10  FILLER                  PIC X(01)    VALUE  ''.     02082400
020825* Userid - above barcode                                          02082500
020826         10  FILLER                  PIC X(15)    VALUE           02082600
020827             '302200002780080'.                                   02082700
020828         10  PC178-USER-ID           PIC X(07)    VALUE SPACES.   02082800
020829         10  FILLER                  PIC X(01)    VALUE  ''.     02082900
020830* PRINTER # - line                                                02083000
020840         10  FILLER                  PIC X(22)    VALUE           02084000
020850             '302200003910390PRTR #'.                             02085000
020860         10  PC178-SML-PRTR-NBR      PIC X(06)    VALUE           02086000
020870             'DC-XXX'.                                            02087000
020880         10  FILLER                  PIC X(01)    VALUE  ''.     02088000
020890**  LABEL # OF FIELD                                              02089000
020900         10  FILLER                    PIC X(15)  VALUE           02090000
021000             '302200003910285'.                                   02100000
021100         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  02110000
021200         10  FILLER                    PIC X(01)  VALUE  ''.     02120000
021300**  "OF" LITERAL ALONG SIDE OF LABEL                              02130000
021400         10  FILLER                    PIC X(15)  VALUE           02140000
021500             '302200003910257'.                                   02150000
021600         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  02160000
021700         10  FILLER                    PIC X(01)  VALUE  ''.     02170000
021800**  TOTAL LABEL COUNT                                             02180000
021900         10  FILLER                    PIC X(15)  VALUE           02190000
022000             '302200003910232'.                                   02200000
022100         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  02210000
022200         10  FILLER                    PIC X(01)  VALUE  ''.     02220000
022300*  label print date                                               02230000
022400         10  FILLER                    PIC X(15)  VALUE           02240000
022500             '302200003910180'.                                   02250000
022600         10  PC178-LBL-PRT-DATE        PIC X(08)  VALUE           02260000
022700             '@@@@@@@@'.                                          02270000
022800         10  FILLER                    PIC X(01)  VALUE  ''.     02280000
022900*  label print time                                               02290000
023000         10  FILLER                    PIC X(15)  VALUE           02300000
023100             '302200003910125'.                                   02310000
023200         10  PC178-LBL-PRT-TIME        PIC X(05)  VALUE           02320000
023300             '@@@@@'.                                             02330000
023400         10  FILLER                    PIC X(01)  VALUE  ''.     02340000
023500* Shipping Manifest Label - Description line                      02350000
023600         10  FILLER                  PIC X(15)    VALUE           02360000
023700             '302200003910080'.                                   02370000
023800         10  PC178-LABEL-INFO        PIC X(12)    VALUE           02380000
023900             'CH-SML INFO '.                                      02390000
024000         10  FILLER                  PIC X(01)    VALUE  ''.     02400000
024100         10  FILLER                  PIC X(30)    VALUE SPACES.   02410000
024200*                                                                 02420000
024300*** LINE 7                                                        02430000
024400*                                                                 02440000
024500     05  FILLER.                                                  02450000
024510*                                                                 02451000
024520*  store name                                                     02452000
024530*                                                                 02453000
024540         10  FILLER                  PIC X(15)    VALUE           02454000
024550             '331100400230110'.                                   02455000
024560         10  FILLER                  PIC X(10)    VALUE           02456000
024570             '@@@@@@@@@@'.                                        02457000
024580         10  FILLER                  PIC X(01)    VALUE  ''.     02458000
024590******************************************************************02459000
024591*   program  should either move the following to PC178-store-nbr *02459100
024592*   -box if nothing is to be printed                             *02459200
024593*            ''331201001540125'                                   02459300
024594*   or it should move the following to print the store number    *02459400
024595*             '391201001540162'                                  *02459500
024596******************************************************************02459600
024597*  store number                                                   02459700
024598         10  PC178-STORE-NBR         PIC X(19).                   02459800
024599         10  FILLER                  PIC X(01)    VALUE  ''.     02459900
024600******************************************************************02460000
024700*   program  should either move the following to PC178-inpk-convyx02470000
024800*   -box if nothing is to be printed                             *02480000
024900*            '1X1100000970215L000000'                            *02490000
025000*   or it should move the following to print a black box         *02500000
025100*            '1X1100000970215L178017'.                           *02510000
025200******************************************************************02520000
025300* inpk cnvy - BOX                                                 02530000
025400         10  PC178-inpk-convy-box    PIC X(22).                   02540000
025500         10  FILLER                  PIC X(01)    VALUE  ''.     02550000
025600******************************************************************02560000
025700* REPRINT box                                                     02570000
025800*   program  should either move the following to PC178-reprint-box02580000
025900*   if nothing is to be printed                                  *02590000
026000*            '1X1100000040139L000000'                            *02600000
026100*   or it should move the following to print a black box         *02610000
026200*            '1X1100000040139L070017'                            *02620000
026300******************************************************************02630000
026400         10  PC178-reprint-box       PIC X(22).                   02640000
026500         10  FILLER                  PIC X(01)    VALUE  ''.     02650000
026600******************************************************************02660000
026700* REPRINT field                                                   02670000
026800*   program  should either move the following to PC178-reprint-tex02680000
026900*   if nothing is to be printed                                  *02690000
027000*            '331100000200200@@@@@@@'.                           *02700000
027100*   or it should move one of the following if reprint should be  *02710000
027200*   printed                                                      *02720000
027300*            '331100000200200REPRINT'                            *02730000
027400******************************************************************02740000
027500         10  PC178-reprint-text      PIC X(22).                   02750000
027600         10  FILLER                  PIC X(01)    VALUE  ''.     02760000
027700* box around department & major class name                        02770000
027800         10  FILLER                  PIC X(28)    VALUE           02780000
027900             '1X1100002230030B365043001001'.                      02790000
028000         10  FILLER                  PIC X(01)    VALUE  ''.     02800000
028100         10  FILLER                  PIC X(96)    VALUE  SPACES.  02810000
028200*                                                                 02820000
028300*** LINE 8                                                        02830000
028400*                                                                 02840000
028700     05  FILLER.                                                  02870000
028800* store number pos 1 - underline                                  02880000
028900         10  FILLER                  PIC X(22)    VALUE SPACES.   02890000
029000             88 PC178-STR-LNE-1-YES VALUE                         02900000
029010                                    '1X1100001300130L035001'.     02901000
029020             88 PC178-STR-LNE-1-NO  VALUE                         02902000
029030                                    '1X1100001300130L000000'.     02903000
029040         10  FILLER                  PIC X(01)    VALUE  ''.     02904000
029050* store number pos 2 - underline                                  02905000
029060         10  FILLER                  PIC X(22)    VALUE SPACES.   02906000
029070             88 PC178-STR-LNE-2-YES VALUE                         02907000
029080                                    '1X1100001300090L035001'.     02908000
029090             88 PC178-STR-LNE-2-NO  VALUE                         02909000
029091                                    '1X1100001300090L000000'.     02909100
029092         10  FILLER                  PIC X(01)    VALUE  ''.     02909200
029093* store number pos 3 - underline                                  02909300
029094         10  FILLER                  PIC X(22)    VALUE spaces.   02909400
029095             88 PC178-STR-LNE-3-YES VALUE                         02909500
029096                                    '1X1100001300055L030001'.     02909600
029097             88 PC178-STR-LNE-3-NO  VALUE                         02909700
029098                                    '1X1100001300055L000000'.     02909800
029099         10  FILLER                  PIC X(01)    VALUE  ''.     02909900
029100* store number pos 4 - underline                                  02910000
029101         10  FILLER                  PIC X(22)    VALUE SPACES.   02910100
029102             88 PC178-STR-LNE-4-YES VALUE                         02910200
029103                                     '1X1100001300020L030001'.    02910300
029104             88 PC178-STR-LNE-4-NO  VALUE                         02910400
029105                                     '1X1100001300020L000000'.    02910500
029106         10  FILLER                  PIC X(01)    VALUE  ''.     02910600
029107* reverse image - STORE ON HAND ZERO - 2nd line in box            02910700
029108         10  FILLER                PIC X(22)      VALUE SPACES.   02910800
029109             88 PC178-OH-ZERO-YES  VALUE '1X1100002180036L360020'.02910900
029110             88 PC178-OH-ZERO-NO   VALUE '1X1100002180036L000000'.02911000
029111         10  FILLER                  PIC X(01)    VALUE  ''.     02911100
029112* X     - Terminate field generation                              02911200
029113         10  FILLER                  PIC X(02)    VALUE           02911300
029114             'X '.                                                02911400
029115         10  FILLER                  PIC X(01)    VALUE  ''.     02911500
029116         10  FILLER                  PIC X(122)   VALUE  SPACES.  02911600
029120*                                                                 02912000
029130 01  PC178-SHIP-MFST-LBL-TABLE       REDEFINES                    02913000
029140     PC178-SML-BATCH-LBL.                                         02914000
029150     05  PC178-SHIP-MFST-LBL-LINE    OCCURS 8 TIMES               02915000
029160                                     INDEXED BY PC178-IDX         02916000
029170                                     PIC X(240).                  02917000
029180*----------------------------------------------------------------*02918000
029190* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *02919000
029200*----------------------------------------------------------------*02920000
029300 01  PC178-DTL-LBL-FORM-LENGTH.                                   02930000
029400     05  FILLER                        PIC 9(03)    VALUE   55.   02940003
029500     05  FILLER                        PIC 9(03)    VALUE  212.   02950000
029600     05  FILLER                        PIC 9(03)    VALUE  188.   02960000
029700     05  FILLER                        PIC 9(03)    VALUE  208.   02970000
029800     05  FILLER                        PIC 9(03)    VALUE  151.   02980000
029900     05  FILLER                        PIC 9(03)    VALUE  210.   02990000
030000     05  FILLER                        PIC 9(03)    VALUE  144.   03000000
030100     05  FILLER                        PIC 9(03)    VALUE  118.   03010000
030200 01  PC178-DTL-LBL-FORM-LNGTH-VALUE REDEFINES                     03020000
030300         PC178-DTL-LBL-FORM-LENGTH.                               03030000
030400     05  PC178-DTL-FORM-LNE-LNGTH     OCCURS 8 TIMES              03040000
030500                                      INDEXED BY PC178-IDX-2      03050000
030600                                      PIC 9(03).                  03060000
030700                                                                  03070000
030800 01  PC178-LABEL-WORK-FIELDS.                                     03080000
030900     05  PC178-LABEL-INFO-WORK        PIC X(12).                  03090000
031000     05  PC178-LABEL-INFO-WORK-R REDEFINES PC178-LABEL-INFO-WORK. 03100000
031100         10  PC178-FROM-APPLICATION   PIC X(02).                  03110000
031200         10  PC178-LBL-DESC           PIC X(05).                  03120000
031300         10  PC178-PRTR-ATTACHED      PIC X(05).                  03130000
031400*----------------------------------------------------------------*03140000
031500* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                    *03150000
031600*----------------------------------------------------------------*03160000
031700 01  PC178-LABEL-ALLOCATIONS.                                     03170000
031800     05  PC178-FORM-REPRT-BOX      PIC X(22)   VALUE              03180000
031900*                                  '1X1100000970215L000000'.      03190000
032000                                   '1X1100000040139L070017'.      03200000
032100     05  PC178-FORM-REPRT-FLD      PIC X(22)   VALUE              03210000
032200                                   '331100000200200REPRINT'.      03220000
032300     05  PC178-FORM-NO-RPRT-FLD    PIC X(22)   VALUE              03230000
032400                                   '331100000200200@@@@@@@'.      03240000
032500     05  PC178-FORM-NO-RPRT-BOX    PIC X(22)   VALUE              03250000
032600                                   '1X1100000040139L000000'.      03260000
032700     05  PC178-FORM-INPK-BOX       PIC X(22)   VALUE              03270000
032800                                   '1X1100000970215L178017'.      03280000
032900     05  PC178-FORM-INPK-HDG       PIC X(32)   VALUE              03290000
033000                                '331100401120390INPK CNVY UNTS: '.03300000
033100     05  PC178-FORM-NO-INPK-BOX    PIC X(22)   VALUE              03310000
033200                                   '1X1100000970215L000000'.      03320000
033300     05  PC178-FORM-OTPK-HDG       PIC X(32)   VALUE              03330000
033400                                 '331100401120390OUTER PK UNTS: '.03340000
033500     05  PC178-FORM-PRT-STORE      PIC X(19)   VALUE              03350000
033600                                   '391201001540162@@@@'.         03360000
033700     05  PC178-FORM-NO-STORE       PIC X(19)   VALUE              03370000
033800                                   '331201001540125@@@@'.         03380000
033900     05  PC178-FORM-REVRSE-ONHD    PIC X(22)   VALUE              03390000
034000                                   '1X1100002180036L360020'.      03400000
034100     05  PC178-FORM-NO-REVRSE-ONHD PIC X(22)   VALUE              03410000
034200                                   '1X1100002180036L000000'.      03420000
