000001******************************************************************        
000002*  PCWS037                                                       *        
000003******************************************************************        
000010* USED BY PCPD037 TO CALCULATE THE CHECK DIGIT FOR A FAST NUMBER          
000020******************************************************************        
000100 01  PC037-CHECK-DIGIT-FIELDS.                                            
000200     05  PC037-XFER-NBR.                                                  
000300         10  PC037-XFER-FROM-STORE-NBR   PIC 9(05).                       
000400         10  PC037-XFER-SEQ-NBR          PIC 9(06).                       
000500     05  FILLER  REDEFINES  PC037-XFER-NBR.                               
000600         10  PC037-XFER-DIGIT            OCCURS 11 TIMES                  
000700                                         INDEXED BY                       
000800                                         PC037-XFER-IDX                   
000900                                         PIC  9(01).                      
001000     05  PC037-CHK-DIGIT                 PIC  9(01)  VALUE ZEROS.         
001100     05  PC037-DBL-DIGIT                 PIC  9(02)  VALUE ZEROS.         
001200     05  PC037-DIGIT-SUM                 PIC  9(02)  VALUE ZEROS.         
001300     05  PC037-IDX-VALUE                 PIC  9(01)  VALUE ZEROS.         
001400     05  PC037-QUOTIENT                  PIC  9(01)  VALUE ZEROS.         
001500     05  PC037-REMAINDER                 PIC  9(01)  VALUE ZEROS.         
001600     05  PC037-FAST-DATA.                                                 
001700         10  PC037-FAST-XFER-NBR         PIC X(11).                       
001800         10  PC037-FAST-CHECK-DIGIT      PIC X(01).                       
