000100*----------------------------------------------------------------*00010000
000200*                         PCWS260                                *00020000
000300*                                                                *00030000
000400*   THIS IS THE COMMAREA LAYOUT TO BE USED TO PASS INFORMATION   *00040000
000500*   INTO THE UNITS WORKED PROCESSING MODULE - PROGRAM PCKUT790.  *00050000
000600*                                                                *00060000
000700*   LENGTH OF LAYOUT:  250                                       *00070000
000800*                                                                *00080000
000900*----------------------------------------------------------------*00090000
001000                                                                  00100000
001100 01  PC260-COMM-AREA.                                             00110000
001200     05  PC260-REQUEST-DATA.                                      00120000
002700         10  PC260-SHIPT-UNT-ID             PIC S9(18)V   COMP-3. 00270000
002800         10  PC260-OPER-UNT-ID              PIC S9(04)    COMP.   00280000
002900         10  PC260-PRCG-AREA-CDE            PIC  X(6).            00290000
002910         10  PC260-TRANS-TYPE-CDE           PIC  X(1).            00291000
002920             88  PC260-TRANS-CONFIRM-ADJ    VALUE 'A'.            00292000
002930             88  PC260-TRANS-VERIFY-ADJ     VALUE 'B'.            00293000
002940             88  PC260-TRANS-CONFIRM        VALUE 'C'.            00294000
002950             88  PC260-TRANS-POST-VRFY-ADJ  VALUE 'D'.            00295000
002960             88  PC260-TRANS-P2L-UPLOAD     VALUE 'P'.            00296000
002970             88  PC260-TRANS-UNCONFIRM      VALUE 'U'.            00297000
002980             88  PC260-TRANS-LINE-VERIFY    VALUE 'V'.            00298000
002990             88  PC260-TRANS-RCVR-VERIFY    VALUE 'W'.            00299000
002991             88  PC260-TRANS-LINE-UNVERIFY  VALUE 'X'.            00299100
002992             88  PC260-TRANS-RCVR-UNVERIFY  VALUE 'Y'.            00299200
002993             88  PC260-TRANS-GET-DAY-SHIFT  VALUE 'Z'.            00299300
003000         10  FILLER                         PIC  X(23).           00300000
003100                                                                  00310000
003200     05  PC260-RETURN-DATA.                                       00320000
003300         10  PC260-MOD-SUCCESS-CDE          PIC  X(1).            00330000
003400             88  PC260-MOD-SUCCESSFUL       VALUE 'A'.            00340000
003500             88  PC260-MOD-UNSUCCESSFUL     VALUE 'B'.            00350000
003600         10  PC260-UNSUCCESSFUL-CDE         PIC  X(02).           00360000
003700             88  PC260-MOD-BAD-TMST         VALUE 'AA'.           00370000
003800             88  PC260-MOD-BAD-OPER         VALUE 'BB'.           00380000
003900             88  PC260-MOD-BAD-TRANS-TYPE   VALUE 'CC'.           00390000
004000             88  PC260-MOD-DB-PROBLEM       VALUE 'DD'.           00400000
004100             88  PC260-MOD-BAD-PO           VALUE 'EE'.           00410000
004200             88  PC260-MOD-BAD-RCVR         VALUE 'FF'.           00420000
004300             88  PC260-MOD-BAD-LINE         VALUE 'GG'.           00430000
004400             88  PC260-MOD-BAD-NO-SHIFT     VALUE 'HH'.           00440000
004500         10  PC260-BAD-SQL-CDE              PIC S9(4)     COMP.   00450000
004600         10  PC260-PARAGRAPH                PIC  X(30).           00460000
004611         10  PC260-MESSAGE-TEXT           PIC  X(80)  VALUE SPACE.00461100
004620         10  PC260-BAD-TABLE-NAME           PIC  X(18).           00462000
004700         10  PC260-BAD-TABLE-FUNCTION       PIC  X(6).            00470000
004800             88  PC260-DB2-FUNCTION-UPDATE  VALUE 'UPDATE'.       00480000
004900             88  PC260-DB2-FUNCTION-INSERT  VALUE 'INSERT'.       00490000
005000             88  PC260-DB2-FUNCTION-OPEN    VALUE 'OPEN  '.       00500000
005100             88  PC260-DB2-FUNCTION-CLOSE   VALUE 'CLOSE '.       00510000
005200             88  PC260-DB2-FUNCTION-FETCH   VALUE 'FETCH '.       00520000
005300             88  PC260-DB2-FUNCTION-SELECT  VALUE 'SELECT'.       00530000
006100     05  FILLER                             PIC  X(60).           00610000
006200 01  PC260-COMMAREA                   PIC X(01).                  00620000
006300 01  PC260-VSM-PGM                    PIC X(08) VALUE 'PCKUT790'. 00630000
