000001***************************************************************** 00000100
000002* PCWS167 - Central Stock Rack Label 12 character 3of9 barcode  * 00000201
000003*           (Barcode can be 10 w/ 2 spaces to the right)        * 00000301
000004* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00000400
000005*                    I M P O R T A N T                          * 00000500
000006* The label commands are strung together under only 4-05 levels * 00000600
000007* Each label command is separated by an end of text char-hex 03 * 00000700
000008* This was done to try to speed up transmission via new socket  * 00000800
000009* interface.  Systec's software separates 05 levels into        * 00000900
000010* statements.  The maximum length is 240.                       * 00001000
000011***************************************************************** 00001100
000012 01  PC167-CS-RACK-LBL-MAX-LN        PIC 9(03)    VALUE   4.      00001214
000013***                                                               00001300
000014***    NUMBER OF 05 LEVELS ------------------------------/\       00001400
000015***                                                               00001500
000016***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00001600
000017***               IN PC167-RACK-FORM-LENGTH.                      00001701
000018***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00001800
000019***                                                               00001900
000020***************************************************************** 00002000
000021 01  PC167-CS-RACK-LBL.                                           00002101
000022*                                                                 00002200
000023*** label information - line 1                                    00002300
000024*                                                                 00002400
000025     05  FILLER.                                                  00002500
000026* c0000 - Continuous paper length - 0000 = normal operation       00002600
000027         10  FILLER                  PIC X(06)    VALUE           00002700
000028             'c0000'.                                            00002800
000029         10  FILLER                  PIC X(01)    VALUE  ''.     00002900
000030* e     - Select edge sensor - DEFAULT                            00003000
000031         10  FILLER                  PIC X(02)    VALUE           00003100
000032             'e'.                                                00003200
000033         10  FILLER                  PIC X(01)    VALUE  ''.     00003300
000034* M1030 - Maximum label length                                    00003400
000035         10  FILLER                  PIC X(06)    VALUE           00003500
000036             'M1030'.                                            00003600
000037         10  FILLER                  PIC X(01)    VALUE  ''.     00003700
000038*  Replaced a command with KcFMN to disable the feedback char     00003821
000039*  dmh 8/9/17                                                     00003921
000040* KcFMN - disable feedback characters to be transmitted (6)       00004021
000041         10  FILLER                  PIC X(06)    VALUE           00004121
000042             'KcFMN'.                                            00004221
000043         10  FILLER                  PIC X(01)    VALUE  ''.     00004300
000044* s     - Set up for 1 dot buffer                                 00004400
000045         10  FILLER                  PIC X(02)    VALUE           00004500
000046             's'.                                                00004600
000047         10  FILLER                  PIC X(01)    VALUE  ''.     00004700
000048* O0110 - Set form edge offset - 0110 = zero setting              00004800
000049         10  FILLER                  PIC X(06)    VALUE           00004900
000050             'O0110'.                                            00005000
000051         10  FILLER                  PIC X(01)    VALUE  ''.     00005100
000052* qA    - Clear memory module - A=upper slot                      00005200
000053         10  FILLER                  PIC X(03)    VALUE           00005300
000054             'qA'.                                               00005400
000055         10  FILLER                  PIC X(01)    VALUE  ''.     00005500
000056* L     - enter label formatting command input mode               00005600
000057         10  FILLER                  PIC X(02)    VALUE           00005700
000058             'L'.                                                00005800
000059         10  FILLER                  PIC X(01)    VALUE  ''.     00005900
000060* D11   - Set dot size - Horizontal(1) Vertical(1)                00006000
000061         10  FILLER                  PIC X(03)    VALUE           00006100
000062             'D11'.                                               00006200
000063         10  FILLER                  PIC X(01)    VALUE  ''.     00006300
000064* H11   - Heat setting for label                                  00006400
000065         10  FILLER                  PIC X(03)    VALUE           00006500
000066             'H11'.                                               00006600
000067         10  FILLER                  PIC X(01)    VALUE  ''.     00006700
000068* PK    - Max speed for print cycle - K=default (6 in.per sec)    00006800
000069         10  FILLER                  PIC X(02)    VALUE           00006900
000070             'PK'.                                                00007000
000071         10  FILLER                  PIC X(01)    VALUE  ''.     00007100
000072* SK    - Max slew rate speed - K= default (6 in.per sec)         00007200
000073         10  FILLER                  PIC X(02)    VALUE           00007300
000074             'SK'.                                                00007400
000075         10  FILLER                  PIC X(01)    VALUE  ''.     00007500
000076         10  FILLER                  PIC X(185)   VALUE  SPACES.  00007621
000077*                                                                 00007700
000078*                                                                 00007800
000079*** label information - line 2                                    00007900
000080*                                                                 00008000
000090     05  FILLER.                                                  00009000
000095*  # above bar code (U01)                                         00009501
000096         10  FILLER                  PIC X(15)    VALUE           00009600
000097             '342500002500360'.                                   00009715
000098         10  FILLER                  PIC X(20)    VALUE  ALL '@'. 00009810
000099         10  FILLER                  PIC X(01)    VALUE  ''.     00009900
000100* 3 of 9 Barcode across bottom of label (U02)                     00010001
000110         10  FILLER                  PIC X(15)    VALUE           00011000
000111             '3a8209003500360'.                                   00011116
000112         10  FILLER                  PIC X(12)    VALUE  ALL 'X'. 00011217
000113         10  FILLER                  PIC X(01)    VALUE  ''.     00011310
000114         10  FILLER                  PIC X(176)   VALUE SPACES.   00011411
000115*                                                                 00011510
000116*                                                                 00011610
000117***** label information - line 3                                  00011710
000118*                                                                 00011810
000120* Printer # - line                                                00012000
000121     05  FILLER.                                                  00012107
000130         10  FILLER                  PIC X(21)    VALUE           00013000
000140             '302200003910385PRTR #'.                             00014016
000150         10  FILLER                  PIC X(01)    VALUE  ''.     00015000
000151* Printer # - field                                               00015100
000152         10  FILLER                  PIC X(15)    VALUE           00015200
000153             '302200003910345'.                                   00015316
000154         10  PC167-PRTR-NBR          PIC X(06)    VALUE           00015401
000155             'DC-307'.                                            00015500
000156         10  FILLER                  PIC X(01)    VALUE  ''.     00015600
000157* User ID                                                         00015700
000158         10  FILLER                  PIC X(15)    VALUE           00015800
000159             '302200003910290'.                                   00015900
000160         10  PC167-USER-ID           PIC X(08)    VALUE SPACES.   00016001
000161         10  FILLER                  PIC X(01)    VALUE  ''.     00016100
000162* label print date                                                00016200
000163         10  FILLER                  PIC X(15)    VALUE           00016300
000164             '302200003910220'.                                   00016416
000165         10  PC167-LBL-PRT-DATE      PIC X(08)    VALUE           00016501
000166             'MM-DD-YY'.                                          00016600
000167         10  FILLER                  PIC X(01)    VALUE  ''.     00016700
000168*  label print time                                               00016800
000169         10  FILLER                  PIC X(15)    VALUE           00016900
000170             '302200003910165'.                                   00017016
000171         10  PC167-LBL-PRT-TIME      PIC X(05)    VALUE           00017101
000172             'HH:MM'.                                             00017200
000173         10  FILLER                  PIC X(01)    VALUE  ''.     00017300
000174* label description line (U08)                                    00017400
000175         10  FILLER                  PIC X(15)    VALUE           00017500
000176             '302200003910120'.                                   00017616
000177         10  PC167-LBL-DESC          PIC X(11)    VALUE           00017701
000178             'CS-RACK LBL'.                                       00017801
000179         10  FILLER                  PIC X(01)    VALUE  ''.     00017900
000180* separater bar across center of label                            00018000
000190         10  FILLER                  PIC X(22)    VALUE           00019000
000200             '1X1100001250025L350003'.                            00020020
000300         10  FILLER                  PIC X(01)    VALUE  ''.     00030000
000310         10  FILLER                  PIC X(77)    VALUE  SPACES.  00031012
000320*                                                                 00032000
000330*                                                                 00033000
000340***** label information - line 4                                  00034007
000350*                                                                 00035000
000351*                                                                 00035100
000352*                                                                 00035200
000353* X     - Terminate field generation                              00035300
000354*                                                                 00035400
000355*                                                                 00035500
000356     05  FILLER.                                                  00035600
000357         10  FILLER                  PIC X(02)    VALUE           00035700
000358             'X '.                                                00035800
000359         10  FILLER                  PIC X(01)    VALUE  ''.     00035900
000360* qA    - Clear memory module - A=upper slot                      00036019
000361         10  FILLER                  PIC X(03)    VALUE           00036119
000362             'qA'.                                               00036219
000363         10  FILLER                  PIC X(01)    VALUE  ''.     00036319
000364         10  FILLER                  PIC X(233)   VALUE  SPACES.  00036419
000365                                                                  00036500
000366                                                                  00036600
000367 01  PC167-CS-RACK-LBL-TABLE         REDEFINES                    00036701
000368     PC167-CS-RACK-LBL.                                           00036801
000369     05  PC167-CS-RACK-LBL-LINE      OCCURS  4 TIMES              00036913
000370                                     INDEXED BY PC167-IDX         00037001
000371                                     PIC X(240).                  00037100
000372                                                                  00037200
000373*----------------------------------------------------------------*00037300
000374* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00037400
000375*----------------------------------------------------------------*00037500
000376 01  PC167-RACK-FORM-LENGTH.                                      00037601
000377     05  FILLER                        PIC 9(03)    VALUE   55.   00037721
000378     05  FILLER                        PIC 9(03)    VALUE   64.   00037810
000379     05  FILLER                        PIC 9(03)    VALUE  163.   00037912
000380     05  FILLER                        PIC 9(03)    VALUE    7.   00038019
000381                                                                  00038107
000382 01  PC167-RACK-FORM-LNGTH-VALUES REDEFINES                       00038207
000383                                  PC167-RACK-FORM-LENGTH.         00038307
000384     05  PC167-RACK-FORM-LINE-LENGTH  OCCURS 4 TIMES              00038413
000385                                      INDEXED BY PC167-IDX-2      00038507
000386                                      PIC 9(03).                  00038607
000387                                                                  00038707
