000100******************************************************************00010000
000200**                        PCWS213                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  UNITS WORKED CRIT SPEC SCREEN                                         
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
021300         10  PC213-INTER-APPL-COMMAREA  REDEFINES                 02130000
000900                                     INTER-APPL-COMM-AREA.        00090000
001000             15  FILLER                      PIC  X(01).                  
002200             15  PC213-OPER-UNT-ID           PIC S9(04) COMP.             
002200             15  PC213-CRNT-BUS-DTE          PIC  X(08).                  
002200             15  PC213-FROM-DATE             PIC  X(08).                  
002200             15  PC213-TO-DATE               PIC  X(08).                  
002200             15  PC213-FISCAL-WEEK           PIC  X(06).                  
002200             15  PC213-FISCAL-MONTH          PIC  X(06).                  
002200             15  PC213-PRINTER-ID            PIC  X(08).                  
002500             15  FILLER                      PIC X(153).                  
