000100***************************************************************** 00010000
000200* PCWS155 - USER LABEL FORM RECORD                              * 00020000
000300*                                                               * 00030000
000400*  This is the layout for the user   label form used in label   * 00040000
000500*  creation when sending to a batch printer using sockets.      * 00050000
000600* The label commands are strung together under only 3-05 levels * 00060000
000700* Each label command is separated by an end of text char-hex 03 * 00070000
000800* This was done to try to speed up transmission via new socket  * 00080000
000900* interface.  Systec's software separates 05 levels into        * 00090000
001000* statements.  The maximum length is 240.                       * 00100000
001100***************************************************************** 00110000
001200 01  PC155-USER-LABEL-FORM-MAX-LN PIC 9(03)    VALUE  03.         00120000
001300***                                                               00130000
001400***    NUMBER OF 05 LEVELS --------------------------------/\     00140000
001500***                                                               00150000
001600***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00160000
001700***               IN PC155-USR-LBL-LENGTH.                        00170000
001800***               ALSO IF LINES ARE ADDED BE SURE TO INCREASE THE 00180000
001900***               USER-LABEL-MAX-LN VALUE AND TABLE OCCURS.       00190000
002000***                                                               00200000
002100***                                                               00210000
002200*-----------------------------------------------------------------00220000
002300 01  PC155-USER-LABEL-FORM.                                       00230000
002400**************************************************************    00240000
002500*************  START OF 05-LEVEL  ****************************    00250000
002600**************************************************************    00260000
002700     05  FILLER.                                                  00270000
002800* c0000 - Continuous paper length - 0000 = normal operation       00280000
002900         10  FILLER                  PIC X(06)    VALUE           00290000
003000             'c0000'.                                            00300000
003100         10  FILLER                  PIC X(01)    VALUE  ''.     00310000
003200* e     - Select edge sensor - DEFAULT                            00320000
003300         10  FILLER                  PIC X(02)    VALUE           00330000
003400             'e'.                                                00340000
003500         10  FILLER                  PIC X(01)    VALUE  ''.     00350000
003600* M1125 - Maximum label length                                    00360000
003700         10  FILLER                  PIC X(06)    VALUE           00370000
003800             'M1125'.                                            00380000
003900         10  FILLER                  PIC X(01)    VALUE  ''.     00390000
004000*  Replaced a command with KcFMN to disable the feedback char     00400001
004100*  dmh 8/9/17                                                     00410001
004200* KcFMN - disable feedback characters to be transmitted (6)       00420001
004210         10  FILLER                    PIC X(06)    VALUE         00421001
004220             'KcFMN'.                                            00422001
004300         10  FILLER                  PIC X(01)    VALUE  ''.     00430000
004400* s     - Set up for 1 dot buffer                                 00440000
004500         10  FILLER                  PIC X(02)    VALUE           00450000
004600             's'.                                                00460000
004700         10  FILLER                  PIC X(01)    VALUE  ''.     00470000
004800* O0110 - Set form edge offset - 0110 = zero setting              00480000
004900         10  FILLER                  PIC X(06)    VALUE           00490000
005000             'O0110'.                                            00500000
005100         10  FILLER                  PIC X(01)    VALUE  ''.     00510000
005200* qA    - Clear memory module - A=upper slot                      00520000
005300         10  FILLER                  PIC X(03)    VALUE           00530000
005400             'qA'.                                               00540000
005500         10  FILLER                  PIC X(01)    VALUE  ''.     00550000
005600* L     - Enter label formatting command input mode               00560000
005700         10  FILLER                  PIC X(02)    VALUE           00570000
005800             'L'.                                                00580000
005900         10  FILLER                  PIC X(01)    VALUE  ''.     00590000
006000* D11   - Set dot size - Horizontal (1) Vertical (1)              00600000
006100         10  FILLER                  PIC X(03)    VALUE           00610000
006200             'D11'.                                               00620000
006300         10  FILLER                  PIC X(01)    VALUE  ''.     00630000
006400* PK    - Max speed for print cycle - K=default (6 in.per sec)    00640000
006500         10  FILLER                  PIC X(02)    VALUE           00650000
006600             'PK'.                                                00660000
006700         10  FILLER                  PIC X(01)    VALUE  ''.     00670000
006800* SK    - Max slew rate speed - K=default (6 in.per sec)          00680000
006900         10  FILLER                  PIC X(02)    VALUE           00690000
007000             'SK'.                                                00700000
007100         10  FILLER                  PIC X(01)    VALUE  ''.     00710000
007200         10  FILLER                  PIC X(189)   VALUE  SPACES.  00720001
007300**************************************************************    00730000
007400*************  START OF 05-LEVEL  ****************************    00740000
007500**************************************************************    00750000
007600     05  FILLER.                                                  00760000
007700*CICS BC: LINE - HEADER                                           00770000
007800         10  FILLER                  PIC X(15)    VALUE           00780000
007900             '3a5203500500366'.                                   00790000
008000*CICS BC: LINE - DATA                                             00800000
008100         10  PC155-USR-CICS-BC       PIC X(06)    VALUE           00810000
008200             'XXXXXX'.                                            00820000
008300         10  FILLER                  PIC X(01)    VALUE  ''.     00830000
008400*USERID BC: LINE - HEADER                                         00840000
008500         10  FILLER                  PIC X(15)    VALUE           00850000
008600             '3a5203500970375'.                                   00860000
008700*USERID BC: LINE - DATA                                           00870000
008800         10  PC155-USR-USERID-BC     PIC X(09)    VALUE SPACES.   00880000
008900*CICS: LINE - HEADER                                              00890000
009000         10  FILLER                  PIC X(15)    VALUE           00900000
009100             '391100100600321'.                                   00910000
009200*CICS: LINE - DATA                                                00920000
009300         10  PC155-USR-CICS          PIC X(08)    VALUE           00930000
009400             'XXXXXXXX'.                                          00940000
009500         10  FILLER                  PIC X(01)    VALUE  ''.     00950000
009600*USERID: LINE - HEADER                                            00960000
009700         10  FILLER                  PIC X(15)    VALUE           00970000
009800             '391100101080327'.                                   00980000
009900*USERID: LINE - DATA                                              00990000
010000         10  PC155-USR-USERID        PIC X(10)    VALUE           01000000
010100             'XXXXXXXXXX'.                                        01010000
010200         10  FILLER                  PIC X(01)    VALUE  ''.     01020000
010300         10  FILLER                  PIC X(144)   VALUE  SPACES.  01030000
010400**************************************************************    01040000
010500*************  START OF 05-LEVEL  ****************************    01050000
010600**************************************************************    01060000
010700     05  FILLER.                                                  01070000
010800* X     - Terminate field generation                              01080000
010900         10  FILLER                  PIC X(02)    VALUE           01090000
011000             'X '.                                                01100000
011100         10  FILLER                  PIC X(01)    VALUE  ''.     01110000
011200* qA    - Clear memory module - A=upper slot                      01120000
011300         10  FILLER                  PIC X(03)    VALUE           01130000
011400             'qA'.                                               01140000
011500         10  FILLER                  PIC X(01)    VALUE  ''.     01150000
011600         10  FILLER                  PIC X(233)   VALUE SPACES.   01160000
011700                                                                  01170000
011800 01  PC155-USER-LABEL-TABLE REDEFINES                             01180000
011900                                PC155-USER-LABEL-FORM.            01190000
012000     05  PC155-USER-LBL-LINE          OCCURS 03 TIMES             01200000
012100                                      INDEXED BY PC155-IDX        01210000
012200                                      PIC X(240).                 01220000
012300                                                                  01230000
012400*----------------------------------------------------------------*01240000
012500* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01250000
012600*----------------------------------------------------------------*01260000
012700 01  PC155-USR-LBL-LENGTH.                                        01270000
012800     05  FILLER                        PIC 9(03)    VALUE   51.   01280001
012900     05  FILLER                        PIC 9(03)    VALUE   96.   01290000
013000     05  FILLER                        PIC 9(03)    VALUE    7.   01300000
013100                                                                  01310000
013200 01  PC155-USR-LBL-LNGTH-VALUES REDEFINES PC155-USR-LBL-LENGTH.   01320000
013300     05  PC155-USR-LINE-LENGTH        OCCURS 03 TIMES             01330000
013400                                      INDEXED BY PC155-IDX-2      01340000
013500                                      PIC 9(03).                  01350000
013600                                                                  01360000
