000001***************************************************************** 00000100
000002* PCWS257 - SML form/data - check in using Print and Apply system 00000200
000070***************************************************************** 00000300
000080 01  PC257-SML-BATCH-LBL.                                         00000400
000090***  LINE 1                                                       00000500
000100* c0000 - Continuous paper length - 0000 = normal operation       00000600
000200         10  FILLER                  PIC X(06)    VALUE           00000700
000300             'c0000'.                                            00000800
000400         10  FILLER                  PIC X(01)    VALUE X'0D'.    00000901
000500* e     - Select edge sensor - DEFAULT                            00001000
000600         10  FILLER                  PIC X(02)    VALUE           00002000
000700             'e'.                                                00003000
000800         10  FILLER                  PIC X(01)    VALUE X'0D'.    00004001
000900* M1030 - Maximum label length                                    00005000
001000         10  FILLER                  PIC X(06)    VALUE           00006000
001100             'M1030'.                                            00007000
001200         10  FILLER                  PIC X(01)    VALUE X'0D'.    00008001
001300* a     - Enable feedback characters to be transmitted            00009000
001400         10  FILLER                  PIC X(02)    VALUE           00010000
001500             'a'.                                                00020000
001600         10  FILLER                  PIC X(01)    VALUE X'0D'.    00030001
001700* s     - Set up for 1 dot buffer                                 00040000
001800         10  FILLER                  PIC X(02)    VALUE           00050000
001900             's'.                                                00060000
002000         10  FILLER                  PIC X(01)    VALUE X'0D'.    00070001
002100* O0110 - Set form edge offset - 0110 = zero setting              00080000
002200         10  FILLER                  PIC X(06)    VALUE           00090000
002300             'O0110'.                                            00100000
002400         10  FILLER                  PIC X(01)    VALUE X'0D'.    00110001
002500* qA    - Clear memory module - A=upper slot                      00120000
002600         10  FILLER                  PIC X(03)    VALUE           00130000
002700             'qA'.                                               00140000
002800         10  FILLER                  PIC X(01)    VALUE X'0D'.    00150001
002900* L     - enter label formatting command input mode               00160000
003000         10  FILLER                  PIC X(02)    VALUE           00170001
003100             'L'.                                                00180000
003200         10  FILLER                  PIC X(01)    VALUE X'0D'.    00190001
003300* D11   - Set dot size - Horizontal(1) Vertical(1)                00200000
003400         10  FILLER                  PIC X(03)    VALUE           00210000
003500             'D11'.                                               00220000
003600         10  FILLER                  PIC X(01)    VALUE X'0D'.    00230001
003700* H     - Heat setting for label                                  00240000
003800         10  FILLER                  PIC X(03)    VALUE           00250000
003900             'H11'.                                               00260000
004000         10  FILLER                  PIC X(01)    VALUE X'0D'.    00270001
004100* PK    - Max speed for print cycle - K=default (6 in.per sec)    00280000
004200         10  FILLER                  PIC X(02)    VALUE           00290000
004300             'PK'.                                                00300000
004400         10  FILLER                  PIC X(01)    VALUE X'0D'.    00310001
004500* SK    - Max slew rate speed - K= default (6 in.per sec)         00320000
004600         10  FILLER                  PIC X(02)    VALUE           00330000
004700             'SK'.                                                00340000
004800         10  FILLER                  PIC X(01)    VALUE X'0D'.    00350001
004900*** LINE 2                                                        00360000
004901*                                                                 00370000
004910* CASI audit indicator - top left corner of label                 00380000
004911*                                                                 00390000
004920         10  FILLER                  PIC X(15)    VALUE           00400000
004930             '374200600320365'.                                   00410000
004940         10  PC257-AUDIT-IND         PIC X(01)    VALUE  '@'.     00420000
004950             88  PC257-AUDIT-COMPLETE             VALUE  SPACE.   00430000
004960             88  PC257-QC-SPOT-AUDIT              VALUE  'Q'.     00440000
004970             88  PC257-UNKNOWN                    VALUE  'U'.     00450000
004980             88  PC257-REWORK                     VALUE  'R'.     00460000
004990             88  PC257-100-PERCENT                VALUE  '%'.     00470000
004991         10  FILLER                  PIC X(01)    VALUE X'0D'.    00480001
004992*                                                                 00490000
005900*  store number                                                   00500000
005910*                                                                 00510000
006000         10  FILLER                  PIC X(15)    VALUE           00520000
006100             '391200901150125'.                                   00530000
006200         10  PC257-SML-STR-NBR       PIC X(04)    VALUE  '@@@@'.  00540000
006300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00550001
006310*                                                                 00560000
006400* CRTN: - heading line                                            00570000
006410*                                                                 00580000
006500         10  FILLER                  PIC X(23)    VALUE  SPACES.  00590000
006600             88 PC257-CRTN-HDG VALUE '341100600230325CRTN:   '.   00600000
006700             88 PC257-SMTH-HDG VALUE '342100600230325PBS-N128'.   00610000
006800         10  FILLER                  PIC X(01)    VALUE X'0D'.    00620001
006810*                                                                 00630000
006900* CRTN: - data line                                               00640000
006910*                                                                 00650000
007000         10  FILLER                  PIC X(15)    VALUE           00660000
007100             '342100600230275'.                                   00670000
007200         10  PC257-CARTON-ID         PIC X(05)    VALUE  '@@@@@'. 00680000
007300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00690001
007310*                                                                 00700000
007320* DOOR heading                                                    00710000
007330*                                                                 00720000
007340         10  FILLER                  PIC X(15)    VALUE           00730000
007350             '331100100150110'.                                   00731000
007360         10 PC256-DOOR-HDG           PIC X(05)    VALUE SPACE.    00732000
007370            88  PC257-DOOR-HDG-YES                VALUE 'DOOR:'.  00733000
007380            88  PC257-DOOR-HDG-NO                 VALUE '@@@@@'.  00734000
007390         10  FILLER                  PIC X(01)    VALUE X'0D'.    00735001
007391*                                                                 00736000
007392* DOOR - data line                                                00737000
007393*                                                                 00738000
007394         10  FILLER                  PIC X(15)    VALUE           00739000
007395             '331100100150065'.                                   00739100
007396         10 PC257-DOOR-NUMBER        PIC X(04)    VALUE '@@@@'.   00739200
007399         10  FILLER                  PIC X(01)    VALUE X'0D'.    00739301
007400*                                                                 00739400
007410* PO: - heading line                                              00739500
007420*                                                                 00739600
007500         10  FILLER                  PIC X(18)    VALUE           00739700
007600             '331100400640310PO:'.                                00739800
007700         10  FILLER                  PIC X(01)    VALUE X'0D'.    00739901
007710*                                                                 00740000
007800* PO/RCVR - data line                                             00750000
007810*                                                                 00760000
007900         10  FILLER                  PIC X(15)    VALUE           00770000
008000             '331100400640265'.                                   00780000
008100         10  PC257-PO-RCVR-NBR       PIC X(12)    VALUE           00790000
008200             '@@@@@@@@@@@@'.                                      00800000
008300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00810001
008310*                                                                 00820000
008400* LINE & PACK ID - heading line                                   00830000
008410*                                                                 00840000
008500         10  FILLER                  PIC X(15)    VALUE           00850000
008600             '331100400800310'.                                   00860000
008700         10  PC257-LNE-PCK-HDG       PIC X(05)    VALUE '@@@@@'.  00870000
008800            88  PC257-LINE-HDG                    VALUE 'LINE:'.  00880000
008810            88  PC257-PACK-HDG                    VALUE 'PACK:'.  00881000
008900         10  FILLER                  PIC X(01)    VALUE X'0D'.    00882001
008910*                                                                 00883000
009000* LINE - data line                                                00884000
009010*                                                                 00885000
009100         10  FILLER                  PIC X(15)    VALUE           00886000
009200             '331100400800265'.                                   00887000
009300         10  PC257-PO-LNE-NBR        PIC 9(04)    VALUE  ZEROES.  00888000
009400         10  FILLER                  PIC X(01)    VALUE X'0D'.    00889001
009700*                                                                 00890000
009800* SKU: - heading line                                             00900000
009810*                                                                 00910000
009900         10  FILLER                  PIC X(19)    VALUE           00920000
010000             '331100400960310SKU:'.                               00930000
010100         10  FILLER                  PIC X(01)    VALUE X'0D'.    00940001
010110*                                                                 00950000
010200* SKU: - data line                                                00960000
010210*                                                                 00970000
010300         10  FILLER                  PIC X(15)    VALUE           00980000
010400             '331100400960265'.                                   00990000
010500         10  PC257-SKU-NBR           PIC X(16)    VALUE           01000000
010600             '(999-99)99999999'.                                  01010000
010700         10  FILLER                  PIC X(01)    VALUE X'0D'.    01020001
010710*                                                                 01030000
010800* STYLE: - heading line                                           01040000
010810*                                                                 01050000
010900         10  FILLER                  PIC X(21)    VALUE           01060000
011000             '331100401120310STYLE:'.                             01070000
011100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01080001
011110*                                                                 01090000
011200* STYLE: - data line                                              01100000
011210*                                                                 01110000
011300         10  FILLER                  PIC X(15)    VALUE           01120000
011400             '331100401120265'.                                   01130000
011500         10  PC257-STYLE             PIC X(20)    VALUE           01140000
011600             '@@@@@@@@@@@@@@@@@@@@'.                              01150000
011700         10  FILLER                  PIC X(01)    VALUE X'0D'.    01160001
011701*                                                                 01170000
011702******************************************************************01170100
011703*   program should SET move the following to PC257-inpk-convy    *01170200
011704*   -box if nothing is to be printed                             *01170300
011705*            '1X1100001130150L000000'                            *01170400
011706*   or it should SET the following to print a black box          *01170500
011707*            '1X1100001130150L164017'.                           *01170600
011708******************************************************************01170700
011709*                                                                 01170800
011710* inpk cnvy - BOX                                                 01170900
011711*                                                                 01171000
011712         10  PC257-INPK-CONVY-BOX    PIC X(22).                   01171100
011713             88  PC257-FORM-INPK-BOX              VALUE           01171200
011714                                    '1X1100001130150L164017'.     01171300
011715             88  PC257-FORM-NO-INPK-BOX           VALUE           01171400
011716                                    '1X1100001130150L000000'.     01171500
011717         10  FILLER                  PIC X(01)    VALUE X'0D'.    01171601
011720*                                                                 01171700
011800* OUTER PK UNTS: / INPK CNVY UNTS: - heading Line                 01171800
011810*                                                                 01171900
011900         10  FILLER                  PIC X(15)    VALUE           01172000
011901             '331100401280310'.                                   01173000
011902         10  PC257-OUTPK-UNTS-HDG    PIC X(15).                   01174000
011910             88  PC257-FORM-NO-UNT-HDG            VALUE           01175000
011920                                    '@@@@@@@@@@@@@@@'.            01176000
011930             88  PC257-FORM-INPK-HDG              VALUE           01177000
011940                                    'INPK CNVY UNTS:'.            01178000
012000         10  FILLER                  PIC X(01)    VALUE X'0D'.    01179001
012010*                                                                 01180000
012100* OUTER PK UNTS: - data Line                                      01190000
012110*                                                                 01200000
012200         10  FILLER                  PIC X(15)    VALUE           01210000
012300             '331100401280188'.                                   01220000
012400         10  PC257-OUTPK-UNTS        PIC X(04).                   01230000
012500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01240001
012501*                                                                 01250000
014900* Plan-o-Gram Program name (top line inside of box)               01260000
014910*                                                                 01270000
015000         10  FILLER                  PIC X(15)    VALUE           01280000
015100             '341100402170390'.                                   01290000
015200         10  PC257-POG-PROGRAM-NAME  PIC X(35)    VALUE           01300000
015300           '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.                 01310000
015310             88  PC257-FORM-NO-POG-NAME           VALUE           01320000
015320                 '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.           01330000
015400         10  FILLER                  PIC X(01)    VALUE X'0D'.    01340001
015410*                                                                 01350000
015500* STORE ON HAND ZERO -or- ERROR MESSAGE (2nd line inside of box)  01360000
015510*                                                                 01370000
015600         10  FILLER                  PIC X(15)    VALUE           01380000
015700             '341100402370390'.                                   01390000
015800         10  PC257-STR-ON-HAND       PIC X(35)    VALUE           01400000
015900             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               01410000
015910             88 PC257-OH-ZERO-MSG-YES             VALUE           01420000
015920                'PROCESS FIRST - ZERO ON HAND       '.            01430000
015930             88 PC257-OH-ZERO-MSG-NO              VALUE           01440000
015931                '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.            01450000
015932         10  PC257-STR-ERR-REDEF REDEFINES                        01460000
015933             PC257-STR-ON-HAND.                                   01470000
015934             15  PC257-ERROR-MSG-1   PIC X(35).                   01480000
015940         10  FILLER                  PIC X(01)    VALUE X'0D'.    01490001
015941*                                                                 01500000
015942* SEASONAL SET - heading                                          01510000
015943* OR TRIP ID FOR QC AUDIT LABELS                                  01520000
015944*                                                                 01530000
015945*** 12/02/10 88 PC257-NO-SET-HDG VALUE '331100401750300@@@@ '.    01540000
015946*** 12/02/10 88 PC257-SET-HDG    VALUE '331100401750300SET: '.    01550000
015947*** 12/02/10 88 PC257-TRIP-HDG   VALUE '331100401750300TRIP:'.    01560000
015948         10  FILLER                  PIC X(20)    VALUE SPACES.   01570000
015949             88 PC257-NO-SET-HDG VALUE '331100401750310@@@@ '.    01580000
015950             88 PC257-SET-HDG    VALUE '331100401750310@@@@@'.    01590000
015951             88 PC257-TRIP-HDG   VALUE '331100401750310TRIP:'.    01591000
015952         10  FILLER                  PIC X(01)    VALUE X'0D'.    01592001
015953*                                                                 01593000
015954* SEASONAL SET - data                                             01594000
015955*                                                                 01595000
015956         10  FILLER                  PIC X(15)    VALUE           01595100
015957*** 12/02/10 '331100401910300'.                                   01595200
015958             '331100401910310'.                                   01595300
015959         10 PC257-SEASET             PIC X(25).                   01595400
015960            88 PC257-SEASET-NO                  VALUE             01595500
015961               '@@@@@@@@@@@@@@@@@@@@@@@@@'.                       01595600
015962         10  FILLER                  PIC X(01)    VALUE X'0D'.    01595701
015963*                                                                 01595800
015964* ZONE - heading - 1st box left side of label                     01595900
015965*                                                                 01596000
015966         10  FILLER                  PIC X(15)    VALUE           01596100
015967             '331100400600370'.                                   01596200
015968         10  FILLER                  PIC X(04).                   01596300
015969             88 PC255-ZONE-HDG                    VALUE 'ZONE'.   01596400
015970             88 PC255-NO-ZONE-HDG                 VALUE '@@@@'.   01596500
015971         10  FILLER                  PIC X(01)    VALUE X'0D'.    01596601
015972*                                                                 01596700
015973* Zone/Mdse Group - 1st box left side of label                    01596800
015974*                                                                 01596900
015975         10  FILLER                  PIC X(15)    VALUE           01597000
015976             '332200400900370'.                                   01597100
015977         10  PC257-MDSE-GROUP        PIC X(02)    VALUE  '@@'.    01597200
015978         10  FILLER                  PIC X(01)    VALUE X'0D'.    01597301
015979*                                                                 01597400
015980* presentation indicator - 2nd box left side of label             01597500
015981*                                                                 01597600
015982         10  FILLER                  PIC X(15)    VALUE           01597700
015983             '332200401370390'.                                   01597800
015984         10  PC257-PRESENTATION      PIC X(04)    VALUE  '@@@@'.  01597900
015985             88  PC257-DEFLT-PRESENTATION         VALUE  '@@@@'.  01598000
015986             88  PC257-HANG                       VALUE  'HANG'.  01598100
015987             88  PC257-FOLD                       VALUE  'FOLD'.  01598200
015988         10  FILLER                  PIC X(01)    VALUE X'0D'.    01598301
015989*                                                                 01598400
015990* fIXTURE - heading - 3rd box left side of label                  01598500
015991*                                                                 01598600
015992         10  FILLER                  PIC X(15)    VALUE           01598700
015993*** 12/02/10 '331100401720384'.                                   01598800
015994             '341100401590310'.                                   01598900
015995         10  FILLER                  PIC X(08).                   01599000
015996             88  PC257-FORM-FIX-HDG               VALUE           01599100
015997                                    'FIXTURE:'.                   01599200
015998             88  PC257-FORM-NO-FIX-HDG            VALUE           01599300
015999                                    '@@@@@@@@'.                   01599400
016000         10  FILLER                  PIC X(01)    VALUE X'0D'.    01599501
016100*                                                                 01599600
016200* FIXTURE - data - 3rd box left side of label                     01599700
016210*                                                                 01599800
016300         10  FILLER                  PIC X(15)    VALUE           01599900
016400*** 12/02/10 '331100401880384'.                                   01600000
016410             '341100401590225'.                                   01610000
016500         10  PC257-FIXTURE           PIC X(10)    VALUE           01620000
016600                                             '@@@@@@@@@@'.        01630000
016610             88  PC257-FORM-NO-FIXTURE            VALUE           01640000
016620                                             '@@@@@@@@@@'.        01650000
016700         10  FILLER                  PIC X(01)    VALUE X'0D'.    01660001
016710*                                                                 01670000
016720* Text Box - Line 1 - 2nd box right side of label                 01671000
016730*                                                                 01672000
016740         10  FILLER                  PIC X(15)    VALUE           01673000
016750             '331100401110115'.                                   01674000
016760         10  PC257-TEXT-LINE-1       PIC X(12)    VALUE           01675000
016770                                             '@@@@@@@@@@@@'.      01676000
016780             88  PC257-FORM-NO-TEXT-1             VALUE           01677000
016790                                             '@@@@@@@@@@@@'.      01678000
016791         10  FILLER                  PIC X(01)    VALUE X'0D'.    01679001
016792*                                                                 01679100
016793* Text Box - Line 2 - 2nd box right side of label                 01679200
016794*                                                                 01679300
016795         10  FILLER                  PIC X(15)    VALUE           01679400
016796             '331100401270115'.                                   01679500
016797         10  PC257-TEXT-LINE-2       PIC X(12)    VALUE           01679600
016798                                             '@@@@@@@@@@@@'.      01679700
016799             88  PC257-FORM-NO-TEXT-2             VALUE           01679800
016800                                             '@@@@@@@@@@@@'.      01679900
016810         10  FILLER                  PIC X(01)    VALUE X'0D'.    01680001
016820*                                                                 01681000
016830* Text Box - Line 3 - 2nd box right side of label                 01682000
016840*                                                                 01683000
016850         10  FILLER                  PIC X(15)    VALUE           01684000
016860             '331100401430115'.                                   01685000
016870         10  PC257-TEXT-LINE-3       PIC X(12)    VALUE           01686000
016880                                             '@@@@@@@@@@@@'.      01687000
016890             88  PC257-FORM-NO-TEXT-3             VALUE           01688000
016891                                             '@@@@@@@@@@@@'.      01689000
016892         10  FILLER                  PIC X(01)    VALUE X'0D'.    01689101
016893*                                                                 01689200
016894* Text Box - Line 4 - 2nd box right side of label                 01689300
016895*                                                                 01689400
016896         10  FILLER                  PIC X(15)    VALUE           01689500
016897             '331100401590115'.                                   01689600
016898         10  PC257-TEXT-LINE-4       PIC X(12)    VALUE           01689700
016899                                             '@@@@@@@@@@@@'.      01689800
016900             88  PC257-FORM-NO-TEXT-4             VALUE           01689900
016910                                             '@@@@@@@@@@@@'.      01690000
016920         10  FILLER                  PIC X(01)    VALUE X'0D'.    01691001
016930*                                                                 01692000
016940* EAS security tag needed - 3rd box right side of label           01693000
016950*                                                                 01694000
016960         10  FILLER                  PIC X(15)    VALUE           01695000
016970*** 12/02/10 - dmh                  '332200401920090'.            01696000
016971                                    '332200401850365'.            01697000
016980         10  PC257-EAS-FIELD         PIC X(03)    VALUE  '@@@'.   01698000
016991             88  PC257-EAS-TAG-NEEDED             VALUE  'EAS'.   01699000
016992             88  PC257-EAS-TAG-NOT-NEEDED         VALUE  '@@@'.   01699100
016994         10  FILLER                  PIC X(01)    VALUE X'0D'.    01699201
017000*                                                                 01699300
018600*  # above bar code -OR- audit barcode number                     01699400
018610*                                                                 01699500
018700         10  FILLER                  PIC X(15)    VALUE ZEROS.    01699600
018800             88 PC257-BRCD-NBR-ABOVE VALUE '341100002600330'.     01699700
018900             88 PC257-AUDIT-NBR-SIDE VALUE '222200003680375'.     01699800
019000         10  PC257-BARCODE-TEXT      PIC X(25)    VALUE  ZEROS.   01699900
019100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01700001
019110*                                                                 01710000
019200* long bar code across bottom of label -OR- audit barcode         01720000
019210*                                                                 01730000
019300         10  FILLER                  PIC X(16)    VALUE ZEROES.   01740000
019400             88 PC257-SML-BRCD       VALUE '3e4410003790340C'.    01750000
019500             88 PC257-AUDIT-BRCD     VALUE '2e2205003550320C'.    01760000
019600         10 PC257-SML-BARCODE        PIC X(20).                   01770001
019700         10 PC257-BARCODE-REDEF REDEFINES PC257-SML-BARCODE.      01780000
019800            15 PC257-AUDIT-BARCODE   PIC X(09).                   01790001
019900            15 PC257-AUDIT-EOT       PIC X(01).                   01800001
020000               88 PC257-AUDT-BRCDE-EOT            VALUE X'0D'.    01810001
020100            15 PC257-AUDIT-FILLER    PIC X(10).                   01820000
020200         10  FILLER                  PIC X(01)    VALUE X'0D'.    01830001
020500*                                                                 01840000
020600* Userid - above barcode                                          01850000
020610*                                                                 01860000
020700         10  FILLER                  PIC X(15)    VALUE           01870000
020800             '302200002600050'.                                   01880000
020900         10  PC257-USER-ID           PIC X(07)    VALUE '@@@@@@@'.01890000
021000         10  FILLER                  PIC X(01)    VALUE X'0D'.    01900001
021010*                                                                 01910000
021100* PRINTER # - line  - bottom of label                             01920000
021110*                                                                 01930000
021200         10  FILLER                  PIC X(22)    VALUE           01940000
021300             '302200003910390PRTR #'.                             01950000
021400         10  PC257-SML-PRTR-NBR      PIC X(06)    VALUE           01960000
021500             '@@@@@@'.                                            01970000
021600         10  FILLER                  PIC X(01)    VALUE X'0D'.    01980001
021610*                                                                 01990000
021700**  LABEL # OF FIELD  - bottom of label                           02000000
021710*                                                                 02010000
021800         10  FILLER                    PIC X(15)  VALUE           02020000
021900             '302200003910285'.                                   02030000
022000         10  PC257-LABEL-NBR           PIC X(04)  VALUE  '@@@@'.  02040000
022100         10  FILLER                    PIC X(01)  VALUE X'0D'.    02050001
022110*                                                                 02060000
022200**  "OF" LITERAL  - bottom of label                               02070000
022210*                                                                 02080000
022300         10  FILLER                    PIC X(15)  VALUE           02090000
022400             '302200003910257'.                                   02100000
022500         10  PC257-LABEL-OF            PIC X(04)  VALUE  '@@@@'.  02110000
022600         10  FILLER                    PIC X(01)  VALUE X'0D'.    02120001
022610*                                                                 02130000
022700**  TOTAL LABEL COUNT  - bottom of label                          02140000
022710*                                                                 02150000
022800         10  FILLER                    PIC X(15)  VALUE           02160000
022900             '302200003910232'.                                   02170000
023000         10  PC257-TOT-LABEL           PIC X(04)  VALUE  '@@@@'.  02180000
023100         10  FILLER                    PIC X(01)  VALUE X'0D'.    02190001
023110*                                                                 02200000
023200*  label print date  - bottom of label                            02210000
023210*                                                                 02220000
023300         10  FILLER                    PIC X(15)  VALUE           02230000
023400             '302200003910180'.                                   02240000
023500         10  PC257-LBL-PRT-DATE        PIC X(08)  VALUE           02250000
023600             '@@@@@@@@'.                                          02260000
023700         10  FILLER                    PIC X(01)  VALUE X'0D'.    02270001
023710*                                                                 02280000
023800*  label print time  - bottom of label                            02290000
023810*                                                                 02300000
023900         10  FILLER                    PIC X(15)  VALUE           02310000
024000             '302200003910125'.                                   02320000
024100         10  PC257-LBL-PRT-TIME        PIC X(05)  VALUE           02330000
024200             '@@@@@'.                                             02340000
024300         10  FILLER                    PIC X(01)  VALUE X'0D'.    02350001
024310*                                                                 02360000
024400* Label Description  - bottom of label                            02370000
024410*                                                                 02380000
024500         10  FILLER                  PIC X(15)    VALUE           02390000
024600             '302200003910080'.                                   02400000
024700         10  PC257-LABEL-INFO        PIC X(12)    VALUE           02410000
024800             'CI-SML PRTAP'.                                      02420000
024900         10  FILLER                  PIC X(01)    VALUE X'0D'.    02430001
024901*                                                                 02440000
024902******************************************************************02450000
024904*   program should set either the following to PC257-reprint-box *02460000
024905*   if nothing is to be printed                                  *02470000
024906*            '1X1100000250220L000000'                            *02480000
024907*   or it should set the following to print a black box          *02490000
024908*            '1X1100000250220L070017'                            *02490100
024909******************************************************************02490200
024910*                                                                 02490300
024911* REPRINT box                                                     02490400
024912*                                                                 02490500
024913         10  PC257-reprint-box       PIC X(22).                   02490600
024914             88  PC257-FORM-REPRT-BOX             VALUE           02490700
024915                                   '1X1100000250220L070017'.      02490800
024916             88  PC257-FORM-NO-RPRT-BOX           VALUE           02490900
024917                                   '1X1100000250220L000000'.      02491000
024918         10  FILLER                  PIC X(01)    VALUE X'0D'.    02491101
024919*                                                                 02491200
024920******************************************************************02491300
024923*   program should either set the following to PC257-reprint-tex *02491400
024924*   if nothing is to be printed                                  *02491500
024925*            '331100000400280@@@@@@@'.                           *02491600
024926*   or it should set the following if reprint should be          *02491700
024927*   printed                                                      *02491800
024928*            '331100000400280REPRINT'                            *02491900
024929******************************************************************02492000
024930*                                                                 02493000
024931* REPRINT field                                                   02493100
024932*                                                                 02493200
024933         10  PC257-REPRINT-TEXT      PIC X(22).                   02493300
024934             88  PC257-FORM-REPRT-FLD             VALUE           02493400
024935                                   '331100000400280REPRINT'.      02493500
024936             88  PC257-FORM-NO-RPRT-FLD           VALUE           02493600
024937                                   '331100000400280@@@@@@@'.      02493700
024938         10  FILLER                  PIC X(01)    VALUE X'0D'.    02493801
024939*                                                                 02493900
024940* box around POG program name and zero on hand message            02494000
024941*                                                                 02494100
024942         10  FILLER                  PIC X(28)    VALUE           02494200
024943             '1X1100001960010B385043001001'.                      02494300
024944         10  FILLER                  PIC X(01)    VALUE X'0D'.    02494401
024945*                                                                 02494500
024946* horizontal line between store # and text box - right side       02494600
024947*                                                                 02494700
024948         10  FILLER                PIC X(22)      VALUE           02494800
024949             '1X1100000940015L108001'.                            02494900
024950         10  FILLER                  PIC X(01)    VALUE  ''.     02495000
024951*                                                                 02495100
024952* horizontal line between zone & hang/fold box - left  side       02495200
024953*                                                                 02495300
024954         10  FILLER                PIC X(22)      VALUE           02495400
024955             '1X1100000950315L110001'.                            02495500
024956         10  FILLER                  PIC X(01)    VALUE  ''.     02495600
024957*                                                                 02495700
024958* horizontal line between text & eas tag box -   right side       02495800
024959*                                                                 02495900
024960         10  FILLER                PIC X(22)      VALUE           02496000
024961             '1X1100001620015L108001'.                            02496100
024962         10  FILLER                  PIC X(01)    VALUE  ''.     02496200
024963*                                                                 02496300
024964* horizontal line between hang/fold & fixture box -left side      02496400
024965*                                                                 02496500
024966         10  FILLER                PIC X(22)      VALUE           02496600
024967             '1X1100001500315L110001'.                            02496700
024968         10  FILLER                  PIC X(01)    VALUE  ''.     02496800
024969*                                                                 02496900
024970* horizontal line above zone box - left side                      02497000
024971*                                                                 02497100
024972         10  FILLER                PIC X(22)      VALUE           02497200
024973             '1X1100000400315L110001'.                            02497300
024974         10  FILLER                  PIC X(01)    VALUE  ''.     02497400
024975*                                                                 02497500
024976* vertical line right side of label by store number               02497600
024977*                                                                 02497700
024978         10  FILLER                PIC X(22)      VALUE           02497800
024979             '1X1100000940121L001082'.                            02497900
024980         10  FILLER                  PIC X(01)    VALUE  ''.     02498000
024981*                                                                 02498100
024982* vertical line left side of label by zone box                    02498200
024983*                                                                 02498300
024984         10  FILLER                PIC X(22)      VALUE           02498400
024985*** 12/02/10 '1X1100000390315L001130'.                            02498500
024986             '1X1100000390315L001157'.                            02498600
024987         10  FILLER                  PIC X(01)    VALUE  ''.     02498700
024988*                                                                 02498800
024989* box around the manifest number above barcode                    02498900
024990*                                                                 02499000
024991         10  FILLER                  PIC X(22)    VALUE SPACES.   02499100
024992             88 PC257-MFST-BOX-YES VALUE '1X1100002410067L093020'.02499200
024993             88 PC257-MFST-BOX-NO  VALUE '1X1100002410067L000000'.02499300
024994         10  FILLER                  PIC X(01)    VALUE X'0D'.    02499401
024995*                                                                 02499500
024996* black box/line across label just above barcode.                 02499600
024997*                                                                 02499700
024998         10  FILLER                  PIC X(22)    VALUE SPACES.   02499800
024999             88 PC255-TEST-LNE-YES VALUE '1X1100002630000L405009'.02499900
025000             88 PC255-TEST-LNE-NO  VALUE '1X1100002630000L000000'.02500000
025001         10  FILLER                  PIC X(01)    VALUE  ''.     02500100
025003         10  FILLER                  PIC X(01)    VALUE X'0D'.    02500201
025004*                                                                 02500300
025005* reverse image store number - BOX                                02500400
025006*                                                                 02500500
025007         10  PC257-REVERSE-STORE-BOX PIC X(22).                   02500600
025008             88  PC257-FORM-NO-REVRSE-STR         VALUE           02500700
025009                                   '1X1100000170010L000000'.      02500800
025010             88  PC257-FORM-REVRSE-STR            VALUE           02500900
025011                                   '1X1100000170010L119077'.      02501000
025013         10  FILLER                  PIC X(01)    VALUE X'0D'.    02501101
025014*                                                                 02501200
025015* reverse image - STORE ON HAND ZERO - 2nd line in box            02501300
025016*                                                                 02501400
025017         10  FILLER                  PIC X(22)    VALUE SPACES.   02501500
025018             88 PC257-OH-ZERO-YES  VALUE '1X1100002180033L360020'.02501600
025019             88 PC257-OH-ZERO-NO   VALUE '1X1100002180033L000000'.02501700
025024         10  FILLER                  PIC X(01)    VALUE  ''.     02501800
025100*                                                                 02501900
028700* QC AUDIT description - for qc audit label only                  02502000
028710*                                                                 02503000
028800         10  FILLER                  PIC X(15)    VALUE           02504000
028900             '335501003450300'.                                   02505000
028910         10  PC257-AUDIT-HDG         PIC X(07)    VALUE  '@@'.    02506000
028920             88  PC257-AUDIT-HDG-YES            VALUE  'QCAUDIT'. 02507000
008514             88  PC257-AUDIT-RFID-YES           VALUE  'RF ONLY'. 02507100
008514             88  PC257-AUDIT-QCRD-YES           VALUE  'COMBO  '. 02507200
028930             88  PC257-FSTY-AUDIT-YES           VALUE  'F/A AUD'. 02507300
028940             88  PC257-AUDIT-HDG-NO             VALUE  '@@@@@@@'. 02507400
028950         10  FILLER                  PIC X(01)    VALUE X'0D'.    02507501
028951*                                                                 02507600
028952* reverse image - CRTN: heading - indicate audit carton (U57)     02507700
028953*                                                                 02507800
028954         10  FILLER                PIC X(22)      VALUE SPACES.   02507900
028955             88 PC257-audit-yes    VALUE '1X1100000030276L051021'.02508000
028956             88 PC257-audit-no     VALUE '1X1100000030276L000000'.02509000
028957         10  FILLER                  PIC X(01)    VALUE  ''.     02510000
028958*                                                                 02520000
028959* reverse image - FIXTURE                               (U58)     02530000
028960* 12/02/10 added dmh                                              02540000
028961*                                                                 02550000
028962*dmh6/30 10  FILLER                PIC X(22)      VALUE SPACES.   02560000
028963*dmh6/30     88 PC257-FIXTURE-YES  VALUE '1X1100001400120L195021'.02570000
028964*dmh6/30     88 PC257-FIXTURE-NO   VALUE '1X1100001400120L000000'.02580000
028965*dmh6/30 10  FILLER                  PIC X(01)    VALUE  ''.     02590000
028966*dmh6/30 10  FILLER                  PIC X(33)    VALUE  SPACES.  02600000
028967         10  FILLER                  PIC X(56)    VALUE  SPACES.  02610000
028970*                                                                 02620000
033700 01  PC257-LABEL-WORK-FIELDS.                                     02630000
033800     05  PC257-LABEL-INFO-WORK        PIC X(12).                  02640000
033900     05  PC257-LABEL-INFO-WORK-R REDEFINES PC257-LABEL-INFO-WORK. 02650000
034000         10  PC257-FROM-APPLICATION   PIC X(02).                  02660000
034100         10  PC257-LBL-DESC           PIC X(05).                  02670000
034110         10  PC257-PRTR-ATTACHED      PIC X(05).                  02680000
