000100***************************************************************** 00010000
000200*  COMMAREA LAYOUT TO PASS THE PO/RCVR/LINE TO THE MODULE USED    00020000
000300*  TO GET INTR_UPC_ID.                                            00030000
000400*  PROGRAM-PCKUT064                             LENGTH = 400      00040000
000500***************************************************************** 00050000
000700* PCWS064:                                                        00070000
000800*                                                                 00080000
000900*  THIS CONTAINS THE PARAMETER LIST NEEDED TO CALL THE            00090000
001000*  KOHL'S INTR-UPC-ID ROUTINE, PCKUT064.                          00100000
001100*                                                                 00110000
001200*    IN CICS DO THIS:                                             00120000
001300*                                                                 00130000
001400*          CALL PC064-INTR-UPC-ID-MODULE                          00140001
001500*                  USING DFHEIBLK                                 00150000
001600*                  PC064-COMMAREA                                 00160000
001700*                  PC064-COMMAREA-REC                             00170000
001800*          END-CALL                                               00180000
001900*                                                                 00190000
002000*  IN BATCH DO THIS:                                              00200000
002100*      CALL PC064-INTR-UPC-ID-MODULE USING                        00210001
002200*           USING PC064-COMMAREA-REC                              00220000
002300*      END-CALL                                                   00230000
002400*                                                                 00240000
002500*  INITIALIZE BEFORE SETTING UP EACH INTR UPC ID REQUEST:         00250003
002600*                                                                 00260000
002700*      INITIALIZE PC064-COMMAREA-REC.                             00270000
002800*                                                                 00280000
002900*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.* 00290000
003000                                                                  00300000
003100 01  PC064-COMMAREA-REC.                                          00310000
003200     05  PC064-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00320000
004000     05  PC064-CALL-RETURN-AREA.                                  00400000
004100         10  PC064-CRA-RET-CDE         PIC  X(02)  VALUE ZEROES.  00410000
004200             88  PC064-SUCCESSFUL                  VALUES         00420000
004300                                      ZERO, SPACES, LOW-VALUES.   00430000
004400             88  PC064-ERROR                       VALUE '01'.    00440000
004500             88  PC064-INVALID-SQL                 VALUE '02'.    00450000
006400             88  PC064-DATABASE-BUSY               VALUE '03'.    00460000
004700             88  PC064-INTR-UPC-ERROR              VALUE '04'.    00470000
004800         10  PC064-CRA-RET-MSG         PIC  X(128) VALUE SPACES.  00480000
004900         10  FILLER                    PIC  X(05).                00490000
005000         10  PC064-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.  00500000
005100     05  PC064-SQLCA                   PIC X(136).                00510000
005200                                                                  00520000
           05  PC064-ORD-NBR               PIC  S9(9) COMP VALUE ZEROES.00531000
           05  PC064-ORD-LNE-NBR           PIC  S9(9) COMP VALUE ZEROES.00532000
           05  PC064-REC-SEQ-NBR           PIC  S9(9) COMP VALUE ZEROES.00533000
           05  PC064-TRN-TYP-CDE           PIC   X(2)      VALUE SPACES.00534004
005400*                                                                 00540000
           05  PC064-ITM-NBR               PIC  S9(15)V COMP-3 VALUE +0.00560000
                                                                        00570000
           05  PC064-INTR-UPC-ID           PIC  S9(9) COMP VALUE ZEROES.00580000
014800*                                                                 01480000
016100     05  FILLER                      PIC  X(089) VALUE SPACES.    01610002
016200 01  PC064-COMMAREA                   PIC X(01).                  01620000
016300 01  PC064-INTR-UPC-ID-MODULE         PIC X(08) VALUE 'PCKUT064'. 01630000
