000001*****************************************************************         
000002*                                                               *         
000003* THIS COPYBOOK HAS CHANGES REQUIRED FOR STORE NUMBER EXPANSION *         
000004*                                                               *         
000005*****************************************************************         
000006* PCWS189 - PRINT PACKAGE CENTRAL STOCK SML - DATA -  SOCKETS   *         
000007*                CHECK-IN APPLICATION ONLY                      *         
000008*                                                               *         
000009* THIS IS THE LAYOUT FOR THE DATA PORTION OF A SHIPPING LABEL.  *         
000010* IT MUST BE PRECEDED BY THE FORMS RECORDS DESCRIBED IN PCWS158.*         
000011* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE *         
000012* FIRST POSITION.                                               *         
000013*                                                               *         
000014* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000015*                    I M P O R T A N T                          *         
000016* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 4-05 LEVELS *         
000017* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 *         
000018* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  *         
000019* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        *         
000020* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       *         
000030*****************************************************************         
000900                                                                          
001000 01  PC189-MAX-LABEL-LINES            PIC S9(04) VALUE  +3                
001100                                                COMP SYNC.                
001101***                                                                       
001102***    NUMBER OF 05 LEVELS ------------------------------/\               
001103***                                                                       
001104***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
001105***               IN PC189-SML-DATA-LENGTH.                               
001106***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE               
001107***                                                                       
001110*****************************************************************         
001200 01  PC189-SML-LABEL-DATA.                                                
001300     05 FILLER.                                                           
001400* U01 - STORE NAME                                                        
001500         10  FILLER                  PIC X(04)    VALUE 'U01'.           
001700         10  PC189-SML-STR-NME       PIC X(10)    VALUE SPACES.           
001800         10  FILLER                  PIC X(01)    VALUE  ''.             
001900* U02 - STORE NUMBER                                                      
002000         10  FILLER                  PIC X(04)    VALUE 'U02'.           
002300         10  PC189-SML-STR-NBR       PIC X(04)    VALUE SPACES.           
002400         10  FILLER                  PIC X(01)    VALUE  ''.             
007700* U03 - NUMBER ABOVE BARCODE                                              
007800         10  FILLER                  PIC X(04)    VALUE 'U03'.           
008300         10  PC189-SML-BC-NBR        PIC X(25)    VALUE SPACES.           
008910         10  FILLER                  PIC X(01)    VALUE  ''.             
009000* U04 - BARCODE                                                           
009100         10  FILLER                  PIC X(04)    VALUE 'U04'.           
009500         10  FILLER                  PIC X(01)    VALUE                   
009600            'C'.                                                          
009800         10  PC189-SML-BC            PIC X(20)    VALUE SPACES.           
010400         10  FILLER                  PIC X(01)    VALUE  ''.             
010500* U05 - LABEL NUMBER                                                      
010600         10  FILLER                  PIC X(04)    VALUE 'U05'.           
010900         10  PC189-LABEL-NUMBER.                                          
011000             15  PC189-LABEL-NUMBER-N  PIC 9(04)  VALUE ZERO.             
011100         10  FILLER                  PIC X(01)    VALUE  ''.             
011101* U06 - TOTAL NUMBER OF LABELS                                            
011102         10  FILLER                  PIC X(04)    VALUE 'U06'.           
011103         10  PC189-TOT-LBL-CNT       PIC 9(04)    VALUE ZEROES.           
011105         10  FILLER                  PIC X(01)    VALUE  ''.             
011106* U10 - LABEL DESCRIPTION   (EX: CI-CTL STK)                              
011107         10  FILLER                  PIC X(04)    VALUE 'U10'.           
011108         10  PC189-SML-LBL-DESC      PIC X(10)    VALUE SPACES.           
011109         10  FILLER                  PIC X(01)    VALUE  ''.             
011110* U11 - ZONE/STORAGE HEADING                                              
011111         10  FILLER                  PIC X(04)    VALUE 'U11'.           
011112         10  PC189-ZONE-STRG-HDG     PIC X(08)    VALUE SPACES.           
011113         10  FILLER                  PIC X(01)    VALUE  ''.             
011114* U12 - ZONE/STORAGE DESCRIPTION                                          
011115         10  FILLER                  PIC X(04)    VALUE 'U12'.           
011116         10  PC189-ZONE-STRG-DESC    PIC X(05)    VALUE SPACES.           
011117         10  FILLER                  PIC X(01)    VALUE  ''.             
011118* U14 - PO-RCVR                                                           
011119         10  FILLER                  PIC X(04)    VALUE 'U14'.           
011120         10  PC189-PO-RCVR           PIC X(12)    VALUE SPACES.           
011121         10  FILLER                  PIC X(01)    VALUE  ''.             
011122* U16 - LINE NUMBER                                                       
011123         10  FILLER                  PIC X(04)    VALUE 'U16'.           
011130         10  PC189-LINE-NUMBER.                                           
011140             15  PC189-LINE-NUMBER-N  PIC 9(03)   VALUE ZERO.             
011150         10  FILLER                  PIC X(01)    VALUE  ''.             
011160* U18 - DEPT-CLASS & SKU                                                  
011170         10  FILLER                  PIC X(04)    VALUE 'U18'.           
011180         10  PC189-DEPT-CL-SKU       PIC X(16)    VALUE SPACES.           
011190         10  FILLER                  PIC X(01)    VALUE  ''.             
011191* U20 - STYLE                                                             
011192         10  FILLER                  PIC X(04)    VALUE 'U20'.           
011193         10  PC189-STYLE             PIC X(20)    VALUE SPACES.           
011194         10  FILLER                  PIC X(01)    VALUE  ''.             
011195* U25 - OUTER PACK/INNERPACK UNITS                                        
011196         10  FILLER                  PIC X(04)    VALUE 'U25'.           
011197         10  PC189-PACK-UNT          PIC X(04)    VALUE SPACES.           
011198         10  FILLER                  PIC X(01)    VALUE  ''.             
011200* U28 - 8 CHARACTER RDM ITEM NUMBER - ABOVE BARCODE ON SIDE OF LABEL      
011300         10  FILLER                  PIC X(04)    VALUE 'U28'.           
011400         10  PC189-ITEM-NBR          PIC X(08)    VALUE SPACES.           
011600         10  FILLER                  PIC X(01)    VALUE  ''.             
011651         10  FILLER                  PIC X(11)    VALUE  SPACES.          
011652*                                                                         
011653*                                                                         
011654     05 FILLER.                                                           
011655* U29 - 8 CHARACTER RDM ITEM NUMBER BARCODE ON SIDE OF LABEL              
011656         10  FILLER                  PIC X(04)    VALUE 'U29'.           
011657         10  FILLER                  PIC X(01)    VALUE 'C'.              
011658         10  PC189-ITEM-NBR-BC       PIC X(08)    VALUE SPACES.           
011659         10  FILLER                  PIC X(01)    VALUE  ''.             
011660* U30 - 21 DIGIT # BELOW BARCODE ACROSS TOP OF LABEL                      
011661*    (PO, ITEM NUMBER, OUTER PACK)                                        
011662         10  FILLER                  PIC X(04)    VALUE 'U30'.           
011663         10  PC189-PO-ITM-UNITS      PIC X(23)    VALUE SPACES.           
011664         10  FILLER                  PIC X(01)    VALUE  ''.             
011665* U31 - 21 DIGIT BARCODE ACROSS TOP OF LABEL                              
011666*    (PO, ITEM NUMBER, OUTER PACK)                                        
011667         10  FILLER                  PIC X(04)    VALUE 'U31'.           
011668         10  FILLER                  PIC X(01)    VALUE 'C'.              
011669         10  PC189-PO-ITM-UNITS-BC   PIC X(22)    VALUE SPACES.           
011670         10  FILLER                  PIC X(01)    VALUE  ''.             
011671* U34 - ERROR MESSAGE 1                                                   
011672         10  FILLER                  PIC X(04)    VALUE 'U34'.           
011673         10  PC189-ERROR-MSG-1       PIC X(35)    VALUE SPACES.           
011674         10  FILLER                  PIC X(01)    VALUE  ''.             
011675* U35 - ERROR MESSAGE 2                                                   
011676         10  FILLER                  PIC X(04)    VALUE 'U35'.           
011677         10  PC189-ERROR-MSG-2       PIC X(35)    VALUE SPACES.           
011678         10  FILLER                  PIC X(01)    VALUE  ''.             
011679* U43 - CARTON NUMBER                                                     
011680         10  FILLER                  PIC X(04)    VALUE 'U43'.           
011681         10  PC189-CARTON-NBR        PIC X(05)    VALUE SPACES.           
011690         10  FILLER                  PIC X(01)    VALUE  ''.             
011691*                                                                         
011692* AUDIT INDICATOR                                                         
011693         10 FILLER                    PIC X(04) VALUE                     
011694            'U44'.                                                       
011695         10 PC189-AUDIT-IND           PIC X(01).                          
011696             88  PC189-AUDIT-COMPLETE           VALUE  SPACE.             
011697             88  PC189-QC-SPOT-AUDIT            VALUE  'Q'.               
011698             88  PC189-UNKNOWN                  VALUE  'U'.               
011699             88  PC189-REWORK                   VALUE  'R'.               
011700             88  PC189-100-PERCENT              VALUE  '%'.               
011701         10 FILLER                    PIC X(01) VALUE  ''.               
011702*                                                                         
011703         10  FILLER                  PIC X(74)    VALUE  SPACES.          
011710*                                                                         
011720*                                                                         
011730*****                                                                     
011740*                                                                         
011750* E     - NUMBER OF COPIES THAT WILL PRINT FOR EACH LABEL                 
011760*                                                                         
011770*                                                                         
011800     05 FILLER.                                                           
012000         10 FILLER                   PIC X(02) VALUE                      
012100            'E'.                                                         
012200         10 PC189-SML-TOT-LBLS       PIC X(04) VALUE SPACES.              
012300         10  FILLER                  PIC X(01)    VALUE  ''.             
012500* G -                                                                     
012700         10 FILLER                   PIC X(02) VALUE                      
012800            'G'.                                                         
012900         10  FILLER                  PIC X(01)    VALUE  ''.             
012910         10  FILLER                  PIC X(230)   VALUE  SPACES.          
013000                                                                          
013600                                                                          
013700 01  PC189-SML-LABEL-DATA-TABLE                                           
013800             REDEFINES PC189-SML-LABEL-DATA.                              
013900     05 PC189-SML-LABEL-LINE OCCURS  3 TIMES                              
014000                           INDEXED BY PC189-IDX                           
014100                                      PIC X(240).                         
014101                                                                          
014102*----------------------------------------------------------------*        
014103* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
014104*----------------------------------------------------------------*        
014105 01  PC189-SML-DATA-LENGTH.                                               
014106     05  FILLER                        PIC 9(03)    VALUE  229.           
014107     05  FILLER                        PIC 9(03)    VALUE  166.           
014108     05  FILLER                        PIC 9(03)    VALUE   10.           
014112                                                                          
014113 01  PC189-SML-DATA-LNGTH-VALUES REDEFINES PC189-SML-DATA-LENGTH.         
014114     05  PC189-SML-DATA-LINE-LENGTH   OCCURS 3 TIMES                      
014115                                      INDEXED BY PC189-IDX-2              
014120                                      PIC 9(03).                          
014200                                                                          
014210*----------------------------------------------------------------*        
014220* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                             
014230*----------------------------------------------------------------*        
014240 01  PC189-LABEL-ALLOCATIONS.                                             
014300     05  PC189-CI-CTL-STK-LBL      PIC X(10)   VALUE 'CI-CTL STK'.        
014400     05  PC189-CI-E-COMM-LBL       PIC X(10)   VALUE 'CI-E COMM '.        
014500     05  PC189-CS-CTL-STK-LBL      PIC X(10)   VALUE 'CS-CTL STK'.        
014600     05  PC189-CS-E-COMM-LBL       PIC X(10)   VALUE 'CS-E COMM '.        
014700     05  PC189-STORAGE-HDG-VALUE   PIC X(08)   VALUE 'STORAGE:'.          
014800     05  PC189-ZONE-HDG-VALUE      PIC X(08)   VALUE 'ZONE:   '.          
