000100**************************************************************            
000200*    ******                IMPORTANT                 ******  *            
000300*   THIS IS A COPYBOOK WHICH WILL DEFINE THE DATA ELEMENTS   *            
000400*   FOUND WITHIN THE DTL_TXT COLUMN WITHIN THE               *            
000500*   XXT_BUS_EVNT_DTL TABLE (EAI EXPORT TABLE CONTAINING      *            
000600*   DETAIL INFORMATION ABOUT THE BUSINESS EVENT BEING        *            
000700*   WRITTEN TO THE LOGISTICS DOMAIN EXPORT TABL).  THE       *            
000800*   XX IN THE ABOVE TABLE NAME WOULD BE REPLACED WITH        *            
000900*   THE 2 CHARACTER APPLICATION ID.                          *            
001000*                                                            *            
001100*   THIS COPYBOOK DEFINES A 1000 CHARACTER DETAIL TEXT       *            
001200*   FIELD WHICH WILL THEN BE REDEFINED TO THE VARIOUS        *            
001300*   BUSINESS EVENTS AND WHAT DATA IS FOUND (AND ITS          *            
001400*   FORMATS) WITHIN THE DETAIL TEXT FIELD.                   *            
001500*                                                            *            
001600*   THIS WILL BE USED TO DEFINE THE 1002 CHARACTER AREA IN   *            
001700*   XLWS072 COPY (FIELD NAME XL072-DTL-TXT).                 *            
001800*                                                            *            
001900*   COPYBOOK LENGTH IS 2026                                  *            
002000**************************************************************            
002100 01  PC242-DTL-TXT-AREA.                                                  
002200     05  PC242-DTL-TXT-TYPE           PIC  X(02).                         
002300         88  PC242-DOWNLOAD-PO-PROCESS           VALUE 'AA'.              
002400         88  PC242-CLOSE-ASGMT                   VALUE 'AB'.              
002500         88  PC242-INDIRECT-LABOR                VALUE 'AC'.              
002600         88  PC242-NON-UCC-LBL-PRT               VALUE 'AD'.              
002700         88  PC242-SUMMARIZE-SHIP-DOOR           VALUE 'AE'.              
002800         88  PC242-MANUAL-SCAN-MSTR-CRTN         VALUE 'AF'.              
002900         88  PC242-MANUAL-SCAN-SML-CRTN          VALUE 'AG'.              
003000         88  PC242-OPEN-OTBND-TRLR               VALUE 'AH'.              
003100         88  PC242-CLOSE-OTBND-TRLR              VALUE 'AI'.              
003200         88  PC242-P2L-PICK-MADE                 VALUE 'AJ'.              
003300         88  PC242-P2L-SCAN-INBND-CRTN           VALUE 'AK'.              
003400         88  PC242-P2L-OPEN-OTBND-CRTN           VALUE 'AL'.              
003500         88  PC242-P2L-CLOSE-OTBND-CRTN          VALUE 'AM'.              
003510         88  PC242-ADD-MASTER                    VALUE 'AN'.              
003520         88  PC242-ADD-CHILD-TO-MASTER           VALUE 'AO'.              
003530         88  PC242-ADD-MASTER-TO-MASTER          VALUE 'AP'.              
003540         88  PC242-RMVE-CHILD-FROM-MASTER        VALUE 'AQ'.              
003560         88  PC242-RMVE-MASTER-FROM-MASTER       VALUE 'AR'.              
003570         88  PC242-REASSIGN-TO-MASTER            VALUE 'AS'.              
003580                                                                          
003600     05  PC242-DTL-TXT                PIC  X(1000).                       
003700                                                                          
003800* THE FOLLOWING IS FOR A PO DOWNLOAD PROCESS                              
003900* FROM EITHER CASEPACK SPLIT OR PACK-BY-STORE SMOOTHING                   
004000* ONE FOR EACH PRESS OF THE F KEY TO PERFORM THE PROCESS                  
004100     05  PC242-AA-LAYOUT REDEFINES PC242-DTL-TXT.                         
004200                                                                          
004300         10  PC242-AA-DATA.                                               
004400             15  PC242-AA-ASGMT-STRT-DTE.                                 
004500                 20  PC242-AA-ASGMT-STRT-YYYY       PIC  9(04).           
004600                 20  PC242-AA-ASGMT-STRT-DASH1      PIC  X(01).           
004700                 20  PC242-AA-ASGMT-STRT-MM         PIC  9(02).           
004800                 20  PC242-AA-ASGMT-STRT-DASH2      PIC  X(01).           
004900                 20  PC242-AA-ASGMT-STRT-DD         PIC  9(02).           
005000             15  PC242-AA-ASGMT-NBR-TXT             PIC  X(10).           
005100             15  PC242-AA-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
005200             15  PC242-AA-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
005300             15  PC242-AA-DOOR-NBR                  PIC  X(04).           
005400             15  PC242-AA-PACK-TYPE-CDE             PIC  X(01).           
005500                 88  PC242-AA-BULK-PACK             VALUE 'B'.            
005600                 88  PC242-AA-CASEPACK              VALUE 'C'.            
005700                 88  PC242-AA-INNER-PACK            VALUE 'I'.            
005800                 88  PC242-AA-MULTI-SKU-PACK        VALUE 'M'.            
005900                 88  PC242-AA-SINGLE-SKU-PACK       VALUE 'S'.            
006000                 88  PC242-AA-PACK-BY-STORE         VALUE 'Z'.            
006100         10  PC242-AA-FILLER                        PIC  X(957).          
006200                                                                          
006300* THE FOLLOWING IS FOR A CLOSE OF AN ASSIGNMENT                           
006400* AS OF 12/24/2003 THERE IS NO DATA FOR THIS DETAIL TYPE                  
006500     05  PC242-AB-LAYOUT REDEFINES PC242-DTL-TXT                          
006600                                      PIC  X(1000).                       
006700                                                                          
006800* THE FOLLOWING IS FOR INDIRECT LABOR CODES                               
006900* AS OF 12/24/2003 THERE IS NO DATA FOR THIS DETAIL TYPE                  
007000     05  PC242-AC-LAYOUT REDEFINES PC242-DTL-TXT                          
007100                                      PIC  X(1000).                       
007200                                                                          
007300* THE FOLLOWING IS FOR NON UCC128 LABEL PRINTING                          
007400* FROM EITHER CASEPACK SPLIT OR PACK-BY-STORE SMOOTHING.                  
007500* FROM CASEPACK SPLIT, MULTIPLE OF THESE ENTRIES COULD BE                 
007600* CREATED FOR THE SAME LINE/PACK - ONE FOR THE FULLCASE AND               
007700* ONE FOR PACK-TO-LIGHT.                                                  
007800     05  PC242-AD-LAYOUT REDEFINES PC242-DTL-TXT.                         
007900                                                                          
008000         10  PC242-AD-DATA.                                               
008100             15  PC242-AD-ASGMT-STRT-DTE.                                 
008200                 20  PC242-AD-ASGMT-STRT-YYYY       PIC  9(04).           
008300                 20  PC242-AD-ASGMT-STRT-DASH1      PIC  X(01).           
008400                 20  PC242-AD-ASGMT-STRT-MM         PIC  9(02).           
008500                 20  PC242-AD-ASGMT-STRT-DASH2      PIC  X(01).           
008600                 20  PC242-AD-ASGMT-STRT-DD         PIC  9(02).           
008700             15  PC242-AD-ASGMT-NBR-TXT             PIC  X(10).           
008800             15  PC242-AD-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
008900             15  PC242-AD-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
009000             15  PC242-AD-DOOR-NBR                  PIC  X(04).           
009100             15  PC242-AD-PACK-TYPE-CDE             PIC  X(01).           
009200                 88  PC242-AD-BULK-PACK             VALUE 'B'.            
009300                 88  PC242-AD-CASEPACK              VALUE 'C'.            
009400                 88  PC242-AD-INNER-PACK            VALUE 'I'.            
009500                 88  PC242-AD-MULTI-SKU-PACK        VALUE 'M'.            
009600                 88  PC242-AD-SINGLE-SKU-PACK       VALUE 'S'.            
009700                 88  PC242-AD-PACK-BY-STORE         VALUE 'Z'.            
009800             15  PC242-AD-CRTN-DEST-CD              PIC  X(01).           
009900                 88  PC242-AD-CRTN-TO-LOC           VALUE 'S'.            
010000                 88  PC242-AD-CRTN-TO-P2L           VALUE 'P'.            
010100                 88  PC242-AD-CRTN-TO-MULT-LOC      VALUE 'M'.            
010200             15  PC242-AD-CRTN-DEST-LOC-NBR         PIC  9(04).           
010300             15  PC242-AD-P2L-MODU-DESC             PIC  X(07).           
010400             15  PC242-AD-STR-ZN-ID                 PIC  X(05).           
010500             15  PC242-AD-CRSDCK-LABEL-QTY          PIC  9(05).           
010600             15  PC242-AD-CRSDCK-UNIT-QTY           PIC  9(05).           
010700             15  PC242-AD-P2L-LABEL-QTY             PIC  9(06).           
010800             15  PC242-AD-P2L-UNIT-QTY              PIC  9(06).           
010900             15  PC242-AD-DUMMY-USER-ID             PIC  X(08).           
011000         10  PC242-AD-FILLER                        PIC  X(910).          
011100                                                                          
011200* THE FOLLOWING IS FOR A REQUEST TO SUMMARIZE THE NUMBER OF               
011300* CARTONS DIVERTED TO A SHIPPING DOOR                                     
011400     05  PC242-AE-LAYOUT REDEFINES PC242-DTL-TXT.                         
011500                                                                          
011600         10  PC242-AE-DATA.                                               
011700             15  PC242-AE-ASGMT-STRT-DTE.                                 
011800                 20  PC242-AE-ASGMT-STRT-YYYY       PIC  9(04).           
011900                 20  PC242-AE-ASGMT-STRT-DASH1      PIC  X(01).           
012000                 20  PC242-AE-ASGMT-STRT-MM         PIC  9(02).           
012100                 20  PC242-AE-ASGMT-STRT-DASH2      PIC  X(01).           
012200                 20  PC242-AE-ASGMT-STRT-DD         PIC  9(02).           
012300             15  PC242-AE-ASGMT-NBR-TXT             PIC  X(10).           
012400             15  PC242-AE-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
012500             15  PC242-AE-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
012600         10  PC242-AE-FILLER                        PIC  X(962).          
012700                                                                          
012800* THE FOLLOWING IS FOR THE SCAN OF A MASTER CONTAINER ONTO AN             
012900* OUTBOUND TRAILER (A MASTER CONTAINER IS A CONTAINER THAT HAS            
013000* ONE TO MANY OUTBOUND SML CARTONS ON/INSIDE IT)                          
013100     05  PC242-AF-LAYOUT REDEFINES PC242-DTL-TXT.                         
013200                                                                          
013300         10  PC242-AF-DATA.                                               
013400             15  PC242-AF-ASGMT-STRT-DTE.                                 
013500                 20  PC242-AF-ASGMT-STRT-YYYY       PIC  9(04).           
013600                 20  PC242-AF-ASGMT-STRT-DASH1      PIC  X(01).           
013700                 20  PC242-AF-ASGMT-STRT-MM         PIC  9(02).           
013800                 20  PC242-AF-ASGMT-STRT-DASH2      PIC  X(01).           
013900                 20  PC242-AF-ASGMT-STRT-DD         PIC  9(02).           
014000             15  PC242-AF-ASGMT-NBR-TXT             PIC  X(10).           
014100             15  PC242-AF-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
014200             15  PC242-AF-ASGMT-SEQ-DTL-NBR-O       PIC  9(09).           
014210             15  PC242-AF-ASGMT-SEQ-DTL-NBR-P       PIC  9(09).           
014300             15  PC242-AF-INNER-CARTON-QTY          PIC  9(05).           
014400             15  PC242-AF-INNER-UNIT-QTY            PIC  9(07).           
014500         10  PC242-AF-FILLER                        PIC  X(941).          
014600                                                                          
014700                                                                          
014800* THE FOLLOWING IS FOR THE SCAN OF AN OUTBOUND CONTAINER (SML)            
014900* ONTO AN OUTBOUND TRAILER (THIS IS FOR NON-MASTER CONTAINERS)            
015000     05  PC242-AG-LAYOUT REDEFINES PC242-DTL-TXT.                         
015100                                                                          
015200         10  PC242-AG-DATA.                                               
015300             15  PC242-AG-ASGMT-STRT-DTE.                                 
015400                 20  PC242-AG-ASGMT-STRT-YYYY       PIC  9(04).           
015500                 20  PC242-AG-ASGMT-STRT-DASH1      PIC  X(01).           
015600                 20  PC242-AG-ASGMT-STRT-MM         PIC  9(02).           
015700                 20  PC242-AG-ASGMT-STRT-DASH2      PIC  X(01).           
015800                 20  PC242-AG-ASGMT-STRT-DD         PIC  9(02).           
015900             15  PC242-AG-ASGMT-NBR-TXT             PIC  X(10).           
016000             15  PC242-AG-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
016100             15  PC242-AG-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
016200             15  PC242-AG-CRTN-SCAN-OFFON-CDE       PIC  X(01).           
016300                 88  PC242-AG-CRTN-SCAN-ON          VALUE 'A'.            
016400                 88  PC242-AG-CRTN-SCAN-OFF         VALUE 'B'.            
016500         10  PC242-AG-FILLER                        PIC  X(961).          
016600                                                                          
016700* THE FOLLOWING IS FOR THE OPENING OF AN OUTBOUND TRAILER                 
016800     05  PC242-AH-LAYOUT REDEFINES PC242-DTL-TXT.                         
016900                                                                          
017000         10  PC242-AH-DATA.                                               
017100             15  PC242-AH-ASGMT-STRT-DTE.                                 
017200                 20  PC242-AH-ASGMT-STRT-YYYY       PIC  9(04).           
017300                 20  PC242-AH-ASGMT-STRT-DASH1      PIC  X(01).           
017400                 20  PC242-AH-ASGMT-STRT-MM         PIC  9(02).           
017500                 20  PC242-AH-ASGMT-STRT-DASH2      PIC  X(01).           
017600                 20  PC242-AH-ASGMT-STRT-DD         PIC  9(02).           
017700             15  PC242-AH-ASGMT-NBR-TXT             PIC  X(10).           
017800             15  PC242-AH-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
017900             15  PC242-AH-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
018000         10  PC242-AH-FILLER                        PIC  X(962).          
018100                                                                          
018200* THE FOLLOWING IS FOR THE CLOSING OF AN OUTBOUND TRAILER                 
018300     05  PC242-AI-LAYOUT REDEFINES PC242-DTL-TXT.                         
018400                                                                          
018500         10  PC242-AI-DATA.                                               
018600             15  PC242-AI-ASGMT-STRT-DTE.                                 
018700                 20  PC242-AI-ASGMT-STRT-YYYY       PIC  9(04).           
018800                 20  PC242-AI-ASGMT-STRT-DASH1      PIC  X(01).           
018900                 20  PC242-AI-ASGMT-STRT-MM         PIC  9(02).           
019000                 20  PC242-AI-ASGMT-STRT-DASH2      PIC  X(01).           
019100                 20  PC242-AI-ASGMT-STRT-DD         PIC  9(02).           
019200             15  PC242-AI-ASGMT-NBR-TXT             PIC  X(10).           
019300             15  PC242-AI-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
019400             15  PC242-AI-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
019500         10  PC242-AI-FILLER                        PIC  X(962).          
019600                                                                          
019700* THE FOLLOWING IS FOR THE PICK (OR PACK) OF UNITS WITHIN THE             
019800* PACK-TO-LIGHT SYSTEM.                                                   
019900     05  PC242-AJ-LAYOUT REDEFINES PC242-DTL-TXT.                         
020000                                                                          
020100         10  PC242-AJ-DATA.                                               
020200             15  PC242-AJ-ASGMT-STRT-DTE.                                 
020300                 20  PC242-AJ-ASGMT-STRT-YYYY       PIC  9(04).           
020400                 20  PC242-AJ-ASGMT-STRT-DASH1      PIC  X(01).           
020500                 20  PC242-AJ-ASGMT-STRT-MM         PIC  9(02).           
020600                 20  PC242-AJ-ASGMT-STRT-DASH2      PIC  X(01).           
020700                 20  PC242-AJ-ASGMT-STRT-DD         PIC  9(02).           
020800             15  PC242-AJ-ASGMT-NBR-TXT             PIC  X(10).           
020900             15  PC242-AJ-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
021000             15  PC242-AJ-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
021100             15  PC242-AJ-STR-ZN-ID                 PIC  X(05).           
021200             15  PC242-AJ-INNER-PK-IND              PIC  X(01).           
021300                 88  PC242-AJ-INNER-PK-YES          VALUE 'Y'.            
021400                 88  PC242-AJ-INNER-PK-NO           VALUE 'N'.            
021500             15  PC242-AJ-INNER-PK-QTY              PIC  9(05).           
021600             15  PC242-AJ-EXP-PICK-ORDER-QTY        PIC  9(05).           
021700             15  PC242-AJ-PICKED-QTY                PIC  9(05).           
021800             15  PC242-AJ-PICKED-QTY-SIGN           PIC  X(01).           
021900                 88  PC242-AJ-PICKED-QTY-POS        VALUE 'P'.            
022000                 88  PC242-AJ-PICKED-QTY-NEG        VALUE 'N'.            
022100             15  PC242-AJ-TOTAL-PICKED-QTY          PIC  9(05).           
022110             15  PC242-AJ-ASGMT-SEQ-DTL-NBR-2       PIC  9(09).           
022200         10  PC242-AJ-FILLER                        PIC  X(926).          
022300                                                                          
022400* THE FOLLOWING IS FOR THE SCAN OF AN INBOUND CARTON INTO A               
022500* PACK-TO-LIGHT SYSTEM.                                                   
022600     05  PC242-AK-LAYOUT REDEFINES PC242-DTL-TXT.                         
022700                                                                          
022800         10  PC242-AK-DATA.                                               
022900             15  PC242-AK-ASGMT-STRT-DTE.                                 
023000                 20  PC242-AK-ASGMT-STRT-YYYY       PIC  9(04).           
023100                 20  PC242-AK-ASGMT-STRT-DASH1      PIC  X(01).           
023200                 20  PC242-AK-ASGMT-STRT-MM         PIC  9(02).           
023300                 20  PC242-AK-ASGMT-STRT-DASH2      PIC  X(01).           
023400                 20  PC242-AK-ASGMT-STRT-DD         PIC  9(02).           
023500             15  PC242-AK-ASGMT-NBR-TXT             PIC  X(10).           
023600             15  PC242-AK-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
023700             15  PC242-AK-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
023800             15  PC242-AK-STR-ZN-ID                 PIC  X(05).           
023900         10  PC242-AK-FILLER                        PIC  X(957).          
024000                                                                          
024100* THE FOLLOWING IS FOR THE OPEN OF AN OUTBOUND CARTON FROM A              
024200* PACK-TO-LIGHT SYSTEM.                                                   
024300     05  PC242-AL-LAYOUT REDEFINES PC242-DTL-TXT.                         
024400                                                                          
024500         10  PC242-AL-DATA.                                               
024600             15  PC242-AL-ASGMT-STRT-DTE.                                 
024700                 20  PC242-AL-ASGMT-STRT-YYYY       PIC  9(04).           
024800                 20  PC242-AL-ASGMT-STRT-DASH1      PIC  X(01).           
024900                 20  PC242-AL-ASGMT-STRT-MM         PIC  9(02).           
025000                 20  PC242-AL-ASGMT-STRT-DASH2      PIC  X(01).           
025100                 20  PC242-AL-ASGMT-STRT-DD         PIC  9(02).           
025200             15  PC242-AL-ASGMT-NBR-TXT             PIC  X(10).           
025300             15  PC242-AL-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
025400             15  PC242-AL-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
025500             15  PC242-AL-STR-ZN-ID                 PIC  X(05).           
025600         10  PC242-AL-FILLER                        PIC  X(957).          
025700                                                                          
025800* THE FOLLOWING IS FOR THE CLOSE OF AN OUTBOUND CARTON FROM A             
025900* PACK-TO-LIGHT SYSTEM.                                                   
026000     05  PC242-AM-LAYOUT REDEFINES PC242-DTL-TXT.                         
026100                                                                          
026200         10  PC242-AM-DATA.                                               
026300             15  PC242-AM-ASGMT-STRT-DTE.                                 
026400                 20  PC242-AM-ASGMT-STRT-YYYY       PIC  9(04).           
026500                 20  PC242-AM-ASGMT-STRT-DASH1      PIC  X(01).           
026600                 20  PC242-AM-ASGMT-STRT-MM         PIC  9(02).           
026700                 20  PC242-AM-ASGMT-STRT-DASH2      PIC  X(01).           
026800                 20  PC242-AM-ASGMT-STRT-DD         PIC  9(02).           
026900             15  PC242-AM-ASGMT-NBR-TXT             PIC  X(10).           
027000             15  PC242-AM-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
027100             15  PC242-AM-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
027200             15  PC242-AM-STR-ZN-ID                 PIC  X(05).           
027300         10  PC242-AM-FILLER                        PIC  X(957).          
027400                                                                          
027500* THE FOLLOWING IS FOR ADD MASTER                                         
027600     05  PC242-AN-LAYOUT REDEFINES PC242-DTL-TXT.                         
027700                                                                          
027800         10  PC242-AN-DATA.                                               
027900             15  PC242-AN-ASGMT-STRT-DTE.                                 
028000                 20  PC242-AN-ASGMT-STRT-YYYY       PIC  9(04).           
028100                 20  PC242-AN-ASGMT-STRT-DASH1      PIC  X(01).           
028200                 20  PC242-AN-ASGMT-STRT-MM         PIC  9(02).           
028300                 20  PC242-AN-ASGMT-STRT-DASH2      PIC  X(01).           
028400                 20  PC242-AN-ASGMT-STRT-DD         PIC  9(02).           
028500             15  PC242-AN-ASGMT-NBR-TXT             PIC  X(10).           
028600             15  PC242-AN-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
028700             15  PC242-AN-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
028800         10  PC242-AN-FILLER                        PIC  X(962).          
028900                                                                          
029000* THE FOLLOWING IS FOR ADD CHILD TO MASTER                                
029100     05  PC242-AO-LAYOUT REDEFINES PC242-DTL-TXT.                         
029200                                                                          
029300         10  PC242-AO-DATA.                                               
029400             15  PC242-AO-ASGMT-STRT-DTE.                                 
029500                 20  PC242-AO-ASGMT-STRT-YYYY       PIC  9(04).           
029600                 20  PC242-AO-ASGMT-STRT-DASH1      PIC  X(01).           
029700                 20  PC242-AO-ASGMT-STRT-MM         PIC  9(02).           
029800                 20  PC242-AO-ASGMT-STRT-DASH2      PIC  X(01).           
029900                 20  PC242-AO-ASGMT-STRT-DD         PIC  9(02).           
030000             15  PC242-AO-ASGMT-NBR-TXT             PIC  X(10).           
030100             15  PC242-AO-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
030200             15  PC242-AO-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
030300         10  PC242-AO-FILLER                        PIC  X(962).          
030400                                                                          
030500* THE FOLLOWING IS FOR ADD MASTER TO MASTER                               
030600     05  PC242-AP-LAYOUT REDEFINES PC242-DTL-TXT.                         
030700                                                                          
030800         10  PC242-AP-DATA.                                               
030900             15  PC242-AP-ASGMT-STRT-DTE.                                 
031000                 20  PC242-AP-ASGMT-STRT-YYYY       PIC  9(04).           
031100                 20  PC242-AP-ASGMT-STRT-DASH1      PIC  X(01).           
031200                 20  PC242-AP-ASGMT-STRT-MM         PIC  9(02).           
031300                 20  PC242-AP-ASGMT-STRT-DASH2      PIC  X(01).           
031400                 20  PC242-AP-ASGMT-STRT-DD         PIC  9(02).           
031500             15  PC242-AP-ASGMT-NBR-TXT             PIC  X(10).           
031600             15  PC242-AP-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
031700             15  PC242-AP-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
031800         10  PC242-AP-FILLER                        PIC  X(962).          
031900                                                                          
032000* THE FOLLOWING IS FOR REMOVE CHILD FROM MASTER                           
032100     05  PC242-AQ-LAYOUT REDEFINES PC242-DTL-TXT.                         
032200                                                                          
032300         10  PC242-AQ-DATA.                                               
032400             15  PC242-AQ-ASGMT-STRT-DTE.                                 
032500                 20  PC242-AQ-ASGMT-STRT-YYYY       PIC  9(04).           
032600                 20  PC242-AQ-ASGMT-STRT-DASH1      PIC  X(01).           
032700                 20  PC242-AQ-ASGMT-STRT-MM         PIC  9(02).           
032800                 20  PC242-AQ-ASGMT-STRT-DASH2      PIC  X(01).           
032900                 20  PC242-AQ-ASGMT-STRT-DD         PIC  9(02).           
033000             15  PC242-AQ-ASGMT-NBR-TXT             PIC  X(10).           
033100             15  PC242-AQ-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
033200             15  PC242-AQ-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
033300         10  PC242-AQ-FILLER                        PIC  X(962).          
033400                                                                          
033500* THE FOLLOWING IS FOR REMOVE MASTER FROM MASTER                          
033600     05  PC242-AR-LAYOUT REDEFINES PC242-DTL-TXT.                         
033700                                                                          
033800         10  PC242-AR-DATA.                                               
033900             15  PC242-AR-ASGMT-STRT-DTE.                                 
034000                 20  PC242-AR-ASGMT-STRT-YYYY       PIC  9(04).           
034100                 20  PC242-AR-ASGMT-STRT-DASH1      PIC  X(01).           
034200                 20  PC242-AR-ASGMT-STRT-MM         PIC  9(02).           
034300                 20  PC242-AR-ASGMT-STRT-DASH2      PIC  X(01).           
034400                 20  PC242-AR-ASGMT-STRT-DD         PIC  9(02).           
034500             15  PC242-AR-ASGMT-NBR-TXT             PIC  X(10).           
034600             15  PC242-AR-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
034700             15  PC242-AR-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
034800         10  PC242-AR-FILLER                        PIC  X(962).          
034900                                                                          
035000* THE FOLLOWING IS FOR REASSIGN TO MASTER                                 
035100     05  PC242-AS-LAYOUT REDEFINES PC242-DTL-TXT.                         
035200                                                                          
035300         10  PC242-AS-DATA.                                               
035400             15  PC242-AS-ASGMT-STRT-DTE.                                 
035500                 20  PC242-AS-ASGMT-STRT-YYYY       PIC  9(04).           
035600                 20  PC242-AS-ASGMT-STRT-DASH1      PIC  X(01).           
035700                 20  PC242-AS-ASGMT-STRT-MM         PIC  9(02).           
035800                 20  PC242-AS-ASGMT-STRT-DASH2      PIC  X(01).           
035900                 20  PC242-AS-ASGMT-STRT-DD         PIC  9(02).           
036000             15  PC242-AS-ASGMT-NBR-TXT             PIC  X(10).           
036100             15  PC242-AS-ASGMT-NBR-SEQ-NBR         PIC  9(09).           
036200             15  PC242-AS-ASGMT-SEQ-DTL-NBR         PIC  9(09).           
036300         10  PC242-AS-FILLER                        PIC  X(962).          
036400                                                                          
