000100*  PCWS233 - 1500 BYTES                                           00010005
000200*                                                                 00020005
000300*  THIS MEMBER CONTAINS THE COMMON DATA THAT IS PASSED BETWEEN    00030005
000400*  THE RF TERMINALS IN THE MANIFESTING SYSTEM TRAILER             00040005
000500* MANAGEMENT SUB-SYSTEM                                           00050005
000600*                                                                 00060005
000700******************************************************************00070005
000800* ACTUAL MESSAGES ARE IN COPYBOOK PCWS235                        *00080005
000900******************************************************************00090005
001000     05  PC233-COMMON-DATA.                                       00100005
001100         10  PC233-TRANSACTION-STATUS PIC X(01)     VALUE SPACE.  00110005
001200             88  PC233-INITIALIZE-SCREEN            VALUE 'S'.    00120005
001300             88  PC233-PROCESS-SCREEN               VALUE 'R'.    00130005
001400             88  PC233-WAIT-FOR-CONFIRM             VALUE 'W'.    00140005
001500             88  PC233-UPDATE-CONFIRMED             VALUE 'U'.    00150005
001600             88  PC233-ABEND                        VALUE 'A'.    00160005
001700             88  PC233-REOPEN-CARTON                VALUE 'P'.    00170005
001800             88  PC233-CONFIRM-TRAILER-SEAL         VALUE 'L'.    00180005
001900             88  PC233-TRAILER-REOPENED             VALUE 'O'.    00190005
002000         10  PC233-XCTL-SW            PIC X(01)     VALUE SPACE.  00200005
002100             88  PC233-XCTL                         VALUE 'Y'.    00210005
002200*        NAVIGATION                                               00220005
002300         10  PC233-LAST-PROGRAM       PIC X(08)     VALUE SPACE.  00230005
002400         10  PC233-NEXT-PROGRAM       PIC X(08)     VALUE SPACE.  00240005
002500         10  PC233-MENU-PROGRAM       PIC X(08)     VALUE SPACE.  00250005
002600         10  PC233-ROOT-PROGRAM       PIC X(08)     VALUE SPACE.  00260005
002700                                                                  00270005
002800*        IDENTIFICATION                                           00280005
002900         10  PC233-TERM-ID            PIC X(04)     VALUE SPACE.  00290005
003000         10  PC233-TRAN-ID            PIC X(04)     VALUE SPACE.  00300005
003100         10  PC233-USER-ID            PIC X(08)     VALUE SPACE.  00310005
003200         10  PC233-RETURN-MSG         PIC X(19)     VALUE SPACE.  00320005
003300                                                                  00330005
003400*        SHARED FIELDS                                            00340005
003500                                                                  00350005
003600*        CONVEYOR FIELDS                                          00360005
003700         10  PC233-OPER-UNT-ID        PIC S9(04)    VALUE ZERO    00370005
003800                                                    COMP.         00380005
003900         10  PC233-FCLTY-ID           PIC S9(04)    VALUE ZERO    00390005
004000                                                    COMP.         00400005
004100         10  PC233-DOOR-ID            PIC X(04)     VALUE SPACE.  00410005
004200         10  PC233-STR-NBR            PIC S9(04)    VALUE ZERO    00420005
004300                                                    COMP.         00430005
004400         10  PC233-DIVERT-NBR         PIC S9(09)    VALUE ZERO    00440005
004500                                                    COMP.         00450005
004600         10  PC233-DIVERT-LOC-ID      PIC X(04)     VALUE SPACE.  00460005
004700         10  PC233-DIVERT-TMST        PIC X(26)     VALUE ZEROES. 00470005
004800         10  PC233-CARTON             PIC S9(18)V   COMP-3.       00480005
004900         10  PC233-BRCDE-NBR          PIC X(22)     VALUE SPACE.  00490005
005000                                                                  00500005
005100*  THE CUTOFF TYPE MATTERS ONLY WHEN ASSIGNING AN END-POINT.      00510005
005200*  ALL CARTONS BETWEEN THE START AND END POINTS ON A DIVERTER     00520005
005300*  LINE ARE ASSUMED TO BE LOADED ONTO THE TRAILER PARKED AT       00530005
005400*  THE END OF THAT DIVERTER LINE.  SO IT FOLLOWS THAT IF THE      00540005
005500*  CUTOFF TYPE IS BLANK WE ARE ASSIGNING A START POINT.           00550005
005600         10  PC233-CONVEYOR-CUTOFF-TYPE                           00560005
005700                                      PIC X(01)     VALUE SPACE.  00570005
005800             88  PC233-FIRST-CTN-ON-NEXT-TRLR       VALUE 'F'.    00580005
005900             88  PC233-LAST-CTN-ON-THIS-TRLR        VALUE 'L'.    00590005
006000             88  PC233-CUTOFF-START-CTN             VALUE SPACE.  00600005
006100                                                                  00610005
006200*        TRAILER FIELDS                                           00620005
006300         10  PC233-TRIP-ID            PIC S9(09)    VALUE ZERO    00630005
006400                                                    COMP.         00640005
006500         10  PC233-SERIAL-NBR         PIC S9(09)    VALUE ZERO    00650005
006600                                                    COMP.         00660005
006700         10  PC233-OWNER-SCAC-ID      PIC X(04)     VALUE SPACE.  00670005
006800         10  PC233-TRAILER            PIC X(12)     VALUE SPACE.  00680005
006900         10  PC233-SEAL-ID            PIC X(20)     VALUE SPACE.  00690005
007000         10  PC233-TRLR-PRKG-LOC-DESC PIC X(20)     VALUE SPACE.  00700005
007100         10  PC233-TRLR-PRKG-SLOT-NBR PIC X(06)     VALUE SPACE   00710005
007200                                                    JUST RIGHT.   00720005
007300         10  PC233-TRAILER-STATUS     PIC X(10)     VALUE SPACE.  00730005
007400         10  PC233-SCAN-ON-OFF-IND    PIC X(01)     VALUE 'N'.    00740005
007500             88  PC233-SCAN-ON-CONTAINER            VALUE 'N'.    00750005
007600             88  PC233-SCAN-OFF-CONTAINER           VALUE 'F'.    00760005
007700         10  PC233-PARENT-CHILD-IND   PIC X(01)     VALUE 'O'.    00770005
007800             88  PC233-PARENT                       VALUE 'P'.    00780005
007900             88  PC233-CHILD                        VALUE 'C'.    00790005
008000             88  PC233-ORPHAN                       VALUE 'O'.    00800005
008100*                                                                 00810005
008200*        ERROR HANDLING                                           00820005
008300         10  PC233-ERROR-FIELDS.                                  00830005
008400             15 PC233-PGM-MSG-NBR     PIC 9(03)     VALUE ZERO.   00840005
008500                88 PC233-DATABASE-BUSY              VALUE  1.     00850005
008600                88 PC233-UNDEFINED-ERROR            VALUE  2.     00860005
008700                88 PC233-UNRECOVERABLE-ERROR        VALUE  3.     00870005
008800                88 PC233-DOOR-ALREADY-OPEN          VALUE  4.     00880005
008900                88 PC233-TRLR-OPENED-OTHER-DOOR     VALUE 5.      00890005
009000                88 PC233-STORE-OTHER-DOOR           VALUE  6.     00900005
009100                88 PC233-TRAILER-CLOSED             VALUE  7.     00910005
009200                88 PC233-NO-STARTING-CARTON         VALUE  8.     00920005
009300                88 PC233-NO-TRLR-SEAL-MSG-1         VALUE  9.     00930005
009400                88 PC233-NO-DIVERTED-CARTONS        VALUE 10.     00940005
009500                88 PC233-NO-TRLR-SEAL-MSG-2         VALUE 11.     00950005
009600                88 PC233-INVALID-TRLR-STATUS        VALUE 12.     00960005
009700*               88 PC233-BAD-LUCK                   VALUE 13.     00970005
009800                88 PC233-CRTN-ON-DIFF-TRLR          VALUE 14.     00980005
009900                88 PC233-CRTN-TRLR-DIFF-STR         VALUE 15.     00990005
010000                88 PC233-CRTN-IS-MSTR               VALUE 16.     01000005
010100                88 PC233-CRTN-IS-CHILD              VALUE 17.     01010005
010200                88 PC233-CRTN-NOT-ASGN-TRLR         VALUE 18.     01020005
010300                88 PC233-CANT-UNLD-MSTR             VALUE 19.     01030005
010400                88 PC233-NEED-CLOSED-TO-SHIP        VALUE 20.     01040005
010500                88 PC233-INVLD-STAT-AUD-CLSD        VALUE 23.     01050005
010600                88 PC233-INVLD-STAT-AUD-OPEN        VALUE 24.     01060005
010700                88 PC233-BEG-END-SAME-CARTON        VALUE 46.     01070005
010710                88 PC233-STRG-TRLR-MUST-BE-DC       VALUE 51.     01071010
010720                88 PC233-DOOR-NOT-IN-SHIP-GROUP     VALUE 52.     01072012
010800                                                                  01080005
010900             15 PC233-ERROR-NBR       PIC 9(03)     VALUE ZERO.   01090005
011000             15 PC233-ERROR-DOOR-NBR  PIC X(04)     VALUE SPACES. 01100005
011100             15 PC233-ERROR-SCAC-ID   PIC X(04)     VALUE SPACES. 01110005
011200             15 PC233-ERROR-TRLR-ID   PIC X(12)     VALUE SPACES  01120005
011300                                                       JUST RIGHT.01130005
011400             15 PC233-ERROR-SRL-NBR   PIC 9(09)     VALUE ZERO.   01140005
011500             15 PC233-ERROR-TRIP-ID   PIC 9(09)     VALUE ZEROES. 01150005
011600             15 PC233-ERROR-STR-NBR   PIC 9(04)     VALUE ZERO.   01160005
011700             15 PC233-ERROR-TRLR-STR-NBR                          01170005
011800                                      PIC 9(04)     VALUE ZERO.   01180005
011900             15 PC233-ERROR-CTN-STR-NBR                           01190005
012000                                      PIC 9(04)     VALUE ZERO.   01200005
012100             15 PC233-ERROR-KID-COUNT PIC S9(04)    COMP          01210005
012200                                                    VALUE ZERO.   01220005
012300             15 PC233-ERROR-MSTR-CARTON                           01230005
012400                                      PIC S9(18)V   COMP-3        01240005
012500                                                    VALUE ZERO.   01250005
012600             15 PC233-ERROR-TRLR-STATUS                           01260005
012700                                      PIC X(10)     VALUE SPACES. 01270005
012800                                                                  01280005
012900*        DB2 ABEND FIELDS                                         01290005
013000*                                                                 01300005
013100         10  PC233-DFHEIBLK           PIC X(85)     VALUE SPACE.  01310005
013200         10  PC233-SQLCODE            PIC S9(04)    COMP.         01320005
013300         10  PC233-SQLCA              PIC X(136)    VALUE SPACES. 01330005
013400         10  PC233-PARAGRAPH          PIC X(19)     VALUE SPACES. 01340005
013500         10  PC233-DB2-TABLE-NAME    OCCURS 5 TIMES               01350005
013600                                      PIC  X(18).                 01360005
013700         10  PC233-MESSAGE-TABLE.                                 01370005
013800             15 PC233-MESSAGE-TEXT   OCCURS 4 TIMES               01380005
013900                                      PIC X(79)     VALUE SPACE.  01390005
014000                                                                  01400005
014100     05  PC233-TRLR-SEALED-SW         PIC X(01)     VALUE SPACE.  01410005
014200         88  PC233-TRLR-SEALED                      VALUE 'Y'.    01420005
014300     05  PC233-PATH-USED-SW           PIC X(01)     VALUE SPACE.  01430005
014400         88  PC233-OPEN-TRLR                        VALUE 'O'.    01440005
014500         88  PC233-CLOSE-TRLR                       VALUE 'C'.    01450005
014600         88  PC233-CONVEYOR-CUTOFF                  VALUE 'V'.    01460005
014700     05  PC233-DOOR-TYPE-CDE          PIC  X(02)    VALUE SPACES. 01470005
014800         88  PC233-SHIPPING                         VALUE 'SH'.   01480005
014900         88  PC233-SHUTTLE                          VALUE 'DS'.   01490005
015000         88  PC233-STORAGE                          VALUE 'ST'.   01500005
015100     05  PC233-EMPTY-PALLETS          PIC S9(04)    VALUE ZEROES  01510005
015200                                                    COMP.         01520005
015300     05  PC233-TOT-CARTONS            PIC S9(07)    COMP-3        01530005
015400                                                    VALUE ZERO.   01540005
015500     05  PC233-TOT-ERROR-CARTONS      PIC S9(07)    COMP-3        01550005
015600                                                    VALUE ZERO.   01560005
015700     05  PC233-SEASET-DIVERT-PFX-NBR  PIC S9(04)    COMP          01570005
015800                                                    VALUE ZERO.   01580005
015900     05  PC233-SEASET-STR-RLSE-BEG-DTE PIC X(10)    VALUE SPACES. 01590005
016000                                                                  01600006
016100* FIELDS FOR INTERFACING TO LABOR                                 01610006
016200                                                                  01620006
016300     05  PC233-ASGMT-STRT-DTE          PIC  X(10)  VALUE SPACE.   01630006
016400         88  PC233-DC-NOT-INTERFACED               VALUE SPACE.   01640006
016500     05  PC233-ASGMT-NBR-TXT           PIC  X(10)  VALUE SPACE.   01650006
016600     05  PC233-ASGMT-NBR-SEQ-NBR       PIC S9(09)  VALUE ZERO     01660006
016700                                                   COMP.          01670006
016800     05  PC233-P4-DOOR-ID              PIC  X(04)  VALUE SPACE.   01680006
016900     05  PC233-P4-DOOR-GP-NBR          PIC S9(04)  VALUE ZERO     01690009
017000                                                   COMP.          01700006
017100     05  PC233-P4-INTERFACE-SW         PIC  X(01)  VALUE 'U'.     01710007
017200         88  PC233-P4-INTERFACE-YES                VALUE 'Y'.     01720006
017300         88  PC233-P4-INTERFACE-NO                 VALUE 'N'.     01730006
017400         88  PC233-P4-INTERFACE-UNKNOWN            VALUE 'U'.     01740007
017500                                                                  01750006
017501*                                                                 01750113
017510*** DMH - 1/30/13 BEGIN                                           01751013
017600***  05  FILLER                       PIC X(189)    VALUE SPACE.  01760013
017610     05  PC233-ERROR-DIVERT-SML       PIC X(18)     VALUE SPACES. 01761015
017620     05  PC233-ERROR-DIVERT-DATE      PIC X(10)     VALUE SPACE.  01762014
017621     05  PC233-ERROR-DIVERT-TIME      PIC X(05)     VALUE SPACE.  01762114
017630     05  FILLER                       PIC X(156)    VALUE SPACE.  01763013
017631*** DMH - 1/30/13 END                                             01763113
017640*                                                                 01764013
017700     05  PC233-HOST-SAVE-AREA         PIC X(300)    VALUE SPACES. 01770005
