000001******************************************************************00000105
000002**                        PCWS201                               **00000205
000003**                                                              **00000305
000004**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00000405
000005**  PACK-BY-STORE SMOOTHING APPLICATION                         **00000505
000006**  LENGTH:  200 BYTES                                          **00000605
000007******************************************************************00000705
000008    10  PC201-INTER-APPL-COMMAREA  REDEFINES                      00000805
000009        INTER-APPL-COMM-AREA.                                     00000905
000010        15  FILLER                         PIC  X(01).            00001005
000011        15  PC201-PO-NBR                   PIC S9(09).            00001105
000012        15  PC201-REC-SEQ-NBR              PIC S9(09).            00001205
000013        15  PC201-OPER-UNT-ID              PIC S9(04).            00001305
000014        15  PC201-FCLTY-ID                 PIC S9(04).            00001405
000015        15  PC201-CURR-OPER-UNT-ID         PIC S9(04).            00001505
000016        15  PC201-CURR-FCLTY-ID            PIC S9(04).            00001605
000017        15  PC201-SML-PRTR-ID              PIC  X(08).            00001705
000018        15  PC201-STR-NUMBER               PIC S9(09).            00001812
000019        15  PC201-SHP-PRTR-CLUSTER-NBR     PIC S9(04).            00001910
000020        15  PC201-SHP-PRTR-IP-ADDR         PIC  X(15).            00002010
000021        15  PC201-SHP-PRTR-OS-RLSE-CDE     PIC  X(05).            00002110
000022        15  PC201-SHP-DATA-XFER-MODE-ID    PIC  X(02).            00002210
000023        15  PC201-SHP-PRTR-TYP-CDE         PIC  X(08).            00002310
000024        15  PC201-SHP-XMIT-INTFC-CDE       PIC  X(01).            00002405
000025        15  PC201-DC-PRTD-AT               PIC  X(02).            00002505
000027        15  PC201-UCC128-DATA-IND          PIC  X(01).            00002708
000028        15  PC201-RECEIVER-TROUBLE-SW      PIC  X(01).            00002814
000029            88  PC201-RECEIVER-TROUBLE-YES    VALUE 'Y'.          00002914
000030            88  PC201-RECEIVER-TROUBLE-NO     VALUE 'N'.          00003014
000040        15  FILLER                         PIC  X(109).           00004014
