000100*  COMMAREA LAYOUT TO PASS THE PCC INBOUND LAUNCH INFORMATION     00010000
000200*  TO PCKCS763                                                    00020000
000300*  COPYBOOK LENGTH IS 250.                                        00030002
000400                                                                  00040000
000500 01  PC244-COMMAREA.                                              00050000
000600     05  PC244-FUNCTION               PIC  X(15)                  00060000
000700                                      VALUE 'INBOUNDLAUNCHED'.    00070001
000800     05  PC244-CALLING-PROGRAM        PIC  X(08)  VALUE SPACES.   00080000
000900                                                                  00090000
001000     05  PC244-CALL-RETURN-AREA.                                  00100000
001100         10  PC244-CRA-RET-CDE        PIC  X(02)  VALUE '00'.     00110000
001200             88  PC244-SUCCESSFUL                 VALUE '00'.     00120000
001300             88  PC244-ERROR                      VALUE '01'.     00130000
001400             88  PC244-SQL-ERROR                  VALUE '02'.     00140000
001500             88  PC244-INVALID-DATA               VALUE '03'.     00150000
001501             88  PC244-UNKNOWN-USER               VALUE '04'.     00150104
001600         10  PC244-CRA-RET-MSG        PIC  X(25)  VALUE SPACES.   00160000
001700                                                                  00170000
001800     05  PC244-DC-NBR                 PIC  9(04)  VALUE ZEROS.    00180000
001900     05  PC244-AREA-NAME              PIC  X(10)  VALUE SPACES.   00190002
002000     05  PC244-TAG-BAR-CODE-NBR       PIC  X(22)  VALUE ZEROS.    00200002
002100     05  PC244-PICK-ORDER-NBR.                                    00210002
002200         10  PC244-HDR-ORD-NBR        PIC  X(08).                 00220002
002300         10  PC244-HDR-RCVR-SEQ-NBR   PIC  X(03).                 00230002
002400         10  PC244-HDR-ORD-LNE-NBR    PIC  X(04).                 00240002
002500         10  PC244-HDR-WORK-ORD-SEQ-NBR                           00250002
002600                                      PIC  X(03).                 00260002
002700         10  PC244-HDR-WO-INS-SEQ-NBR PIC  X(03).                 00270002
002800     05  PC244-LAUNCH-DATE.                                       00280002
002900         10  PC244-LAUNCH-DATE-YYYY   PIC  X(04).                 00290002
003000         10  PC244-FILLER-1           PIC  X(01).                 00300002
003100         10  PC244-LAUNCH-DATE-MM     PIC  X(02).                 00310002
003200         10  PC244-FILLER-1           PIC  X(01).                 00320002
003300         10  PC244-LAUNCH-DATE-DD     PIC  X(02).                 00330002
003400     05  PC244-LAUNCH-TIME.                                       00340002
003500         10  PC244-LAUNCH-TIME-HH     PIC  X(02).                 00350002
003600         10  PC244-FILLER-1           PIC  X(01).                 00360002
003700         10  PC244-LAUNCH-TIME-MM     PIC  X(02).                 00370003
003800         10  PC244-FILLER-1           PIC  X(01).                 00380002
003900         10  PC244-LAUNCH-TIME-SS     PIC  X(02).                 00390003
004000     05  PC244-LAUNCH-USER-ID         PIC  X(08)  VALUE SPACES.   00400002
004100*                                                                 00410000
004200     05  FILLER                       PIC  X(117) VALUE SPACES.   00420002
