000001*****************************************************************         
000003* PCWS159 - PRINT PACKAGE CENTRAL STOCK SML - DATA -  SOCKETS   *         
000004*                                                               *         
000005* THIS IS THE LAYOUT FOR THE DATA PORTION OF A SHIPPING LABEL.  *         
000006* IT MUST BE PRECEDED BY THE FORMS RECORDS DESCRIBED IN PCSW119.*         
000007* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE *         
000008* FIRST POSITION.                                               *         
000009*                                                               *         
000010* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000011*                    I M P O R T A N T                          *         
000012* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 4-05 LEVELS *         
000013* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 *         
000014* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  *         
000015* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        *         
000016* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       *         
000020*****************************************************************         
000900                                                                          
001000 01  PC159-MAX-LABEL-LINES            PIC S9(04) VALUE  +3                
001100                                                COMP SYNC.                
001101***                                                                       
001102***    NUMBER OF 05 LEVELS ------------------------------/\               
001103***                                                                       
001104***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
001105***               IN PC159-SML-DATA-LENGTH.                               
001106***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE               
001107***                                                                       
001110*****************************************************************         
001200 01  PC159-SML-LABEL-DATA.                                                
001300     05 FILLER.                                                           
001400* U01 - STORE NAME                                                        
001500         10  FILLER                  PIC X(04)    VALUE 'U01'.           
001700         10  PC159-SML-STR-NME       PIC X(10)    VALUE SPACES.           
001800         10  FILLER                  PIC X(01)    VALUE  ''.             
001900* U02 - STORE NUMBER                                                      
002000         10  FILLER                  PIC X(04)    VALUE 'U02'.           
002300         10  PC159-SML-STR-NBR       PIC X(04)    VALUE SPACES.           
002400         10  FILLER                  PIC X(01)    VALUE  ''.             
007700* U03 - NUMBER ABOVE BARCODE                                              
007800         10  FILLER                  PIC X(04)    VALUE 'U03'.           
008300         10  PC159-SML-BC-NBR        PIC X(25)    VALUE SPACES.           
008910         10  FILLER                  PIC X(01)    VALUE  ''.             
009000* U04 - BARCODE                                                           
009100         10  FILLER                  PIC X(04)    VALUE 'U04'.           
009500         10  FILLER                  PIC X(01)    VALUE                   
009600            'C'.                                                          
009800         10  PC159-SML-BC            PIC X(20)    VALUE SPACES.           
009900         10  FILLER                  PIC X(01)    VALUE  ''.             
010500* U05 - LABEL NUMBER                                                      
010600         10  FILLER                  PIC X(04)    VALUE 'U05'.           
010900         10  PC159-LABEL-NUMBER.                                          
011000             15  PC159-LABEL-NUMBER-N  PIC 9(04)  VALUE ZERO.             
011100         10  FILLER                  PIC X(01)    VALUE  ''.             
011101* U10 - LABEL DESCRIPTION   (EX: CI-CTL STK)                              
011102         10  FILLER                  PIC X(04)    VALUE 'U10'.           
011103         10  PC159-SML-LBL-DESC      PIC X(10)    VALUE SPACES.           
011105         10  FILLER                  PIC X(01)    VALUE  ''.             
011106* U11 - ZONE/STORAGE HEADING                                              
011107         10  FILLER                  PIC X(04)    VALUE 'U11'.           
011108         10  PC159-ZONE-STRG-HDG     PIC X(08)    VALUE SPACES.           
011109         10  FILLER                  PIC X(01)    VALUE  ''.             
011110* U12 - ZONE/STORAGE DESCRIPTION                                          
011111         10  FILLER                  PIC X(04)    VALUE 'U12'.           
011112         10  PC159-ZONE-STRG-DESC    PIC X(05)    VALUE SPACES.           
011113         10  FILLER                  PIC X(01)    VALUE  ''.             
011114* U16 - LINE NUMBER                                                       
011120         10  FILLER                  PIC X(04)    VALUE 'U16'.           
011130         10  PC159-LINE-NUMBER.                                           
011140             15  PC159-LINE-NUMBER-N  PIC 9(03)   VALUE ZERO.             
011150         10  FILLER                  PIC X(01)    VALUE  ''.             
011200* U30 - 21 DIGIT # BELOW BARCODE ACROSS TOP OF LABEL                      
011201*    (PO, ITEM NUMBER, OUTER PACK)                                        
011300         10  FILLER                  PIC X(04)    VALUE 'U30'.           
011400         10  PC159-PO-ITM-UNITS      PIC X(23)    VALUE SPACES.           
011600         10  FILLER                  PIC X(01)    VALUE  ''.             
011610* U31 - 21 DIGIT BARCODE ACROSS TOP OF LABEL                              
011620*    (PO, ITEM NUMBER, OUTER PACK)                                        
011630         10  FILLER                  PIC X(04)    VALUE 'U31'.           
011631         10  FILLER                  PIC X(01)    VALUE 'C'.              
011640         10  PC159-PO-ITM-UNITS-BC   PIC X(22)    VALUE SPACES.           
011650         10  FILLER                  PIC X(01)    VALUE  ''.             
011651         10  FILLER                  PIC X(49)    VALUE  SPACES.          
011652*                                                                         
011653*                                                                         
011654     05 FILLER.                                                           
011655* U34 - ERROR MESSAGE 1                                                   
011656         10  FILLER                  PIC X(04)    VALUE 'U34'.           
011657         10  PC159-ERROR-MSG-1       PIC X(35)    VALUE SPACES.           
011658         10  FILLER                  PIC X(01)    VALUE  ''.             
011659* U35 - ERROR MESSAGE 2                                                   
011660         10  FILLER                  PIC X(04)    VALUE 'U35'.           
011661         10  PC159-ERROR-MSG-2       PIC X(35)    VALUE SPACES.           
011662         10  FILLER                  PIC X(01)    VALUE  ''.             
011663* U43 - CARTON NUMBER                                                     
011664         10  FILLER                  PIC X(04)    VALUE 'U43'.           
011665         10  PC159-CARTON-NBR        PIC X(05)    VALUE SPACES.           
011666         10  FILLER                  PIC X(01)    VALUE  ''.             
011700         10  FILLER                  PIC X(150)   VALUE  SPACES.          
011710*                                                                         
011720*                                                                         
011730*****                                                                     
011740*                                                                         
011750* E     - NUMBER OF COPIES THAT WILL PRINT FOR EACH LABEL                 
011760*                                                                         
011770*                                                                         
011800     05 FILLER.                                                           
012000         10 FILLER                   PIC X(02) VALUE                      
012100            'E'.                                                         
012200         10 PC159-SML-TOT-LBLS       PIC X(04) VALUE SPACES.              
012300         10  FILLER                  PIC X(01)    VALUE  ''.             
012500* G -                                                                     
012700         10 FILLER                   PIC X(02) VALUE                      
012800            'G'.                                                         
012900         10  FILLER                  PIC X(01)    VALUE  ''.             
012910         10  FILLER                  PIC X(230)   VALUE  SPACES.          
013000                                                                          
013600                                                                          
013700 01  PC159-SML-LABEL-DATA-TABLE                                           
013800             REDEFINES PC159-SML-LABEL-DATA.                              
013900     05 PC159-SML-LABEL-LINE OCCURS  3 TIMES                              
014000                           INDEXED BY PC159-IDX                           
014100                                      PIC X(240).                         
014101                                                                          
014102*----------------------------------------------------------------*        
014103* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
014104*----------------------------------------------------------------*        
014105 01  PC159-SML-DATA-LENGTH.                                               
014106     05  FILLER                        PIC 9(03)    VALUE  191.           
014107     05  FILLER                        PIC 9(03)    VALUE   90.           
014108     05  FILLER                        PIC 9(03)    VALUE   10.           
014112                                                                          
014113 01  PC159-SML-DATA-LNGTH-VALUES REDEFINES PC159-SML-DATA-LENGTH.         
014114     05  PC159-SML-DATA-LINE-LENGTH   OCCURS 3 TIMES                      
014115                                      INDEXED BY PC159-IDX-2              
014120                                      PIC 9(03).                          
014200                                                                          
014210*----------------------------------------------------------------*        
014220* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                             
014230*----------------------------------------------------------------*        
014240 01  PC159-LABEL-ALLOCATIONS.                                             
014300     05  PC159-CI-CTL-STK-LBL      PIC X(10)   VALUE 'CI-CTL STK'.        
014400     05  PC159-CI-E-COMM-LBL       PIC X(10)   VALUE 'CI-E COMM '.        
014500     05  PC159-CS-CTL-STK-LBL      PIC X(10)   VALUE 'CS-CTL STK'.        
014600     05  PC159-CS-E-COMM-LBL       PIC X(10)   VALUE 'CS-E COMM '.        
014700     05  PC159-STORAGE-HDG-VALUE   PIC X(08)   VALUE 'STORAGE:'.          
014800     05  PC159-ZONE-HDG-VALUE      PIC X(08)   VALUE 'ZONE:   '.          
