000100******************************************************************00010000
000200*  THIS COPYBOOK REFLECTS THE COMMAREA LAYOUT TO PASS THE        *00020000
000300*  CARTON ID TO THE MODULE USED TO GATHER LABEL REPRINT          *00030000
000400*  INFORMATION - PCKRF888                       LENGTH = 400     *00040000
000500******************************************************************00050000
000600 01  PC039-COMMAREA-REC.                                          00060000
000700     05  PC039-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00070000
000800         88  PC039-CALLED-FROM-STAT-ACT         VALUE 'PCKRF881'. 00080000
000900         88  PC039-CALLED-FROM-STAT-PO          VALUE 'PCKRF882'. 00090000
001000     05  PC039-CALLED-PGM-NME          PIC  X(08)  VALUE SPACES.  00100007
001100         88  PC039-CALLED-FROM-CRTN-FNT         VALUE 'PCKRF884'. 00110000
001200         88  PC039-CALLED-FROM-SHPG-MN          VALUE 'PCKRF868'. 00120000
001300     05  PC039-CALL-RETURN-AREA.                                  00130000
001400         10  PC039-CRA-RET-CDE         PIC  X(02)  VALUE SPACES.  00140000
001500             88  PC039-SUCCESSFUL                  VALUE '00'.    00150000
001600             88  PC039-ERROR                       VALUE '01'.    00160000
001700             88  PC039-INVALID-SQL                 VALUE '02'.    00170000
001800         10  PC039-CRA-RET-MSG         PIC  X(25)  VALUE SPACES.  00180000
001900         10  PC039-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.  00190000
002000     05  PC039-CARTON-ON-TABLE         PIC  X(01)  VALUE SPACE.   00200000
002100         88  PC039-ON-TSHPUNT                      VALUE 'U'.     00210000
002200         88  PC039-ON-TSULBXF                      VALUE 'X'.     00220000
002300     05  PC039-CARTON-ID-ENTERED       PIC S9(18)V VALUE ZEROES.  00230000
002400                                                                  00240000
002500     05  PC039-CARTON-ID-ENTERED-R REDEFINES                      00250000
002600                                       PC039-CARTON-ID-ENTERED.   00260000
002700         10  PC039-SU-BC-PCKGNG-TYPE   PIC  9(01).                00270000
002800         10  PC039-SU-BC-SFTWRE-SRCE   PIC  9(01).                00280000
002900         10  PC039-SU-BC-DIVERT-CD     PIC  9(05).                00290000
003000         10  PC039-SU-BC-DC-ORIGIN     PIC  9(03).                00300000
003100         10  PC039-SU-BC-MANIFEST-NBR  PIC  9(08).                00310000
003200     05  PC039-SOURCE-ID               PIC  X(03)  VALUE SPACE.   00320000
003300         88  PC039-SRC-ASN                         VALUE 'ASN'.   00330000
003400         88  PC039-SRC-CHECK-IN                    VALUE 'CKN'.   00340000
003500         88  PC039-SRC-CSEPK-SPLT                  VALUE 'CPS'.   00350000
003600         88  PC039-SRC-P2L                         VALUE 'P2L'.   00360000
003700         88  PC039-SRC-MANUAL                      VALUE 'MAN'.   00370000
003800         88  PC039-SRC-RECEIVING                   VALUE 'RCV'.   00380000
003900         88  PC039-SRC-RDM                         VALUE 'RDM'.   00390000
004000         88  PC039-SRC-SMOOTHING                   VALUE 'SMO'.   00400000
004100         88  PC039-SRC-FAST-TRANSFR                VALUE 'FXR'.   00410000
004200         88  PC039-SRC-MSTR-CNTR                   VALUE 'MST'.   00420000
004300         88  PC039-SRC-CRTN-BULD                   VALUE 'MSC'.   00430000
004400         88  PC039-SRC-UNKNOWN                     VALUE '   '.   00440000
004500         88  PC039-SRC-JWL                         VALUE 'JWL'.   00450000
004600         88  PC039-SRC-DMG                         VALUE 'DMG'.   00460000
004610         88  PC039-SRC-3WD                         VALUE '3WD'.   00461008
004700     05  PC039-LBL-FORMAT              PIC  X(01)  VALUE SPACE.   00470000
004800         88  PC039-CENTRAL-STK                     VALUE 'C'.     00480000
004900         88  PC039-E-COMMERCE                      VALUE 'E'.     00490000
005000         88  PC039-DEST-LBL                        VALUE 'D'.     00500000
005100         88  PC039-GENERIC-SML                     VALUE 'G'.     00510000
005200         88  PC039-CSEPK-SML                       VALUE 'P'.     00520000
005300         88  PC039-CHECKIN-SML                     VALUE 'S'.     00530000
005400         88  PC039-CRTN-BUILD                      VALUE 'B'.     00540000
005500         88  PC039-SMOOTHING                       VALUE 'T'.     00550000
005600         88  PC039-PCK-2-LIT                       VALUE 'L'.     00560000
005700         88  PC039-RF-CRTN-LBL                     VALUE 'R'.     00570000
005710         88  PC039-3PTY-WHSE                       VALUE 'W'.     00571008
005800     05  PC039-LBL-TYPE                PIC  X(01)  VALUE SPACE.   00580000
005900         88  PC039-4-BY-4-LBL                      VALUE 'S'.     00590000
006000         88  PC039-PGYBK-LBL                       VALUE 'P'.     00600000
006100     05  PC039-PACK-TYPE               PIC  X(01)  VALUE SPACE.   00610000
006200         88  PC039-NON-PREPK                       VALUE 'N'.     00620000
006300         88  PC039-PREPK                           VALUE 'P'.     00630000
006400     05  PC039-CASE-TYPE               PIC  X(01)  VALUE SPACE.   00640000
006500         88  PC039-FCSE                            VALUE 'F'.     00650000
006600         88  PC039-INPK                            VALUE 'I'.     00660000
006700     05  PC039-ODD-CRTN-IND            PIC  X(01)  VALUE SPACE.   00670000
006800         88  PC039-ODD-CRTN                        VALUE 'Y'.     00680000
006900         88  PC039-NO-ODD-CRTN                     VALUE 'N'.     00690000
007000*                                                                 00700000
007100     05  PC039-PRINTER-ID              PIC  X(03)  VALUE ZEROES.  00710000
007200     05  PC039-PO-NBR                  PIC  9(08)  VALUE ZEROES.  00720000
007300     05  PC039-PO-RCVR                 PIC  9(03)  VALUE ZEROES.  00730000
007400     05  PC039-LNE-NBR                 PIC  9(04)  VALUE ZEROES.  00740000
007500     05  PC039-STR-NBR                 PIC  X(04)  VALUE SPACES.  00750000
007600     05  PC039-STR-NAME                PIC  X(10)  VALUE SPACES.  00760000
007700     05  PC039-PREPK-ID                PIC  9(04)  VALUE ZEROES.  00770000
007800     05  PC039-DEPT                    PIC  X(03)  VALUE SPACES.  00780000
007900     05  PC039-CLASS                   PIC  X(02)  VALUE SPACES.  00790000
008000     05  PC039-SKU                     PIC  X(08)  VALUE SPACES.  00800000
008100     05  PC039-STYLE                   PIC  X(20)  VALUE SPACES.  00810000
008200     05  PC039-OTPK-UNITS              PIC  9(04)  VALUE ZEROES.  00820000
008300     05  PC039-INPK-UNITS              PIC  9(04)  VALUE ZEROES.  00830000
008400     05  PC039-DEPT-NAME               PIC  X(25)  VALUE SPACES.  00840000
008500     05  PC039-MAJOR-CLASS             PIC  X(25)  VALUE SPACES.  00850000
008600     05  PC039-SEASONAL-SET            PIC  X(25)  VALUE SPACES.  00860000
008800     05  PC039-RFID-IND                PIC  X(01)  VALUE SPACES.  00880000
008900         88  PC039-RFID-YES                        VALUE 'Y'.     00890000
009000         88  PC039-RFID-NO                         VALUE 'N'.     00900000
009200     05  PC039-LABEL-PRINT-IND         PIC  X(01)  VALUE SPACES.  00920006
009300         88  PC039-PRINT-RFID                      VALUE 'R'.     00930006
009400         88  PC039-PRINT-EAS                       VALUE 'E'.     00940006
009500         88  PC039-PRINT-RFID-EAS                  VALUE 'B'.     00950006
009700     05  FILLER                        PIC  X(03).                00970006
009800     05  PC039-ZONE                    PIC  X(05)  VALUE SPACES.  00980000
009900     05  PC039-RF-ZNE-LINE-1.                                     00990000
010000         10  PC039-RF-ZONEA            PIC  X(05)  VALUE SPACES.  01000000
010100         10  FILLER                    PIC  X(01)  VALUE SPACES.  01010000
010200         10  PC039-RF-ZONEB            PIC  X(05)  VALUE SPACES.  01020000
010300         10  FILLER                    PIC  X(01)  VALUE SPACES.  01030000
010400         10  PC039-RF-ZONEC            PIC  X(05)  VALUE SPACES.  01040000
010500         10  FILLER                    PIC  X(03)  VALUE SPACES.  01050000
010600     05  PC039-RF-ZNE-LINE-2.                                     01060000
010700         10  PC039-RF-ZONED            PIC  X(05)  VALUE SPACES.  01070000
010800         10  FILLER                    PIC  X(01)  VALUE SPACES.  01080000
010900         10  PC039-RF-ZONEE            PIC  X(05)  VALUE SPACES.  01090000
011000         10  FILLER                    PIC  X(01)  VALUE SPACES.  01100000
011100         10  PC039-RF-ZONEF            PIC  X(05)  VALUE SPACES.  01110000
011200         10  FILLER                    PIC  X(03)  VALUE SPACES.  01120000
011300     05  PC039-RF-ZNE-LINE-3.                                     01130000
011400         10  PC039-RF-ZONEG            PIC  X(05)  VALUE SPACES.  01140000
011500         10  FILLER                    PIC  X(01)  VALUE SPACES.  01150000
011600         10  PC039-RF-ZONEH            PIC  X(05)  VALUE SPACES.  01160000
011700         10  FILLER                    PIC  X(01)  VALUE SPACES.  01170000
011800         10  PC039-RF-ZONEI            PIC  X(05)  VALUE SPACES.  01180000
011900         10  FILLER                    PIC  X(03)  VALUE SPACES.  01190000
012000     05  PC039-PREPK-RATIO             PIC  9(04)  VALUE ZEROES.  01200000
012100     05  PC039-PREPK-UNT-QTY           PIC  9(04)  VALUE ZEROES.  01210000
012200     05  PC039-PACKS-IN-CRTN           PIC  9(04)  VALUE ZEROES.  01220000
012300     05  PC039-KOHLS-BARCODE.                                     01230000
012400         10  PC039-XF-BC-CONTAINER-CD  PIC 9(02) VALUE ZEROES.    01240000
012500         10  PC039-XF-BC-PCKGNG-TYPE   PIC 9(01) VALUE 4.         01250000
012600         10  PC039-XF-BC-SFTWRE-SRCE   PIC 9(01) VALUE 1.         01260000
012700         10  PC039-XF-BC-DIVERT-CD     PIC 9(05) VALUE ZEROES.    01270000
012800         10  PC039-XF-BC-DC-ORIGIN     PIC 9(03) VALUE ZEROES.    01280000
012900         10  PC039-XF-BC-MANIFEST-NBR  PIC 9(08) VALUE ZEROES.    01290000
013000         10  FILLER                    PIC X(02) VALUE SPACES.    01300000
013100     05  PC039-SHIPT-UNT-ID            PIC  9(18)  VALUE ZEROES.  01310000
013200     05  PC039-SHIPT-UNT-ID-R REDEFINES PC039-SHIPT-UNT-ID.       01320000
013300         10  FILLER                    PIC  9(13).                01330000
013400         10  PC039-VNDR-BC-LAST-5      PIC  9(05).                01340000
013500     05  PC039-CURR-OPER-UNT           PIC S9(04)  VALUE ZEROES   01350000
013600                                                          COMP.   01360000
013700*                                                                 01370000
013800     05  PC039-FIXTURE                 PIC  X(10)  VALUE SPACES.  01380000
013900     05  PC039-TRIP-ARRIVE-DATE        PIC  X(10).                01390000
014000     05  PC039-TRIP-ARRIVE-DATE-R                                 01400000
014100         REDEFINES PC039-TRIP-ARRIVE-DATE.                        01410000
014200         10  PC039-TRIP-ARRIVE-CCYY    PIC  X(04).                01420000
014300         10  PC039-TRIP-ARRIVE-DASH1   PIC  X(01).                01430000
014400         10  PC039-TRIP-ARRIVE-MM      PIC  X(02).                01440000
014500         10  PC039-TRIP-ARRIVE-DASH2   PIC  X(01).                01450000
014600         10  PC039-TRIP-ARRIVE-DD      PIC  X(02).                01460000
014700     05  FILLER                        PIC  X(23)  VALUE SPACES.  01470000
