000100******************************************************************00010001
000200*  COMMAREA LAYOUT TO PASS THE CARTON ID TO THE MODULE USED TO   *00020001
000300*  GET CARTON INFORMATION                                        *00030001
000400*  PROGRAM-PCKUT713                             LENGTH = 600     *00040041
000500******************************************************************00050001
000600*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.* 00060022
000700* PCWS046:                                                        00070022
000800*                                                                 00080022
000900*  THIS CONTAINS THE PARAMETER LIST NEEDED TO CALL THE            00090022
001000*  KOHL'S CARTON STATUS ROUTINE, PCKUT713.                        00100022
001100*                                                                 00110022
001200*    IN CICS DO THIS:                                             00110022
001300*                                                                 00110022
001400*          CALL PC046-CARTON-STATUS-MODULE                              35
001500*                  USING DFHEIBLK                                       35
001600*                  PC046-COMMAREA                                       35
001700*                  PC046-COMMAREA-REC                                   35
001800*          END-CALL                                                     35
001900*                                                                 00130022
002000*  IN BATCH DO THIS:                                              00154041
002100*      CALL PC046-CARTON-STATUS-MODULE USING                      00154141
002200*           USING PC046-COMMAREA-REC                              00154241
002300*      END-CALL                                                   00156041
002400*                                                                 00160022
002500*  INITIALIZE BEFORE SETTING UP EACH CARTON STATUS REQUEST:       00170022
002600*                                                                 00180022
002700*      INITIALIZE PC046-COMMAREA-REC.                             00190022
002800*                                                                 00200022
002900*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.* 00210022
003000                                                                  00230022
003100 01  PC046-COMMAREA-REC.                                          00240022
003200     05  PC046-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00250001
003300         88  PC046-FROM-CRTN-STAT               VALUE 'PCKRF881'. 00260001
003400         88  PC046-FROM-SMOOTHING               VALUE 'PCKCS712'. 00270009
003500         88  PC046-FROM-SCAN-ON-OFF             VALUE 'PCKRF879'. 00280024
003600         88  PC046-FROM-MASTER-CONTAINER        VALUE 'PCKRF864'. 00290011
003700         88  PC046-FROM-BARCODE-ENTRY           VALUE 'PCKRF865'. 00300011
003800         88  PC046-FROM-MFST-TRLR-AUDIT         VALUE 'PCKRF894'. 00310017
003900         88  PC046-FROM-SHIPPING-DOOR           VALUE 'SUKCS561'. 00320021
004000     05  PC046-CALL-RETURN-AREA.                                  00330001
004100         10  PC046-CRA-RET-CDE         PIC  X(02)  VALUE ZEROES.  00340008
004200             88  PC046-SUCCESSFUL                  VALUES         00350040
004300                                      ZERO, SPACES, LOW-VALUES.   00351040
004400             88  PC046-ERROR                       VALUE '01'.    00360001
004500             88  PC046-INVALID-SQL                 VALUE '02'.    00370001
004600             88  PC046-DATABASE-BUSY               VALUE '03'.    00380007
004700             88  PC046-CRTN-STAT-ERROR             VALUE '04'.    00390007
004800         10  PC046-CRA-RET-MSG         PIC  X(128) VALUE SPACES.  00400007
004900         10  FILLER                    PIC  X(05).                        
005000         10  PC046-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.  00410006
005100     05  PC046-SQLCA                   PIC X(136).                01440037
005200                                                                          
005300     05  PC046-CARTON-ID               PIC S9(18)V VALUE ZEROES.  00420001
005400*                                                                 00430001
005500     05  PC046-DEST-OPER-UNT-ID        PIC S9(04)  VALUE ZEROES.  00440001
005600     05  PC046-STATUS-USERID           PIC  X(08)  VALUE SPACES.  00450005
005700     05  PC046-CRTN-STAT-TMST          PIC X(26).                 00470001
005800     05  PC046-CRTN-STATUS             PIC  X(02)  VALUE SPACE.   00620001
005900         88  PC046-INVALID-CRTN                    VALUE '01'.    00630003
006000         88  PC046-INACTIVATED                     VALUE '02'.    00640003
006100         88  PC046-SCANNED-OFF-TRLR                VALUE '03'.    00650003
006200         88  PC046-SCANNED-ONTO-TRLR               VALUE '04'.    00660003
006300         88  PC046-DIVERTED-TO-TRLR                VALUE '05'.    00670003
006400         88  PC046-LOADED-ONTO-TRLR                VALUE '06'.    00680025
006500         88  PC046-CASEPACK-SPLIT                  VALUE '07'.    00690003
006600         88  PC046-CHECKED-IN                      VALUE '08'.    00700003
006700         88  PC046-ROUTED-FROM-P2L                 VALUE '09'.    00710003
006800         88  PC046-CRE-BY-RDM                      VALUE '10'.    00720003
006900         88  PC046-CRE-BY-RECV                     VALUE '11'.    00730003
007000         88  PC046-CRE-BY-ASN                      VALUE '12'.    00740003
007100         88  PC046-CRE-BY-SMOOTHING                VALUE '13'.    00750003
007200         88  PC046-CRE-BY-FAST-XFER                VALUE '14'.    00760003
007300         88  PC046-CRE-BY-MSTR-CNTR                VALUE '15'.    00770003
007400         88  PC046-CRE-BY-CRTN-BULD                VALUE '16'.    00780003
007500         88  PC046-ROUTED-FROM-JWL                 VALUE '17'.    00710003
007600         88  PC046-ROUTED-FROM-DMG                 VALUE '18'.    00710003
007610         88  PC046-CRE-BY-3WD                      VALUE '19'.    00710003
007700     05  PC046-CRTN-STAT-DESC          PIC X(19)   VALUE SPACE.   00800001
007800         88  PC046-INVALID-DESC      VALUE 'INVALID CARTON ID  '. 00810004
007900         88  PC046-INACT-UNUSD-DESC  VALUE 'INACTVD-UNUSED LABL'. 00820026
008000         88  PC046-INACT-RECLM-DESC  VALUE 'INACTVD-RECLAM LABL'. 00821026
008100         88  PC046-INACT-CASEPK-DESC VALUE 'INACTVD-CASEPCK DEL'. 00822026
008200         88  PC046-INACT-SMOOTH-DESC VALUE 'INACTVD-BY SMOOTHNG'. 00823030
008300         88  PC046-INACT-MASTER-DESC VALUE '  INACTIVE MASTER  '. 00824032
008400         88  PC046-SC-OF-DESC        VALUE 'SCANNED OFF TRAILER'. 00830001
008500         88  PC046-SC-ON-DESC        VALUE 'SCANNED ON TRAILER '. 00840001
008600         88  PC046-DVRT-DESC         VALUE ' DIVERTED TO DOOR  '. 00850024
008700         88  PC046-LOADED-DESC       VALUE 'LOADED ONTO TRAILER'. 00860001
008800         88  PC046-CSEPK-DESC        VALUE '  CASEPACK SPLIT   '. 00870001
008900         88  PC046-CK-IN-DESC        VALUE '    CHECKED-IN     '. 00880001
009000         88  PC046-P2L-DESC          VALUE 'ROUTED FROM P-2-L  '. 00890001
009100         88  PC046-RDM-DESC          VALUE '  CREATED BY RDM   '. 00900001
009200         88  PC046-RECV-DESC         VALUE 'CREATED IN RECEIVNG'. 00910001
009300         88  PC046-ASN-DESC          VALUE '  CREATED BY ASN   '. 00920001
009400         88  PC046-SMTH-DESC         VALUE 'CREATED BY SMOOTHNG'. 00930001
009500         88  PC046-XFER-DESC         VALUE 'CREATD BY FAST XFER'. 00940001
009600         88  PC046-MSTR-DESC         VALUE 'CREATD BY MSTR CNTR'. 00950001
009700         88  PC046-BLD-DESC          VALUE 'CREATD BY CRTN BULD'. 00960001
009800         88  PC046-JWL-DESC          VALUE 'ROUTED FROM JEWELRY'. 00890001
009900         88  PC046-DMG-DESC          VALUE 'DMG BY CRTN ADJUST '. 00890001
009910         88  PC046-3WD-DESC          VALUE 'CRE BY 3 PARTY WHSE'. 00890001
010000*                                                                 00970001
010100     05  PC046-TRLR-SRL                PIC S9(09)  VALUE ZEROES.  00980001
010200     05  PC046-OTBD-TRIP-ID            PIC S9(09)  VALUE ZEROES.  00990001
010300     05  PC046-TRLR-ID                 PIC  X(12)  VALUE SPACES.  01000001
010400     05  PC046-SCAC                    PIC  X(04)  VALUE SPACES.  01010001
010500     05  PC046-DOOR-TYP-CDE            PIC  X(02)  VALUE SPACES.  01020015
010600     05  PC046-DOOR-ID                 PIC  X(04)  VALUE SPACES.  01021024
010700     05  PC046-TRIP-STATUS             PIC  X(02)  VALUE SPACES.  01030002
010800     05  PC046-TRIP-STAT-TMST.                                    01040001
010900         10  PC046-TRIP-STAT-CCYY      PIC  X(04)  VALUE SPACE.   01050001
011000         10  FILLER                    PIC  X(01)  VALUE SPACE.   01060001
011100         10  PC046-TRIP-STAT-MM        PIC  X(02)  VALUE SPACE.   01070001
011200         10  FILLER                    PIC  X(01)  VALUE SPACE.   01080001
011300         10  PC046-TRIP-STAT-DD        PIC  X(02)  VALUE SPACE.   01090001
011400         10  FILLER                    PIC  X(01)  VALUE SPACE.   01100001
011500         10  PC046-TRIP-STAT-HR        PIC  X(02)  VALUE SPACE.   01110001
011600         10  FILLER                    PIC  X(01)  VALUE SPACE.   01120001
011700         10  PC046-TRIP-STAT-MN        PIC  X(02)  VALUE SPACE.   01130001
011800         10  FILLER                    PIC  X(01)  VALUE SPACE.   01140001
011900         10  PC046-TRIP-STAT-SC        PIC  X(02)  VALUE SPACE.   01150001
012000         10  FILLER                    PIC  X(01)  VALUE SPACE.   01160001
012100         10  PC046-TRIP-STAT-MS        PIC  X(06)  VALUE SPACE.   01170001
012200                                                                  01180012
012300     05  PC046-SHPUNT-SRC-ID           PIC  X(03)  VALUE SPACE.   01190014
012400         88  PC046-SRC-ASN                         VALUE 'ASN'.   01200013
012500         88  PC046-SRC-CHECKED-IN                  VALUE 'CKN'.   01210013
012600         88  PC046-SRC-CASEPACK-SPLIT              VALUE 'CPS'.   01220013
012700         88  PC046-SRC-MANUAL                      VALUE 'MAN'.   01230013
012800         88  PC046-SRC-P2L                         VALUE 'P2L'.   01240013
012900         88  PC046-SRC-RECV                        VALUE 'RCV'.   01250013
013000         88  PC046-SRC-RDM                         VALUE 'RDM'.   01260013
013100         88  PC046-SRC-SMOOTHING                   VALUE 'SMO'.   01270013
013200         88  PC046-SRC-FAST-XFER                   VALUE 'FXR'.   01280013
013300         88  PC046-SRC-MSTR-CNTR                   VALUE 'MST'.   01290013
013400         88  PC046-SRC-CRTN-BULD                   VALUE 'MSC'.   01300013
013500         88  PC046-SRC-UNKNOWN                     VALUE '   '.   01310013
013600         88  PC046-SRC-JWL                         VALUE 'JWL'.   01260013
013610         88  PC046-SRC-JWL                         VALUE 'JWL'.   01260013
013700         88  PC046-SRC-3WD                         VALUE '3WD'.   01260013
013800                                                                  01320013
013900* NBR-UNITS WILL NOT BE CALCULATED FOR MASTER CONTAINERS          01330013
014000     05  PC046-NBR-UNITS               PIC   9(09) VALUE ZEROES.  01340013
014100*                                                                 01350013
014200     05  PC046-VENDOR-SHIPT-UNT-ID     PIC S9(18)V VALUE ZEROES.  01370013
014300     05  PC046-KOHLS-BARCODE           PIC  X(22)  VALUE SPACES.  01380014
014400     05  PC046-PO-NBR                  PIC  9(09)  VALUE ZEROES.  01390022
014500     05  PC046-MULT-PO                 PIC X(09).                         
014600         88 PC046-MULTIPLE                    VALUE 'MULTIPLE '.  01400022
014700     05  PC046-RCVR-NBR                PIC  X(03)  VALUE SPACES.  01410019
014800*                                                                 01420013
014900     05  PC046-CALC-UNITS-SW           PIC  X(01)  VALUE SPACES.  01421029
015000         88 PC046-CALC-UNITS                  VALUE 'Y'.          01422028
015100* IF CARTON WAS DIVERTED THIS FLAG WILL TELL IF IT WAS A BEGIN    01422129
015200* OR END DIVERT                                                   01422229
015300     05  PC046-DIVERT-FLAG             PIC  X(01)  VALUE SPACES.  01423029
015400         88 PC046-BEGIN-DIVERT                VALUE 'B'.          01424029
015500         88 PC046-END-DIVERT                  VALUE 'E'.          01425029
015600                                                                  01425135
015700*    USE THIS FIELD FOR FAST TRANSFER AND CENTRAL STOCK CODES     01425235
015800*    WHICH ARE REALLY NOT PO NBRS.                                01425335
015900     05  PC046-TRN-NBR                 PIC  9(09)  VALUE ZEROES.  01426034
016000                                                                  01427035
016100     05  FILLER                        PIC  X(084) VALUE SPACES.  01430038
016200 01  PC046-COMMAREA                   PIC X(01).                  01450037
016300 01  PC046-CARTON-STATUS-MODULE       PIC X(08) VALUE 'PCKUT713'. 01451039
