000001***************************************************************** 00000100
000002*                                                               * 00000200
000003* changes per systec to qA statement                            * 00000300
000004*                                                               * 00000400
000005***************************************************************** 00000500
000006* PCWS144 - Print Package Header Label - using sockets          * 00000600
000007*                                                               * 00000700
000008*  this is the layout for the header label used in casepack     * 00000800
000009*  split application                                            * 00000900
000010* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00001000
000011*                    I M P O R T A N T                          * 00001100
000012* The label commands are strung together under only 4-05 levels * 00001200
000013* Each label command is separated by an end of text char-hex 03 * 00001300
000014* This was done to try to speed up transmission via new socket  * 00001400
000015* interface.  Systec's software separates 05 levels into        * 00001500
000016* statements.  The maximum length is 240.                       * 00001600
000017***************************************************************** 00001700
000018 01  PC144-SML-HDR-LBL-MAX-LN          PIC 9(03)    VALUE  07.    00001800
000019***    NUMBER OF 05 LEVELS --------------------------------/\     00001900
000020***                                                               00002000
000021***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00002100
000022***               IN PC144-HDR-LBL-LENGTH.                        00002200
000023***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00002300
000024***                                                               00002400
000030***************************************************************** 00003000
000040 01  PC144-SML-HEADER-LABEL.                                      00004000
000050*                                                                 00005000
000060* label group 1                                                   00006000
000070*                                                                 00007000
000080* c0000 - Continuous paper length - 0000 = normal operation       00008000
000090     05  FILLER.                                                  00009000
000100         10  FILLER                    PIC X(06)    VALUE         00010000
000200             'c0000'.                                            00020000
000300         10  FILLER                    PIC X(01)    VALUE  ''.   00030000
000400* e     - Select edge sensor - DEFAULT                            00040000
000500         10  FILLER                    PIC X(02)    VALUE         00050000
000600             'e'.                                                00060000
000700         10  FILLER                    PIC X(01)    VALUE  ''.   00070000
000800* M1125 - Maximum label length                                    00080000
000900         10  FILLER                    PIC X(06)    VALUE         00090000
001000             'M1125'.                                            00100000
001100         10  FILLER                    PIC X(01)    VALUE  ''.   00110000
001110*  Replaced a command with KcFMN to disable the feedback char     00111003
001120*  dmh 8/9/17                                                     00112003
001140* KcFMN - disable feedback characters to be transmitted (6)       00114003
001300         10  FILLER                    PIC X(06)    VALUE         00130003
001400             'KcFMN'.                                            00140003
001500         10  FILLER                    PIC X(01)    VALUE  ''.   00150000
001600* s     - Set up for 1 dot buffer                                 00160000
001700         10  FILLER                    PIC X(02)    VALUE         00170000
001800             's'.                                                00180000
001900         10  FILLER                    PIC X(01)    VALUE  ''.   00190000
002000* O0110 - Set form edge offset - 0110 = zero setting              00200000
002100         10  FILLER                    PIC X(06)    VALUE         00210000
002200             'O0110'.                                            00220000
002300         10  FILLER                    PIC X(01)    VALUE  ''.   00230000
002400* qA    - Clear memory module - A=upper slot                      00240000
002500         10  FILLER                    PIC X(03)    VALUE         00250000
002600             'qA'.                                               00260000
002700         10  FILLER                    PIC X(01)    VALUE  ''.   00270000
002800* L     - enter label formatting command input mode               00280000
002900         10  FILLER                    PIC X(02)    VALUE         00290000
003000             'L'.                                                00300000
003100         10  FILLER                    PIC X(01)    VALUE  ''.   00310000
003200* D11   - Set dot size - Horizontal(1) Vertical(1)                00320000
003300         10  FILLER                    PIC X(03)    VALUE         00330000
003400             'D11'.                                               00340000
003500         10  FILLER                    PIC X(01)    VALUE  ''.   00350000
003600* H     - Heat setting for label                                  00360000
003700         10  FILLER                    PIC X(01)    VALUE         00370000
003800             'H'.                                                 00380000
003900         10  PC144-SML-HDR-HEAT-LEVEL PIC X(02)     VALUE         00390000
004000             '11'.                                                00400000
004100         10  FILLER                    PIC X(01)    VALUE  ''.   00410000
004200* PK    - Max speed for print cycle - K=default (6 in.per sec)    00420000
004300         10  FILLER                    PIC X(02)    VALUE         00430000
004400             'PK'.                                                00440000
004500         10  FILLER                    PIC X(01)    VALUE  ''.   00450000
004600* SK    - Max slew rate speed - K= default (6 in.per sec)         00460000
004700         10  FILLER                    PIC X(02)    VALUE         00470000
004800             'SK'.                                                00480000
004900         10  FILLER                    PIC X(01)    VALUE  ''.   00490000
005000* Q     - Quantity of labels to print                             00500000
005100         10  FILLER                    PIC X(01)    VALUE         00510000
005200             'Q'.                                                 00520000
005300         10  PC144-SML-HDR-TOT-LBL     PIC X(04)    VALUE         00530000
005400             '0001'.                                              00540000
005500         10  FILLER                    PIC X(01)    VALUE  ''.   00550000
005600         10  FILLER                    PIC X(179)   VALUE  SPACES.00560003
005700*                                                                 00570000
005800*                                                                 00580000
005900***** label group 2                                               00590000
006000*                                                                 00600000
006100     05  FILLER.                                                  00610000
006200* RECEIVER - line                                                 00620000
006300         10  FILLER                    PIC X(25)    VALUE         00630000
006400             '341100500350390RECEIVER: '.                         00640000
006500         10  FILLER                    PIC X(01)    VALUE  ''.   00650000
006600* receiver - field                                                00660000
006700         10  FILLER                    PIC X(15)    VALUE         00670000
006800             '341100500350260'.                                   00680000
006900         10  PC144-SML-HDR-PO-SEQ-NBR  PIC X(12)    VALUE         00690000
007000                                       '@@@@@@@@@@@@'.            00700000
007100         10  FILLER                    PIC X(01)    VALUE  ''.   00710000
007200****************************************************************  00720000
007210*  if the label request is a reprint or revised label then the *  00721000
007220*  following should be moved to the PC144-reprint-box          *  00722000
007221*                '1X1100000100045L115025'                      *  00722100
007222*  if this fields should be left blank then move the following *  00722200
007223*  to PC144-reprint-box '341100500350150       '               *  00722300
007224****************************************************************  00722400
007225* reprint - box                                                   00722500
007226         10  PC144-REPRINT-BOX         PIC X(22)    VALUE  SPACES.00722600
007227         10  FILLER                    PIC X(01)    VALUE  ''.   00722700
007228****************************************************************  00722800
007229*  if the label request is a reprint or revised label then the *  00722900
007230*  following should be moved to the PC144-reprint-field        *  00723000
007231* '341100500350150*REPRINT* '   or  '341100500350150*REVISED* '*  00723100
007232*                                                              *  00723200
007233*  if this field should be left blank, then move the following *  00723300
007234*  to PC144-reprint-field  '341100500350150          '         *  00723400
007235****************************************************************  00723500
007236* reprint - text field                                            00723600
007237         10  PC144-REPRINT-FIELD       PIC X(25)    VALUE  SPACES.00723700
007238         10  FILLER                    PIC X(01)    VALUE  ''.   00723800
007239* LINE - line                                                     00723900
007240         10  FILLER                    PIC X(15)    VALUE         00724000
007241             '341100500770390'.                                   00724100
007242         10  PC144-SML-HDR-LINE-DESC   PIC X(08)    VALUE         00724200
007243             '@@@@@@@@'.                                          00724300
007244         10  FILLER                    PIC X(01)    VALUE  ''.   00724400
007245* LINE - field                                                    00724500
007246         10  FILLER                    PIC X(15)    VALUE         00724600
007247             '341100500770260'.                                   00724700
007248         10  PC144-SML-HDR-LINE-NBR    PIC 9(04)    VALUE  ZEROS. 00724800
007249         10  FILLER                    PIC X(01)    VALUE  ''.   00724900
007250* SKU - line                                                      00725000
007251         10  FILLER                    PIC X(20)    VALUE         00725100
007252             '341100501570390SKU: '.                              00725200
007253         10  FILLER                    PIC X(01)    VALUE  ''.   00725300
007254* sku - field                                                     00725400
007255         10  FILLER                    PIC X(15)    VALUE         00725500
007256             '341100501570260'.                                   00725600
007257         10  PC144-SML-HDR-SKU         PIC X(16)    VALUE         00725700
007258                                       '@@@@@@@@@@@@@@@@'.        00725800
007259         10  FILLER                    PIC X(01)    VALUE  ''.   00725900
007260         10  FILLER                    PIC X(40)    VALUE  spaces.00726000
007261*                                                                 00726100
007262*                                                                 00726200
007263***** label group 3                                               00726300
007264*                                                                 00726400
007265     05  FILLER.                                                  00726500
007266* STYLE - line                                                    00726600
007267         10  FILLER                    PIC X(26)    VALUE         00726700
007268             '341100501770390STYLE: '.                            00726800
007269         10  FILLER                    PIC X(01)    VALUE  ''.   00726900
007270* style - field                                                   00727000
007271         10  FILLER                    PIC X(15)    VALUE         00727100
007272             '341100501770260'.                                   00727200
007273         10  PC144-SML-HDR-VNDR-STYLE  PIC X(15)    VALUE         00727300
007274                                       '@@@@@@@@@@@@@@@'.         00727400
007275         10  FILLER                    PIC X(01)    VALUE  ''.   00727500
007276* VENDOR - line                                                   00727600
007277         10  FILLER                    PIC X(23)    VALUE         00727700
007278             '341100502370390VENDOR: '.                           00727800
007279         10  FILLER                    PIC X(01)    VALUE  ''.   00727900
007280* vendor - field                                                  00728000
007281         10  FILLER                    PIC X(15)    VALUE         00728100
007282             '341100502570390'.                                   00728200
007283         10  PC144-SML-HDR-VENDOR-NAME pic X(30)    VALUE         00728300
007284                             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.    00728400
007285         10  FILLER                    PIC X(01)    VALUE  ''.   00728500
007286****************************************************************  00728600
007287*  If an odd carton label will be printed then the following   *  00728700
007288*  should be moved to the PC144-odd-carton-box                 *  00728800
007289*                '1X1100001980010L460020'                      *  00728900
007290*  if this is not an odd carton label then move the following  *  00729000
007291*  to PC144-odd-carton-box '341100502570390             '      *  00729100
007292****************************************************************  00729200
007293* odd carton - box                                                00729300
007294         10  PC144-odd-carton-box      PIC X(22)    VALUE  SPACES.00729400
007295         10  FILLER                    PIC X(01)    VALUE  ''.   00729500
007296***************************************************************** 00729600
007297*  if the odd carton line should be printed, then the following * 00729700
007298*  should be moved to PC144-sml-odd-position                    * 00729800
007299*  '341100502570390 odd carton: ' ,the PC144-sml-odd-carton-unt * 00729900
007300*  should be filled in with the odd carton unit qty, and the    * 00730000
007301*  PC144-sml-odd-carton-use should be filled in with the odd    * 00730100
007302*  carton use (fcse, inpk, p2l)                                 * 00730200
007303*                                                               * 00730300
007304*  if the fullcase line should be left blank, then the following* 00730400
007305*  should be moved to PC144-sml-odd-position                    * 00730500
007306*  '341100502570390             ' and spaces should be moved to * 00730600
007307*  PC144-sml-odd-carton-unt, PC144-sml-odd-carton-use           * 00730700
007308***************************************************************** 00730800
007309* odd carton - text field                                         00730900
007310         10  PC144-SML-ODD-POSITION    PIC X(28)    VALUE  SPACES.00731000
007311         10  PC144-SML-ODD-CARTON-UNT  PIC X(04)    VALUE  SPACES.00731100
007312         10  FILLER                    PIC X(02)    VALUE  SPACES.00731200
007313         10  PC144-SML-ODD-CARTON-USE  PIC X(17)    VALUE  SPACES.00731300
007314         10  FILLER                    PIC X(01)    VALUE  ''.   00731400
007315         10  FILLER                    PIC X(37)    VALUE  spaces.00731500
007316*                                                                 00731600
007317*                                                                 00731700
007318***** label group 4                                               00731800
007319*                                                                 00731900
007320     05  FILLER.                                                  00732000
007321***************************************************************** 00732100
007322*  if the fullcase line should be be printed, then the following* 00732200
007323*  should be moved to PC144-sml-fcse-position                   * 00732300
007324*  '341100502770390# FULL CASE SML LABELS: ' and the PC144-sml- * 00732400
007325*  fcse-lbl-cnt should be filled in with the carton count       * 00732500
007326*                                                               * 00732600
007327*  if the fullcase line should be left blank, then the following* 00732700
007328*  should be moved to PC144-sml-fcse-position                   * 00732800
007329*  '341100502770390                        ' and spaces should  * 00732900
007330*  be moved to PC144-sml-fcse-lbl-cnt                           * 00733000
007331***************************************************************** 00733100
007332* FULL CASE SML LABELS - line                                     00733200
007333         10  PC144-SML-FCSE-POSITION   PIC X(39)    VALUE  SPACES.00733300
007334         10  PC144-SML-FCSE-LBL-CNT    PIC X(04)    VALUE  SPACES.00733400
007335         10  FILLER                    PIC X(01)    VALUE  ''.   00733500
007336***************************************************************** 00733600
007337*  if the inner pack line should be printed, then the following * 00733700
007338*  should be moved to PC144-sml-inpk-position                   * 00733800
007339*  '341100502970390# INPACK CONVEY LABELS: ' and the PC144-sml- * 00733900
007340*  inpk-lbl-cnt should be filled in with the carton count.      * 00734000
007341*                                                               * 00734100
007342*  if the inner pack line should be left blank, then the        * 00734200
007343*  following should be moved to PC144-sml-inpk-position         * 00734300
007344*  '341100502970390                        ' and spaces should  * 00734400
007345*  be moved to PC144-sml-inpk-lbl-cnt.                          * 00734500
007346***************************************************************** 00734600
007347* INPACK CONVEY LABELS - line                                     00734700
007348         10  PC144-SML-INPK-POSITION   PIC X(40)    VALUE  SPACES.00734800
007349         10  PC144-SML-INPK-LBL-CNT                               00734900
007350                                       PIC X(04)    VALUE  SPACES.00735000
007351         10  FILLER                    PIC X(01)    VALUE  ''.   00735100
007352***************************************************************** 00735200
007353*  if the PIGGyback line should be printed, then the following  * 00735300
007354*  should be moved to PC144-sml-pgybk-position                  * 00735400
007355*  '341100503170390# PGYBK LABELS ON ', the pgybk printer id    * 00735500
007356*  should be filled in and the carton count (PC144-pgybk-lbl-   * 00735600
007357*  cnt) should be filled in.  a ':' should be moved to PC144-   * 00735700
007358*  pgybk-colon)                                                 * 00735800
007359*                                                               * 00735900
007360*  if the piggyback line should be left blank, then the following 00736000
007361*  should be moved to PC144-sml-pgybk=position                  * 00736100
007362*  '341100503170390                  ', the printer id, label   * 00736200
007363*  count and colon should have spaces moved to it.              * 00736300
007364***************************************************************** 00736400
007365* PGYBK LABELS ON - line                                          00736500
007366         10  PC144-PGYBK-POSITION      PIC X(33)    VALUE  SPACES.00736600
007367         10  PC144-PGYBK-LBL-PRTR-ID                              00736700
007368                                       PIC X(03)    VALUE  SPACES.00736800
007369         10  PC144-PGYBK-COLON         PIC X(02)    VALUE  SPACES.00736900
007370         10  PC144-PGYBK-LBL-CNT                                  00737000
007371                                       PIC X(04)    VALUE  SPACES.00737100
007372         10  FILLER                    PIC X(01)    VALUE  ''.   00737200
007373***************************************************************** 00737300
007374*  if the p2l line should be printed, then the following should * 00737400
007375*  be moved to PC144-p2l-position                               * 00737500
007376*  '341100503370390# P2L LABELS: ', and the PC144-p2l-lbl-cnt   * 00737600
007377*  should be filled in with te carton count.                    * 00737700
007378*                                                               * 00737800
007379*  if the p2l line should be left blank, then the following     * 00737900
007380*  should be moved to PC144-p2l-position                        * 00738000
007381*  '341100503370390              ', and spaces should be moved  * 00738100
007382*  to PC144-sml-inpk-lbl-cnt.                                   * 00738200
007383***************************************************************** 00738300
007384* P2L LABELS -  line                                              00738400
007385         10  PC144-P2L-POSITION        PIC X(30)    VALUE  SPACES.00738500
007386         10  PC144-P2L-LBL-CNT                                    00738600
007387                                       PIC X(04)    VALUE  SPACES.00738700
007388         10  FILLER                    PIC X(01)    VALUE  ''.   00738800
007389         10  FILLER                    PIC X(73)    VALUE  spaces.00738900
007390*                                                                 00739000
007400*                                                                 00740000
007500***** label group 5                                               00750000
007600*                                                                 00760000
007700     05  FILLER.                                                  00770000
007800* DEPT-CLASS  - line                                              00780000
007900         10  FILLER                    PIC X(26)    VALUE         00790000
008000             '341100501170390DEPT-CLASS:'.                        00800000
008100         10  FILLER                    PIC X(01)    VALUE  ''.   00810000
008200* department-class - field                                        00820000
008300         10  FILLER                    PIC X(15)    VALUE         00830000
008400             '341100501170260'.                                   00840000
008500         10  PC144-SML-HDR-DEPT        PIC X(03)    VALUE         00850000
008600                                       '@@@'.                     00860000
008700         10  FILLER                    PIC X(01)    VALUE '-'.    00870000
008800         10  PC144-SML-HDR-CLASS       PIC X(02)    VALUE         00880000
008900                                       '@@'.                      00890000
009000         10  FILLER                    PIC X(01)    VALUE  ''.   00900000
009100* Printer # - line                                                00910000
009200         10  FILLER                  PIC X(20)    VALUE           00920000
009300             '302200003910390PRTR '.                              00930000
009400         10  FILLER                  PIC X(01)    VALUE  ''.     00940000
009500* Printer # - field                                               00950000
009600         10  FILLER                  PIC X(15)    VALUE           00960000
009700             '302200003910357'.                                   00970000
009800         10  PC144-HDR-PRTR-NBR      PIC X(07)    VALUE           00980000
009900             '#DC-307'.                                           00990000
010000         10  FILLER                  PIC X(01)    VALUE  ''.     01000000
010100**  User ID - bottom of label                                     01010000
010200         10  FILLER                  PIC X(15)    VALUE           01020000
010300             '302200003910287'.                                   01030000
010400         10  PC144-USER-ID           PIC X(08)    VALUE SPACES.   01040000
010500         10  FILLER                  PIC X(01)    VALUE  ''.     01050000
010600* label description line                                          01060000
010700         10  FILLER                  PIC X(15)    VALUE           01070000
010800             '302200003910080'.                                   01080000
010900         10  PC144-HDR-LBL-DESC      PIC X(10)    VALUE           01090000
011000             '@@@@@@@@@@'.                                        01100000
011100         10  FILLER                  PIC X(01)    VALUE  ''.     01110000
011200         10  FILLER                  PIC X(97)    VALUE  spaces.  01120000
011300*                                                                 01130000
011400***** label group 7                                               01140000
011500*                                                                 01150000
011600     05  FILLER.                                                  01160000
011700*  label print date                                               01170000
011800         10  FILLER                  PIC X(15)    VALUE           01180000
011900             '302200003910180'.                                   01190000
012000         10  PC144-LBL-PRT-DATE      PIC X(08)    VALUE           01200000
012100             '@@@@@@@@'.                                          01210000
012200         10  FILLER                  PIC X(01)    VALUE  ''.     01220000
012300*  label print time                                               01230000
012400         10  FILLER                  PIC X(15)    VALUE           01240000
012500             '302200003910125'.                                   01250000
012600         10  PC144-LBL-PRT-TIME      PIC X(05)    VALUE           01260000
012700             '@@@@@'.                                             01270000
012710         10  FILLER                  PIC X(01)    VALUE  ''.     01271000
012720         10  FILLER                  PIC X(195)   VALUE  spaces.  01272000
012730*                                                                 01273000
012740***** label group 6                                               01274000
012750*                                                                 01275000
012760* E     - Terminate field generation and print label              01276000
012770*                                                                 01277000
012780     05  FILLER.                                                  01278000
012790         10  FILLER                    PIC X(02)    VALUE         01279000
012800             'E '.                                                01280000
012900         10  FILLER                    PIC X(01)    VALUE  ''.   01290000
013000         10  FILLER                    PIC X(237)   VALUE  SPACES.01300000
013100                                                                  01310000
013200                                                                  01320000
013300 01  PC144-HEADER-LABEL-TABLE REDEFINES PC144-SML-HEADER-LABEL.   01330000
013301     05  PC144-SML-HEADER-LINE        OCCURS 07 TIMES             01330100
013302                                      INDEXED BY PC144-IDX        01330200
013303                                      PIC X(240).                 01330300
013304                                                                  01330400
013305*----------------------------------------------------------------*01330500
013306* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01330600
013307*----------------------------------------------------------------*01330700
013308 01  PC144-HDR-LBL-LENGTH.                                        01330800
013309     05  FILLER                        PIC 9(03)    VALUE   61.   01330903
013310     05  FILLER                        PIC 9(03)    VALUE  200.   01331000
013311     05  FILLER                        PIC 9(03)    VALUE  203.   01331100
013312     05  FILLER                        PIC 9(03)    VALUE  167.   01331200
013313     05  FILLER                        PIC 9(03)    VALUE  143.   01331300
013314     05  FILLER                        PIC 9(03)    VALUE   45.   01331400
013315     05  FILLER                        PIC 9(03)    VALUE    3.   01331500
013316                                                                  01331600
013317 01  PC144-HDR-LBL-LNGTH-VALUES REDEFINES PC144-HDR-LBL-LENGTH.   01331700
013318     05  PC144-HDR-LINE-LENGTH        OCCURS 6 TIMES              01331800
013319                                      INDEXED BY PC144-IDX-2      01331900
013320                                      PIC 9(03).                  01332000
013330                                                                  01333000
013331*----------------------------------------------------------------*01333100
013332* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                    *01333200
013333*----------------------------------------------------------------*01333300
013334 01  PC144-LABEL-ALLOCATIONS.                                     01333400
013335     05  PC144-HDR-REPRT-BOX       PIC X(22)   VALUE              01333500
013336                                   '1X1100000100010L115025'.      01333600
013337     05  PC144-HDR-REPRT-FLD       PIC X(25)   VALUE              01333700
013338                                   '341100500320115*REPRINT* '.   01333800
013339     05  PC144-HDR-REVSD-FLD       PIC X(25)   VALUE              01333900
013340                                   '341100500320115*REVISED* '.   01334000
013341     05  PC144-HDR-NO-REPRINT      PIC X(25)   VALUE              01334100
013342                                   '341100500320130@@@@@@@@@'.    01334200
013343     05  PC144-HDR-ODD-CRTN-BOX     PIC X(22)   VALUE             01334300
013344* dmh                              '1X1100001980010L460020'.      01334400
013345                                   '1X1100002770010L460020'.      01334500
013346     05  PC144-HDR-ODD-CRTN-FLD     PIC X(28)   VALUE             01334600
013347* dmh                              '341100502170390 ODD CARTON: '.01334700
013348                                   '341100502970390 ODD CARTON: '.01334800
013349     05  PC144-HDR-NO-ODD-CRTN     PIC X(28)   VALUE              01334900
013350* dmh                              '341100502200390@@@@@@@@@@@@@'.01335000
013351                                   '341100502970390@@@@@@@@@@@@@'.01335100
013352     05  PC144-HDR-FCSE-HEADING    PIC X(39)   VALUE              01335200
013353* dmh                   '341100502400390#FULL CASE SML LABELS:  '.01335300
013354                        '341100503170390#FULL CASE SML LABELS:  '.01335400
013355     05  PC144-HDR-NO-FCSE         PIC X(39)   VALUE              01335500
013356* dmh                   '341100502400390@@@@@@@@@@@@@@@@@@@@@@@@'.01335600
013357                        '341100503170390@@@@@@@@@@@@@@@@@@@@@@@@'.01335700
013358     05  PC144-HDR-INPK-HEADING    PIC X(40)   VALUE              01335800
013359* dmh                  '341100502600390#INPACK CONVEY LABELS:   '.01335900
013360                       '341100503370390#INPACK CONVEY LABELS:   '.01336000
013361     05  PC144-HDR-NO-INPK         PIC X(40)   VALUE              01336100
013362* dmh                  '341100502600390@@@@@@@@@@@@@@@@@@@@@@@@@'.01336200
013363                       '341100503370390@@@@@@@@@@@@@@@@@@@@@@@@@'.01336300
013364     05  PC144-HDR-PGBK-HEADING    PIC X(33)   VALUE              01336400
013365* dmh                        '341100502400390#PGYBK LABELS ON  '. 01336500
013366                             '341100503170390#PGYBK LABELS ON  '. 01336600
013367     05  PC144-HDR-NO-PGBK-FCSE    PIC X(33)   VALUE              01336700
013368* dmh                        '341100502400390@@@@@@@@@@@@@@@@@@'. 01336800
013369                             '341100503170390@@@@@@@@@@@@@@@@@@'. 01336900
013370     05  PC144-HDR-PGBK-PRTR       PIC X(33)   VALUE              01337000
013371* dmh                        '341100502800390PRINTED ON:       '. 01337100
013372                             '341100503570390PRINTED ON:       '. 01337200
013373     05  PC144-HDR-P2L-HEADING     PIC X(30)   VALUE              01337300
013374* dmh                           '341100503200390#P2L LABELS:  '.  01337400
013375                                '341100503770390#P2L LABELS:  '.  01337500
013376     05  PC144-HDR-NO-P2L          PIC X(30)   VALUE              01337600
013377* dmh                           '341100503200390@@@@@@@@@@@@@@'.  01337700
013378                                '341100503770390@@@@@@@@@@@@@@'.  01337800
