000100***************************************************************** 00010000
000200* PCWS205 - Print Package Central Stock SML - FORM -  sockets   * 00020000
000300*                                                               * 00030000
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040000
002000***************************************************************** 00050000
002100 01  PC250-SHIP-MFST-LBL.                                         00060000
002200*                                                                 00070000
002300*** label information - line 1                                    00080000
002400*                                                                 00090000
002600* c0000 - Continuous paper length - 0000 = normal operation       00100000
002700         10  FILLER                  PIC X(06)    VALUE           00110000
002800             'c0000'.                                            00120000
002900         10  FILLER                  PIC X(01)    VALUE X'0D'.    00130001
003000* e     - Select edge sensor - DEFAULT                            00140000
003100         10  FILLER                  PIC X(02)    VALUE           00150000
003200             'e'.                                                00160000
003300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00170001
003400* M1030 - Maximum label length                                    00180000
003500         10  FILLER                  PIC X(06)    VALUE           00190000
003600             'M1030'.                                            00200000
003700         10  FILLER                  PIC X(01)    VALUE X'0D'.    00210001
003800* a     - Enable feedback characters to be transmitted            00220000
003900         10  FILLER                  PIC X(02)    VALUE           00230000
004000             'a'.                                                00240000
004100         10  FILLER                  PIC X(01)    VALUE X'0D'.    00250001
004200* s     - Set up for 1 dot buffer                                 00260000
004300         10  FILLER                  PIC X(02)    VALUE           00270000
004400             's'.                                                00280000
004500         10  FILLER                  PIC X(01)    VALUE X'0D'.    00290001
004600* O0110 - Set form edge offset - 0110 = zero setting              00300000
004700         10  FILLER                  PIC X(06)    VALUE           00310000
004800             'O0110'.                                            00320000
004900         10  FILLER                  PIC X(01)    VALUE X'0D'.    00330001
005000* qA    - Clear memory module - A=upper slot                      00340000
005100         10  FILLER                  PIC X(03)    VALUE           00350000
005200             'qA'.                                               00360000
005300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00370001
005400* L     - enter label formatting command input mode               00380000
005500         10  FILLER                  PIC X(02)    VALUE           00390000
005600             'L'.                                                00400000
005700         10  FILLER                  PIC X(01)    VALUE X'0D'.    00410001
005800* D11   - Set dot size - Horizontal(1) Vertical(1)                00420000
005900         10  FILLER                  PIC X(03)    VALUE           00430000
006000             'D11'.                                               00440000
006100         10  FILLER                  PIC X(01)    VALUE X'0D'.    00450001
006200* H     - Heat setting for label                                  00460000
006300         10  FILLER                  PIC X(03)    VALUE           00470000
006400             'H11'.                                               00480000
006500         10  FILLER                  PIC X(01)    VALUE X'0D'.    00490001
006600* PK    - Max speed for print cycle - K=default (6 in.per sec)    00500000
006700         10  FILLER                  PIC X(02)    VALUE           00510000
006800             'PK'.                                                00520000
006900         10  FILLER                  PIC X(01)    VALUE X'0D'.    00530001
007000* SK    - Max slew rate speed - K= default (6 in.per sec)         00540000
007100         10  FILLER                  PIC X(02)    VALUE           00550000
007200             'SK'.                                                00560000
007300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00570001
007500*                                                                 00580000
007600*                                                                 00590000
007700*** label information - line 2                                    00600000
008000*  store name (U01)                                               00610000
008100         10  FILLER                  PIC X(15)    VALUE           00620000
008200             '331100400230110'.                                   00630000
008300         10  PC250-STR-NAME          PIC X(10)    VALUE           00640000
008400             '@@@@@@@@@@'.                                        00650000
008500         10  FILLER                  PIC X(01)    VALUE X'0D'.    00660001
008600*  store number (U02)                                             00670000
008700         10  FILLER                  PIC X(15)    VALUE           00680000
008800             '392200801200193'.                                   00690000
008900         10  PC250-STORE-NBR         PIC X(04)    VALUE  ZEROES.  00700000
009000         10  FILLER                  PIC X(01)    VALUE X'0D'.    00710001
009100*  # above bar code (U03)                                         00720000
009200         10  FILLER                  PIC X(15)    VALUE           00730000
009300             '341200002790330'.                                   00740000
009400         10  PC250-SML-BC-NBR        PIC X(25)    VALUE           00750000
009500                                     '@@@@@@@@@@@@@@@@@@@@@@@@@'. 00760000
009600         10  FILLER                  PIC X(01)    VALUE X'0D'.    00770001
009700* long bar code across bottom of label (U04)                      00780000
009800         10  FILLER                  PIC X(16)    VALUE           00790000
009900             '3e4410003790340C'.                                  00800000
010000         10  PC250-SML-FORM-BC       PIC X(20)    VALUE           00810000
010100                                     '@@@@@@@@@@@@@@@@@@@@'.      00820000
010200         10  FILLER                  PIC X(01)    VALUE X'0D'.    00830001
010900*  label # of field (U05)                                         00840000
011000         10  FILLER                  PIC X(15)    VALUE           00850000
011100             '302200003910287'.                                   00860000
011200         10  FILLER                  PIC 9(04)    VALUE  ZEROES.  00870000
011300         10  FILLER                  PIC X(01)    VALUE X'0D'.    00880001
011400*  total label count (U06)                                        00890000
011500         10  FILLER                  PIC X(15)    VALUE           00900000
011600             '302200003910232'.                                   00910000
011700         10  PC250-TOT-LBL-CNT       PIC 9(04)    VALUE  ZEROES.  00920000
011800         10  FILLER                  PIC X(01)    VALUE X'0D'.    00930001
011900*  label count  (U07)                                             00940000
012000         10  PC250-LABEL-CNT         PIC X(19).                   00950000
012100         10  FILLER                  PIC X(01)    VALUE X'0D'.    00960001
012300*                                                                 00970000
012400*                                                                 00980000
012500*** label information - line 3                                    00990000
012600*                                                                 01000000
012800* Printer # - line (U08)                                          01010000
012900         10  FILLER                  PIC X(20)    VALUE           01020000
013000             '302200003910390PRTR '.                              01030000
013100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01040001
013200* Printer # - field (U09)                                         01050000
013300         10  FILLER                  PIC X(15)    VALUE           01060000
013400             '302200003910352'.                                   01070000
013500         10  PC250-SML-PRTR-NBR      PIC X(07)    VALUE           01080000
013600             '#DC-307'.                                           01090000
013700         10  FILLER                  PIC X(01)    VALUE X'0D'.    01100001
013800* label description line (U10)                                    01110000
013900         10  FILLER                  PIC X(15)    VALUE           01120000
014000             '302200003910080'.                                   01130000
014100         10  PC250-SML-LBL-DESC      PIC X(10)    VALUE           01140000
014200             '@@@@@@@@@@'.                                        01150000
014300         10  FILLER                  PIC X(01)    VALUE X'0D'.    01160001
014400* ZONE/STORAGE heading - line (U11)                               01170000
014500         10  FILLER                  PIC X(15)    VALUE           01180000
014600             '331100401200370'.                                   01190000
014700         10  PC250-ZONE-STRG-HDG     PIC X(08)    VALUE           01200000
014800             '@@@@@@@@'.                                          01210000
014900         10  FILLER                  PIC X(01)    VALUE X'0D'.    01220001
015000* ZONE - field (U12)                                              01230000
015100         10  FILLER                  PIC X(15)    VALUE           01240000
015200             '331100401200300'.                                   01250000
015300         10  PC250-ZONE-STRG-DESC    PIC X(05)    VALUE           01260000
015400             '@@@@@'.                                             01270000
015500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01280001
015600* RCVR - line  (U13)                                              01290000
015700         10  FILLER                  PIC X(21)    VALUE           01300000
015800             '331100401360370RCVR: '.                             01310000
015900         10  FILLER                  PIC X(01)    VALUE X'0D'.    01320001
016000* RCVR - field (U14)                                              01330000
016100         10  FILLER                  PIC X(15)    VALUE           01340000
016200             '331100401360300'.                                   01350000
016300         10  PC250-PO-RCVR-NBR       PIC X(12)    VALUE           01360000
016400             '@@@@@@@@@@@@'.                                      01370000
016500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01380001
016600* LINE - line  (U15)                                              01390000
016700         10  FILLER                  PIC X(21)    VALUE           01400000
016800             '331100401520370LINE: '.                             01410000
016900         10  FILLER                  PIC X(01)    VALUE X'0D'.    01420001
017000* LINE - field (U16)                                              01430000
017100         10  FILLER                  PIC X(15)    VALUE           01440000
017200             '331100401520300'.                                   01450000
017300         10  PC250-PO-LNE-NBR        PIC X(03)    VALUE           01460000
017400             '@@@'.                                               01470000
017500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01480001
017700*                                                                 01490000
017800*                                                                 01500000
017900*** label information - line 4                                    01510000
018000*                                                                 01520000
018200* SKU - line (U17)                                                01530000
018300         10  FILLER                  PIC X(21)    VALUE           01540000
018400             '331100401680370SKU:  '.                             01550000
018500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01560001
018600* SKU - field (U18)                                               01570000
018700         10  FILLER                  PIC X(15)    VALUE           01580000
018800             '331100401680300'.                                   01590000
018900         10  PC250-SKU-NBR           PIC X(16)    VALUE           01600000
019000             '@@@@@@@@@@@@@@@@'.                                  01610000
019100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01620001
019200* STYLE - line (U19)                                              01630000
019300         10  FILLER                  PIC X(22)    VALUE           01640000
019400             '331100401840370STYLE: '.                            01650000
019500         10  FILLER                  PIC X(01)    VALUE X'0D'.    01660001
019600* STYLE - field (U20)                                             01670000
019700         10  FILLER                  PIC X(15)    VALUE           01680000
019800             '331100401840300'.                                   01690000
019900         10  PC250-STYLE             PIC X(20)    VALUE           01700000
020000             '@@@@@@@@@'.                                         01710000
020100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01720001
020200******************************************************************01730000
020300*   PROGRAM  SHOULD EITHER MOVE THE FOLLOWING TO PC250-REPRINT-BOX01740000
020400*   if nothing is to be printed                                  *01750000
020500*            '1X1100000020119L000000'                            *01760000
020600*   or it should move the following to print a black box         *01770000
020700*            '1X1100000020119L070016'                            *01780000
020800******************************************************************01790000
020900* reprint - BOX (U21)                                             01800000
021000         10  PC250-REPRINT-BOX       PIC X(22).                   01810000
021100         10  FILLER                  PIC X(01)    VALUE X'0D'.    01820001
021200******************************************************************01830000
021300*   program  should either move the following to pc250-reprint-tex01840000
021400*   if nothing is to be printed                                  *01850000
021500*            '331100000170180@@@@@@@'.                           *01860000
021600*   or it should move one of the following if reprint or revised *01870000
021700*   should be printed.                                           *01880000
021800*            '331100000170180REPRINT'                            *01890000
021900*            '331100000170180REVISED'                            *01900000
022000******************************************************************01910000
022100* reprint - TEXT (U22)                                            01920000
022200         10  PC250-REPRINT-TEXT      PIC X(22).                   01930000
022300         10  FILLER                  PIC X(01)    VALUE X'0D'.    01940001
022600*                                                                 01950000
022700*** label information - line 5                                    01960000
022800*                                                                 01970000
023000******************************************************************01980000
023100*   program  should either move the following to pc250-inpk-convyx01990000
023200*   -box if nothing is to be printed                             *02000000
023300*            '331100502000370                 '                  *02010000
023400*   or it should move the following to print a black box         *02020000
023500*            '1X1100002000152L225017'.                           *02030000
023600******************************************************************02040000
023700* inpk cnvy - BOX  (U23)                                          02050000
023800         10  PC250-INPK-CONVY-BOX    PIC X(22).                   02060000
023900         10  FILLER                  PIC X(01)    VALUE X'0D'.    02070001
024000******************************************************************02080000
024100*   program  should either move the following to pc250-inpk-convyx02090000
024200*   -text if nothing is to be printed                            *02100000
024300*            '331100502000390                 '                  *02110000
024400*   or it should move the following to print the inner pack text *02120000
024500*            '331100402000370NIPK CNVY UNTS: '                   *02130000
024600******************************************************************02140000
024700* inpk cnvy - TEXT (U24)                                          02150000
024800         10  PC250-INPK-CONVY-TEXT   PIC X(31).                   02160000
024900         10  FILLER                  PIC X(01)    VALUE X'0D'.    02170001
025000* inpk cnvy - TEXT (U25)                                          02180000
025100         10  FILLER                  PIC X(15)    VALUE           02190000
025200             '331100402000250'.                                   02200000
025300         10  PC250-PACK-UNT          PIC X(04).                   02210000
025310         10  FILLER                  PIC X(01)    VALUE X'0D'.    02220001
025320*  label print date (U26)                                         02230000
025330         10  FILLER                  PIC X(15)    VALUE           02240000
025340             '302200003910180'.                                   02250000
025350         10  PC250-LBL-PRT-DATE      PIC X(08)    VALUE           02260000
025360             '@@@@@@@@'.                                          02270000
025370         10  FILLER                  PIC X(01)    VALUE X'0D'.    02280001
025380*  label print time (U27)                                         02290000
025390         10  FILLER                  PIC X(15)    VALUE           02300000
025400             '302200003910125'.                                   02310000
025500         10  PC250-LBL-PRT-TIME      PIC X(05)    VALUE           02320000
025600             '@@@@@'.                                             02330000
025700         10  FILLER                  PIC X(01)    VALUE X'0D'.    02340001
025800         10  FILLER                  PIC X(120)   VALUE  SPACES.  02350000
025900*                                                                 02360000
026000*                                                                 02370000
026100*** label information - line 6                                    02380000
026400*                                                                 02390000
026500*  # above bar code (item number) on side of label (U28)          02400000
026600         10  FILLER                  PIC X(15)    VALUE           02410000
026700             '202200001810063'.                                   02420000
026800         10  PC250-ITEM-NBR-BC-NBR   PIC X(08)    VALUE           02430000
026900                                     '@@@@@@@@'.                  02440000
027000         10  FILLER                  PIC X(01)    VALUE X'0D'.    02450001
027100* 16 digit barcode along the side of label (item number) (U29)    02460000
027200         10  FILLER                  PIC X(16)    VALUE           02470000
027300             '2e2205001950010C'.                                  02480000
027400         10  PC250-ITEM-NBR-BC       PIC X(08)    VALUE           02490000
027500                                     '@@@@@@@@'.                  02500000
027600         10  FILLER                  PIC X(01)    VALUE X'0D'.    02510001
027700* 21 digit # below below long barcode across the top of label     02520000
027800*    (po, item number, outer pack) (U30)                          02530000
027900         10  FILLER                  PIC X(15)    VALUE           02540000
028000             '302205000970353'.                                   02550000
028100         10  PC250-PO-ITM-UNITS      PIC X(23)    VALUE           02560000
028200                                '@@@@@@@@@@@@@@@@@@@@@@@'.        02570000
028300         10  FILLER                  PIC X(01)    VALUE X'0D'.    02580001
028400* 21 digit barcode along the top of label                         02590000
028500*    (po, item number, outer pack) (U31)                          02600000
028600         10  FILLER                  PIC X(16)    VALUE           02610000
028700             '3e2205000850370C'.                                  02620000
028800         10  PC250-PO-ITM-UNITS-BC   PIC X(21)    VALUE           02630000
028900                                  '@@@@@@@@@@@@@@@@@@@@@'.        02640000
029000         10  FILLER                  PIC X(01)    VALUE X'0D'.    02650001
029100*  barcode description along side of label (U32)                  02660000
029200         10  FILLER                  PIC X(15)    VALUE           02670000
029300             '202200002000073'.                                   02680000
029400         10  FILLER                  PIC X(15)    VALUE           02690000
029500                                     'RDM ITEM NUMBER'.           02700000
029600         10  FILLER                  PIC X(01)    VALUE X'0D'.    02710001
029700* barcode description for long barcode across top of label (U33)  02720000
029800         10  FILLER                  PIC X(15)    VALUE           02730000
029900             '302205000350363'.                                   02740000
030000         10  FILLER                  PIC X(26)    VALUE           02750000
030100                                  'RDM BLIND RECEIPT CHECK-IN'.   02760000
030200         10  FILLER                  PIC X(01)    VALUE X'0D'.    02770001
030500*                                                                 02780000
030600*** label information - line 7                                    02790000
030700*                                                                 02800000
031000* ERROR MESSAGE 1 - line (U34)                                    02810000
031100         10  FILLER                  PIC X(15)    VALUE           02820000
031200             '341100402190390'.                                   02830000
031300         10  PC250-ERROR-MSG-1       PIC X(35)    VALUE           02840000
031400             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               02850000
031500         10  FILLER                  PIC X(01)    VALUE X'0D'.    02860001
031600* ERROR MESSAGE 2 - line  (U35)                                   02870000
031700         10  FILLER                  PIC X(15)    VALUE           02880000
031800             '341100402390390'.                                   02890000
031900         10  PC250-ERROR-MSG-2       PIC X(35)    VALUE           02900000
032000             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               02910000
032100         10  FILLER                  PIC X(01)    VALUE X'0D'.    02920001
032200* store number pos 1 - underline                                  02930000
032300         10  FILLER                  PIC X(22)    VALUE           02940000
032400             '1X1100001030150L044001'.                            02950000
032500         10  FILLER                  PIC X(01)    VALUE X'0D'.    02960001
032510* store number pos 2 - underline                                  02970000
032520         10  FILLER                  PIC X(22)    VALUE           02980000
032530             '1X1100001030100L040001'.                            02990000
032540         10  FILLER                  PIC X(01)    VALUE X'0D'.    03000001
032600* store number pos 3 - underline                                  03010000
032700         10  FILLER                  PIC X(22)    VALUE           03020000
032800             '1X1100001030058L038001'.                            03030000
032900         10  FILLER                  PIC X(01)    VALUE X'0D'.    03040001
033000* store number pos 4 - underline                                  03050000
033100         10  FILLER                  PIC X(22)    VALUE           03060000
033200             '1X1100001030012L040001'.                            03070000
033300         10  FILLER                  PIC X(01)    VALUE X'0D'.    03080001
033400****************************************************************  03090000
033500*  If this is for an odd carton then the following should be   *  03100000
033600*  moved to the pc250-odd-carton-box                           *  03110000
033700*                '1X1100001200090L095017'                      *  03120000
033800*  if this is not for an odd-carton then move the following    *  03130000
033900*  to pc250-odd-carton-box '1X1100001200090L000000  '          *  03140000
034000******************************************8*********************  03150000
034100* odd carton - BOX   (U39)                                        03160000
034200         10  PC250-ODD-CARTON-BOX    PIC X(22)    VALUE  SPACES.  03170000
034300         10  FILLER                  PIC X(01)    VALUE X'0D'.    03180001
034400****************************************************************  03190000
034500*  If this is for an odd carton then the following should be   *  03200000
034600*  moved to the pc250-odd-carton-field                         *  03210000
034700*                '341100401360170ODD CRTN  '                   *  03220000
034800*  if this is not for an odd-carton then move the following    *  03230000
034900*  to pc250-odd-carton-field '341100401360170             '    *  03240000
035000****************************************************************  03250000
035100* odd carton - TEXT   (U40)                                       03260000
035200         10  PC250-ODD-CARTON-FIELD  PIC X(25)    VALUE  SPACES.  03270000
035300         10  FILLER                  PIC X(01)    VALUE X'0D'.    03280001
035600*                                                                 03290000
035700***** label information - line 8                                  03300000
035800*                                                                 03310000
035900*                                                                 03320000
036200* CRTN - text (U41)                                               03330000
036300         10  FILLER                  PIC X(15)    VALUE           03340000
036400             '341100600230355'.                                   03350000
036500         10  PC250-CRTN-HDG          PIC X(05)    VALUE 'XXXXX'.  03360000
036600         10  FILLER                  PIC X(01)    VALUE X'0D'.    03370001
036700* crtn - data  (U42)                                              03380000
036800         10  FILLER                  PIC X(15)    VALUE           03390000
036900             '342100600230305'.                                   03400000
037000         10  PC250-CRTN-NBR          PIC X(05)    VALUE 'XXXXX'.  03410000
037100         10  FILLER                  PIC X(01)    VALUE X'0D'.    03420001
037200* CASI audit indicator - top left corner of label (U43)           03430000
037300         10  FILLER                  PIC X(15)    VALUE           03440000
037400             '374200600320365'.                                   03450000
037500         10  PC250-AUDIT-IND         PIC X(01)    VALUE  '@'.     03460000
037600             88  PC250-AUDIT-COMPLETE             VALUE  SPACE.   03470000
037700             88  PC250-QC-SPOT-AUDIT              VALUE  'Q'.     03480000
037800             88  PC250-UNKNOWN                    VALUE  'U'.     03490000
037900             88  PC250-REWORK                     VALUE  'R'.     03500000
037910             88  PC250-100-PERCENT                VALUE  '%'.     03510000
037920         10  FILLER                  PIC X(01)    VALUE X'0D'.    03520001
037930* box around the manifest number above barcode (U44)              03530000
037940         10  FILLER                  PIC X(22)    VALUE           03540000
037950             '1X1100002410067L093039'.                            03550000
037960         10  FILLER                  PIC X(01)    VALUE X'0D'.    03560001
037970* USER ID -  (U45)                                                03570000
037980         10  FILLER                  PIC X(15)    VALUE           03580000
037990             '302200002780050'.                                   03590000
038000         10  PC250-USER-ID           PIC X(07)    VALUE '@@@@@@@'.03600000
038100         10  FILLER                  PIC X(01)    VALUE X'0D'.    03610001
038200*----------------------------------------------------------------*03620000
038300* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                     03630000
038400*----------------------------------------------------------------*03640000
038500 01  PC250-LABEL-ALLOCATIONS.                                     03650000
038600     05  PC250-CI-CTL-STK-LBL      PIC X(10)   VALUE 'CI-CTL STK'.03660000
038700     05  PC250-CI-E-COMM-LBL       PIC X(10)   VALUE 'CI-E COMM '.03670000
038800     05  PC250-CS-CTL-STK-LBL      PIC X(10)   VALUE 'CS-CTL STK'.03680000
038900     05  PC250-CS-E-COMM-LBL       PIC X(10)   VALUE 'CS-E COMM '.03690000
039000     05  PC250-STORAGE-HDG-VALUE   PIC X(08)   VALUE 'STORAGE:'.  03700000
039100     05  PC250-ZONE-HDG-VALUE      PIC X(08)   VALUE 'ZONE:   '.  03710000
040600*----------------------------------------------------------------*03720000
040700* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                    *03730000
040800*----------------------------------------------------------------*03740000
040900 01  PC250-LABEL-ALLOCATIONS.                                     03750000
041000     05  PC250-FORM-REPRT-BOX      PIC X(22)   VALUE              03760000
041100                                   '1X1100000020125L090015'.      03770000
041200     05  PC250-FORM-REPRT-FLD      PIC X(22)   VALUE              03780000
041300                                   '331100000170200REPRINT'.      03790000
041400     05  PC250-FORM-REVSD-FLD      PIC X(22)   VALUE              03800000
041500                                   '331100000170200REVISED'.      03810000
041600     05  PC250-FORM-NO-RPRT-FLD    PIC X(22)   VALUE              03820000
041700                                   '331100000170200@@@@@@@'.      03830000
041800     05  PC250-FORM-NO-RPRT-BOX    PIC X(22)   VALUE              03840000
041900                                   '1X1100000020125L000000'.      03850000
042000     05  PC250-FORM-ODD-CRTN-BOX   PIC X(22)   VALUE              03860000
042100                                   '1X1100001200090L095017'.      03870000
042200     05  PC250-FORM-ODD-CRTN-FLD   PIC X(25)   VALUE              03880000
042300                                   '331100401360170ODD CRTN  '.   03890000
042400     05  PC250-FORM-NO-ODD-BOX     PIC X(22)   VALUE              03900000
042500                                   '1X1100001200090L000000'.      03910000
042600     05  PC250-FORM-NO-ODD-FLD     PIC X(25)   VALUE              03920000
042700                                   '331100401360170@@@@@@@@@@'.   03930000
042800     05  PC250-FORM-INPK-BOX       PIC X(22)   VALUE              03940000
042900                                   '1X1100001840180L200017'.      03950000
043000     05  PC250-FORM-INPK-HDG       PIC X(32)   VALUE              03960000
043100                                '331100402000370INPK CNVY UNTS: '.03970000
043200     05  PC250-FORM-NO-INPK-BOX    PIC X(22)   VALUE              03980000
043300                                   '1X1100001840180L000000'.      03990000
043400     05  PC250-FORM-OTPK-HDG       PIC X(32)   VALUE              04000000
043500                                 '331100402000370OUTER PK UNTS: '.04010000
043600     05  PC250-FORM-OF             PIC X(19)   VALUE              04020000
043700                                 '302200003910257 OF '.           04030000
