000100******************************************************************10/12/00
000200*    THIS COPYBOOK REFLECTS THE COMMAREA LAYOUT TO PASS STORE    *PCWS187 
000300*    DATA TO THE STORE MANIFEST MODULE (PCKCS721).               *        
000400******************************************************************        
000500 01  PC187-COMMAREA-REC.                                                  
000600     05  PC187-STR-NBR                 PIC  S9(04)  VALUE ZERO.           
000700     05  PC187-NO-OF-LBLS              PIC  S9(09)  VALUE ZERO.           
000800     05  PC187-START-MFST-NBR          PIC  S9(11)  VALUE ZERO.           
000810     05  PC187-END-MFST-NBR            PIC  S9(11)  VALUE ZERO.           
000820     05  PC187-CALL-RETURN-AREA.                                          
000830         10  PC187-CRA-RET-CDE         PIC  X(02)  VALUE SPACES.          
000840             88  PC187-CRA-SUCCESSFUL              VALUE '00'.            
000850             88  PC187-CRA-SQLERROR                VALUE '01'.            
000851             88  PC187-CRA-INVALID                 VALUE '02'.            
000860         10  PC187-CRA-RET-MSG         PIC  X(25)  VALUE SPACES.          
000870         10  PC187-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.          
