000100*  COMMAREA LAYOUT TO PASS THE PCC PICK MADE INFORMATION          00010000
000200*  TO PCKCS762                                                    00020000
000300*  COPYBOOK LENGTH IS 250.                                        00030000
000400                                                                  00040000
000500 01  PC243-COMMAREA.                                              00050000
000600     05  PC243-FUNCTION               PIC  X(10)                  00060000
000700                                      VALUE 'PICKMADE'.           00070000
000800     05  PC243-CALLING-PROGRAM        PIC  X(08)  VALUE SPACES.   00080000
000900                                                                  00090000
001000     05  PC243-CALL-RETURN-AREA.                                  00100000
001100         10  PC243-CRA-RET-CDE        PIC  X(02)  VALUE '00'.     00110000
001200             88  PC243-SUCCESSFUL                 VALUE '00'.     00120000
001300             88  PC243-ERROR                      VALUE '01'.     00130000
001400             88  PC243-SQL-ERROR                  VALUE '02'.     00140000
001500             88  PC243-INVALID-DATA               VALUE '03'.     00150000
001510             88  PC243-UNKNOWN-USER               VALUE '04'.     00151002
001600         10  PC243-CRA-RET-MSG        PIC  X(25)  VALUE SPACES.   00160000
001700                                                                  00170000
001800     05  PC243-DC-NBR                 PIC  9(04)  VALUE ZEROS.    00180000
001900     05  PC243-PICK-ORDER-NBR.                                    00190000
002000         10  PC243-HDR-ORD-NBR        PIC  X(08).                 00200000
002100         10  PC243-HDR-RCVR-SEQ-NBR   PIC  X(03).                 00210000
002200         10  PC243-HDR-ORD-LNE-NBR    PIC  X(04).                 00220000
002300         10  PC243-HDR-WORK-ORD-SEQ-NBR                           00230000
002400                                      PIC  X(03).                 00240000
002500         10  PC243-HDR-WO-INS-SEQ-NBR PIC  X(03).                 00250000
002600     05  PC243-INNER-PK-IND           PIC S9(01)  VALUE ZEROS.    00260000
002700         88  PC243-INNER-PK-YES                   VALUE -1.       00270000
002800         88  PC243-INNER-PK-NO                    VALUE ZERO.     00280000
002900     05  PC243-INNER-PK-QTY           PIC S9(05)  VALUE ZEROS.    00290000
003000     05  PC243-PRODUCT-NM.                                        00300000
003100         10  FILLER                   PIC  X(06).                 00310001
003200         10  PC243-STR-NBR            PIC  9(04).                 00320001
003300     05  PC243-LOCATION-NM            PIC  X(10)  VALUE SPACES.   00330000
003400     05  PC243-BOX-BAR-CODE-NBR       PIC  X(20)  VALUE SPACES.   00340000
003500     05  PC243-EXP-PICK-ORDER-QTY     PIC S9(05)  VALUE ZEROS.    00350000
003600     05  PC243-PICKED-QTY             PIC S9(05)  VALUE ZEROS.    00360000
003700*DMH 05  PC243-PICK-MADE-TM           PIC  X(25)  VALUE SPACES.   00370003
003710     05  PC243-PICKMADE-DATE.                                     00371003
003720         10  PC243-PICKMADE-DATE-YYYY PIC  X(04).                 00372003
003730         10  PC243-FILLER-1           PIC  X(01).                 00373003
003740         10  PC243-PICKMADE-DATE-MM   PIC  X(02).                 00374003
003750         10  PC243-FILLER-1           PIC  X(01).                 00375003
003760         10  PC243-PICKMADE-DATE-DD   PIC  X(02).                 00376003
003770     05  PC243-PICKMADE-TIME.                                     00377003
003780         10  PC243-PICKMADE-TIME-HH   PIC  X(02).                 00378003
003790         10  PC243-FILLER-1           PIC  X(01).                 00379003
003791         10  PC243-PICKMADE-TIME-MM   PIC  X(02).                 00379103
003792         10  PC243-FILLER-1           PIC  X(01).                 00379203
003793         10  PC243-PICKMADE-TIME-SS   PIC  X(02).                 00379303
003800     05  PC243-PICKER-ID              PIC  X(08)  VALUE SPACES.   00380000
003900     05  PC243-TOTAL-PICKED-QTY       PIC S9(05)  VALUE ZEROS.    00390000
004000*                                                                 00400000
004100     05  FILLER                       PIC  X(93)  VALUE SPACES.   00410003
004200*DMH 05  FILLER                       PIC  X(86)  VALUE SPACES.   00420003
