000100***************************************************************** 00010000
000200* PCWS191 - MISCELLANEOUS DC LABEL WITH 12 CHARACTER 3 OF 9     * 00020001
000300*           BARCODE (DATA RECORD)          - USES SOCKETS -     * 00030000
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040000
000500*                                                               * 00050000
000600* THIS IS THE LAYOUT FOR THE DATA PORTION OF A SHIPPING LABEL.  * 00060000
000700* IT MUST BE PRECEDED BY THE FORMS RECORDS DESCRIBED IN PCSW119.* 00070000
000800* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE * 00080000
000900* FIRST POSITION.                                               * 00090000
001000*                                                               * 00100000
001100* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00110000
001200*                    I M P O R T A N T                          * 00120000
001300* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 4-05 LEVELS * 00130000
001400* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 * 00140000
001500* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  * 00150000
001600* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        * 00160000
001700* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       * 00170000
001800***************************************************************** 00180000
001900                                                                  00190000
002000 01  PC191-MAX-LABEL-LINES            PIC S9(04) VALUE  +2        00200001
002100                                                COMP SYNC.        00210000
002200***                                                               00220000
002300***    NUMBER OF 05 LEVELS ------------------------------/\       00230000
002400***                                                               00240000
002500***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00250000
002600***               IN PC191-ML-DATA-LENGTH.                        00260001
002700***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00270000
002800***                                                               00280000
002900***************************************************************** 00290000
003000 01  PC191-MISC-LABEL-DATA.                                       00300001
003100     05 FILLER.                                                   00310000
003200* U01 - DESCRIPTION LINE 1                                        00320000
003300         10  FILLER                  PIC X(04)    VALUE 'U01'.   00330000
003400         10  PC191-DESC-LNE-1        PIC X(30)    VALUE SPACES.   00340001
003500         10  FILLER                  PIC X(01)    VALUE  ''.     00350000
003600* U02 - DESCRIPTION LINE 2                                        00360000
003700         10  FILLER                  PIC X(04)    VALUE 'U02'.   00370000
003800         10  PC191-DESC-LNE-2        PIC X(30)    VALUE SPACES.   00380001
003900         10  FILLER                  PIC X(01)    VALUE  ''.     00390000
004000* U03 - DESCRIPTION LINE 3                                        00400000
004100         10  FILLER                  PIC X(04)    VALUE 'U03'.   00410000
004200         10  PC191-DESC-LNE-3        PIC X(30)    VALUE SPACES.   00420001
004300         10  FILLER                  PIC X(01)    VALUE  ''.     00430000
004400* U04 - TEXT QUALIFIER                                            00440002
004500         10  FILLER                  PIC X(04)    VALUE 'U04'.   00450000
004600         10  PC191-3OF9-BC-NBR       PIC X(20)    VALUE SPACES.   00460001
004700         10  FILLER                  PIC X(01)    VALUE  ''.     00470000
004800* U05 - 3 OF 9 BARCODE                                            00480000
004900*        10  FILLER                  PIC X(04)    VALUE 'U05'.   00490001
005000*        10  PC191-3OF9-BC           PIC X(13)    VALUE SPACES.   00500001
005100***      10  PC191-3OF9-BC-EOT       PIC X(01)   VALUE ''.       00510001
005200***          88 PC191-3OF9-BC-END-TEXT           VALUE ''.       00520001
005300***          88 PC191-3OF9-BC-FILLER             VALUE ' '.       00530001
005400* U06 - DUMMY                                                     00540000
005500         10  FILLER                  PIC X(04)    VALUE 'U06'.   00550000
005600         10  FILLER                  PIC X(05)    VALUE SPACES.   00560000
005700         10  FILLER                  PIC X(01)    VALUE  ''.     00570000
005800         10  FILLER                  PIC X(100)   VALUE  SPACES.  00580001
005900*                                                                 00590000
006000*                                                                 00600000
006100*****                                                             00610000
006200*                                                                 00620000
006300* E     - NUMBER OF COPIES THAT WILL PRINT FOR EACH LABEL         00630000
006400*                                                                 00640000
006500*                                                                 00650000
006600     05 FILLER.                                                   00660000
006700         10 FILLER                   PIC X(02) VALUE              00670000
006800            'E'.                                                 00680000
006900         10 PC191-MISC-TOT-LABELS    PIC 9(04) VALUE ZEROES.      00690001
007000         10  FILLER                  PIC X(01)    VALUE  ''.     00700000
007100* G -                                                             00710000
007200         10 FILLER                   PIC X(02) VALUE              00720000
007300            'G'.                                                 00730000
007400         10  FILLER                  PIC X(01)    VALUE  ''.     00740000
007500         10  FILLER                  PIC X(230)   VALUE  SPACES.  00750000
007600                                                                  00760000
007700                                                                  00770000
007800 01  PC191-MISC-LABEL-DATA-TABLE REDEFINES                        00780001
007900                                 PC191-MISC-LABEL-DATA.           00790001
008000     05 PC191-MISC-LABEL-LINE OCCURS  2 TIMES                     00800001
008100                           INDEXED BY PC191-IDX                   00810001
008200                                      PIC X(240).                 00820000
008300                                                                  00830000
008400*----------------------------------------------------------------*00840000
008500* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00850000
008600*----------------------------------------------------------------*00860000
008700 01  PC191-MISC-DATA-LENGTH.                                      00870001
008800     05  FILLER                        PIC 9(03)    VALUE  140.   00880001
008900     05  FILLER                        PIC 9(03)    VALUE   10.   00890000
009000                                                                  00900000
009100 01  PC191-MISC-DATA-LNGTH-VALUES REDEFINES                       00910001
009200                                  PC191-MISC-DATA-LENGTH.         00920001
009300     05  PC191-MISC-DATA-LINE-LENGTH  OCCURS 2 TIMES              00930001
009400                                      INDEXED BY PC191-IDX-2      00940001
009500                                      PIC 9(03).                  00950000
009600                                                                  00960000
