000100******************************************************************00010000
000200* PCWS057 - 100 CHAR                                             *00020005
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    PCC UPLOADED OF LABOR DATA                                  *00040000
000500*    INBOUND LAUNCHED                                            *00050004
000800******************************************************************00080000
000900                                                                  00090000
001300 01  PC057-UPLOAD-ERROR-RECORD.                                   00130000
001400     05  PC057-RECORD-TYPE               PIC X(01) VALUE SPACE.   00140001
001500         88  PC057-INBOUND-LAUNCH                  VALUE 'L'.     00150008
001900     05  PC057-ERROR-DATA                PIC X(99).               00190001
002100                                                                  00210001
002110     05  PC057-INBOUNDLAUNCH-REC  REDEFINES PC057-ERROR-DATA.     00211001
002120         10  PC057-IL-RET-CDE            PIC  X(02).              00212006
002121         10  PC057-IL-DC-NBR             PIC  9(04).              00212106
002130         10  PC057-IL-AREA-NAME          PIC  X(10).              00213001
002140         10  PC057-IL-TAG-BARCODE        PIC  X(22).              00214001
002150         10  PC057-IL-PICKORDER-NBR      PIC  X(21).              00215001
002160         10  PC057-IL-LAUNCH-DATE        PIC  X(10).              00216007
002170         10  PC057-IL-LAUNCH-TIME        PIC  X(08).              00217001
002180         10  PC057-IL-PICKER-BARCODE     PIC  X(08).              00218001
002190         10  PC057-IL-PICKER-NAME        PIC  X(08).              00219002
002191         10  FILLER                      PIC  X(06).              00219106
002192                                                                  00219201
