000100*  COMMAREA LAYOUT TO PASS THE PCC OUTBOUND BOX OPENED            00010005
000200*  INFORMATION TO PCKCS764                                        00020000
000300*  COPYBOOK LENGTH IS 200.                                        00030003
000400                                                                  00040000
000500 01  PC245-COMMAREA.                                              00050000
000600     05  PC245-FUNCTION               PIC  X(10)                  00060000
000700                                      VALUE 'BOXOPENED '.         00070005
000800     05  PC245-CALLING-PROGRAM        PIC  X(08)  VALUE SPACES.   00080000
000900                                                                  00090000
001000     05  PC245-CALL-RETURN-AREA.                                  00100000
001100         10  PC245-CRA-RET-CDE        PIC  X(02)  VALUE '00'.     00110000
001200             88  PC245-SUCCESSFUL                 VALUE '00'.     00120000
001300             88  PC245-ERROR                      VALUE '01'.     00130000
001400             88  PC245-SQL-ERROR                  VALUE '02'.     00140000
001500             88  PC245-INVALID-DATA               VALUE '03'.     00150000
001510             88  PC245-UNKNOWN-USER               VALUE '04'.     00151007
001600         10  PC245-CRA-RET-MSG        PIC  X(25)  VALUE SPACES.   00160000
001700                                                                  00170000
001800     05  PC245-DC-NBR                 PIC  9(04)  VALUE ZEROS.    00180001
001900     05  PC245-LOCATION-NM            PIC  X(10)  VALUE SPACES.   00190001
002000     05  PC245-BOX-BAR-CODE-NBR       PIC  X(20)  VALUE ZEROS.    00200001
002100     05  PC245-BOXOPEN-DATE.                                      00210005
002200         10  PC245-BOXOPEN-DATE-YYYY PIC   X(04).                 00220005
002300         10  PC245-FILLER-1           PIC  X(01).                 00230001
002400         10  PC245-BOXOPEN-DATE-MM    PIC  X(02).                 00240005
002500         10  PC245-FILLER-1           PIC  X(01).                 00250001
002600         10  PC245-BOXOPEN-DATE-DD    PIC  X(02).                 00260005
002700     05  PC245-BOXOPEN-TIME.                                      00270005
002800         10  PC245-BOXOPEN-TIME-HH    PIC  X(02).                 00280005
002900         10  PC245-FILLER-1           PIC  X(01).                 00290001
003000         10  PC245-BOXOPEN-TIME-MM    PIC  X(02).                 00300006
003100         10  PC245-FILLER-1           PIC  X(01).                 00310001
003200         10  PC245-BOXOPEN-TIME-SS    PIC  X(02).                 00320006
003300     05  PC245-BOXOPEN-USER-ID        PIC  X(08)  VALUE SPACES.   00330005
003400*                                                                 00340001
003500     05  FILLER                       PIC  X(95)  VALUE SPACES.   00350003
