000100*----------------------------------------------------------------*00010000
000200*                         PCWS239                                *00020000
000300*                                                                *00030000
000400*   THIS IS THE CONTROL CARD LAYOUT TO BE USED TO PASS           *00040000
000500*   INFORMATION INTO THE UNITS WORKED REPORTING JOB STREAMS.     *00050000
000600*                                                                *00060000
000700*   LENGTH OF LAYOUT:  80                                        *00070000
000800*                                                                *00080000
000900*----------------------------------------------------------------*00090000
001000                                                                  00100000
001100 01  PC239-CONTROL-CARD.                                          00110000
001200     05  CC-USER-ID                       PIC X(08).              00120000
001300         88  CC-BATCH-REQUEST                   VALUE 'BATCH'.    00130000
001400     05  CC-OPER-UNIT-ID                  PIC 9(04).              00140001
001500         88  CC-OPER-ALL                        VALUE 9999.       00150002
001510         88  CC-OPER-EXTRACT-ALL                VALUE 0000.       00160004
001600     05  CC-REQUEST-DATE.                                         00170000
001700         10  CC-REQ-DATE-YYYY             PIC X(04).              00180000
001800         10  FILLER                       PIC X(01).              00190000
001900         10  CC-REQ-DATE-MM               PIC X(02).              00200000
002000         10  FILLER                       PIC X(01).              00210000
002100         10  CC-REQ-DATE-DD               PIC X(02).              00220000
002200     05  CC-REQUEST-TIME.                                         00230000
002300         10  CC-REQ-TIME-HH               PIC X(02).              00240000
002400         10  FILLER                       PIC X(01).              00250000
002500         10  CC-REQ-TIME-MM               PIC X(02).              00260000
002600         10  FILLER                       PIC X(01).              00270000
002700         10  CC-REQ-TIME-SS               PIC X(02).              00280000
002710     05  CC-START-RPT-DATE-RANGE.                                 00290000
002720         10  CC-START-RDR-YYYY            PIC X(04).              00300000
002721         10  FILLER                       PIC X(01).              00310000
002722         10  CC-START-RDR-MM              PIC X(02).              00320000
002723         10  FILLER                       PIC X(01).              00330000
002724         10  CC-START-RDR-DD              PIC X(02).              00340000
002725     05  CC-END-RPT-DATE-RANGE.                                   00350000
002726         10  CC-END-RDR-YYYY              PIC X(04).              00360000
002727         10  FILLER                       PIC X(01).              00370000
002728         10  CC-END-RDR-MM                PIC X(02).              00380000
002729         10  FILLER                       PIC X(01).              00390000
002730         10  CC-END-RDR-DD                PIC X(02).              00400000
002731     05  CC-FISCAL-YYYY                   PIC 9(04).              00410000
002732     05  CC-FISCAL-MONTH                  PIC 9(02).              00420000
002733     05  CC-FISCAL-WEEK                   PIC 9(02).              00430000
002734     05  CC-TO-RDS-IND                    PIC X(01).              00440000
002736         88  CC-ROUTE-TO-RDS                    VALUE 'Y'.        00450000
002737     05  CC-TO-PRINTER-ID                 PIC X(08).              00460000
002738     05  CC-REPORT-TYPE-CDE               PIC X(01).              00470000
002739         88  CC-RPT-FISCAL-YEAR                 VALUE 'A'.        00480000
002740         88  CC-RPT-FISCAL-MONTH                VALUE 'B'.        00490000
002741         88  CC-RPT-FISCAL-WEEK                 VALUE 'C'.        00500000
002742         88  CC-RPT-DATE-RANGE                  VALUE 'D'.        00510000
002743         88  CC-RPT-BUS-DATE                    VALUE 'E'.        00520000
002744     05  CC-REPORT-PREV-IND               PIC X(01).              00530005
002745         88  CC-RPT-NEEDS-PREV-DATA             VALUE 'Y'.        00540005
002746     05  CC-REPORT-CONTENT-CDE            PIC X(01).              00550005
002747         88  CC-RPT-BY-PRCS-AREA                VALUE 'A'.        00560005
002748         88  CC-RPT-BY-PRCS-GROUP               VALUE 'B'.        00570005
002749         88  CC-RPT-BY-DC                       VALUE 'C'.        00580005
002750     05  CC-REPORT-CREATE-CDE             PIC X(01).              00590005
002751         88  CC-RPT-PCKRP011                    VALUE 'A'.        00600005
002752         88  CC-RPT-PCKRP012                    VALUE 'B'.        00610005
002753         88  CC-RPT-PCKRP013                    VALUE 'C'.        00620005
002753         88  CC-RPT-PCKRP014                    VALUE 'D'.        00630006
002756     05  FILLER                           PIC X(09).              00640007
002760                                                                  00650000
