000010***************************************************************** 00001000
000020*                                                               * 00002000
000030* THIS COPYBOOK HAS CHANGES REQUIRED FOR STORE NUMBER EXPANSION * 00003000
000040*                                                               * 00004000
000100***************************************************************** 00010000
000200* PCWS158 - Print Package Central Stock SML - FORM -  sockets   * 00020000
000300*                                                               * 00030000
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040000
000500*                    I M P O R T A N T                          * 00050000
000600* The label commands are strung together under only 4-05 levels * 00060000
000700* Each label command is separated by an end of text char-hex 03 * 00070000
000800* This was done to try to speed up transmission via new socket  * 00080000
000900* interface.  Systec's software separates 05 levels into        * 00090000
001000* statements.  The maximum length is 240.                       * 00100000
001100***************************************************************** 00110000
001200 01  PC158-SHIP-MFST-LBL-MAX-LN      PIC 9(03)    VALUE   9.      00120000
001300***                                                               00130000
001400***    NUMBER OF 05 LEVELS ------------------------------/\       00140000
001500***                                                               00150000
001600***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00160000
001700***               IN PC158-SML-FORM-LENGTH.                       00170000
001800***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00180000
001900***                                                               00190000
002000***************************************************************** 00200000
002100 01  PC158-SHIP-MFST-LBL.                                         00210000
002200*                                                                 00220000
002300*** label information - line 1                                    00230000
002400*                                                                 00240000
002500     05  FILLER.                                                  00250000
002600* c0000 - Continuous paper length - 0000 = normal operation       00260000
002700         10  FILLER                  PIC X(06)    VALUE           00270000
002800             'c0000'.                                            00280000
002900         10  FILLER                  PIC X(01)    VALUE  ''.     00290000
003000* e     - Select edge sensor - DEFAULT                            00300000
003100         10  FILLER                  PIC X(02)    VALUE           00310000
003200             'e'.                                                00320000
003300         10  FILLER                  PIC X(01)    VALUE  ''.     00330000
003400* M1030 - Maximum label length                                    00340000
003500         10  FILLER                  PIC X(06)    VALUE           00350000
003600             'M1030'.                                            00360000
003700         10  FILLER                  PIC X(01)    VALUE  ''.     00370000
003710*  Replaced a command with KcFMN to disable the feedback char     00371015
003720*  dmh 8/9/17                                                     00372015
003730* KcFMN - disable feedback characters to be transmitted (6)       00373015
003900         10  FILLER                  PIC X(06)    VALUE           00390015
004000             'KcFMN'.                                            00400015
004100         10  FILLER                  PIC X(01)    VALUE  ''.     00410000
004200* s     - Set up for 1 dot buffer                                 00420000
004300         10  FILLER                  PIC X(02)    VALUE           00430000
004400             's'.                                                00440000
004500         10  FILLER                  PIC X(01)    VALUE  ''.     00450000
004600* O0110 - Set form edge offset - 0110 = zero setting              00460000
004700         10  FILLER                  PIC X(06)    VALUE           00470000
004800             'O0110'.                                            00480000
004900         10  FILLER                  PIC X(01)    VALUE  ''.     00490000
005000* qA    - Clear memory module - A=upper slot                      00500000
005100         10  FILLER                  PIC X(03)    VALUE           00510000
005200             'qA'.                                               00520000
005300         10  FILLER                  PIC X(01)    VALUE  ''.     00530000
005400* L     - enter label formatting command input mode               00540000
005500         10  FILLER                  PIC X(02)    VALUE           00550000
005600             'L'.                                                00560000
005700         10  FILLER                  PIC X(01)    VALUE  ''.     00570000
005800* D11   - Set dot size - Horizontal(1) Vertical(1)                00580000
005900         10  FILLER                  PIC X(03)    VALUE           00590000
006000             'D11'.                                               00600000
006100         10  FILLER                  PIC X(01)    VALUE  ''.     00610000
006200* H     - Heat setting for label                                  00620000
006300         10  FILLER                  PIC X(03)    VALUE           00630000
006400             'H11'.                                               00640000
006500         10  FILLER                  PIC X(01)    VALUE  ''.     00650000
006600* PK    - Max speed for print cycle - K=default (6 in.per sec)    00660000
006700         10  FILLER                  PIC X(02)    VALUE           00670000
006800             'PK'.                                                00680000
006900         10  FILLER                  PIC X(01)    VALUE  ''.     00690000
007000* SK    - Max slew rate speed - K= default (6 in.per sec)         00700000
007100         10  FILLER                  PIC X(02)    VALUE           00710000
007200             'SK'.                                                00720000
007300         10  FILLER                  PIC X(01)    VALUE  ''.     00730000
007400         10  FILLER                  PIC X(185)   VALUE  SPACES.  00740015
007500*                                                                 00750000
007600*                                                                 00760000
007700*** label information - line 2                                    00770000
007800*                                                                 00780000
007900     05  FILLER.                                                  00790000
008000*  store name (U01)                                               00800000
008100         10  FILLER                  PIC X(15)    VALUE           00810000
008200             '331100400230110'.                                   00820000
008300         10  FILLER                  PIC X(10)    VALUE           00830000
008400             '@@@@@@@@@@'.                                        00840000
008500         10  FILLER                  PIC X(01)    VALUE  ''.     00850000
008600*  store number (U02)                                             00860000
008700         10  FILLER                  PIC X(15)    VALUE           00870000
008800             '392200801200193'.                                   00880001
008900         10  FILLER                  PIC X(04)    VALUE  ZEROES.  00890001
009000         10  FILLER                  PIC X(01)    VALUE  ''.     00900000
009100*  # above bar code (U03)                                         00910000
009200         10  FILLER                  PIC X(15)    VALUE           00920000
009300             '341200002790330'.                                   00930000
009400         10  FILLER                  PIC X(25)    VALUE           00940000
009500                                     '@@@@@@@@@@@@@@@@@@@@@@@@@'. 00950000
009600         10  FILLER                  PIC X(01)    VALUE  ''.     00960000
009700* increment previous field                                        00970000
009800         10  FILLER                  PIC X(03)    VALUE           00980000
009900             '+01'.                                               00990000
010000         10  FILLER                  PIC X(01)    VALUE  ''.     01000000
010100* long bar code across bottom of label (U04)                      01010000
010200         10  FILLER                  PIC X(16)    VALUE           01020000
010300             '3e4410003790340C'.                                  01030000
010400         10  PC158-SML-FORM-BC       PIC X(20)    VALUE           01040003
010900                                     '@@@@@@@@@@@@@@@@@@@@'.      01090004
011000         10  PC158-SML-FORM-BC-EOT   PIC X(01)    VALUE  ''.     01100000
011300* increment previous field                                        01130000
011400         10  FILLER                  PIC X(03)    VALUE           01140000
011500             '+01'.                                               01150000
011600         10  FILLER                  PIC X(01)    VALUE  ''.     01160000
011700*  label # of field (U05)                                         01170000
011800         10  FILLER                  PIC X(15)    VALUE           01180000
011900             '302200003910287'.                                   01190000
012000         10  FILLER                  PIC 9(04)    VALUE  ZEROES.  01200000
012100         10  FILLER                  PIC X(01)    VALUE  ''.     01210000
012200* increment previous field                                        01220000
012300         10  PC158-AUTO-LBL-CNT      PIC X(03)    VALUE           01230000
012400             '+01'.                                               01240000
012500         10  FILLER                  PIC X(01)    VALUE  ''.     01250000
012600*  total label count (U06)                                        01260000
012700         10  FILLER                  PIC X(15)    VALUE           01270000
012800             '302200003910232'.                                   01280000
012900         10  PC158-TOT-LBL-CNT       PIC 9(04)    VALUE  ZEROES.  01290000
013000         10  FILLER                  PIC X(01)    VALUE  ''.     01300000
013100*  label count  (U07)                                             01310000
013200         10  PC158-LABEL-CNT         PIC X(19).                   01320000
013300         10  FILLER                  PIC X(01)    VALUE  ''.     01330000
013400         10  FILLER                  PIC X(44)    VALUE  spaces.  01340012
013500*                                                                 01350000
013600*                                                                 01360000
013700*** label information - line 3                                    01370000
013800*                                                                 01380000
013900     05  FILLER.                                                  01390000
014000* Printer # - line (U08)                                          01400000
014100         10  FILLER                  PIC X(21)    VALUE           01410000
014200             '302200003910390PRTR #'.                             01420000
014300         10  FILLER                  PIC X(01)    VALUE  ''.     01430000
014400* Printer # - field (U09)                                         01440000
014500         10  FILLER                  PIC X(15)    VALUE           01450000
014600             '302200003910352'.                                   01460000
014700         10  PC158-SML-PRTR-NBR      PIC X(06)    VALUE           01470000
014800             'DC-307'.                                            01480000
014900         10  FILLER                  PIC X(01)    VALUE  ''.     01490000
015000* label description line (U10)                                    01500000
015100         10  FILLER                  PIC X(15)    VALUE           01510000
015200             '302200003910080'.                                   01520000
015300         10  PC158-SML-LBL-DESC      PIC X(10)    VALUE           01530000
015400             '@@@@@@@@@@'.                                        01540000
015500         10  FILLER                  PIC X(01)    VALUE  ''.     01550000
015600* ZONE/STORAGE heading - line (U11)                               01560000
015700         10  FILLER                  PIC X(15)    VALUE           01570000
015800             '331100401200370'.                                   01580000
015810         10  PC158-ZNE-STRG-HDG      PIC X(08)    VALUE           01581000
015820             '@@@@@@@@'.                                          01582000
015830         10  FILLER                  PIC X(01)    VALUE  ''.     01583000
015840* ZONE - field (U12)                                              01584000
015850         10  FILLER                  PIC X(15)    VALUE           01585000
015860             '331100401200300'.                                   01586000
015870         10  PC158-STR-ZN-ID         PIC X(05)    VALUE           01587000
015880             '@@@@@'.                                             01588000
015890         10  FILLER                  PIC X(01)    VALUE  ''.     01589000
015900* RCVR - line  (U13)                                              01590000
016000         10  FILLER                  PIC X(21)    VALUE           01600000
016100             '331100401360370RCVR: '.                             01610000
016200         10  FILLER                  PIC X(01)    VALUE  ''.     01620000
016300* RCVR - field (U14)                                              01630000
016400         10  FILLER                  PIC X(15)    VALUE           01640000
016500             '331100401360300'.                                   01650000
016600         10  PC158-PO-RCVR-NBR       PIC X(12)    VALUE           01660000
016700             '@@@@@@@@@@@@'.                                      01670000
016800         10  FILLER                  PIC X(01)    VALUE  ''.     01680000
016900* LINE - line  (U15)                                              01690000
017000         10  FILLER                  PIC X(21)    VALUE           01700000
017100             '331100401520370LINE: '.                             01710000
017200         10  FILLER                  PIC X(01)    VALUE  ''.     01720000
017300* LINE - field (U16)                                              01730000
017400         10  FILLER                  PIC X(15)    VALUE           01740000
017500             '331100401520300'.                                   01750000
017600         10  PC158-PO-LNE-NBR        PIC X(03)    VALUE           01760000
017700             '@@@'.                                               01770000
017800         10  FILLER                  PIC X(01)    VALUE  ''.     01780000
017900         10  FILLER                  PIC X(34)    VALUE  spaces.  01790000
018000*                                                                 01800000
018100*                                                                 01810000
018200*** label information - line 4                                    01820000
018300*                                                                 01830000
018400     05  FILLER.                                                  01840000
018500* SKU - line (U17)                                                01850000
018600         10  FILLER                  PIC X(21)    VALUE           01860000
018700             '331100401680370SKU:  '.                             01870000
018800         10  FILLER                  PIC X(01)    VALUE  ''.     01880000
018900* SKU - field (U18)                                               01890000
019000         10  FILLER                  PIC X(15)    VALUE           01900000
019100             '331100401680300'.                                   01910000
019200         10  PC158-SKU-NBR           PIC X(16)    VALUE           01920000
019300             '@@@@@@@@@@@@@@@@'.                                  01930000
019400         10  FILLER                  PIC X(01)    VALUE  ''.     01940000
019500* STYLE - line (U19)                                              01950000
019600         10  FILLER                  PIC X(22)    VALUE           01960000
019700             '331100401840370STYLE: '.                            01970000
019800         10  FILLER                  PIC X(01)    VALUE  ''.     01980000
019900* STYLE - field (U20)                                             01990000
020000         10  FILLER                  PIC X(15)    VALUE           02000000
020100             '331100401840300'.                                   02010000
020200         10  PC158-STYLE             PIC X(20)    VALUE           02020000
020300             '@@@@@@@@@'.                                         02030000
020400         10  FILLER                  PIC X(01)    VALUE  ''.     02040000
020500******************************************************************02050000
020600*   program  should either move the following to PC158-reprint-box02060000
020700*   if nothing is to be printed                                  *02070000
020800*            '1X1100000020290L000000'                            *02080000
020900*   or it should move the following to print a black box         *02090000
021000*            '1X1100000020290L090015'                            *02100000
021100******************************************************************02110000
021200* reprint - BOX (U21)                                             02120000
021300         10  PC158-reprint-box       PIC X(22).                   02130000
021400         10  FILLER                  PIC X(01)    VALUE  ''.     02140000
021500******************************************************************02150000
021600*   program  should either move the following to PC158-reprint-tex02160000
021700*   if nothing is to be printed                                  *02170000
021800*            '331100000200369@@@@@@@'.                           *02180000
021900*   or it should move one of the following if reprint or revised *02190000
022000*   should be printed.                                           *02200000
022100*            '331100000200369REPRINT'                            *02210000
022200*            '331100000200369REVISED'                            *02220000
022300******************************************************************02230000
022400* reprint - TEXT (U22)                                            02240000
022500         10  PC158-reprint-text      PIC X(22).                   02250000
022600         10  FILLER                  PIC X(01)    VALUE  ''.     02260000
022700         10  FILLER                  PIC X(81)    VALUE  spaces.  02270000
022800*                                                                 02280000
022900*                                                                 02290000
023000*** label information - line 5                                    02300000
023100*                                                                 02310000
023200     05  FILLER.                                                  02320000
023300******************************************************************02330000
023400*   program  should either move the following to PC158-inpk-convyx02340000
023500*   -box if nothing is to be printed                             *02350000
023600*            '331100502000370                 '                  *02360000
023700*   or it should move the following to print a black box         *02370000
023800*            '1X1100002000152L225017'.                           *02380000
023900******************************************************************02390000
024000* inpk cnvy - BOX  (U23)                                          02400000
024100         10  PC158-INPK-CONVY-BOX    PIC X(22).                   02410000
024200         10  FILLER                  PIC X(01)    VALUE  ''.     02420000
024300******************************************************************02430000
024400*   program  should either move the following to PC158-inpk-convyx02440000
024500*   -text if nothing is to be printed                            *02450000
024600*            '331100502000390                 '                  *02460000
024700*   or it should move the following to print the inner pack text *02470000
024800*            '331100402000370NIPK CNVY UNTS: '                   *02480000
024900******************************************************************02490000
024910* inpk cnvy - TEXT (U24)                                          02491000
024920         10  PC158-INPK-CONVY-TEXT   PIC X(31).                   02492000
024930         10  FILLER                  PIC X(01)    VALUE  ''.     02493000
024940* inpk cnvy - TEXT (U25)                                          02494000
024950         10  FILLER                  PIC X(15)    VALUE           02495000
024960             '331100402000250'.                                   02496000
024970         10  PC158-PACK-UNT          PIC X(04).                   02497000
024980         10  FILLER                  PIC X(01)    VALUE  ''.     02498000
024990*  label print date (U26)                                         02499000
025000         10  FILLER                  PIC X(15)    VALUE           02500000
025100             '302200003910180'.                                   02510000
025200         10  PC158-LBL-PRT-DATE      PIC X(08)    VALUE           02520000
025300             '@@@@@@@@'.                                          02530000
025400         10  FILLER                  PIC X(01)    VALUE  ''.     02540000
025500*  label print time (U27)                                         02550000
025600         10  FILLER                  PIC X(15)    VALUE           02560000
025700             '302200003910125'.                                   02570000
025800         10  PC158-LBL-PRT-TIME      PIC X(05)    VALUE           02580000
025900             '@@@@@'.                                             02590000
026000         10  FILLER                  PIC X(01)    VALUE  ''.     02600000
026100         10  FILLER                  PIC X(120)   VALUE  SPACES.  02610000
026200*                                                                 02620000
026300*                                                                 02630000
026400*** label information - line 6                                    02640000
026500*                                                                 02650000
026600     05  FILLER.                                                  02660000
026700*                                                                 02670000
026800*  # above bar code (item number) on side of label (U28)          02680000
026900         10  FILLER                  PIC X(15)    VALUE           02690000
027000             '202200001810063'.                                   02700000
027100         10  PC158-ITEM-NBR-BC-NBR   PIC X(08)    VALUE           02710000
027200                                     '@@@@@@@@'.                  02720000
027300         10  FILLER                  PIC X(01)    VALUE  ''.     02730000
027400* 16 digit barcode along the side of label (item number) (U29)    02740000
027500         10  FILLER                  PIC X(16)    VALUE           02750000
027600             '2e2205001950010C'.                                  02760000
027700         10  PC158-ITEM-NBR-BC       PIC X(08)    VALUE           02770000
027800                                     '@@@@@@@@'.                  02780000
027900         10  FILLER                  PIC X(01)    VALUE  ''.     02790000
028000* 21 digit # below below long barcode across the top of label     02800000
028100*    (po, item number, outer pack) (U30)                          02810000
028200         10  FILLER                  PIC X(15)    VALUE           02820000
028300             '302205000970353'.                                   02830000
028400         10  FILLER                  PIC X(23)    VALUE           02840000
028500                                '@@@@@@@@@@@@@@@@@@@@@@@'.        02850000
028600         10  FILLER                  PIC X(01)    VALUE  ''.     02860000
028700* 21 digit barcode along the top of label                         02870000
028800*    (po, item number, outer pack) (U31)                          02880000
028900         10  FILLER                  PIC X(16)    VALUE           02890000
029000             '3e2205000850370C'.                                  02900000
029100         10  FILLER                  PIC X(21)    VALUE           02910000
029200                                  '@@@@@@@@@@@@@@@@@@@@@'.        02920000
029300         10  FILLER                  PIC X(01)    VALUE  ''.     02930000
029400*  barcode description along side of label (U32)                  02940000
029500         10  FILLER                  PIC X(15)    VALUE           02950000
029600             '202200002000073'.                                   02960000
029700         10  FILLER                  PIC X(15)    VALUE           02970000
029800                                     'RDM ITEM NUMBER'.           02980000
029900         10  FILLER                  PIC X(01)    VALUE  ''.     02990000
030000* barcode description for long barcode across top of label (U33)  03000000
030100         10  FILLER                  PIC X(15)    VALUE           03010000
030200             '302205000350363'.                                   03020000
030300         10  FILLER                  PIC X(26)    VALUE           03030000
030400                                  'RDM BLIND RECEIPT CHECK-IN'.   03040000
030500         10  FILLER                  PIC X(01)    VALUE  ''.     03050000
030600         10  FILLER                  PIC X(41)    VALUE  SPACES.  03060000
030700*                                                                 03070000
030800*                                                                 03080000
030900*** label information - line 7                                    03090000
031000*                                                                 03100000
031100*                                                                 03110000
031200     05  FILLER.                                                  03120000
031300* ERROR MESSAGE 1 - line (U34)                                    03130000
031400         10  FILLER                  PIC X(15)    VALUE           03140000
031500             '341100402190390'.                                   03150000
031600         10  PC158-ERROR-MSG-1       PIC X(35)    VALUE           03160000
031700             'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.               03170000
031800         10  FILLER                  PIC X(01)    VALUE  ''.     03180000
031900* ERROR MESSAGE 2 - line  (U35)                                   03190000
032000         10  FILLER                  PIC X(15)    VALUE           03200000
032100             '341100402390390'.                                   03210000
032200         10  PC158-ERROR-MSG-2       PIC X(35)    VALUE           03220000
032300             'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX'.               03230000
032400         10  FILLER                  PIC X(01)    VALUE  ''.     03240000
032500* store number pos 1 - underline (U36)                            03250000
032600         10  FILLER                  PIC X(22)    VALUE           03260000
032700             '1X1100001030150L044001'.                            03270001
032800         10  FILLER                  PIC X(01)    VALUE  ''.     03280000
032810* store number pos 2 - underline (U37)                            03281014
032820         10  FILLER                  PIC X(22)    VALUE           03282001
032830             '1X1100001030100L044001'.                            03283001
032840         10  FILLER                  PIC X(01)    VALUE  ''.     03284001
032900* store number pos 3 - underline (U38)                            03290014
033000         10  FILLER                  PIC X(22)    VALUE           03300000
033100             '1X1100001030058L038001'.                            03310000
033200         10  FILLER                  PIC X(01)    VALUE  ''.     03320000
033300* store number pos 4 - underline (U39)                            03330014
033400         10  FILLER                  PIC X(22)    VALUE           03340000
033500             '1X1100001030012L040001'.                            03350000
033600         10  FILLER                  PIC X(01)    VALUE  ''.     03360000
033700****************************************************************  03370000
033800*  If this is for an odd carton then the following should be   *  03380000
033900*  moved to the PC158-odd-carton-box                           *  03390000
034000*                '1X1100001200080L095017'                      *  03400000
034100*  if this is not for an odd-carton then move the following    *  03410000
034200*  to PC158-odd-carton-box '1X1100001200030L000000  '          *  03420000
034300******************************************8*********************  03430000
034400* odd carton - BOX   (U40)                                        03440014
034500         10  PC158-ODD-CARTON-BOX    PIC X(22)    VALUE  SPACES.  03450000
034600         10  FILLER                  PIC X(01)    VALUE  ''.     03460000
035700         10  FILLER                  PIC X(23)    VALUE  SPACES.  03570001
035800*                                                                 03580000
035900*                                                                 03590000
036000***** label information - line 8                                  03600000
036100*                                                                 03610000
036200*                                                                 03620000
036300     05  FILLER.                                                  03630000
036400*                                                                 03640000
036410****************************************************************  03641001
036420*  If this is for an odd carton then the following should be   *  03642001
036430*  moved to the PC158-odd-carton-field                         *  03643001
036440*                '341100401360160ODD CRTN  '                   *  03644001
036450*  if this is not for an odd-carton then move the following    *  03645001
036460*  to PC158-odd-carton-field '341100401360160             '    *  03646001
036470****************************************************************  03647001
036480* odd carton - TEXT   (U41)                                       03648014
036490         10  PC158-ODD-CARTON-FIELD  PIC X(25)    VALUE  SPACES.  03649001
036491         10  FILLER                  PIC X(01)    VALUE  ''.     03649101
036500* CRTN - text (U42)                                               03650014
036600         10  FILLER                  PIC X(15)    VALUE           03660000
036700             '341100600230390'.                                   03670000
036800         10  PC158-CRTN-HDG          PIC X(05)    VALUE 'XXXXX'.  03680000
036900         10  FILLER                  PIC X(01)    VALUE  ''.     03690000
037000* crtn - data  (U43)                                              03700014
037100         10  FILLER                  PIC X(15)    VALUE           03710000
037200             '342100600230340'.                                   03720000
037300         10  FILLER                  PIC X(05)    VALUE 'XXXXX'.  03730000
037400         10  FILLER                  PIC X(01)    VALUE  ''.     03740000
037500* box around the manifest number above barcode (U44)              03750014
037600         10  FILLER                  PIC X(22)    VALUE           03760000
037700             '1X1100002410067L093039'.                            03770000
037800         10  FILLER                  PIC X(01)    VALUE  ''.     03780000
037900* USER ID -  (U45)                                                03790014
038000         10  FILLER                  PIC X(15)    VALUE           03800000
038100             '302200002780050'.                                   03810000
038200         10  PC158-USER-ID           PIC X(07)    VALUE '@@@@@@@'.03820000
038300         10  FILLER                  PIC X(01)    VALUE  ''.     03830000
038310* reverse image store number - BOX (U46)                          03831014
038320         10  PC158-REVERSE-STORE-BOX PIC X(22).                   03832002
038330         10  FILLER                  PIC X(01)    VALUE  ''.     03833002
038340*                                                                 03834002
038400         10  FILLER                  PIC X(103)   VALUE  SPACES.  03840002
038500*                                                                 03850000
038600*                                                                 03860000
038700***** label information - line 9                                  03870000
038701*                                                                 03870100
038702*                                                                 03870200
038703*                                                                 03870300
038704* X     - Terminate field generation                              03870400
038705*                                                                 03870500
038706*                                                                 03870600
038707     05  FILLER.                                                  03870700
038708         10  FILLER                  PIC X(02)    VALUE           03870800
038709             'X '.                                                03870900
038710         10  FILLER                  PIC X(01)    VALUE  ''.     03871000
038720         10  FILLER                  PIC X(237)   VALUE  SPACES.  03872000
038730                                                                  03873000
038740                                                                  03874000
038750 01  PC158-SHIP-MFST-LBL-TABLE       REDEFINES                    03875000
038760     PC158-SHIP-MFST-LBL.                                         03876000
038770     05  PC158-SHIP-MFST-LBL-LINE    OCCURS  9 TIMES              03877000
038780                                     INDEXED BY PC158-IDX         03878000
038790                                     PIC X(240).                  03879000
038800                                                                  03880000
038900*----------------------------------------------------------------*03890000
039000* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *03900000
039100*----------------------------------------------------------------*03910000
039200 01  PC158-SML-FORM-LENGTH.                                       03920000
039300     05  FILLER                        PIC 9(03)    VALUE   55.   03930015
039400     05  FILLER                        PIC 9(03)    VALUE  196.   03940004
039500     05  FILLER                        PIC 9(03)    VALUE  206.   03950013
039600     05  FILLER                        PIC 9(03)    VALUE  159.   03960013
039700     05  FILLER                        PIC 9(03)    VALUE  120.   03970013
039800     05  FILLER                        PIC 9(03)    VALUE  199.   03980013
039900     05  FILLER                        PIC 9(03)    VALUE  217.   03990013
040000     05  FILLER                        PIC 9(03)    VALUE  137.   04000013
040100     05  FILLER                        PIC 9(03)    VALUE    3.   04010013
040200                                                                  04020000
040300 01  PC158-SML-FORM-LNGTH-VALUES REDEFINES PC158-SML-FORM-LENGTH. 04030000
040400     05  PC158-SML-FORM-LINE-LENGTH   OCCURS 9 TIMES              04040000
040500                                      INDEXED BY PC158-IDX-2      04050000
040600                                      PIC 9(03).                  04060000
040700                                                                  04070000
040800*----------------------------------------------------------------*04080000
040900* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                    *04090000
041000*----------------------------------------------------------------*04100000
041100 01  PC158-LABEL-ALLOCATIONS.                                     04110000
041200     05  PC158-FORM-REPRT-BOX      PIC X(22)   VALUE              04120000
041300                                   '1X1100000020125L090015'.      04130000
041400     05  PC158-FORM-REPRT-FLD      PIC X(22)   VALUE              04140000
041500                                   '331100000170200REPRINT'.      04150000
041600     05  PC158-FORM-REVSD-FLD      PIC X(22)   VALUE              04160000
041700                                   '331100000170200REVISED'.      04170000
041800     05  PC158-FORM-NO-RPRT-FLD    PIC X(22)   VALUE              04180000
041900                                   '331100000170200@@@@@@@'.      04190000
042000     05  PC158-FORM-NO-RPRT-BOX    PIC X(22)   VALUE              04200000
042100                                   '1X1100000020125L000000'.      04210000
042200     05  PC158-FORM-ODD-CRTN-BOX   PIC X(22)   VALUE              04220000
042300                                   '1X1100001200090L095017'.      04230000
042400     05  PC158-FORM-ODD-CRTN-FLD   PIC X(25)   VALUE              04240000
042500                                   '331100401360170ODD CRTN  '.   04250000
042600     05  PC158-FORM-NO-ODD-BOX     PIC X(22)   VALUE              04260000
042700                                   '1X1100001200090L000000'.      04270000
042800     05  PC158-FORM-NO-ODD-FLD     PIC X(25)   VALUE              04280000
042900                                   '331100401360170@@@@@@@@@@'.   04290000
043000     05  PC158-FORM-INPK-BOX       PIC X(22)   VALUE              04300000
043100                                   '1X1100001840180L200017'.      04310000
043200     05  PC158-FORM-INPK-HDG       PIC X(32)   VALUE              04320000
043300                                '331100402000370INPK CNVY UNTS: '.04330000
043400     05  PC158-FORM-NO-INPK-BOX    PIC X(22)   VALUE              04340000
043500                                   '1X1100001840180L000000'.      04350000
043600     05  PC158-FORM-OTPK-HDG       PIC X(32)   VALUE              04360000
043700                                 '331100402000370OUTER PK UNTS: '.04370000
043800     05  PC158-FORM-OF             PIC X(19)   VALUE              04380000
043900                                 '302200003910257 OF '.           04390000
044000     05  PC158-FORM-NO-REVRSE-STR  PIC X(22)   VALUE              04400002
044100                                   '1X1100000250013L000000'.      04410002
044200     05  PC158-FORM-REVRSE-STR     PIC X(22)   VALUE              04420002
044300                                   '1X1100000250011L180082'.      04430002
