000100***********************************************************       00010000
000200*  THIS IS THE RECORD LAYOUT FOR DC PROCESSING CARTON     *       00020000
000300*  LABEL SELECTION SYSTEM.                                *       00030000
000400*                                                         *       00040000
000500*  IT IS PASSED THRU COMMAREA BY A LABEL REQUEST PROGRAM  *       00050000
000600*  INTO THE LABEL FORMATTING SUBROUTINE.                  *       00060000
000700*                                                         *       00070000
000800*  RECORD LENGTH:  200 BYTES  000 BYTES FOR THE REDEFINES *       00080006
000900*  RECORD FORMAT:  SEQUENTIAL                             *       00090000
001000*                                                         *       00100000
001100*  COPYBOOK NAME:  PCWS204                                *       00110006
001200***********************************************************       00120000
001210         10  PC204-INTER-APPL-COMMAREA  REDEFINES                 00121035
001220                                        INTER-APPL-COMM-AREA.     00122035
001221             15  FILLER                     PIC X.                00122135
001222             15  PC204-NUMBER-OF-SELECTED-ITEMS                   00122235
001223                                            PIC S9(09) COMP-3.    00122335
001224             15  PC204-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00122435
001225             15  PC204-SEL-QUEUE-NAME       PIC X(08).            00122535
001246             15  PC204-LABELS-NEEDED     PIC S9(5) COMP-3.        00124638
001248             15  PC204-REPRT-REVSD-IND   PIC  X(01).              00124843
001249                 88  PC204-INITIAL-SMOOTH             VALUE 'I'.  00124937
001250                 88  PC204-UNLOAD-AND-PRINT           VALUE 'P'.  00125037
001251                 88  PC204-RESMOOTH-CRTNS-ADD         VALUE 'A'.  00125137
001252                 88  PC204-RESMOOTH-CRTNS-DEL         VALUE 'D'.  00125237
001253                 88  PC204-REPRINT-CTN-LIST           VALUE 'R'.  00125337
001254                 88  PC204-REPRINT-STORE-LIST         VALUE 'S'.  00125439
001255             15  PC204-CALL-RETURN-AREA  PIC  X(01).              00125547
001256                 88  PC204-SQL-ERROR                  VALUE 'D'.  00125645
001257                 88  PC204-SOCKET-ERROR               VALUE 'S'.  00125745
001258                 88  PC204-SUCCESSFUL-REQ             VALUE ' '.  00125848
001265             15  PC204-OPER-UNT-ID          PIC S9(04)            00126544
001266                                                     COMP.        00126644
001267             15  PC204-FCLTY-ID             PIC S9(04)            00126744
001268                                                   COMP.          00126844
001269             15  PC204-PO-NBR               PIC S9(09)            00126944
001270                                                   COMP.          00127044
001271             15  PC204-REC-SEQ-NBR          PIC S9(09)            00127144
001272                                                   COMP.          00127244
001273             15  PC204-STR-NBR              PIC S9(04)            00127344
001274                                                   COMP.          00127444
001275             15  PC204-SML-PRINTER          PIC  X(08).           00127544
001276             15  PC204-USER-ID              PIC  X(08).           00127644
001277             15  PC204-SMTHG-PRC-ID         PIC S9(09)            00127744
001278                                                   COMP.          00127844
001279             15  PC204-TOT-LABELS-CNT       PIC S9(04)            00127944
001280                                                   COMP.          00128044
001281             15  PC204-ADDL-LABELS-REQ      PIC S9(09)            00128144
001282                                                   COMP.          00128244
001283             15  PC204-TOT-STORES-REQ       PIC S9(09)            00128344
001284                                                   COMP.          00128444
001290             15  PC204-SHP-PRTR-IP-ADDR     PIC  X(15).           00129043
001300             15  PC204-AUTO-CONVEY-LVL-SW   PIC  X(03).           00130049
001400                 88  PC204-AUTO-CONVEY-NO-CRTNS       VALUE 'NNE'.00140049
001500                 88  PC204-AUTO-CONVEY-EXCPT-CRTNS    VALUE 'EXC'.00150049
001600                 88  PC204-AUTO-CONVEY-ALL-CRTNS      VALUE 'ALL'.00160049
001700             15  PC204-RFID-STORE-SW       PIC  X(01).            00170050
001800                 88  PC204-RFID-STORE-YES             VALUE 'Y'.  00180049
001900                 88  PC204-RFID-STORE-NO              VALUE 'N'.  00190049
002300             15  FILLER                     PIC  X(115).          00230049
