000100******************************************************************00010000
000200* PCWS059 - 100 CHAR                                             *00020002
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    PCC UPLOADED OF LABOR DATA                                  *00040000
000500*    BOX OPENED                                                  *00050001
000600******************************************************************00060000
000700                                                                  00070000
000800 01  PC059-UPLOAD-ERROR-RECORD.                                   00080000
000900     05  PC059-RECORD-TYPE               PIC X(01) VALUE SPACE.   00090000
001200         88  PC059-BOX-OPEN                        VALUE 'O'.     00120000
001400     05  PC059-ERROR-DATA                PIC X(99).               00140000
001500                                                                  00150000
002900     05  PC059-BOXOPEN-REC        REDEFINES PC059-ERROR-DATA.     00290000
002910         10  PC059-BO-RET-CDE            PIC  X(02).              00291003
003000         10  PC059-BO-DC-NBR             PIC  9(04).              00300000
003100         10  PC059-BO-LOCATION-NM        PIC  X(10).              00310000
003200         10  PC059-BO-BOX-BARCODE        PIC  X(20).              00320000
003300         10  PC059-BO-BOXOPEN-DATE       PIC  X(10).              00330000
003400         10  PC059-BO-BOXOPEN-TIME       PIC  X(08).              00340000
003500         10  PC059-BO-PICKER-BARCODE     PIC  X(08).              00350000
003600         10  PC059-BO-PICKER-NAME        PIC  X(08).              00360000
003700         10  FILLER                      PIC  X(29).              00370003
003800                                                                  00380000
