000100******************************************************************00010000
000200* PCWS263 - 100 CHAR                                             *00020000
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    PCC UPLOADED OF LABOR DATA                                  *00040000
000500*    BOX CLOSED                                                  *00050000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  PC263-UPLOAD-ERROR-RECORD.                                   00080000
000900     05  PC263-LBL-REQ-TYPE              PIC X(03) VALUE SPACE.   00090000
001000         88  PC263-SML-SINGLE-STORE                VALUE 'SMS'.   00100000
001010         88  PC263-SML-ALL-STORES                  VALUE 'SMD'.   00101000
001200                                                                  00120000
001400     05  FILLER                          PIC  X(01).              00140000
001500     05  PC263-USER-ID                   PIC  X(08).              00150000
001600     05  FILLER                          PIC  X(01).              00160000
001610     05  PC263-STR-NBR                   PIC  9(04).              00161000
001611     05  FILLER                          PIC  X(01).              00161100
001612     05  PC263-PRTR-ID                   PIC  X(03).              00161201
001613     05  FILLER                          PIC  X(01).              00161301
001620     05  PC263-NO-OF-LBLS                PIC  9(04).              00162000
001621     05  FILLER                          PIC  X(01).              00162100
001630     05  PC263-START-MFST-NBR            PIC  9(08).              00163000
001631     05  FILLER                          PIC  X(01).              00163100
001640     05  PC263-END-MFST-NBR              PIC  9(08).              00164000
001641     05  FILLER                          PIC  X(01).              00164100
001650     05  PC263-SQLCODE                   PIC  999-.               00165000
001651     05  FILLER                          PIC  X(01).              00165100
001660     05  PC263-CRA-RET-CDE               PIC  X(02).              00166000
001670         88  PC263-CRA-SUCCESSFUL                  VALUE '00'.    00167000
001680         88  PC263-CRA-SQLERROR                    VALUE '01'.    00168000
001690         88  PC263-CRA-INVALID                     VALUE '02'.    00169000
001700     05  FILLER                          PIC  X(01).              00170000
001800     05  PC263-CRA-RET-MSG               PIC  X(25).              00180000
001810     05  FILLER                          PIC  X(01).              00181000
001900     05  PC263-CRA-REQ-ID                PIC  X(08).              00190000
002200     05  FILLER                          PIC  X(13).              00220001
002300                                                                  00230000
