000100***********************************************************       00010000
000200*  THIS IS THE RECORD LAYOUT FOR DC PROCESSING CARTON     *       00020000
000300*  LABEL SELECTION SYSTEM.                                *       00030000
000400*                                                         *       00040000
000500*  IT IS PASSED THRU COMMAREA BY A LABEL REQUEST PROGRAM  *       00050000
000600*  INTO THE LABEL FORMATTING SUBROUTINE.                  *       00060000
000700*                                                         *       00070000
000800*  RECORD LENGTH:  200 BYTES  000 BYTES FOR THE REDEFINES *       00080000
000900*  RECORD FORMAT:  SEQUENTIAL                             *       00090000
001000*                                                         *       00100000
001100*  COPYBOOK NAME:  PCWS206                                *       00110001
001200***********************************************************       00120000
001300 01  PC206-DC-SELECT-RECORD.                                      00130000
001400     05  PC206-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00140000
001500                                                COMP-3.           00150000
001600     05  PC206-MAX-ITEMS              PIC 99    VALUE 11.         00160000
001700     05  PC206-SELECTED-ITEM-ARRAY.                               00170000
001800         10  FILLER                   OCCURS 11 TIMES             00180000
001900                                      INDEXED BY PC206-IDX.       00190001
002000             15  PC206-ITEM           PIC S9(9) COMP-3.           00200000
002100             15  PC206-ACTION-SW      PIC X.                      00210000
002200                 88  PC206-INQ                  VALUE 'I'.        00220002
002300                 88  PC206-UPD                  VALUE 'U'.        00230002
002400                 88  PC206-DEL                  VALUE 'D'.        00240002
002500                 88  PC206-ERR                  VALUE 'E'.        00250002
002600             15  PC206-KEY-DATA.                                  00260000
002700                 20  PC206-SHIPT-UNT-ID                           00270000
002800                                             PIC S9(18).          00280003
002810                 20  PC206-STR-NUMBER                             00281004
002820                                             PIC  X(04).          00282004
002900                 20  FILLER                  PIC  X(56).          00290004
