000100******************************************************************00010000
000200**                        PCWS210                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  IN-TRANSIT CRIT SPEC SCREEN                                           
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
021000         10  PC210-INTER-APPL-COMMAREA  REDEFINES                 02100000
021001                                     INTER-APPL-COMM-AREA.        00090000
021002             15  FILLER                      PIC  X(01).                  
021003             15  PC210-SKU                   PIC S9(08)V COMP-3.          
021004             15  PC210-STORE-NBR             PIC S9(04) COMP.             
021005             15  PC210-UPC-ID                PIC S9(09) COMP.             
021010             15  PC210-STORE-NAME            PIC  X(10).                  
021011*                                                                         
021012             15  PC210-SCREEN-DISPLAY       PIC X(01).                    
021013                 88  PC210-DISPLAY-INTR         VALUE 'I'.                
021014                 88  PC210-DISPLAY-STR-EXPT     VALUE 'S'.                
021015*                                                                         
021009             15  PC210-PO-NBR                PIC S9(09) COMP.             
021009             15  PC210-RCVR-NBR              PIC S9(09) COMP.             
021020             15  FILLER                      PIC X(169).                  
