000010******************************************************************00011001
000011**                        PCWS215                                 00012001
000012**                                                                00013001
000020*    SELECTION QUEUE FOR THE UNITS WORKED APPLICATION             00014001
000040*    LENGTH = ___ BYTES                                           00015001
000050******************************************************************00016001
000200 01  PC215-SELECT-RECORD.                                         00020000
000300     05  PC215-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00030000
000400                                                COMP-3.           00040000
000500     05  PC215-MAX-ITEMS              PIC 99    VALUE 20.         00050000
000600     05  PC215-SELECTED-ITEM-ARRAY.                               00060000
000700         10  FILLER                   OCCURS 20 TIMES             00070000
000800                                      INDEXED BY PC215-IDX.       00080000
000900             15  PC215-ITEM           PIC S9(9) COMP-3.           00090000
021500             15  PC215-ACTION-SW      PIC X.                      00100000
001100                 88  PC215-INQ                  VALUE 'I'.        00110000
001200                 88  PC215-UPD                  VALUE 'U'.        00120000
001300                 88  PC215-DEL                  VALUE 'D'.        00130000
001400                 88  PC215-ERR                  VALUE 'E'.        00140000
001500             15  PC215-KEY-DATA.                                  00150000
001600*                                                                 00160000
002200                 20  PC215-OPER-DESC      PIC  X(05) VALUE SPACES.00170006
002200                 20  PC215-AREA           PIC  X(06) VALUE SPACES.00171006
002200                 20  PC215-GROUP          PIC  X(06) VALUE SPACES.00172006
038900                 20  PC215-3RD-UNITS      PIC  9(10) VALUE ZEROS. 00180006
039000                 20  PC215-3RD-PCT        PIC  9(05) VALUE ZEROS. 00190006
038900                 20  PC215-1ST-UNITS      PIC  9(10) VALUE ZEROS. 00200006
039000                 20  PC215-1ST-PCT        PIC  9(05) VALUE ZEROS. 00210006
038900                 20  PC215-2ND-UNITS      PIC  9(10) VALUE ZEROS. 00220006
039000                 20  PC215-2ND-PCT        PIC  9(05) VALUE ZEROS. 00221006
038900                 20  PC215-TOT-UNITS      PIC  9(11) VALUE ZEROS. 00222006
039000                 20  PC215-TOT-PCT        PIC  9(05) VALUE ZEROS. 00223006
004200                                                                  00227000
