000100******************************************************************04/16/94
000200*    THIS COPYBOOK REFLECTS THE RECEIPT RECORD LAYOUTS           *PCWS002 
000300*    DOWNLOADED FROM THE MAINFRAME TO THE QNX BOX ASSOCIATED     *   LV003
000400*    WITH THE PACK TO LIGHT SYSTEM PROVIDED BY AL SYSTEMS.       *PCWS002 
000500******************************************************************PCWS002 
000600 01  PC002-RECEIPT-RECORD.                                        PCWS002 
000700     05  PC002-RECORD-TYPE               PIC  X(02)  VALUE SPACE. PCWS002 
000800         88  PC002-RECEIPT-DTL                       VALUE 'DC'.  PCWS002 
000900         88  PC002-RECEIPT-TLR                       VALUE 'DE'.  PCWS002 
001000         88  PC002-RECEIPT-CONFIRM                   VALUE 'CS'.  PCWS002 
001010         88  PC002-RECEIPT-CARTON-CONFIRM            VALUE 'CC'.  00110001
001100     05  PC002-RECEIPT-LAYOUT            PIC  X(35)  VALUE SPACE. PCWS002 
001200                                                                  PCWS002 
001300     05  PC002-RECEIPT-DTL-REC  REDEFINES  PC002-RECEIPT-LAYOUT.  PCWS002 
001400         10  PC002-RECEIPT-DTL-CNTL-NBR.                          PCWS002 
001500             15  PC002-DTL-ORD-NBR       PIC  X(08).                 CL**3
001600             15  PC002-DTL-RCVR-SEQ-NBR  PIC  X(03).                 CL**3
001700             15  PC002-DTL-ORD-LNE-NBR   PIC  X(04).                 CL**3
001800             15  PC002-DTL-WORK-ORD-SEQ-NBR                          CL**3
001900                                         PIC  X(03).                 CL**3
002000             15  PC002-DTL-WO-INS-SEQ-NBR                            CL**3
002100                                         PIC  X(03).                 CL**3
002200         10  PC002-CTN-NBR               PIC  X(04).              PCWS002 
002300         10  PC002-DTL-TERM-CHAR         PIC  X(01).              PCWS002 
002400         10  FILLER                      PIC  X(09).                 CL**2
002500                                                                  PCWS002 
002600     05  PC002-RECEIPT-TLR-REC  REDEFINES  PC002-RECEIPT-LAYOUT.  PCWS002 
002700         10  PC002-RECEIPT-TLR-CNTL-NBR.                          PCWS002 
002800             15  PC002-TLR-ORD-NBR       PIC  X(08).                 CL**3
002900             15  PC002-TLR-RCVR-SEQ-NBR  PIC  X(03).                 CL**3
003000             15  PC002-TLR-ORD-LNE-NBR   PIC  X(04).                 CL**3
003100             15  PC002-TLR-WORK-ORD-SEQ-NBR                          CL**3
003200                                         PIC  X(03).                 CL**3
003300             15  PC002-TLR-WO-INS-SEQ-NBR                            CL**3
003400                                         PIC  X(03).                 CL**3
003500         10  PC002-TOTAL-CTNS-RECEIVED   PIC  X(04).              PCWS002 
003600         10  PC002-TLR-TERM-CHAR         PIC  X(01).              PCWS002 
003700         10  FILLER                      PIC  X(09).                 CL**2
003800                                                                  PCWS002 
003900     05  PC002-RECEIPT-CONFIRM-REC REDEFINES PC002-RECEIPT-LAYOUT.PCWS002 
004000         10  PC002-RECEIPT-CONFIRM-CNTL-NBR.                      PCWS002 
004100             15  PC002-CFM-ORD-NBR       PIC  X(08).                 CL**3
004200             15  PC002-CFM-RCVR-SEQ-NBR  PIC  X(03).                 CL**3
004300             15  PC002-CFM-ORD-LNE-NBR   PIC  X(04).                 CL**3
004400             15  PC002-CFM-WORK-ORD-SEQ-NBR                          CL**3
004500                                         PIC  X(03).                 CL**3
004600             15  PC002-CFM-WO-INS-SEQ-NBR                            CL**3
004700                                         PIC  X(03).                 CL**3
004800         10  PC002-CNT-RECS-RECEIVED     PIC  X(04).              PCWS002 
004900         10  PC002-RECEIVE-CONFIRMATION  PIC  X(01).              PCWS002 
005000         10  FILLER                      PIC  X(09).                 CL**2
