000100 01  PC188-COMPILE-AREA.                                                  
000200     05  PC188-COMPILE-DATE.                                              
000220         10  PC188-COMPILE-YY         PIC X(4) VALUE SPACES.              
000230         10  PC188-COMPILE-MM         PIC X(2) VALUE SPACES.              
000240         10  PC188-COMPILE-DD         PIC X(2) VALUE SPACES.              
000250         10  PC188-COMPILE-HH         PIC X(2) VALUE SPACES.              
000260         10  PC188-COMPILE-MI         PIC X(2) VALUE SPACES.              
000270     05  PC188-DISPLAY-DATE.                                              
000280         10  PC188-DISP-YY            PIC X(4).                           
000290         10  FILLER                   PIC X(1) VALUE '/'.                 
000291         10  PC188-DISP-MM            PIC X(2).                           
000292         10  FILLER                   PIC X(1) VALUE '/'.                 
000293         10  PC188-DISP-DD            PIC X(2).                           
000294         10  FILLER                   PIC X(1) VALUE SPACES.              
000295         10  PC188-DISP-HH            PIC X(2).                           
000296         10  PC188-DISP-MI            PIC X(2).                           
