000100******************************************************************00010001
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE UCC-128 SCREENS 00020001
000300*    LENGTH = 200 BYTES                                           00030001
000400******************************************************************00040001
000500         10  PC202-INTER-APPL-COMMAREA  REDEFINES                 00050001
000600                                        INTER-APPL-COMM-AREA.     00060001
000700             15  FILLER                     PIC X.                00070001
000800             15  PC202-NUMBER-OF-SELECTED-ITEMS                   00080001
000900                                            PIC S9(09) COMP-3.    00090001
001000             15  PC202-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00100001
001100             15  PC202-SEL-QUEUE-NAME       PIC X(08).            00110001
001200             15  PC202-OPER-UNT-ID          PIC S9(04) COMP.      00120001
001300             15  PC202-FCLTY-ID             PIC S9(04) COMP.      00130001
001500             15  PC202-PO-NBR               PIC S9(09) COMP.      00150001
001600             15  PC202-REC-SEQ-NBR          PIC S9(09) COMP.      00160001
001700             15  PC202-DEST-OPER-UNT-ID     PIC S9(04) COMP.      00170003
001800             15  PC202-DEST-STORE-UNITS     PIC S9(09) COMP.      00180003
001900             15  PC202-SML-PRINTER          PIC X(08).            00190005
002000             15  PC202-VENDOR-NAME          PIC X(23).            00200007
002500             15  PC202-SHIPT-UNT-ID         PIC S9(18) COMP-3.    00250001
002810             15  PC202-TEMP-QUEUE-UPDATE-SW PIC X(01).            00281001
002820                 88  PC202-UPDATE-TSQ       VALUE 'Y'.            00282001
002830                 88  PC202-NO-TSQ-UPDATE    VALUE 'N'.            00283001
002840             15  PC202-SHP-PRTR-IP-ADDR     PIC  X(15).           00284006
002850             15  PC202-PREV-CTN-COUNT       PIC 9(05).            00285009
002892             15  FILLER                     PIC X(103).           00290009
