000001***************************************************************** 00000100
000002* PCWS196 - DC-Trailer Serial # Label - FORM                    * 00000201
000003*                                                               * 00000300
000004*  This is the layout for the trailer serial # label.           * 00000401
000006* The label commands are strung together under only 4-05 levels * 00000600
000007* Each label command is separated by an end of text char-hex 03 * 00000700
000008* This was done to try to speed up transmission via new socket  * 00000800
000009* interface.  Systec's software separates 05 levels into        * 00000900
000010* statements.  The maximum length is 240.                       * 00001000
000020***************************************************************** 00002000
000030 01  PC196-TLR-LABEL-FORM-MAX-LN       PIC 9(03)    VALUE  4.     00003001
000040***    NUMBER OF 05 LEVELS --------------------------------/\     00004000
000050***                                                               00005000
000060***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00006000
000070***               IN PC196-TLR-LABEL-FORM-LENGTH.                 00007001
000080***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00008000
000090***                                                               00009000
000100***************************************************************** 00010000
000200 01  PC196-TLR-LBL-FORM.                                          00020001
000210*                                                                 00021000
000220*** - label line 1                                                00022000
000230*                                                                 00023000
000240     05  FILLER.                                                  00024000
000250* c0000 - Continuous paper length - 0000 = normal operation       00025000
000260         10  FILLER                  PIC X(06)    VALUE           00026000
000270             'c0000'.                                            00027000
000280         10  FILLER                  PIC X(01)    VALUE  ''.     00028000
000290* e     - Select edge sensor - DEFAULT                            00029000
000300         10  FILLER                  PIC X(02)    VALUE           00030000
000400             'e'.                                                00040000
000500         10  FILLER                  PIC X(01)    VALUE  ''.     00050000
000600* M1030 - Maximum label length                                    00060000
000700         10  FILLER                  PIC X(06)    VALUE           00070000
000800             'M1030'.                                            00080000
000900         10  FILLER                  PIC X(01)    VALUE  ''.     00090000
001000*  Replaced a command with KcFMN to disable the feedback char     00100006
001100*  dmh 8/9/17                                                     00110006
001200* KcFMN - disable feedback characters to be transmitted (6)       00120006
001210         10  FILLER                  PIC X(06)    VALUE           00121006
001220             'KcFMN'.                                            00122006
001300         10  FILLER                  PIC X(01)    VALUE  ''.     00130000
001400* s     - Set up for 1 dot buffer                                 00140000
001500         10  FILLER                  PIC X(02)    VALUE           00150000
001600             's'.                                                00160000
001700         10  FILLER                  PIC X(01)    VALUE  ''.     00170000
001800* O0110 - Set form edge offset - 0110 = zero setting              00180000
001900         10  FILLER                  PIC X(06)    VALUE           00190000
002000             'O0110'.                                            00200000
002100         10  FILLER                  PIC X(01)    VALUE  ''.     00210000
002200* qA    - Clear memory module - A=upper slot                      00220000
002300         10  FILLER                  PIC X(03)    VALUE           00230000
002400             'qA'.                                               00240000
002500         10  FILLER                  PIC X(01)    VALUE  ''.     00250000
002600* L     - enter label formatting command input mode               00260000
002700         10  FILLER                  PIC X(02)    VALUE           00270000
002800             'L'.                                                00280000
002900         10  FILLER                  PIC X(01)    VALUE  ''.     00290000
003000* D11   - Set dot size - Horizontal(1) Vertical(1)                00300000
003100         10  FILLER                  PIC X(03)    VALUE           00310000
003200             'D11'.                                               00320000
003300         10  FILLER                  PIC X(01)    VALUE  ''.     00330000
003400* H10   - heat level                                              00340000
003500         10  FILLER                  PIC X(03)    VALUE           00350000
003600             'H10'.                                               00360000
003700         10  FILLER                  PIC X(01)    VALUE  ''.     00370000
003800* PK    - Max speed for print cycle - K=default (6 in.per sec)    00380000
003900         10  FILLER                  PIC X(02)    VALUE           00390000
004000             'PK'.                                                00400000
004100         10  FILLER                  PIC X(01)    VALUE  ''.     00410000
004200* SK    - Max slew rate speed - K= default (6 in.per sec)         00420000
004300         10  FILLER                  PIC X(02)    VALUE           00430000
004400             'SK'.                                                00440000
004500         10  FILLER                  PIC X(01)    VALUE  ''.     00450000
004600*                                                                 00460001
005100         10  FILLER                  PIC X(185)   VALUE SPACES.   00510007
005200*                                                                 00520000
005300*                                                                 00530000
005400*** - label line 2                                                00540000
005500*                                                                 00550000
005600     05  FILLER.                                                  00560000
005700*  scac/trailer id: heading                                       00570001
005800         10  FILLER                  PIC X(15)    VALUE           00580000
005900             '392200500500390'.                                   00590001
006000         10  FILLER                  PIC X(16)    VALUE           00600001
006010             'SCAC/TRAILER ID:'.                                  00601001
006100         10  FILLER                  PIC X(01)    VALUE  ''.     00610000
006200*  scac                                                           00620001
006300         10  FILLER                  PIC X(15)    VALUE           00630000
006410             '335500501250397'.                                   00641005
006500         10  FILLER                  PIC X(04)    VALUE           00650001
006600             '@@@@'.                                              00660001
006700         10  FILLER                  PIC X(01)    VALUE  ''.     00670000
006800*  trailer id                                                     00680001
006900         10  FILLER                  PIC X(15)    VALUE           00690000
007000             '334400001950397'.                                   00700003
007100         10  filler                  PIC X(12)    VALUE           00710001
007200             '@@@@@@@@@@@@'.                                      00720001
007300         10  FILLER                  PIC X(01)    VALUE  ''.     00730000
010300* serial number - barcode                                         01030001
010400         10  FILLER                  PIC X(16)    VALUE           01040000
010500             '3e4410003690300C'.                                  01050001
010600         10  PC196-TLR-FORM-BC       PIC X(09)    VALUE           01060001
010700             '@@@@@@@@@'.                                         01070001
011200         10  PC196-TLR-FORM-BC-EOT   PIC X(01)    VALUE  ''.     01120001
011207*  serial number above bar code                                   01120701
011208         10  FILLER                  PIC X(15)    VALUE           01120800
011210             '332200502640300'.                                   01121005
011211         10  FILLER                  PIC X(09)    VALUE           01121104
011220             '@@@@@@@@@'.                                         01122001
011230         10  FILLER                  PIC X(01)    VALUE  ''.     01123000
011240*                                                                 01124001
011250         10  FILLER                  PIC X(109)   VALUE SPACES.   01125001
013200                                                                  01320000
013210*                                                                 01321001
013220*** - label line 3                                                01322001
013230*                                                                 01323001
013240     05  FILLER.                                                  01324001
013297*  label description                                              01329701
013298         10  FILLER                  PIC X(15)    VALUE           01329801
013299             '302200003910080'.                                   01329901
013300         10  PC196-TLR-LBL-DESC      PIC X(10)    VALUE           01330001
013301             '@@@@@@@@@@'.                                        01330101
013302         10  FILLER                  PIC X(01)    VALUE  ''.     01330201
013303*  label print date                                               01330301
013304         10  FILLER                  PIC X(15)    VALUE           01330401
013305             '302200003910180'.                                   01330501
013306         10  PC196-LBL-PRT-DATE      PIC X(08)    VALUE           01330601
013307             '@@@@@@@@'.                                          01330701
013308         10  FILLER                  PIC X(01)    VALUE  ''.     01330801
013309*  label print time                                               01330901
013310         10  FILLER                  PIC X(15)    VALUE           01331001
013311             '302200003910125'.                                   01331101
013312         10  PC196-LBL-PRT-TIME      PIC X(05)    VALUE           01331201
013313             '@@@@@'.                                             01331301
013314         10  FILLER                  PIC X(01)    VALUE  ''.     01331401
013315* Printer # - line                                                01331501
013316         10  FILLER                  PIC X(20)    VALUE           01331601
013317             '302200003910390PRTR '.                              01331701
013318         10  FILLER                  PIC X(01)    VALUE  ''.     01331801
013319* Printer # - field                                               01331901
013320         10  FILLER                  PIC X(15)    VALUE           01332001
013321             '302200003910357'.                                   01332101
013322         10  PC196-LBL-PRTR-NBR      PIC X(07)    VALUE           01332203
013323             'DC-307 '.                                           01332303
013324         10  FILLER                  PIC X(01)    VALUE  ''.     01332401
013325*  create user id                                                 01332501
013326         10  FILLER                  PIC X(15)    VALUE           01332601
013327             '302200003910250'.                                   01332701
013328         10  PC196-USER-ID           PIC X(07)    VALUE           01332801
013329             '@@@@@@@'.                                           01332901
013330         10  FILLER                  PIC X(01)    VALUE  ''.     01333001
013331                                                                  01333101
013332         10  FILLER                  PIC X(102)   VALUE SPACES.   01333203
013333*                                                                 01333301
013340                                                                  01334000
013400*** - label line 4                                                01340000
013500*                                                                 01350000
013600* X     - Terminate field generation                              01360000
013700*                                                                 01370000
013800*                                                                 01380000
013900     05  FILLER.                                                  01390000
014000         10  FILLER                  PIC X(02)    VALUE           01400000
014100             'X '.                                                01410000
014200         10  FILLER                  PIC X(01)    VALUE  ''.     01420000
014300* qA    - Clear memory module - A=upper slot                      01430000
014400         10  FILLER                  PIC X(03)    VALUE           01440000
014500             'qA'.                                               01450000
014600         10  FILLER                  PIC X(01)    VALUE  ''.     01460000
014700         10  FILLER                  PIC X(233)   VALUE  SPACES.  01470000
014800                                                                  01480000
014900                                                                  01490000
015000 01  PC196-TLR-LBL-FORM-TABLE       REDEFINES                     01500001
015100     PC196-TLR-LBL-FORM.                                          01510001
015200     05  PC196-TLR-LBL-FORM-LINE     OCCURS  4 TIMES              01520001
015300                                     INDEXED BY PC196-IDX         01530000
015400                                     PIC X(240).                  01540000
015500                                                                  01550000
015600*----------------------------------------------------------------*01560000
015700* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01570000
015800*----------------------------------------------------------------*01580000
015900 01  PC196-TLR-FORM-LENGTH.                                       01590001
016000     05  FILLER                        PIC 9(03)    VALUE   55.   01600007
016100     05  FILLER                        PIC 9(03)    VALUE  131.   01610001
016200     05  FILLER                        PIC 9(03)    VALUE  138.   01620003
016300     05  FILLER                        PIC 9(03)    VALUE    7.   01630000
016400                                                                  01640000
016500 01  PC196-TLR-FORM-LNGTH-VALUES REDEFINES PC196-TLR-FORM-LENGTH. 01650001
016600     05  PC196-TLR-FORM-LINE-LENGTH   OCCURS 6 TIMES              01660001
016700                                      INDEXED BY PC196-IDX-2      01670000
016800                                      PIC 9(03).                  01680000
016900                                                                  01690000
