000100*  COMMAREA LAYOUT TO PASS THE PCC OUTBOUND BOX CLOSED            00010003
000200*  INFORMATION TO PCKCS765                                        00020000
000300*  COPYBOOK LENGTH IS 200.                                        00030001
000400                                                                  00040000
000500 01  PC246-COMMAREA.                                              00050000
000600     05  PC246-FUNCTION               PIC  X(10)                  00060000
000700                                      VALUE 'BOXCLOSED '.         00070003
000800                                                                  00080001
000900     05  PC246-CALLING-PROGRAM        PIC  X(08)  VALUE SPACES.   00090003
001000                                                                  00100001
001100     05  PC246-CALL-RETURN-AREA.                                  00110003
001200         10  PC246-CRA-RET-CDE        PIC  X(02)  VALUE '00'.     00120003
001300             88  PC246-SUCCESSFUL                 VALUE '00'.     00130003
001400             88  PC246-ERROR                      VALUE '01'.     00140003
001500             88  PC246-SQL-ERROR                  VALUE '02'.     00150003
001600             88  PC246-INVALID-DATA               VALUE '03'.     00160003
001610             88  PC246-UNKNOWN-USER               VALUE '04'.     00161005
001700         10  PC246-CRA-RET-MSG        PIC  X(25)  VALUE SPACES.   00170003
001800                                                                  00180001
001900     05  PC246-DC-NBR                 PIC  9(04)  VALUE ZEROS.    00190003
002000     05  PC246-LOCATION-NM            PIC  X(10)  VALUE SPACES.   00200003
002100     05  PC246-BOX-BAR-CODE-NBR       PIC  X(20)  VALUE ZEROS.    00210003
002200     05  PC246-BOXCLOSE-DATE.                                     00220003
002300         10  PC246-BOXCLOSE-DATE-YYYY PIC  X(04).                 00230003
002400         10  PC246-FILLER-1           PIC  X(01).                 00240003
002500         10  PC246-BOXCLOSE-DATE-MM   PIC  X(02).                 00250003
002600         10  PC246-FILLER-1           PIC  X(01).                 00260003
002700         10  PC246-BOXCLOSE-DATE-DD   PIC  X(02).                 00270003
002800     05  PC246-BOXCLOSE-TIME.                                     00280003
002900         10  PC246-BOXCLOSE-TIME-HH   PIC  X(02).                 00290003
003000         10  PC246-FILLER-1           PIC  X(01).                 00300003
003100         10  PC246-BOXCLOSE-TIME-MM   PIC  X(02).                 00310004
003200         10  PC246-FILLER-1           PIC  X(01).                 00320003
003300         10  PC246-BOXCLOSE-TIME-SS   PIC  X(02).                 00330004
003400     05  PC246-BOXCLOSE-USER-ID       PIC  X(08)  VALUE SPACES.   00340003
003500*                                                                 00350001
003600     05  FILLER                       PIC  X(95)  VALUE SPACES.   00360001
