000001***************************************************************** 00000100
000002*                                                               * 00000200
000003* THIS COPYBOOK HAS CHANGES REQUIRED FOR STORE NUMBER EXPANSION * 00000300
000004*                                                               * 00000400
000005***************************************************************** 00000500
000006* PCWS152 - Shipping Manifest Label - DATA                      * 00000600
000007*                                                               * 00000700
000008*  This is the layout for the SML label DATA used in label      * 00000800
000009*  creation when sending to a batch printer using sockets.      * 00000900
000010* The label commands are strung together under only 4-05 levels * 00001000
000011* Each label command is separated by an end of text char-hex 03 * 00001100
000012* This was done to try to speed up transmission via new socket  * 00001200
000013* interface.  Systec's software separates 05 levels into        * 00001300
000014* statements.  The maximum length is 240.                       * 00001400
000020***************************************************************** 00002000
000030 01  PC152-SML-LABEL-DATA-MAX-LN PIC 9(03)          VALUE  02.    00003000
000040***                                                               00004000
000050***    NUMBER OF 05 LEVELS --------------------------------/\     00005000
000060***                                                               00006000
000070***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00007000
000080***               IN PC152-SML-LBL-DATA-LENGTH.                   00008000
000090***               ALSO IF LINES ARE ADDED BE SURE TO INCREASE THE 00009000
000100***               SML-LABEL-DATA-MAX-LN VALUE AND TABLE OCCURS.   00010000
000200***                                                               00020000
000300***                                                               00030000
000400*-----------------------------------------------------------------00040000
000500 01  PC152-SML-LABEL-DATA.                                        00050000
000600     05  FILLER.                                                  00060000
000700* U01 - STORE NUMBER: LINE - DATA                                 00070000
000800         10 FILLER                    PIC X(04) VALUE             00080000
000900            'U01'.                                               00090000
001000         10  PC152-SML-DATA-STR-NBR                               00100000
001100                                      PIC 9(04) VALUE  ZEROS.     00110001
001200         10 FILLER                    PIC X(01) VALUE  ''.       00120000
001300* U02 - STORE NAME: LINE - DATA                                   00130000
001400         10 FILLER                    PIC X(04) VALUE             00140000
001500            'U02'.                                               00150000
001600         10  PC152-SML-DATA-STR-NME                               00160000
001700                                      PIC X(10) VALUE SPACES.     00170000
001800         10 FILLER                    PIC X(01) VALUE  ''.       00180000
001801* dmh - 02-26-16 - begin                                          00180104
001810* U08 - door id - DATA                                            00181004
001820         10 FILLER                    PIC X(04) VALUE             00182004
001830            'U08'.                                               00183004
001840         10  PC152-SML-DATA-door-id                               00184004
001850                                      PIC x(04) VALUE  '@@@@'.    00185004
001860         10 FILLER                    PIC X(01) VALUE  ''.       00186004
001870* dmh - 02-26-16 - end                                            00187004
001900* U09 - BARCODE                                                   00190004
002000         10 FILLER                    PIC X(04) VALUE             00200000
002100            'U09'.                                               00210004
002200         10  FILLER                   PIC X(01) VALUE 'C'.        00220000
002300         10  PC152-SML-DATA-BC        PIC X(20) VALUE SPACES.     00230002
002400         10  FILLER                   PIC X(01) VALUE  ''.       00240002
002700* U10 - NUMBER ABOVE BARCODE                                      00270004
002800         10 FILLER                    PIC X(04) VALUE             00280000
002900            'U10'.                                               00290005
003000         10  PC152-SML-DATA-BC-NBR    PIC X(25) VALUE SPACES.     00300000
003100         10  FILLER                   PIC X(01) VALUE  ''.       00310000
003200         10  FILLER                   PIC X(151) VALUE SPACES.    00320004
003210*DMH     10  FILLER                   PIC X(160) VALUE SPACES.    00321004
003300*                                                                 00330000
003400*                                                                 00340000
003500*****                                                             00350000
003600*                                                                 00360000
003700     05  FILLER.                                                  00370000
003800* E     - TERMINATE FIELD GENERATION AND PRINT LABEL              00380000
003900         10 FILLER                    PIC X(02) VALUE             00390000
004000            'E'.                                                 00400000
004100         10  PC152-SML-TOT-LBL        PIC 9(04) VALUE ZEROS.      00410000
004200         10 FILLER                    PIC X(01) VALUE  ''.       00420000
004300* G    - PRINTS PREVIOUSLY STORED OR PRINTED LABEL COMMANDS       00430000
004400         10 FILLER                    PIC X(02) VALUE             00440000
004500            'G'.                                                 00450000
004600         10 FILLER                    PIC X(01) VALUE  ''.       00460000
004700         10 FILLER                    PIC X(230) VALUE SPACES.    00470000
004800                                                                  00480000
004900 01  PC152-SML-LBL-DATA-TABLE REDEFINES                           00490000
005000                                PC152-SML-LABEL-DATA.             00500000
005100     05  PC152-SML-LBL-DATA-LINE      OCCURS 02 TIMES             00510000
005200                                      INDEXED BY PC152-IDX        00520000
005300                                      PIC X(240).                 00530000
005400                                                                  00540000
005500*----------------------------------------------------------------*00550000
005600* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00560000
005700*----------------------------------------------------------------*00570000
005800 01  PC152-SML-LBL-DATA-LENGTH.                                   00580000
005900     05  FILLER                        PIC 9(03)    VALUE  89.    00590004
006000     05  FILLER                        PIC 9(03)    VALUE  10.    00600000
006100                                                                  00610000
006200 01  PC152-SML-LBL-LNGTH-VALUES                                   00620000
006300                      REDEFINES PC152-SML-LBL-DATA-LENGTH.        00630000
006400     05  PC152-SML-LINE-LENGTH        OCCURS 02 TIMES             00640000
006500                                      INDEXED BY PC152-IDX-2      00650000
006600                                      PIC 9(03).                  00660000
006700                                                                  00670000
