000001***************************************************************** 00000100
000002* PCWS164 - Miscellaneous DC label with 12 character 3 of 9     * 00000200
000003*           barcode (FORM RECORD)                               * 00000316
000004* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00000400
000005*                    I M P O R T A N T                          * 00000500
000006* The label commands are strung together under only 4-05 levels * 00000600
000007* Each label command is separated by an end of text char-hex 03 * 00000700
000008* This was done to try to speed up transmission via new socket  * 00000800
000009* interface.  Systec's software separates 05 levels into        * 00000900
000010* statements.  The maximum length is 240.                       * 00001000
000011***************************************************************** 00001100
000012 01  PC164-DC-MISC-LBL-MAX-LN        PIC 9(03)    VALUE   4.      00001200
000013***                                                               00001300
000014***    NUMBER OF 05 LEVELS ------------------------------/\       00001400
000015***                                                               00001500
000016***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00001600
000017***               IN PC164-MISC-FORM-LENGTH.                      00001700
000018***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00001800
000019***                                                               00001900
000020***************************************************************** 00002000
000021 01  PC164-DC-MISC-LBL.                                           00002100
000022*                                                                 00002200
000023*** label information - line 1                                    00002300
000024*                                                                 00002400
000025     05  FILLER.                                                  00002500
000026* c0000 - Continuous paper length - 0000 = normal operation       00002600
000027         10  FILLER                  PIC X(06)    VALUE           00002700
000028             'c0000'.                                            00002800
000029         10  FILLER                  PIC X(01)    VALUE  ''.     00002900
000030* e     - Select edge sensor - DEFAULT                            00003000
000031         10  FILLER                  PIC X(02)    VALUE           00003100
000032             'e'.                                                00003200
000033         10  FILLER                  PIC X(01)    VALUE  ''.     00003300
000034* M1030 - Maximum label length                                    00003400
000035         10  FILLER                  PIC X(06)    VALUE           00003500
000036             'M1030'.                                            00003600
000037         10  FILLER                  PIC X(01)    VALUE  ''.     00003700
000038*  Replaced a command with KcFMN to disable the feedback char     00003825
000039*  dmh 8/9/17                                                     00003925
000040* KcFMN - disable feedback characters to be transmitted (6)       00004025
000041         10  FILLER                  pic x(06)    value           00004125
000042             'KcFMN'.                                            00004225
000043         10  FILLER                  PIC X(01)    VALUE  ''.     00004300
000044* s     - Set up for 1 dot buffer                                 00004400
000045         10  FILLER                  PIC X(02)    VALUE           00004500
000046             's'.                                                00004600
000047         10  FILLER                  PIC X(01)    VALUE  ''.     00004700
000048* O0110 - Set form edge offset - 0110 = zero setting              00004800
000049         10  FILLER                  PIC X(06)    VALUE           00004900
000050             'O0110'.                                            00005000
000051         10  FILLER                  PIC X(01)    VALUE  ''.     00005100
000052* qA    - Clear memory module - A=upper slot                      00005200
000053         10  FILLER                  PIC X(03)    VALUE           00005300
000054             'qA'.                                               00005400
000055         10  FILLER                  PIC X(01)    VALUE  ''.     00005500
000056* L     - enter label formatting command input mode               00005600
000057         10  FILLER                  PIC X(02)    VALUE           00005700
000058             'L'.                                                00005800
000059         10  FILLER                  PIC X(01)    VALUE  ''.     00005900
000060* D11   - Set dot size - Horizontal(1) Vertical(1)                00006000
000061         10  FILLER                  PIC X(03)    VALUE           00006100
000062             'D11'.                                               00006200
000063         10  FILLER                  PIC X(01)    VALUE  ''.     00006300
000064* H11   - Heat setting for label                                  00006400
000065         10  FILLER                  PIC X(03)    VALUE           00006500
000066             'H11'.                                               00006600
000067         10  FILLER                  PIC X(01)    VALUE  ''.     00006700
000068* PK    - Max speed for print cycle - K=default (6 in.per sec)    00006800
000069         10  FILLER                  PIC X(02)    VALUE           00006900
000070             'PK'.                                                00007000
000071         10  FILLER                  PIC X(01)    VALUE  ''.     00007100
000072* SK    - Max slew rate speed - K= default (6 in.per sec)         00007200
000073         10  FILLER                  PIC X(02)    VALUE           00007300
000074             'SK'.                                                00007400
000075         10  FILLER                  PIC X(01)    VALUE  ''.     00007500
000076         10  FILLER                  PIC X(185)   VALUE  SPACES.  00007625
000077*                                                                 00007700
000078*                                                                 00007800
000079*** label information - line 2                                    00007900
000080*                                                                 00008000
000081     05  FILLER.                                                  00008100
000082*  Description line 1 (U01)                                       00008218
000083         10  FILLER                  PIC X(15)    VALUE           00008300
000084             '341100500700360'.                                   00008400
000085         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00008500
000086         10  FILLER                  PIC X(01)    VALUE  ''.     00008600
000087*  Description line 2 (U02)                                       00008700
000088         10  FILLER                  PIC X(15)    VALUE           00008800
000089             '341100500950360'.                                   00008900
000090         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00009000
000092         10  FILLER                  PIC X(01)    VALUE  ''.     00009200
000093*  Description line 3 (U03)                                       00009300
000094         10  FILLER                  PIC X(15)    VALUE           00009400
000095             '341100501200360'.                                   00009500
000096         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00009600
000098         10  FILLER                  PIC X(01)    VALUE  ''.     00009800
000099*  # above bar code (U04)                                         00009900
000100         10  FILLER                  PIC X(15)    VALUE           00010000
000101             '341100002540300'.                                   00010100
000102         10  FILLER                  PIC X(20)    VALUE ALL '@'.  00010200
000104         10  FILLER                  PIC X(01)    VALUE  ''.     00010400
000109* 3 of 9 Barcode across bottom of label (U05)                     00010900
000110         10  FILLER                  PIC X(15)    VALUE           00011000
000111             '3a8209003500360'.                                   00011122
000112         10  PC164-3OF9-BC           PIC X(13)    VALUE SPACES.   00011216
000113***      10  FILLER                  PIC X(12)    VALUE ALL '@'.  00011324
000114***      10  FILLER                  PIC X(01)    VALUE  ''.     00011416
000115*  Dummy line (U06)                                               00011525
000116         10  FILLER                  PIC X(15)    VALUE           00011620
000117             '341100500100360'.                                   00011720
000118         10  FILLER                  PIC X(05)    VALUE all '@'.  00011823
000119         10  FILLER                  PIC X(01)    VALUE  ''.     00011920
000142         10  FILLER                  PIC X(17)    VALUE SPACES.   00014220
000143*                                                                 00014300
000144*                                                                 00014400
000145*** label information - line 3                                    00014500
000146*                                                                 00014600
000147     05  FILLER.                                                  00014700
000152* Printer # - line                                                00015200
000153         10  FILLER                  PIC X(21)    VALUE           00015300
000154             '302200003910385PRTR #'.                             00015422
000155         10  FILLER                  PIC X(01)    VALUE  ''.     00015500
000156* Printer # - field                                               00015600
000157         10  FILLER                  PIC X(15)    VALUE           00015700
000158             '302200003910345'.                                   00015822
000159         10  PC164-PRTR-NBR          PIC X(06)    VALUE           00015900
000160             'DC-307'.                                            00016000
000161         10  FILLER                  PIC X(01)    VALUE  ''.     00016100
000162* User ID                                                         00016200
000163         10  FILLER                  PIC X(15)    VALUE           00016300
000164             '302200003910290'.                                   00016400
000165         10  PC164-USER-ID           PIC X(08)    VALUE SPACES.   00016500
000166         10  FILLER                  PIC X(01)    VALUE  ''.     00016600
000167* label print date                                                00016700
000168         10  FILLER                  PIC X(15)    VALUE           00016800
000169             '302200003910220'.                                   00016922
000170         10  PC164-LBL-PRT-DATE      PIC X(08)    VALUE           00017000
000171             'MM-DD-YY'.                                          00017100
000172         10  FILLER                  PIC X(01)    VALUE  ''.     00017200
000173*  label print time                                               00017300
000174         10  FILLER                  PIC X(15)    VALUE           00017400
000175             '302200003910165'.                                   00017522
000176         10  PC164-LBL-PRT-TIME      PIC X(05)    VALUE           00017600
000177             'HH:MM'.                                             00017700
000178         10  FILLER                  PIC X(01)    VALUE  ''.     00017800
000179* label description line (U08)                                    00017900
000180         10  FILLER                  PIC X(15)    VALUE           00018000
000181             '302200003910120'.                                   00018122
000182         10  PC164-LBL-DESC          PIC X(11)    VALUE           00018200
000183             'DC-MISC LBL'.                                       00018300
000190         10  FILLER                  PIC X(01)    VALUE  ''.     00019000
000200* separater bar across center of label                            00020000
000300         10  FILLER                  PIC X(22)    VALUE           00030000
000310             '1X1100001750025L350003'.                            00031024
000320         10  FILLER                  PIC X(01)    VALUE  ''.     00032000
000346         10  FILLER                  PIC X(77)    VALUE  SPACES.  00034600
000347*                                                                 00034700
000348*                                                                 00034800
000349***** label information - line 4                                  00034900
000350*                                                                 00035000
000351*                                                                 00035100
000352*                                                                 00035200
000353* X     - Terminate field generation                              00035300
000354*                                                                 00035400
000355*                                                                 00035500
000356     05  FILLER.                                                  00035600
000357         10  FILLER                  PIC X(02)    VALUE           00035700
000358             'X '.                                                00035800
000359         10  FILLER                  PIC X(01)    VALUE  ''.     00035900
000360         10  FILLER                  PIC X(237)   VALUE  SPACES.  00036000
000361                                                                  00036100
000362                                                                  00036200
000363 01  PC164-DC-MISC-LBL-TABLE         REDEFINES                    00036300
000364     PC164-DC-MISC-LBL.                                           00036400
000365     05  PC164-DC-MISC-LBL-LINE      OCCURS  4 TIMES              00036500
000366                                     INDEXED BY PC164-IDX         00036600
000367                                     PIC X(240).                  00036700
000368                                                                  00036800
000369*----------------------------------------------------------------*00036900
000370* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00037000
000371*----------------------------------------------------------------*00037100
000372 01  PC164-MISC-FORM-LENGTH.                                      00037200
000373     05  FILLER                        PIC 9(03)    VALUE   55.   00037325
000374     05  FILLER                        PIC 9(03)    VALUE  223.   00037420
000375     05  FILLER                        PIC 9(03)    VALUE  163.   00037515
000380     05  FILLER                        PIC 9(03)    VALUE    3.   00038000
000381                                                                  00038100
000382 01  PC164-MISC-FORM-LNGTH-VALUES REDEFINES                       00038200
000383                                  PC164-MISC-FORM-LENGTH.         00038300
000384     05  PC164-MISC-FORM-LINE-LENGTH  OCCURS 4 TIMES              00038400
000385                                      INDEXED BY PC164-IDX-2      00038500
000386                                      PIC 9(03).                  00038600
000387                                                                  00038700
