000100******************************************************************00010000
000200* PCWS166 - THIS COPYBOOK REFLECTS THE COMMAREA LAYOUT TO PASS   *00020000
000300*           DATA TO THE VIRTUAL LABEL CALCULATION/CREATION       *00030000
000400*           (PCKCS719)     LENGTH=240                            *00040000
000500******************************************************************00050000
000600 01  PC166-COMMAREA-REC.                                          00060000
000700     05  PC166-PO-NBR                  PIC  9(08)  VALUE ZERO.    00070000
000800     05  PC166-RCVR-SEQ-NBR            PIC  9(03)  VALUE ZERO.    00080000
000900     05  PC166-PO-LNE-NBR              PIC  9(03)  VALUE ZERO.    00090000
001000     05  PC166-OPER-UNT-ID             PIC  9(04)  VALUE ZERO.    00100000
001100     05  PC166-PROGRAM-FUNCTION        PIC  X(01)  VALUE SPACES.  00110000
001110         88  PC166-FUNC-LBL-CALC                   VALUE 'C'.     00111000
001120         88  PC166-FUNC-CRE-VRTL-LBL               VALUE 'V'.     00112000
001130     05  PC166-CRA-RETURN-AREA.                                   00113000
001140         10  PC166-CRA-RET-CDE         PIC  X(02)  VALUE SPACES.  00114000
001150             88  PC166-CRA-SUCCESSFUL              VALUE '00'.    00115000
001160             88  PC166-CRA-INVALID                 VALUE '01'.    00116000
001161             88  PC166-CRA-DB-BUSY                 VALUE '02'.    00116100
001162             88  PC166-CRA-SQL-ERROR               VALUE '03'.    00116200
001163         10  PC166-CRA-RET-MSG         PIC  X(25)  VALUE SPACES.  00116300
001164     05  PC166-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00116400
001165         88  PC166-FROM-STRLST                  VALUE 'PCKCS703'. 00116500
001166         88  PC166-FROM-LNELST                  VALUE 'PCKCS701'. 00116600
001167         88  PC166-FROM-RPRNT                   VALUE 'PCKCS702'. 00116700
001168     05  PC166-SHIP-LABEL-TYPE         PIC  X(01)  VALUE SPACES.  00116800
001169         88  PC166-SHIP-LBL-PGYBK                  VALUE 'P'.     00116900
001170         88  PC166-SHIP-LBL-SML                    VALUE 'S'.     00117000
001180         88  PC166-SHIP-LBL-NONE                   VALUE 'N'.     00118000
001190         88  PC166-VIRTUAL                         VALUE 'V'.     00119000
001200     05  PC166-REPRT-IND               PIC  X(01)  VALUE SPACES.  00120000
001300         88  PC166-REPRINT                         VALUE 'R'.     00130000
001400         88  PC166-INITIAL-PRINT                   VALUE ' '.     00140000
001500     05  PC166-PRT-SEQ                 PIC  X(01)  VALUE SPACES.  00150000
001600         88  PC166-PRT-STR-SEQ                     VALUE 'R'.     00160000
001700         88  PC166-PRT-SHUFFLED                    VALUE 'S'.     00170000
001710         88  PC166-PRT-DOOR-SEQ                    VALUE 'D'.     00171000
001720     05  PC166-CASEPACK-FUNCTION       PIC  X(01)  VALUE SPACES.  00172000
001730         88  PC166-CREATE-BOTH                     VALUE 'B'.     00173000
001740         88  PC166-CREATE-P2L                      VALUE 'P'.     00174000
001750         88  PC166-CREATE-SML                      VALUE 'C'.     00175000
001760     05  PC166-INPK-CNVY-IND           PIC  X(01)  VALUE SPACES.  00176000
001770         88  PC166-INPK-CNVY-YES                   VALUE 'Y'.     00177000
001780         88  PC166-INPK-CNVY-NO                    VALUE 'N'.     00178000
001790     05  PC166-PKGNG-CD                PIC X(01)   VALUE SPACE.   00179000
001800         88  PC166-PRE-PACK-ORDER                  VALUE 'I', 'M'.00180000
001900         88  PC166-INNER-PREPK                     VALUE 'I'.     00190000
002000         88  PC166-MULTI-SKU-PREPK                 VALUE 'M'.     00200000
002100         88  PC166-SINGLE-SKU-PREPK                VALUE 'S'.     00210000
002200         88  PC166-CASEPACK                        VALUE 'C'.     00220000
002201         88  PC166-BULK-PACK                       VALUE 'B'.     00220100
002202                                                                  00220200
002203     05  PC166-STR-ZNE                 PIC  X(05)  VALUE SPACES.  00220300
002204     05  PC166-SKU                     PIC  9(08)  VALUE ZERO.    00220400
002205     05  PC166-DEPT-NBR                PIC  9(03)  VALUE ZEROES.  00220500
002206     05  PC166-CL-NBR                  PIC  9(02)  VALUE ZEROES.  00220600
002207     05  PC166-TOTAL-CARTONS           PIC  9(04)  VALUE ZEROES.  00220700
002208     05  PC166-OTPK-UNT-QTY            PIC  9(04)  VALUE ZEROES.  00220800
002209     05  PC166-INPK-UNT-QTY            PIC  9(04)  VALUE ZEROES.  00220900
002210     05  PC166-MOD-NBR                 PIC  9(03)  VALUE ZEROES.  00221000
002220     05  PC166-MODU-DESC               PIC  X(07)  VALUE SPACES.  00222000
002230     05  PC166-CSEPK-PRCS-AREA         PIC  X(06)  VALUE SPACES.  00223000
002240     05  PC166-PRCS-QTY                PIC  9(05)  VALUE ZEROES.  00224000
002250     05  PC166-TRNS-QTY                PIC  9(05)  VALUE ZEROES.  00225000
002260     05  PC166-FCSE-LBL-CNT            PIC  9(04)  VALUE ZEROES.  00226000
002270     05  PC166-INPK-LBL-CNT            PIC  9(04)  VALUE ZEROES.  00227000
002280     05  PC166-P2L-LBL-CNT             PIC  9(04)  VALUE ZEROES.  00228000
002290                                                                  00229000
002300     05  PC166-CS-BOUND-UNTS           PIC  9(09)  VALUE ZEROES.  00230000
002400     05  PC166-DC-BOUND-UNTS           PIC  9(09)  VALUE ZEROES.  00240000
002500     05  PC166-RTV-BOUND-UNTS          PIC  9(09)  VALUE ZEROES.  00250000
002600     05  PC166-CS-BOUND-CTNS           PIC  9(04)  VALUE ZEROES.  00260000
002700     05  PC166-DC-BOUND-CTNS           PIC  9(04)  VALUE ZEROES.  00270000
002800     05  PC166-RTV-BOUND-CTNS          PIC  9(04)  VALUE ZEROES.  00280000
002900                                                                  00290000
002910     05  PC166-VENDOR-STYLE            PIC  X(15)  VALUE SPACES.  00291000
002920     05  PC166-ITEM-NBR                PIC  9(15)  VALUE ZEROS    00292000
002930                                                         COMP-3.  00293000
002940     05  PC166-SSCC-18-IND             PIC  X(01)  VALUE SPACE.   00294000
002950         88  PC166-USE-20-DIGIT-BARCODE            VALUE 'Y'.     00295000
002960         88  PC166-USE-22-DIGIT-BARCODE            VALUE 'N'.     00296000
002970     05  PC166-PREPK-ID                PIC S9(04) VALUE ZEROES    00297000
002980                                                  COMP.           00298000
002990     05  PC166-PREPK-RATIO             PIC S9(04) VALUE ZEROES    00299000
003000                                                  COMP.           00300000
003100     05  PC166-PACKS-IN-CRTN           PIC S9(04) VALUE ZEROES    00310000
003200                                                  COMP.           00320000
003300     05  PC166-TOT-PREPK-UNTS          PIC S9(04) VALUE ZEROES    00330000
003400                                                  COMP.           00340000
003500     05  PC166-USER-ID                 PIC  X(08) VALUE SPACE.    00350000
003600     05  PC166-ERROR-SW                PIC  X(01) VALUE SPACE.    00360000
003700         88  PC166-ERR-OTPK-BY-INPK               VALUE 'A'.      00370000
003800         88  PC166-ERR-INVALID-OTPK               VALUE 'B'.      00380000
003900         88  PC166-ERR-LNES-NOT-PRPK              VALUE 'C'.      00390000
004000         88  PC166-ERR-DC-RTV-NOT-OTPK            VALUE 'D'.      00400000
004100     05  PC166-SPEC-INST-DESC          PIC  X(05) VALUE SPACE.    00410000
004200     05  PC166-FCSE-AREA               PIC  X(06) VALUE SPACE.    00420000
004300     05  PC166-OTPK-SW                 PIC  X(01) VALUE SPACE.    00430000
004400         88 PC166-MULT-OTPK                       VALUE 'M'.      00440000
004500         88 PC166-SINGLE-OTPK                     VALUE 'S'.      00450000
004600     05  PC166-PREPK-UCC128-SW         PIC  X(01) VALUE SPACE.    00460000
004601         88 PC166-PREPK-UCC128-YES                VALUE 'Y'.      00460100
004602         88 PC166-PREPK-UCC128-NO                 VALUE 'N'.      00460200
004603     05  PC166-PREPK-INPK-UNT-QTY      PIC  9(04) VALUE ZEROES.   00460300
004604     05  PC166-TRIP-ARRIVE-DATE        PIC  X(10).                00460400
004605     05  PC166-TRIP-ARRIVE-DATE-R                                 00460500
004606         REDEFINES PC166-TRIP-ARRIVE-DATE.                        00460600
004607         10  PC166-TRIP-ARRIVE-CCYY    PIC  X(04).                00460700
004608         10  PC166-TRIP-ARRIVE-DASH1   PIC  X(01).                00460800
004609         10  PC166-TRIP-ARRIVE-MM      PIC  X(02).                00460900
004610         10  PC166-TRIP-ARRIVE-DASH2   PIC  X(01).                00461000
004611         10  PC166-TRIP-ARRIVE-DD      PIC  X(02).                00461100
004612     05  FILLER                        PIC  X(05) VALUE SPACE.    00461200
004620                                                                  00462000
