000100******************************************************************07/08/99
000200*    PCWS133                                                     *PCWS133 
000210*    THIS COPYBOOK REFLECTS THE LABEL PRINT RECORD LAYOUTS       *        
000300*    SENT TO THE LPMS (LABEL PRINT MANAGEMENT SYSTEM) USING      *        
000400*    SOCKETS.                                                    *        
000410*    (REFER TO PCWS138 FOR ERROR MESSAGES TO DISPLAY)            *        
000500******************************************************************        
000600 01  PC133-LABEL-RECORD.                                                  
000700     05  PC133-RECORD-TYPE               PIC  X(02)  VALUE SPACE.         
000800         88  PC133-LABEL-HDR                         VALUE 'LH'.          
000900         88  PC133-LABEL-DTL                         VALUE 'LD'.          
001000         88  PC133-LABEL-TLR                         VALUE 'LT'.          
001100         88  PC133-LABEL-CONFIRM                     VALUE 'CS'.          
001200     05  PC133-LABEL-LAYOUT              PIC  X(252) VALUE SPACE.         
001300                                                                          
001400     05  PC133-LABEL-HDR-REC   REDEFINES  PC133-LABEL-LAYOUT.             
001600         10  PC133-HDR-TRANS-ID          PIC  9(08).                      
001700         10  PC133-HDR-PRTR-ID           PIC  9(03).                      
001800         10  PC133-HDR-LBL-TYPE          PIC  X(05).                      
001900         10  PC133-HDR-PO-NBR            PIC  9(08).                      
002100         10  PC133-HDR-RCVR-SEQ          PIC  9(03).                      
002200         10  PC133-HDR-LINE-NBR          PIC  9(04).                      
002210         10  PC133-HDR-STORE-NBR         PIC  9(04).                      
002220         10  PC133-HDR-PROC-AREA         PIC  X(06).                      
005000         10  FILLER                      PIC  X(211).                     
005100                                                                          
005200     05  PC133-LABEL-DTL-REC   REDEFINES  PC133-LABEL-LAYOUT.             
005400         10  PC133-DTL-TRANS-ID          PIC  9(08).                      
005500         10  PC133-DTL-LENGTH            PIC  9(03).                      
005600         10  PC133-DTL-DATA              PIC  X(240).                     
006800         10  FILLER                      PIC  X(01).                      
006900                                                                          
007000     05  PC133-LABEL-TLR-REC   REDEFINES  PC133-LABEL-LAYOUT.             
007100         10  PC133-TLR-TRANS-ID          PIC  9(08).                      
007110         10  PC133-TLR-RECORD-COUNT      PIC  9(07).                      
008100         10  FILLER                      PIC  X(237).                     
008200                                                                          
008300     05  PC133-LABEL-CONFIRM-REC   REDEFINES  PC133-LABEL-LAYOUT.         
008500         10  PC133-CONFIRM-CODE          PIC  9(03).                      
008600             88  PC133-SEND-SUCCESSFUL               VALUE 100.           
008700             88  PC133-INVALID-PRINTER               VALUE 200.           
008800             88  PC133-DTL-WITHOUT-HDR               VALUE 300.           
008900             88  PC133-TLR-WITHOUT-HDR-DTL           VALUE 301.           
008920             88  PC133-TLR-CNT-NOT-MTCH-DTL          VALUE 500.           
008930             88  PC133-TRAN-IDS-NOT-MTCH             VALUE 501.           
008940             88  PC133-DTL-LNGTH-NOT-MTCH            VALUE 502.           
008950             88  PC133-DISK-ERROR                    VALUE 996.           
008960             88  PC133-TIMEOUT                       VALUE 997.           
008970             88  PC133-ADDR-NOT-FND                  VALUE 998.           
008980             88  PC133-INVALID-PACKET                VALUE 999.           
009000         10  FILLER                      PIC  X(249).                     
009010*                                                                         
009100 01  PC133-RECORD-LENGTHS.                                                
009210     05  PC133-HDR-REC-LENGTH            PIC  9(08)  VALUE 50             
009300                                                     COMP.                
009400     05  PC133-DTL-REC-LENGTH            PIC  9(08)  VALUE ZEROES         
009500                                                     COMP.                
009510     05  PC133-TLR-REC-LENGTH            PIC  9(08)  VALUE 20             
009520                                                     COMP.                
009600     05  PC133-CNFRM-REC-LENGTH          PIC  9(08)  VALUE 05             
009700                                                     COMP.                
