000100******************************************************************01/24/96
000200*    THIS COPYBOOK REFLECTS THE COMMAREA LAYOUT TO PASS STORE    *PCWS128 
000300*    DATA TO THE LABEL PRINT ROUTINE (PCKCS191).                 *        
000400******************************************************************        
000500 01  PC128-COMMAREA-REC.                                                  
000600     05  PC128-PO-NBR                  PIC  9(08)  VALUE ZERO.            
000700     05  PC128-RCVR-SEQ-NBR            PIC  9(03)  VALUE ZERO.            
000800     05  PC128-PO-LNE-NBR              PIC  9(03)  VALUE ZERO.            
000820     05  PC128-STR-NBR                 PIC  X(04)  VALUE SPACES.          
000900     05  PC128-MNFT-NBR                PIC  9(07)  VALUE ZERO.            
002400     05  PC128-FCSE-LBL-CNT            PIC  9(04)  VALUE ZEROES.          
002500     05  PC128-INPK-LBL-CNT            PIC  9(04)  VALUE ZEROES.          
002600     05  PC128-ODD-CART-SW             PIC  X(01)  VALUE SPACE.           
