000100*****************************************************************         
000200* PCWS154 - HEADER LABEL DATA RECORD.                           *         
000300*                                                               *         
000400*  THIS IS THE LAYOUT FOR THE HEADER LABEL FORM USED IN LABEL   *         
000500*  CREATION WHEN SENDING TO A BATCH PRINTER USING SOCKETS.      *         
000300*                                                               *         
000007* IT MUST BE PRECEDED BY THE FORMS RECORDS DESCRIBED IN PCSW153.          
000008* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE           
000009* FIRST POSITION.                                                         
000300*                                                               *         
000008* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 1-05 LEVELS *         
000009* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 *         
000010* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  *         
000011* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        *         
000012* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       *         
000600*****************************************************************         
000001 01  PC154-HEAD-LABEL-DATA-MAX-LN PIC 9(03)    VALUE  02.         08/26/99
000800***                                                                       
000900***    NUMBER OF 05 LEVELS --------------------------------/\             
001000***                                                                       
001010***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
001011***               IN PC154-HDR-LBL-LENGTH.                                
001012***               ALSO IF LINES ARE ADDED BE SURE TO INCREASE THE         
001012***               HEADER-LABEL-MAX-LN VALUE AND TABLE OCCURS.             
001013***                                                                       
001013***                                                                       
001014*-----------------------------------------------------------------        
000002 01  PC154-HEADER-LABEL-DATA.                                     PCWS143 
008030**************************************************************            
008030*************  START OF 05-LEVEL  ****************************            
008030**************************************************************            
000065     05  FILLER.                                                  PCWS143 
008030* BC1 RECEIVER: LINE - DATA                                               
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U01'.                                                       
               10  FILLER                  PIC X(01)   VALUE 'C'.               
000070         10  PC154-HEAD-COM-RCVR-BC1 PIC X(11)   VALUE SPACES.    PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* RECEIVER: LINE - DATA                                                   
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U02'.                                                       
000070         10  PC154-HEAD-COM-RCVR     PIC X(11)   VALUE SPACES.    PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* TOT LBLS: LINE - DATA                                                   
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U03'.                                                       
000091         10  PC154-HEAD-COM-TOT-LBLS                              PCWS143 
000092                                     PIC Z(04)   VALUE  ZEROS.    PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* VENDOR NAME: LINE - DATA                                                
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U04'.                                                       
000091         10  PC154-HEAD-COM-VENDOR-NAME                           PCWS143 
000092                                     PIC X(25)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* RCVD DATE: LINE - DATA                                                  
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U05'.                                                       
000091         10  PC154-HEAD-COM-RCVD-DATE                             PCWS143 
000092                                     PIC X(13)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* AD DATE: LINE - DATA                                                    
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U06'.                                                       
000091         10  PC154-HEAD-COM-AD-DATE                               PCWS143 
000092                                     PIC X(14)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* PICTURED: LINE - DATA                                                   
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U07'.                                                       
000091         10  PC154-HEAD-COM-PICTURED                              PCWS143 
000092                                     PIC X(08)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* MULTIPLE SHIPMENTS: LINE - DATA                                         
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U08'.                                                       
000091         10  PC154-HEAD-COM-MULT-SHIPMENTS                        PCWS143 
000092                                     PIC X(18)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* PRETICKETED: LINE - DATA                                                
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U09'.                                                       
000091         10  PC154-HEAD-COM-PRETICKETED                           PCWS143 
000092                                     PIC X(12)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* PACKED BY: LINE - DATA                                                  
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U10'.                                                       
000091         10  PC154-HEAD-COM-PACKED-BY                             PCWS143 
000092                                     PIC X(15)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* ON HANGER: LINE - DATA                                                  
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U11'.                                                       
000091         10  PC154-HEAD-COM-ON-HANGER                             PCWS143 
000092                                     PIC X(09)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
000195         10 FILLER                    PIC X(044) VALUE SPACES.            
008030**************************************************************            
008030*************  START OF 05-LEVEL  ****************************            
008030**************************************************************            
000065     05  FILLER.                                                  PCWS143 
008030* PROCESS AREA: LINE - DATA                                               
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U12'.                                                       
000091         10  PC154-HEAD-COM-PROCESS-AREA                          PCWS143 
000092                                     PIC X(06)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* PRINTER ID: LINE - DATA                                                 
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U14'.                                                       
000098         10  PC154-HEAD-COM-PRINTER-ID                            PCWS143 
000098                                     PIC X(06)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* TRIP ID: LINE - DATA                                                    
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U16'.                                                       
000098         10  PC154-HEAD-COM-TRIP-ID                               PCWS143 
000098                                     PIC X(09)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* SPECIAL INSTR: LINE - DATA                                              
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U18'.                                                       
000098         10  PC154-HEAD-COM-SPECIAL-INSTR                         PCWS143 
000098                                     PIC X(25)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* PO NUMBER/RCVR SEQ: LINE - DATA                                         
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U20'.                                                       
000098         10  PC154-HEAD-COM-PO-RCVR-SEQ                           PCWS143 
000098                                     PIC X(12)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* DETAIL CHECK: LINE - DATA                                               
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U23'.                                                       
000098         10  PC154-HEAD-COM-DETAIL-CHECK                          PCWS143 
000098                                     PIC X(12)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* TICKET TYPE: LINE - DATA                                                
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U24'.                                                       
000098         10  PC154-HEAD-COM-TICKET-TYPE                           PCWS143 
000098                                     PIC X(06)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
008030* DEPT/CLASS: LINE - DATA                                                 
000034         10 FILLER                   PIC X(04)   VALUE                    
000035            'U25'.                                                       
000098         10  PC154-HEAD-COM-DEPT-CLASS                            PCWS143 
000098                                     PIC X(06)   VALUE  SPACES.   PCWS143 
000164         10 FILLER                    PIC X(01) VALUE  ''.               
014300* E     - TERMINATE FIELD GENERATION AND PRINT LABEL                      
000183         10 FILLER                    PIC X(02) VALUE                     
000184            'E'.                                                         
000062         10  PC154-HEAD-COM-TOT-LBL  PIC 9(04)    VALUE ZEROS.    PCWS141 
001600         10  FILLER                  PIC X(01)    VALUE  ''.             
000189*  G   - PRINTS PREVIOUSLY STORED OR PRINTED LABEL COMMANDS               
000192         10 FILLER                    PIC X(02) VALUE                     
000193            'G'.                                                         
000194         10 FILLER                    PIC X(01) VALUE  ''.               
000195         10 FILLER                    PIC X(108) VALUE SPACES.            
026000                                                                          
026100 01  PC154-HEADER-LABEL-TABLE REDEFINES                                   
000002                                PC154-HEADER-LABEL-DATA.          PCWS143 
026200     05  PC154-HEADER-LBL-LINE      OCCURS 02 TIMES                       
026300                                      INDEXED BY PC154-IDX                
026400                                      PIC X(240).                         
026401                                                                          
000197*----------------------------------------------------------------*        
000198* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
000199*----------------------------------------------------------------*        
026500 01  PC154-HDR-LBL-LENGTH.                                                
000201     05  FILLER                        PIC 9(03)    VALUE  196.           
000201     05  FILLER                        PIC 9(03)    VALUE  132.           
026761                                                                          
026770 01  PC154-HDR-LBL-LNGTH-VALUES REDEFINES PC154-HDR-LBL-LENGTH.           
026780     05  PC154-HDR-LINE-LENGTH        OCCURS 02 TIMES                     
026790                                      INDEXED BY PC154-IDX-2              
026800                                      PIC 9(03).                          
026900                                                                          
