000001*****************************************************************         
000002*                                                               *         
000003* changes per systec to qA statement                            *         
000004*                                                               *         
000005*****************************************************************         
000006* PCWS150 - Print Package Trailer Label - using sockets         *         
000007*                                                               *         
000008*  this is the layout for the trailer label used in casepack    *         
000009*  split application                                            *         
000010* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000011*                    I M P O R T A N T                          *         
000012* The label commands are strung together under only 4-05 levels *         
000013* Each label command is separated by an end of text char-hex 03 *         
000014* This was done to try to speed up transmission via new socket  *         
000015* interface.  Systec's software separates 05 levels into        *         
000016* statements.  The maximum length is 240.                       *         
000020*****************************************************************         
000100 01  PC150-SML-TRLR-LABEL-MAX-LN       PIC 9(03)    VALUE  5.             
000200***    NUMBER OF 05 LEVELS --------------------------------/\             
000201***                                                                       
000202***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
000203***               IN PC150-TRLR-LBL-LENGTH.                               
000204***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE               
000205***                                                                       
000210*****************************************************************         
000300 01  PC150-SML-TRLR-LABEL.                                                
000400     05  FILLER.                                                          
000410*                                                                         
000420*** label line group - 1                                                  
000430*                                                                         
000500* c0000 - Continuous paper length - 0000 = normal operation               
000600         10  FILLER                    PIC X(06)    VALUE                 
000700             'c0000'.                                                    
000800         10  FILLER                    PIC X(01)    VALUE  ''.           
000900* e     - Select edge sensor - DEFAULT                                    
001100         10  FILLER                    PIC X(02)    VALUE                 
001200             'e'.                                                        
001300         10  FILLER                    PIC X(01)    VALUE  ''.           
001400* M1125 - Maximum label length                                            
001600         10  FILLER                    PIC X(06)    VALUE                 
001700             'M1125'.                                                    
001800         10  FILLER                    PIC X(01)    VALUE  ''.           
001810*  Replaced a command with KcFMN to disable the feedback char             
001820*  dmh 8/9/17                                                             
001830* KcFMN - disable feedback characters to be transmitted (6)               
002100         10  FILLER                    PIC X(06)    VALUE                 
002200             'KcFMN'.                                                    
002300         10  FILLER                    PIC X(01)    VALUE  ''.           
002400* s     - Set up for 1 dot buffer                                         
002600         10  FILLER                    PIC X(02)    VALUE                 
002700             's'.                                                        
002800         10  FILLER                    PIC X(01)    VALUE  ''.           
002900* O0110 - Set form edge offset - 0110 = zero setting                      
003100         10  FILLER                    PIC X(06)    VALUE                 
003200             'O0110'.                                                    
003300         10  FILLER                    PIC X(01)    VALUE  ''.           
003400* qA    - Clear memory module - A=upper slot                              
003500         10  FILLER                    PIC X(03)    VALUE                 
003600             'qA'.                                                       
003800         10  FILLER                    PIC X(01)    VALUE  ''.           
003900* L     - enter label formatting command input mode                       
004100         10  FILLER                    PIC X(02)    VALUE                 
004200             'L'.                                                        
004300         10  FILLER                    PIC X(01)    VALUE  ''.           
004400* D11   - Set dot size - Horizontal(1) Vertical(1)                        
004600         10  FILLER                    PIC X(03)    VALUE                 
004700             'D11'.                                                       
004800         10  FILLER                    PIC X(01)    VALUE  ''.           
004900* H     - Heat setting for label                                          
005100         10  FILLER                    PIC X(01)    VALUE                 
005200             'H'.                                                         
005300         10  PC150-SML-TRLR-HEAT-LEVEL PIC X(02)    VALUE                 
005400             '11'.                                                        
005500         10  FILLER                    PIC X(01)    VALUE  ''.           
005600* PK    - Max speed for print cycle - K=default (6 in.per sec)            
005800         10  FILLER                    PIC X(02)    VALUE                 
005900             'PK'.                                                        
006000         10  FILLER                    PIC X(01)    VALUE  ''.           
006100* SK    - Max slew rate speed - K= default (6 in.per sec)                 
006300         10  FILLER                    PIC X(02)    VALUE                 
006400             'SK'.                                                        
006500         10  FILLER                    PIC X(01)    VALUE  ''.           
006600* Q     - Quantity of labels to print                                     
006800         10  FILLER                    PIC X(01)    VALUE                 
006900             'Q'.                                                         
007000         10  PC150-SML-TRLR-TOT-LBL    PIC X(04)    VALUE                 
007100             '0001'.                                                      
007200         10  FILLER                    PIC X(01)    VALUE  ''.           
007201         10  FILLER                    PIC X(179)   VALUE  SPACES.        
007202*                                                                         
007203*                                                                         
007204*** label line group - 2                                                  
007210*                                                                         
007300     05  FILLER.                                                          
007400* PO-RECEIVER - line                                                      
007500         10  FILLER                    PIC X(25)    VALUE                 
007600             '341100600490370RECEIVER: '.                                 
007800         10  FILLER                    PIC X(01)    VALUE  ''.           
007801* PO-RECEIVER - field                                                     
007802         10  FILLER                    PIC X(15)    VALUE                 
007803             '341100600490270'.                                           
007804         10  PC150-SML-TRLR-PO-SEQ-NBR PIC X(12)    VALUE  SPACES.        
007807         10  FILLER                    PIC X(01)    VALUE  ''.           
007810* PO LINE NUMBER - line                                                   
008100         10  FILLER                    PIC X(15)    VALUE                 
008200             '341100600900370'.                                           
008300         10  PC150-SML-TLR-LINE-DESC   PIC X(08)    VALUE                 
008310             '@@@@@@@@'.                                                  
008400         10  FILLER                    PIC X(01)    VALUE  ''.           
008401* PO LINE NUMBER/PACK ID - field                                          
008402         10  FILLER                    PIC X(15)    VALUE                 
008403             '341100600900270'.                                           
008404         10  PC150-SML-TRLR-LINE-NBR   PIC 9(04)    VALUE  ZEROS.         
008406         10  FILLER                    PIC X(01)    VALUE  ''.           
008407         10  FILLER                    PIC X(142)   VALUE  SPACES.        
008408*                                                                         
008409***** label group 3                                                       
008410*                                                                         
008411     05  FILLER.                                                          
008412* Printer # - line                                                        
008413         10  FILLER                  PIC X(20)    VALUE                   
008414             '302200003910390PRTR '.                                      
008415         10  FILLER                  PIC X(01)    VALUE  ''.             
008416* Printer # - field                                                       
008417         10  FILLER                  PIC X(15)    VALUE                   
008418             '302200003910357'.                                           
008419         10  PC150-TLR-PRTR-NBR      PIC X(07)    VALUE                   
008420             '#DC-307'.                                                   
008421         10  FILLER                  PIC X(01)    VALUE  ''.             
008422**  User ID - bottom of label                                             
008423         10  FILLER                  PIC X(15)    VALUE                   
008424             '302200003910287'.                                           
008425         10  PC150-USER-ID           PIC X(08)    VALUE SPACES.           
008426         10  FILLER                  PIC X(01)    VALUE  ''.             
008427*  label print date                                                       
008428         10  FILLER                  PIC X(15)    VALUE                   
008429             '302200003910180'.                                           
008430         10  PC150-LBL-PRT-DATE      PIC X(08)    VALUE                   
008431             '@@@@@@@@'.                                                  
008432         10  FILLER                  PIC X(01)    VALUE  ''.             
008433*  label print time                                                       
008434         10  FILLER                  PIC X(15)    VALUE                   
008435             '302200003910125'.                                           
008436         10  PC150-LBL-PRT-TIME      PIC X(05)    VALUE                   
008437             '@@@@@'.                                                     
008438         10  FILLER                  PIC X(01)    VALUE  ''.             
008439* label description line                                                  
008440         10  FILLER                  PIC X(15)    VALUE                   
008441             '302200003910080'.                                           
008442         10  PC150-TLR-LBL-DESC      PIC X(10)    VALUE                   
008443             '@@@@@@@@@@'.                                                
008444         10  FILLER                  PIC X(01)    VALUE  ''.             
008447         10  FILLER                  PIC X(101)   VALUE  spaces.          
008448*                                                                         
008449***** label group 4                                                       
008450*****                                                                     
008451*                                                                         
008452     05  FILLER.                                                          
008460* END OF REQUEST BOX                                                      
008700         10  FILLER                    PIC X(22)    VALUE                 
008800             '1X1100001150144L232027'.                                    
008900         10  FILLER                    PIC X(01)    VALUE  ''.           
008910* END OF REQUEST TEXT                                                     
009200         10  FILLER                    PIC X(29)    VALUE                 
009300             '341100601410371END OF REQUEST'.                             
009400         10  FILLER                    PIC X(01)    VALUE  ''.           
009401         10  FILLER                    PIC X(187)   VALUE  spaces.        
009403*                                                                         
009404*****                                                                     
009405*                                                                         
009406* E     - Terminate field generation and print label                      
009410*                                                                         
009500     05  FILLER.                                                          
009700         10  FILLER                    PIC X(02)    VALUE                 
009800             'E '.                                                        
009900         10  FILLER                    PIC X(01)    VALUE  ''.           
009901         10  FILLER                    PIC X(237)   VALUE  SPACES.        
009903*                                                                         
009904 01  PC150-SML-TRLR-LABEL-TABLE        REDEFINES                          
009905     PC150-SML-TRLR-LABEL.                                                
009906     05  PC150-SML-TRLR-LABEL-LINE     OCCURS  5 TIMES                    
009910                                       INDEXED BY PC150-IDX               
010000                                       PIC X(240).                        
010001                                                                          
010002*----------------------------------------------------------------*        
010003* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
010004*----------------------------------------------------------------*        
010005 01  PC150-TRLR-LBL-LENGTH.                                               
010006     05  FILLER                        PIC 9(03)    VALUE   61.           
010007     05  FILLER                        PIC 9(03)    VALUE   98.           
010008     05  FILLER                        PIC 9(03)    VALUE  139.           
010009     05  FILLER                        PIC 9(03)    VALUE   53.           
010011     05  FILLER                        PIC 9(03)    VALUE    3.           
010012                                                                          
010013 01  PC150-TRLR-LBL-LNGTH-VALUES REDEFINES PC150-TRLR-LBL-LENGTH.         
010014     05  PC150-TRLR-LINE-LENGTH        OCCURS 5 TIMES                     
010015                                      INDEXED BY PC150-IDX-2              
010020                                      PIC 9(03).                          
010100                                                                          
