000100****************************************************************  00010000
000200*                         PCWS035                             **  00020000
000300*  THIS IS THE COPYBOOK USED TO DISPLAYING MESSAGES ON THE    **  00030000
000400*  "MESSAGE" SCREEN IN THE UCC128 RF SYSTEM (SUKRF514)        **  00040000
000500****************************************************************  00050000
000600 01  PC035-PGM-MSG-NBRS.                                          00060000
000700     05  PC035-PGM-MSG-NBR               PIC  9(02)  VALUE ZEROS. 00070000
000800         88  PC035-CARTON-NOT-FOUND                  VALUE  1.    00080000
000900                                                                  00090000
001000 01  PC035-PGM-MSG-DATA.                                          00100000
001100*  MESSAGE 1                                                      00110000
001200     05  FILLER.                                                  00120000
001300         10  FILLER                      PIC  X(19)  VALUE        00130000
001400             '                   '.                               00140000
001500         10  FILLER                      PIC  X(19)  VALUE        00150000
001600             '                   '.                               00160000
001700         10  FILLER                      PIC  X(19)  VALUE        00170000
001800             '                   '.                               00180000
001900         10  FILLER                      PIC  X(19)  VALUE        00190000
002000             ' CARTON NOT FOUND  '.                               00200000
002100         10  FILLER                      PIC  X(19)  VALUE        00210000
002200             '                   '.                               00220000
002300         10  FILLER                      PIC  X(19)  VALUE        00230000
002400             '                   '.                               00240000
002500         10  FILLER                      PIC  X(19)  VALUE        00250000
002600             '                   '.                               00260000
002700         10  FILLER                      PIC  X(19)  VALUE        00270000
002800             'PRESS ENTER TO CONT'.                               00280000
002900                                                                  00290000
003000****************************************************************  00300000
003100*  MESSAGE 2                                                      00310000
003200     05  FILLER.                                                  00320000
003300         10  FILLER                      PIC  X(19)  VALUE        00330000
003400             '* ALREADY INACTIVE '.                               00340000
003500                                                                  00350000
003600         10  FILLER                      PIC  X(19)  VALUE        00360000
003700             'CARTON ID:         '.                               00370000
003800                                                                  00380000
003900         10  PC035-CARTON             PIC 9(18) VALUE ZERO.       00390000
004000         10  FILLER                   PIC X(01) VALUE SPACE.      00400000
004100                                                                  00410000
004200         10  FILLER                      PIC  X(07)  VALUE        00420000
004300             'PO/RC: '.                                           00430000
004400         10  PC035-PO-NBR             PIC 9(07) VALUE ZERO.       00440000
004500         10  FILLER                   PIC X(01) VALUE '-'.        00450000
004600         10  PC035-RCVR-SEQ-NBR       PIC 9(03) VALUE ZERO.       00460000
004700         10  FILLER                   PIC X(01) VALUE SPACE.      00470000
004800                                                                  00480000
004900         10  FILLER                   PIC X(05)  VALUE            00490000
005000             'STR: '.                                             00500000
005100         10  PC035-STR-NBR            PIC 9(04) VALUE ZERO.       00510004
005200         10  FILLER                   PIC X(01) VALUE SPACE.      00520004
005300         10  FILLER                   PIC X(05)  VALUE            00530000
005400             'LNE: '.                                             00540000
005500         10  PC035-PO-LINE-NBR        PIC 9(04) VALUE ZERO.       00550000
005600         10  PC035-PO-LINE-NBR-X REDEFINES PC035-PO-LINE-NBR      00560000
005700                                      PIC X(04).                  00570000
005800         10  FILLER                      PIC  X(19)  VALUE        00580000
005900             'ENTER TO REACTIVATE'.                               00590001
006000         10  FILLER                      PIC  X(19)  VALUE        00600000
006100             'F2 = CONTINUE      '.                               00610001
006200         10  FILLER                      PIC  X(19)  VALUE        00620000
006300             '                   '.                               00630000
006400                                                                  00640000
006500****************************************************************  00650000
006600*  MESSAGE 3                                                      00660000
006700                                                                  00670000
006800     05  FILLER.                                                  00680000
006900         10  FILLER                      PIC  X(19)  VALUE        00690000
007000             '                   '.                               00700000
007100         10  FILLER                      PIC  X(19)  VALUE        00710000
007200             'AN UNDEFINED ERROR '.                               00720000
007300         10  FILLER                      PIC  X(19)  VALUE        00730000
007400             '   HAS OCCURRED    '.                               00740000
007500         10  FILLER                      PIC  X(19)  VALUE        00750000
007600             'NOTIFY SUPERVISOR  '.                               00760000
007700         10  FILLER                      PIC  X(19)  VALUE        00770000
007800             '                   '.                               00780000
007900         10  FILLER                      PIC  X(19)  VALUE        00790000
008000             '                   '.                               00800000
008100         10  FILLER                      PIC  X(19)  VALUE        00810000
008200             '                   '.                               00820000
008300         10  FILLER                      PIC  X(19)  VALUE        00830000
008400             '                   '.                               00840000
008500                                                                  00850000
008600****************************************************************  00860000
008700*  MESSAGE 4                                                      00870000
008800                                                                  00880000
008900     05  FILLER.                                                  00890000
009000         10  FILLER                      PIC  X(19)  VALUE        00900000
009100             '                   '.                               00910000
009200         10  FILLER                      PIC  X(19)  VALUE        00920000
009300             'DATABASE IS BUSY   '.                               00930000
009400         10  FILLER                      PIC  X(19)  VALUE        00940000
009500             'PRESS ENTER TO CONT'.                               00950000
009600         10  FILLER                      PIC  X(19)  VALUE        00960000
009700             '                   '.                               00970000
009800         10  FILLER                      PIC  X(19)  VALUE        00980000
009900             'IF PROBLEM PERSISTS'.                               00990000
010000         10  FILLER                      PIC  X(19)  VALUE        01000000
010100             'NOTIFY SUPERVISOR  '.                               01010000
010200         10  FILLER                      PIC  X(19)  VALUE        01020000
010300             '                   '.                               01030000
010400         10  FILLER                      PIC  X(19)  VALUE        01040000
010500             '                   '.                               01050000
010600****************************************************************  01060000
010700*  MESSAGE 5                                                      01070000
010800                                                                  01080000
010900     05  FILLER.                                                  01090000
011000         10  FILLER                   PIC X(19)  VALUE            01100000
011100             '  ***  ERROR  ***  '.                               01110000
011200         10  FILLER                   PIC X(19)  VALUE            01120000
011300             '                   '.                               01130000
011400                                                                  01140000
011500         10  FILLER                   PIC X(01)  VALUE SPACE.     01150000
011600         10  PC035-CARTON-XFER        PIC 9(18) VALUE ZERO.       01160000
011700                                                                  01170000
011800         10  FILLER                   PIC  X(19)  VALUE           01180000
011900             '                   '.                               01190000
012000         10  FILLER                   PIC  X(19)  VALUE           01200000
012100             ' NOT CONNECTED TO  '.                               01210000
012200         10  FILLER                   PIC  X(19)  VALUE           01220000
012300             '   ANY TRANSFER    '.                               01230000
012400         10  FILLER                   PIC X(19)  VALUE            01240000
012500             '                   '.                               01250000
012600         10  FILLER                   PIC  X(19)  VALUE           01260000
012700             '   F3 = RETURN     '.                               01270000
012800****************************************************************  01280000
012900*  MESSAGE 6                                                      01290000
013000                                                                  01300000
013100     05  FILLER.                                                  01310000
013200         10  FILLER                   PIC X(19)  VALUE            01320000
013300             '  ***  ERROR  ***  '.                               01330000
013400         10  FILLER                   PIC X(19)  VALUE            01340000
013500             '                   '.                               01350000
013600         10  FILLER                   PIC X(19)  VALUE            01360000
013700             ' FAST STORE NUMBER '.                               01370000
013800         10  FILLER                   PIC X(19)  VALUE            01380000
013900             '  DOES NOT MATCH   '.                               01390000
014000         10  FILLER                   PIC X(19) VALUE             01400000
014100             ' SML STORE NUMBER  '.                               01410000
014200         10  FILLER                   PIC X(19)  VALUE            01420000
014300             '                   '.                               01430000
014400         10  FILLER                   PIC X(19)  VALUE            01440000
014500             '                   '.                               01450000
014600         10  FILLER                   PIC X(19)  VALUE            01460000
014700             '   F3 = RETURN     '.                               01470000
014800****************************************************************  01480000
014900*  MESSAGE 7                                                      01490000
015000                                                                  01500000
015100     05  FILLER.                                                  01510000
015200         10  FILLER                   PIC X(19)  VALUE            01520000
015300             '   UNRECOVERABLE   '.                               01530000
015400         10  FILLER                   PIC X(19)  VALUE            01540000
015500             '   DATABASE ERROR  '.                               01550000
015600         10  PC035-ERROR.                                         01560000
015700             15  FILLER               PIC X(05)  VALUE SPACE.     01570000
015800             15  FILLER               PIC X(01)  VALUE '('.       01580000
015900             15  PC035-ERROR-TRANID   PIC X(04)  VALUE SPACE.     01590000
016000             15  FILLER               PIC X(01)  VALUE '-'.       01600000
016100             15  PC035-ERROR-NBR      PIC 9(03)  VALUE ZEROES.    01610000
016200             15  FILLER               PIC X(01)  VALUE ')'.       01620000
016300             15  FILLER               PIC X(04)  VALUE SPACE.     01630000
016400         10  FILLER                   PIC X(19)  VALUE            01640000
016500             ' NOTIFY SUPERVISOR '.                               01650000
016600         10  FILLER                   PIC X(19)  VALUE            01660000
016700             '                   '.                               01670000
016800         10  FILLER                   PIC X(19)  VALUE            01680000
016900             '   PRESS ENTER TO  '.                               01690000
017000         10  FILLER                   PIC X(19) VALUE             01700000
017100             '      RETURN       '.                               01710000
017200         10  FILLER                   PIC X(19)  VALUE            01720000
017300             '   TO MAIN MENU    '.                               01730000
017400****************************************************************  01740000
017500*  MESSAGE 8                                                      01750000
017600                                                                  01760000
017700     05  FILLER.                                                  01770000
017800         10  FILLER                   PIC X(19)  VALUE            01780000
017900             ' CHOOSE ENTRY MODE '.                               01790000
018000         10  FILLER                   PIC X(19)  VALUE            01800000
018100             '                   '.                               01810000
018200         10  FILLER                   PIC X(19)  VALUE            01820000
018300             ' F6 = SCAN EACH UPC'.                               01830000
018400         10  FILLER                   PIC X(19)  VALUE            01840000
018500             '                   '.                               01850000
018600         10  FILLER                   PIC X(19)  VALUE            01860000
018700             ' F7 = SCAN UPC ONCE'.                               01870000
018800         10  FILLER                   PIC X(19)  VALUE            01880000
018900             ' AND KEY TOTAL QTY '.                               01890000
019000         10  FILLER                   PIC X(19) VALUE             01900000
019100             '                   '.                               01910000
019200         10  FILLER                   PIC X(19)  VALUE            01920000
019300             '   F3 = RETURN     '.                               01930000
019400****************************************************************  01940000
019500*  MESSAGE 9                                                      01950000
019600     05  FILLER.                                                  01960000
019700         10  FILLER                   PIC X(19)  VALUE            01970000
019800             ' MERCHANDISE CARTON'.                               01980000
019900         10  FILLER                   PIC X(19)  VALUE            01990000
020000             '    CANNOT BE      '.                               02000000
020100         10  FILLER                   PIC X(19)  VALUE            02010000
020200             ' MASTER CONTAINER  '.                               02020000
020300         10  FILLER                   PIC X(19)  VALUE            02030000
020400             '                   '.                               02040000
020500         10  FILLER                   PIC X(19)  VALUE            02050000
020600             '                   '.                               02060000
020700         10  FILLER                   PIC X(19)  VALUE            02070000
020800             '                   '.                               02080000
020900         10  FILLER                   PIC X(19)  VALUE            02090000
021000             '                   '.                               02100000
021100         10  FILLER                   PIC X(19)  VALUE            02110000
021200             'PRESS ENTER TO CONT'.                               02120000
021300****************************************************************  02130000
021400*  MESSAGE 10                                                     02140000
021500                                                                  02150000
021600     05  FILLER.                                                  02160000
021700         10  FILLER                   PIC X(19)  VALUE            02170000
021800             '  CHILD ALREADY    '.                               02180000
021900         10  FILLER                   PIC X(19)  VALUE            02190000
022000             ' ASSIGNED TO THIS  '.                               02200000
022100         10  FILLER                   PIC X(19)  VALUE            02210000
022200             ' MASTER CONTAINER  '.                               02220000
022300         10  FILLER                   PIC X(19)  VALUE            02230000
022400             '                   '.                               02240000
022500         10  FILLER                   PIC X(19)  VALUE            02250000
022600             '                   '.                               02260000
022700         10  FILLER                   PIC X(19)  VALUE            02270000
022800             'F4 TO REMOVE FROM  '.                               02280000
022900         10  FILLER                   PIC X(19) VALUE             02290000
023000             '    MASTER OR      '.                               02300000
023100         10  FILLER                   PIC X(19)  VALUE            02310000
023200             ' ENTER TO IGNORE   '.                               02320000
023300****************************************************************  02330000
023400*  MESSAGE 11                                                     02340000
023500                                                                  02350000
023600     05  FILLER.                                                  02360000
023700         10  FILLER                   PIC X(19)  VALUE            02370000
023800             '  STORE DEST DOES  '.                               02380000
023900         10  FILLER                   PIC X(19)  VALUE            02390000
024000             '    NOT MATCH      '.                               02400000
024100         10  FILLER                   PIC X(19)  VALUE            02410000
024200             ' MASTER CONTAINER  '.                               02420000
024300         10  FILLER                   PIC X(19)  VALUE            02430000
024400             '    STORE DEST     '.                               02440000
024500         10  FILLER                   PIC X(19)  VALUE            02450000
024600             '                   '.                               02460000
024700         10  FILLER                   PIC X(19)  VALUE            02470000
024800             '                   '.                               02480000
024900         10  FILLER                   PIC X(19) VALUE             02490000
025000             '                   '.                               02500000
025100         10  FILLER                   PIC X(19)  VALUE            02510000
025200             '  ENTER TO IGNORE  '.                               02520000
025300****************************************************************  02530000
025400*  MESSAGE 12                                                     02540000
025500                                                                  02550000
025600     05  FILLER.                                                  02560000
025700         10  FILLER                   PIC X(19)  VALUE            02570000
025800             '   CHILD ALREADY   '.                               02580000
025900         10  FILLER                   PIC X(19)  VALUE            02590000
026000             'ASSIGNED TO ANOTHER'.                               02600000
026100         10  FILLER                   PIC X(19)  VALUE            02610000
026200             '  MASTER CONTAINER '.                               02620000
026300         10  FILLER                   PIC X(01)  VALUE            02630000
026400                                                 SPACE.           02640000
026500         10  PC035-BARCODE            PIC 9(18) VALUE ZERO.       02650000
026600         10  FILLER                   PIC X(19)  VALUE            02660000
026700             '                   '.                               02670000
026800         10  FILLER                   PIC X(19)  VALUE            02680000
026900             'F4-REASSIGN TO CURR'.                               02690000
027000         10  FILLER                   PIC X(19) VALUE             02700000
027100             '     MASTER OR     '.                               02710000
027200         10  FILLER                   PIC X(19)  VALUE            02720000
027300             '  ENTER TO IGNORE  '.                               02730000
027400****************************************************************  02740000
027500*  MESSAGE 13                                                     02750000
027600                                                                  02760000
027700     05  FILLER.                                                  02770000
027800         10  FILLER                   PIC X(19)  VALUE            02780000
027900             ' SCANNED CONTAINER '.                               02790000
028000         10  FILLER                   PIC X(19)  VALUE            02800000
028100             '     IS MASTER     '.                               02810000
028200         10  FILLER                   PIC X(19)  VALUE            02820000
028300             '                   '.                               02830000
028400         10  FILLER                   PIC X(19)  VALUE            02840000
028500             '                   '.                               02850000
028600         10  FILLER                   PIC X(19)  VALUE            02860000
028700             '                   '.                               02870000
028800         10  FILLER                   PIC X(19)  VALUE            02880000
028900             '  F2-ADD MASTER TO '.                               02890000
029000         10  FILLER                   PIC X(19)  VALUE            02900000
029100             '   THIS MASTER OR  '.                               02910000
029200         10  FILLER                   PIC X(19)  VALUE            02920000
029300             '  ENTER TO IGNORE  '.                               02930000
029400****************************************************************  02940000
029500*  MESSAGE 14                                                     02950000
029600                                                                  02960000
029700     05  FILLER.                                                  02970000
029800         10  FILLER                   PIC X(19)  VALUE            02980000
029900             ' MASTER CARTON     '.                               02990000
030000         10  FILLER                   PIC X(19)  VALUE            03000000
030100             ' DOES NOT EXIST    '.                               03010000
030200         10  FILLER                   PIC X(19)  VALUE            03020000
030300             '                   '.                               03030000
030400         10  FILLER                   PIC X(19)  VALUE            03040000
030500             '                   '.                               03050000
030600         10  FILLER                   PIC X(19)  VALUE            03060000
030700             '                   '.                               03070000
030800         10  FILLER                   PIC X(19)  VALUE            03080000
030900             '                   '.                               03090000
031000         10  FILLER                   PIC X(19) VALUE             03100000
031100             '                   '.                               03110000
031200         10  FILLER                   PIC X(19)  VALUE            03120000
031300             ' ENTER TO IGNORE   '.                               03130000
031400****************************************************************  03140000
031500*  MESSAGE 15                                                     03150000
031600                                                                  03160000
031700     05  FILLER.                                                  03170000
031800         10  FILLER                   PIC X(19)  VALUE            03180000
031900             '  BARCODE SCANNED  '.                               03190000
032000         10  FILLER                   PIC X(19)  VALUE            03200000
032100             '     IS MASTER     '.                               03210000
032200         10  FILLER                   PIC X(19)  VALUE            03220000
032300             ' CURRENTLY WORKING '.                               03230000
032400         10  FILLER                   PIC X(19)  VALUE            03240000
032500             '       WITH        '.                               03250000
032600         10  FILLER                   PIC X(19) VALUE             03260000
032700             '                   '.                               03270000
032800         10  FILLER                   PIC X(19)  VALUE            03280000
032900             '                   '.                               03290000
033000         10  FILLER                   PIC X(19)  VALUE            03300000
033100             '                   '.                               03310000
033200         10  FILLER                   PIC X(19)  VALUE            03320000
033300             '  ENTER TO IGNORE  '.                               03330000
033400****************************************************************  03340000
033500*  MESSAGE 16                                                     03350000
033600     05  FILLER.                                                  03360000
033700         10  FILLER                   PIC X(19)  VALUE            03370000
033800             'MERCHANDISE CARTON '.                               03380000
033900         10  FILLER                   PIC X(19)  VALUE            03390000
034000             'ALREADY MANIFESTED '.                               03400000
034100         10  FILLER                   PIC X(19)  VALUE            03410000
034200             '    TO TRAILER     '.                               03420000
034300         10  FILLER                   PIC X(19)  VALUE            03430000
034400             '                   '.                               03440000
034500         10  FILLER                   PIC X(02)  VALUE SPACE.     03450000
034600         10  PC035-OWNER-SCAC-ID1     PIC X(04)  VALUE SPACE.     03460000
034700         10  FILLER                   PIC X(01)  VALUE SPACE.     03470000
034800         10  PC035-VEH-NBR1           PIC X(12)  VALUE SPACE.     03480000
034900                                                                  03490000
035000         10  FILLER                   PIC X(19)  VALUE            03500000
035100             '                   '.                               03510000
035200         10  FILLER                   PIC X(19) VALUE             03520000
035300             ' PRESS ENTER TO    '.                               03530000
035400         10  FILLER                   PIC X(19)  VALUE            03540000
035500             '     IGNORE        '.                               03550000
035600****************************************************************  03560000
035700*  MESSAGE 17                                                     03570000
035800     05  FILLER.                                                  03580000
035900         10  FILLER                      PIC  X(19)  VALUE        03590000
036000             ' MASTER CONTAINER  '.                               03600000
036100         10  FILLER                      PIC  X(19)  VALUE        03610000
036200             'ALREADY MANIFESTED '.                               03620000
036300         10  FILLER                      PIC  X(19)  VALUE        03630000
036400             '   TO TRAILER      '.                               03640000
036500         10  FILLER                      PIC  X(19)  VALUE        03650000
036600             '                   '.                               03660000
036700         10  FILLER                   PIC X(02) VALUE SPACE.      03670000
036800         10  PC035-OWNER-SCAC-ID2     PIC X(04) VALUE ZERO.       03680000
036900         10  FILLER                   PIC X(01) VALUE SPACE.      03690000
037000         10  PC035-VEH-NBR2           PIC X(12) VALUE ZERO.       03700000
037100                                                                  03710000
037200         10  FILLER                   PIC  X(19)  VALUE           03720000
037300             '                   '.                               03730000
037400         10  FILLER                   PIC  X(19)  VALUE           03740000
037500             '  PRESS ENTER TO   '.                               03750000
037600         10  FILLER                   PIC  X(19)  VALUE           03760000
037700             '     IGNORE        '.                               03770000
037800                                                                  03780000
037900****************************************************************  03790000
038000*  MESSAGE 18                                                     03800000
038100                                                                  03810000
038200     05  FILLER.                                                  03820000
038300         10  FILLER                   PIC X(19)  VALUE            03830000
038400             'MASTER CONTAINER   '.                               03840000
038500         10  FILLER                   PIC X(19)  VALUE            03850000
038600             ' ALREADY SEALED    '.                               03860000
038700         10  FILLER                   PIC X(19)  VALUE            03870000
038800             '                   '.                               03880000
038900         10  FILLER                   PIC X(19)  VALUE            03890000
039000             '                   '.                               03900000
039100         10  FILLER                   PIC X(19)  VALUE            03910000
039200             '                   '.                               03920000
039300         10  FILLER                   PIC X(19)  VALUE            03930000
039400             '  F4 TO UNSEAL     '.                               03940000
039500         10  FILLER                   PIC X(19)  VALUE            03950000
039600             '  CONTAINER OR     '.                               03960000
039700         10  FILLER                   PIC X(19)  VALUE            03970000
039800             ' ENTER TO IGNORE   '.                               03980000
039900****************************************************************  03990000
040000*  MESSAGE 19                                                     04000000
040100                                                                  04010000
040200     05  FILLER.                                                  04020000
040300         10  FILLER                   PIC X(19)  VALUE            04030000
040400             ' MASTER CONTAINER  '.                               04040000
040500         10  FILLER                   PIC X(19)  VALUE            04050000
040600             ' ALREADY ASSIGNED  '.                               04060000
040700         10  FILLER                   PIC X(19)  VALUE            04070000
040800             ' TO THIS MASTER    '.                               04080000
040900         10  FILLER                   PIC X(19)  VALUE            04090000
041000             '                   '.                               04100000
041100         10  FILLER                   PIC X(19)  VALUE            04110000
041200             '                   '.                               04120000
041300         10  FILLER                   PIC X(19)  VALUE            04130000
041400             'F4 TO REMOVE FROM  '.                               04140000
041500         10  FILLER                   PIC X(19)  VALUE            04150000
041600             '   MASTER OR       '.                               04160000
041700         10  FILLER                   PIC X(19)  VALUE            04170000
041800             ' ENTER TO IGNORE   '.                               04180000
041900****************************************************************  04190000
042000*  MESSAGE 20                                                     04200000
042100                                                                  04210000
042200     05  FILLER.                                                  04220000
042300         10  FILLER                   PIC X(19)  VALUE            04230000
042400             '    UNABLE TO      '.                               04240000
042500         10  FILLER                   PIC X(19)  VALUE            04250000
042600             ' INACTIVATE A LABEL'.                               04260000
042700         10  FILLER                   PIC X(19)  VALUE            04270000
042800             '    CREATED IN     '.                               04280000
042900         10  FILLER                   PIC X(19)  VALUE            04290000
043000             '    SMOOTHING      '.                               04300000
043100         10  FILLER                   PIC X(19)  VALUE            04310000
043200             '                   '.                               04320000
043300         10  FILLER                   PIC X(19)  VALUE            04330000
043400             'PRESS ENTER TO     '.                               04340000
043500         10  FILLER                   PIC X(19)  VALUE            04350000
043600             'CONTINUE           '.                               04360000
043700         10  FILLER                   PIC X(19)  VALUE            04370000
043800             '                   '.                               04380000
043900****************************************************************  04390000
044000*  MESSAGE 21                                                     04400000
044100                                                                  04410000
044200     05  FILLER.                                                  04420000
044300         10  FILLER                   PIC X(19)  VALUE            04430000
044400             '  CHILD CARTON     '.                               04440000
044500         10  FILLER                   PIC X(19)  VALUE            04450000
044600             ' DOES NOT EXIST    '.                               04460000
044700         10  FILLER                   PIC X(19)  VALUE            04470000
044800             '                   '.                               04480000
044900         10  FILLER                   PIC X(19)  VALUE            04490000
045000             '                   '.                               04500000
045100         10  FILLER                   PIC X(19)  VALUE            04510000
045200             '                   '.                               04520000
045300         10  FILLER                   PIC X(19)  VALUE            04530000
045400             '                   '.                               04540000
045500         10  FILLER                   PIC X(19) VALUE             04550000
045600             '                   '.                               04560000
045700         10  FILLER                   PIC X(19)  VALUE            04570000
045800             ' ENTER TO IGNORE   '.                               04580000
045900****************************************************************  04590000
046000*  MESSAGE 22                                                     04600000
046100                                                                  04610000
046200     05  FILLER.                                                  04620000
046300         10  FILLER                   PIC X(19)  VALUE            04630000
046400             '     UNABLE TO     '.                               04640000
046500         10  FILLER                   PIC X(19)  VALUE            04650000
046600             ' INACTIVATE MASTER '.                               04660000
046700         10  FILLER                   PIC X(19)  VALUE            04670000
046800             ' CONTAINER THAT HAS'.                               04680000
046900         10  FILLER                   PIC X(19)  VALUE            04690000
047000             ' CHILD CONTAINERS  '.                               04700000
047100         10  FILLER                   PIC X(19)  VALUE            04710000
047200             '     ASSIGNED      '.                               04720000
047300         10  FILLER                   PIC X(19)  VALUE            04730000
047400             '                   '.                               04740000
047500         10  FILLER                   PIC X(19) VALUE             04750000
047600             '                   '.                               04760000
047700         10  FILLER                   PIC X(19)  VALUE            04770000
047800             ' ENTER TO RETURN   '.                               04780000
047900****************************************************************  04790000
048000*  MESSAGE 23                                                     04800000
048100                                                                  04810000
048200     05  FILLER.                                                  04820000
048300         10  FILLER                   PIC X(19)  VALUE            04830000
048400             '    UNABLE TO      '.                               04840000
048500         10  FILLER                   PIC X(19)  VALUE            04850000
048600             ' INACTIVATE A LABEL'.                               04860000
048700         10  FILLER                   PIC X(19)  VALUE            04870000
048800             '    CREATED IN     '.                               04880000
048900         10  FILLER                   PIC X(19)  VALUE            04890000
049000             ' PACK TO LIGHT     '.                               04900000
049100         10  FILLER                   PIC X(19)  VALUE            04910000
049200             '                   '.                               04920000
049300         10  FILLER                   PIC X(19)  VALUE            04930000
049400             'PRESS ENTER TO     '.                               04940000
049500         10  FILLER                   PIC X(19)  VALUE            04950000
049600             'CONTINUE           '.                               04960000
049700         10  FILLER                   PIC X(19)  VALUE            04970000
049800             '                   '.                               04980000
049900****************************************************************  04990000
050000*  MESSAGE 24                                                     05000000
050100                                                                  05010000
050200     05  FILLER.                                                  05020000
050300         10  FILLER                   PIC X(19)  VALUE            05030000
050400             '    UNABLE TO      '.                               05040000
050500         10  FILLER                   PIC X(19)  VALUE            05050000
050600             ' INACTIVATE A LABEL'.                               05060000
050700         10  FILLER                   PIC X(19)  VALUE            05070000
050800             '    CREATED IN     '.                               05080000
050900         10  FILLER                   PIC X(19)  VALUE            05090000
051000             '       RDM         '.                               05100000
051100         10  FILLER                   PIC X(19)  VALUE            05110000
051200             '                   '.                               05120000
051300         10  FILLER                   PIC X(19)  VALUE            05130000
051400             'PRESS ENTER TO     '.                               05140000
051500         10  FILLER                   PIC X(19)  VALUE            05150000
051600             'CONTINUE           '.                               05160000
051700         10  FILLER                   PIC X(19)  VALUE            05170000
051800             '                   '.                               05180000
051900****************************************************************  05190000
052000*  MESSAGE 25                                                     05200000
052100                                                                  05210000
052200     05  FILLER.                                                  05220000
052300         10  FILLER                   PIC X(19)  VALUE            05230000
052400             '    UNABLE TO      '.                               05240000
052500         10  FILLER                   PIC X(19)  VALUE            05250000
052600             ' INACTIVATE A LABEL'.                               05260000
052700         10  FILLER                   PIC X(19)  VALUE            05270000
052800             'WITH UNIT QUANTITY '.                               05280000
052900         10  FILLER                   PIC X(19)  VALUE            05290000
053000             '  GREATER THAN 0   '.                               05300000
053100         10  FILLER                   PIC X(19)  VALUE            05310000
053200             '                   '.                               05320000
053300         10  FILLER                   PIC X(19)  VALUE            05330000
053400             'PRESS ENTER TO     '.                               05340000
053500         10  FILLER                   PIC X(19)  VALUE            05350000
053600             'CONTINUE           '.                               05360000
053700         10  FILLER                   PIC X(19)  VALUE            05370000
053800             '                   '.                               05380000
053900****************************************************************  05390000
054000*  MESSAGE 26                                                     05400000
054100                                                                  05410000
054200     05  FILLER.                                                  05420000
054300         10  FILLER                   PIC X(19)  VALUE            05430000
054400             ' SCANNED CONTAINER '.                               05440000
054500         10  FILLER                   PIC X(19)  VALUE            05450000
054600             ' IS MASTER ALREADY '.                               05460000
054700         10  FILLER                   PIC X(19)  VALUE            05470000
054800             '  ASSIGNED AS THE  '.                               05480000
054900         10  FILLER                   PIC X(19)  VALUE            05490000
055000             '   MASTER TO THE   '.                               05500000
055100         10  FILLER                   PIC X(19)  VALUE            05510000
055200             '  MASTER CONTAINER '.                               05520000
055300         10  FILLER                   PIC X(19)  VALUE            05530000
055400             ' YOU ARE TRYING TO '.                               05540000
055500         10  FILLER                   PIC X(19)  VALUE            05550000
055600             '   ASSIGN IT TO    '.                               05560000
055700         10  FILLER                   PIC X(19)  VALUE            05570000
055800             '  ENTER TO IGNORE  '.                               05580000
055900                                                                  05590000
056000****************************************************************  05600000
056100*  MESSAGE 27                                                     05610000
056200                                                                  05620000
056300     05  FILLER.                                                  05630000
056400         10  FILLER                   PIC X(19)  VALUE            05640000
056500             ' CANNOT ADD ITEMS  '.                               05650000
056600         10  FILLER                   PIC X(19)  VALUE            05660000
056700             'TO MASTER CONTAINER'.                               05670000
056800                                                                  05680000
056900         10  PC035-CARTON-27          PIC 9(18).                  05690000
057000         10  FILLER                   PIC X(01)  VALUE SPACE.     05700000
057100                                                                  05710000
057200         10  FILLER                   PIC X(19)  VALUE            05720000
057300             '                   '.                               05730000
057400         10  FILLER                   PIC X(19)  VALUE            05740000
057500             '                   '.                               05750000
057600         10  FILLER                   PIC X(19)  VALUE            05760000
057700             '                   '.                               05770000
057800         10  FILLER                   PIC X(19)  VALUE            05780000
057900             '                   '.                               05790000
058000         10  FILLER                   PIC X(19)  VALUE            05800000
058100             ' ENTER TO CONTINUE '.                               05810000
058200****************************************************************  05820000
058300*  MESSAGE 28                                                     05830000
058400                                                                  05840000
058500     05  FILLER.                                                  05850000
058600         10  FILLER                   PIC X(19)  VALUE            05860000
058700             '    UNABLE TO      '.                               05870000
058800         10  FILLER                   PIC X(19)  VALUE            05880000
058900             ' INACTIVATE A LABEL'.                               05890000
059000         10  FILLER                   PIC X(19)  VALUE            05900000
059100             '    CREATED IN     '.                               05910000
059200         10  FILLER                   PIC X(19)  VALUE            05920000
059300             '     CHECK-IN      '.                               05930000
059400         10  FILLER                   PIC X(19)  VALUE            05940000
059500             '                   '.                               05950000
059600         10  FILLER                   PIC X(19)  VALUE            05960000
059700             'PRESS ENTER TO     '.                               05970000
059800         10  FILLER                   PIC X(19)  VALUE            05980000
059900             'CONTINUE           '.                               05990000
060000         10  FILLER                   PIC X(19)  VALUE            06000000
060100             '                   '.                               06010000
060200****************************************************************  06020000
060300*  MESSAGE 29                                                     06030000
060400                                                                  06040000
060500     05  FILLER.                                                  06050000
060600         10  FILLER                   PIC X(19)  VALUE            06060000
060700             ' CANNOT ADD ITEMS  '.                               06070000
060800         10  FILLER                   PIC X(19)  VALUE            06080000
060900             'TO SMOOTHED CARTON '.                               06090000
061000                                                                  06100000
061100         10  PC035-CARTON-29          PIC 9(18).                  06110000
061200         10  FILLER                   PIC X(01)  VALUE SPACE.     06120000
061300                                                                  06130000
061400         10  FILLER                   PIC X(19)  VALUE            06140000
061500             '                   '.                               06150000
061600         10  FILLER                   PIC X(19)  VALUE            06160000
061700             '                   '.                               06170000
061800         10  FILLER                   PIC X(19)  VALUE            06180000
061900             '                   '.                               06190000
062000         10  FILLER                   PIC X(19)  VALUE            06200000
062100             '                   '.                               06210000
062200         10  FILLER                   PIC X(19)  VALUE            06220000
062300             ' ENTER TO CONTINUE '.                               06230000
062400****************************************************************  06240000
062500*  MESSAGE 30                                                     06250000
062600                                                                  06260000
062700     05  FILLER.                                                  06270000
062800         10  FILLER                   PIC X(19)  VALUE            06280000
062900             ' CANNOT ADD ITEMS  '.                               06290000
063000         10  FILLER                   PIC X(19)  VALUE            06300000
063100             'TO A FAST XFER CTN '.                               06310000
063200                                                                  06320000
063300         10  PC035-CARTON-30          PIC 9(18).                  06330000
063400         10  FILLER                   PIC X(01)  VALUE SPACE.     06340000
063500                                                                  06350000
063600         10  FILLER                   PIC X(19)  VALUE            06360000
063700             '                   '.                               06370000
063800         10  FILLER                   PIC X(19)  VALUE            06380000
063900             '                   '.                               06390000
064000         10  FILLER                   PIC X(19)  VALUE            06400000
064100             '                   '.                               06410000
064200         10  FILLER                   PIC X(19)  VALUE            06420000
064300             '                   '.                               06430000
064400         10  FILLER                   PIC X(19)  VALUE            06440000
064500             ' ENTER TO CONTINUE '.                               06450000
064510****************************************************************  06451002
064520*  MESSAGE 31                                                     06452002
064530                                                                  06453002
064540     05  FILLER.                                                  06454002
064550         10  FILLER                   PIC X(19)  VALUE            06455002
064560             ' CANNOT RE-ACTIVATE'.                               06456002
064570         10  FILLER                   PIC X(19)  VALUE            06457002
064580             '  A LABEL THAT WAS '.                               06458002
064592         10  FILLER                   PIC X(19)  VALUE            06459202
064593             'DELETED IN CASEPACK'.                               06459302
064595         10  FILLER                   PIC X(19)  VALUE            06459502
064596             '                   '.                               06459602
064597         10  FILLER                   PIC X(19)  VALUE            06459702
064598             '                   '.                               06459802
064599         10  FILLER                   PIC X(19)  VALUE            06459902
064600             '                   '.                               06460002
064601         10  FILLER                   PIC X(19)  VALUE            06460102
064602             '                   '.                               06460202
064603         10  FILLER                   PIC X(19)  VALUE            06460302
064604             ' ENTER TO CONTINUE '.                               06460402
064610****************************************************************  06461002
064620*  MESSAGE 32                                                     06462003
064630                                                                  06463003
064640     05  FILLER.                                                  06464003
064650         10  FILLER                   PIC X(19)  VALUE            06465003
064660             '    UNABLE TO      '.                               06466003
064670         10  FILLER                   PIC X(19)  VALUE            06467003
064680             ' INACTIVATE DMG CTN'.                               06468003
064690         10  FILLER                   PIC X(19)  VALUE            06469003
064700             '    CREATED IN     '.                               06470003
064701         10  FILLER                   PIC X(19)  VALUE            06470103
064702             ' CARTON ADJUSTMENT '.                               06470203
064703         10  FILLER                   PIC X(19)  VALUE            06470303
064704             '                   '.                               06470403
064705         10  FILLER                   PIC X(19)  VALUE            06470503
064706             'PRESS ENTER TO     '.                               06470603
064707         10  FILLER                   PIC X(19)  VALUE            06470703
064708             'CONTINUE           '.                               06470803
064709         10  FILLER                   PIC X(19)  VALUE            06470903
064710             '                   '.                               06471003
064711****************************************************************  06471103
064712*  MESSAGE 33                                                     06471208
064713                                                                  06471309
064714     05  FILLER.                                                  06471409
064715         10  FILLER                   PIC X(19)  VALUE            06471509
064716             ' HAZ ALERT FOLLOWS '.                               06471609
064717         10  PC035-HAZ-ALERT  PIC  X(19)  VALUE SPACES.           06471709
064718         10  FILLER                   PIC X(19)  VALUE            06471809
064719             '                   '.                               06471909
064720         10  FILLER                   PIC X(19)  VALUE            06472009
064721             '                   '.                               06472109
064722         10  FILLER                   PIC X(19)  VALUE            06472209
064723             '                   '.                               06472309
064724         10  FILLER                   PIC X(19)  VALUE            06472409
064725             '   PRESS F2 TO     '.                               06472510
064726         10  FILLER                   PIC X(19)  VALUE            06472609
064727             '     CONTINUE      '.                               06472709
064728         10  FILLER                   PIC X(19)  VALUE            06472809
064729             '                   '.                               06472909
064731****************************************************************  06473105
064732*  MESSAGE 34                                                     06473211
064733                                                                  06473311
064734     05  FILLER.                                                  06473411
064735         10  FILLER                   PIC X(19)  VALUE            06473511
064736             ' CHILD MASTER SML  '.                               06473611
064737         10  FILLER                   PIC X(19)  VALUE            06473711
064738             'ASSIGNED TO ANOTHER'.                               06473811
064739         10  FILLER                   PIC X(19)  VALUE            06473911
064740             '  MASTER CONTAINER '.                               06474011
064741         10  FILLER                   PIC X(01)  VALUE            06474111
064742                                                 SPACE.           06474211
064743         10  PC035-MSG34-BARCODE      PIC 9(18) VALUE ZERO.       06474312
064744         10  FILLER                   PIC X(19)  VALUE            06474411
064745             '                   '.                               06474511
064746         10  FILLER                   PIC X(19)  VALUE            06474611
064747             '   F4-TO MOVE TO   '.                               06474711
064749         10  FILLER                   PIC X(19) VALUE             06474911
064750             ' CURRENT MASTER OR '.                               06475011
064751         10  FILLER                   PIC X(19)  VALUE            06475111
064752             '  ENTER TO IGNORE  '.                               06475211
064753****************************************************************  06475311
064760                                                                  06476003
064800 01  PC035-PGM-MSG-TABLE REDEFINES PC035-PGM-MSG-DATA.            06480000
064900     05  PC035-PGM-MSG-ENTRY             OCCURS 34 TIMES          06490011
065000                                         INDEXED BY PC035-IDX.    06500000
065100         10  PC035-LINE-1                PIC  X(19).              06510000
065200         10  PC035-LINE-2                PIC  X(19).              06520000
065300         10  PC035-LINE-3                PIC  X(19).              06530000
065400         10  PC035-LINE-4                PIC  X(19).              06540000
065500         10  PC035-LINE-5                PIC  X(19).              06550000
065600         10  PC035-LINE-6                PIC  X(19).              06560000
065700         10  PC035-LINE-7                PIC  X(19).              06570000
065800         10  PC035-LINE-8                PIC  X(19).              06580000
