000100************************************************************      00010000
000200*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THIS     00020000
000300*   FORMAT                                                        00030000
000400*     CALL PC251-128-LBL-CALC-PGM USING PC251-FIELDS              00040000
000500*                                                                 00050000
000600*     INITIALIZE PC251-FIELDS BEFORE CALLING DLKUT020             00060000
000700*    LENGTH=400                                                  *00070007
000800******************************************************************00080000
000900*                                                                 00090000
001000 01  PC251-FIELDS.                                                00100000
001100     05  PC251-PO-NBR                    PIC S9(9) COMP.          00110000
001200     05  PC251-RCVR-SEQ-NBR              PIC S9(4) COMP.          00120000
001300     05  PC251-PO-LNE-NBR                PIC S9(9) COMP.          00130000
001400     05  PC251-PREPK-ID                  PIC S9(4) COMP.          00140000
001500     05  PC251-DEPT-NBR                  PIC S9(4) COMP.          00150001
001510     05  PC251-CL-NBR                    PIC  9(2).               00151001
001520     05  PC251-SKU                       PIC  9(08).              00152007
001600     05  PC251-OPER-UNT-ID               PIC S9(4) COMP.          00160000
001700     05  PC251-CALLING-PROGRAM           PIC  X(8).               00170000
001800     05  PC251-USER-ID                   PIC  X(8).               00180000
001900     05  PC251-TOTAL-CARTONS             PIC  9(04).              00190000
002000     05  PC251-OTPK-UNT-QTY              PIC  9(04).              00200000
002100     05  PC251-INPK-UNT-QTY              PIC  9(04).              00210000
002200     05  PC251-MOD-NBR                   PIC  9(03).              00220000
002300     05  PC251-MODU-DESC                 PIC  X(07).              00230000
002400     05  PC251-CSEPK-PRCS-AREA           PIC  X(06).              00240000
002500     05  PC251-PRCS-QTY                  PIC  9(05).              00250000
002600     05  PC251-TRNS-QTY                  PIC  9(05).              00260000
002700     05  PC251-FCSE-LBL-CNT              PIC  9(04).              00270000
002800     05  PC251-INPK-LBL-CNT              PIC  9(04).              00280000
002900     05  PC251-P2L-LBL-CNT               PIC  9(04).              00290000
003000     05  PC251-CS-BOUND-UNTS             PIC  9(09).              00300000
003100     05  PC251-DC-BOUND-UNTS             PIC  9(09).              00310000
003200     05  PC251-RTV-BOUND-UNTS            PIC  9(09).              00320000
003300     05  PC251-CS-BOUND-CTNS             PIC  9(04).              00330000
003400     05  PC251-DC-BOUND-CTNS             PIC  9(04).              00340000
003500     05  PC251-RTV-BOUND-CTNS            PIC  9(04).              00350000
003501     05  PC251-PREPK-RATIO               PIC S9(04) VALUE ZEROES  00350105
003502                                                  COMP.           00350205
003505     05  PC251-TOT-PREPK-UNTS            PIC S9(04) VALUE ZEROES  00350505
003506                                                  COMP.           00350605
003510     05  PC251-PROGRAM-FUNCTION          PIC  X(01).              00351000
003520         88  PC251-FUNC-LBL-CALC              VALUE 'C'.          00352000
003530         88  PC251-FUNC-CRE-VRTL-LBL          VALUE 'V'.          00353000
003531     05  PC251-PRT-SEQ                 PIC  X(01).                00353100
003532         88  PC251-PRT-STR-SEQ                     VALUE 'R'.     00353200
003533         88  PC251-PRT-SHUFFLED                    VALUE 'S'.     00353300
003534         88  PC251-PRT-DOOR-SEQ                    VALUE 'D'.     00353400
003535     05  PC251-PKGNG-CD                PIC X(01).                 00353500
003536         88  PC251-PRE-PACK-ORDER                  VALUE 'I', 'M'.00353600
003537         88  PC251-INNER-PREPK                     VALUE 'I'.     00353700
003538         88  PC251-MULTI-SKU-PREPK                 VALUE 'M'.     00353800
003539         88  PC251-SINGLE-SKU-PREPK                VALUE 'S'.     00353900
003540         88  PC251-CASEPACK                        VALUE 'C'.     00354000
003550         88  PC251-BULK-PACK                       VALUE 'B'.     00355000
003560     05  PC251-CASEPACK-FUNCTION       PIC  X(01).                00356000
003570         88  PC251-CREATE-BOTH                     VALUE 'B'.     00357000
003580         88  PC251-CREATE-P2L                      VALUE 'P'.     00358000
003590         88  PC251-CREATE-SML                      VALUE 'C'.     00359000
003591     05  PC251-OTPK-SW                 PIC  X(01).                00359100
003592         88 PC251-MULT-OTPK                       VALUE 'M'.      00359200
003593         88 PC251-SINGLE-OTPK                     VALUE 'S'.      00359300
003594     05  PC251-PREPK-UCC128-SW         PIC  X(01).                00359400
003595         88 PC251-PREPK-UCC128-YES                VALUE 'Y'.      00359500
003596         88 PC251-PREPK-UCC128-NO                 VALUE 'N'.      00359600
003597     05  PC251-ERROR-SW                PIC  X(01).                00359700
003598         88  PC251-ERR-OTPK-BY-INPK               VALUE 'A'.      00359800
003599         88  PC251-ERR-INVALID-OTPK               VALUE 'B'.      00359900
003600         88  PC251-ERR-LNES-NOT-PRPK              VALUE 'C'.      00360000
003601         88  PC251-ERR-DC-RTV-NOT-OTPK            VALUE 'D'.      00360100
003602     05  PC251-INPK-CNVY-IND           PIC  X(01).                00360200
003603         88  PC251-INPK-CNVY-YES                   VALUE 'Y'.     00360300
003604         88  PC251-INPK-CNVY-NO                    VALUE 'N'.     00360400
003605*                                                                 00360500
003606     05  PC251-SUCCESS-IND               PIC X(01).               00360600
003607         88  PC251-SUCCESSFUL          VALUES                     00360700
003608                                      ZERO, SPACES, LOW-VALUES.   00360800
003609         88  PC251-NOT-SUCCESSFUL                  VALUE '1'.     00360900
003610         88  PC251-INVALID-SQL                     VALUE '2'.     00361000
003620         88  PC251-DATABASE-BUSY                   VALUE '3'.     00362000
003630     05  PC251-ERROR-PARA-NBR            PIC X(10).               00363000
003640     05  PC251-ERROR-TABLE-NME           PIC X(08).               00364000
003650     05  PC251-SQL-CODE                  PIC S9(9).               00365000
003670     05  PC251-SQLCA                     PIC X(136).              00367000
003680     05  PC251-CRA-REQ-ID                PIC X(08).               00368000
003690*                                                                 00369000
003700     05  FILLER                          PIC X(85).               00370006
003800 01  PC251-COMMAREA                   PIC X(01).                  00380000
