000100***************************************************************** 00010000
000200* PCWS179 - LABEL DATA RECORD - CHECK-IN SML USING 128 DATA     * 00020000
000300*                                                               * 00030000
000400*  THIS IS THE LAYOUT FOR THE FORM FOR THE SML LABEL USED IN    * 00040000
000500*  THE CHECK-IN APPLICATION WHEN A BATCH PRINTER IS SELECTED    * 00050000
000600*                                                               * 00060000
000700* IT MUST BE PRECEEDED BY FORM RECORDS DESCRIBED IN PCWS178.    * 00070000
000800*                                                               * 00080000
000900* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE   00090000
001000* FIRST POSITION.                                                 00100000
001100* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00110000
001200*                    I M P O R T A N T                          * 00120000
001300* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 3-05 LEVELS * 00130000
001400* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 * 00140000
001500* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  * 00150000
001600* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        * 00160000
001700* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       * 00170000
001800***************************************************************** 00180000
001900                                                                  00190000
002000 01  PC179-MAX-LABEL-LINES            PIC S9(04) VALUE  +03       00200000
002100                                                COMP SYNC.        00210000
002200***                                                               00220000
002300***    NUMBER OF 05 LEVELS ------------------------------/\       00230000
002400***                                                               00240000
002500***    THIS NUMBER MUST MATCH THE NUMBER IN THE "OCCURS"          00250000
002600***    CLAUSE FOUND AT THE BOTTOM OF THIS COPYBOOK                00260000
002700***                                                               00270000
002800***                                                               00280000
002900 01  PC179-SML-LABEL-DATA.                                        00290000
003000*                                                                 00300000
003100* LINE 1                                                          00310000
003200*                                                                 00320000
003300     05 FILLER.                                                   00330000
003400* CARTON ID                                                       00340000
003500         10 FILLER                    PIC X(04) VALUE             00350000
003600            'U02'.                                               00360000
003700         10 PC179-CARTON-ID           PIC 9(05) VALUE ZEROS.      00370000
003800         10 FILLER                    PIC X(01) VALUE  ''.       00380000
003900* PO-RCVR                                                         00390000
004000         10 FILLER                    PIC X(04) VALUE             00400000
004100            'U04'.                                               00410000
004200         10 PC179-PO-RCVR             PIC 9(12) VALUE ZEROES.     00420000
004300         10 FILLER                    PIC X(01) VALUE  ''.       00430000
004400* LINE NBR/PACK-ID                                                00440000
004500         10 FILLER                    PIC X(04) VALUE             00450000
004600            'U06'.                                               00460000
004700         10 PC179-LINE-NBR            PIC Z(03) VALUE ZEROES.     00470000
004800         10 FILLER                    PIC X(01) VALUE  ''.       00480000
004900* SKU                                                             00490000
005000         10 FILLER                    PIC X(04) VALUE             00500000
005100            'U08'.                                               00510000
005200         10 PC179-SKU                 PIC X(16) VALUE SPACES.     00520000
005300         10 FILLER                    PIC X(01) VALUE  ''.       00530000
005400* STYLE                                                           00540000
005500         10 FILLER                    PIC X(04) VALUE             00550000
005600            'U10'.                                               00560000
005700         10 PC179-STYLE               PIC X(20).                  00570000
005800         10 FILLER                    PIC X(01) VALUE  ''.       00580000
005900* OUTER PACK UNIT                                                 00590000
006000         10 FILLER                    PIC X(04) VALUE             00600000
006100            'U12'.                                               00610000
006200         10 PC179-OTPK-UNIT           PIC X(04).                  00620000
006300         10 FILLER                    PIC X(01) VALUE  ''.       00630000
006400* UNITS IN PACK                                                   00640000
006500         10 FILLER                    PIC X(04) VALUE             00650000
006600            'U14'.                                               00660000
006700         10 PC179-PACK-UNITS          PIC X(04) VALUE '@@@@'.     00670000
006800         10 FILLER                    PIC X(01) VALUE  ''.       00680000
006900* PACKS IN OUTERPACK                                              00690000
007000         10 FILLER                    PIC X(04) VALUE             00700000
007100            'U16'.                                               00710000
007200         10 PC179-OTPK-PACKS          PIC X(04) VALUE '@@@@'.     00720000
007300         10 FILLER                    PIC X(01) VALUE  ''.       00730000
007400* DEPARTMENT/MAJOR CLASS DESCRIPTION                              00740000
007500         10 FILLER                    PIC X(04) VALUE             00750000
007600            'U17'.                                               00760000
007700         10 PC179-DEPT-CLASS-DESC     PIC X(35).                  00770001
007800         10 FILLER                    PIC X(01) VALUE  ''.       00780000
007900* STORE ON HAND ZERO MESSAGE                                      00790000
008000         10 FILLER                    PIC X(04) VALUE             00800000
008100            'U18'.                                               00810000
008200         10 PC179-STR-ON-HAND         PIC X(35).                  00820001
008210            88 PC179-OH-ZERO-MSG-YES            VALUE             00821001
008220               'BALANCE OH ZERO, WORK IMMEDIATELY  '.             00822001
008230            88 PC179-OH-ZERO-MSG-NO             VALUE SPACES.     00823001
008300         10 FILLER                    PIC X(01) VALUE  ''.       00830000
008400         10 FILLER                    PIC X(52) VALUE SPACES.     00840000
008500*                                                                 00850000
008600* LINE 2                                                          00860000
008700* FIXTURE DATA                                                    00870000
008800     05 FILLER.                                                   00880000
008900         10 FILLER                    PIC X(04) VALUE             00890000
009000            'U20'.                                               00900000
009100         10 PC179-FIXTURE             PIC X(05).                  00910000
009200         10 FILLER                    PIC X(01) VALUE  ''.       00920000
009300* SEASONAL SET INFORMATION                                        00930000
009400         10 FILLER                    PIC X(04) VALUE             00940000
009500            'U22'.                                               00950000
009600         10 PC179-SEASET              PIC X(25).                  00960000
009700         10 FILLER                    PIC X(01) VALUE  ''.       00970000
009800* ERROR MESSAGE 1                                                 00980000
009900         10 FILLER                    PIC X(04) VALUE             00990000
010000            'U23'.                                               01000000
010100         10 PC179-ERROR-MSG-1         PIC X(35).                  01010000
010200         10 FILLER                    PIC X(01) VALUE  ''.       01020000
010300* ERROR MESSAGE 2                                                 01030000
010400         10 FILLER                    PIC X(04) VALUE             01040000
010500            'U24'.                                               01050000
010600         10 PC179-ERROR-MSG-2         PIC X(35).                  01060000
010700         10 FILLER                    PIC X(01) VALUE  ''.       01070000
010800* TRIP ID                                                         01080000
010810         10 FILLER                    PIC X(04) VALUE             01081000
010820            'U26'.                                               01082000
010830         10 PC179-TRIP-ID             PIC X(09).                  01083000
010840         10 FILLER                    PIC X(01) VALUE  ''.       01084000
010850* INFORMATION MESSAGE                                             01085000
010860         10 FILLER                    PIC X(04) VALUE             01086000
010870            'U27'.                                               01087000
010880         10 PC179-IINFO-MSG           PIC X(09).                  01088000
010890         10 FILLER                    PIC X(01) VALUE  ''.       01089000
010900* LABEL # OF                                                      01090000
011000         10 FILLER                    PIC X(04) VALUE             01100000
011100            'U30'.                                               01110000
011200         10 PC179-LABEL-NBR           PIC X(04) VALUE '@@@@'.     01120000
011300         10 FILLER                    PIC X(01) VALUE  ''.       01130000
011400* " OF " LITERAL BOTTOM OF LABEL                                  01140000
011500         10 FILLER                    PIC X(04) VALUE             01150000
011600            'U31'.                                               01160000
011700         10 PC179-LABEL-OF            PIC X(04) VALUE '@@@@'.     01170000
011800         10 FILLER                    PIC X(01) VALUE  ''.       01180000
011900* TOTAL LABEL COUNT                                               01190000
012000         10 FILLER                    PIC X(04) VALUE             01200000
012100            'U32'.                                               01210000
012200         10 PC179-TOT-LABEL           PIC X(04) VALUE '@@@@'.     01220000
012300         10 FILLER                    PIC X(01) VALUE  ''.       01230000
012400*                                                                 01240000
012500*                                                                 01250000
012510* STORE NAME                                                      01251000
012520*                                                                 01252000
012530         10 FILLER                    PIC X(04) VALUE             01253000
012540            'U36'.                                               01254000
012550         10 PC179-SML-STR-NME         PIC X(10) VALUE SPACE.      01255000
012560            88  PC179-PRT-STR-NME             VALUE SPACE.        01256000
012570            88  PC179-NO-PRT-SML-STR-NME      VALUE '@@@@@@@@@@'. 01257000
012580         10 FILLER                    PIC X(01) VALUE  ''.       01258000
012590* STORE NUMBER                                                    01259000
012591         10 FILLER                    PIC X(04) VALUE             01259100
012592            'U37'.                                               01259200
012593         10 PC179-SML-STR-NBR         PIC X(04) VALUE SPACE.      01259300
012594            88  PC179-PRT-SML-STR-NBR         VALUE SPACE.        01259400
012595            88  PC179-NO-PRT-SML-STR-NBR      VALUE '@@@@'.       01259500
012596         10 FILLER                    PIC X(01) VALUE  ''.       01259600
012597         10 FILLER                    PIC X(41) VALUE SPACES.     01259700
012598*                                                                 01259800
012599* LINE 3                                                          01259900
012600*  E   -  TERMINATE FIELD GENERATION AND PRINT LABEL              01260000
012700*         PC179-SML-LBL-QTY = # OF COPIES FOR EACH LABEL          01270000
012800*                                                                 01280000
012900     05 FILLER.                                                   01290000
013000         10 FILLER                    PIC X(02) VALUE             01300000
013100            'E'.                                                 01310000
013200         10 PC179-SML-LBL-QTY         PIC 9(04) VALUE ZEROES.     01320000
013300         10 FILLER                    PIC X(01) VALUE  ''.       01330000
013400*                                                                 01340000
013500*  G   - PRINTS PREVIOUSLY STORED OR PRINTED LABEL COMMANDS       01350000
013600*                                                                 01360000
013700         10 FILLER                    PIC X(02) VALUE             01370000
013800            'G'.                                                 01380000
013900         10 FILLER                    PIC X(01) VALUE  ''.       01390000
014000         10 FILLER                    PIC X(230) VALUE SPACES.    01400000
014100                                                                  01410000
014200* LABEL OCCURS IS THE NUMBER OF 'VARIABLE' FIELDS THAT            01420000
014300* SENT TO THE LABEL.  IF ADDITIONAL FIELDS ARE ADDED OR           01430000
014400* REMOVED THE OCCURS STATEMENT BELOW SHOULD BE ADJUSTED           01440000
014500                                                                  01450000
014600 01  PC179-SML-LABEL-DATA-TABLE                                   01460000
014700             REDEFINES PC179-SML-LABEL-DATA.                      01470000
014800     05 PC179-SML-LABEL-LINE OCCURS 3 TIMES                       01480000
014900                           INDEXED BY PC179-IDX                   01490000
015000                                      PIC X(240).                 01500000
015100*----------------------------------------------------------------*01510000
015200* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01520000
015300*----------------------------------------------------------------*01530000
015400 01  PC179-DTL-LBL-DATA-LENGTH.                                   01540000
015500     05  FILLER                        PIC 9(03)    VALUE 188.    01550000
015600     05  FILLER                        PIC 9(03)    VALUE 199.    01560000
015700     05  FILLER                        PIC 9(03)    VALUE  10.    01570000
015800                                                                  01580000
015900 01  PC179-DTL-LBL-DATA-LNGTH-VALUE  REDEFINES                    01590000
016000         PC179-DTL-LBL-DATA-LENGTH.                               01600000
016100     05  PC179-DTL-DATA-LNE-LNGTH     OCCURS 3 TIMES              01610000
016200                                      INDEXED BY PC179-IDX-2      01620000
016300                                      PIC 9(03).                  01630000
016400                                                                  01640000
