000100******************************************************************00010000
000200* PCWS060 - 100 CHAR                                             *00020002
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    PCC UPLOADED OF LABOR DATA                                  *00040000
000500*    BOX CLOSED                                                  *00050000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  PC060-UPLOAD-ERROR-RECORD.                                   00080000
000900     05  PC060-RECORD-TYPE               PIC X(01) VALUE SPACE.   00090000
001300         88  PC060-BOX-CLOSE                       VALUE 'C'.     00130000
001400     05  PC060-ERROR-DATA                PIC X(99).               00140000
001500                                                                  00150000
003900     05  PC060-BOXCLOSE-REC       REDEFINES PC060-ERROR-DATA.     00390000
003910         10  PC060-BC-RET-CDE            PIC  X(02).              00391003
004000         10  PC060-BC-DC-NBR             PIC  9(04).              00400000
004100         10  PC060-BC-LOCATION-NM        PIC  X(10).              00410000
004200         10  PC060-BC-BOX-BARCODE        PIC  X(20).              00420000
004300         10  PC060-BC-BOXCLOSE-DATE      PIC  X(10).              00430000
004400         10  PC060-BC-BOXCLOSE-TIME      PIC  X(08).              00440000
004500         10  PC060-BC-PICKER-BARCODE     PIC  X(08).              00450000
004600         10  PC060-BC-PICKER-NAME        PIC  X(08).              00460000
004700         10  FILLER                      PIC  X(29).              00470003
004800                                                                  00480000
