000100***************************************************************** 00010017
000200* PCWS157 - CARTON LABEL RECORD - using sockets                 * 00020000
000300*                                                               * 00030000
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040000
000500*                    I M P O R T A N T                          * 00050000
000600* The label commands are strung together under only 4-05 levels * 00060000
000700* Each label command is separated by an end of text char-hex 03 * 00070000
000800* This was done to try to speed up transmission via new socket  * 00080000
000900* interface.  Systec's software separates 05 levels into        * 00090000
001000* statements.  The maximum length is 240.                       * 00100000
001100***************************************************************** 00110000
001200 01  PC157-CARTON-LABEL-DATA-MAX-LN        PIC 9(03) VALUE  4.    00120007
001300***                                                               00130000
001400**                                NUMBER OF 05 LEVELS -----/\     00140000
001500***                                                               00150000
001600***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00160000
001700***               IN PC157-DEST-LBL-LENGTH.                       00170000
001800***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00180000
001900***                                                               00190000
002000***************************************************************** 00200000
002100 01  PC157-CARTON-LABEL.                                          00210000
002200**************************************************************    00220000
002300*************  START OF 05-LEVEL  ****************************    00230000
002400**************************************************************    00240000
002500     05  FILLER.                                                  00250000
002600* c0000 - Continuous paper length - 0000 = normal operation       00260000
002700         10  FILLER                  PIC X(06)    VALUE           00270000
002800             'c0000'.                                            00280000
002900         10  FILLER                  PIC X(01)    VALUE  ''.     00290000
003000* e     - Select edge sensor - DEFAULT                            00300000
003100         10  FILLER                  PIC X(02)    VALUE           00310000
003200             'e'.                                                00320000
003300         10  FILLER                  PIC X(01)    VALUE  ''.     00330000
003400* M1025 - Maximum label length                                    00340000
003500         10  FILLER                  PIC X(06)    VALUE           00350000
003600             'M1025'.                                            00360000
003700         10  FILLER                  PIC X(01)    VALUE  ''.     00370000
003800*  Replaced a command with KcFMN to disable the feedback char     00380019
003900*  dmh 8/9/17                                                     00390019
004000* KcFMN - disable feedback characters to be transmitted (6)       00400019
004010         10  FILLER                  PIC X(06)    VALUE           00401019
004020             'KcFMN'.                                            00402019
004100         10  FILLER                  PIC X(01)    VALUE  ''.     00410000
004200* s     - Set up for 1 dot buffer                                 00420000
004300         10  FILLER                  PIC X(02)    VALUE           00430000
004400             's'.                                                00440000
004500         10  FILLER                  PIC X(01)    VALUE  ''.     00450000
004600* O0110 - Set form edge offset - 0110 = zero setting              00460000
004700         10  FILLER                  PIC X(06)    VALUE           00470000
004800             'O0110'.                                            00480000
004900         10  FILLER                  PIC X(01)    VALUE  ''.     00490000
005000* L     - Enter label formatting command input mode               00500000
005100         10  FILLER                  PIC X(02)    VALUE           00510000
005200             'L'.                                                00520000
005300         10  FILLER                  PIC X(01)    VALUE  ''.     00530000
005400* D11   - Set dot size - Horizontal(1) Vertical(1)                00540000
005500         10  FILLER                  PIC X(03)    VALUE           00550000
005600             'D11'.                                               00560000
005700         10  FILLER                  PIC X(01)    VALUE  ''.     00570000
005800* H     - Heat level indicator                                    00580000
005900         10  PC157-HEAT-LEVEL        PIC X(03)    VALUE           00590000
006000             'H10'.                                               00600000
006100         10  FILLER                  PIC X(01)    VALUE  ''.     00610000
006200* PK    - Max speed for print cycle - K=default (6 in.per sec)    00620000
006300         10  FILLER                  PIC X(02)    VALUE           00630000
006400             'PK'.                                                00640000
006500         10  FILLER                  PIC X(01)    VALUE  ''.     00650000
006600* SK    - Max slew rate speed - K= default (6 in.per sec)         00660000
006700         10  FILLER                  PIC X(02)    VALUE           00670000
006800             'SK'.                                                00680000
006900         10  FILLER                  PIC X(01)    VALUE  ''.     00690000
007000* Q#### - QUANTITY OF LABELS TO BE PRINTED                        00700000
007100         10  FILLER                  PIC X(01)    VALUE           00710000
007200             'Q'.                                                 00720000
007300         10  PC157-QTY-TOT-LBLS      PIC X(04)    VALUE  SPACES.  00730011
007400         10  FILLER                  PIC X(01)    VALUE  ''.     00740000
007500         10  FILLER                  PIC X(183)   VALUE  SPACES.  00750019
007600**************************************************************    00760000
007700*************  START OF 05-LEVEL  ****************************    00770000
007800**************************************************************    00780000
007900     05  FILLER.                                                  00790000
008000* Barcode                                                         00800002
008100         10  FILLER                  PIC X(16)    VALUE           00810000
008200             '3e4410003620352C'.                                  00820000
008300         10  FILLER                  PIC X(01)    VALUE           00830000
008400             '0'.                                                 00840000
008500         10  PC157-BC-DIVERT-CODE      PIC X(04)  VALUE  SPACES.  00850002
008600         10  PC157-BC-PO-NBR           PIC X(08)  VALUE  SPACES.  00860002
008700         10  PC157-BC-RECV-SEQ-NBR     PIC X(02)  VALUE  SPACES.  00870002
008800         10  PC157-BC-PO-LNE-NBR       PIC X(03)  VALUE  SPACES.  00880002
008900         10  PC157-BC-START-CARTON-CNT PIC X(04)  VALUE  SPACES.  00890002
008910         10  FILLER                  PIC X(01)    VALUE  ''.     00891002
008920* MAKE LAST ENTERED FIELD INCREMENTING                            00892002
009300         10  FILLER                  PIC X(03)    VALUE           00930000
009400             '+01'.                                               00940000
009410         10  FILLER                  PIC X(01)    VALUE  ''.     00941002
009420* # BELOW BARCODE                                                 00942002
009800         10  FILLER                  PIC X(15)    VALUE           00980000
009900             '302200003730273'.                                   00990000
010000         10  FILLER                  PIC X(01)    VALUE           01000000
010100             '0'.                                                 01010000
010200         10  PC157-DIVERT-CODE       PIC X(04)    VALUE  SPACES.  01020002
010300         10  PC157-PO-NBR-X          PIC X(08)    VALUE  SPACES.  01030002
010400         10  PC157-RECV-SEQ-NBR-X    PIC X(02)    VALUE  SPACES.  01040005
010500         10  PC157-PO-LNE-NBR-X      PIC X(03)    VALUE  SPACES.  01050005
010600         10  PC157-START-CARTON-CNT  PIC X(04)    VALUE  SPACES.  01060002
010610         10  FILLER                  PIC X(01)    VALUE  ''.     01061002
011000         10  FILLER                  PIC X(03)    VALUE           01100000
011100             '+01'.                                               01110000
011110         10  FILLER                  PIC X(01)    VALUE  ''.     01111002
011120* 'CARTON LABEL' LITERAL ON SIDE OF LABEL                         01112002
011500         10  FILLER                  PIC X(29)    VALUE           01150000
011600             '102200000110310  Carton Label'.                     01160002
011610         10  FILLER                  PIC X(01)    VALUE  ''.     01161002
011620* OF START CARTON #                                               01162002
012000         10  FILLER                  PIC X(15)    VALUE           01200000
012100             '291101002180318'.                                   01210000
012200         10  PC157-START-CNTN-NBR    PIC X(04)    VALUE ZEROS.    01220013
012400         10  FILLER                  PIC X(01)    VALUE  ''.     01240002
012500* MAKE LAST ENTERED FIELD INCREMENTING                            01250002
012800         10  FILLER                  PIC X(03)    VALUE           01280000
012900             '+ 1'.                                               01290014
012910         10  FILLER                  PIC X(01)    VALUE  ''.     01291002
012920* PRINTER ID                                                      01292002
013300         10  FILLER                  PIC X(24)    VALUE           01330004
013400             '102200000110028Printer #'.                          01340004
013500         10  PC157-PRINTER-NBR       PIC X(06)    VALUE SPACES.   01350002
013610         10  FILLER                  PIC X(01)    VALUE  ''.     01361002
013620* LABEL PRINT DATE                                                01362002
013630         10  FILLER                  PIC X(15)    VALUE           01363002
013640             '102200000110180'.                                   01364009
013650         10  PC157-LBL-PRT-DATE      PIC X(08)    VALUE           01365002
013651             '@@@@@@@@'.                                          01365102
013660         10  FILLER                  PIC X(01)    VALUE  ''.     01366002
013670* LABEL PRINT TIME                                                01367002
013680         10  FILLER                  PIC X(15)    VALUE           01368002
013690             '102200000110235'.                                   01369009
013700         10  PC157-LBL-PRT-TIME      PIC X(06)    VALUE           01370002
013710             '@@@@@@'.                                            01371002
013720         10  FILLER                  PIC X(01)    VALUE  ''.     01372002
013721         10  FILLER                  PIC X(24)    VALUE  SPACES.  01372108
013730**************************************************************    01373002
013740*************  START OF 05-LEVEL  ****************************    01374002
013750**************************************************************    01375002
013800     05  FILLER.                                                  01380000
013810* P.O. #                                                          01381002
014000         10  FILLER                  PIC X(21)    VALUE           01400000
014100             '291100602250205P.O.: '.                             01410000
014200         10  PC157-PO-NBR            PIC X(08)    VALUE SPACES.   01420002
014300         10  FILLER                  PIC X(01)    VALUE  ''.     01430002
014400* RCVR SEQ                                                        01440002
014700         10  FILLER                  PIC X(26)    VALUE           01470002
014800             '291100602250176SEQ:       '.                        01480002
015000         10  PC157-RECV-SEQ-NBR      PIC X(03)    VALUE  SPACES.  01500002
015100         10  FILLER                  PIC X(01)    VALUE  ''.     01510002
015200* P.O. LINE                                                       01520002
015500         10  FILLER                  PIC X(25)    VALUE           01550002
015600             '291100602250146LINE:     '.                         01560002
015800         10  PC157-PO-LNE-NBR        PIC X(04)    VALUE  SPACES.  01580002
015900         10  FILLER                  PIC X(01)    VALUE  ''.     01590002
016000* PROCESS AREA                                                    01600002
016300         10  FILLER                  PIC X(15)    VALUE           01630000
016400             '291200902450002'.                                   01640000
016500         10  PC157-PROCESS-AREA      PIC X(06)    VALUE SPACES.   01650002
016600         10  FILLER                  PIC X(01)    VALUE  ''.     01660002
016700* RECEIVED DATE                                                   01670002
017100         10  FILLER                  PIC X(20)    VALUE           01710000
017200             '291100602250248RCVD '.                              01720000
017300         10  PC157-RCVD-DTE          PIC X(08)    VALUE  SPACES.  01730002
017400         10  FILLER                  PIC X(01)    VALUE  ''.     01740002
017500* OF                                                              01750002
017800         10  FILLER                  PIC X(17)    VALUE           01780000
017900             '291100601940296OF'.                                 01790000
018000         10  FILLER                  PIC X(01)    VALUE  ''.     01800002
018010* OF END CARTON #                                                 01801002
018300         10  FILLER                  PIC X(15)    VALUE           01830000
018400             '291100601420295'.                                   01840000
018410         10  PC157-END-CNTN-NBR      PIC X(04)    VALUE ZEROS.    01841013
018420         10  FILLER                  PIC X(01)    VALUE  ''.     01842002
018430* SKU #                                                           01843002
019000         10  FILLER                  PIC X(15)    VALUE           01900000
019100             '291100602250115'.                                   01910017
019200         10  PC157-SKU               PIC X(16)    VALUE SPACES.   01920015
019310         10  FILLER                  PIC X(01)    VALUE  ''.     01931002
019320* BOX AROUND RECEIVED DATE                                        01932002
019700         10  FILLER                  PIC X(28)    VALUE           01970000
019800             '1X1100000340239B046211001001'.                      01980000
019810         10  FILLER                  PIC X(01)    VALUE  ''.     01981002
019811*        10  FILLER                  PIC X(06)    VALUE  SPACES.  01981115
019820**************************************************************    01982002
019830*************  START OF 05-LEVEL  ****************************    01983002
019840**************************************************************    01984002
020000     05  FILLER.                                                  02000000
020100* E     - TERMINATE FIELD GENERATION ADN PRINT LABEL              02010002
020200         10  FILLER                  PIC X(02)    VALUE           02020000
020300             'E '.                                                02030000
020400         10  FILLER                  PIC X(01)    VALUE  ''.     02040002
020500* qA    - CLEAR MEMORY MODULE                                     02050002
020700         10  FILLER                  PIC X(03)    VALUE           02070000
020800             'qA'.                                               02080000
020810         10  FILLER                  PIC X(01)    VALUE  ''.     02081002
020900         10  FILLER                  PIC X(233)   VALUE  SPACES.  02090002
021000                                                                  02100000
021100 01  PC157-CARTON-LBL-TABLE REDEFINES                             02110000
021200                               PC157-CARTON-LABEL.                02120000
021300     05  PC157-CARTON-LBL-LINE       OCCURS  4 TIMES              02130002
021400                                     INDEXED BY PC157-IDX         02140000
021500                                     PIC X(240).                  02150000
021600                                                                  02160000
021700*----------------------------------------------------------------*02170000
021800* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *02180000
021900*----------------------------------------------------------------*02190000
022000 01  PC157-CARTON-LBL-LENGTH.                                     02200000
022100     05  FILLER                        PIC 9(03)    VALUE   57.   02210019
022200     05  FILLER                        PIC 9(03)    VALUE  216.   02220008
022300     05  FILLER                        PIC 9(03)    VALUE  240.   02230016
022500     05  FILLER                        PIC 9(03)    VALUE    7.   02250000
022600                                                                  02260000
022700 01  PC157-CARTON-LBL-LNGTH-VALUES REDEFINES                      02270000
022800                                    PC157-CARTON-LBL-LENGTH.      02280000
022900     05  PC157-CART-LINE-LENGTH       OCCURS 4 TIMES              02290006
023000                                      INDEXED BY PC157-IDX-2      02300003
023100                                      PIC 9(03).                  02310000
