000001***************************************************************** 00000100
000002* PCWS190 - MISCELLANEOUS DC LABEL WITH 12 CHARACTER 3 OF 9     * 00000201
000003*           barcode (FORM RECORD)                               * 00000300
000004* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00000400
000005*                    I M P O R T A N T                          * 00000500
000006* The label commands are strung together under only 4-05 levels * 00000600
000007* Each label command is separated by an end of text char-hex 03 * 00000700
000008* This was done to try to speed up transmission via new socket  * 00000800
000009* interface.  Systec's software separates 05 levels into        * 00000900
000010* statements.  The maximum length is 240.                       * 00001000
000011***************************************************************** 00001100
000012 01  PC190-DC-MISC-LBL-MAX-LN        PIC 9(03)    VALUE   4.      00001201
000013***                                                               00001300
000014***    NUMBER OF 05 LEVELS ------------------------------/\       00001400
000015***                                                               00001500
000016***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00001600
000017***               IN PC190-MISC-FORM-LENGTH.                      00001701
000018***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00001800
000019***                                                               00001900
000020***************************************************************** 00002000
000021 01  PC190-DC-MISC-LBL.                                           00002101
000022*                                                                 00002200
000023*** label information - line 1                                    00002300
000024*                                                                 00002400
000025     05  FILLER.                                                  00002500
000026* c0000 - Continuous paper length - 0000 = normal operation       00002600
000027         10  FILLER                  PIC X(06)    VALUE           00002700
000028             'c0000'.                                            00002800
000029         10  FILLER                  PIC X(01)    VALUE  ''.     00002900
000030* e     - Select edge sensor - DEFAULT                            00003000
000031         10  FILLER                  PIC X(02)    VALUE           00003100
000032             'e'.                                                00003200
000033         10  FILLER                  PIC X(01)    VALUE  ''.     00003300
000034* M1030 - Maximum label length                                    00003400
000035         10  FILLER                  PIC X(06)    VALUE           00003500
000036             'M1030'.                                            00003600
000037         10  FILLER                  PIC X(01)    VALUE  ''.     00003700
000038*  Replaced a command with KcFMN to disable the feedback char     00003814
000039*  dmh 8/9/17                                                     00003914
000040* KcFMN - disable feedback characters to be transmitted (6)       00004014
000041         10  FILLER                  PIC X(06)    VALUE           00004114
000042             'KcFMN'.                                            00004214
000043         10  FILLER                  PIC X(01)    VALUE  ''.     00004300
000044* s     - Set up for 1 dot buffer                                 00004400
000045         10  FILLER                  PIC X(02)    VALUE           00004500
000046             's'.                                                00004600
000047         10  FILLER                  PIC X(01)    VALUE  ''.     00004700
000048* O0110 - Set form edge offset - 0110 = zero setting              00004800
000049         10  FILLER                  PIC X(06)    VALUE           00004900
000050             'O0110'.                                            00005000
000051         10  FILLER                  PIC X(01)    VALUE  ''.     00005100
000052* qA    - Clear memory module - A=upper slot                      00005200
000053         10  FILLER                  PIC X(03)    VALUE           00005300
000054             'qA'.                                               00005400
000055         10  FILLER                  PIC X(01)    VALUE  ''.     00005500
000056* L     - enter label formatting command input mode               00005600
000057         10  FILLER                  PIC X(02)    VALUE           00005700
000058             'L'.                                                00005800
000059         10  FILLER                  PIC X(01)    VALUE  ''.     00005900
000060* D11   - Set dot size - Horizontal(1) Vertical(1)                00006000
000061         10  FILLER                  PIC X(03)    VALUE           00006100
000062             'D11'.                                               00006200
000063         10  FILLER                  PIC X(01)    VALUE  ''.     00006300
000064* H11   - Heat setting for label                                  00006400
000065         10  FILLER                  PIC X(03)    VALUE           00006500
000066             'H11'.                                               00006600
000067         10  FILLER                  PIC X(01)    VALUE  ''.     00006700
000068* PK    - Max speed for print cycle - K=default (6 in.per sec)    00006800
000069         10  FILLER                  PIC X(02)    VALUE           00006900
000070             'PK'.                                                00007000
000071         10  FILLER                  PIC X(01)    VALUE  ''.     00007100
000072* SK    - Max slew rate speed - K= default (6 in.per sec)         00007200
000073         10  FILLER                  PIC X(02)    VALUE           00007300
000074             'SK'.                                                00007400
000075         10  FILLER                  PIC X(01)    VALUE  ''.     00007500
000076         10  FILLER                  PIC X(185)   VALUE  SPACES.  00007614
000077*                                                                 00007700
000078*                                                                 00007800
000079*** label information - line 2                                    00007900
000080*                                                                 00008000
000081     05  FILLER.                                                  00008100
000082*  Description line 1 (U01)                                       00008200
000083         10  FILLER                  PIC X(15)    VALUE           00008300
000084             '341100500700360'.                                   00008400
000085         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00008500
000086         10  FILLER                  PIC X(01)    VALUE  ''.     00008600
000087*  Description line 2 (U02)                                       00008700
000088         10  FILLER                  PIC X(15)    VALUE           00008800
000089             '341100500950360'.                                   00008900
000090         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00009000
000091         10  FILLER                  PIC X(01)    VALUE  ''.     00009100
000092*  Description line 3 (U03)                                       00009200
000093         10  FILLER                  PIC X(15)    VALUE           00009300
000094             '341100501200360'.                                   00009400
000095         10  FILLER                  PIC X(30)    VALUE ALL '@'.  00009500
000096         10  FILLER                  PIC X(01)    VALUE  ''.     00009600
000097*  # TEXT  QUALIFIER(U04)                                         00009713
000098         10  FILLER                  PIC X(15)    VALUE           00009800
000099             '342501002540375'.                                   00009913
000100*            '341101002540300'.                                   00010005
000101         10  FILLER                  PIC X(20)    VALUE ALL '@'.  00010103
000102         10  FILLER                  PIC X(01)    VALUE  ''.     00010203
000103* 3 of 9 Barcode across bottom of label (U05)                     00010303
000110*        10  FILLER                  PIC X(15)    VALUE           00011001
000111*            '3A8209003500360'.                                   00011101
000112*        10  PC190-3OF9-BC           PIC X(13)    VALUE SPACES.   00011201
000113***      10  FILLER                  PIC X(12)    VALUE ALL '@'.  00011300
000114***      10  FILLER                  PIC X(01)    VALUE  ''.     00011400
000115*  Dummy line (U06)                                               00011500
000116         10  FILLER                  PIC X(15)    VALUE           00011600
000117             '341100500100360'.                                   00011700
000118         10  FILLER                  PIC X(05)    VALUE all '@'.  00011800
000119         10  FILLER                  PIC X(01)    VALUE  ''.     00011900
000120         10  FILLER                  PIC X(45)    VALUE SPACES.   00012001
000130*                                                                 00013000
000140*                                                                 00014000
000141*** label information - line 3                                    00014100
000142*                                                                 00014200
000143     05  FILLER.                                                  00014300
000144* Printer # - line                                                00014400
000145         10  FILLER                  PIC X(21)    VALUE           00014500
000146             '302200003910385PRTR #'.                             00014600
000147         10  FILLER                  PIC X(01)    VALUE  ''.     00014700
000148* Printer # - field                                               00014800
000149         10  FILLER                  PIC X(15)    VALUE           00014900
000150             '302200003910345'.                                   00015000
000151         10  PC190-PRTR-NBR          PIC X(06)    VALUE           00015101
000152             'DC-307'.                                            00015200
000153         10  FILLER                  PIC X(01)    VALUE  ''.     00015300
000154* User ID                                                         00015400
000155         10  FILLER                  PIC X(15)    VALUE           00015500
000156             '302200003910290'.                                   00015600
000157         10  PC190-USER-ID           PIC X(08)    VALUE SPACES.   00015701
000158         10  FILLER                  PIC X(01)    VALUE  ''.     00015800
000159* label print date                                                00015900
000160         10  FILLER                  PIC X(15)    VALUE           00016000
000161             '302200003910220'.                                   00016100
000162         10  PC190-LBL-PRT-DATE      PIC X(08)    VALUE           00016201
000163             'MM-DD-YY'.                                          00016300
000164         10  FILLER                  PIC X(01)    VALUE  ''.     00016400
000165*  label print time                                               00016500
000166         10  FILLER                  PIC X(15)    VALUE           00016600
000167             '302200003910165'.                                   00016700
000168         10  PC190-LBL-PRT-TIME      PIC X(05)    VALUE           00016801
000169             'HH:MM'.                                             00016900
000170         10  FILLER                  PIC X(01)    VALUE  ''.     00017000
000171* label description line (U08)                                    00017100
000172         10  FILLER                  PIC X(15)    VALUE           00017200
000173             '302200003910120'.                                   00017300
000174         10  PC190-LBL-DESC          PIC X(11)    VALUE           00017401
000175             'DC-MISC LBL'.                                       00017500
000176         10  FILLER                  PIC X(01)    VALUE  ''.     00017600
000177* separater bar across center of label                            00017700
000178         10  FILLER                  PIC X(22)    VALUE           00017800
000179             '1x1100001750025L350003'.                            00017900
000180         10  FILLER                  PIC X(01)    VALUE  ''.     00018000
000190         10  FILLER                  PIC X(77)    VALUE  SPACES.  00019000
000200*                                                                 00020000
000300*                                                                 00030000
000310***** label information - line 4                                  00031000
000320*                                                                 00032000
000330*                                                                 00033000
000340*                                                                 00034000
000350* X     - Terminate field generation                              00035000
000351*                                                                 00035100
000352*                                                                 00035200
000353     05  FILLER.                                                  00035300
000354         10  FILLER                  PIC X(02)    VALUE           00035400
000355             'X '.                                                00035500
000356         10  FILLER                  PIC X(01)    VALUE  ''.     00035600
000357         10  FILLER                  PIC X(237)   VALUE  SPACES.  00035700
000358                                                                  00035800
000359                                                                  00035900
000360 01  PC190-DC-MISC-LBL-TABLE         REDEFINES                    00036001
000361     PC190-DC-MISC-LBL.                                           00036101
000362     05  PC190-DC-MISC-LBL-LINE      OCCURS  4 TIMES              00036201
000363                                     INDEXED BY PC190-IDX         00036301
000364                                     PIC X(240).                  00036400
000365                                                                  00036500
000366*----------------------------------------------------------------*00036600
000367* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00036700
000368*----------------------------------------------------------------*00036800
000369 01  PC190-MISC-FORM-LENGTH.                                      00036901
000370     05  FILLER                        PIC 9(03)    VALUE   55.   00037014
000371     05  FILLER                        PIC 9(03)    VALUE  195.   00037101
000372     05  FILLER                        PIC 9(03)    VALUE  163.   00037200
000373     05  FILLER                        PIC 9(03)    VALUE    3.   00037300
000374                                                                  00037400
000375 01  PC190-MISC-FORM-LNGTH-VALUES REDEFINES                       00037501
000376                                  PC190-MISC-FORM-LENGTH.         00037601
000377     05  PC190-MISC-FORM-LINE-LENGTH  OCCURS 4 TIMES              00037701
000378                                      INDEXED BY PC190-IDX-2      00037801
000379                                      PIC 9(03).                  00037900
000380                                                                  00038000
