000100****************************************************************  00010002
000200*                        PCWS034                               *  00020002
000300*                                                              *  00030002
000400*  THIS IS THE COPYBOOK MEMBER THAT WILL CONTAIN THE MESSAGES  *  00040002
000500*  USED IN THE MANIFESTING RF SYSTEM                              00050002
000600****************************************************************  00060002
000700 01  PC034-PGM-MSG-DATA.                                          00070002
000800     05  PC034-PRESS-ENTER-MSG           PIC  X(19)  VALUE        00080002
000900         'PRESS ENTER TO CONT'.                                   00090002
001000     05  PC034-DB2-FATAL-ERROR-MSG       PIC  X(19)  VALUE        00100002
001100         'DB2 ERR/HELP DESK  '.                                   00110002
001200     05  PC034-TRANS-NOT-AVAILABLE-MSG   PIC  X(19)  VALUE        00120002
001300         'TRANS NOT AVAILABLE'.                                   00130002
001400     05  PC034-CICS-FATAL-ERROR-MSG      PIC  X(19)  VALUE        00140002
001500         'CICS ERR/HELP DESK '.                                   00150002
001600     05  PC034-UNRECOGNIZED-PF-KEY-MSG   PIC  X(19)  VALUE        00160002
001700         'UNRECOGNIZED PF KEY'.                                   00170002
001800     05  PC034-SYSTEM-ERROR-MSG          PIC  X(19)  VALUE        00180002
001900         'SYSTEM ERR/HELP DES'.                                   00190002
002000     05  PC034-NUMERIC-VALUE-REQ-MSG     PIC X(19)  VALUE         00200002
002100         'NUMERIC VALUE REQ. '.                                   00210002
002200     05  PC034-INVALID-SELECTION-MSG     PIC  X(19)  VALUE        00220002
002300         'INVALID SELECTION  '.                                   00230002
002400     05  PC034-DB2-ACCESS-ERROR-MSG      PIC  X(19)  VALUE        00240002
002500         'DB2 ACCESS ERROR   '.                                   00250002
002600     05  PC034-DUNNS-NBR-MISSING-MSG     PIC X(19)  VALUE         00260002
002700         'DUNS # INFO MISSING'.                                   00270002
002800     05  PC034-NOT-A-DC-MSG              PIC  X(19)  VALUE        00280002
002900         'NOT A VALID DC     '.                                   00290002
003000     05  PC034-UPC-NOT-FOUND-MSG         PIC  X(19)  VALUE        00300002
003100         'UPC DOES NOT EXIST '.                                   00310002
003200     05  PC034-UPC-NOT-VALID-MSG         PIC  X(19)  VALUE        00320002
003300         'UPC NOT VALID      '.                                   00330002
003400     05  PC034-UPC-NOT-ASSOC-TO-SKU-MSG  PIC  X(19)  VALUE        00340002
003500         'UPC NOT ASSOC 2 SKU'.                                   00350002
003600     05  PC034-UPC-NOT-NUMERIC-MSG       PIC  X(19)  VALUE        00360002
003700         'UPC NOT NUMERIC    '.                                   00370002
003800     05  PC034-SKU-NOT-NUMERIC-MSG       PIC  X(19)  VALUE        00380002
003900         'SKU NOT NUMERIC    '.                                   00390002
004000     05  PC034-SKU-NOT-VALID-MSG         PIC  X(19)  VALUE        00400002
004100         'SKU NOT VALID      '.                                   00410002
004200     05  PC034-NO-VNDR-NAME-FOUND-MSG    PIC  X(19)  VALUE        00420002
004300         'NO VNDR NAME FOUND '.                                   00430002
004400     05  PC034-ENTER-THROUGH-MENU-MSG    PIC  X(19)  VALUE        00440002
004500         'ENTER THROUGH MENU '.                                   00450002
004600     05  PC034-NO-BYR-NME-FOUND-MSG      PIC  X(19)  VALUE        00460002
004700         'NO BUYER NAME FOUND'.                                   00470002
004800     05  PC034-ACCESS-DENIED-MSG         PIC  X(19)  VALUE        00480002
004900         'USER NOT AUTHORIZED'.                                   00490002
005000     05  PC034-CICS-AUTH-ERROR-MSG       PIC  X(19)  VALUE        00500002
005100         'CICSAUTH BAD RETURN'.                                   00510002
005200     05  PC034-ONLY-ONE-SELECTION-MSG    PIC  X(19)  VALUE        00520002
005300         'SELECT ONLY ONE    '.                                   00530002
005400     05  PC034-AUDIT-NOT-FOUND-MSG       PIC  X(19)  VALUE        00540002
005500         'AUDIT NBR NOT FOUND'.                                   00550002
005600     05  PC034-PF2-CONTINUE-MSG          PIC  X(19)  VALUE        00560002
005700         'UPD COMPLT F2-CONT '.                                   00570002
005800     05  PC034-INVALID-PRINTER-ID-MSG    PIC  X(19)  VALUE        00580002
005900         'INVALID PRINTER ID '.                                   00590002
006000     05  PC034-PRINTER-ID-REQUIRED-MSG   PIC  X(19)  VALUE        00600002
006100         'PRINTER ID REQUIRED'.                                   00610002
006200     05  PC034-RPT-PRINTED-MSG           PIC  X(19)  VALUE        00620002
006300         'REPORT PRINTED     '.                                   00630002
006400     05  PC034-SELECT-TYPE-MSG           PIC  X(19)  VALUE        00640002
006500         'SELECT AUDIT TYPE  '.                                   00650002
006600     05  PC034-ALREADY-CLOSED-MSG        PIC  X(19)  VALUE        00660002
006700         'ALREADY CLOSED     '.                                   00670002
006800     05  PC034-ALREADY-POSTPONED-MSG     PIC  X(19)  VALUE        00680002
006900         'ALREADY POSTPONED  '.                                   00690002
007000     05  PC034-AUDIT-CLOSE-MSG           PIC  X(19)  VALUE        00700002
007100         'AUDIT CLOSED       '.                                   00710002
007200     05  PC034-SHIP-UNIT-CLOSE-MSG       PIC  X(19)  VALUE        00720002
007300         'CARTON CLOSED      '.                                   00730002
007400     05  PC034-SHIP-UNIT-POSTPONED-MSG   PIC  X(19)  VALUE        00740002
007500         'CARTON POSTPONED   '.                                   00750002
007600     05  PC034-CONFIRM-RESTART-MSG       PIC  X(19)  VALUE        00760002
007700         'F2 - RESTART CARTON'.                                   00770002
007800     05  PC034-CANCEL-RESTART-MSG        PIC  X(19)  VALUE        00780002
007900         'RESTART CANCELED   '.                                   00790002
008000     05  PC034-CONFIRM-CLOSE-MSG         PIC  X(19)  VALUE        00800002
008100         'F2 TO CLOSE AUDIT  '.                                   00810002
008200     05  PC034-UPC-REQUIRED-MSG          PIC  X(19)  VALUE        00820002
008300         'UPC REQUIRED       '.                                   00830002
008400     05  PC034-ERROR-EXISTS-MSG          PIC  X(19)  VALUE        00840002
008500         'AUDIT ERROR EXISTS '.                                   00850002
008600     05  PC034-AUDIT-POSTPONED-MSG       PIC  X(19)  VALUE        00860002
008700         'AUDIT IS POSTPONED '.                                   00870002
008800     05  PC034-NO-PRINT-MSG              PIC  X(19)  VALUE        00880002
008900         'NO PRINT/HELP DESK '.                                   00890002
009000     05  PC034-OPEN-CARTON-MSG.                                   00900002
009100         10  PC034-CTN-COUNT             PIC ZZ9.                 00910002
009200         10  FILLER                      PIC X(16)   VALUE        00920002
009300         ' CTNS STILL OPEN'.                                      00930002
009400     05  PC034-F3-NOT-VALID-MSG          PIC  X(19)  VALUE        00940002
009500         'F3 - NOT VALID     '.                                   00950002
009600     05  PC034-CREATE-CNTL-NBR-MSG       PIC  X(19)  VALUE        00960002
009700         'CREATE NEW CNTL NBR'.                                   00970002
009800     05  PC034-CONFIRM-CONT-MSG          PIC  X(19)  VALUE        00980002
009900         'F2 TO CONFIRM CONT.'.                                   00990002
010000     05  PC034-ALREADY-ADD-MSG           PIC  X(19)  VALUE        01000002
010100         'ALREADY ADDED      '.                                   01010002
010200     05  PC034-CART-ID-REQ-MSG           PIC  X(19)  VALUE        01020002
010300         'SERIAL SHIP REQUIRD'.                                   01030002
010400     05  PC034-PO-NBR-REQ-MSG            PIC  X(19)  VALUE        01040002
010500         'PO NUMBER REQUIRED '.                                   01050002
010600     05  PC034-ERR-LOGGED-MSG            PIC  X(19)  VALUE        01060002
010700         'EXP ALREADY LOGGED '.                                   01070002
010800     05  PC034-NO-TAG-LOGGED-MSG         PIC  X(19)  VALUE        01080002
010900         'NO TAG EXP CREATED '.                                   01090002
011000     05  PC034-PLS-ENT-FLD-MSG           PIC  X(19)  VALUE        01100002
011100         'PLEASE ENTER FIELD '.                                   01110002
011200     05  PC034-FIRST-1-NOT-0-MSG         PIC  X(19)  VALUE        01120002
011300         'FIRST DIGIT NOT 0  '.                                   01130002
011400     05  PC034-MORE-DIGITS-REQD          PIC  X(19)  VALUE        01140002
011500         'MORE DIGITS REQUIRD'.                                   01150002
011600     05  PC034-MUST-BE-GT-0-MSG          PIC  X(19)  VALUE        01160002
011700         'MUST BE > ZERO     '.                                   01170002
011800     05  PC034-INVALID-CK-DIGIT          PIC  X(19)  VALUE        01180002
011900         'INVALID CHECK DIGIT'.                                   01190002
012000     05  PC034-INVALID-CRTN-ID           PIC  X(19)  VALUE        01200002
012100         'INVALID CARTON ID  '.                                   01210002
012200     05  PC034-F4-TO-BUILD-MSG           PIC  X(19)  VALUE        01220002
012300         'F4 TO BUILD CARTON '.                                   01230002
012400     05  PC034-INVLD-TRLR-STAT-MSG       PIC  X(19)  VALUE        01240002
012500         'INVALID TRLR STATUS'.                                   01250002
012600     05  PC034-DC-FOR-FUNCTION-MSG       PIC  X(19)  VALUE        01260002
012700         'INVALID FUNCTION   '.                                   01270002
012800     05  PC034-CRTN-NOT-CKED-IN-MSG       PIC  X(19)  VALUE       01280002
012900         'CRTN NOT CHECKED IN'.                                   01290002
013000     05  PC034-LABEL-RECLAIMED-MSG        PIC  X(19)  VALUE       01300002
013100         'LABEL RECLAIMED    '.                                   01310002
013200     05  PC034-VERFD-LINES-EXIST-MSG      PIC  X(19)  VALUE       01320003
013300         'LINES IN CRTN VERFD'.                                   01330003
013400     05  PC034-DIV-INACT-SMO-CTN-MSG      PIC  X(19)  VALUE       01340004
013500         'DIVRT INACT SMO CTN'.                                   01350004
