000100******************************************************************00010000
000200* PCWS264 - 100 CHAR                                             *00020001
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    PCC UPLOADED OF LABOR DATA                                  *00040000
000500*    BOX CLOSED                                                  *00050000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  PC264-UPLOAD-ERROR-RECORD.                                   00080001
000900     05  PC264-LBL-REQ-TYPE              PIC X(03) VALUE SPACE.   00090001
001000         88  PC264-SML-SINGLE-STORE                VALUE 'SMS'.   00100001
001100         88  PC264-SML-ALL-STORES                  VALUE 'SMD'.   00110001
001200                                                                  00120000
001300     05  FILLER                          PIC  X(01).              00130000
001400     05  PC264-USER-ID                   PIC  X(08).              00140001
001500     05  FILLER                          PIC  X(01).              00150000
001600     05  PC264-STR-NBR                   PIC  9(04).              00160001
001610     05  FILLER                          PIC  X(01).              00161000
001611     05  PC264-PRTR-ID                   PIC  X(03).              00161101
001612     05  FILLER                          PIC  X(01).              00161200
001613     05  PC264-NO-OF-LBLS                PIC  9(04).              00161301
001614     05  FILLER                          PIC  X(01).              00161400
001615     05  PC264-START-MFST-NBR            PIC  9(08).              00161501
001616     05  FILLER                          PIC  X(01).              00161600
001680     05  PC264-OPER                      PIC  9(04).              00168001
001690     05  FILLER                          PIC  X(01).              00169000
001700     05  PC264-PRC-TMST                  PIC  X(26).              00170001
001800     05  FILLER                          PIC  X(33).              00180002
001900                                                                  00190000
