000010***************************************************************** 00001000
000020* PCWS255 - check-in SML - Form                                 * 00002000
000030* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00003000
000040*  this is the layout for the FORM for the SML label used in    * 00004001
000050*  the check-in application when a batch printer is selected    * 00005002
000060*                                                               * 00006002
000070* IT MUST BE PRECEED THE DATA RECORDS DESCRIBED IN PCWS171.     * 00007002
000080*                                                               * 00008002
000090*  IMPORTANT - If line lengths change be sure to update length  * 00009002
000100*              in PC255-DTL-LBL-FORM-LENGTH                     * 00010002
000200*              ALSO if lines are added                          * 00020002
000300* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00030002
000400*                    I M P O R T A N T                          * 00040002
000500* The label commands are strung together under only 6-05 levels * 00050002
000600* Each label command is separated by an end Mf text char-hex 03 * 00060002
000700* This was done to try to speed up transmission via new socket  * 00070002
000800* interface.  Systec's software separates 05 levels into        * 00080002
000900* statements.  The maximum length is 240.                       * 00090002
001000***************************************************************** 00100002
001100 01  PC255-SML-BATCH-LBL-MAX-LN      PIC 9(03)    VALUE  09.      00110002
001200***                                                               00120002
001300***    NUMBER OF 05 LEVELS ------------------------------/\       00130002
001400***                                                               00140002
001500***    THIS NUMBER MUST MATCH THE NUMBER IN THE "OCCURS"          00150002
001600***    CLAUSE FOUND AT THE BOTTOM OF THIS COPYBOOK                00160002
001700***                                                               00170002
001800*-----------------------------------------------------------------00180002
001900***************************************************************** 00190002
002000 01  PC255-SML-BATCH-LBL.                                         00200002
002100***  LINE 1                                                       00210002
002200* c0000 - Continuous paper length - 0000 = normal operation       00220002
002300     05  FILLER.                                                  00230002
002400         10  FILLER                  PIC X(06)    VALUE           00240002
002500             'c0000'.                                            00250002
002600         10  FILLER                  PIC X(01)    VALUE  ''.     00260002
002700* e     - Select edge sensor - DEFAULT                            00270002
002800         10  FILLER                  PIC X(02)    VALUE           00280002
002900             'e'.                                                00290002
003000         10  FILLER                  PIC X(01)    VALUE  ''.     00300002
003100* M1030 - Maximum label length                                    00310002
003200         10  FILLER                  PIC X(06)    VALUE           00320002
003300             'M1030'.                                            00330002
003400         10  FILLER                  PIC X(01)    VALUE  ''.     00340002
003500*  Replaced a command with KcFMN to disable the feedback char     00350002
003600*  dmh 8/9/17                                                     00360002
003700* KcFMN - disable feedback characters to be transmitted (6)       00370002
003710         10  FILLER                  PIC X(06)    VALUE           00371002
003720             'KcFMN'.                                            00372002
003800         10  FILLER                  PIC X(01)    VALUE  ''.     00380002
003900* s     - Set up for 1 dot buffer                                 00390002
004000         10  FILLER                  PIC X(02)    VALUE           00400002
004100             's'.                                                00410002
004200         10  FILLER                  PIC X(01)    VALUE  ''.     00420002
004300* O0110 - Set form edge offset - 0110 = zero setting              00430002
004400         10  FILLER                  PIC X(06)    VALUE           00440002
004500             'O0110'.                                            00450002
004600         10  FILLER                  PIC X(01)    VALUE  ''.     00460002
004700* qA    - Clear memory module - A=upper slot                      00470002
004800         10  FILLER                  PIC X(03)    VALUE           00480002
004900             'qA'.                                               00490002
005000         10  FILLER                  PIC X(01)    VALUE  ''.     00500002
005100* L     - enter label formatting command input mode               00510002
005200         10  FILLER                    PIC X(02)    VALUE         00520002
005300             'L'.                                                00530002
005400         10  FILLER                    PIC X(01)    VALUE  ''.   00540002
005500* D11   - Set dot size - Horizontal(1) Vertical(1)                00550002
005600         10  FILLER                  PIC X(03)    VALUE           00560002
005700             'D11'.                                               00570002
005800         10  FILLER                  PIC X(01)    VALUE  ''.     00580002
005900* H11   - Heat setting for label                                  00590002
006000         10  FILLER                  PIC X(03)    VALUE           00600002
006100             'H11'.                                               00610002
006200         10  FILLER                  PIC X(01)    VALUE  ''.     00620002
006300* PK    - Max speed for print cycle - K=default (6 in.per sec)    00630002
006400         10  FILLER                  PIC X(02)    VALUE           00640002
006500             'PK'.                                                00650002
006600         10  FILLER                  PIC X(01)    VALUE  ''.     00660002
006700* SK    - Max slew rate speed - K= default (6 in.per sec)         00670002
006800         10  FILLER                  PIC X(02)    VALUE           00680002
006900             'SK'.                                                00690002
007000         10  FILLER                  PIC X(01)    VALUE  ''.     00700002
007100         10  FILLER                  PIC X(185)   VALUE SPACES.   00710002
007200*** LINE 2                                                        00720002
007300     05  FILLER.                                                  00730002
007400*                                                                 00740002
007500* CASI audit indicator - top left corner of label (U01)           00750002
007600*                                                                 00760002
007700         10  FILLER                  PIC X(15)    VALUE           00770002
007800                                    '374200600320395'.            00780002
007900         10  PC255-AUDIT-CASI        PIC X(01)    VALUE  '@'.     00790002
008000             88  PC255-AUDIT-COMPLETE             VALUE  SPACE.   00800002
008001             88  PC255-QC-SPOT-AUDIT              VALUE  'Q'.     00800102
008002             88  PC255-UNKNOWN                    VALUE  'U'.     00800202
008003             88  PC255-REWORK                     VALUE  'R'.     00800302
008004             88  PC255-100-PERCENT                VALUE  '%'.     00800402
008005         10  FILLER                  PIC X(01)    VALUE  ''.     00800502
008006*                                                                 00800602
008007*  store number (U02)                                             00800702
008008*                                                                 00800802
008009         10  FILLER                  PIC X(15)    VALUE           00800902
008010             '391200901150125'.                                   00801002
008011         10  FILLER                  PIC X(04)    VALUE  ZEROS.   00801102
008012         10  FILLER                  PIC X(01)    VALUE  ''.     00801202
008013*                                                                 00801302
008014* CRTN: - heading line (U03)                                      00801402
008015*                                                                 00801502
008016         10  FILLER                  PIC X(15)    VALUE           00801602
008017                                    '341100600230325'.            00801702
008018         10  PC255-CRTN-SMTH         PIC X(08)    VALUE  SPACES.  00801802
008019             88 PC255-CRTN-HDG           VALUE 'CRTN:   '.        00801902
008020             88 PC255-SMTH-HDG           VALUE 'PBS-N128'.        00802002
008021         10  FILLER                  PIC X(01)    VALUE  ''.     00802102
008022*                                                                 00802202
008023* CRTN: - data line (U04)                                         00802302
008024*                                                                 00802402
008025         10  FILLER                  PIC X(15)    VALUE           00802502
008026                                    '342100600230275'.            00802602
008027         10  PC255-CARTON-ID         PIC X(05)    VALUE  ZEROS.   00802702
008028         10  FILLER                  PIC X(01)    VALUE  ''.     00802802
008029*                                                                 00802902
008030* DOOR: - heading line (U05)                                      00803002
008031*                                                                 00803102
008032         10  FILLER                  PIC X(15)    VALUE           00803202
008033                                    '331100100150110'.            00803302
008034         10  PC255-DOOR-HDG          PIC X(05)    VALUE '@@@@@'.  00803402
008035             88 PC255-DOOR-HDG-YES                VALUE 'DOOR:'.  00803502
008036             88 PC255-DOOR-HDG-NO                 VALUE '@@@@@'.  00803602
008037         10  FILLER                  PIC X(01)    VALUE  ''.     00803702
008038*                                                                 00803802
008039* DOOR: - data line (U06)                                         00803902
008040*                                                                 00804002
008041         10  FILLER                  PIC X(15)    VALUE           00804102
008042                                    '331100100150065'.            00804202
008043         10  PC255-DOOR-NUMBER       PIC X(05)    VALUE  '@@@@'.  00804302
008044             88 PC255-DOOR-NBR-NO                 VALUE  '@@@@'.  00804402
008045         10  FILLER                  PIC X(01)    VALUE  ''.     00804502
008046*                                                                 00804602
008047* PO: - heading line (U07)                                        00804702
008048*                                                                 00804802
008049         10  FILLER                  PIC X(18)    VALUE           00804902
008050                                    '331100400640310PO:'.         00805002
008051         10  FILLER                  PIC X(01)    VALUE  ''.     00805102
008052*                                                                 00805202
008053* PO/RCVR - data line (U08)                                       00805302
008054*                                                                 00805402
008055         10  FILLER                  PIC X(15)    VALUE           00805502
008056                                    '331100400640265'.            00805602
008057         10  PC255-PO-RCVR-NBR       PIC X(12)    VALUE           00805702
008058                                    'XXXXXXXXXXXX'.               00805802
008059         10  FILLER                  PIC X(01)    VALUE  ''.     00805902
008060*                                                                 00806002
008061* LINE & PACK ID - heading line (U09)                             00806102
008062*                                                                 00806202
008063         10  FILLER                  PIC X(15)    VALUE           00806302
008064                                    '331100400800310'.            00806402
008065         10  PC255-LNE-PCK-HDG       PIC X(05)    VALUE SPACES.   00806502
008066             88 PC255-LINE-HDG                    VALUE 'LINE:'.  00806602
008067             88 PC255-PACK-HDG                    VALUE 'PACK:'.  00806702
008068         10  FILLER                  PIC X(01)    VALUE  ''.     00806802
008069*                                                                 00806902
008070* LINE - data line (U10)                                          00807002
008071*                                                                 00807102
008072         10  FILLER                  PIC X(15)    VALUE           00807202
008073                                    '331100400800265'.            00807302
008074         10  PC255-PO-LNE-NBR        PIC 9(04)    VALUE  ZEROES.  00807402
008075         10  FILLER                  PIC X(01)    VALUE  ''.     00807502
008076         10  FILLER                  PIC X(28)    VALUE SPACES.   00807602
008077*                                                                 00807702
008078*** LINE 3                                                        00807802
008079*                                                                 00807902
008080     05  FILLER.                                                  00808002
008081*                                                                 00808102
008082* SKU: - heading line (U11)                                       00808202
008083*                                                                 00808302
008084         10  FILLER                  PIC X(19)    VALUE           00808402
008085                                    '331100400960310SKU:'.        00808502
008086         10  FILLER                  PIC X(01)    VALUE  ''.     00808602
008087*                                                                 00808702
008088* SKU: - data line (U12)                                          00808802
008089*                                                                 00808902
008090         10  FILLER                  PIC X(15)    VALUE           00809002
008091                                    '331100400960265'.            00809102
008092         10  PC255-SKU-NBR           PIC X(16)    VALUE           00809202
008093                                    '(999-99)99999999'.           00809302
008094         10  FILLER                  PIC X(01)    VALUE  ''.     00809402
008095*                                                                 00809502
008096* STYLE: - heading line (U13)                                     00809602
008097*                                                                 00809702
008098         10  FILLER                  PIC X(21)    VALUE           00809802
008099                                    '331100401120310STYLE:'.      00809902
008100         10  FILLER                  PIC X(01)    VALUE  ''.     00810002
008101*                                                                 00810102
008102* STYLE: - data line (U14)                                        00810202
008103*                                                                 00810302
008104         10  FILLER                  PIC X(15)    VALUE           00810402
008105                                    '331100401120265'.            00810502
008106         10  PC255-STYLE             PIC X(20)    VALUE           00810602
008107                                    'XXXXXXXXXXXXXXXXXXXX'.       00810702
008108         10  FILLER                  PIC X(01)    VALUE  ''.     00810802
008109*                                                                 00810902
008110******************************************************************00811002
008111*   program  should either set the following to PC255-inpk-convy *00811102
008112*   -box if nothing is to be printed                             *00811202
008113*            '1X1100001130150L000000'                            *00811302
008114*   or it should set the following to print a black box          *00811402
008115*            '1X1100001130150L164017'.                           *00811502
008116******************************************************************00811602
008117*                                                                 00811702
008118* inpk cnvy - BOX (U15)                                           00811802
008119*                                                                 00811902
008120         10  PC255-INPK-CONVY-BOX    PIC X(22).                   00812002
008121             88  PC255-FORM-INPK-BOX              VALUE           00812102
008122                                   '1X1100001130150L164017'.      00812202
008123             88  PC255-FORM-NO-INPK-BOX           VALUE           00812302
008124                                   '1X1100001130150L000000'.      00812402
008125         10  FILLER                  PIC X(01)    VALUE  ''.     00812502
008126*                                                                 00812602
008127* OUTER PK UNTS/INPK CNVY UNTS - heading Line (U16)               00812702
008128*                                                                 00812802
008129         10  FILLER                  PIC X(15)    VALUE           00812902
008130                                    '331100401280310'.            00813002
008131         10  PC255-OUTPK-UNTS-HDG    PIC X(15).                   00813102
008132             88  PC255-FORM-NO-UNT-HDG            VALUE           00813202
008133                                    '@@@@@@@@@@@@@@@'.            00813302
008134             88  PC255-FORM-INPK-HDG              VALUE           00813402
008135                                    'INPK CNVY UNTS:'.            00813502
008136         10  FILLER                  PIC X(01)    VALUE  ''.     00813602
008137*                                                                 00813702
008138* OUTER PK UNTS/INPK CNVY UNTS - data Line (U17)                  00813802
008139*                                                                 00813902
008140         10  FILLER                  PIC X(15)    VALUE           00814002
008141                                    '331100401280188'.            00814102
008142         10  PC255-OUTPK-UNTS        PIC 9(04)    VALUE  ZEROES.  00814202
008143         10  FILLER                  PIC X(01)    VALUE  ''.     00814302
008144         10  FILLER                  PIC X(56)    VALUE  SPACES.  00814402
008145*                                                                 00814502
008146*** LINE 4                                                        00814602
008147*                                                                 00814702
008148     05  FILLER.                                                  00814802
008149*                                                                 00814902
008150* Plan-o-Gram Program name (top line inside of box)  (U18)        00815002
008151*                                                                 00815102
008152         10  FILLER                  PIC X(15)    VALUE           00815202
008153                                    '341100402170390'.            00815302
008154         10  PC255-POG-PROGRAM-NAME  PIC X(35)    VALUE           00815402
008155                 '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.           00815502
008156             88  PC255-FORM-NO-POG-NAME           VALUE           00815602
008157                 '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.           00815702
008158         10  FILLER                  PIC X(01)    VALUE  ''.     00815802
008159*                                                                 00815902
008160* STORE ON HAND ZERO MESSAGE (2nd line inside of box) (U19)       00816002
008161* redefines as error-msg-line                                     00816102
008162*                                                                 00816202
008163         10  FILLER                  PIC X(15)    VALUE           00816302
008164                                    '341100402370390'.            00816402
008165         10  PC255-STR-ON-HAND       PIC X(35)    VALUE           00816502
008166             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00816602
008167             88  PC255-FORM-NO-STORE-ON-HAND      VALUE           00816702
008168             '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.               00816802
008169         10  PC255-STR-ERR-REDEF REDEFINES                        00816902
008170             PC255-STR-ON-HAND.                                   00817002
008171             15  PC255-ERROR-MSG-1   PIC X(35).                   00817102
008172         10  FILLER                  PIC X(01)    VALUE  ''.     00817202
008173*                                                                 00817302
008174* SEASONAL SET - heading  (U20)                                   00817402
008175* OR TRIP ID FOR QC AUDIT LABELS                                  00817502
008176*                                                                 00817602
008177         10  FILLER                  PIC X(15)    VALUE           00817702
008178*** 12/02/10 dmh                    '331100401750300'.            00817802
008179                                    '331100401750310'.            00817902
008180         10  FILLER                  PIC X(05).                   00818002
008181             88 PC255-SET-HDG                     VALUE '@@@@@'.  00818102
008182             88 PC255-TRIP-HDG                    VALUE 'TRIP:'.  00818202
008183         10  FILLER                  PIC X(01)    VALUE  ''.     00818302
008184*                                                                 00818402
008185* SEASONAL SET - data (U21)                                       00818502
008186*                                                                 00818602
008187         10  FILLER                  PIC X(15)    VALUE           00818702
008188*** 12/02/10 dmh                    '331100401910300'.            00818802
008189                                    '331100401910310'.            00818902
008190         10  PC255-SET               PIC X(25)    VALUE           00819002
008191                                    '@@@@@@@@@@@@@@@@@@@@@@@@@'.  00819102
008192         10  FILLER                  PIC X(01)    VALUE  ''.     00819202
008193*                                                                 00819302
008194* ZONE - heading (U22) - 1st box left side of label               00819402
008195*                                                                 00819502
008196         10  FILLER                  PIC X(15)    VALUE           00819602
008197                                    '331100400600370'.            00819702
008198         10  FILLER                  PIC X(04).                   00819802
008199             88 PC255-ZONE-HDG                    VALUE 'ZONE'.   00819902
008200             88 PC255-NO-ZONE-HDG                 VALUE '@@@@'.   00820002
008201         10  FILLER                  PIC X(01)    VALUE  ''.     00820102
008202*                                                                 00820202
008203* Zone/Merchandise Group  (U23) - 1st box left side of label      00820302
008204*                                                                 00820402
008205         10  FILLER                  PIC X(15)    VALUE           00820502
008206                                    '332200400900370'.            00820602
008207         10  PC255-MDSE-GROUP        PIC X(02)    VALUE  '@@'.    00820702
008208         10  FILLER                  PIC X(01)    VALUE  ''.     00820802
008209*                                                                 00820902
008210* presentation indicator (24) - 2nd box left side of label        00821002
008211*                                                                 00821102
008212         10  FILLER                  PIC X(15)    VALUE           00821202
008213                                    '332200401370390'.            00821302
008214         10  PC255-PRESENTATION      PIC X(04)    VALUE  '@@@@'.  00821402
008215             88  PC255-DEFLT-PRESENTATION         VALUE  '@@@@'.  00821502
008216             88  PC255-HANG                       VALUE  'HANG'.  00821602
008217             88  PC255-FOLD                       VALUE  'FOLD'.  00821702
008218         10  FILLER                  PIC X(01)    VALUE  ''.     00821802
008219         10  FILLER                  PIC X(18)    VALUE  SPACES.  00821902
008220*                                                                 00822002
008221*** LINE 5                                                        00822102
008222*                                                                 00822202
008223     05  FILLER.                                                  00822302
008224*                                                                 00822402
008225* FIXTURE - heading (U25) - 3rd box left side of label            00822502
008226*                                                                 00822602
008227         10  FILLER                  PIC X(15)    VALUE           00822702
008228*** 12/02/10 dmh                    '331100401720384'.            00822802
008229                                    '341100401590310'.            00822902
008230         10  FILLER                  PIC X(08).                   00823002
008231             88  PC255-FORM-FIX-HDG               VALUE           00823102
008232                                    'FIXTURE:'.                   00823202
008233             88  PC255-FORM-NO-FIX-HDG            VALUE           00823302
008234                                    '@@@@@@@@'.                   00823402
008235         10  FILLER                  PIC X(01)    VALUE  ''.     00823502
008236*                                                                 00823602
008237* FIXTURE - data (U26) - 3rd box left side of label               00823702
008238*                                                                 00823802
008239         10  FILLER                  PIC X(15)    VALUE           00823902
008240*** 12/02/10  dmh                   '331100401880384'.            00824002
008241                                    '341100401590225'.            00824102
008242         10  PC255-FIXTURE           PIC X(10)    value           00824202
008243                                    '@@@@@@@@@@'.                 00824302
008244             88  PC255-FORM-NO-FIXTURE            VALUE           00824402
008245                                    '@@@@@@@@@@'.                 00824502
008246         10  FILLER                  PIC X(01)    VALUE  ''.     00824602
008247*                                                                 00824702
008248* Text box - line 1  (U27) - 2nd box right side of label          00824802
008249*                                                                 00824902
008250         10  FILLER                  PIC X(15)    VALUE           00825002
008251                                    '331100401110115'.            00825102
008252         10  PC255-TEXT-LINE-1       PIC X(12)    VALUE           00825202
008253                                    '@@@@@@@@@@@@'.               00825302
008254             88  PC255-FORM-NO-TEXT-1             VALUE           00825402
008255                                    '@@@@@@@@@@@@'.               00825502
008256         10  FILLER                  PIC X(01)    VALUE  ''.     00825602
008257*                                                                 00825702
008258* Text box - line 2  (U28) - 2nd box right side of label          00825802
008259*                                                                 00825902
008260         10  FILLER                  PIC X(15)    VALUE           00826002
008261                                    '331100401270115'.            00826102
008262         10  PC255-TEXT-LINE-2       PIC X(12)    VALUE           00826202
008263                                    '@@@@@@@@@@@@'.               00826302
008264             88  PC255-FORM-NO-TEXT-2             VALUE           00826402
008265                                    '@@@@@@@@@@@@'.               00826502
008266         10  FILLER                  PIC X(01)    VALUE  ''.     00826602
008267*                                                                 00826702
008268* Text box - line 3  (U29) - 2nd box right side of label          00826802
008269*                                                                 00826902
008270         10  FILLER                  PIC X(15)    VALUE           00827002
008271                                    '331100401430115'.            00827102
008272         10  PC255-TEXT-LINE-3       PIC X(12)    VALUE           00827202
008273                                    '@@@@@@@@@@@@'.               00827302
008274             88  PC255-FORM-NO-TEXT-3             VALUE           00827402
008275                                    '@@@@@@@@@@@@'.               00827502
008276         10  FILLER                  PIC X(01)    VALUE  ''.     00827602
008277*                                                                 00827702
008278* Text box - line 4  (U30) - 2nd box right side of label          00827802
008279*                                                                 00827902
008280         10  FILLER                  PIC X(15)    VALUE           00828002
008281                                    '331100401590115'.            00828102
008282         10  PC255-TEXT-LINE-4       PIC X(12)    VALUE           00828202
008283                                    '@@@@@@@@@@@@'.               00828302
008284             88  PC255-FORM-NO-TEXT-4             VALUE           00828402
008285                                    '@@@@@@@@@@@@'.               00828502
008286         10  FILLER                  PIC X(01)    VALUE  ''.     00828602
008287*                                                                 00828702
008288* EAS - security tag needed - (U31) - 3rd box right side of label 00828802
008289*                                                                 00828902
008290         10  FILLER                  PIC X(15)    VALUE           00829002
008291*** 12/02/10 - dmh                  '332200401920090'.            00829102
008292                                    '332200401850365'.            00829202
008293         10  PC255-EAS-FIELD         PIC X(03)    VALUE  '@@@'.   00829302
008294             88  PC255-EAS-TAG-NEEDED             VALUE  'EAS'.   00829402
008295             88  PC255-EAS-TAG-NOT-NEEDED         VALUE  '@@@'.   00829502
008296         10  FILLER                  PIC X(01)    VALUE  ''.     00829602
008297*                                                                 00829702
008298*  # above bar code / or audit number barcode (U32)               00829802
008299*                                                                 00829902
008300         10  FILLER                  PIC X(15)    VALUE ZEROS.    00830002
008301             88 PC255-BRCD-NBR-ABOVE VALUE '341100002600330'.     00830102
008302             88 PC255-AUDIT-NBR-SIDE VALUE '222200003680375'.     00830202
008303         10  FILLER                  PIC X(25)    VALUE  ZEROS.   00830302
008304         10  FILLER                  PIC X(01)    VALUE  ''.     00830402
008305         10  FILLER                  PIC X(18)    VALUE  SPACES.  00830502
008306*                                                                 00830602
008307*** LINE 6                                                        00830702
008308*                                                                 00830802
008309     05  FILLER.                                                  00830902
008310*                                                                 00831002
008311* long bar code across bottom of label / or audit barcode  (U33)  00831102
008312*                                                                 00831202
008313         10  FILLER                  PIC X(16)    VALUE ZEROES.   00831302
008314             88 PC255-SML-BRCD       VALUE '3e4410003790340C'.    00831402
008315             88 PC255-AUDIT-BRCD     VALUE '2e2205003550320C'.    00831502
008316         10 PC255-SML-BARCODE         PIC X(20).                  00831602
008317         10 PC255-BARCODE-REDEF REDEFINES PC255-SML-BARCODE.      00831702
008318            15 PC255-AUDIT-BARCODE    PIC X(09).                  00831802
008319            15 FILLER                 PIC X(11).                  00831902
008320         10  FILLER                  PIC X(01)    VALUE  ''.     00832002
008321*                                                                 00832102
008322* Userid - above barcode (U34)                                    00832202
008323*                                                                 00832302
008324         10  FILLER                  PIC X(15)    VALUE           00832402
008325                                    '302200002600050'.            00832502
008326         10  PC255-USER-ID           PIC X(07)    VALUE SPACES.   00832602
008327         10  FILLER                  PIC X(01)    VALUE  ''.     00832702
008328*                                                                 00832802
008329* PRINTER # - line  (U35) - bottom of label                       00832902
008330*                                                                 00833002
008331         10  FILLER                  PIC X(22)    VALUE           00833102
008332                                    '302200003910390PRTR #'.      00833202
008333         10  PC255-SML-PRTR-NBR      PIC X(06)    VALUE           00833302
008334                                    'DC-XXX'.                     00833402
008335         10  FILLER                  PIC X(01)    VALUE  ''.     00833502
008336*                                                                 00833602
008337**  LABEL # OF FIELD (U36) - bottom of label                      00833702
008338*                                                                 00833802
008339         10  FILLER                    PIC X(15)  VALUE           00833902
008340                                      '302200003910285'.          00834002
008341         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  00834102
008342         10  FILLER                    PIC X(01)  VALUE  ''.     00834202
008343*                                                                 00834302
008344**  "OF" LITERAL (U37) - bottom of label                          00834402
008345*                                                                 00834502
008346         10  FILLER                    PIC X(15)  VALUE           00834602
008347                                      '302200003910257'.          00834702
008348         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  00834802
008349         10  FILLER                    PIC X(01)  VALUE  ''.     00834902
008350*                                                                 00835002
008351**  TOTAL LABEL COUNT (U38) - bottom of label                     00835102
008352*                                                                 00835202
008353         10  FILLER                    PIC X(15)  VALUE           00835302
008354                                      '302200003910232'.          00835402
008355         10  FILLER                    PIC X(04)  VALUE  '@@@@'.  00835502
008356         10  FILLER                    PIC X(01)  VALUE  ''.     00835602
008357*                                                                 00835702
008358*  label print date (U39) - bottom of label                       00835802
008359*                                                                 00835902
008360         10  FILLER                    PIC X(15)  VALUE           00836002
008361                                      '302200003910180'.          00836102
008362         10  PC255-LBL-PRT-DATE        PIC X(08)  VALUE           00836202
008363                                      '@@@@@@@@'.                 00836302
008364         10  FILLER                    PIC X(01)  VALUE  ''.     00836402
008365*                                                                 00836502
008366*  label print time (U40) - bottom of label                       00836602
008367*                                                                 00836702
008368         10  FILLER                    PIC X(15)  VALUE           00836802
008369                                      '302200003910125'.          00836902
008370         10  PC255-LBL-PRT-TIME        PIC X(05)  VALUE '@@@@@'.  00837002
008371         10  FILLER                    PIC X(01)  VALUE  ''.     00837102
008372*                                                                 00837202
008373* Label Description (U41) - bottom of label                       00837302
008374*                                                                 00837402
008375         10  FILLER                  PIC X(15)    VALUE           00837502
008376                                    '302200003910080'.            00837602
008377         10  PC255-LABEL-INFO        PIC X(12)    VALUE           00837702
008378                                    'CI-SML BTCH '.               00837802
008379         10  FILLER                  PIC X(01)    VALUE  ''.     00837902
008380         10  FILLER                  PIC X(18)  VALUE SPACES.     00838002
008381*                                                                 00838102
008382*** LINE 7                                                        00838202
008383*                                                                 00838302
008384     05  FILLER.                                                  00838402
008385*                                                                 00838502
008386******************************************************************00838602
008387*   program should either set the following to PC255-reprint-box *00838702
008388*   if nothing is to be printed                                  *00838802
008389*            '1X1100000250220L000000'                            *00838902
008390*   or it should set the following to print a black box          *00839002
008391*            '1X1100000250220L070017'                            *00839102
008392******************************************************************00839202
008393*                                                                 00839302
008394* REPRINT box (U42)                                               00839402
008395*                                                                 00839502
008396         10  PC255-REPRINT-BOX       PIC X(22).                   00839602
008397             88  PC255-FORM-REPRT-BOX             VALUE           00839702
008398                                    '1X1100000250220L070017'.     00839802
008399             88  PC255-FORM-NO-RPRT-BOX     VALUE                 00839902
008400                                   '1X1100000250220L000000'.      00840002
008401         10  FILLER                  PIC X(01)    VALUE  ''.     00840102
008402******************************************************************00840202
008403*   program should either set the following to PC255-reprint-tex *00840302
008404*   if nothing is to be printed                                  *00840402
008405*            '331100000400280@@@@@@@'.                           *00840502
008406*   or it should set the following if reprint should be printed  *00840602
008407*            '331100000400280REPRINT'                            *00840702
008408******************************************************************00840802
008409*                                                                 00840902
008410* REPRINT field (U43)                                             00841002
008411*                                                                 00841102
008412         10  PC255-REPRINT-TEXT      PIC X(22).                   00841202
008413             88  PC255-FORM-REPRT-FLD             VALUE           00841302
008414                                   '331100000400280REPRINT'.      00841402
008415             88  PC255-FORM-NO-RPRT-FLD           VALUE           00841502
008416                                   '331100000400280@@@@@@@'.      00841602
008417         10  FILLER                  PIC X(01)    VALUE  ''.     00841702
008418*                                                                 00841802
008419* box around POG Program name & zero on hand (U44)                00841902
008420*                                                                 00842002
008421         10  FILLER                  PIC X(28)    VALUE           00842102
008422             '1X1100001960010B385043001001'.                      00842202
008423         10  FILLER                  PIC X(01)    VALUE  ''.     00842302
008424*                                                                 00842402
008425* horizontal line between store # and text box - right side (U45) 00842502
008426*                                                                 00842602
008427         10  FILLER                PIC X(22)      VALUE           00842702
008428             '1X1100000940015L108001'.                            00842802
008429         10  FILLER                  PIC X(01)    VALUE  ''.     00842902
008430*                                                                 00843002
008431* horizontal line between zone & hang/fold box - left  side (U46) 00843102
008432*                                                                 00843202
008433         10  FILLER                PIC X(22)      VALUE           00843302
008434             '1X1100000950315L110001'.                            00843402
008435         10  FILLER                  PIC X(01)    VALUE  ''.     00843502
008436*                                                                 00843602
008437* horizontal line between text & eas tag box -   right side (U47) 00843702
008438*                                                                 00843802
008439         10  FILLER                PIC X(22)      VALUE           00843902
008440             '1X1100001620015L108001'.                            00844002
008441         10  FILLER                  PIC X(01)    VALUE  ''.     00844102
008442*                                                                 00844202
008443* horizontal line between hang/fold & fixture box -left side (U48)00844302
008444*                                                                 00844402
008445         10  FILLER                PIC X(22)      VALUE           00844502
008446             '1X1100001500315L110001'.                            00844602
008447         10  FILLER                  PIC X(01)    VALUE  ''.     00844702
008448*                                                                 00844802
008449* horizontal line above zone box - left side (U49)                00844902
008450*                                                                 00845002
008451         10  FILLER                PIC X(22)      VALUE           00845102
008452             '1X1100000400315L110001'.                            00845202
008453         10  FILLER                  PIC X(01)    VALUE  ''.     00845302
008454         10  FILLER                  PIC X(50)    VALUE SPACES.   00845402
008455*                                                                 00845502
008456*** LINE 8                                                        00845602
008457*                                                                 00845702
008458     05  FILLER.                                                  00845802
008459*                                                                 00845902
008460* vertical line right side of label by store number (U50)         00846002
008461*                                                                 00846102
008462         10  FILLER                PIC X(22)      VALUE           00846202
008463             '1X1100000940121L001082'.                            00846302
008464         10  FILLER                  PIC X(01)    VALUE  ''.     00846402
008465*                                                                 00846502
008466* vertical line left side of label by zone box (U51)              00846602
008467*                                                                 00846702
008468         10  FILLER                PIC X(22)      VALUE           00846802
008469*** 12/02/10 '1X1100000390315L001130'.                            00846902
008470             '1X1100000390315L001157'.                            00847002
008471         10  FILLER                  PIC X(01)    VALUE  ''.     00847102
008472*                                                                 00847202
008473* box around the manifest number above barcode (U52)              00847302
008474*                                                                 00847402
008475         10  FILLER                  PIC X(22)    VALUE SPACES.   00847502
008476             88 PC255-MFST-BOX-YES VALUE '1X1100002410067L093020'.00847602
008477             88 PC255-MFST-BOX-NO  VALUE '1X1100002410067L000000'.00847702
008478         10  FILLER                  PIC X(01)    VALUE  ''.     00847802
008479*                                                                 00847902
008480* black box/line across label just above barcode (U53)            00848002
008481*                                                                 00848102
008482         10  FILLER                  PIC X(22)    VALUE SPACES.   00848202
008483             88 PC255-TEST-LNE-YES VALUE '1X1100002630000L405009'.00848302
008484             88 PC255-TEST-LNE-NO  VALUE '1X1100002630000L000000'.00848402
008485         10  FILLER                  PIC X(01)    VALUE  ''.     00848502
008486*                                                                 00848602
008487* reverse image store number (U54)                                00848702
008488*                                                                 00848802
008489         10  FILLER                PIC X(22)      VALUE SPACES.   00848902
008490             88 PC255-STR-REV-YES  VALUE '1X1100000170010L119077'.00849002
008491             88 PC255-STR-REV-NO   VALUE '1X1100000170010L000000'.00849102
008492         10  FILLER                  PIC X(01)    VALUE  ''.     00849202
008493*                                                                 00849302
008494* reverse image - STORE ON HAND ZERO - 2nd line in box (U55)      00849402
008495*                                                                 00849502
008496         10  FILLER                PIC X(22)      VALUE SPACES.   00849602
008497             88 PC255-OH-ZERO-YES  VALUE '1X1100002180036L360020'.00849702
008498             88 PC255-OH-ZERO-NO   VALUE '1X1100002180036L000000'.00849802
008499         10  FILLER                  PIC X(01)    VALUE  ''.     00849902
008500*                                                                 00850002
008501* QC AUDIT description - for qc audit label only (U56)            00850102
008502*                                                                 00850202
008503         10  FILLER                  PIC X(15)    VALUE           00850302
008504                                    '335501003450300'.            00850402
008505         10  PC255-AUDIT-HDG         PIC X(07)    VALUE  '@@'.    00850502
008506             88  PC255-AUDIT-HDG-YES            VALUE  'QCAUDIT'. 00850602
008507             88  PC255-AUDIT-RFID-YES           VALUE  'RF ONLY'. 00850702
008508             88  PC255-AUDIT-QCRD-YES           VALUE  'COMBO  '. 00850802
008509             88  PC255-FSTY-AUDIT-YES           VALUE  'F/A AUD'. 00850902
008510             88  PC255-AUDIT-HDG-NO             VALUE  '@@@@@@@'. 00851002
008511         10  FILLER                  PIC X(01)    VALUE  ''.     00851102
008512*                                                                 00851202
008513* reverse image - CRTN: heading - indicate audit carton (U57)     00851302
008514*                                                                 00851402
008515         10  FILLER                PIC X(22)      VALUE SPACES.   00851502
008516             88 PC255-AUDIT-YES    VALUE '1X1100000030276L051021'.00851602
008517             88 PC255-AUDIT-NO     VALUE '1X1100000030276L000000'.00851702
008518         10  FILLER                  PIC X(01)    VALUE  ''.     00851802
008519*                                                                 00851902
008520* reverse image - FIXTURE                               (U58)     00852002
008530* 12/02/10 added - dmh                                            00853002
008540*                                                                 00854002
008550*DMH6/30 10  FILLER                PIC X(22)      VALUE SPACES.   00855002
008560*DMH6/30     88 PC255-FIXTURE-YES  VALUE '1X1100001400120L195021'.00856002
008570*DMH6/30     88 PC255-FIXTURE-NO   VALUE '1X1100004000120L000000'.00857002
008580*DMH6/30 10  FILLER                  PIC X(01)    VALUE  ''.     00858002
008590*DMH6/30 10  FILLER                  PIC X(33)    VALUE  SPACES.  00859002
008600         10  FILLER                  PIC X(56)    VALUE  SPACES.  00860002
008700*                                                                 00870002
008800*** LINE 9                                                        00880002
008900*                                                                 00890002
009000* E     - Terminate field generation                              00900002
009100*                                                                 00910002
009200     05  FILLER.                                                  00920002
009300         10  FILLER                  PIC X(02)    VALUE           00930002
009400             'X '.                                                00940002
009500         10  FILLER                  PIC X(01)    VALUE  ''.     00950002
009600         10  FILLER                  PIC X(237)   VALUE  SPACES.  00960002
009700*                                                                 00970002
009800 01  PC255-SHIP-MFST-LBL-TABLE       REDEFINES                    00980002
009900     PC255-SML-BATCH-LBL.                                         00990002
010000     05  PC255-SHIP-MFST-LBL-LINE    OCCURS 9 TIMES               01000002
010100                                     INDEXED BY PC255-IDX         01010002
010200                                     PIC X(240).                  01020002
010300*----------------------------------------------------------------*01030002
010400* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01040002
010500*----------------------------------------------------------------*01050002
010600 01  PC255-DTL-LBL-FORM-LENGTH.                                   01060002
010700     05  FILLER                        PIC 9(03)    VALUE   55.   01070002
010800     05  FILLER                        PIC 9(03)    VALUE  212.   01080002
010900     05  FILLER                        PIC 9(03)    VALUE  184.   01090002
011000     05  FILLER                        PIC 9(03)    VALUE  222.   01100002
011100     05  FILLER                        PIC 9(03)    VALUE  222.   01110002
011200     05  FILLER                        PIC 9(03)    VALUE  222.   01120002
011300     05  FILLER                        PIC 9(03)    VALUE  190.   01130002
011400*DMH 05  FILLER                        PIC 9(03)    VALUE  207.   01140002
011500     05  FILLER                        PIC 9(03)    VALUE  184.   01150002
011600     05  FILLER                        PIC 9(03)    VALUE    3.   01160002
011700 01  PC255-DTL-LBL-FORM-LNGTH-VALUE REDEFINES                     01170002
011800         PC255-DTL-LBL-FORM-LENGTH.                               01180002
011900     05  PC255-DTL-FORM-LNE-LNGTH     OCCURS 9 TIMES              01190002
012000                                      INDEXED BY PC255-IDX-2      01200002
012100                                      PIC 9(03).                  01210002
012200                                                                  01220002
012300 01  PC255-LABEL-WORK-FIELDS.                                     01230002
012400     05  PC255-LABEL-INFO-WORK        PIC X(12).                  01240002
012500     05  PC255-LABEL-INFO-WORK-R REDEFINES PC255-LABEL-INFO-WORK. 01250002
012600         10  PC255-FROM-APPLICATION   PIC X(02).                  01260002
012700         10  PC255-LBL-DESC           PIC X(05).                  01270002
012800         10  PC255-PRTR-ATTACHED      PIC X(05).                  01280002
