000001***************************************************************** 00000100
000002* PCWS197 - DC-Trailer Serial # Label - DATA                    * 00000201
000003*                                                               * 00000300
000004*  This is the layout for the trailer serial # label.           * 00000402
000006* The label commands are strung together under only 4-05 levels * 00000600
000007* Each label command is separated by an end of text char-hex 03 * 00000700
000008* This was done to try to speed up transmission via new socket  * 00000800
000009* interface.  Systec's software separates 05 levels into        * 00000900
000010* statements.  The maximum length is 240.                       * 00001000
000020***************************************************************** 00002000
000030 01  PC197-TLR-LABEL-DATA-MAX-LN PIC 9(03)          VALUE  02.    00003002
000040***                                                               00004000
000050***    NUMBER OF 05 LEVELS --------------------------------/\     00005000
000060***                                                               00006000
000070***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00007000
000080***               IN PC197-TLR-LBL-DATA-LENGTH.                   00008002
000090***               ALSO IF LINES ARE ADDED BE SURE TO INCREASE THE 00009000
000100***               SML-LABEL-DATA-MAX-LN VALUE AND TABLE OCCURS.   00010000
000200***                                                               00020000
000300***                                                               00030000
000400*-----------------------------------------------------------------00040000
000500 01  PC197-TLR-LABEL-DATA.                                        00050002
000600     05  FILLER.                                                  00060000
000700* U02 - SCAC                                                      00070002
000800         10 FILLER                    PIC X(04) VALUE             00080000
000900            'U02'.                                               00090002
001000         10  PC197-SCAC               PIC X(04) VALUE SPACES.     00100002
001200         10 FILLER                    PIC X(01) VALUE  ''.       00120000
001300* U03 - TRAILER ID                                                00130002
001400         10 FILLER                    PIC X(04) VALUE             00140000
001500            'U03'.                                               00150002
001600         10  PC197-TRLR-ID                                        00160003
001700                                      PIC X(12) VALUE SPACES.     00170002
001800         10 FILLER                    PIC X(01) VALUE  ''.       00180000
001900* U04 - SERIAL # BARCODE                                          00190002
002000         10 FILLER                    PIC X(04) VALUE             00200000
002100            'U04'.                                               00210002
002200         10  FILLER                   PIC X(01) VALUE 'C'.        00220000
002300         10  PC197-TLR-DATA-BC        PIC X(09) VALUE SPACES.     00230002
002400         10  PC197-TLR-DATA-BC-EOT    PIC X(01) VALUE  ''.       00240002
002700* U05 - SERIAL NUMBER ABOVE BARCODE                               00270002
002800         10 FILLER                    PIC X(04) VALUE             00280000
002900            'U05'.                                               00290002
003000         10  PC197-TLR-DATA-BC-NBR    PIC X(09) VALUE SPACES.     00300004
003100         10  FILLER                   PIC X(01) VALUE  ''.       00310000
003110*                                                                 00311002
003200         10  FILLER                   PIC X(185) VALUE SPACES.    00320002
003300*                                                                 00330000
003400*                                                                 00340000
003500*****                                                             00350000
003600*                                                                 00360000
003700     05  FILLER.                                                  00370000
003800* E     - TERMINATE FIELD GENERATION AND PRINT LABEL              00380000
003900         10 FILLER                    PIC X(02) VALUE             00390000
004000            'E'.                                                 00400000
004100         10  PC197-TLR-TOT-LBL        PIC 9(04) VALUE ZEROS.      00410002
004200         10 FILLER                    PIC X(01) VALUE  ''.       00420000
004300* G    - PRINTS PREVIOUSLY STORED OR PRINTED LABEL COMMANDS       00430000
004400         10 FILLER                    PIC X(02) VALUE             00440000
004500            'G'.                                                 00450000
004600         10 FILLER                    PIC X(01) VALUE  ''.       00460000
004700         10 FILLER                    PIC X(230) VALUE SPACES.    00470000
004800                                                                  00480000
004900 01  PC197-TLR-LBL-DATA-TABLE REDEFINES                           00490002
005000                                PC197-TLR-LABEL-DATA.             00500002
005100     05  PC197-TLR-LBL-DATA-LINE      OCCURS 02 TIMES             00510002
005200                                      INDEXED BY PC197-IDX        00520000
005300                                      PIC X(240).                 00530000
005400                                                                  00540000
005500*----------------------------------------------------------------*00550000
005600* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *00560000
005700*----------------------------------------------------------------*00570000
005800 01  PC197-TLR-LBL-DATA-LENGTH.                                   00580002
005900     05  FILLER                        PIC 9(03)    VALUE  55.    00590002
006000     05  FILLER                        PIC 9(03)    VALUE  10.    00600000
006100                                                                  00610000
006200 01  PC197-TLR-LBL-LNGTH-VALUES                                   00620002
006300                      REDEFINES PC197-TLR-LBL-DATA-LENGTH.        00630002
006400     05  PC197-TLR-LINE-LENGTH        OCCURS 02 TIMES             00640002
006500                                      INDEXED BY PC197-IDX-2      00650000
006600                                      PIC 9(03).                  00660000
006700                                                                  00670000
