000100***********************************************************       00010000
000200*  THIS IS THE RECORD LAYOUT FOR DC PROCESSING CARTON     *       00020000
000300*  LABEL SELECTION SYSTEM.                                *       00030000
000400*                                                         *       00040000
000500*  IT IS PASSED THRU COMMAREA BY A LABEL REQUEST PROGRAM  *       00050000
000600*  INTO THE LABEL FORMATTING SUBROUTINE.                  *       00060000
000700*                                                         *       00070000
000800*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*       00080008
000900* IT IS IMPORTANT THAT THE PRINTER ID IS THE FIRST FIELD  *       00090000
001000* IN THE REDEFINE SECTION.                                *       00100000
001100*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*       00110000
001200*                                                         *       00120000
001300*  RECORD LENGTH:  400 BYTES  300 BYTES FOR THE REDEFINES *       00130000
001400*  RECORD FORMAT:  SEQUENTIAL                             *       00140000
001500*                                                         *       00150000
001600*  COPYBOOK NAME:  PCWS140                                *       00160000
001700***********************************************************       00170000
001800 01  PC140-LABELMST.                                              00180000
001900     05  PC140-LABEL-FORMAT-NBR          PIC 9(03)   VALUE ZEROS. 00190000
002000         88  PC140-COMMON-HDR-LBL-NBR                VALUE 001.   00200000
002100         88  PC140-COMMON-CART-LBL-NBR               VALUE 002.   00210000
002200         88  PC140-COMMON-SHIP-LBL-NBR               VALUE 003.   00220000
002300         88  PC140-COMMON-MFST-LBL-NBR               VALUE 004.   00230000
002400         88  PC140-COMMON-DEST-LBL-NBR               VALUE 005.   00240000
002500         88  PC140-COMMON-USERID-LBL-NBR             VALUE 006.   00250000
002600         88  PC140-COMMON-MISC-LBL-NBR               VALUE 007.   00260000
002700         88  PC140-COMMON-RACK-LBL-NBR               VALUE 008.   00270000
002800         88  PC140-COMMON-MISC-LBL-MSG               VALUE 009.   00280000
002900         88  PC140-BLIND-RECEIPT-LBL-NBR             VALUE 010.   00290000
003000         88  PC140-TRAILER-SERIAL-LBL-NBR            VALUE 011.   00300000
003100         88  PC140-RF-CRTN-STAT-APPL                 VALUE 013.   00310000
003200     05  PC140-CALL-RETURN-AREA.                                  00320000
003300         10  PC140-CRA-RET-CDE           PIC X(02).               00330000
003400             88  PC140-CRA-SUCCESSFUL                VALUE '00'.  00340000
003500             88  PC140-CRA-INVALID-PRT-FMT           VALUE '01'.  00350000
003600             88  PC140-CRA-SOCKET-COMM-ERROR         VALUE '02'.  00360000
003700         10  PC140-CRA-RET-MSG           PIC X(25).               00370000
003800         10  PC140-CRA-REQ-ID            PIC X(08).               00380000
003900         10  PC140-CRA-USERID            PIC X(08).               00390000
004000         10  PC140-CRA-DC-ID             PIC X(02).               00400000
004100         10  PC140-CRA-OPER-UNT-ID       PIC 9(04)   VALUE ZEROS. 00410000
004200         10  PC140-CRA-FACLTY-ID         PIC 9(04)   VALUE ZEROS. 00420000
004300         10  PC140-CRA-LOC-ID            PIC 9(04)   VALUE ZEROS. 00430000
004400         10  PC140-CRA-SPC-INSTR-SW      PIC X(01)   VALUE 'N'.   00440000
004500             88  PC140-CRA-SPC-INSTR                 VALUE 'Y'.   00450000
004600             88  PC140-CRA-NOT-SPC-INSTR             VALUE 'N'.   00460000
004700         10  PC140-XMIT-INTFC-CDE        PIC X(01)   VALUE SPACE. 00470000
004800             88  PC140-FTP-INTFC                     VALUE 'F'.   00480000
004900             88  PC140-SOCKET-INTFC                  VALUE 'S'.   00490000
005000         10  PC140-CRA-DC-SSCC-18-IND    PIC X       VALUE ' '.   00500000
005100             88  PC140-20-DIGIT-BARCODE              VALUE 'Y'.   00510000
005200         10  FILLER                      PIC X(37).               00520000
005300     05  PC140-LBL-FMT                   PIC X(300)  VALUE SPACE. 00530000
005400                                                                  00540000
005500     05  PC140-COMMON-HDR-LBL  REDEFINES  PC140-LBL-FMT.          00550000
005600         10  PC140-HL-PRTR-ID            PIC X(03).               00560000
005700         10  PC140-HL-PRTR-LU-NAME       PIC X(08).               00570000
005800         10  PC140-HL-PRC-AREA-TX        PIC X(06).               00580000
005900         10  PC140-HL-PRC-AREA-CD.                                00590000
006000             15  PC140-HL-PRC-AREA-3     PIC X(03).               00600000
006100             15  PC140-HL-MOD-10-CK-DGT  PIC X(01).               00610000
006200         10  PC140-HL-CART-CT            PIC X(04).               00620000
006300         10  PC140-HL-RCVD-MM-DD-YY      PIC X(08).               00630000
006400         10  PC140-HL-PO-NBR             PIC X(08).               00640000
006500         10  PC140-HL-VEND-NAME          PIC X(25).               00650000
006600         10  PC140-HL-RCVR-NBR           PIC X(11).               00660000
006700         10  PC140-HL-RCVR-SEQ-NBR-TX    PIC X(03).               00670000
006800         10  PC140-HL-AD-MM-DD-YY        PIC X(08).               00680000
006900         10  PC140-HL-PIC-TX             PIC X(08).               00690000
007000         10  PC140-HL-MULT-SHIPMENTS-TX  PIC X(18).               00700000
007100         10  PC140-HL-SPECIAL-TX         PIC X(25).               00710000
007200         10  PC140-HL-PRE-TKT-TX         PIC X(15).               00720000
007300         10  PC140-HL-PACKED-BY-TX       PIC X(15).               00730000
007400         10  PC140-HL-ON-HANGER-TX       PIC X(09).               00740000
007500         10  PC140-HL-DEPT               PIC X(03).               00750000
007600         10  PC140-HL-CLASS              PIC X(02).               00760000
007700         10  PC140-HL-TICKET-TYPE        PIC X(06).               00770000
007800         10  PC140-HL-DETAIL-CHECK       PIC X(12).               00780000
007900         10  PC140-HL-TRIP-ID            PIC X(09).               00790000
008000         10  PC140-HL-XFER-MODE-ID       PIC X(02).               00800000
008100         10  PC140-HL-IP-ADDRESS         PIC X(15).               00810000
008200         10  PC140-HL-OS-RLSE-CDE        PIC X(05).               00820000
008300         10  FILLER                      PIC X(68).               00830000
008400                                                                  00840000
008500     05  PC140-COMMON-CART-LBL  REDEFINES  PC140-LBL-FMT.         00850000
008600         10  PC140-CL-PRTR-ID            PIC X(03).               00860000
008700         10  PC140-CL-PRTR-LU-NAME       PIC X(08).               00870000
008800         10  PC140-CL-PRC-AREA           PIC X(06).               00880000
008900         10  PC140-CL-DIVERT-CDE         PIC X(04).               00890000
009000         10  PC140-CL-STRT-VALUE         PIC X(04).               00900000
009100         10  PC140-CL-OF-TOT-LBLS        PIC X(04).               00910000
009200         10  PC140-CL-TOT-LBLS           PIC X(04).               00920000
009300         10  PC140-CL-RCVD-MM-DD-YY      PIC X(08).               00930000
009400         10  PC140-CL-PO-NBR             PIC X(08).               00940000
009500         10  PC140-CL-RCVR-SEQ-NBR       PIC X(03).               00950000
009600         10  PC140-CL-PO-LINE-NBR        PIC X(04).               00960000
009700         10  PC140-CL-SKU                PIC X(08).               00970000
009800         10  PC140-CL-XFER-MODE-ID       PIC X(02).               00980000
009900         10  PC140-CL-IP-ADDRESS         PIC X(15).               00990000
010000         10  PC140-CL-OS-RLSE-CDE        PIC X(05).               01000000
010100         10  PC140-CL-DEPT               PIC X(03).               01010000
010200         10  PC140-CL-CLASS              PIC X(02).               01020000
010300         10  FILLER                      PIC X(209).              01030000
010400                                                                  01040000
010500     05  PC140-COMMON-SHP-MFST-LBL  REDEFINES  PC140-LBL-FMT.     01050000
010600         10  PC140-SML-PRTR-ID           PIC X(03).               01060000
010700         10  PC140-SML-PRTR-LU-NAME      PIC X(08).               01070000
010800         10  PC140-SML-STR-NBR           PIC X(04).               01080000
010900                 88  PC140-ALL-STORES        VALUE                01090000
011000                     'ALL' 'ALL ' ' ALL'.                         01100000
011100                 88  PC140-LOSS-PREVENTION   VALUE                01110000
011200                     'LP  ' ' LP ' '  LP'.                        01120000
011300         10  PC140-SML-STR-NAME          PIC X(25).               01130000
011400         10  PC140-SML-STRT-MFST-NBR     PIC 9(11).               01140000
011500         10  PC140-SML-TOT-CART          PIC 9(04).               01150000
011600         10  PC140-SML-ORIGIN-DC         PIC X(04).               01160000
011700         10  PC140-SML-ZNE-LINE-1        PIC X(20).               01170004
011800         10  PC140-SML-ZNE-LINE-2        PIC X(20).               01180004
011900         10  PC140-SML-ZNE-LINE-3        PIC X(20).               01190004
012000         10  PC140-SML-XFER-MODE-ID      PIC X(02).               01200000
012100         10  PC140-SML-IP-ADDRESS        PIC X(15).               01210000
012200         10  PC140-SML-OS-RLSE-CDE       PIC X(05).               01220000
012300         10  PC140-SML-SHORT-NAME        PIC X(05).               01230000
012400         10  PC140-SML-DIVERT-PFX        PIC 9(02).               01240000
012500         10  PC140-SML-PRTR-TYPE         PIC X(08).               01250000
012600             88  PC140-SML-PRTR-PRODIGY-MAX  VALUE 'PRODMAX '.    01260000
012700         10  PC140-SML-TYPE              PIC X(03).               01270000
012800         10  PC140-SML-REPRINT-IND       PIC X(01).               01280000
012900             88  PC140-SML-REPRINT           VALUE 'R'.           01290000
013000             88  PC140-SML-NO-REPRINT        VALUE ' '.           01300000
013100         10  PC140-MANIFEST-TRACKING     PIC X(01).               01310003
013200             88  PC140-MFST-TRACK-YES        VALUE 'Y'.           01320004
013300             88  PC140-MFST-TRACK-NO         VALUE 'N'.           01330004
013500         10  PC140-PARM-DOOR-LABEL      PIC X(01).                01350005
013600             88 PC140-DOOR-ON-LABEL          VALUE 'Y'.           01360005
013700             88 PC140-DOOR-NOT-ON-LABEL      VALUE 'N' ' '.       01370005
013800         10  PC140-PARM-SML-ORD         PIC X(01).                01380005
013900             88 PC140-SML-STORE-ORDER        VALUE 'S'.           01390005
014000             88 PC140-SML-P2L-ORDER          VALUE 'P'.           01400005
014100             88 PC140-SML-SHIP-DOOR-ORDER    VALUE 'D'.           01410005
014110             88 PC140-SML-P2L-SEPHORA-ORD    VALUE 'A'.           01411009
014300         10  PC140-3WD-LABEL-SW          PIC X(01).               01430011
014301             88 PC140-3WD-LABEL              VALUE 'Y'.           01430110
014302             88 PC140-3WD-LABEL-NO           VALUE 'N' ' '.       01430210
014310         10  FILLER                      PIC X(136).              01431010
014400                                                                  01440004
014500     05  PC140-COMMON-DEST-LBL  REDEFINES  PC140-LBL-FMT.         01450004
014600         10  PC140-DL-PRTR-ID            PIC X(03).               01460004
014700         10  PC140-DL-PRTR-LU-NAME       PIC X(08).               01470004
014800         10  PC140-DL-MODULE-NAME        PIC X(07).               01480004
014900         10  PC140-DL-STRT-VALUE         PIC 9(04).               01490004
015000         10  PC140-DL-TOT-CART           PIC X(04).               01500004
015100         10  PC140-DL-DIST-CNTL-NBR.                              01510004
015200             15  PC140-DL-TYPE-IND       PIC 9(01).               01520004
015300             15  PC140-DL-DIVERT-CDE     PIC 9(04).               01530004
015400             15  PC140-DL-PO-NBR         PIC 9(08).               01540004
015500             15  PC140-DL-RECV-SEQ-NBR   PIC 9(02).               01550004
015600             15  PC140-DL-PO-LINE-NBR    PIC 9(03).               01560004
015700             15  PC140-DL-CARTON-NBR     PIC 9(04).               01570004
015800         10  FILLER                      PIC X(10).               01580004
015900         10  PC140-DL-INPK-QTY           PIC 9(03).               01590004
016000         10  PC140-DL-XFER-MODE-ID       PIC X(02).               01600004
016100         10  PC140-DL-IP-ADDRESS         PIC X(15).               01610004
016200         10  PC140-DL-OS-RLSE-CDE        PIC X(05).               01620004
016300         10  FILLER                      PIC X(217).              01630004
016400                                                                  01640004
016500     05  PC140-COMMON-USERID-LBL  REDEFINES  PC140-LBL-FMT.       01650004
016600         10  PC140-UL-PRTR-ID            PIC X(03).               01660004
016700         10  PC140-UL-PRTR-LU-NAME       PIC X(08).               01670004
016800         10  PC140-UL-CICS               PIC X(06).               01680004
016900         10  PC140-UL-USERID             PIC X(08).               01690004
017000         10  PC140-UL-XFER-MODE-ID       PIC X(02).               01700004
017100         10  PC140-UL-IP-ADDRESS         PIC X(15).               01710004
017200         10  PC140-UL-OS-RLSE-CDE        PIC X(05).               01720004
017300         10  FILLER                      PIC X(253).              01730004
017400                                                                  01740004
017500     05  PC140-COMMON-MISC-LBL  REDEFINES  PC140-LBL-FMT.         01750004
017600         10  PC140-ML-PRTR-ID             PIC X(03).              01760004
017700         10  PC140-ML-PRTR-LU-NAME        PIC X(08).              01770004
017800         10  PC140-ML-BEGIN-RANGE-POSN-HR PIC 9(02).              01780004
017900         10  PC140-ML-END-RANGE-POSN-HR   PIC 9(02).              01790004
018000         10  PC140-ML-BEGIN-RANGE-POSN-BC PIC 9(02).              01800004
018100         10  PC140-ML-END-RANGE-POSN-BC   PIC 9(02).              01810004
018200         10  PC140-ML-BEGIN-RANGE-NBR     PIC 9(05).              01820004
018300         10  PC140-ML-END-RANGE-NBR       PIC 9(05).              01830004
018400         10  PC140-ML-START-LABEL-ID      PIC X(12).              01840004
018500         10  PC140-ML-END-LABEL-ID        PIC X(12).              01850004
018600         10  PC140-ML-START-LABEL-ID-HR   PIC X(20).              01860004
018700         10  PC140-ML-END-LABEL-ID-HR     PIC X(20).              01870004
018800         10  PC140-ML-DESC1               PIC X(30).              01880004
018900         10  PC140-ML-DESC2               PIC X(30).              01890004
019000         10  PC140-ML-DESC3               PIC X(30).              01900004
019100         10  PC140-ML-TOT-LBLS            PIC 9(04).              01910004
019200         10  PC140-ML-XFER-MODE-ID        PIC X(02).              01920004
019300         10  PC140-ML-IP-ADDRESS          PIC X(15).              01930004
019400         10  PC140-ML-OS-RLSE-CDE         PIC X(05).              01940004
019500         10  FILLER                       PIC X(91).              01950004
019600                                                                  01960004
019700     05  PC140-COMMON-RACK-LBL  REDEFINES  PC140-LBL-FMT.         01970004
019800         10  PC140-RL-PRTR-ID             PIC X(03).              01980004
019900         10  PC140-RL-PRTR-LU-NAME        PIC X(08).              01990004
020000         10  PC140-RL-BEGIN-RANGE-NBR     PIC X(05).              02000004
020100         10  PC140-RL-END-RANGE-NBR       PIC X(05).              02010004
020200         10  PC140-RL-START-LABEL-ID      PIC X(12).              02020004
020300         10  PC140-RL-END-LABEL-ID        PIC X(12).              02030004
020400         10  PC140-RL-START-LABEL-ID-HR   PIC X(20).              02040004
020500         10  PC140-RL-END-LABEL-ID-HR     PIC X(20).              02050004
020600         10  PC140-RL-TOT-LBLS            PIC X(04).              02060004
020700         10  PC140-RL-XFER-MODE-ID        PIC X(02).              02070004
020800         10  PC140-RL-IP-ADDRESS          PIC X(15).              02080004
020900         10  PC140-RL-OS-RLSE-CDE         PIC X(05).              02090004
021000         10  FILLER                       PIC X(189).             02100004
021100*                                                                 02110004
021200*** FIELDS FOR BLIND RECEIPT LABEL                                02120004
021300*                                                                 02130004
021400     05  PC140-BLIND-RECEIPT-LBL REDEFINES  PC140-LBL-FMT.        02140004
021500         10  PC140-BR-PRTR-ID                  PIC  X(03).        02150004
021600         10  PC140-BR-STORE-NAME               PIC  X(10).        02160004
021700         10  PC140-BR-USERID                   PIC  X(08).        02170004
021800         10  PC140-CURR-OPER-UNT-ID            PIC  9(04).        02180004
021900         10  PC140-CURR-FCLTY-ID               PIC  9(04).        02190004
022000         10  PC140-CS-EC-LOC                   PIC  X(04).        02200004
022100         10  PC140-CS-EC-LOC-R REDEFINES PC140-CS-EC-LOC.         02210004
022200             15  PC140-CS-EC-LOC-N             PIC  9(04).        02220004
022300         10  PC140-CS-EC-LOC-TYPE              PIC  X(01).        02230004
022400             88  PC140-CNTRL-STCK-LOC               VALUE 'C'.    02240004
022500             88  PC140-E-COMMERCE-LOC               VALUE 'E'.    02250004
022600         10  PC140-PO-NBR                      PIC  X(09).        02260004
022700         10  PC140-PO-NBR-R REDEFINES  PC140-PO-NBR.              02270004
022800             15  PC140-PO-NBR-N                PIC  9(09).        02280004
022900         10  PC140-RCVR-SEQ                    PIC  9(03).        02290004
023000         10  PC140-DEPT-NBR                    PIC  9(04).        02300004
023100         10  PC140-STORE-ZONE                  PIC  X(05).        02310004
023200         10  PC140-LNE-NBR                     PIC  9(04).        02320004
023300         10  PC140-SKU-NBR                     PIC  9(08).        02330004
023400         10  PC140-STORAGE-CODE                PIC  X(05).        02340004
023500         10  PC140-STYLE                       PIC  X(15).        02350004
023600         10  PC140-OTPK-UNTS                   PIC  X(04).        02360004
023700         10  PC140-OTPK-UNTS-R REDEFINES PC140-OTPK-UNTS.         02370004
023800             15  PC140-OTPK-UNTS-N             PIC  9(04).        02380004
023900         10  PC140-LBL-CNT                     PIC  X(04).        02390004
024000         10  PC140-LBL-CNT-R REDEFINES PC140-LBL-CNT.             02400004
024100             15  PC140-LBL-CNT-N               PIC  9(04).        02410004
024200         10  PC140-STARTING-BARCODE.                              02420004
024300             15 PC140-20-SML-CONTAINER-CDE     PIC  9(02).        02430004
024400             15 PC140-20-SML-PACKAGING-TYP     PIC  9(01).        02440004
024500                 88 PC140-20-SML-INTERNAL-LBL       VALUE 4.      02450004
024600             15 PC140-20-SML-SOFTWARE-SRC      PIC  9(01).        02460004
024700                 88 PC140-20-SML-FROM-KOHLS         VALUE 1.      02470004
024800             15 PC140-20-SML-BC-DIVERT.                           02480004
024900                 20 PC140-20-SML-BC-DIVERT-PFX PIC  9(01).        02490004
025000                 20 PC140-20-SML-BC-DIVERT-CDE PIC  9(04).        02500004
025100             15 PC140-20-SML-BC-DC-ORIGIN      PIC  9(03).        02510004
025200             15 PC140-20-SML-BC-MNFST-NBR      PIC  9(08).        02520004
025300         10  PC140-BR-XFER-MODE-ID        PIC X(02).              02530004
025400         10  PC140-BR-IP-ADDRESS          PIC X(15).              02540004
025500         10  PC140-BR-OS-RLSE-CDE         PIC X(05).              02550004
025600         10  PC140-BR-CLASS               PIC X(02).              02560004
025700         10  FILLER                       PIC X(161).             02570004
025800*                                                                 02580004
025900*** FIELDS FOR TRAILER SERIAL NUMBER LABEL                        02590004
026000*                                                                 02600004
026100     05  PC140-TRLR-SERL-NBR-LBL REDEFINES  PC140-LBL-FMT.        02610004
026200         10  PC140-TSN-PRTR-ID                 PIC  X(03).        02620004
026300         10  PC140-TSN-USERID                  PIC  X(08).        02630004
026400         10  PC140-TSN-OPER-UNT-ID             PIC  9(04).        02640004
026500         10  PC140-TSN-SCAC                    PIC  X(04).        02650004
026600         10  PC140-TSN-TRLR-ID                 PIC  X(12).        02660004
026700         10  PC140-TSN-SERL-NBR                PIC  9(09).        02670004
026800         10  PC140-TSN-XFER-MODE-ID            PIC  X(02).        02680004
026900         10  PC140-TSN-IP-ADDRESS              PIC  X(15).        02690004
027000         10  PC140-TSN-OS-RLSE-CDE             PIC  X(05).        02700004
027100         10  FILLER                            PIC  X(238).       02710004
027200*                                                                 02720004
027300*                                                                 02730004
027400*** FIELDS FROM RF CARTON STATUS APPLICATION                      02740004
027500*                                                                 02750004
027600     05  PC140-RF-CRTN-STAT-APPL-LBL REDEFINES PC140-LBL-FMT.     02760004
027700         10  PC140-RF-PRTR-ID            PIC X(03).               02770004
027800         10  PC140-RF-LBL-FORMAT         PIC X(01).               02780004
027900             88  PC140-RF-CENTRAL-STK        VALUE 'C'.           02790004
028000             88  PC140-RF-E-COMMERCE         VALUE 'E'.           02800004
028100             88  PC140-RF-DEST-LBL           VALUE 'D'.           02810004
028200             88  PC140-RF-GENERIC-SML        VALUE 'G'.           02820004
028300             88  PC140-RF-CSEPK-SML          VALUE 'P'.           02830004
028400             88  PC140-RF-CHECKIN-SML        VALUE 'S'.           02840004
028500             88  PC140-RF-CRTN-BULD          VALUE 'B'.           02850004
028600             88  PC140-RF-SMOOTHING          VALUE 'T'.           02860004
028700             88  PC140-RF-PCK-2-LIT          VALUE 'L'.           02870004
028800             88  PC140-RF-CRTN-LBL           VALUE 'R'.           02880004
028900         10  PC140-RF-LBL-TYPE           PIC X(01).               02890004
029000             88  PC140-RF-4-BY-4-LBL         VALUE 'S'.           02900004
029100             88  PC140-RF-PGYBK-LBL          VALUE 'P'.           02910004
029200         10  PC140-RF-PACK-TYPE          PIC X(01).               02920004
029300             88  PC140-RF-NON-PREPK          VALUE 'N'.           02930004
029400             88  PC140-RF-PREPK              VALUE 'P'.           02940004
029500         10  PC140-RF-CASE-TYPE          PIC X(01).               02950004
029600             88  PC140-RF-FCSE               VALUE 'F'.           02960004
029700             88  PC140-RF-INPK               VALUE 'I'.           02970004
029800         10  PC140-RF-ODD-CRTN-IND       PIC  X(01).              02980004
029900             88  PC140-RF-ODD-CRTN           VALUE 'Y'.           02990004
030000             88  PC140-RF-NO-ODD-CRTN        VALUE 'N'.           03000004
030100         10  PC140-RF-USERID             PIC X(08).               03010004
030200         10  PC140-RF-STR-NBR            PIC X(04).               03020004
030300         10  PC140-RF-STR-NAME           PIC X(10).               03030004
030400         10  PC140-RF-PO-NBR             PIC 9(08) COMP.          03040004
030500         10  PC140-RF-PO-RCVR            PIC 9(03).               03050004
030600         10  PC140-RF-LNE-NBR            PIC 9(04) COMP.          03060004
030700         10  PC140-RF-PREPK-ID           PIC 9(04).               03070004
030800         10  PC140-RF-DEPT               PIC X(03).               03080004
030900         10  PC140-RF-CLASS              PIC X(02).               03090004
031000         10  PC140-RF-SKU                PIC X(08).               03100004
031100         10  PC140-RF-STYLE              PIC X(20).               03110004
031200         10  PC140-RF-OTPK-UNITS         PIC 9(04).               03120004
031300         10  PC140-RF-INPK-UNITS         PIC 9(04) COMP.          03130004
031400         10  PC140-RF-DEPT-NAME          PIC X(25).               03140004
031500         10  PC140-RF-MAJOR-CLASS        PIC X(25).               03150004
031600         10  PC140-RF-SEASONAL-SET       PIC X(25).               03160004
031700         10  PC140-RF-FIXTURE            PIC X(10).               03170004
031800         10  PC140-RF-ZONE               PIC X(05).               03180004
031900         10  PC140-RF-ZNE-LINE-1         PIC X(20).               03190004
032000         10  PC140-RF-ZNE-LINE-2         PIC X(20).               03200004
032100         10  PC140-RF-ZNE-LINE-3         PIC X(20).               03210004
032200         10  PC140-RF-PREPK-UNT-QTY      PIC 9(04) COMP.          03220004
032300         10  PC140-RF-PACKS-IN-CRTN      PIC 9(04) COMP.          03230004
032400         10  PC140-RF-UNTS-IN-PCK        PIC 9(04) COMP.          03240004
032500         10  PC140-RF-KOHLS-BARCODE.                              03250004
032600             15  PC140-RF-CONTAINER-CDE         PIC 9(02).        03260004
032700             15  PC140-RF-PACKAGING-TYP         PIC 9(01).        03270004
032800                 88  PC140-RF-INTERNAL-LBL                VALUE 4.03280004
032900             15  PC140-RF-SOFTWARE-SRC          PIC 9(01).        03290004
033000                 88  PC140-RF-FROM-KOHLS                  VALUE 1.03300004
033200             15  PC140-RF-BC-DIVERT.                              03320004
033300                 20  PC140-RF-BC-DIVERT-PFX     PIC 9(01).        03330004
033400                 20  PC140-RF-BC-DIVERT-CDE     PIC 9(04).        03340004
033500             15  PC140-RF-BC-DC-ORIGIN          PIC 9(03).        03350004
033600             15  PC140-RF-BC-MNFST-NBR          PIC 9(08).        03360004
033700             15  PC140-RF-BC-EOT                PIC X(02).        03370004
033800         10  PC140-RF-VNDR-BC-LAST-5     PIC 9(05).               03380004
033900         10  PC140-RF-IP-ADDRESS         PIC X(15).               03390004
034000         10  PC140-RF-PREPK-RATIO        PIC 9(04).               03400004
034100         10  PC140-RF-AUDIT-STATUS       PIC X(01).               03410004
034200         10  PC140-TRIP-ARRIVE-DATE        PIC  X(10).            03420004
034300         10  PC140-TRIP-ARRIVE-DATE-R                             03430004
034400             REDEFINES PC140-TRIP-ARRIVE-DATE.                    03440004
034500             15  PC140-TRIP-ARRIVE-CCYY    PIC  X(04).            03450004
034600             15  PC140-TRIP-ARRIVE-DASH1   PIC  X(01).            03460004
034700             15  PC140-TRIP-ARRIVE-MM      PIC  X(02).            03470004
034800             15  PC140-TRIP-ARRIVE-DASH2   PIC  X(01).            03480004
034900             15  PC140-TRIP-ARRIVE-DD      PIC  X(02).            03490004
035100         10  PC140-RFID-IND                PIC  X(01).            03510004
035200             88  PC140-RFID-YES            VALUE 'Y'.             03520004
035300             88  PC140-RFID-NO             VALUE 'N'.             03530004
035500         10  PC140-LABEL-PRINT-IND         PIC  X(01).            03550007
035600             88  PC140-PRINT-RFID          VALUE 'R'.             03560007
035700             88  PC140-PRINT-EAS           VALUE 'E'.             03570007
035800             88  PC140-PRINT-RFID-EAS      VALUE 'B'.             03580007
036000         10  FILLER                      PIC X(03).               03600007
