000010*****************************************************************         
000020*                                                               *         
000030* changes per systec to qA statement                            *         
000040*                                                               *         
000041*****************************************************************         
000042* PCWS146 - Print Package Divider Label - using sockets         *         
000043*                                                               *         
000046* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000047*                    I M P O R T A N T                          *         
000048* The label commands are strung together under only 4-05 levels *         
000049* Each label command is separated by an end of text char-hex 03 *         
000050* This was done to try to speed up transmission via new socket  *         
000051* interface.  Systec's software separates 05 levels into        *         
000052* statements.  The maximum length is 240.                       *         
000060*****************************************************************         
000100 01  PC146-DIVIDER-LABEL-MAX-LN        PIC 9(03)    VALUE   3.            
000110***                                                                       
000200***    NUMBER OF 05 LEVELS --------------------------------/\     PCWS146 
000211***                                                                       
000212***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
000213***               IN PC146-HDR-LBL-LENGTH.                                
000214***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE               
000215***                                                                       
000220*****************************************************************         
000300 01  PC146-DIVIDER-LABEL.                                                 
000400     05  FILLER.                                                          
000500* c0000 - Continuous paper length - 0000 = normal operation               
000600         10  FILLER                    PIC X(06)    VALUE                 
000700             'c0000'.                                                    
000800         10  FILLER                    PIC X(01)    VALUE  ''.           
000900* e     - Select edge sensor - DEFAULT                                    
001100         10  FILLER                    PIC X(02)    VALUE                 
001200             'e'.                                                        
001300         10  FILLER                    PIC X(01)    VALUE  ''.           
001400* M1125 - Maximum label length                                            
001600         10  FILLER                    PIC X(06)    VALUE                 
001700             'M1125'.                                                    
001800         10  FILLER                    PIC X(01)    VALUE  ''.           
001810*  Replaced a command with KcFMN to disable the feedback char             
001820*  dmh 8/9/17                                                             
001830* KcFMN - disable feedback characters to be transmitted (6)               
002100         10  FILLER                    PIC X(06)    VALUE                 
002200             'KcFMN'.                                                    
002300         10  FILLER                    PIC X(01)    VALUE  ''.           
002400* s     - Set up for 1 dot buffer                                         
002600         10  FILLER                    PIC X(02)    VALUE                 
002700             's'.                                                        
002800         10  FILLER                    PIC X(01)    VALUE  ''.           
002900* O0110 - Set form edge offset - 0110 = zero setting                      
003100         10  FILLER                    PIC X(06)    VALUE                 
003200             'O0110'.                                                    
003300         10  FILLER                    PIC X(01)    VALUE  ''.           
003400* qA    - Clear memory module - A=upper slot                              
003500         10  FILLER                    PIC X(03)    VALUE                 
003600             'qA'.                                                       
003800         10  FILLER                    PIC X(01)    VALUE  ''.           
003900* L     - enter label formatting command input mode                       
004100         10  FILLER                    PIC X(02)    VALUE                 
004200             'L'.                                                        
004300         10  FILLER                    PIC X(01)    VALUE  ''.           
004400* D11   - Set dot size - Horizontal(1) Vertical(1)                        
004600         10  FILLER                    PIC X(03)    VALUE                 
004700             'D11'.                                                       
004800         10  FILLER                    PIC X(01)    VALUE  ''.           
004810* H     - Heat setting for label                                          
005100         10  FILLER                    PIC X(01)    VALUE                 
005200             'H'.                                                         
005300         10  PC146-SML-HDR-HEAT-LEVEL PIC X(02)     VALUE                 
005400             '11'.                                                        
005500         10  FILLER                    PIC X(01)    VALUE  ''.           
005600* PK    - Max speed for print cycle - K=default (6 in.per sec)            
005800         10  FILLER                    PIC X(02)    VALUE                 
005900             'PK'.                                                        
006000         10  FILLER                    PIC X(01)    VALUE  ''.           
006100* SK    - Max slew rate speed - K= default (6 in.per sec)                 
006300         10  FILLER                    PIC X(02)    VALUE                 
006400             'SK'.                                                        
006500         10  FILLER                    PIC X(01)    VALUE  ''.           
006600* Q     - Quantity of labels to print                                     
006800         10  FILLER                    PIC X(01)    VALUE                 
006900             'Q'.                                                         
007000         10  PC146-SML-HDR-TOT-LBL     PIC X(04)    VALUE                 
007100             '0001'.                                                      
007200         10  FILLER                    PIC X(01)    VALUE  ''.           
007201         10  FILLER                    PIC X(179)   VALUE  SPACES.        
007202*                                                                         
007203*                                                                         
007204*****                                                                     
007210*                                                                         
007300     05  FILLER.                                                          
007400* DIVIDER LABEL - desc                                                    
008100         10  FILLER                    PIC X(47)    VALUE                 
008200             '341100500770390THIS IS A DIVIDER LABEL      '.              
008300         10  FILLER                    PIC X(01)    VALUE  ''.           
008400* BLANK LINE 1                                                            
008430         10  FILLER                    PIC X(47)    VALUE                 
008440             '341100500970390                             '.              
008450         10  FILLER                    PIC X(01)    VALUE  ''.           
008460* BLANK LINE 2                                                            
008490         10  FILLER                    PIC X(47)    VALUE                 
008491             '341100501170390                             '.              
008492         10  FILLER                    PIC X(01)    VALUE  ''.           
008493         10  FILLER                    PIC X(96)    VALUE  SPACES.        
008494*                                                                         
008495*                                                                         
008496*****                                                                     
008497*                                                                         
008498* E     - Terminate field generation and print label                      
008499*                                                                         
012900     05  FILLER.                                                          
013100         10  FILLER                    PIC X(02)    VALUE                 
013200             'E '.                                                        
013210         10  FILLER                    PIC X(01)    VALUE  ''.           
013300         10  FILLER                    PIC X(237)   VALUE  SPACES.        
013400                                                                          
013401                                                                          
013402 01  PC146-DIVIDER-LABEL-TABLE         REDEFINES                          
013403     PC146-DIVIDER-LABEL.                                                 
013404     05  PC146-DIVIDER-LABEL-LINE      OCCURS  3 TIMES                    
013410                                       INDEXED BY PC146-IDX               
013500                                       PIC X(240).                        
013501*----------------------------------------------------------------*        
013502* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
013503*----------------------------------------------------------------*        
013504 01  PC146-DVD-LBL-LENGTH.                                                
013505     05  FILLER                        PIC 9(03)    VALUE   61.           
013508     05  FILLER                        PIC 9(03)    VALUE  144.           
013509     05  FILLER                        PIC 9(03)    VALUE    3.           
013510                                                                          
013511 01  PC146-DVD-LBL-LNGTH-VALUES REDEFINES PC146-DVD-LBL-LENGTH.           
013512     05  PC146-DVD-LINE-LENGTH        OCCURS 3 TIMES                      
013513                                      INDEXED BY PC146-IDX-2              
013520                                      PIC 9(03).                          
013600                                                                          
