00001 *----------------------------------------------------------------*04/21/94
00002 *                         PCWS017                                *PCWS017 
00003 *                                                                *   LV001
00004 *   THIS IS THE TSQUE RECORD LAYOUT USED BY PCKCS154 & PCKCS155  *PCWS017 
00005 *   TO PASS AND USE KEY INFORMATION.                             *PCWS017 
00006 *                                                                *PCWS017 
00007 *----------------------------------------------------------------*PCWS017 
00008                                                                   PCWS017 
00009  01  PC017-TS-SEL-REC.                                            PCWS017 
00010        05  PC017-SELECTED-ITEMS       PIC S9(05)  COMP-3          PCWS017 
00011                                                   VALUE ZERO.     PCWS017 
00012        05  PC017-MAX-ITEMS            PIC  9(02)  VALUE 50.       PCWS017 
00013        05  PC017-PO-NBR               PIC S9(09)  COMP.           PCWS017 
00014        05  PC017-RCVR-SEQ-NBR         PIC S9(09)  COMP.           PCWS017 
00015        05  PC017-WORK-ORD-SEQ-NBR     PIC S9(04)  COMP.           PCWS017 
00016        05  PC017-LINE-NBR             PIC S9(04)  COMP.           PCWS017 
00017        05  PC017-SELECTED-ITEM-ARRAY.                             PCWS017 
00018            10  FILLER                 OCCURS 50 TIMES             PCWS017 
00019                                       INDEXED BY PC017-IDX.       PCWS017 
00020                15  PC017-ITEM         PIC S9(09)  COMP-3.         PCWS017 
00021                15  PC017-ACTION-SW    PIC  X(03).                 PCWS017 
00022                    88  PC017-INQ                  VALUE 'INQ'.    PCWS017 
00023                    88  PC017-UPD                  VALUE 'UPD'.    PCWS017 
00024                    88  PC017-DEL                  VALUE 'DEL'.    PCWS017 
00025                    88  PC017-ERR                  VALUE 'ERR'.    PCWS017 
00026                15  PC017-KEY-DATA.                                PCWS017 
00027                    20  PC017-SCREEN-SEQ-NBR     PIC S9(04) COMP.  PCWS017 
00028                    20  PC017-WO-INSTR-SEQ-NBR   PIC S9(04) COMP.  PCWS017 
00029                    20  PC017-EXPECTED-CTNS      PIC S9(05) COMP-3.PCWS017 
00030                    20  PC017-ACTUAL-CTNS        PIC S9(05) COMP-3.PCWS017 
