000100******************************************************************00010000
000200*  COMMAREA LAYOUT TO PASS THE TRAILER ID TO THE MODULE USED TO  *00020000
000300*  GET TRAILER STATUS                                            *00030000
000400*  PROGRAM-PCKCS896                             LENGTH = 500     *00040011
000500******************************************************************00050000
000600 01  PC048-COMMAREA-REC.                                          00060000
000700     05  PC048-CALLING-PGM-NME         PIC  X(08)  VALUE SPACES.  00070000
000800         88  PC048-FROM-TRLR-AUDIT              VALUE 'PCKRF892'. 00080000
000902     05  PC048-CALL-RETURN-AREA.                                  00090200
000903         10  PC048-CRA-RET-CDE         PIC  X(02)  VALUE ZEROES.  00090300
000904             88  PC048-SUCCESSFUL                  VALUE '00'.    00090400
000905             88  PC048-ERROR                       VALUE '01'.    00090500
000906             88  PC048-INVALID-SQL                 VALUE '02'.    00090600
000907             88  PC048-DATABASE-BUSY               VALUE '03'.    00090700
000908             88  PC048-TRLR-STAT-ERROR             VALUE '04'.    00090806
000909         10  PC048-CRA-RET-MSG         PIC  X(25)  VALUE SPACES.  00090900
000910         10  PC048-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.  00091000
000920     05  PC048-TRLR-SRL-NBR            PIC S9(09)  VALUE ZEROES   00092002
000921                                                   COMP.          00092102
000930*                                                                 00093000
000931* THE FOLLOWING INFORMATION IS FOR THE TRAILER SERIAL GIVEN       00093107
000932*                                                                 00093202
000933     05  PC048-TRLR-ID                 PIC  X(12)  VALUE SPACES.  00093302
000934     05  PC048-SCAC-CDE                PIC  X(04)  VALUE SPACES.  00093402
000935     05  PC048-OTBND-TRIP-ID           PIC S9(09)  VALUE ZEROES   00093502
000936                                                   COMP.          00093602
000937     05  PC048-ORGN-OPER-UNT-ID        PIC S9(04)  VALUE ZEROES   00093702
000938                                                   COMP.          00093802
000939     05  PC048-DEST-OPER-UNT-ID        PIC S9(04)  VALUE ZEROES   00093902
000940                                                   COMP.          00094002
000941     05  PC048-OTBND-TRIP-STATUS       PIC  X(02)  VALUE SPACES.  00094102
000942         88  PC048-INVALID-TRLR                    VALUE '01'.    00094204
000943         88  PC048-NO-ACTIVE-TRIP                  VALUE '02'.    00094304
000944         88  PC048-OPEN-AT-DC                      VALUE 'DO'.    00094404
000945         88  PC048-OPEN-FOR-AUDIT                  VALUE 'AO'.    00094504
000946         88  PC048-CLOSE-AUDIT-KEEP                VALUE 'AK'.    00094604
000947         88  PC048-CLOSE-AUDIT-REL                 VALUE 'AR'.    00094704
000948         88  PC048-CLOSED-AT-DC                    VALUE 'DC'.    00094804
000949         88  PC048-DC-SHIPPED                      VALUE 'DS'.    00094904
000950         88  PC048-OPEN-AT-STORE                   VALUE 'SO'.    00095004
000951         88  PC048-UNLOADED-AT-STORE               VALUE 'SU'.    00095104
000952     05  PC048-TRIP-STAT-PRTY-NBR      PIC S9(04)  VALUE ZEROES   00095210
000953                                                   COMP.          00095310
000954     05  PC048-TRIP-STAT-BKWD-PRTY     PIC S9(04)  VALUE ZEROES   00095410
000955                                                   COMP.          00095510
000956     05  PC048-OTBND-TRIP-STATUS-DESC  PIC  X(30)  VALUE SPACES.  00095608
000957     05  PC048-TRIP-STAT-SHRT-DESC     PIC  X(10)  VALUE SPACES.  00095711
000958     05  PC048-TRIP-STAT-TMST.                                    00095808
000959         10  PC048-TRIP-STAT-CCYY      PIC  X(04)  VALUE SPACE.   00095908
000960         10  FILLER                    PIC  X(01)  VALUE SPACE.   00096008
000961         10  PC048-TRIP-STAT-MM        PIC  X(02)  VALUE SPACE.   00096108
000962         10  FILLER                    PIC  X(01)  VALUE SPACE.   00096208
000963         10  PC048-TRIP-STAT-DD        PIC  X(02)  VALUE SPACE.   00096308
000964         10  FILLER                    PIC  X(01)  VALUE SPACE.   00096408
000965         10  PC048-TRIP-STAT-HR        PIC  X(02)  VALUE SPACE.   00096508
000966         10  FILLER                    PIC  X(01)  VALUE SPACE.   00096608
000967         10  PC048-TRIP-STAT-MN        PIC  X(02)  VALUE SPACE.   00096708
000968         10  FILLER                    PIC  X(01)  VALUE SPACE.   00096808
000969         10  PC048-TRIP-STAT-SC        PIC  X(02)  VALUE SPACE.   00096908
000970         10  FILLER                    PIC  X(01)  VALUE SPACE.   00097008
000971         10  PC048-TRIP-STAT-MS        PIC  X(06)  VALUE SPACE.   00097108
000972     05  PC048-STATUS-OPER-UNIT        PIC S9(04)  VALUE ZEROES   00097208
000973                                                   COMP.          00097308
000974     05  PC048-STATUS-USER-ID          PIC  X(08)  VALUE SPACES.  00097408
000975     05  PC048-DOOR-ID                 PIC  X(04)  VALUE SPACES.  00097508
000976     05  PC048-DOOR-TYP-CDE            PIC  X(02)  VALUE SPACES.  00097613
000977     05  PC048-PRKG-LOC-DESC           PIC  X(20)  VALUE SPACES.  00097713
000978     05  PC048-PRKG-SLOT-NBR           PIC  X(06)  VALUE SPACES.  00097813
000979*                                                                 00097913
000980* IF THE TRAILER IS BEING AUDITED TO ANOTHER TRAILER THE AUDIT    00098013
000981* TO TRAILER INFORMATION IS BELOW                                 00098113
000982*                                                                 00098213
000983     05  PC048-AUD-TO-TRLR-SRL-NBR     PIC S9(09)  VALUE ZEROES   00098313
000984                                                   COMP.          00098413
000985     05  PC048-AUD-TO-TRLR-ID          PIC  X(12)  VALUE SPACES.  00098513
000986     05  PC048-AUD-TO-SCAC-CDE         PIC  X(04)  VALUE SPACES.  00098613
000987     05  PC048-AUD-TO-TRIP-ID          PIC S9(09)  VALUE ZEROES   00098713
000988                                                   COMP.          00098813
000989     05  PC048-AUD-TO-ORIG-OPER        PIC S9(04)  VALUE ZEROES   00098913
000990                                                   COMP.          00099013
000991     05  PC048-AUD-TO-DEST-OPER        PIC S9(04)  VALUE ZEROES   00099113
000992                                                   COMP.          00099213
000993     05  PC048-AUD-TO-TRIP-STATUS      PIC  X(02)  VALUE SPACES.  00099313
000994         88  PC048-AUD-TO-INVALID-TRLR             VALUE '01'.    00099413
000995         88  PC048-AUD-TO-NO-ACT-TRIP              VALUE '02'.    00099513
000996     05  PC048-TO-TRIP-STAT-PRTY-NBR   PIC S9(04)  VALUE ZEROES   00099613
000997                                                   COMP.          00099713
000998     05  PC048-TO-TRIP-STAT-BKWD-PRTY  PIC S9(04)  VALUE ZEROES   00099813
000999                                                   COMP.          00099913
001000     05  PC048-AUD-TO-TRIP-STAT-DESC   PIC  X(30)  VALUE SPACES.  00100013
001001     05  PC048-AUD-TOTRIP-STAT-SHRTDESC                           00100113
001002                                       PIC  X(10) VALUE SPACES.   00100213
001003     05  PC048-AUD-TO-STAT-TMST.                                  00100313
001004         10  PC048-AUD-TRIP-STAT-CCYY  PIC  X(04)  VALUE SPACE.   00100413
001005         10  FILLER                    PIC  X(01)  VALUE SPACE.   00100513
001006         10  PC048-AUD-TRIP-STAT-MM    PIC  X(02)  VALUE SPACE.   00100613
001007         10  FILLER                    PIC  X(01)  VALUE SPACE.   00100713
001008         10  PC048-AUD-TRIP-STAT-DD    PIC  X(02)  VALUE SPACE.   00100813
001009         10  FILLER                    PIC  X(01)  VALUE SPACE.   00100913
001010         10  PC048-AUD-TRIP-STAT-HR    PIC  X(02)  VALUE SPACE.   00101013
001011         10  FILLER                    PIC  X(01)  VALUE SPACE.   00101113
001012         10  PC048-AUD-TRIP-STAT-MN    PIC  X(02)  VALUE SPACE.   00101213
001013         10  FILLER                    PIC  X(01)  VALUE SPACE.   00101313
001014         10  PC048-AUD-TRIP-STAT-SC    PIC  X(02)  VALUE SPACE.   00101413
001015         10  FILLER                    PIC  X(01)  VALUE SPACE.   00101513
001016         10  PC048-AUD-TRIP-STAT-MS    PIC  X(06)  VALUE SPACE.   00101613
001017     05  PC048-AUD-TO-STAT-OPER        PIC S9(04)  VALUE ZEROES   00101713
001018                                                   COMP.          00101813
001019     05  PC048-AUD-TO-STAT-USER        PIC  X(08)  VALUE SPACES.  00101913
001020     05  PC048-AUD-TO-DOOR-ID          PIC  X(04)  VALUE SPACES.  00102013
001021     05  PC048-AUD-TO-PRKG-DESC        PIC  X(20)  VALUE SPACES.  00102113
001030     05  PC048-AUD-TO-SLOT-NBR         PIC  X(06)  VALUE SPACES.  00103003
001100*                                                                 00110003
001200     05  PC048-AUD-CNTL-NBR            PIC S9(09)  VALUE ZEROES   00120005
001210                                                   COMP.          00121005
001300     05  PC048-AUD-STRT-TMST           PIC  X(26)  VALUE SPACES.  00130005
001400     05  PC048-AUD-USR-ID              PIC  X(08)  VALUE SPACES.  00140005
001500     05  PC048-OPER-UNT-ID             PIC S9(04)  VALUE ZEROES   00150005
001510                                                   COMP.          00151005
001600     05  PC048-AUD-STAT-CDE            PIC  X(02)  VALUE SPACES.  00160005
001700     05  PC048-AUD-TYP-CDE             PIC  X(02)  VALUE SPACES.  00170005
001800     05  PC048-DEST-TRLR-SRL-NBR       PIC S9(09)  VALUE ZEROES   00180005
001810                                                   COMP.          00181005
001900     05  PC048-DEST-TYP-CDE            PIC  X(01)  VALUE SPACES.  00190005
002000     05  PC048-AUD-TO-DOOR-TYP-CDE     PIC  X(02)  VALUE SPACES.  00200013
003830*                                                                 00383000
003840     05  FILLER                        PIC  X(124)  VALUE SPACES. 00384013
