000100***************************************************************** 00010021
000200* PCWS169 - Destination Label (P2L)               using sockets * 00020021
000300*         - Check in label using UCC128 DATA                    * 00030021
000400* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00040021
000500*                    I M P O R T A N T                          * 00050021
000600* The label commands are strung together under only 4-05 levels * 00060021
000700* Each label command is separated by an end of text char-hex 03 * 00070021
000800* This was done to try to speed up transmission via new socket  * 00080021
000900* interface.  Systec's software separates 05 levels into        * 00090021
001000* statements.  The maximum length is 240.                       * 00100021
001100***************************************************************** 00110021
001200 01  PC169-P2L-DEST-LBL-MAX-LN             PIC 9(03) VALUE  5.    00120021
001300***                                                               00130021
001400**                                NUMBER OF 05 LEVELS -----/\     00140021
001500***                                                               00150021
001600***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00160021
001700***               IN PC169-DEST-LBL-LENGTH.                       00170021
001800***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00180021
001900***                                                               00190021
002000***************************************************************** 00200021
002100 01  PC169-P2L-DESTIN-LABEL.                                      00210021
002200     05  FILLER.                                                  00220021
002300**  c0000 - CONTINOUS PAPER LENGTH - 0 = NORMAL OPERATION         00230021
002400         10  FILLER                    PIC X(06)  VALUE           00240021
002500             'c0000'.                                            00250021
002600         10  FILLER                    PIC X(01)  VALUE  ''.     00260021
002700**  e     - SELECT EDGE SENSOR - DEFAULT                          00270021
002800         10  FILLER                    PIC X(02)  VALUE           00280021
002900             'e'.                                                00290021
003000         10  FILLER                    PIC X(01)  VALUE  ''.     00300021
003100**  M1025 - MAXIMUN LABEL LENGTH                                  00310021
003200         10  FILLER                    PIC X(06)  VALUE           00320021
003300             'M1025'.                                            00330021
003400         10  FILLER                    PIC X(01)  VALUE  ''.     00340021
003500*  Replaced a command with KcFMN to disable the feedback char     00350022
003600*  dmh 8/9/17                                                     00360022
003700* KcFMN - disable feedback characters to be transmitted (6)       00370022
003710         10  FILLER                    PIC X(06)    VALUE         00371022
003720             'KcFMN'.                                            00372022
003800         10  FILLER                    PIC X(01)  VALUE  ''.     00380021
003900**  s     - SET UP FOR 1 DOT BUFFER                               00390021
004000         10  FILLER                    PIC X(02)  VALUE           00400021
004100             's'.                                                00410021
004200         10  FILLER                    PIC X(01)  VALUE  ''.     00420021
004300**  O0110 - SET FORM EDGE OFFSET                                  00430021
004400         10  FILLER                    PIC X(06)  VALUE           00440021
004500             'O0110'.                                            00450021
004600         10  FILLER                    PIC X(01)  VALUE  ''.     00460021
004700**  QA    - ?????????                                             00470021
004800         10  FILLER                    PIC X(02)  VALUE           00480021
004900             'QA'.                                                00490021
005000         10  FILLER                    PIC X(01)  VALUE  ''.     00500021
005100**  L     - BEGIN LABEL FORMATING - FIELD RECORD DEFIN. FOLLOW    00510021
005200         10  FILLER                    PIC X(02)  VALUE           00520021
005300             'L'.                                                00530021
005400         10  FILLER                    PIC X(01)  VALUE  ''.     00540021
005500**  D11   - SET HORIZONTAL & VERTICAL DOT SIZE                    00550021
005600         10  FILLER                    PIC X(03)  VALUE           00560021
005700             'D11'.                                               00570021
005800         10  FILLER                    PIC X(01)  VALUE  ''.     00580021
005900**  H10   - HEAT SETTING FOR LABEL                                00590021
006000         10  FILLER                    PIC X(03)  VALUE           00600021
006100             'H10'.                                               00610021
006200         10  FILLER                    PIC X(01)  VALUE  ''.     00620021
006300**  PK    - MAXIMUM SPEED FOR PRINT CYCLE - K=DEFAULT             00630021
006400         10  FILLER                    PIC X(02)  VALUE           00640021
006500             'PK'.                                                00650021
006600         10  FILLER                    PIC X(01)  VALUE  ''.     00660021
006700**  SK    - MAX SLEW RATE SPEED FOR FEEDING LABELS - K=DEFAULT    00670021
006800         10  FILLER                    PIC X(02)  VALUE           00680021
006900             'SK'.                                                00690021
007000         10  FILLER                    PIC X(01)  VALUE  ''.     00700021
007100**  Q#### - QUANTITY OF LABELS TO BE PRINTED                      00710021
007200         10  FILLER                    PIC X(01)  VALUE           00720021
007300             'Q'.                                                 00730021
007400         10  PC169-LBL-QTY-TO-PRT      PIC X(04)  VALUE SPACES.   00740021
007500         10  FILLER                    PIC X(01)  VALUE  ''.     00750021
007600         10  FILLER                    PIC X(180) VALUE  SPACES.  00760022
007700*                                                                 00770021
007800*                                                                 00780021
007900***** LINE GROUP 2                                                00790021
008000*                                                                 00800021
008100     05  FILLER.                                                  00810021
008200**  BARCODE                                                       00820021
008300         10  FILLER                    PIC X(16)  VALUE           00830021
008400             '3e4410003620352C'.                                  00840021
008500         10  PC169-BC-BARCODE          PIC X(22)  VALUE SPACES.   00850021
008600*        10  FILLER                    PIC X(01)  VALUE '0'.      00860021
008700*        10  PC169-BC-PROC-AREA-CODE   PIC X(04)  VALUE SPACES.   00870021
008800*        10  PC169-BC-PO-NO            PIC X(08)  VALUE SPACES.   00880021
008900*        10  PC169-BC-RECV-SEQ-NO      PIC X(02)  VALUE SPACES.   00890021
009000*        10  PC169-BC-PO-LINE-NO       PIC X(03)  VALUE SPACES.   00900021
009100*        10  PC169-BC-START-CRTN-CNT   PIC X(04)  VALUE SPACES.   00910021
009200         10  FILLER                    PIC X(01)  VALUE  ''.     00920021
009300**  MAKE LAST ENTERED FIELD INCREMENTING                          00930021
009400         10  FILLER                    PIC X(03)  VALUE           00940021
009500             '+01'.                                               00950021
009600         10  FILLER                    PIC X(01)  VALUE  ''.     00960021
009700**  # BELOW BARCODE                                               00970021
009800         10  FILLER                    PIC X(15)  VALUE           00980021
009900             '302200003730273'.                                   00990021
010000         10  PC169-TXT-BARCODE         PIC X(22)  VALUE SPACES.   01000021
010100*        10  FILLER                    PIC X(01)  VALUE '0'.      01010021
010200*        10  PC169-NBR-PROC-AREA-CODE  PIC X(04)  VALUE SPACES.   01020021
010300*        10  PC169-NBR-PO-NO           PIC X(08)  VALUE SPACES.   01030021
010400*        10  PC169-NBR-RECV-SEQ-NO     PIC X(02)  VALUE SPACES.   01040021
010500*        10  PC169-NBR-PO-LINE-NO      PIC X(03)  VALUE SPACES.   01050021
010600*        10  PC169-NBR-START-CRTN-CNT  PIC X(04)  VALUE SPACES.   01060021
010700         10  FILLER                    PIC X(01)  VALUE  ''.     01070021
010800**  MAKE LAST ENTERED FIELD INCREMENTING                          01080021
010900         10  FILLER                    PIC X(03)  VALUE           01090021
011000             '+01'.                                               01100021
011100         10  FILLER                    PIC X(01)  VALUE  ''.     01110021
011200                                                                  01120021
011300**  USER ID - BELOW BARCODE                                       01130021
011400         10  FILLER                    PIC X(15)  VALUE           01140021
011500             '302200003730085'.                                   01150021
011600         10  PC169-USER-ID             PIC X(08)  VALUE SPACES.   01160021
011700         10  FILLER                    PIC X(01)  VALUE  ''.     01170021
011800                                                                  01180021
011900**  "CI-DEST LBL" LITERAL ALONG SIDE OF LABEL                     01190021
012000         10  FILLER                    PIC X(15)  VALUE           01200021
012100             '102200000130310'.                                   01210021
012200         10  PC169-DEST-LBL-DESC       PIC X(11).                 01220021
012300         10  FILLER                    PIC X(01)  VALUE  ''.     01230021
012400**  LABEL # OF FIELD                                              01240021
012500         10  FILLER                    PIC X(15)  VALUE           01250021
012600             '102200000130112'.                                   01260021
012700         10  PC169-LABEL-NBR           PIC 9(04)  VALUE  ZEROES.  01270021
012800         10  FILLER                    PIC X(01)  VALUE  ''.     01280021
012900**  MAKE LAST ENTERED FIELD INCREMENTING                          01290021
013000         10  FILLER                    PIC X(03)  VALUE           01300021
013100             '+01'.                                               01310021
013200         10  FILLER                    PIC X(01)  VALUE  ''.     01320021
013300**  "OF" LITERAL ALONG SIDE OF LABEL                              01330021
013400         10  FILLER                    PIC X(19)  VALUE           01340021
013500             '102200000130140 OF '.                               01350021
013600         10  FILLER                    PIC X(01)  VALUE  ''.     01360021
013700**  TOTAL LABEL COUNT                                             01370021
013800         10  FILLER                    PIC X(15)  VALUE           01380021
013900             '102200000130165'.                                   01390021
014000         10  PC169-TOT-LABEL           PIC 9(04)  VALUE  ZEROES.  01400021
014100         10  FILLER                    PIC X(01)  VALUE  ''.     01410021
014200**  PRINTER ID                                                    01420021
014300         10  FILLER                    PIC X(20)  VALUE           01430021
014400             '102200000130028PRTR '.                              01440021
014500         10  PC169-DES-PRINTER-ID      PIC X(07).                 01450021
014600         10  FILLER                    PIC X(01)  VALUE  ''.     01460021
014700         10  FILLER                    PIC X(12)  VALUE  SPACES.  01470021
014800*                                                                 01480021
014900*                                                                 01490021
015000***** LINE GROUP - 3                                              01500021
015100*                                                                 01510021
015200     05  FILLER.                                                  01520021
015300*  label print date                                               01530021
015400         10  FILLER                    PIC X(15)  VALUE           01540021
015500             '102200000130210'.                                   01550021
015600         10  PC169-LBL-PRT-DATE        PIC X(08)  VALUE           01560021
015700             '@@@@@@@@'.                                          01570021
015800         10  FILLER                    PIC X(01)  VALUE  ''.     01580021
015900*  label print time                                               01590021
016000         10  FILLER                    PIC X(15)  VALUE           01600021
016100             '102200000130265'.                                   01610021
016200         10  PC169-LBL-PRT-TIME        PIC X(05)  VALUE           01620021
016300             '@@@@@'.                                             01630021
016400         10  FILLER                    PIC X(01)  VALUE  ''.     01640021
016500**  LABEL NUMBER - TOP CENTER OF LABEL                            01650021
016600         10  FILLER                    PIC X(15)  VALUE           01660021
016700             '291100801800266'.                                   01670021
016800         10  PC169-START-CARTON-CNT-1  PIC X(04)  VALUE           01680021
016900             '   1'.                                              01690021
017000         10  FILLER                    PIC X(01)  VALUE  ''.     01700021
017100**  MAKE LAST ENTERED FIELD INCREMENTING                          01710021
017200         10  FILLER                    PIC X(03)  VALUE           01720021
017300             '+ 1'.                                               01730021
017400         10  FILLER                    PIC X(01)  VALUE  ''.     01740021
017500* audit indicator - top left corner of label (U38)                01750021
017600         10  FILLER                  PIC X(15)    VALUE           01760021
017700             '274200602250352'.                                   01770021
017800         10  PC169-AUDIT-IND         PIC X(01)    VALUE  '@'.     01780021
017900             88  PC169-AUDIT-COMPLETE             VALUE  SPACE.   01790021
018000             88  PC169-QC-SPOT-AUDIT              VALUE  'Q'.     01800021
018100             88  PC169-UNKNOWN                    VALUE  'U'.     01810021
018200             88  PC169-REWORK                     VALUE  'R'.     01820021
018300             88  PC169-100-PERCENT                VALUE  '%'.     01830021
018400         10  FILLER                  PIC X(01)    VALUE  ''.     01840021
018500**  Carton number - top of label                                  01850021
018600         10  FILLER                    PIC X(20)  VALUE           01860021
018700             '241100601850360CRTN:'.                              01870021
018800         10  FILLER                    PIC X(01)  VALUE  ''.     01880021
018900*                                                                 01890021
019000         10  FILLER                    PIC X(15)  VALUE           01900021
019100             '242100601350360'.                                   01910021
019200         10  PC169-CRTN-NBR            PIC X(05).                 01920021
019300         10  FILLER                    PIC X(01)  VALUE  ''.     01930021
019400**  PURCHASE ORDER NUMBER - line                                  01940021
019500         10  FILLER                    PIC X(15)  VALUE           01950021
019600             '232200602240186'.                                   01960021
019700         10  PC169-DES-PO              PIC X(08).                 01970021
019800         10  PC169-DES-PO-DASH         PIC X(01).                 01980021
019900         10  PC169-SEQ-NO              PIC X(03).                 01990021
020000         10  FILLER                    PIC X(01)  VALUE  ''.     02000021
020100**  DEPARTMENT/CLASS NUMBER - line                                02010021
020200         10  FILLER                    PIC X(32)  VALUE           02020021
020300             '231100602200162DEPT-CLASS:      '.                  02030021
020400         10  PC169-DEPT-CLASS          PIC X(06).                 02040021
020500         10  FILLER                    PIC X(01)  VALUE  ''.     02050021
020600**  PO LINE NUMBER & DOWNLOAD LINE RATIO - line                   02060021
020700         10  FILLER                    PIC X(15)  VALUE           02070021
020800             '231100602200146'.                                   02080021
020900         10  PC169-LNE-NO-DESC         PIC X(20).                 02090021
021000         10  PC169-LINE-NO             PIC X(03).                 02100021
021100         10  FILLER                    PIC X(01)  VALUE  ''.     02110021
021200         10  FILLER                    PIC X(06)  VALUE  SPACES.  02120021
021300*                                                                 02130021
021400*                                                                 02140021
021500***** LINE GROUP 4                                                02150021
021600*                                                                 02160021
021700     05  FILLER.                                                  02170021
021800*                                                                 02180021
021900**  INNER PACK UNIT QUANTITY & TOT UNTS IN PACK - line            02190021
022000         10  FILLER                    PIC X(15)  VALUE           02200021
022100             '231100602200130'.                                   02210021
022200         10  PC169-DES-INPK-DESC       PIC X(19).                 02220021
022300         10  PC169-DES-INPK-QTY        PIC X(04).                 02230021
022400         10  FILLER                    PIC X(01)  VALUE  ''.     02240021
022500**  PACKS IN CARTON - line                                        02250021
022600         10  FILLER                    PIC X(15)  VALUE           02260021
022700             '231100602200114'.                                   02270021
022800         10  PC169-DES-UNT-PK-DESC     PIC X(19).                 02280021
022900         10  PC169-DES-UNT-PK-QTY      PIC X(04).                 02290021
023000         10  FILLER                    PIC X(01)  VALUE  ''.     02300021
023100**  DRIVER LINE SKU - line                                        02310021
023200         10  FILLER                    PIC X(15)  VALUE           02320021
023300             '231100602200098'.                                   02330021
023400         10  PC169-DES-DWN-SK-DESC     PIC X(15).                 02340021
023500         10  PC169-DES-DWN-SK-QTY      PIC X(08).                 02350021
023600         10  FILLER                    PIC X(01)  VALUE  ''.     02360021
023700**  STORE ZONE - line                                             02370021
023800         10  FILLER                    PIC X(21)  VALUE           02380021
023900             '231100602200066ZONE: '.                             02390021
024000         10  PC169-DES-ZONE            PIC X(05)  VALUE SPACES.   02400021
024100         10  FILLER                    PIC X(01)  VALUE  ''.     02410021
024200**  P2L MODULE DESCRIPTION (TST-001)                              02420021
024300         10  FILLER                    PIC X(15)  VALUE           02430021
024400             '291100701950013'.                                   02440021
024500         10  PC169-MODULE-NAME         PIC X(07).                 02450021
024600         10  FILLER                    PIC X(01)  VALUE  ''.     02460021
024700**   SKU & pack-id (for prepack orders)                           02470021
024800         10  FILLER                    PIC X(15)  VALUE           02480021
024900             '291100702200225'.                                   02490021
025000         10  PC169-SKU                 PIC X(10).                 02500021
025100         10  FILLER                    PIC X(01)  VALUE  ''.     02510021
025200**  narrow black box/line between carton number & sku/pack id     02520021
025300         10  FILLER                    PIC X(22)  VALUE           02530021
025400             '1X1100000330263L004195'.                            02540021
025500         10  FILLER                    PIC X(01)  VALUE  ''.     02550021
025600         10  FILLER                    PIC X(24)  VALUE  SPACES.  02560021
025700*                                                                 02570021
025800*                                                                 02580021
025900***** LINE GROUP 5                                                02590021
026000*                                                                 02600021
026100     05  FILLER.                                                  02610021
026200**  NARROW BLACK BOX/LINE BETWEEN SKU * PO NUMBER                 02620021
026300         10  FILLER                    PIC X(22)  VALUE           02630021
026400             '1X1100000330217L005195'.                            02640021
026500         10  FILLER                    PIC X(01)  VALUE  ''.     02650021
026600*                                                                 02660021
026700**  NARROW BLACK BOX/LINE BETWEEN STORE ZONE & P2L MODULE DESC    02670021
026800         10  FILLER                    PIC X(22)  VALUE           02680021
026900             '1X1100000330055L005195'.                            02690021
027000         10  FILLER                    PIC X(01)  VALUE  ''.     02700021
027100****************************************************************  02710021
027200***         BLACK BOX AROUND PACK DIVIDE DESCRIPTION           *  02720021
027300*  If this is for a  pre-pack then the following should be     *  02730021
027400*  moved to the PC169-PACK-DIVIDE-BOX                          *  02740021
027500*                '1X1100000330320L020195'.                     *  02750021
027600*  if this is not for an pre-pack then move the following      *  02760021
027700*  to PC169-PACK-DIVIDE-BOX '291100402150030             '     *  02770021
027800****************************************************************  02780021
027900         10  PC169-PACK-DIVIDE-BOX     PIC X(22)  VALUE  SPACES.  02790021
028000         10  FILLER                    PIC X(01)  VALUE  ''.     02800021
028100*==============================================================*  02810021
028200*  If this is for a Pre-Pack then the following should be      *  02820021
028300*  moved to the PC169-PACK-DIVIDE-FIELD                        *  02830021
028400*                '291100402150320*** PACK DIVIDE ***'          *  02840021
028500*  if this is not for a Pre-Pack then move the following       *  02850021
028600*  to PC169-PACK-DIVIDE-FIELD' 291100402150320              '  *  02860021
028700****************************************************************  02870021
028800**  Pack Divide Field                                             02880021
028900         10  PC169-PACK-DIVIDE-FLD     PIC X(34)  VALUE  SPACES.  02890021
029000         10  FILLER                    PIC X(01)  VALUE  ''.     02900021
029100**  INNER PACK CONVEYABLE BOX                                     02910021
029200         10  FILLER                    PIC X(01)  VALUE  ''.     02920021
029300         10  PC169-INPK-BOX            PIC X(22)  VALUE  SPACES.  02930021
029400         10  FILLER                    PIC X(01)  VALUE  ''.     02940021
029500***                                                               02950021
029600****************************************************************  02960021
029700*** added  dmh 3/28/13                                         *  02970021
029800***                                                            *  02980021
029900***         BLACK BOX AROUND RFID                              *  02990021
030000*  If the item in the carton needs RFID applied                *  03000021
030100*     move PC169-RFID-BOX    to  PC169-LBL-RFID-BOX            *  03010021
030200*  otherwise                                                   *  03020021
030300*     move PC169-NO-RFID-BOX to  PC169-LBL-RFID-BOX            *  03030021
030400****************************************************************  03040021
030500         10  PC169-LBL-RFID-BOX      PIC X(22)    VALUE  SPACES.  03050021
030600         10  FILLER                  PIC X(01)    VALUE  ''.     03060021
030700*                                                                 03070021
030800*==============================================================*  03080021
030900*** added  dmh 3/28/13                                         *  03090021
031000*          "RFID" wording on the P2L Destination Label         *  03100021
031100*  if the item in the carton needs RFID applied                *  03110021
031200*     move PC169-RFID-FLD    to  PC169-LBL-RFID-FLD            *  03120021
031300*  otherwise                                                   *  03130021
031400*     move PC169-NO-RFID-FLD to  PC169-LBL-RFID-FLD            *  03140021
031500****************************************************************  03150021
031600**  RFID Field                                                    03160021
031700         10  PC169-LBL-RFID-FLD      PIC X(34)    VALUE  SPACES.  03170021
031800         10  FILLER                  PIC X(01)    VALUE  ''.     03180021
031900*                                                                 03190021
032000**  E    - TERMINATE FIELD GENERATION AND PRINT LABEL             03200021
032100         10  FILLER                    PIC X(02)  VALUE           03210021
032200             'E '.                                                03220021
032300         10  FILLER                    PIC X(01)  VALUE  ''.     03230021
032400**  qA   - CLEAR MEMORY MODULE                                    03240021
032500         10  FILLER                    PIC X(03)  VALUE           03250021
032600             'qA'.                                               03260021
032700         10  FILLER                    PIC X(01)  VALUE  ''.     03270021
032800         10  FILLER                    PIC X(47)  VALUE  SPACES.  03280021
032900**3/28   10  FILLER                    PIC X(105) VALUE  SPACES.  03290021
033000                                                                  03300021
033100 01  PC169-P2L-DESTIN-LBL-TABLE        REDEFINES                  03310021
033200     PC169-P2L-DESTIN-LABEL.                                      03320021
033300     05  PC169-P2L-DEST-LBL-LINE       OCCURS  5 TIMES            03330021
033400                                       INDEXED BY PC169-IDX       03340021
033500                                       PIC X(240).                03350021
033600                                                                  03360021
033700*----------------------------------------------------------------*03370021
033800* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *03380021
033900*----------------------------------------------------------------*03390021
034000 01  PC169-DEST-LBL-LENGTH.                                       03400021
034100     05  FILLER                        PIC 9(03)  VALUE   60.     03410022
034200     05  FILLER                        PIC 9(03)  VALUE  228.     03420021
034300     05  FILLER                        PIC 9(03)  VALUE  234.     03430021
034400     05  FILLER                        PIC 9(03)  VALUE  216.     03440021
034500     05  FILLER                        PIC 9(03)  VALUE  193.     03450021
034600*3/2805  FILLER                        PIC 9(03)  VALUE  135.     03460021
034700                                                                  03470021
034800 01  PC169-DEST-LBL-LNGTH-VALUES REDEFINES PC169-DEST-LBL-LENGTH. 03480021
034900     05  PC169-DEST-LBL-LINE-LENGTH    OCCURS 5 TIMES             03490021
035000                                       INDEXED BY PC169-IDX-2     03500021
035100                                       PIC 9(03).                 03510021
035200                                                                  03520021
035300                                                                  03530021
035400*----------------------------------------------------------------*03540021
035500* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                    *03550021
035600*----------------------------------------------------------------*03560021
035700 01  PC169-LABEL-ALLOCATIONS.                                     03570021
035800     05  PC169-PK-DIVIDE-BOX           PIC X(22) VALUE            03580021
035900               '1X1100000330320L020195'.                          03590021
036000     05  PC169-PK-DIVIDE-FLD           PIC X(34) VALUE            03600021
036100               '291100402150320*** PACK DIVIDE ***'.              03610021
036200     05  PC169-NO-PK-DIVIDE-BOX        PIC X(22) VALUE            03620021
036300               '1X1100000330320L000000'.                          03630021
036400     05  PC169-NO-PK-DIVIDE-FLD        PIC X(34) VALUE            03640021
036500               '291100402150320                   '.              03650021
036600     05  PC169-LABEL-DESCRIPTION       PIC X(11) VALUE            03660021
036700               'CI-DEST LBL'.                                     03670021
036800     05  PC169-LINE-NO-DESC            PIC X(20) VALUE            03680021
036900               'LINE NUMBER:        '.                            03690021
037000     05  PC169-DRVR-LNE-RATIO-DESC     PIC X(20) VALUE            03700021
037100               'DRIVR LINE RATIO:   '.                            03710021
037200     05  PC169-INNER-PACK-DESC         PIC X(19) VALUE            03720021
037300               'INNER PACK UNITS:  '.                             03730021
037400     05  PC169-TOT-UNITS-DESC          PIC X(19) VALUE            03740021
037500               'TOT UNTS IN PACK:  '.                             03750021
037600     05  PC169-PCKS-INCTN-DESC         PIC X(19) VALUE            03760021
037700               'PACKS IN CARTON:   '.                             03770021
037800     05  PC169-DRVR-LINE-DESC          PIC X(15) VALUE            03780021
037900               'DRIVR LNE SKU: '.                                 03790021
038000     05  PC169-INPK-CNVY-BOX           PIC X(22) VALUE            03800021
038100               '1X1100000380129L017183'.                          03810021
038200     05  PC169-NO-INPK-CNVY-BOX        PIC X(22) VALUE            03820021
038300               '1X1100000380129L000000'.                          03830021
038400     05  PC169-INPK-CNVY-DESC          PIC X(19) VALUE            03840021
038500               'INPK CNVY UNITS:   '.                             03850021
038600     05  PC169-REPURP-WGHTS-MSURES     PIC X(34) VALUE            03860021
038700               '291100402150320W/M CHECK NEEDED*  '.              03870021
038800*                                                                 03880021
038900*** dmh added 3/28/13 for RFID changes                            03890021
039000*                                                                 03900021
039100     05  PC169-RFID-BOX              PIC X(22)   VALUE            03910021
039200                                   '1X1100000400063L028065'.      03920021
039300     05  PC169-RFID-FLD              PIC X(34)   VALUE            03930021
039400                          '291100601000062RFID               '.   03940021
039500     05  PC169-RF-EAS-FLD            PIC X(34)   VALUE            03950021
039600                          '291100601000062RFHT               '.   03960021
039700     05  PC169-EAS-FLD               PIC X(34)   VALUE            03970021
039800                          '291100601000062EAS                '.   03980021
039900     05  PC169-NO-RFID-BOX           PIC X(22)   VALUE            03990021
040000                                   '1X1100000400063L000000'.      04000021
040100     05  PC169-NO-RFID-FLD           PIC X(34)   VALUE            04010021
040200                          '291100601000062                   '.   04020021
