000010***************************************************************** 00001000
000020* PCWS256 - CHECK-IN SML - DATA                                 * 00002000
000030* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00003000
000080*  THIS IS THE LAYOUT FOR THE FORM FOR THE SML LABEL USED IN    * 00008000
000090*  THE CHECK-IN APPLICATION WHEN A BATCH PRINTER IS SELECTED    * 00009000
000100*                                                               * 00010000
000200* IT MUST BE PRECEEDED BY FORM RECORDS DESCRIBED IN PCWS255.    * 00020001
000300*                                                               * 00030000
000400* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE   00040000
000500* FIRST POSITION.                                                 00050000
000600* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00060000
000700*                    I M P O R T A N T                          * 00070000
000800* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 3-05 LEVELS * 00080000
000900* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 * 00090000
001000* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  * 00100000
001100* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        * 00110000
001200* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       * 00120000
001300***************************************************************** 00130000
001400                                                                  00140000
001500 01  PC256-MAX-LABEL-LINES            PIC S9(04) VALUE  +04       00150001
001600                                                COMP SYNC.        00160000
001700***                                                               00170000
001800***    NUMBER OF 05 LEVELS ------------------------------/\       00180000
001900***                                                               00190000
002000***    THIS NUMBER MUST MATCH THE NUMBER IN THE "OCCURS"          00200000
002100***    CLAUSE FOUND AT THE BOTTOM OF THIS COPYBOOK                00210000
002200***                                                               00220000
002300***                                                               00230000
002400 01  PC256-SML-LABEL-DATA.                                        00240001
002500*                                                                 00250000
002600* LINE 1                                                          00260000
002601     05 FILLER.                                                   00260102
002602*                                                                 00260201
002610* CASI - AUDIT INDICATOR                                          00261001
002611*                                                                 00261101
002620         10 FILLER                    PIC X(04) VALUE             00262001
002630            'U01'.                                               00263001
002640         10 PC256-AUDIT-IND           PIC X(01).                  00264001
002650             88  PC256-AUDIT-COMPLETE           VALUE  SPACE.     00265001
002660             88  PC256-QC-SPOT-AUDIT            VALUE  'Q'.       00266001
002670             88  PC256-UNKNOWN                  VALUE  'U'.       00267001
002680             88  PC256-REWORK                   VALUE  'R'.       00268001
002690             88  PC256-100-PERCENT              VALUE  '%'.       00269001
002691         10 FILLER                    PIC X(01) VALUE  ''.       00269101
002692*                                                                 00269201
002693* STORE NUMBER                                                    00269301
002694*                                                                 00269401
002695         10 FILLER                    PIC X(04) VALUE             00269501
002696            'U02'.                                               00269601
002697         10 PC256-SML-STR-NBR         PIC X(04) VALUE SPACE.      00269701
002698         10 FILLER                    PIC X(01) VALUE  ''.       00269801
002699*                                                                 00269901
002700* CARTON ID                                                       00270001
002701*                                                                 00270101
002702         10 FILLER                    PIC X(04) VALUE             00270201
002703            'U04'.                                               00270301
002704         10 PC256-CARTON-ID           PIC X(05) VALUE SPACES.     00270401
002705            88  PC256-SMTH-CRTN                 VALUE '@@@@@'.    00270501
002706         10 FILLER                    PIC X(01) VALUE  ''.       00270601
002707*                                                                 00270701
002708* DOOR HEADING                                                    00270801
002709*                                                                 00270901
002711         10 FILLER                    PIC X(04) VALUE             00271101
002712            'U05'.                                               00271201
002713         10 PC256-DOOR-HDG            PIC X(05) VALUE SPACE.      00271301
002714            88  PC256-DOOR-HDG-YES              VALUE 'DOOR:'.    00271401
002715            88  PC256-DOOR-HDG-NO               VALUE '@@@@@'.    00271501
002716         10 FILLER                    PIC X(01) VALUE  ''.       00271601
002717*                                                                 00271701
002718* DOOR NUMBER                                                     00271801
002719*                                                                 00271901
002721         10 FILLER                    PIC X(04) VALUE             00272101
002722            'U06'.                                               00272201
002723         10 PC256-DOOR-NUMBER         PIC X(04) VALUE SPACE.      00272301
002724            88  PC256-DOOR-NBR-NO               VALUE '@@@@'.     00272404
002726         10 FILLER                    PIC X(01) VALUE  ''.       00272601
002727*                                                                 00272701
002728* PO-RCVR                                                         00272801
002729*                                                                 00272901
002730         10 FILLER                    PIC X(04) VALUE             00273001
002731            'U08'.                                               00273101
002732         10 PC256-PO-RCVR             PIC 9(12) VALUE ZEROES.     00273201
002733         10 FILLER                    PIC X(01) VALUE  ''.       00273301
002734*                                                                 00273401
002735* LINE NBR/PACK-ID                                                00273501
002736*                                                                 00273601
002737         10 FILLER                    PIC X(04) VALUE             00273701
002738            'U10'.                                               00273801
002739         10 PC256-LINE-NBR            PIC Z(03) VALUE ZEROES.     00273901
002740         10 FILLER                    PIC X(01) VALUE  ''.       00274001
002741*                                                                 00274101
002742* SKU                                                             00274201
002743*                                                                 00274301
002744         10 FILLER                    PIC X(04) VALUE             00274401
002745            'U12'.                                               00274501
002746         10 PC256-SKU                 PIC X(16) VALUE SPACES.     00274601
002747         10 FILLER                    PIC X(01) VALUE  ''.       00274701
002748*                                                                 00274801
002749* STYLE                                                           00274901
002750*                                                                 00275001
002751         10 FILLER                    PIC X(04) VALUE             00275101
002752            'U14'.                                               00275201
002753         10 PC256-STYLE               PIC X(20).                  00275301
002754         10 FILLER                    PIC X(01) VALUE  ''.       00275401
002755*                                                                 00275501
002756* OUTER PACK UNIT                                                 00275601
002757*                                                                 00275701
002758         10 FILLER                    PIC X(04) VALUE             00275801
002759            'U17'.                                               00275901
002760         10 PC256-OTPK-UNIT           PIC X(04).                  00276001
002761         10 FILLER                    PIC X(01) VALUE  ''.       00276101
002762*                                                                 00276201
002763* PLAN-O-GRAM PROGRAM NAME                                        00276301
002764*                                                                 00276401
002765         10 FILLER                    PIC X(04) VALUE             00276501
002766            'U18'.                                               00276601
002767         10 PC256-POG-PROGRAM-NAME    PIC X(35).                  00276701
002768         10 FILLER                    PIC X(01) VALUE  ''.       00276801
002769*                                                                 00276901
002770* STORE ON HAND ZERO -OR- ERROR MESSAGE                           00277003
002771*                                                                 00277101
002772         10 FILLER                    PIC X(04) VALUE             00277201
002773            'U19'.                                               00277301
002774         10 PC256-ON-HAND-ERR-MSG     PIC X(35).                  00277403
002775            88 PC256-OH-ZERO-MSG-YES            VALUE             00277501
002776               'PROCESS FIRST - ZERO ON HAND       '.             00277601
002781            88 PC256-OH-ZERO-MSG-NO             VALUE             00278111
002782               '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.             00278211
002783         10 FILLER                    PIC X(01) VALUE  ''.       00278311
002784*                                                                 00278411
002785         10 FILLER                    PIC X(36) VALUE SPACES.     00278511
002786*                                                                 00278611
002787* LINE 2                                                          00278711
002788*                                                                 00278811
002789     05 FILLER.                                                   00278911
002790*                                                                 00279011
002791* SEASONAL SET HEADING                                            00279111
002792*                                                                 00279211
002793         10 FILLER                    PIC X(04) VALUE             00279311
002794            'U20'.                                               00279411
002795         10 PC256-SEASET-HDG          PIC X(05).                  00279511
002796            88 PC256-SEASET-HDG-NO              VALUE '@@@@@'.    00279611
002797            88 PC256-SEASET-HDG-YES             VALUE '@@@@@'.    00279715
002798            88 PC256-TRIP-HDG                   VALUE 'TRIP:'.    00279811
002799         10 FILLER                    PIC X(01) VALUE  ''.       00279911
002800*                                                                 00280011
002801* SEASONAL SET INFORMATION                                        00280111
002802*                                                                 00280211
002803         10 FILLER                    PIC X(04) VALUE             00280311
002804            'U21'.                                               00280411
002805         10 PC256-SEASET              PIC X(25).                  00280511
002806            88 PC256-SEASET-NO                  VALUE             00280611
002807               '@@@@@@@@@@@@@@@@@@@@@@@@@'.                       00280711
002808         10 FILLER                    PIC X(01) VALUE  ''.       00280811
002810*                                                                 00281002
002811* MERCHANDISE GROUP                                               00281102
002812*                                                                 00281202
002813         10 FILLER                    PIC X(04) VALUE             00281302
002814            'U23'.                                               00281402
002815         10 PC256-MDSE-GROUP          PIC X(02).                  00281502
002816         10 FILLER                    PIC X(01) VALUE  ''.       00281602
002817*                                                                 00281702
002818* PRESENTATION INDICATOR                                          00281802
002819*                                                                 00281902
002820         10 FILLER                    PIC X(04) VALUE             00282002
002821            'U24'.                                               00282102
002822         10 PC256-PRESENTATION        PIC X(04).                  00282206
002823             88  PC256-DEFLT-PRESENTATION       VALUE  '@@@@'.    00282302
002824             88  PC256-HANG                     VALUE  'HANG'.    00282402
002825             88  PC256-FOLD                     VALUE  'FOLD'.    00282502
002826         10 FILLER                    PIC X(01) VALUE  ''.       00282602
002827*                                                                 00282702
002828* FIXTURE HDG                                                     00282813
002829*                                                                 00282902
002830         10 FILLER                    PIC X(04) VALUE             00283002
002831            'U25'.                                               00283113
002832         10 PC256-FIXTURE-HDG         PIC X(08).                  00283214
002833             88  PC256-FIXTURE-HDG-YES     VALUE 'FIXTURE#'.      00283313
002834             88  PC256-FIXTURE-HDG-NO      VALUE '@@@@@@@@'.      00283413
002835         10 FILLER                    PIC X(01) VALUE  ''.       00283502
002836*                                                                 00283613
002837* FIXTURE DATA                                                    00283713
002838*                                                                 00283813
002839         10 FILLER                    PIC X(04) VALUE             00283913
002840            'U26'.                                               00284013
002841         10 PC256-FIXTURE             PIC X(10).                  00284113
002842         10 FILLER                    PIC X(01) VALUE  ''.       00284213
002843*                                                                 00284313
002844* TEXT LINE 1                                                     00284413
002845*                                                                 00284513
002846         10 FILLER                    PIC X(04) VALUE             00284613
002847            'U27'.                                               00284713
002848         10 PC256-TEXT-1              PIC X(12).                  00284813
002849            88 PC256-TEXT-1-NO            VALUE '@@@@@@@@@@@@'.   00284913
002850         10 FILLER                    PIC X(01) VALUE  ''.       00285013
002851*                                                                 00285113
002852* TEXT LINE 2                                                     00285213
002853*                                                                 00285313
002854         10 FILLER                    PIC X(04) VALUE             00285413
002855            'U28'.                                               00285513
002856         10 PC256-TEXT-2              PIC X(12).                  00285613
002857            88 PC256-TEXT-2-NO            VALUE '@@@@@@@@@@@@'.   00285713
002858         10 FILLER                    PIC X(01) VALUE  ''.       00285813
002859*                                                                 00285913
002860* TEXT LINE 3                                                     00286013
002861*                                                                 00286113
002862         10 FILLER                    PIC X(04) VALUE             00286213
002863            'U29'.                                               00286313
002864         10 PC256-TEXT-3              PIC X(12).                  00286413
002865            88 PC256-TEXT-3-NO            VALUE '@@@@@@@@@@@@'.   00286513
002866         10 FILLER                    PIC X(01) VALUE  ''.       00286613
002867*                                                                 00286713
002868* TEXT LINE 4                                                     00286813
002869*                                                                 00286913
002870         10 FILLER                    PIC X(04) VALUE             00287013
002871            'U30'.                                               00287113
002872         10 PC256-TEXT-4              PIC X(12).                  00287213
002873            88 PC256-TEXT-4-NO            VALUE '@@@@@@@@@@@@'.   00287313
002874         10 FILLER                    PIC X(01) VALUE  ''.       00287413
002875*                                                                 00287513
002876* EAS SECURITY TAG NEEDED                                         00287613
002877*                                                                 00287713
002878         10 FILLER                    PIC X(04) VALUE             00287813
002879            'U31'.                                               00287913
002880         10 PC256-EAS-TAG             PIC X(03).                  00288013
002881            88 PC256-EAS-TAG-YES                VALUE 'EAS'.      00288113
002882            88 PC256-EAS-TAG-NO                 VALUE '@@@'.      00288213
002883         10 FILLER                    PIC X(01) VALUE  ''.       00288313
002884*                                                                 00288413
002885* NUMBER ABOVE BARCODE                                            00288513
002886*                                                                 00288613
002887         10 FILLER                    PIC X(04) VALUE             00288713
002888            'U32'.                                               00288813
002889         10 PC256-BARCODE-TEXT        PIC X(25).                  00288913
002890         10 FILLER                    PIC X(01) VALUE  ''.       00289013
002891*                                                                 00289113
002892* BARCODE                                                         00289213
002893*                                                                 00289313
002894         10 FILLER                    PIC X(04) VALUE             00289413
002895            'U33'.                                               00289513
002896         10 FILLER                    PIC X(01) VALUE             00289613
002897            'C'.                                                  00289713
002898         10 PC256-SML-BARCODE         PIC X(20).                  00289813
002899         10 PC256-BARCODE-REDEF REDEFINES PC256-SML-BARCODE.      00289913
002900            15 PC256-AUDIT-BARCODE    PIC X(09).                  00290013
002901            15 PC256-AUDIT-FILLER     PIC X(11).                  00290113
002902         10 FILLER                    PIC X(01) VALUE  ''.       00290213
002903*                                                                 00290313
002904         10 FILLER                    PIC X(24) VALUE SPACES.     00290413
002905*                                                                 00290513
002906* LINE 3                                                          00290613
002907*                                                                 00290713
002908     05 FILLER.                                                   00290813
002909*                                                                 00290913
002910* LABEL # OF                                                      00291013
002911*                                                                 00291113
002912         10 FILLER                    PIC X(04) VALUE             00291213
002913            'U36'.                                               00291313
002914         10 PC256-LABEL-NBR           PIC X(04) VALUE '@@@@'.     00291413
002915         10 FILLER                    PIC X(01) VALUE  ''.       00291513
002916*                                                                 00291613
002917* " OF " LITERAL BOTTOM OF LABEL                                  00291713
002918*                                                                 00291813
002919         10 FILLER                    PIC X(04) VALUE             00291913
002920            'U37'.                                               00292013
002921         10 PC256-LABEL-OF            PIC X(04) VALUE '@@@@'.     00292113
002922         10 FILLER                    PIC X(01) VALUE  ''.       00292213
002923*                                                                 00292313
002924* TOTAL LABEL COUNT                                               00292413
002925*                                                                 00292513
002926         10 FILLER                    PIC X(04) VALUE             00292613
002927            'U38'.                                               00292713
002928         10 PC256-TOT-LABEL           PIC X(04) VALUE '@@@@'.     00292813
002930         10 FILLER                    PIC X(01) VALUE  ''.       00293013
013700*                                                                 01370000
014658         10 FILLER                    PIC X(213) VALUE SPACES.    01465803
014659*                                                                 01465900
014660* LINE 4                                                          01466000
014661*  E   -  TERMINATE FIELD GENERATION AND PRINT LABEL              01466100
014662*         PC256-SML-LBL-QTY = # OF COPIES FOR EACH LABEL          01466201
014663*                                                                 01466300
014664     05 FILLER.                                                   01466400
014665         10 FILLER                    PIC X(02) VALUE             01466500
014666            'E'.                                                 01466600
014667         10 PC256-SML-LBL-QTY         PIC 9(04) VALUE ZEROES.     01466701
014668         10 FILLER                    PIC X(01) VALUE  ''.       01466800
014669*                                                                 01466900
014670*  G   - PRINTS PREVIOUSLY STORED OR PRINTED LABEL COMMANDS       01467000
014680*                                                                 01468000
014690         10 FILLER                    PIC X(02) VALUE             01469000
014700            'G'.                                                 01470000
014800         10 FILLER                    PIC X(01) VALUE  ''.       01480000
014900         10 FILLER                    PIC X(230) VALUE SPACES.    01490000
015000                                                                  01500000
015100* LABEL OCCURS IS THE NUMBER OF 'VARIABLE' FIELDS THAT            01510000
015200* SENT TO THE LABEL.  IF ADDITIONAL FIELDS ARE ADDED OR           01520000
015300* REMOVED THE OCCURS STATEMENT BELOW SHOULD BE ADJUSTED           01530000
015400                                                                  01540000
015500 01  PC256-SML-LABEL-DATA-TABLE                                   01550001
015600             REDEFINES PC256-SML-LABEL-DATA.                      01560001
015700     05 PC256-SML-LABEL-LINE OCCURS 4 TIMES                       01570001
015800                           INDEXED BY PC256-IDX                   01580001
015900                                      PIC X(240).                 01590000
016000*----------------------------------------------------------------*01600000
016100* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01610000
016200*----------------------------------------------------------------*01620000
016300 01  PC256-DTL-LBL-DATA-LENGTH.                                   01630001
016400     05  FILLER                        PIC 9(03)    VALUE 204.    01640002
016500     05  FILLER                        PIC 9(03)    VALUE 216.    01650013
016600     05  FILLER                        PIC 9(03)    VALUE  27.    01660003
016700     05  FILLER                        PIC 9(03)    VALUE  10.    01670000
016800                                                                  01680000
016900 01  PC256-DTL-LBL-DATA-LNGTH-VALUE  REDEFINES                    01690001
017000         PC256-DTL-LBL-DATA-LENGTH.                               01700001
017100     05  PC256-DTL-DATA-LNE-LNGTH     OCCURS 4 TIMES              01710001
017200                                      INDEXED BY PC256-IDX-2      01720001
017300                                      PIC 9(03).                  01730000
017400                                                                  01740000
