000200****************************************************************  00020001
000300*                        PCWS044                               *  00030003
000400*                                                              *  00040001
000500*  THIS IS THE COPYBOOK MEMEBER THAT WILL CONTAIN THE MESSAGES *  00050001
000600*  USED FOR TRAILER AUDIT MANIFESTING RF SYSTEM                   00060003
000700*  LENGTH                                                         00070001
000800****************************************************************  00080001
000900 01  PC044-PGM-MSG-DATA.                                          00090001
001000     05  PC044-DB2-FATAL-ERROR-MSG       PIC  X(19)  VALUE        00100001
001100         'DB2 ERR/HELP DESK  '.                                   00110001
001200     05  PC044-TRANS-NOT-AVAILABLE-MSG   PIC  X(19)  VALUE        00120001
001300         'TRANS NOT AVAILABLE'.                                   00130001
001400     05  PC044-CICS-FATAL-ERROR-MSG      PIC  X(19)  VALUE        00140001
001500         'CICS ERR/HELP DESK '.                                   00150001
001600     05  PC044-UNRECOGNIZED-PF-KEY-MSG   PIC  X(19)  VALUE        00160001
001700         'UNRECOGNIZED PF KEY'.                                   00170001
001800     05  PC044-SYSTEM-ERROR-MSG          PIC  X(19)  VALUE        00180001
001900         'SYSTEM ERR/HELP DES'.                                   00190001
002000     05  PC044-NUMERIC-VAL-REQ-MSG        PIC X(19)  VALUE        00200006
002100         'NUMERIC VALUE REQ. '.                                   00210001
002200     05  PC044-INVALID-SELECTION-MSG     PIC  X(19)  VALUE        00220001
002300         'INVALID SELECTION  '.                                   00230001
002400     05  PC044-DB2-ACCESS-ERROR-MSG      PIC  X(19)  VALUE        00240001
002500         'DB2 ACCESS ERROR   '.                                   00250001
002800     05  PC044-NOT-A-DC-MSG              PIC  X(19)  VALUE        00280001
002900         'NOT A VALID DC     '.                                   00290001
003000     05  PC044-UPC-NOT-FOUND-MSG         PIC  X(19)  VALUE        00300001
003100         'UPC DOES NOT EXIST '.                                   00310001
003200     05  PC044-UPC-NOT-VALID-MSG         PIC  X(19)  VALUE        00320001
003300         'UPC NOT VALID      '.                                   00330001
003600     05  PC044-UPC-NOT-NUMERIC-MSG       PIC  X(19)  VALUE        00360001
003700         'UPC NOT NUMERIC    '.                                   00370001
003800     05  PC044-SKU-NOT-NUMERIC-MSG       PIC  X(19)  VALUE        00380001
003900         'SKU NOT NUMERIC    '.                                   00390001
004000     05  PC044-SKU-NOT-VALID-MSG         PIC  X(19)  VALUE        00400001
004100         'SKU NOT VALID      '.                                   00410001
004200     05  PC044-NO-VNDR-NAME-FOUND-MSG    PIC  X(19)  VALUE        00420001
004300         'NO VNDR NAME FOUND '.                                   00430001
004400     05  PC044-ENTER-THROUGH-MENU-MSG    PIC  X(19)  VALUE        00440001
004500         'ENTER THROUGH MENU '.                                   00450001
004800     05  PC044-ACCESS-DENIED-MSG         PIC  X(19)  VALUE        00480001
004900         'USER NOT AUTHORIZED'.                                   00490001
005000     05  PC044-CICS-AUTH-ERROR-MSG       PIC  X(19)  VALUE        00500001
005100         'CICSAUTH BAD RETURN'.                                   00510001
005200     05  PC044-ONLY-ONE-SELECTION-MSG    PIC  X(19)  VALUE        00520001
005300         'SELECT ONLY ONE    '.                                   00530001
005400     05  PC044-AUDIT-NOT-FOUND-MSG       PIC  X(19)  VALUE        00540001
005500         'AUDIT NBR NOT FOUND'.                                   00550001
005600     05  PC044-PF2-CONTINUE-MSG          PIC  X(19)  VALUE        00560001
005700         'UPD COMPLT F2-CONT '.                                   00570001
005800     05  PC044-INVALID-PRINTER-ID-MSG    PIC  X(19)  VALUE        00580001
005900         'INVALID PRINTER ID '.                                   00590001
006000     05  PC044-PRINTER-ID-REQUIRED-MSG   PIC  X(19)  VALUE        00600001
006100         'PRINTER ID REQUIRED'.                                   00610001
006200     05  PC044-RPT-PRINTED-MSG           PIC  X(19)  VALUE        00620001
006300         'REPORT PRINTED     '.                                   00630001
006400     05  PC044-SELECT-TYPE-MSG           PIC  X(19)  VALUE        00640001
006500         'SELECT AUDIT TYPE  '.                                   00650001
006600     05  PC044-ALREADY-CLOSED-MSG        PIC  X(19)  VALUE        00660001
006700         'ALREADY CLOSED     '.                                   00670001
006800     05  PC044-ALREADY-POSTPONED-MSG     PIC  X(19)  VALUE        00680001
006900         'ALREADY POSTPONED  '.                                   00690001
007000     05  PC044-AUDIT-CLOSE-MSG           PIC  X(19)  VALUE        00700001
007100         'AUDIT CLOSED       '.                                   00710001
007200     05  PC044-SHIP-UNIT-CLOSE-MSG       PIC  X(19)  VALUE        00720001
007300         'CARTON CLOSED      '.                                   00730001
007400     05  PC044-SHIP-UNIT-POSTPONED-MSG   PIC  X(19)  VALUE        00740001
007500         'CARTON POSTPONED   '.                                   00750001
007600     05  PC044-CONFIRM-RESTART-MSG       PIC  X(19)  VALUE        00760001
007700         'F2 - RESTART CARTON'.                                   00770001
007800     05  PC044-CANCEL-RESTART-MSG        PIC  X(19)  VALUE        00780001
007900         'RESTART CANCELED   '.                                   00790001
008000     05  PC044-CONFIRM-CLOSE-MSG         PIC  X(19)  VALUE        00800001
008100         'F2 TO CLOSE AUDIT  '.                                   00810001
008200     05  PC044-UPC-REQUIRED-MSG          PIC  X(19)  VALUE        00820001
008300         'UPC REQUIRED       '.                                   00830001
008400     05  PC044-ERROR-EXISTS-MSG          PIC  X(19)  VALUE        00840001
008500         'AUDIT ERROR EXISTS '.                                   00850001
008600     05  PC044-AUDIT-POSTPONED-MSG       PIC  X(19)  VALUE        00860001
008700         'AUDIT IS POSTPONED '.                                   00870001
008800     05  PC044-NO-PRINT-MSG              PIC  X(19)  VALUE        00880001
008900         'NO PRINT/HELP DESK '.                                   00890001
009000     05  PC044-OPEN-CARTON-MSG.                                   00900001
009100         10  PC044-CTN-COUNT             PIC ZZ9.                 00910001
009200         10  FILLER                      PIC X(16)   VALUE        00920001
009300         ' CTNS STILL OPEN'.                                      00930001
009400     05  PC044-F3-NOT-VALID-MSG          PIC  X(19)  VALUE        00940001
009500         'F3 - NOT VALID     '.                                   00950001
009600     05  PC044-CREATE-CNTL-NBR-MSG       PIC  X(19)  VALUE        00960001
009700         'CREATE NEW CNTL NBR'.                                   00970001
009800     05  PC044-CONFIRM-CONT-MSG          PIC  X(19)  VALUE        00980001
009900         'F2 TO CONFIRM CONT.'.                                   00990001
011000     05  PC044-TRLR-NBR-REQ-MSG          PIC  X(19)  VALUE        01100002
011200         'TRLR NUMBER REQUIRD'.                                   01120004
011210     05  PC044-AUD-NBR-REQ-MSG           PIC  X(19)  VALUE        01121007
011220         'AUDIT NBR REQUIRED '.                                   01122007
011300     05  PC044-TRLR-NBR-INVALID          PIC  X(19)  VALUE        01130004
011400         'TRLR NUMBER INVALID'.                                   01140004
011700     05  PC044-TRIP-NOT-ACTIVE           PIC  X(19)  VALUE        01170004
011800         'TRIP NOT ACTIVE    '.                                   01180004
