000100******************************************************************00010000
000200**                        PCWS014                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT USED WHEN     **00040000
000500**  PASSING INFORMATION BETWEEN CARTON LABEL PROGRAMS.          **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  PC014-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                      PIC  X(01).          00100000
001100             15  PC014-LBL-FMT               PIC  9(03).          00110000
001200             15  PC014-PRTR-ID               PIC  9(03).          00120000
001300             15  PC014-PRTR-DESC             PIC  X(25).          00130000
001400             15  PC014-LU-NAME               PIC  X(08).          00140000
001500             15  PC014-PRC-AREA              PIC  X(06).          00150000
001600             15  PC014-PRC-AREA-CDE          PIC  X(03).          00160000
001700             15  PC014-CART-CT               PIC  X(04).          00170000
001800             15  PC014-PO-NBR                PIC  X(08).          00180000
001900             15  PC014-RCVR-SEQ-NBR          PIC  X(03).          00190000
002000             15  PC014-PO-NBR-OLD            PIC  X(08).          00200000
002100             15  PC014-RCVR-SEQ-NBR-OLD      PIC  X(03).          00210000
002200             15  PC014-RCVR-SEQ-NBR-TX       PIC  X(03).          00220000
002300             15  PC014-RCVD-DATE             PIC  X(08).          00230000
002300                 88  PC014-RCVD-ENROUTE VALUE '09099999'.         00231004
002400             15  PC014-VEND-NAME             PIC  X(25).          00240000
002500             15  PC014-AD-DATE               PIC  X(08).          00250000
002600             15  PC014-PIC-INFO              PIC  X(08).          00260000
002700             15  PC014-SPECIAL-INST          PIC  X(25).          00270000
002800             15  PC014-MULT-SHIPMENTS        PIC  X(01).          00280000
002900             15  PC014-PRE-TKT               PIC  X(01).          00290002
003000             15  PC014-PACKED-BY-STR         PIC  X(15).          00300000
003100             15  PC014-TICKET-TYPE           PIC  X(06).          00310000
003200             15  PC014-DETAIL-CHECK          PIC  X(01).          00320000
003210             15  PC014-GARMENT-ON-HANGER     PIC  X(01).          00321001
003300             15  PC014-OPER-UNT-ID           PIC  X(04).          00330002
003301             15  PC014-FCLTY-ID              PIC  X(04).          00330102
003310             15  PC014-DEPT                  PIC  X(03).          00331002
003400             15  PC014-CLASS                 PIC  X(02).          00340000
003500             15  PC014-PRIOR-SCREEN-SW       PIC  X(01).          00350000
003600                 88  PC014-PRIOR-SCREEN-CARTON    VALUE 'C'.      00360000
003700             15  PC014-TRIP-ID               PIC  X(09).          00370005
