000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE P2L CASEPACK    00020000
000300*    LIST PROGRAMS                                                00030000
000400*    LENGTH = 200 BYTES                                           00040000
000500******************************************************************00050000
000600         10  PC122-INTER-APPL-COMMAREA  REDEFINES                 00060000
000700                                        INTER-APPL-COMM-AREA.     00070000
000800             15  FILLER                     PIC X.                00080000
000900             15  PC122-NUMBER-OF-SELECTED-ITEMS                   00090000
001000                                            PIC S9(09) COMP-3.    00100000
001100             15  PC122-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00110000
001200             15  PC122-SEL-QUEUE-NAME       PIC X(08).            00120000
001300             15  PC122-OPER-UNT-ID          PIC S9(04) COMP.      00130000
001400             15  PC122-FCLTY-ID             PIC S9(04) COMP.      00140000
001500             15  PC122-CURR-OPER-UNT-ID     PIC S9(04) COMP.      00150000
001600             15  PC122-CURR-FCLTY-ID        PIC S9(04) COMP.      00160000
001700             15  PC122-PO-NBR               PIC S9(09) COMP.      00170000
001800             15  PC122-REC-SEQ-NBR          PIC S9(09) COMP.      00180000
001900             15  PC122-DPT-NBR              PIC X(03).            00190000
002000             15  PC122-SML-P2L-PRTR-ID      PIC X(08).            00200000
002100             15  PC122-PGYBCK-PRTR-ID       PIC X(08).            00210000
002110             15  PC122-DFLT-STR-ZN-ID       PIC X(05).            00211000
002120             15  PC122-CRE-LBL-IND          PIC X(01).            00212000
002130                 88  PC122-CRE-BOTH-LBL                VALUE 'B'. 00213000
002140                 88  PC122-CRE-P2L-LBL                 VALUE 'P'. 00214000
002150                 88  PC122-CRE-SML-LBL                 VALUE 'C'. 00215000
002151             15  PC122-P2L-PRT-HDR-SW      PIC  X(01).            00215100
002152                  88  PC122-PRINT-P2L-HDRS             VALUE 'Y'. 00215200
002153                  88  PC122-SUPRESS-P2L-HDRS           VALUE 'N'. 00215300
002154             15  PC122-LBL-PRT-ORDER        PIC X(01).            00215400
002155                 88  PC122-LBL-PRT-SHUFFLED            VALUE 'S'. 00215500
002156                 88  PC122-LBL-PRT-STR-ORD             VALUE 'R'. 00215600
002157             15  PC122-DC-PRTD-AT           PIC X(02).            00215700
002158             15  PC122-PKGNG-CD             PIC X.                00215800
002159                 88  PC122-PRE-PACK-ORDER         VALUE 'I', 'M'. 00215900
002160                 88  PC122-INNER-PREPK            VALUE 'I'.      00216000
002170                 88  PC122-MULTI-SKU-PREPK        VALUE 'M'.      00217000
002180                 88  PC122-SINGLE-SKU-PREPK       VALUE 'S'.      00218000
002190                 88  PC122-CASEPACK               VALUE 'C'.      00219000
002200                 88  PC122-BULK-PACK              VALUE 'B'.      00220000
002300             15  PC122-DSPLY-PKGNG-CD       PIC X.                00230000
002310                 88  PC122-DSP-PRE-PACK-ORDER     VALUE 'I', 'M'. 00231000
002320                 88  PC122-DSP-INNER-PREPK        VALUE 'I'.      00232000
002330                 88  PC122-DSP-MULTI-SKU-PREPK    VALUE 'M'.      00233000
002340                 88  PC122-DSP-SINGLE-SKU-PREPK   VALUE 'S'.      00234000
002350                 88  PC122-DSP-CASEPACK           VALUE 'C'.      00235000
002360                 88  PC122-DSP-BULK-PACK          VALUE 'B'.      00236000
002361             15  PC122-TRIP-ARRIVE-DATE         PIC  X(10).       00236101
002362             15  PC122-TRIP-ARRIVE-DATE-R                         00236201
002363                 REDEFINES PC122-TRIP-ARRIVE-DATE.                00236301
002364                 20  PC122-TRIP-ARRIVE-CCYY     PIC  X(04).       00236401
002365                 20  PC122-TRIP-ARRIVE-DASH1    PIC  X(01).       00236501
002366                 20  PC122-TRIP-ARRIVE-MM       PIC  X(02).       00236601
002367                 20  PC122-TRIP-ARRIVE-DASH2    PIC  X(01).       00236701
002368                 20  PC122-TRIP-ARRIVE-DD       PIC  X(02).       00236801
002370             15  FILLER                     PIC X(126).           00237001
