000100******************************************************************00010000
000200*  COMMAREA LAYOUT TO PASS THE PO/RCVR NBR TO THE MODULE USED TO *00020000
000300*  START WORK ORDERS.                                            *00030000
000400*  LENGTH = 300                                                  *00040002
000500******************************************************************00050000
000600*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.* 00060000
000700* PCWS027:                                                        00070000
000800*                                                                 00080000
000900*  THIS CONTAINS THE PARAMETER LIST NEEDED TO CALL THE            00090000
001000*  KOHL'S START WORK ORDER MODULE, PCKUT027.                      00100000
001100*                                                                 00102000
001200*  THE CALL STRUCTURE MUST BE:                                    00103000
001300*                                                                 00104000
001400*      CALL PC027-STRT-WO-PGM USING PC027-COMMAREA-REC.           00105000
001600*                                                                 00107000
001700*  INITIALIZE BEFORE SETTING UP EACH PO RCVR REQUEST:             00108000
001900*      INITIALIZE PC027-COMMAREA-REC.                             00109000
002000*                                                                 00110000
002100*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.* 00120000
002200 01  PC027-STRT-WO-PGM           PIC X(08) VALUE 'PCKUT027'.      00130000
002200 01  PC027-COMMAREA              PIC X(01) VALUE SPACES.          00150000
002300                                                                  00160000
002400 01  PC027-COMMAREA-REC.                                          00170000
003300     05  PC027-CALLING-PGM-NAME        PIC X(08)  VALUE SPACES.   00200003
003300     05  PC027-CALL-RETURN-AREA.                                  00201003
003400         10  PC027-CRA-RET-CDE         PIC  X(02)  VALUE ZEROES.  00210000
003500             88  PC027-SUCCESSFUL                  VALUE '00'.    00220000
003600             88  PC027-ERROR                       VALUE '01'.    00230000
003700             88  PC027-SQL-ERROR                   VALUE '02'.    00240000
003800             88  PC027-DATABASE-BUSY               VALUE '03'.    00250000
004000         10  PC027-CRA-RET-MSG         PIC  X(25)  VALUE SPACES.  00280000
004100         10  PC027-CRA-REQ-ID          PIC  X(08)  VALUE SPACES.  00290000
005000     05  PC027-SQLCA                   PIC X(136).                00300000
004200     05  PC027-PO-NBR              PIC S9(09) COMP VALUE ZEROES.  00310000
004400     05  PC027-REC-SEQ-NBR         PIC S9(09) COMP VALUE ZEROES.  00320000
004400     05  PC027-OPER-UNT-ID         PIC S9(04) COMP VALUE ZEROES.  00340000
004500     05  PC027-FCLTY-ID            PIC S9(04) COMP VALUE ZEROES.  00350000
004600*                                                                 00370000
