000001***************************************************************** 00000100
000002*                                                               * 00000200
000003* THIS COPYBOOK HAS CHANGES REQUIRED FOR STORE NUMBER EXPANSION * 00000300
000004*                                                               * 00000400
000005***************************************************************** 00000500
000006* PCWS151 - Shipping Manifest Label - FORM                      * 00000600
000007*                                                               * 00000700
000008*  This is the layout for the SML label form used in label      * 00000800
000009*  creation when sending to a batch printer using sockets.      * 00000900
000010* The label commands are strung together under only 4-05 levels * 00001000
000011* Each label command is separated by an end of text char-hex 03 * 00001100
000012* This was done to try to speed up transmission via new socket  * 00001200
000013* interface.  Systec's software separates 05 levels into        * 00001300
000014* statements.  The maximum length is 240.                       * 00001400
000020***************************************************************** 00002000
000030 01  PC151-SML-LABEL-FORM-MAX-LN       PIC 9(03)    VALUE  5.     00003000
000040***    NUMBER OF 05 LEVELS --------------------------------/\     00004000
000050***                                                               00005000
000060***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00006000
000070***               IN PC151-SML-LABEL-FORM-LENGTH.                 00007000
000080***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE       00008000
000090***                                                               00009000
000100***************************************************************** 00010000
000200 01  PC151-SML-LBL-FORM.                                          00020000
000210*                                                                 00021000
000220*** - label line 1                                                00022000
000230*                                                                 00023000
000240     05  FILLER.                                                  00024000
000250* c0000 - Continuous paper length - 0000 = normal operation       00025000
000260         10  FILLER                  PIC X(06)    VALUE           00026000
000270             'c0000'.                                            00027000
000280         10  FILLER                  PIC X(01)    VALUE  ''.     00028000
000290* e     - Select edge sensor - DEFAULT                            00029000
000300         10  FILLER                  PIC X(02)    VALUE           00030000
000400             'e'.                                                00040000
000500         10  FILLER                  PIC X(01)    VALUE  ''.     00050000
000600* M1030 - Maximum label length                                    00060000
000700         10  FILLER                  PIC X(06)    VALUE           00070000
000800             'M1030'.                                            00080000
000900         10  FILLER                  PIC X(01)    VALUE  ''.     00090000
001000*  Replaced a command with KcFMN to disable the feedback char     00100010
001100*  dmh 8/9/17                                                     00110010
001200* KcFMN - disable feedback characters to be transmitted (6)       00120010
001210         10  FILLER                  PIC X(06)    VALUE           00121010
001220             'KcFMN'.                                            00122010
001300         10  FILLER                  PIC X(01)    VALUE  ''.     00130000
001400* s     - Set up for 1 dot buffer                                 00140000
001500         10  FILLER                  PIC X(02)    VALUE           00150000
001600             's'.                                                00160000
001700         10  FILLER                  PIC X(01)    VALUE  ''.     00170000
001800* O0110 - Set form edge offset - 0110 = zero setting              00180000
001900         10  FILLER                  PIC X(06)    VALUE           00190000
002000             'O0110'.                                            00200000
002100         10  FILLER                  PIC X(01)    VALUE  ''.     00210000
002200* qA    - Clear memory module - A=upper slot                      00220000
002300         10  FILLER                  PIC X(03)    VALUE           00230000
002400             'qA'.                                               00240000
002500         10  FILLER                  PIC X(01)    VALUE  ''.     00250000
002600* L     - enter label formatting command input mode               00260000
002700         10  FILLER                  PIC X(02)    VALUE           00270000
002800             'L'.                                                00280000
002900         10  FILLER                  PIC X(01)    VALUE  ''.     00290000
003000* D11   - Set dot size - Horizontal(1) Vertical(1)                00300000
003100         10  FILLER                  PIC X(03)    VALUE           00310000
003200             'D11'.                                               00320000
003300         10  FILLER                  PIC X(01)    VALUE  ''.     00330000
003400* H10   - heat level                                              00340000
003500         10  FILLER                  PIC X(03)    VALUE           00350000
003600             'H10'.                                               00360000
003700         10  FILLER                  PIC X(01)    VALUE  ''.     00370000
003800* PK    - Max speed for print cycle - K=default (6 in.per sec)    00380000
003900         10  FILLER                  PIC X(02)    VALUE           00390000
004000             'PK'.                                                00400000
004100         10  FILLER                  PIC X(01)    VALUE  ''.     00410000
004200* SK    - Max slew rate speed - K= default (6 in.per sec)         00420000
004300         10  FILLER                  PIC X(02)    VALUE           00430000
004400             'SK'.                                                00440000
004500         10  FILLER                  PIC X(01)    VALUE  ''.     00450000
004600*                                                                 00460001
005100         10  FILLER                  PIC X(185)   VALUE SPACES.   00510010
005200*                                                                 00520000
005300*                                                                 00530000
005400*** - label line 2                                                00540000
005500*                                                                 00550000
005600     05  FILLER.                                                  00560000
005700*  store number - U01                                             00570000
005800         10  FILLER                  PIC X(15)    VALUE           00580000
005900             '391201001540162'.                                   00590001
006000         10  FILLER                  PIC X(04)    VALUE  ZEROES.  00600001
006100         10  FILLER                  PIC X(01)    VALUE  ''.     00610000
006200*  store name - U02                                               00620000
006300         10  FILLER                  PIC X(15)    VALUE           00630000
006400             '331100400230150'.                                   00640000
006500         10  FILLER                  PIC X(10)    VALUE           00650000
006600             '@@@@@@@@@@'.                                        00660000
006700         10  FILLER                  PIC X(01)    VALUE  ''.     00670000
006800*  label description - U03                                        00680000
006900         10  FILLER                  PIC X(15)    VALUE           00690000
007000             '302200003910080'.                                   00700000
007100         10  PC151-SML-LBL-DESC      PIC X(10)    VALUE           00710000
007200             '@@@@@@@@@@'.                                        00720000
007300         10  FILLER                  PIC X(01)    VALUE  ''.     00730000
007400*  label print date - U04                                         00740000
007500         10  FILLER                  PIC X(15)    VALUE           00750000
007600             '302200003910180'.                                   00760000
007700         10  PC151-LBL-PRT-DATE      PIC X(08)    VALUE           00770000
007800             '@@@@@@@@'.                                          00780000
007900         10  FILLER                  PIC X(01)    VALUE  ''.     00790000
008000*  label print time - U05                                         00800000
008100         10  FILLER                  PIC X(15)    VALUE           00810000
008200             '302200003910125'.                                   00820000
008300         10  PC151-LBL-PRT-TIME      PIC X(05)    VALUE           00830000
008400             '@@@@@'.                                             00840000
008500         10  FILLER                  PIC X(01)    VALUE  ''.     00850000
008600* Printer # - line - U06                                          00860000
008700         10  FILLER                  PIC X(21)    VALUE           00870000
008800             '302200003910390PRTR #'.                             00880000
008900         10  FILLER                  PIC X(01)    VALUE  ''.     00890000
009000* Printer # - field - U07                                         00900000
009100         10  FILLER                  PIC X(15)    VALUE           00910000
009200             '302200003910352'.                                   00920000
009300         10  PC151-SML-PRTR-NBR      PIC X(06)    VALUE           00930000
009400             'DC-307'.                                            00940000
009500         10  FILLER                  PIC X(01)    VALUE  ''.     00950000
009501* dmh 2/24/16 - begin                                             00950108
009510* door id   - field - U08                                         00951008
009520         10  FILLER                  PIC X(15)    VALUE           00952008
009530             '331100400230050'.                                   00953009
009540         10  PC151-SML-door-id       PIC X(04)    VALUE           00954008
009550             '@@@@'.                                              00955008
009560         10  FILLER                  PIC X(01)    VALUE  ''.     00956008
009600         10  FILLER                  PIC X(59)    VALUE SPACES.   00960008
009601***      10  FILLER                  PIC X(79)    VALUE SPACES.   00960108
009610* dmh 2/24/16 - end                                               00961008
009700*                                                                 00970000
009800*                                                                 00980000
009900*** - label line 3                                                00990000
010000*                                                                 01000000
010100     05  FILLER.                                                  01010000
010200*                                                                 01020000
010300* long bar code across bottom of label - U09                      01030008
010400         10  FILLER                  PIC X(16)    VALUE           01040000
010500             '3e4410003790340C'.                                  01050000
010600         10  PC151-SML-FORM-BC       PIC X(20)    VALUE           01060003
011100                                     '@@@@@@@@@@@@@@@@@@@@'.      01110003
011200         10  FILLER                  PIC X(01)    VALUE  ''.     01120003
011203* increment previous field                                        01120300
011204         10  FILLER                  PIC X(03)    VALUE           01120400
011205             '+01'.                                               01120500
011206         10  FILLER                  PIC X(01)    VALUE  ''.     01120600
011207*  # above bar code - U10                                         01120708
011208         10  FILLER                  PIC X(15)    VALUE           01120800
011209             '341100002600330'.                                   01120900
011210         10  FILLER                  PIC X(25)    VALUE           01121000
011220                                     '@@@@@@@@@@@@@@@@@@@@@@@@@'. 01122000
011230         10  FILLER                  PIC X(01)    VALUE  ''.     01123000
011240* increment previous field                                        01124000
011250         10  FILLER                  PIC X(03)    VALUE           01125000
011260             '+01'.                                               01126000
011270         10  FILLER                  PIC X(01)    VALUE  ''.     01127000
011280* ZONE - line 1 - U11                                             01128008
011290         10  FILLER                  PIC X(15)    VALUE           01129000
011300*4/22/14     '391100501690390'.                                   01130007
011310             '331200501660164'.                                   01131007
011400         10  PC151-STR-ZONE-LINE-1   PIC X(20)    VALUE  spaces.  01140000
011500         10  FILLER                  PIC X(01)    VALUE  ''.     01150000
011600* ZONE - line 2 - U12                                             01160008
011700         10  FILLER                  PIC X(15)    VALUE           01170000
011800* 4/22/14    '391100501990390'.                                   01180007
011810             '331200501990164'.                                   01181007
011900         10  PC151-STR-ZONE-LINE-2   PIC X(20)    VALUE  spaces.  01190000
012000         10  FILLER                  PIC X(01)    VALUE  ''.     01200000
012100* ZONE - line 3 - U13                                             01210008
012200         10  FILLER                  PIC X(15)    VALUE           01220000
012300* 4/22/14    '391100502280390'.                                   01230007
012310             '331200502310164'.                                   01231007
012400         10  PC151-STR-ZONE-LINE-3   PIC X(20)    VALUE  spaces.  01240000
012500         10  FILLER                  PIC X(01)    VALUE  ''.     01250000
012600** user id - U14                                                  01260008
012700         10  FILLER                  PIC X(15)    VALUE           01270000
012800             '302200002600050'.                                   01280000
012900         10  PC151-USER-ID           PIC X(07)    VALUE  SPACES.  01290000
013000         10  FILLER                  PIC X(01)    VALUE  ''.     01300000
013100         10  FILLER                  PIC X(23)    VALUE  SPACES.  01310003
013200*                                                                 01320000
013300*                                                                 01330000
013400*** - label line 4                                                01340000
013500*                                                                 01350000
013600     05  FILLER.                                                  01360000
013700* box around the manifest number above barcode (U15)              01370008
013800         10  FILLER                  PIC X(22)    VALUE           01380000
013900             '1X1100002410067L093020'.                            01390000
014000         10  FILLER                  PIC X(01)    VALUE  ''.     01400000
014100* reprint - BOX (U16)                                             01410008
014200         10  PC151-REPRINT-BOX       PIC X(22).                   01420000
014300         10  FILLER                  PIC X(01)    VALUE  ''.     01430000
014400* reprint - TEXT (U17)                                            01440008
014401         10  PC151-REPRINT-TEXT      PIC X(22).                   01440100
014402         10  FILLER                  PIC X(01)    VALUE  ''.     01440200
014403         10  PC151-TEST-LINE         PIC X(22)    VALUE           01440300
014404             '1X1100002630000L405009'.                            01440400
014405         10  FILLER                  PIC X(01)    VALUE  ''.     01440500
014407* line under first digit of store number (U18)                    01440708
014408         10  FILLER                  PIC X(22)    VALUE           01440801
014409             '1X1100001300130L035001'.                            01440901
014410         10  FILLER                  PIC X(01)    VALUE  ''.     01441001
014411* line under second digit of store number (U19)                   01441108
014412         10  FILLER                  PIC X(22)    VALUE           01441201
014413             '1X1100001300090L035001'.                            01441301
014414         10  FILLER                  PIC X(01)    VALUE  ''.     01441401
014415* line under third digit of store number (U20)                    01441508
014416         10  FILLER                  PIC X(22)    VALUE           01441601
014417             '1X1100001300055L030001'.                            01441701
014418         10  FILLER                  PIC X(01)    VALUE  ''.     01441801
014419* line under fourth digit of store number (U21)                   01441908
014420         10  FILLER                  PIC X(22)    VALUE           01442001
014421             '1X1100001300020L030001'.                            01442102
014422         10  FILLER                  PIC X(01)    VALUE  ''.     01442201
014424* reverse image store number - BOX (U22)                          01442408
014425         10  PC151-REVERSE-STORE-BOX PIC X(22).                   01442502
014426         10  FILLER                  PIC X(01)    VALUE  ''.     01442602
014427*                                                                 01442702
014428         10  FILLER                  PIC X(33)    VALUE  spaces.  01442802
014429*                                                                 01442900
014430*                                                                 01443000
014431*** - label line 5                                                01443100
014432*                                                                 01443200
014433* X     - Terminate field generation                              01443300
014434*                                                                 01443400
014435*                                                                 01443500
014436     05  FILLER.                                                  01443600
014437         10  FILLER                  PIC X(02)    VALUE           01443700
014438             'X '.                                                01443800
014439         10  FILLER                  PIC X(01)    VALUE  ''.     01443900
014440* qA    - Clear memory module - A=upper slot                      01444000
014441         10  FILLER                  PIC X(03)    VALUE           01444100
014442             'qA'.                                               01444200
014443         10  FILLER                  PIC X(01)    VALUE  ''.     01444300
014444         10  FILLER                  PIC X(233)   VALUE  SPACES.  01444400
014450                                                                  01445000
014460                                                                  01446000
014470 01  PC151-SML-LBL-FORM-TABLE       REDEFINES                     01447000
014480     PC151-SML-LBL-FORM.                                          01448000
014490     05  PC151-SML-LBL-FORM-LINE     OCCURS  5 TIMES              01449000
014500                                     INDEXED BY PC151-IDX         01450000
014600                                     PIC X(240).                  01460000
014700                                                                  01470000
014800*----------------------------------------------------------------*01480000
014900* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *01490000
015000*----------------------------------------------------------------*01500000
015100 01  PC151-SML-FORM-LENGTH.                                       01510000
015200     05  FILLER                        PIC 9(03)    VALUE   55.   01520010
015300     05  FILLER                        PIC 9(03)    VALUE  181.   01530008
015400     05  FILLER                        PIC 9(03)    VALUE  217.   01540006
015500     05  FILLER                        PIC 9(03)    VALUE  207.   01550002
015600     05  FILLER                        PIC 9(03)    VALUE    7.   01560000
015700                                                                  01570000
015800 01  PC151-SML-FORM-LNGTH-VALUES REDEFINES PC151-SML-FORM-LENGTH. 01580000
015900     05  PC151-SML-FORM-LINE-LENGTH   OCCURS 5 TIMES              01590000
016000                                      INDEXED BY PC151-IDX-2      01600000
016100                                      PIC 9(03).                  01610000
016200                                                                  01620000
016300*----------------------------------------------------------------*01630000
016400* ACTUAL LINE ALLOCATIONS FOR VARIABLE FIELDS                     01640000
016500*----------------------------------------------------------------*01650000
016600 01  PC151-LABEL-ALLOCATIONS.                                     01660000
016700     05  PC151-FORM-REPRT-BOX      PIC X(22)   VALUE              01670000
016800                                   '1X1100000020290L090020'.      01680000
016900     05  PC151-FORM-REPRT-FLD      PIC X(22)   VALUE              01690000
017000                                   '331100500200369REPRINT'.      01700000
017100     05  PC151-FORM-NO-RPRT-FLD    PIC X(22)   VALUE              01710000
017200                                   '331100000170200@@@@@@@'.      01720000
017300     05  PC151-FORM-NO-REVRSE-STR  PIC X(22)   VALUE              01730002
017400                                   '1X1100000250013L000000'.      01740002
017700     05  PC151-FORM-REVRSE-STR     PIC X(22)   VALUE              01770002
017800                                   '1X1100000250013L152110'.      01780002
017900     05  PC151-FORM-NO-RPRT-BOX    PIC X(22)   VALUE              01790004
018000                                   '1X1100000020125L000000'.      01800004
