000001******************************************************************00000100
000002**                        PCWS120                               **00000200
000003**                                                              **00000300
000004**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00000400
000005**  PACK-TO-LIGHT CASEPACK CRIT SPEC SCREEN                     **00000500
000006**  LENGTH:  200 BYTES                                          **00000600
000007******************************************************************00000700
000008         10  PC120-INTER-APPL-COMMAREA  REDEFINES                 00000800
000009             INTER-APPL-COMM-AREA.                                00000900
000010             15  FILLER                         PIC  X(01).       00001000
000011             15  PC120-PO-NBR                   PIC S9(09) COMP.  00001101
000012             15  PC120-REC-SEQ-NBR              PIC S9(09) COMP.  00001201
000013             15  PC120-PO-LINE-NBR              PIC S9(04).       00001300
000014             15  PC120-OPER-UNT-ID              PIC S9(04).       00001400
000015             15  PC120-FCLTY-ID                 PIC S9(04).       00001500
000016             15  PC120-CURR-OPER-UNT-ID         PIC S9(04).       00001600
000017             15  PC120-CURR-FCLTY-ID            PIC S9(04).       00001700
000018             15  PC120-SML-P2L-PRTR-ID          PIC  X(08).       00001800
000019             15  PC120-SHP-PRTR-CLUSTER-NBR     PIC S9(04).       00001900
000020             15  PC120-SHP-PRTR-IP-ADDR         PIC  X(15).       00002000
000021             15  PC120-SHP-PRTR-OS-RLSE-CDE     PIC  X(05).       00002100
000022             15  PC120-SHP-DATA-XFER-MODE-ID    PIC  X(02).       00002200
000023             15  PC120-SHP-PRTR-TYP-CDE         PIC  X(08).       00002300
000024             15  PC120-PGYBCK-PRTR-ID           PIC  X(08).       00002400
000025             15  PC120-PGYBCK-PRTR-CLUSTER-NBR  PIC S9(04).       00002500
000026             15  PC120-PGYBCK-PRTR-IP-ADDR      PIC  X(15).       00002600
000027             15  PC120-PGYBCK-PRTR-OS-RLSE-CDE  PIC  X(05).       00002700
000028             15  PC120-PGYBCK-DATA-XFER-MODE-ID PIC  X(02).       00002800
000029             15  PC120-PGYBCK-PRTR-TYP-CDE      PIC  X(08).       00002900
000030             15  PC120-MODU-NBR                 PIC S9(04).       00003000
000031             15  PC120-DFLT-STR-ZN-ID           PIC  X(05).       00003100
000032             15  PC120-CART-CNT                 PIC S9(09).       00003200
000033             15  PC120-INPK-UNT-QTY             PIC S9(04).       00003300
000034             15  PC120-OTPK-UNT-QTY             PIC S9(04).       00003400
000035             15  PC120-CRE-LBL-IND              PIC  X(01).       00003500
000036                 88  PC120-CRE-BOTH-LBL             VALUE 'B'.    00003600
000037                 88  PC120-CRE-P2L-LBL              VALUE 'P'.    00003700
000038                 88  PC120-CRE-SML-LBL              VALUE 'C'.    00003800
000039             15  PC120-LBL-PRT-ORDER            PIC  X(01).       00003900
000040                 88  PC120-LBL-PRT-SHUFFLED         VALUE 'S'.    00004000
000041                 88  PC120-LBL-PRT-STR-ORD          VALUE 'R'.    00004100
000042             15  PC120-SPEC-INST-DESC           PIC  X(05).       00004200
000043             15  PC120-FCSE-PROCESS-AREA        PIC  X(06).       00004300
000044             15  PC120-PRT-HEAD-FOOT            PIC  X(01).       00004400
000045                 88  PC120-PRT-HEAD-FOOT-NO          VALUE 'N'.   00004500
000046                 88  PC120-PRT-HEAD-FOOT-YES         VALUE 'Y'.   00004600
000047             15  PC120-ODD-CARTON-X.                              00004700
000048                 20  PC120-ODD-CARTON           PIC  9(02).       00004800
000049             15  PC120-ODD-CRTN-USE-SW          PIC  X(01).       00004900
000050                  88 PC120-ODD-CRTN-FCSE             VALUE 'F'.   00005000
000051                  88 PC120-ODD-CRTN-INPK             VALUE 'I'.   00005100
000052                  88 PC120-ODD-CRTN-P2L              VALUE 'P'.   00005200
000053                  88 PC120-ODD-CRTN-NONE             VALUE 'N'.   00005300
000054             15  PC120-SHP-XMIT-INTFC-CDE       PIC  X(01).       00005400
000055             15  PC120-PGYBCK-XMIT-INTFC-CDE    PIC  X(01).       00005500
000056             15  PC120-DC-PRTD-AT               PIC  X(02).       00005600
000057             15  PC120-PKGNG-CD                 PIC  X(01).       00005700
000058             15  PC120-PREPK-RATIO              PIC  9(04).       00005800
000059             15  PC120-DSPLY-PKGNG-CD           PIC  X(01).       00005900
000060             15  PC120-UCC128-DATA-AVAIL-SW     PIC  X(01).       00006000
000061                 88  PC120-UCC128-DATA-AVAIL-YES     VALUE 'Y'.   00006100
000062                 88  PC120-UCC128-DATA-AVAIL-NO      VALUE 'N'.   00006200
000063             15  PC120-USE-UCC128-DATA-SW       PIC  X(01).       00006300
000064                 88  PC120-USE-UCC128-DATA-YES       VALUE 'Y'.   00006400
000065                 88  PC120-USE-UCC128-DATA-NO        VALUE 'N'.   00006500
000066                 88  PC120-USE-UCC128-DATA-IGN       VALUE 'I'.   00006600
000067             15  PC120-PREPK-ID                 PIC  9(04).       00006700
000068             15  PC120-PACKS-IN-CRTN            PIC  9(04).       00006800
000069             15  PC120-DPT-NBR                  PIC  X(03).       00006900
000070             15  PC120-AUTOVE-DC-SW             PIC  X(01).       00007000
000080                 88  PC120-AUTOVE-DC-YES             VALUE 'Y'.   00008000
000090                 88  PC120-AUTOVE-DC-NO              VALUE 'N'.   00009000
000091             15  PC120-TRIP-ARRIVE-DATE         PIC  X(10).       00009101
000092             15  PC120-TRIP-ARRIVE-DATE-R                         00009200
000093                 REDEFINES PC120-TRIP-ARRIVE-DATE.                00009300
000094                 20  PC120-TRIP-ARRIVE-CCYY     PIC  X(04).       00009400
000095                 20  PC120-TRIP-ARRIVE-DASH1    PIC  X(01).       00009500
000096                 20  PC120-TRIP-ARRIVE-MM       PIC  X(02).       00009600
000097                 20  PC120-TRIP-ARRIVE-DASH2    PIC  X(01).       00009700
000098                 20  PC120-TRIP-ARRIVE-DD       PIC  X(02).       00009800
000100             15  FILLER                         PIC  X(10).       00010002
