000001*****************************************************************         
000002* PCWS254 - CASEPACK PHYSICAL SML - DATA                        *         
000003* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000011* THIS IS THE LAYOUT FOR THE DATA PORTION OF A SHIPPING LABEL.  *         
000012* IT MUST BE PRECEDED BY THE FORMS RECORDS DESCRIBED IN PCSW119.*         
000013* CONTROL FIELDS SUCH AS ' U01', ' U02' ETC HAVE A X'02' IN THE *         
000014* FIRST POSITION.                                               *         
000015*                                                               *         
000016* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *         
000017*                    I M P O R T A N T                          *         
000018* THE LABEL COMMANDS ARE STRUNG TOGETHER UNDER ONLY 4-05 LEVELS *         
000019* EACH LABEL COMMAND IS SEPARATED BY AN END OF TEXT CHAR-HEX 03 *         
000020* THIS WAS DONE TO TRY TO SPEED UP TRANSMISSION VIA NEW SOCKET  *         
000021* INTERFACE.  SYSTEC'S SOFTWARE SEPARATES 05 LEVELS INTO        *         
000022* STATEMENTS.  THE MAXIMUM LENGTH IS 240.                       *         
000030*****************************************************************         
000900                                                                          
001000 01  PC254-MAX-LABEL-LINES            PIC S9(04) VALUE  +2                
001100                                                COMP SYNC.                
001101***                                                                       
001102***    NUMBER OF 05 LEVELS ------------------------------/\               
001103***                                                                       
001104***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH         
001105***               IN PC254-SML-DATA-LENGTH.                               
001106***               ALSO IF LINES ARE ADDED BE SURE TO UPDATE               
001107***                                                                       
001110*****************************************************************         
001200 01  PC254-SML-LABEL-DATA.                                                
001201*****                                                                     
001202*                                                                         
001210* label line grouping 1                                                   
001300     05 FILLER.                                                           
001310* U01 - STORE NUMBER                                                      
001320         10  FILLER                  PIC X(04)    VALUE 'U01'.           
001330         10  PC254-SML-STR-NBR       PIC X(04)    VALUE SPACES.           
001340         10  FILLER                  PIC X(01)    VALUE  ''.             
001400* U02 - DOOR HEADING                                                      
001500         10  FILLER                  PIC X(04)    VALUE 'U02'.           
001700         10  PC254-DOOR-HDG          PIC X(05)    VALUE SPACES.           
001710             88 PC254-DOOR-HDG-YES                VALUE 'DOOR:'.          
001720             88 PC254-DOOR-HDG-NO                 VALUE '@@@@@'.          
001800         10  FILLER                  PIC X(01)    VALUE  ''.             
001900* U03 - DOOR NUMBER                                                       
002000         10  FILLER                  PIC X(04)    VALUE 'U03'.           
002100         10  PC254-DOOR-NUMBER       PIC X(04)    VALUE SPACES.           
002110             88 PC254-DOOR-NBR-NO                 VALUE '@@@@'.           
002200         10  FILLER                  PIC X(01)    VALUE  ''.             
002210* U18 - STORE ON HAND MESSAGE                                             
002220         10  FILLER                  PIC X(04)    VALUE 'U18'.           
002230         10 PC254-STR-ON-HAND        PIC X(35).                           
002240            88 PC254-OH-ZERO-MSG-YES              VALUE                   
002250               'PROCESS FIRST - ZERO ON HAND       '.                     
002260            88 PC254-OH-ZERO-MSG-NO               VALUE                   
002261                          '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'.          
002270         10  FILLER                  PIC X(01)    VALUE  ''.             
002300* U19 - SEASONAL SET HEADING                                              
002400         10  FILLER                  PIC X(04)    VALUE 'U19'.           
002500         10  PC254-SEASET-HDG        PIC X(04).                           
002510             88  PC254-SEASET-HDG-NO              VALUE  '@@@@'.          
002520** dmh 12/14 88  PC254-SEASET-HDG-YES             VALUE  'SET:'.          
002530             88  PC254-SEASET-HDG-YES             VALUE  '@@@@'.          
002600         10  FILLER                  PIC X(01)    VALUE  ''.             
002610* U20 - SEASONAL SET FIELD                                                
002620         10  FILLER                  PIC X(04)    VALUE 'U20'.           
002630         10  PC254-SEASONAL-SET      PIC X(25).                           
002631             88  PC254-SEASET-NO                  VALUE                   
002632                                    '@@@@@@@@@@@@@@@@@@@@@@@@@'.          
002640         10  FILLER                  PIC X(01)    VALUE  ''.             
002641* U24 - FIXTURE HEADING                                                   
002642         10  FILLER                  PIC X(04)    VALUE 'U24'.           
002643         10  PC254-FIXTURE-HDG       PIC X(08).                           
002644             88  PC254-FIXTURE-HDG-NO        VALUE  '@@@@@@@@'.           
002645             88  PC254-FIXTURE-HDG-YES       VALUE  'FIXTURE#'.           
002646         10  FILLER                  PIC X(01)    VALUE  ''.             
002650* U25 - FIXTURE                                                           
002660         10  FILLER                  PIC X(04)    VALUE 'U25'.           
002670         10  PC254-FIXTURE           PIC X(10).                           
002680         10  FILLER                  PIC X(01)    VALUE  ''.             
002690* U26 - TEXT LINE 1                                                       
002691         10  FILLER                  PIC X(04)    VALUE 'U26'.           
002692         10  PC254-TEXT-LINE-1       PIC X(12).                           
002693             88  PC254-NO-TEXT-LINE-1    VALUE  '@@@@@@@@@@@@'.           
002694         10  FILLER                  PIC X(01)    VALUE  ''.             
002695* U27 - TEXT LINE 2                                                       
002696         10  FILLER                  PIC X(04)    VALUE 'U27'.           
002697         10  PC254-TEXT-LINE-2       PIC X(12).                           
002698             88  PC254-NO-TEXT-LINE-2    VALUE  '@@@@@@@@@@@@'.           
002699         10  FILLER                  PIC X(01)    VALUE  ''.             
002700* U28 - TEXT LINE 3                                                       
002701         10  FILLER                  PIC X(04)    VALUE 'U28'.           
002702         10  PC254-TEXT-LINE-3       PIC X(12).                           
002703             88  PC254-NO-TEXT-LINE-3    VALUE  '@@@@@@@@@@@@'.           
002704         10  FILLER                  PIC X(01)    VALUE  ''.             
002705* U29 - TEXT LINE 4                                                       
002706         10  FILLER                  PIC X(04)    VALUE 'U29'.           
002707         10  PC254-TEXT-LINE-4       PIC X(12).                           
002708             88  PC254-NO-TEXT-LINE-4    VALUE  '@@@@@@@@@@@@'.           
002709         10  FILLER                  PIC X(01)    VALUE  ''.             
002710         10  FILLER                  PIC X(37)    VALUE  SPACES.          
002711*                                                                         
002712*                                                                         
002713*****                                                                     
002714*                                                                         
002715* LABEL LINE GROUPING 2                                                   
002717     05 FILLER.                                                           
002718* U31 - NUMBER ABOVE BARCODE                                              
002719         10  FILLER                  PIC X(04)    VALUE 'U31'.           
002720         10  PC254-SML-BC-NBR        PIC X(25)    VALUE SPACES.           
002721         10  FILLER                  PIC X(01)    VALUE  ''.             
002722* U32 - BARCODE                                                           
002723         10  FILLER                  PIC X(04)    VALUE 'U32'.           
002724         10  FILLER                  PIC X(01)    VALUE                   
002725            'C'.                                                          
002726         10  PC254-SML-BC            PIC X(20)    VALUE SPACES.           
002727         10  FILLER                  PIC X(01)    VALUE  ''.             
002728* U35 - LABEL NUMBER                                                      
002729         10  FILLER                  PIC X(04)    VALUE 'U35'.           
002730         10  PC254-LABEL-NUMBER.                                          
002731             15  PC254-LABEL-NUMBER-N  PIC 9(04)  VALUE ZERO.             
002740         10  FILLER                  PIC X(01)    VALUE  ''.             
011740*                                                                         
011741* U55 - CASI                                                              
011742* added 5/3/13 - dmh                                                      
011743         10  FILLER                  PIC X(04)    VALUE 'U55'.           
011744         10  PC254-CASI              pic x(01).                           
011746         10  FILLER                  PIC X(01)    VALUE  ''.             
011747*                                                                         
011750* E     - NUMBER OF COPIES THAT WILL PRINT FOR EACH LABEL                 
012000         10 FILLER                   PIC X(02) VALUE                      
012100            'E'.                                                         
012200         10 PC254-SML-TOT-LBLS       PIC X(04) VALUE SPACES.              
012300         10  FILLER                  PIC X(01)    VALUE  ''.             
012500* G -                                                                     
012700         10 FILLER                   PIC X(02) VALUE                      
012800            'G'.                                                         
012900         10  FILLER                  PIC X(01)    VALUE  ''.             
012910         10  FILLER                  PIC X(159)   VALUE  SPACES.          
013000                                                                          
013600                                                                          
013700 01  PC254-SML-LABEL-DATA-TABLE                                           
013800             REDEFINES PC254-SML-LABEL-DATA.                              
013900     05 PC254-SML-LABEL-LINE OCCURS  2 TIMES                              
014000                           INDEXED BY PC254-IDX                           
014100                                      PIC X(240).                         
014101                                                                          
014102*----------------------------------------------------------------*        
014103* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *        
014104*----------------------------------------------------------------*        
014105 01  PC254-SML-DATA-LENGTH.                                               
014106     05  FILLER                        PIC 9(03)    VALUE  203.           
014107     05  FILLER                        PIC 9(03)    VALUE   81.           
014112                                                                          
014113 01  PC254-SML-DATA-LNGTH-VALUES REDEFINES PC254-SML-DATA-LENGTH.         
014114     05  PC254-SML-DATA-LINE-LENGTH   OCCURS 2 TIMES                      
014115                                      INDEXED BY PC254-IDX-2              
014120                                      PIC 9(03).                          
014200                                                                          
