00001 *----------------------------------------------------------------*03/20/94
00002 *                         PCWS019                                *PCWS019 
00003 *                                                                *   LV001
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *PCWS019 
00005 *   MAINTENANCE PROGRAMS TO PASS THE INSTRUCTION DESCRIPTION.    *PCWS019 
00006 *                                                                *PCWS019 
00007 *----------------------------------------------------------------*PCWS019 
00008                                                                   PCWS019 
00009  01  PC019-MESSAGE-SEL-REC.                                       PCWS019 
00010        05  PC019-SELECTED-ITEMS         PIC S9(05)  COMP-3        PCWS019 
00011                                                     VALUE ZERO.   PCWS019 
00012        05  PC019-MAX-ITEMS              PIC  9(02)  VALUE 20.     PCWS019 
00013        05  PC019-OPERATING-UNIT-ID      PIC S9(04)  COMP VALUE 0. PCWS019 
00014        05  PC019-FACILITY-ID            PIC S9(04)  COMP VALUE 0. PCWS019 
00015        05  PC019-SELECTED-ITEM-ARRAY.                             PCWS019 
00016            10  FILLER                   OCCURS 20 TIMES           PCWS019 
00017                                         INDEXED BY PC019-IDX.     PCWS019 
00018                15  PC019-ITEM           PIC S9(09)  COMP-3.       PCWS019 
00019                15  PC019-ACTION-SW      PIC  X(01).               PCWS019 
00020                    88  PC019-INQ                    VALUE 'I'.    PCWS019 
00021                    88  PC019-UPD                    VALUE 'U'.    PCWS019 
00022                    88  PC019-DEL                    VALUE 'D'.    PCWS019 
00023                    88  PC019-ERR                    VALUE 'E'.    PCWS019 
00024                15  PC019-KEY-DATA.                                PCWS019 
00025                    20  PC019-OPERATION-ID      PIC S9(4) COMP.    PCWS019 
00026                    20  PC019-FCLTY-AREA-ID     PIC X(06).         PCWS019 
00027                    20  PC019-PRC-FCLTY-AREA-ID PIC X(06).         PCWS019 
00028                    20  PC019-OPER-DESC         PIC X(25).         PCWS019 
