000100***************************************************************** 00010012
000200* PCWS153 - HEADER LABEL FORM RECORD                            * 00020012
000300*                                                               * 00030012
000400*  This is the layout for the header label form used in label   * 00040012
000500*  creation when sending to a batch printer using sockets.      * 00050012
000600* The label commands are strung together under only 4-05 levels * 00060012
000700* Each label command is separated by an end of text char-hex 03 * 00070012
000800* This was done to try to speed up transmission via new socket  * 00080012
000900* interface.  Systec's software separates 05 levels into        * 00090012
001000* statements.  The maximum length is 240.                       * 00100012
001100***************************************************************** 00110012
001200 01  PC153-HEAD-LABEL-FORM-MAX-LN PIC 9(03)    VALUE  04.         00120012
001300***                                                               00130012
001400***    NUMBER OF 05 LEVELS --------------------------------/\     00140012
001500***                                                               00150012
001600***   IMPORTANT - IF LINE LENGTHS CHANGE BE SURE TO UPDATE LENGTH 00160012
001700***               IN PC153-HDR-LBL-LENGTH.                        00170012
001800***               ALSO IF LINES ARE ADDED BE SURE TO INCREASE THE 00180012
001900***               HEADER-LABEL-MAX-LN VALUE AND TABLE OCCURS.     00190012
002000***                                                               00200012
002100***                                                               00210012
002200*-----------------------------------------------------------------00220012
002300 01  PC153-HEADER-LABEL-FORM.                                     00230012
002400**************************************************************    00240012
002500*************  START OF 05-LEVEL  ****************************    00250012
002600**************************************************************    00260012
002700     05  FILLER.                                                  00270012
002800* c0000 - Continuous paper length - 0000 = normal operation       00280012
002900         10  FILLER                  PIC X(06)    VALUE           00290012
003000             'c0000'.                                            00300012
003100         10  FILLER                  PIC X(01)    VALUE  ''.     00310012
003200* e     - Select edge sensor - DEFAULT                            00320012
003300         10  FILLER                  PIC X(02)    VALUE           00330012
003400             'e'.                                                00340012
003500         10  FILLER                  PIC X(01)    VALUE  ''.     00350012
003600* M1025 - Maximum label length                                    00360012
003700         10  FILLER                  PIC X(06)    VALUE           00370012
003800             'M1015'.                                            00380012
003900         10  FILLER                  PIC X(01)    VALUE  ''.     00390012
004000*  Replaced a command with KcFMN to disable the feedback char     00400013
004100*  dmh 8/9/17                                                     00410013
004200* KcFMN - disable feedback characters to be transmitted (6)       00420013
004210         10  FILLER                  PIC X(06)    VALUE           00421013
004220             'KcFMN'.                                            00422013
004300         10  FILLER                  PIC X(01)    VALUE  ''.     00430012
004400* s     - Set up for 1 dot buffer                                 00440012
004500         10  FILLER                  PIC X(02)    VALUE           00450012
004600             's'.                                                00460012
004700         10  FILLER                  PIC X(01)    VALUE  ''.     00470012
004800* O0110 - Set form edge offset - 0110 = zero setting              00480012
004900         10  FILLER                  PIC X(06)    VALUE           00490012
005000             'O0110'.                                            00500012
005100         10  FILLER                  PIC X(01)    VALUE  ''.     00510012
005200* qa    - Clear memory module                                     00520012
005300         10  FILLER                  PIC X(02)    VALUE           00530012
005400             'qa'.                                                00540012
005500         10  FILLER                  PIC X(01)    VALUE  ''.     00550012
005600* L     - enter label formatting command input mode               00560012
005700         10  FILLER                  PIC X(02)    VALUE           00570012
005800             'L'.                                                00580012
005900         10  FILLER                  PIC X(01)    VALUE  ''.     00590012
006000* D11   - Set dot size - Horizontal(1) Vertical(1)                00600012
006100         10  FILLER                  PIC X(03)    VALUE           00610012
006200             'D11'.                                               00620012
006300         10  FILLER                  PIC X(01)    VALUE  ''.     00630012
006400* PK    - Max speed for print cycle - K=default (6 in.per sec)    00640012
006500         10  FILLER                  PIC X(02)    VALUE           00650012
006600             'PK'.                                                00660012
006700         10  FILLER                  PIC X(01)    VALUE  ''.     00670012
006800* SK    - Max slew rate speed - K= default (6 in.per sec)         00680012
006900         10  FILLER                  PIC X(02)    VALUE           00690012
007000             'SK'.                                                00700012
007100         10  FILLER                  PIC X(01)    VALUE  ''.     00710012
007200* BC1 RECEIVER: LINE - HEADER                                     00720012
007300         10  FILLER                  PIC X(16)    VALUE           00730012
007400             '3e3305003700193C'.                                  00740012
007500* BC1 RECEIVER: LINE - DATA                                       00750012
007600         10  PC153-HEAD-COM-RCVR-BC1 PIC X(11)   VALUE            00760012
007700                                     'XXXXXXXXXXX'.               00770012
007800         10  FILLER                  PIC X(01)    VALUE  ''.     00780012
007900* RECEIVER: LINE - HEADER                                         00790012
008000         10  FILLER                  PIC X(15)    VALUE           00800012
008100             '302200003190185'.                                   00810012
008200* RECEIVER: LINE - DATA                                           00820012
008300         10  PC153-HEAD-COM-RCVR     PIC X(11)    VALUE           00830012
008400                                     'XXXXXXXXXXX'.               00840012
008500         10  FILLER                  PIC X(01)    VALUE  ''.     00850012
008600         10  FILLER                  PIC X(135)   VALUE SPACES.   00860013
008700**************************************************************    00870012
008800*************  START OF 05-LEVEL  ****************************    00880012
008900**************************************************************    00890012
009000     05  FILLER.                                                  00900012
009100* TOT LBLS: LINE - HEADER                                         00910012
009200         10  FILLER                  PIC X(15)    VALUE           00920012
009300             '391100900730141'.                                   00930012
009400* TOT LBLS: LINE - DATA                                           00940012
009500         10  PC153-HEAD-COM-TOT-LBLS PIC X(04)    VALUE           00950012
009600                                     'XXXX'.                      00960012
009700         10  FILLER                  PIC X(01)    VALUE  ''.     00970012
009800* VENDOR NAME: LINE - HEADER                                      00980012
009900         10  FILLER                  PIC X(15)    VALUE           00990012
010000             '351100001850281'.                                   01000012
010100* VENDOR NAME: LINE - DATA                                        01010012
010200         10  PC153-HEAD-COM-VENDOR-NAME                           01020012
010300                                     PIC X(25)    VALUE           01030012
010400                         'XXXXXXXXXXXXXXXXXXXXXXXXX'.             01040012
010500         10  FILLER                  PIC X(01)    VALUE  ''.     01050012
010600* RCVD DATE: LINE - HEADER                                        01060012
010700         10  FILLER                  PIC X(15)    VALUE           01070012
010800             '341100001280395'.                                   01080012
010900* RCVD DATE: LINE - DATA                                          01090012
011000         10  PC153-HEAD-COM-RCVD-DATE                             01100012
011100                                     PIC X(13)    VALUE           01110012
011200                                    'XXXXXXXXXXXXX'.              01120012
011300         10  FILLER                  PIC X(01)    VALUE  ''.     01130012
011400* AD DATE: LINE - HEADER                                          01140012
011500         10  FILLER                  PIC X(15)    VALUE           01150012
011600             '331100002400386'.                                   01160012
011700* AD DATE: LINE - DATA                                            01170012
011800         10  PC153-HEAD-COM-AD-DATE                               01180012
011900                                     PIC X(14)    VALUE           01190012
012000                                    'XXXXXXXXXXXXXX'.             01200012
012100         10  FILLER                  PIC X(01)    VALUE  ''.     01210012
012200* PICTURED: LINE - HEADER                                         01220012
012300         10  FILLER                  PIC X(15)    VALUE           01230012
012400             '331100002650386'.                                   01240012
012500* PICTURED: LINE - DATA                                           01250012
012600         10  PC153-HEAD-COM-PICTURED                              01260012
012700                                     PIC X(08)    VALUE           01270012
012800                                    'XXXXXXXX'.                   01280012
012900         10  FILLER                  PIC X(01)    VALUE  ''.     01290012
013000* MULT SHIPMENTS: LINE - HEADER                                   01300012
013100         10  FILLER                  PIC X(15)    VALUE           01310012
013200             '331100002650206'.                                   01320012
013300* MULT SHIPMENTS: LINE - DATA                                     01330012
013400         10  PC153-HEAD-COM-MULT-SHIPMENTS                        01340012
013500                                     PIC X(18)    VALUE           01350012
013600                          'XXXXXXXXXXXXXXXXXX'.                   01360012
013700         10  FILLER                  PIC X(01)    VALUE  ''.     01370012
013800* PRETICKETED: LINE - HEADER                                      01380012
013900         10  FILLER                  PIC X(15)    VALUE           01390012
014000             '331100003150386'.                                   01400012
014100* PRETICKETED: LINE - DATA                                        01410012
014200         10  PC153-HEAD-COM-PRETICKETED                           01420012
014300                                     PIC X(12)    VALUE           01430012
014400                          'XXXXXXXXXXXX'.                         01440012
014500         10  FILLER                  PIC X(01)    VALUE  ''.     01450012
014600* PACKED BY: LINE - HEADER                                        01460012
014700         10  FILLER                  PIC X(15)    VALUE           01470012
014800             '331100003400386'.                                   01480012
014900* PACKED BY: LINE - DATA                                          01490012
015000         10  PC153-HEAD-COM-packed-by                             01500012
015100                                     PIC X(15)    VALUE           01510012
015200                          'XXXXXXXXXXXXXXX'.                      01520012
015300         10  FILLER                  PIC X(01)    VALUE  ''.     01530012
015400         10  FILLER                  PIC X(003)   VALUE SPACES.   01540012
015500**************************************************************    01550012
015600*************  START OF 05-LEVEL  ****************************    01560012
015700**************************************************************    01570012
015800     05  FILLER.                                                  01580012
015900* ON HANGER: LINE - HEADER                                        01590012
016000         10  FILLER                  PIC X(15)    VALUE           01600012
016100             '331100003650386'.                                   01610012
016200* ON HANGER: LINE - DATA                                          01620012
016300         10  PC153-HEAD-COM-ON-HANGER                             01630012
016400                                     PIC X(09)    VALUE           01640012
016500                          'XXXXXXXXX'.                            01650012
016600         10  FILLER                  PIC X(01)    VALUE  ''.     01660012
016700* PROCESS AREA: LINE - HEADER                                     01670012
016800         10  FILLER                  PIC X(15)    VALUE           01680012
016900             '391100900730396'.                                   01690012
017000* PROCESS AREA: LINE - DATA                                       01700012
017100         10  PC153-HEAD-COM-PROCESS-AREA                          01710012
017200                                     PIC X(06)    VALUE           01720012
017300                          'XXXXXX'.                               01730012
017400         10  FILLER                  PIC X(01)    VALUE  ''.     01740012
017500* PRINTER ID: LINE - HEADER                                       01750012
017600         10  FILLER                  PIC X(24)    VALUE           01760012
017700             '321100003840250Printer #'.                          01770012
017800         10  FILLER                  PIC X(01)    VALUE  ''.     01780012
017900* PRINTER ID: LINE - DATA                                         01790012
018000         10  FILLER                  PIC X(15)    VALUE           01800012
018100             '302200003840194'.                                   01810012
018200         10  PC153-HEAD-COM-PRINTER-ID                            01820012
018300                                     PIC X(06)    VALUE  'XXXXXX'.01830012
018400         10  FILLER                  PIC X(01)    VALUE  ''.     01840012
018500* TRIP ID: LINE - HEADER                                          01850012
018600         10  FILLER                  PIC X(24)    VALUE           01860012
018700             '321100003840125Trip ID: '.                          01870012
018800         10  FILLER                  PIC X(01)    VALUE  ''.     01880012
018900* TRIP ID: LINE - DATA                                            01890012
019000         10  FILLER                  PIC X(15)    VALUE           01900012
019100             '321100003840075'.                                   01910012
019200         10  PC153-HEAD-COM-TRIP-ID                               01920012
019300                                     PIC X(09)    VALUE           01930012
019400                                        'XXXXXXXXX'.              01940012
019500         10  FILLER                  PIC X(01)    VALUE  ''.     01950012
019600* BOX1: LINE - HEADER                                             01960012
019700         10  FILLER                  PIC X(22)    VALUE           01970012
019800             '1X1100002750036L202017'.                            01980012
019900         10  FILLER                  PIC X(01)    VALUE  ''.     01990012
020000* SPECIAL INSTR: LINE - HEADER                                    02000012
020100         10  FILLER                  PIC X(15)    VALUE           02010012
020200             '331100002900236'.                                   02020012
020300* SPECIAL INSTR: LINE - DATA                                      02030012
020400         10  PC153-HEAD-COM-SPECIAL-INSTR                         02040012
020500                                     PIC X(25)    VALUE           02050012
020600                          'XXXXXXXXXXXXXXXXXXXXXXXXX'.            02060012
020700         10  FILLER                  PIC X(01)    VALUE  ''.     02070012
020800         10  FILLER                  PIC X(032)   VALUE SPACES.   02080012
020900**************************************************************    02090012
021000*************  START OF 05-LEVEL  ****************************    02100012
021100**************************************************************    02110012
021200     05  FILLER.                                                  02120012
021300* BOX2: LINE - HEADER                                             02130012
021400         10  FILLER                  PIC X(22)    VALUE           02140012
021500             '1X1100001000016L242052'.                            02150012
021600         10  FILLER                  PIC X(01)    VALUE  ''.     02160012
021700* PO NUMBER/RCVR SEQ: LINE - HEADER                               02170012
021800         10  FILLER                  PIC X(15)    VALUE           02180012
021900             '361100001400244'.                                   02190012
022000* PO NUMBER/RCVR SEQ: LINE - DATA                                 02200012
022100         10  PC153-HEAD-COM-PO-RCVR-SEQ                           02210012
022200                                     PIC X(12)    VALUE           02220012
022300                          'XXXXXXXXXXXX'.                         02230012
022400         10  FILLER                  PIC X(01)    VALUE  ''.     02240012
022500* BOX3: LINE - HEADER                                             02250012
022600         10  FILLER                  PIC X(28)    VALUE           02260012
022700             '1X1100002130265B132169001001'.                      02270012
022800         10  FILLER                  PIC X(01)    VALUE  ''.     02280012
022900* BOX4: LINE - HEADER                                             02290012
023000         10  FILLER                  PIC X(28)    VALUE           02300012
023100             '1X1100002400025B229066001001'.                      02310012
023200         10  FILLER                  PIC X(01)    VALUE  ''.     02320012
023300* DETAIL CHECK: LINE - HEADER                                     02330012
023400         10  FILLER                  PIC X(15)    VALUE           02340012
023500             '331100002890386'.                                   02350012
023600* DETAIL CHECK: LINE - DATA                                       02360012
023700         10  PC153-HEAD-COM-DETAIL-CHECK                          02370012
023800                                     PIC X(12)    VALUE           02380012
023900                          'XXXXXXXXXXXX'.                         02390012
024000         10  FILLER                  PIC X(01)    VALUE  ''.     02400012
024100* TICKET TYPE: LINE - HEADER                                      02410012
024200         10  FILLER                  PIC X(15)    VALUE           02420012
024300             '331100001900366'.                                   02430012
024400* TICKET TYPE: LINE - DATA                                        02440012
024500         10  PC153-HEAD-COM-TICKET-TYPE                           02450012
024600                                     PIC X(06)    VALUE           02460012
024700                          'XXXXXX'.                               02470012
024800         10  FILLER                  PIC X(01)    VALUE  ''.     02480012
024900* DEPT/CLASS: LINE - HEADER                                       02490012
025000         10  FILLER                  PIC X(15)    VALUE           02500012
025100             '331100001620368'.                                   02510012
025200* DEPT/CLASS: LINE - DATA                                         02520012
025300         10  PC153-HEAD-COM-DEPT-CLASS                            02530012
025400                                     PIC X(06)    VALUE           02540012
025500                          'XXXXXX'.                               02550012
025600         10  FILLER                  PIC X(01)    VALUE  ''.     02560012
025700* BOX5: LINE - HEADER                                             02570012
025800         10  FILLER                  PIC X(28)    VALUE           02580012
025900             '1X1100001380294B100064001001'.                      02590012
026000         10  FILLER                  PIC X(01)    VALUE  ''.     02600012
026100* X     - Terminate field generation                              02610012
026200         10  FILLER                  PIC X(02)    VALUE           02620012
026300             'X '.                                                02630012
026400         10  FILLER                  PIC X(01)    VALUE  ''.     02640012
026500* qA    - Clear memory module - A=upper slot                      02650012
026600         10  FILLER                  PIC X(03)    VALUE           02660012
026700             'qA'.                                               02670012
026800         10  FILLER                  PIC X(01)    VALUE  ''.     02680012
026900         10  FILLER                  PIC X(023)   VALUE SPACES.   02690012
027000                                                                  02700012
027100 01  PC153-HEADER-LABEL-TABLE REDEFINES                           02710012
027200                                PC153-HEADER-LABEL-FORM.          02720012
027300     05  PC153-HEADER-LBL-LINE        OCCURS 04 TIMES             02730012
027400                                      INDEXED BY PC153-IDX        02740012
027500                                      PIC X(240).                 02750012
027600                                                                  02760012
027700*----------------------------------------------------------------*02770012
027800* ACTUAL LENGTH OF LINE - TABLE (DOES NOT INCLUDE FILLER)        *02780012
027900*----------------------------------------------------------------*02790012
028000 01  PC153-HDR-LBL-LENGTH.                                        02800012
028100     05  FILLER                        PIC 9(03)    VALUE  105.   02810013
028200     05  FILLER                        PIC 9(03)    VALUE  237.   02820012
028300     05  FILLER                        PIC 9(03)    VALUE  208.   02830012
028400     05  FILLER                        PIC 9(03)    VALUE  217.   02840012
028500                                                                  02850012
028600 01  PC153-HDR-LBL-LNGTH-VALUES REDEFINES PC153-HDR-LBL-LENGTH.   02860012
028700     05  PC153-HDR-LINE-LENGTH        OCCURS 04 TIMES             02870012
028800                                      INDEXED BY PC153-IDX-2      02880012
028900                                      PIC 9(03).                  02890012
029000                                                                  02900012
