000100     EJECT                                                        00010000
000200***************************************************************** 00020000
000300*                        P C W S 0 0 0                          * 00030000
000400***************************************************************** 00040000
000500*  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED BY ALL   * 00050000
000600*  MODULES IN THE WORK ORDER SYSTEM.                            * 00060000
000700***************************************************************** 00070000
000800         10  PC000-INTER-APPL-COMMAREA REDEFINES                  00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000                                                                  00100000
001100             15  FILLER                         PIC X(1).         00110000
001200             15  PC000-INTER-APPL-FORMAT-CODE   PIC X(04).        00120000
001300             15  PC000-INTER-APPL-ACKNLG-CODE   PIC X(04).        00130000
001400                                                                  00140000
001500             15  PC000-KEY.                                       00150000
001600                 20  PC000-PO-NBR-N         PIC S9(09) COMP.      00160000
001700                 20  PC000-REC-SEQ-NBR-N    PIC S9(09) COMP.      00170000
001800                 20  PC000-LINE-NBR-N       PIC S9(04) COMP.      00180000
001900                 20  PC000-LINE-NBR-X       PIC  X(04).           00190000
002000                 20  PC000-WO-NBR-N         PIC S9(04) COMP.      00200000
002100                 20  PC000-RECVR-STATUS-CDE PIC X(02).            00210000
002200*-->                                                              00220000
002300*-->         THIS DATA IS PASSED TO THE PURCHASE ITEM INQ SCREEN  00230000
002400*-->                                                              00240000
002500             15  PC000-DEPT-NBR             PIC  X(03).           00250000
002600             15  PC000-ENT-ID               PIC S9(09) COMP.      00260000
002700             15  PC000-TKT-FORMAT           PIC  X(06).           00270000
002800*-->                                                              00280000
002900*-->         THIS DATA IS PASSED TO PRINT PROGRAM (153).          00290000
003000*-->                                                              00300000
003100             15  PC000-MASTER-PO            PIC  X(01).           00310000
003200             15  PC000-CHECKIN-DOC          PIC  X(01).           00320000
003300             15  PC000-DISTRIBUTION-PACK    PIC  9(03).           00330000
003400             15  PC000-MULT-DIST-PACK-IND   PIC  X(01).           00340000
003500             15  PC000-FUNCTION             PIC  X(01).           00350000
003510             15  PC000-MERCH-LOCATION       PIC  X(15).           00351001
003600*                                                                 00360000
003700*    FILLER MUST BE PLACED HERE!!                                 00370000
003800*                                                                 00380000
003900             15  FILLER                         PIC  X(072).      00390001
004000                                                                  00400000
004100             15  PC000-FACILITY-QUEUE-NAME      PIC  X(08).       00410000
004200             15  PC000-FACILITY-AREA-ID         PIC  X(06).       00420000
004300             15  PC000-OPERATION-DESC           PIC  X(25).       00430000
004400*-->                                                              00440000
004500*-->         THE PRINT CRITERIA SPEC PROGRAM WILL ALWAYS BE       00450000
004600*-->         LOOKING FOR THE FOLLOWING DATA IN THIS AREA OF       00460000
004700*-->         THE INTER-APPL COMMAREA.                             00470000
004800*-->                                                              00480000
004900             15  PC000-OPERATING-UNIT-ID        PIC  9(04).       00490000
005000             15  PC000-FACILITY-ID              PIC  9(04).       00500000
005100             15  PC000-REPORT-ID                PIC  9(03).       00510000
005200                                                                  00520000
005300*-->         THIS IS THE AREA THAT IS POPULATED BY LIST PROGRAMS  00530000
005400*-->         AND READ BY DETAIL PROGRAMS AND THE PRINT CRITERIA   00540000
005500*-->         SPEC PROGRAM.                                        00550000
005600*-->                                                              00560000
005700             15  PC000-TS-SELECTION-DATA.                         00570000
005800                 20  PC000-SEL-QUEUE-NAME       PIC X(8).         00580000
005900                 20  PC000-SEL-QUEUE-RDF        REDEFINES         00590000
006000                     PC000-SEL-QUEUE-NAME.                        00600000
006100                     25  PC000-TS-TERM-ID       PIC X(04).        00610000
006200                     25  PC000-TS-TASK-NMBR     PIC S9(05) COMP-3.00620000
006300                     25  PC000-TS-SEQ           PIC 9(01).        00630000
006400*-->                     1=USED INTERNALLY BE LIST PROGRAMS       00640000
006500                         88  PC000-TS-LIST-QUEUE    VALUE 1.      00650000
006600*-->                     2=USED BY DETAIL SCREENS.  CONTAINS ITEMS00660000
006700*-->                       SELECTED IN LIST PROGRAM               00670000
006800                         88  PC000-TS-SELECTED-ITEMS VALUE 2.     00680000
006900*-->                     3=COMMON DATA PASSED FROM PGM TO PGM     00690000
007000                         88  PC000-TS-SHARED-DATA   VALUE 3.      00700000
007100*-->                     4=RETAIN THE KEY VALUE INITIALLY ENTERED 00710000
007200*-->                       IN A CRITERIA SPEC SCREEN              00720000
007300                         88  PC000-TS-KEY-DATA      VALUE 4.      00730000
007400                 20  PC000-NUMBER-OF-SELECTED-ITEMS               00740000
007500                                                PIC S9(04) COMP.  00750000
007600                 20  PC000-NUMBER-OF-TS-ITEMS   PIC S9(04) COMP.  00760000
007700                 20  PC000-TS-ITEM-NUMBER       PIC S9(04) COMP.  00770000
007800                 20  PC000-PC016-IDX            PIC S9(04) COMP.  00780000
