*          DATA SET PEKM193    AT LEVEL 001 AS OF 10/26/93                      
*          DATA SET PEKM193    AT LEVEL 010 AS OF 10/01/93              00001   
*          DATA SET PEKM193A1  AT LEVEL 005 AS OF 05/26/93              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  PEKM193                                            *   00006   
*        MAP     PE193A                                             *   00007   
*        PROGRAM PEKCS193                                           *   00008   
*        TRANSID Q193 - PERM PC STORE HEADER INQUIRY                *   00009   
*        SYSTEM  PERM PRICE CHANGE                                  *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
PEKM193 DFHMSD TYPE=MAP,                                               X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               TIOAPFX=YES,                                            X00016   
               CTRL=(FREEKB)                                            00017   
PE193A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00023   
               INITIAL='STORE......:',                                 X00024   
               LENGTH=12,                                              X00025   
               COLOR=NEUTRAL,                                          X00026   
               POS=(05,05)                                              00027   
ASTRN   DFHMDF ATTRB=(UNPROT,NORM),                                    X00028   
               LENGTH=4,                                               X00029   
               COLOR=BLUE,                                             X00030   
               POS=(05,18)                                              00031   
ASTRNM  DFHMDF ATTRB=(ASKIP,BRT),                                      X00032   
               LENGTH=25,                                              X00033   
               COLOR=BLUE,                                             X00034   
               POS=(05,23)                                              00035   
*                                                                       00036   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00037   
               INITIAL='DOCUMENT...:',                                 X00038   
               LENGTH=12,                                              X00039   
               COLOR=NEUTRAL,                                          X00040   
               POS=(08,05)                                              00041   
ADOCN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               LENGTH=7,                                               X00043   
               COLOR=BLUE,                                             X00044   
               POS=(08,18)                                              00045   
*                                                                       00046   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00047   
               INITIAL='STATUS.....:',                                 X00048   
               LENGTH=12,                                              X00049   
               COLOR=NEUTRAL,                                          X00050   
               POS=(09,05)                                              00051   
ASTAT   DFHMDF ATTRB=(ASKIP,BRT),                                      X00052   
               LENGTH=2,                                               X00053   
               COLOR=BLUE,                                             X00054   
               POS=(09,18)                                              00055   
ASTATD  DFHMDF ATTRB=(ASKIP,BRT),                                      X00056   
               LENGTH=12,                                              X00057   
               COLOR=BLUE,                                             X00058   
               POS=(09,21)                                              00059   
*                                                                       00060   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00061   
               INITIAL='TYPE/REASON:',                                 X00062   
               LENGTH=12,                                              X00063   
               COLOR=NEUTRAL,                                          X00064   
               POS=(10,05)                                              00065   
ARSN    DFHMDF ATTRB=(ASKIP,BRT),                                      X00066   
               LENGTH=3,                                               X00067   
               COLOR=BLUE,                                             X00068   
               POS=(10,18)                                              00069   
ATYPD   DFHMDF ATTRB=(ASKIP,BRT),                                      X00070   
               LENGTH=8,                                               X00071   
               COLOR=BLUE,                                             X00072   
               POS=(10,22)                                              00073   
ARSND   DFHMDF ATTRB=(ASKIP,BRT),                                      X00074   
               LENGTH=12,                                              X00075   
               COLOR=BLUE,                                             X00076   
               POS=(10,31)                                              00077   
*                                                                       00078   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00079   
               INITIAL='DEPT/AREA..:',                                 X00080   
               LENGTH=12,                                              X00081   
               COLOR=NEUTRAL,                                          X00082   
               POS=(11,05)                                              00083   
ADPTAR  DFHMDF ATTRB=(ASKIP,BRT),                                      X00084   
               LENGTH=40,                                              X00085   
               COLOR=BLUE,                                             X00086   
               POS=(11,18)                                              00087   
*                                                                       00088   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00089   
               INITIAL='ISSUED......:',                                X00090   
               LENGTH=13,                                              X00091   
               COLOR=NEUTRAL,                                          X00092   
               POS=(13,05)                                              00093   
AISSDT  DFHMDF ATTRB=(ASKIP,BRT),                                      X00094   
               LENGTH=08,                                              X00095   
               COLOR=BLUE,                                             X00096   
               POS=(13,19)                                              00097   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00098   
               INITIAL='BY',                                           X00099   
               LENGTH=02,                                              X00100   
               COLOR=NEUTRAL,                                          X00101   
               POS=(13,28)                                              00102   
AISSID  DFHMDF ATTRB=(ASKIP,BRT),                                      X00103   
               LENGTH=08,                                              X00104   
               COLOR=BLUE,                                             X00105   
               POS=(13,31)                                              00106   
*                                                                       00107   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00108   
               INITIAL='CANCELLED...:',                                X00109   
               LENGTH=13,                                              X00110   
               COLOR=NEUTRAL,                                          X00111   
               POS=(14,05)                                              00112   
ACANDT  DFHMDF ATTRB=(ASKIP,BRT),                                      X00113   
               LENGTH=08,                                              X00114   
               COLOR=BLUE,                                             X00115   
               POS=(14,19)                                              00116   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00117   
               INITIAL='BY',                                           X00118   
               LENGTH=02,                                              X00119   
               COLOR=NEUTRAL,                                          X00120   
               POS=(14,28)                                              00121   
ACANID  DFHMDF ATTRB=(ASKIP,BRT),                                      X00122   
               LENGTH=08,                                              X00123   
               COLOR=BLUE,                                             X00124   
               POS=(14,31)                                              00125   
*                                                                       00126   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00127   
               INITIAL='ENTERED.....:',                                X00128   
               LENGTH=13,                                              X00129   
               COLOR=NEUTRAL,                                          X00130   
               POS=(15,05)                                              00131   
AENTDT  DFHMDF ATTRB=(ASKIP,BRT),                                      X00132   
               LENGTH=08,                                              X00133   
               COLOR=BLUE,                                             X00134   
               POS=(15,19)                                              00135   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00136   
               INITIAL='BY',                                           X00137   
               LENGTH=02,                                              X00138   
               COLOR=NEUTRAL,                                          X00139   
               POS=(15,28)                                              00140   
AENTID  DFHMDF ATTRB=(ASKIP,BRT),                                      X00141   
               LENGTH=08,                                              X00142   
               COLOR=BLUE,                                             X00143   
               POS=(15,31)                                              00144   
*                                                                       00145   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00146   
               INITIAL='COMPLETED ON:',                                X00147   
               LENGTH=13,                                              X00148   
               COLOR=NEUTRAL,                                          X00149   
               POS=(16,05)                                              00150   
AEFFDT  DFHMDF ATTRB=(ASKIP,BRT),                                      X00151   
               LENGTH=08,                                              X00152   
               COLOR=BLUE,                                             X00153   
               POS=(16,19)                                              00154   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00155   
               INITIAL='BY',                                           X00156   
               LENGTH=02,                                              X00157   
               COLOR=NEUTRAL,                                          X00158   
               POS=(16,28)                                              00159   
ACPLNM  DFHMDF ATTRB=(ASKIP,BRT),                                      X00160   
               LENGTH=30,                                              X00161   
               COLOR=BLUE,                                             X00162   
               POS=(16,31)                                              00163   
*                                                                       00164   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00165   
               INITIAL='TOTAL PRICE CHANGE AMOUNT:',                   X00166   
               LENGTH=26,                                              X00167   
               COLOR=NEUTRAL,                                          X00168   
               POS=(18,05)                                              00169   
ATPRCHG DFHMDF ATTRB=(ASKIP,BRT),                                      X00170   
               LENGTH=13,                                              X00171   
               COLOR=BLUE,                                             X00172   
               POS=(18,32)                                              00173   
*                                                                       00174   
         DFHMSD TYPE=FINAL                                              00175   
         END                                                            00176   
