*          DATA SET PEKM150    AT LEVEL 003 AS OF 07/30/92                      
*          DATA SET PEKM150    AT LEVEL 026 AS OF 10/04/91              00001   
        PRINT  NOGEN                                                    00002   
PEKM150 DFHMSD TYPE=DSECT,LANG=COBOL,MODE=INOUT,STORAGE=AUTO,          C00003   
               TERM=3270-2,TIOAPFX=YES                                  00004   
PE150A  DFHMDI LINE=1,                                                 C00005   
               COLUMN=1,                                               C00006   
               CTRL=FREEKB,                                            C00007   
               SIZE=(24,80),                                           C00008   
               MAPATTS=(COLOR,HILIGHT),                                C00009   
               DSATTS=(COLOR,HILIGHT)                                   00010   
ADATE   DFHMDF POS=(1,2),                                              C00011   
               LENGTH=10,                                              C00012   
               ATTRB=(ASKIP,BRT),                                      C00013   
               COLOR=NEUTRAL                                            00014   
ATIME   DFHMDF POS=(1,14),                                             C00015   
               LENGTH=8,                                               C00016   
               ATTRB=(ASKIP,BRT),                                      C00017   
               COLOR=NEUTRAL                                            00018   
ATITLE  DFHMDF POS=(1,25),                                             C00019   
               LENGTH=30,                                              C00020   
               ATTRB=(ASKIP,BRT),                                      C00021   
               COLOR=NEUTRAL                                            00022   
ANETNAM DFHMDF POS=(1,61),                                             C00023**2
               LENGTH=8,                                               C00024**3
               ATTRB=(ASKIP,BRT,FSET)                                   00025   
AMNEMIC DFHMDF POS=(1,71),                                             C00026**2
               LENGTH=8,                                               C00027   
               ATTRB=(ASKIP,BRT)                                        00028   
*                                                                       00029   
        DFHMDF POS=(5,6),                                              C00030   
               LENGTH=8,                                               C00031   
               INITIAL='VALUE',                                        C00032   
               ATTRB=(PROT,BRT),                                       C00033   
               COLOR=NEUTRAL                                            00034   
        DFHMDF POS=(5,35),                                             C00035   
               LENGTH=11,                                              C00036   
               INITIAL='DESCRIPTION',                                  C00037   
               ATTRB=(PROT,BRT),                                       C00038   
               COLOR=NEUTRAL                                            00039   
APARM   DFHMDF POS=(6,6),                                              C00040   
               LENGTH=8,                                               C00041   
               PICOUT='X(8)',                                          C00042   
               ATTRB=(UNPROT,NORM),                                    C00043   
               COLOR=GREEN,                                            C00044   
               HILIGHT=UNDERLINE                                        00045   
ADESC01 DFHMDF POS=(6,15),                                             C00046   
               LENGTH=60,                                              C00047   
               PICOUT='X(60)',                                         C00048   
               ATTRB=(ASKIP,NORM),                                     C00049   
               COLOR=BLUE                                               00050   
        DFHMDF POS=(6,76),                                             C00051   
               LENGTH=1,                                               C00052   
               INITIAL=' ',                                            C00053   
               ATTRB=(ASKIP,DRK)                                        00054   
ATEXT01 DFHMDF POS=(8,15),                                             C00055   
               LENGTH=60,                                              C00056   
               PICOUT='X(60)',                                         C00057   
               ATTRB=(ASKIP,NORM),                                     C00058   
               COLOR=BLUE                                               00059   
        DFHMDF POS=(8,76),                                             C00060   
               LENGTH=1,                                               C00061   
               INITIAL=' ',                                            C00062   
               ATTRB=(ASKIP,DRK)                                        00063   
ATEXT02 DFHMDF POS=(9,15),                                             C00064   
               LENGTH=60,                                              C00065   
               PICOUT='X(60)',                                         C00066   
               ATTRB=(ASKIP,NORM),                                     C00067   
               COLOR=BLUE                                               00068   
        DFHMDF POS=(9,76),                                             C00069   
               LENGTH=1,                                               C00070   
               INITIAL=' ',                                            C00071   
               ATTRB=(ASKIP,DRK)                                        00072   
ATEXT03 DFHMDF POS=(10,15),                                            C00073   
               LENGTH=60,                                              C00074   
               PICOUT='X(60)',                                         C00075   
               ATTRB=(ASKIP,NORM),                                     C00076   
               COLOR=BLUE                                               00077   
        DFHMDF POS=(10,76),                                            C00078   
               LENGTH=1,                                               C00079   
               INITIAL=' ',                                            C00080   
               ATTRB=(ASKIP,DRK)                                        00081   
ATEXT04 DFHMDF POS=(11,15),                                            C00082   
               LENGTH=60,                                              C00083   
               PICOUT='X(60)',                                         C00084   
               ATTRB=(ASKIP,NORM),                                     C00085   
               COLOR=BLUE                                               00086   
        DFHMDF POS=(11,76),                                            C00087   
               LENGTH=1,                                               C00088   
               INITIAL=' ',                                            C00089   
               ATTRB=(ASKIP,DRK)                                        00090   
AMSG    DFHMDF POS=(21,1),                                             C00091   
               LENGTH=78,                                              C00092   
               COLOR=NEUTRAL,                                          C00093   
               ATTRB=(ASKIP,BRT)                                        00094   
        DFHMDF POS=(22,1),                                             C00095   
               LENGTH=11,                                              C00096   
               INITIAL='COMMAND===>',                                  C00097   
               COLOR=NEUTRAL,                                          C00098   
               ATTRB=(PROT,NORM)                                        00099   
ANAVCMD DFHMDF POS=(22,13),                                            C00100   
               LENGTH=8,                                               C00101   
               COLOR=GREEN,                                            C00102   
               HILIGHT=UNDERLINE,                                      C00103   
               ATTRB=(UNPROT,NORM)                                      00104   
        DFHMDF POS=(22,22),                                            C00105   
               LENGTH=1,                                               C00106   
               INITIAL=' ',                                            C00107   
               ATTRB=(ASKIP,DRK)                                        00108   
        DFHMDF POS=(22,24),                                            C00109   
               LENGTH=7,                                               C00110   
               INITIAL='KEY===>',                                      C00111   
               COLOR=NEUTRAL,                                          C00112   
               ATTRB=(PROT,NORM)                                        00113   
ANAVKEY DFHMDF POS=(22,32),                                            C00114   
               LENGTH=25,                                              C00115   
               COLOR=GREEN,                                            C00116   
               HILIGHT=UNDERLINE,                                      C00117   
               ATTRB=(UNPROT,NORM)                                      00118   
        DFHMDF POS=(22,58),                                            C00119   
               LENGTH=1,                                               C00120   
               INITIAL=' ',                                            C00121   
               ATTRB=(ASKIP,DRK)                                        00122   
        DFHMDF POS=(22,63),                                            C00123   
               LENGTH=16,                                              C00124   
               ATTRB=(ASKIP,BRT),                                      C00125   
               COLOR=NEUTRAL,                                          C00126   
               INITIAL='PA2=OTHER F KEYS'                               00127   
AFKLIN1 DFHMDF POS=(23,1),                                             C00128   
               LENGTH=78,                                              C00129   
               ATTRB=(ASKIP,BRT)                                        00130   
AFKLIN2 DFHMDF POS=(24,1),                                             C00131   
               LENGTH=78,                                              C00132   
               ATTRB=(ASKIP,BRT)                                        00133   
        DFHMSD TYPE=FINAL                                               00134   
        END                                                             00135   
*                                                                       00136   
