*          DATA SET PEKM196    AT LEVEL 025 AS OF 09/25/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  PEKM196                                            *   00004   
*        MAP     PE196A                                             *   00005   
*        PROGRAM PEKCS196                                           *   00006   
*        TRANSID Q196                                               *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
PEKM196 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
PE196A  DFHMDI SIZE=(19,80),                                           X00016   
               LINE=2,COLUMN=1,                                        X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='STORE.......:',                                X00022*23
               LENGTH=13,                                              X00023*23
               COLOR=NEUTRAL,                                          X00024   
               POS=(02,02)                                              00025   
ASTRN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=4,                                               X00027   
               COLOR=BLUE,                                             X00028   
               POS=(02,16)                                              00029*23
ASTRNM  DFHMDF ATTRB=(ASKIP,BRT),                                      X00030   
               LENGTH=25,                                              X00031   
               COLOR=BLUE,                                             X00032   
               POS=(02,21)                                              00033*23
*                                                                       00034   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00035   
               INITIAL='DOCUMENT....:',                                X00036*23
               LENGTH=13,                                              X00037*24
               COLOR=NEUTRAL,                                          X00038   
               POS=(03,02)                                              00039   
ADOCN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00040   
               LENGTH=7,                                               X00041   
               COLOR=BLUE,                                             X00042   
               POS=(03,16)                                              00043*23
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='ISSUED:',                                      X00045   
               LENGTH=7,                                               X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(03,42)                                              00048*23
AISSDTE DFHMDF ATTRB=(ASKIP,BRT),                                      X00049   
               LENGTH=8,                                               X00050   
               COLOR=BLUE,                                             X00051   
               POS=(03,50)                                              00052*23
*                                                                       00053   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00054   
               INITIAL='TYPE/REASON.:',                                X00055*23
               LENGTH=13,                                              X00056*23
               COLOR=NEUTRAL,                                          X00057   
               POS=(04,02)                                              00058   
ARSN    DFHMDF ATTRB=(UNPROT,NORM),                                    X00059**2
               LENGTH=3,                                               X00060   
               COLOR=GREEN,                                            X00061**2
               HILIGHT=UNDERLINE,                                      X00062**2
               POS=(04,16)                                              00063*23
ATYPD   DFHMDF ATTRB=(ASKIP,BRT),                                      X00064**2
               LENGTH=8,                                               X00065**2
               COLOR=BLUE,                                             X00066**2
               POS=(04,20)                                              00067*23
ARSND   DFHMDF ATTRB=(ASKIP,BRT),                                      X00068**2
               LENGTH=12,                                              X00069*20
               COLOR=BLUE,                                             X00070**2
               POS=(04,29)                                              00071*23
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00072**2
               INITIAL='STATUS:',                                      X00073**2
               LENGTH=7,                                               X00074**2
               COLOR=NEUTRAL,                                          X00075**2
               POS=(04,42)                                              00076*23
ASTAT   DFHMDF ATTRB=(ASKIP,BRT),                                      X00077*20
               LENGTH=2,                                               X00078*21
               COLOR=BLUE,                                             X00079**2
               POS=(04,50)                                              00080*23
ASTATD  DFHMDF ATTRB=(ASKIP,BRT),                                      X00081*20
               LENGTH=12,                                              X00082*20
               COLOR=BLUE,                                             X00083*20
               POS=(04,53)                                              00084*23
*                                                                       00085   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00086   
               INITIAL='COMPLETED BY:',                                X00087*22
               LENGTH=13,                                              X00088*22
               COLOR=NEUTRAL,                                          X00089   
               POS=(05,02)                                              00090**2
AEFFNM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00091**2
               LENGTH=30,                                              X00092**2
               COLOR=GREEN,                                            X00093**2
               HILIGHT=UNDERLINE,                                      X00094**2
               POS=(05,16)                                              00095*22
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00096**2
               INITIAL='ON',                                           X00097**2
               LENGTH=2,                                               X00098**2
               COLOR=NEUTRAL,                                          X00099**2
               POS=(05,47)                                              00100*22
AEFFMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00101**2
               LENGTH=2,                                               X00102**2
               COLOR=GREEN,                                            X00103**2
               HILIGHT=UNDERLINE,                                      X00104**2
               POS=(05,50)                                              00105*22
AEFFDD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00106**2
               LENGTH=2,                                               X00107**2
               COLOR=GREEN,                                            X00108**2
               HILIGHT=UNDERLINE,                                      X00109**2
               POS=(05,53)                                              00110*22
AEFFYY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00111**2
               LENGTH=2,                                               X00112**2
               COLOR=GREEN,                                            X00113**2
               HILIGHT=UNDERLINE,                                      X00114**2
               POS=(05,56)                                              00115*22
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00116**2
               LENGTH=1,                                               X00117**2
               INITIAL=' ',                                            X00118**2
               POS=(05,59)                                              00119*22
*                                                                       00120   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00121**4
               INITIAL='DEPT/AREA...:',                                X00122*22
               LENGTH=13,                                              X00123*22
               COLOR=NEUTRAL,                                          X00124**4
               POS=(06,02)                                              00125**4
ADPTAR  DFHMDF ATTRB=(UNPROT,NORM),                                    X00126**2
               LENGTH=40,                                              X00127**2
               COLOR=GREEN,                                            X00128**2
               HILIGHT=UNDERLINE,                                      X00129**2
               POS=(06,16)                                              00130*22
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00131**2
               LENGTH=1,                                               X00132**2
               INITIAL=' ',                                            X00133**2
               POS=(06,57)                                              00134*22
*                                                                       00135**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00136**2
               INITIAL='TOTAL QUANTITY:',                              X00137*19
               LENGTH=15,                                              X00138*19
               COLOR=NEUTRAL,                                          X00139**2
               POS=(07,50)                                              00140*19
ATOTQTY DFHMDF ATTRB=(UNPROT,NORM),                                    X00141**2
               JUSTIFY=(LEFT,BLANK),                                   X00142**2
               PICOUT='ZZZ,ZZ9',                                       X00143**2
               LENGTH=7,                                               X00144**2
               COLOR=GREEN,                                            X00145**2
               HILIGHT=UNDERLINE,                                      X00146**2
               POS=(07,67)                                              00147*19
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00148**2
               LENGTH=1,                                               X00149**2
               INITIAL=' ',                                            X00150**2
               POS=(07,75)                                              00151*19
*                                                                       00152   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00153   
               INITIAL='ORIGINAL',                                     X00154**2
               LENGTH=08,                                              X00155**2
               POS=(08,34)                                              00156*17
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00157**2
               INITIAL='NEW',                                          X00158**2
               LENGTH=03,                                              X00159**2
               POS=(08,49)                                              00160*17
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00161**2
               INITIAL='PRICE',                                        X00162**2
               LENGTH=05,                                              X00163**2
               POS=(08,59)                                              00164*17
*                                                                       00165**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00166**2
               INITIAL='LN',                                           X00167**2
               LENGTH=02,                                              X00168**2
               POS=(09,01)                                              00169*16
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00170**2
               INITIAL='SKU NUMBER',                                   X00171**2
               LENGTH=10,                                              X00172**2
               POS=(09,05)                                              00173*16
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00182**2
               INITIAL='UPC',                                          X00183**2
               LENGTH=3,                                               X00184**2
               POS=(09,24)                                              00185*16
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00186**2
               INITIAL='PRICE',                                        X00187**2
               LENGTH=5,                                               X00188**2
               POS=(09,36)                                              00189*17
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00190**2
               INITIAL='PRICE',                                        X00191**2
               LENGTH=5,                                               X00192**2
               POS=(09,48)                                              00193*17
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00194**2
               INITIAL='DIFF.',                                        X00195**2
               LENGTH=5,                                               X00196**2
               POS=(09,59)                                              00197*17
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00198**2
               INITIAL='QUANTITY',                                     X00199**2
               LENGTH=8,                                               X00200**2
               POS=(09,66)                                              00201*18
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00202**2
               INITIAL='LN',                                           X00203**2
               LENGTH=2,                                               X00204**2
               POS=(09,77)                                              00205*18
*                                                                       00206   
ALNF01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00207**2
               LENGTH=3,                                               X00208**2
               COLOR=BLUE,                                             X00209**4
               POS=(10,01)                                              00210**2
ASKU01  DFHMDF ATTRB=(UNPROT,NORM),                                    X00221**2
               LENGTH=8,                                               X00222**2
               COLOR=GREEN,                                            X00223**2
               HILIGHT=UNDERLINE,                                      X00224**2
               POS=(10,06)                                              00225*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00226**9
               LENGTH=1,                                               X00227**9
               INITIAL=' ',                                            X00228**9
               POS=(10,15)                                              00229*17
AUPC01  DFHMDF ATTRB=(UNPROT,NORM),                                    X00230**2
               LENGTH=13,                                              X00231**2
               COLOR=GREEN,                                            X00232**2
               HILIGHT=UNDERLINE,                                      X00233**2
               POS=(10,18)                                              00234*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00235*10
               LENGTH=1,                                               X00236*10
               INITIAL=' ',                                            X00237*10
               POS=(10,32)                                              00238*17
AORPR01 DFHMDF ATTRB=(UNPROT,NORM),                                    X00239**2
               LENGTH=8,                                               X00240**2
               JUSTIFY=(LEFT,BLANK),                                   X00241**2
               PICOUT='ZZZZ9.99',                                      X00242**2
               COLOR=GREEN,                                            X00243**2
               HILIGHT=UNDERLINE,                                      X00244**2
               POS=(10,34)                                              00245*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00246*13
               LENGTH=1,                                               X00247*13
               INITIAL=' ',                                            X00248*13
               POS=(10,43)                                              00249*17
ANWPR01 DFHMDF ATTRB=(UNPROT,NORM),                                    X00250**2
               LENGTH=8,                                               X00251**2
               JUSTIFY=(LEFT,BLANK),                                   X00252**2
               PICOUT='ZZZZ9.99',                                      X00253**2
               COLOR=GREEN,                                            X00254**2
               HILIGHT=UNDERLINE,                                      X00255**2
               POS=(10,45)                                              00256*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00257*17
               LENGTH=1,                                               X00258*17
               INITIAL=' ',                                            X00259*17
               POS=(10,54)                                              00260*17
APRDF01 DFHMDF ATTRB=(UNPROT,NORM),                                    X00261**2
               LENGTH=8,                                               X00262**2
               JUSTIFY=(LEFT,BLANK),                                   X00263**2
               PICOUT='ZZZZ9.99',                                      X00264**2
               COLOR=GREEN,                                            X00265**2
               HILIGHT=UNDERLINE,                                      X00266**2
               POS=(10,56)                                              00267*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00268*17
               LENGTH=1,                                               X00269*17
               INITIAL=' ',                                            X00270*17
               POS=(10,65)                                              00271*17
AQTY01  DFHMDF ATTRB=(UNPROT,NORM),                                    X00272**2
               LENGTH=7,                                               X00273**2
               JUSTIFY=(LEFT,BLANK),                                   X00274**2
               PICOUT='ZZZ,ZZ9',                                       X00275**2
               COLOR=GREEN,                                            X00276**2
               HILIGHT=UNDERLINE,                                      X00277**2
               POS=(10,67)                                              00278*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00279*17
               LENGTH=1,                                               X00280*17
               INITIAL=' ',                                            X00281*17
               POS=(10,75)                                              00282*17
ALNL01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00283**2
               LENGTH=3,                                               X00284**2
               COLOR=BLUE,                                             X00285**2
               POS=(10,77)                                              00286**2
*                                                                       00287**3
ALNF02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00288**3
               LENGTH=3,                                               X00289**3
               COLOR=BLUE,                                             X00290**4
               POS=(11,01)                                              00291**3
ASKU02  DFHMDF ATTRB=(UNPROT,NORM),                                    X00302**3
               LENGTH=8,                                               X00303**3
               COLOR=GREEN,                                            X00304**3
               HILIGHT=UNDERLINE,                                      X00305**3
               POS=(11,06)                                              00306*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00307**9
               LENGTH=1,                                               X00308**9
               INITIAL=' ',                                            X00309**9
               POS=(11,15)                                              00310*17
AUPC02  DFHMDF ATTRB=(UNPROT,NORM),                                    X00311**3
               LENGTH=13,                                              X00312**3
               COLOR=GREEN,                                            X00313**3
               HILIGHT=UNDERLINE,                                      X00314**3
               POS=(11,18)                                              00315*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00316*11
               LENGTH=1,                                               X00317*11
               INITIAL=' ',                                            X00318*11
               POS=(11,32)                                              00319*17
AORPR02 DFHMDF ATTRB=(UNPROT,NORM),                                    X00320**3
               LENGTH=8,                                               X00321**3
               JUSTIFY=(LEFT,BLANK),                                   X00322**3
               PICOUT='ZZZZ9.99',                                      X00323**3
               COLOR=GREEN,                                            X00324**3
               HILIGHT=UNDERLINE,                                      X00325**3
               POS=(11,34)                                              00326*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00327*13
               LENGTH=1,                                               X00328*13
               INITIAL=' ',                                            X00329*13
               POS=(11,43)                                              00330*17
ANWPR02 DFHMDF ATTRB=(UNPROT,NORM),                                    X00331**3
               LENGTH=8,                                               X00332**3
               JUSTIFY=(LEFT,BLANK),                                   X00333**3
               PICOUT='ZZZZ9.99',                                      X00334**3
               COLOR=GREEN,                                            X00335**3
               HILIGHT=UNDERLINE,                                      X00336**3
               POS=(11,45)                                              00337*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00338*17
               LENGTH=1,                                               X00339*17
               INITIAL=' ',                                            X00340*17
               POS=(11,54)                                              00341*17
APRDF02 DFHMDF ATTRB=(UNPROT,NORM),                                    X00342**3
               LENGTH=8,                                               X00343**3
               JUSTIFY=(LEFT,BLANK),                                   X00344**3
               PICOUT='ZZZZ9.99',                                      X00345**3
               COLOR=GREEN,                                            X00346**3
               HILIGHT=UNDERLINE,                                      X00347**3
               POS=(11,56)                                              00348*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00349*17
               LENGTH=1,                                               X00350*17
               INITIAL=' ',                                            X00351*17
               POS=(11,65)                                              00352*17
AQTY02  DFHMDF ATTRB=(UNPROT,NORM),                                    X00353**3
               LENGTH=7,                                               X00354**3
               JUSTIFY=(LEFT,BLANK),                                   X00355**3
               PICOUT='ZZZ,ZZ9',                                       X00356**3
               COLOR=GREEN,                                            X00357**3
               HILIGHT=UNDERLINE,                                      X00358**3
               POS=(11,67)                                              00359*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00360*17
               LENGTH=1,                                               X00361*17
               INITIAL=' ',                                            X00362*17
               POS=(11,75)                                              00363*17
ALNL02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00364**3
               LENGTH=3,                                               X00365**3
               COLOR=BLUE,                                             X00366**3
               POS=(11,77)                                              00367**3
*                                                                       00368**3
ALNF03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00369**3
               LENGTH=3,                                               X00370**3
               COLOR=BLUE,                                             X00371**4
               POS=(12,01)                                              00372**3
ASKU03  DFHMDF ATTRB=(UNPROT,NORM),                                    X00383**3
               LENGTH=8,                                               X00384**3
               COLOR=GREEN,                                            X00385**3
               HILIGHT=UNDERLINE,                                      X00386**3
               POS=(12,06)                                              00387*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00388**9
               LENGTH=1,                                               X00389**9
               INITIAL=' ',                                            X00390**9
               POS=(12,15)                                              00391*17
AUPC03  DFHMDF ATTRB=(UNPROT,NORM),                                    X00392**3
               LENGTH=13,                                              X00393**3
               COLOR=GREEN,                                            X00394**3
               HILIGHT=UNDERLINE,                                      X00395**3
               POS=(12,18)                                              00396*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00397*11
               LENGTH=1,                                               X00398*11
               INITIAL=' ',                                            X00399*11
               POS=(12,32)                                              00400*17
AORPR03 DFHMDF ATTRB=(UNPROT,NORM),                                    X00401**3
               LENGTH=8,                                               X00402**3
               JUSTIFY=(LEFT,BLANK),                                   X00403**3
               PICOUT='ZZZZ9.99',                                      X00404**3
               COLOR=GREEN,                                            X00405**3
               HILIGHT=UNDERLINE,                                      X00406**3
               POS=(12,34)                                              00407*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00408*13
               LENGTH=1,                                               X00409*13
               INITIAL=' ',                                            X00410*13
               POS=(12,43)                                              00411*17
ANWPR03 DFHMDF ATTRB=(UNPROT,NORM),                                    X00412**3
               LENGTH=8,                                               X00413**3
               JUSTIFY=(LEFT,BLANK),                                   X00414**3
               PICOUT='ZZZZ9.99',                                      X00415**3
               COLOR=GREEN,                                            X00416**3
               HILIGHT=UNDERLINE,                                      X00417**3
               POS=(12,45)                                              00418*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00419*17
               LENGTH=1,                                               X00420*17
               INITIAL=' ',                                            X00421*17
               POS=(12,54)                                              00422*17
APRDF03 DFHMDF ATTRB=(UNPROT,NORM),                                    X00423**3
               LENGTH=8,                                               X00424**3
               JUSTIFY=(LEFT,BLANK),                                   X00425**3
               PICOUT='ZZZZ9.99',                                      X00426**3
               COLOR=GREEN,                                            X00427**3
               HILIGHT=UNDERLINE,                                      X00428**3
               POS=(12,56)                                              00429*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00430*17
               LENGTH=1,                                               X00431*17
               INITIAL=' ',                                            X00432*17
               POS=(12,65)                                              00433*17
AQTY03  DFHMDF ATTRB=(UNPROT,NORM),                                    X00434**3
               LENGTH=7,                                               X00435**3
               JUSTIFY=(LEFT,BLANK),                                   X00436**3
               PICOUT='ZZZ,ZZ9',                                       X00437**3
               COLOR=GREEN,                                            X00438**3
               HILIGHT=UNDERLINE,                                      X00439**3
               POS=(12,67)                                              00440*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00441*17
               LENGTH=1,                                               X00442*17
               INITIAL=' ',                                            X00443*17
               POS=(12,75)                                              00444*17
ALNL03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00445**3
               LENGTH=3,                                               X00446**3
               COLOR=BLUE,                                             X00447**3
               POS=(12,77)                                              00448**3
*                                                                       00449**3
ALNF04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00450**3
               LENGTH=3,                                               X00451**3
               COLOR=BLUE,                                             X00452**4
               POS=(13,01)                                              00453**3
ASKU04  DFHMDF ATTRB=(UNPROT,NORM),                                    X00464**3
               LENGTH=8,                                               X00465**3
               COLOR=GREEN,                                            X00466**3
               HILIGHT=UNDERLINE,                                      X00467**3
               POS=(13,06)                                              00468*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00469**9
               LENGTH=1,                                               X00470**9
               INITIAL=' ',                                            X00471**9
               POS=(13,15)                                              00472*17
AUPC04  DFHMDF ATTRB=(UNPROT,NORM),                                    X00473**3
               LENGTH=13,                                              X00474**3
               COLOR=GREEN,                                            X00475**3
               HILIGHT=UNDERLINE,                                      X00476**3
               POS=(13,18)                                              00477*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00478*11
               LENGTH=1,                                               X00479*11
               INITIAL=' ',                                            X00480*11
               POS=(13,32)                                              00481*17
AORPR04 DFHMDF ATTRB=(UNPROT,NORM),                                    X00482**3
               LENGTH=8,                                               X00483**3
               JUSTIFY=(LEFT,BLANK),                                   X00484**3
               PICOUT='ZZZZ9.99',                                      X00485**3
               COLOR=GREEN,                                            X00486**3
               HILIGHT=UNDERLINE,                                      X00487**3
               POS=(13,34)                                              00488*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00489*13
               LENGTH=1,                                               X00490*13
               INITIAL=' ',                                            X00491*13
               POS=(13,43)                                              00492*17
ANWPR04 DFHMDF ATTRB=(UNPROT,NORM),                                    X00493**3
               LENGTH=8,                                               X00494**3
               JUSTIFY=(LEFT,BLANK),                                   X00495**3
               PICOUT='ZZZZ9.99',                                      X00496**3
               COLOR=GREEN,                                            X00497**3
               HILIGHT=UNDERLINE,                                      X00498**3
               POS=(13,45)                                              00499*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00500*17
               LENGTH=1,                                               X00501*17
               INITIAL=' ',                                            X00502*17
               POS=(13,54)                                              00503*17
APRDF04 DFHMDF ATTRB=(UNPROT,NORM),                                    X00504**3
               LENGTH=8,                                               X00505**3
               JUSTIFY=(LEFT,BLANK),                                   X00506**3
               PICOUT='ZZZZ9.99',                                      X00507**3
               COLOR=GREEN,                                            X00508**3
               HILIGHT=UNDERLINE,                                      X00509**3
               POS=(13,56)                                              00510*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00511*17
               LENGTH=1,                                               X00512*17
               INITIAL=' ',                                            X00513*17
               POS=(13,65)                                              00514*17
AQTY04  DFHMDF ATTRB=(UNPROT,NORM),                                    X00515**3
               LENGTH=7,                                               X00516**3
               JUSTIFY=(LEFT,BLANK),                                   X00517**3
               PICOUT='ZZZ,ZZ9',                                       X00518**3
               COLOR=GREEN,                                            X00519**3
               HILIGHT=UNDERLINE,                                      X00520**3
               POS=(13,67)                                              00521*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00522*17
               LENGTH=1,                                               X00523*17
               INITIAL=' ',                                            X00524*17
               POS=(13,75)                                              00525*17
ALNL04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00526**3
               LENGTH=3,                                               X00527**3
               COLOR=BLUE,                                             X00528**3
               POS=(13,77)                                              00529**3
*                                                                       00530**3
ALNF05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00531**3
               LENGTH=3,                                               X00532**3
               COLOR=BLUE,                                             X00533**4
               POS=(14,01)                                              00534**3
ASKU05  DFHMDF ATTRB=(UNPROT,NORM),                                    X00545**3
               LENGTH=8,                                               X00546**3
               COLOR=GREEN,                                            X00547**3
               HILIGHT=UNDERLINE,                                      X00548**3
               POS=(14,06)                                              00549*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00550**9
               LENGTH=1,                                               X00551**9
               INITIAL=' ',                                            X00552**9
               POS=(14,15)                                              00553*17
AUPC05  DFHMDF ATTRB=(UNPROT,NORM),                                    X00554**3
               LENGTH=13,                                              X00555**3
               COLOR=GREEN,                                            X00556**3
               HILIGHT=UNDERLINE,                                      X00557**3
               POS=(14,18)                                              00558*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00559*11
               LENGTH=1,                                               X00560*11
               INITIAL=' ',                                            X00561*11
               POS=(14,32)                                              00562*17
AORPR05 DFHMDF ATTRB=(UNPROT,NORM),                                    X00563**3
               LENGTH=8,                                               X00564**3
               JUSTIFY=(LEFT,BLANK),                                   X00565**3
               PICOUT='ZZZZ9.99',                                      X00566**3
               COLOR=GREEN,                                            X00567**3
               HILIGHT=UNDERLINE,                                      X00568**3
               POS=(14,34)                                              00569*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00570*13
               LENGTH=1,                                               X00571*13
               INITIAL=' ',                                            X00572*13
               POS=(14,43)                                              00573*17
ANWPR05 DFHMDF ATTRB=(UNPROT,NORM),                                    X00574**3
               LENGTH=8,                                               X00575**3
               JUSTIFY=(LEFT,BLANK),                                   X00576**3
               PICOUT='ZZZZ9.99',                                      X00577**3
               COLOR=GREEN,                                            X00578**3
               HILIGHT=UNDERLINE,                                      X00579**3
               POS=(14,45)                                              00580*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00581*17
               LENGTH=1,                                               X00582*17
               INITIAL=' ',                                            X00583*17
               POS=(14,54)                                              00584*17
APRDF05 DFHMDF ATTRB=(UNPROT,NORM),                                    X00585**3
               LENGTH=8,                                               X00586**3
               JUSTIFY=(LEFT,BLANK),                                   X00587**3
               PICOUT='ZZZZ9.99',                                      X00588**3
               COLOR=GREEN,                                            X00589**3
               HILIGHT=UNDERLINE,                                      X00590**3
               POS=(14,56)                                              00591*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00592*17
               LENGTH=1,                                               X00593*17
               INITIAL=' ',                                            X00594*17
               POS=(14,65)                                              00595*17
AQTY05  DFHMDF ATTRB=(UNPROT,NORM),                                    X00596**3
               LENGTH=7,                                               X00597**3
               JUSTIFY=(LEFT,BLANK),                                   X00598**3
               PICOUT='ZZZ,ZZ9',                                       X00599**3
               COLOR=GREEN,                                            X00600**3
               HILIGHT=UNDERLINE,                                      X00601**3
               POS=(14,67)                                              00602*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00603*17
               LENGTH=1,                                               X00604*17
               INITIAL=' ',                                            X00605*17
               POS=(14,75)                                              00606*17
ALNL05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00607**3
               LENGTH=3,                                               X00608**3
               COLOR=BLUE,                                             X00609**3
               POS=(14,77)                                              00610**3
*                                                                       00611**3
ALNF06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00612**3
               LENGTH=3,                                               X00613**3
               COLOR=BLUE,                                             X00614**4
               POS=(15,01)                                              00615**3
ASKU06  DFHMDF ATTRB=(UNPROT,NORM),                                    X00626**3
               LENGTH=8,                                               X00627**3
               COLOR=GREEN,                                            X00628**3
               HILIGHT=UNDERLINE,                                      X00629**3
               POS=(15,06)                                              00630*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00631**9
               LENGTH=1,                                               X00632**9
               INITIAL=' ',                                            X00633**9
               POS=(15,15)                                              00634*17
AUPC06  DFHMDF ATTRB=(UNPROT,NORM),                                    X00635**3
               LENGTH=13,                                              X00636**3
               COLOR=GREEN,                                            X00637**3
               HILIGHT=UNDERLINE,                                      X00638**3
               POS=(15,18)                                              00639*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00640*11
               LENGTH=1,                                               X00641*11
               INITIAL=' ',                                            X00642*11
               POS=(15,32)                                              00643*17
AORPR06 DFHMDF ATTRB=(UNPROT,NORM),                                    X00644**3
               LENGTH=8,                                               X00645**3
               JUSTIFY=(LEFT,BLANK),                                   X00646**3
               PICOUT='ZZZZ9.99',                                      X00647**3
               COLOR=GREEN,                                            X00648**3
               HILIGHT=UNDERLINE,                                      X00649**3
               POS=(15,34)                                              00650*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00651*13
               LENGTH=1,                                               X00652*13
               INITIAL=' ',                                            X00653*13
               POS=(15,43)                                              00654*17
ANWPR06 DFHMDF ATTRB=(UNPROT,NORM),                                    X00655**3
               LENGTH=8,                                               X00656**3
               JUSTIFY=(LEFT,BLANK),                                   X00657**3
               PICOUT='ZZZZ9.99',                                      X00658**3
               COLOR=GREEN,                                            X00659**3
               HILIGHT=UNDERLINE,                                      X00660**3
               POS=(15,45)                                              00661*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00662*17
               LENGTH=1,                                               X00663*17
               INITIAL=' ',                                            X00664*17
               POS=(15,54)                                              00665*17
APRDF06 DFHMDF ATTRB=(UNPROT,NORM),                                    X00666**3
               LENGTH=8,                                               X00667**3
               JUSTIFY=(LEFT,BLANK),                                   X00668**3
               PICOUT='ZZZZ9.99',                                      X00669**3
               COLOR=GREEN,                                            X00670**3
               HILIGHT=UNDERLINE,                                      X00671**3
               POS=(15,56)                                              00672*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00673*17
               LENGTH=1,                                               X00674*17
               INITIAL=' ',                                            X00675*17
               POS=(15,65)                                              00676*17
AQTY06  DFHMDF ATTRB=(UNPROT,NORM),                                    X00677**3
               LENGTH=7,                                               X00678**3
               JUSTIFY=(LEFT,BLANK),                                   X00679**3
               PICOUT='ZZZ,ZZ9',                                       X00680**3
               COLOR=GREEN,                                            X00681**3
               HILIGHT=UNDERLINE,                                      X00682**3
               POS=(15,67)                                              00683*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00684*17
               LENGTH=1,                                               X00685*17
               INITIAL=' ',                                            X00686*17
               POS=(15,75)                                              00687*17
ALNL06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00688**3
               LENGTH=3,                                               X00689**3
               COLOR=BLUE,                                             X00690**3
               POS=(15,77)                                              00691**3
*                                                                       00692**3
ALNF07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00693**3
               LENGTH=3,                                               X00694**3
               COLOR=BLUE,                                             X00695**4
               POS=(16,01)                                              00696**3
ASKU07  DFHMDF ATTRB=(UNPROT,NORM),                                    X00707**3
               LENGTH=8,                                               X00708**3
               COLOR=GREEN,                                            X00709**3
               HILIGHT=UNDERLINE,                                      X00710**3
               POS=(16,06)                                              00711*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00712**9
               LENGTH=1,                                               X00713**9
               INITIAL=' ',                                            X00714**9
               POS=(16,15)                                              00715*17
AUPC07  DFHMDF ATTRB=(UNPROT,NORM),                                    X00716**3
               LENGTH=13,                                              X00717**3
               COLOR=GREEN,                                            X00718**3
               HILIGHT=UNDERLINE,                                      X00719**3
               POS=(16,18)                                              00720*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00721*11
               LENGTH=1,                                               X00722*11
               INITIAL=' ',                                            X00723*11
               POS=(16,32)                                              00724*17
AORPR07 DFHMDF ATTRB=(UNPROT,NORM),                                    X00725**3
               LENGTH=8,                                               X00726**3
               JUSTIFY=(LEFT,BLANK),                                   X00727**3
               PICOUT='ZZZZ9.99',                                      X00728**3
               COLOR=GREEN,                                            X00729**3
               HILIGHT=UNDERLINE,                                      X00730**3
               POS=(16,34)                                              00731*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00732*13
               LENGTH=1,                                               X00733*13
               INITIAL=' ',                                            X00734*13
               POS=(16,43)                                              00735*17
ANWPR07 DFHMDF ATTRB=(UNPROT,NORM),                                    X00736**3
               LENGTH=8,                                               X00737**3
               JUSTIFY=(LEFT,BLANK),                                   X00738**3
               PICOUT='ZZZZ9.99',                                      X00739**3
               COLOR=GREEN,                                            X00740**3
               HILIGHT=UNDERLINE,                                      X00741**3
               POS=(16,45)                                              00742*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00743*17
               LENGTH=1,                                               X00744*17
               INITIAL=' ',                                            X00745*17
               POS=(16,54)                                              00746*17
APRDF07 DFHMDF ATTRB=(UNPROT,NORM),                                    X00747**3
               LENGTH=8,                                               X00748**3
               JUSTIFY=(LEFT,BLANK),                                   X00749**3
               PICOUT='ZZZZ9.99',                                      X00750**3
               COLOR=GREEN,                                            X00751**3
               HILIGHT=UNDERLINE,                                      X00752**3
               POS=(16,56)                                              00753*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00754*17
               LENGTH=1,                                               X00755*17
               INITIAL=' ',                                            X00756*17
               POS=(16,65)                                              00757*17
AQTY07  DFHMDF ATTRB=(UNPROT,NORM),                                    X00758**3
               LENGTH=7,                                               X00759**3
               JUSTIFY=(LEFT,BLANK),                                   X00760**3
               PICOUT='ZZZ,ZZ9',                                       X00761**3
               COLOR=GREEN,                                            X00762**3
               HILIGHT=UNDERLINE,                                      X00763**3
               POS=(16,67)                                              00764*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00765*17
               LENGTH=1,                                               X00766*17
               INITIAL=' ',                                            X00767*17
               POS=(16,75)                                              00768*17
ALNL07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00769**3
               LENGTH=3,                                               X00770**3
               COLOR=BLUE,                                             X00771**3
               POS=(16,77)                                              00772**3
*                                                                       00773**3
ALNF08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00774**3
               LENGTH=3,                                               X00775**3
               COLOR=BLUE,                                             X00776**4
               POS=(17,01)                                              00777**3
ASKU08  DFHMDF ATTRB=(UNPROT,NORM),                                    X00788**3
               LENGTH=8,                                               X00789**3
               COLOR=GREEN,                                            X00790**3
               HILIGHT=UNDERLINE,                                      X00791**3
               POS=(17,06)                                              00792*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00793**9
               LENGTH=1,                                               X00794**9
               INITIAL=' ',                                            X00795**9
               POS=(17,15)                                              00796*17
AUPC08  DFHMDF ATTRB=(UNPROT,NORM),                                    X00797**3
               LENGTH=13,                                              X00798**3
               COLOR=GREEN,                                            X00799**3
               HILIGHT=UNDERLINE,                                      X00800**3
               POS=(17,18)                                              00801*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00802*11
               LENGTH=1,                                               X00803*11
               INITIAL=' ',                                            X00804*11
               POS=(17,32)                                              00805*17
AORPR08 DFHMDF ATTRB=(UNPROT,NORM),                                    X00806**3
               LENGTH=8,                                               X00807**3
               JUSTIFY=(LEFT,BLANK),                                   X00808**3
               PICOUT='ZZZZ9.99',                                      X00809**3
               COLOR=GREEN,                                            X00810**3
               HILIGHT=UNDERLINE,                                      X00811**3
               POS=(17,34)                                              00812*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00813*13
               LENGTH=1,                                               X00814*13
               INITIAL=' ',                                            X00815*13
               POS=(17,43)                                              00816*17
ANWPR08 DFHMDF ATTRB=(UNPROT,NORM),                                    X00817**3
               LENGTH=8,                                               X00818**3
               JUSTIFY=(LEFT,BLANK),                                   X00819**3
               PICOUT='ZZZZ9.99',                                      X00820**3
               COLOR=GREEN,                                            X00821**3
               HILIGHT=UNDERLINE,                                      X00822**3
               POS=(17,45)                                              00823*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00824*17
               LENGTH=1,                                               X00825*17
               INITIAL=' ',                                            X00826*17
               POS=(17,54)                                              00827*17
APRDF08 DFHMDF ATTRB=(UNPROT,NORM),                                    X00828**3
               LENGTH=8,                                               X00829**3
               JUSTIFY=(LEFT,BLANK),                                   X00830**3
               PICOUT='ZZZZ9.99',                                      X00831**3
               COLOR=GREEN,                                            X00832**3
               HILIGHT=UNDERLINE,                                      X00833**3
               POS=(17,56)                                              00834*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00835*17
               LENGTH=1,                                               X00836*17
               INITIAL=' ',                                            X00837*17
               POS=(17,65)                                              00838*17
AQTY08  DFHMDF ATTRB=(UNPROT,NORM),                                    X00839**3
               LENGTH=7,                                               X00840**3
               JUSTIFY=(LEFT,BLANK),                                   X00841**3
               PICOUT='ZZZ,ZZ9',                                       X00842**3
               COLOR=GREEN,                                            X00843**3
               HILIGHT=UNDERLINE,                                      X00844**3
               POS=(17,67)                                              00845*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00846*17
               LENGTH=1,                                               X00847*17
               INITIAL=' ',                                            X00848*17
               POS=(17,75)                                              00849*17
ALNL08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00850**3
               LENGTH=3,                                               X00851**3
               COLOR=BLUE,                                             X00852**3
               POS=(17,77)                                              00853**3
*                                                                       00854**3
ALNF09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00855**3
               LENGTH=3,                                               X00856**3
               COLOR=BLUE,                                             X00857**4
               POS=(18,01)                                              00858**3
ASKU09  DFHMDF ATTRB=(UNPROT,NORM),                                    X00869**3
               LENGTH=8,                                               X00870**3
               COLOR=GREEN,                                            X00871**3
               HILIGHT=UNDERLINE,                                      X00872**3
               POS=(18,06)                                              00873*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00874**9
               LENGTH=1,                                               X00875**9
               INITIAL=' ',                                            X00876**9
               POS=(18,15)                                              00877*17
AUPC09  DFHMDF ATTRB=(UNPROT,NORM),                                    X00878**3
               LENGTH=13,                                              X00879**3
               COLOR=GREEN,                                            X00880**3
               HILIGHT=UNDERLINE,                                      X00881**3
               POS=(18,18)                                              00882*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00883*11
               LENGTH=1,                                               X00884*11
               INITIAL=' ',                                            X00885*11
               POS=(18,32)                                              00886*17
AORPR09 DFHMDF ATTRB=(UNPROT,NORM),                                    X00887**3
               LENGTH=8,                                               X00888**3
               JUSTIFY=(LEFT,BLANK),                                   X00889**3
               PICOUT='ZZZZ9.99',                                      X00890**3
               COLOR=GREEN,                                            X00891**3
               HILIGHT=UNDERLINE,                                      X00892**3
               POS=(18,34)                                              00893*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00894*13
               LENGTH=1,                                               X00895*13
               INITIAL=' ',                                            X00896*13
               POS=(18,43)                                              00897*17
ANWPR09 DFHMDF ATTRB=(UNPROT,NORM),                                    X00898**3
               LENGTH=8,                                               X00899**3
               JUSTIFY=(LEFT,BLANK),                                   X00900**3
               PICOUT='ZZZZ9.99',                                      X00901**3
               COLOR=GREEN,                                            X00902**3
               HILIGHT=UNDERLINE,                                      X00903**3
               POS=(18,45)                                              00904*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00905*17
               LENGTH=1,                                               X00906*17
               INITIAL=' ',                                            X00907*17
               POS=(18,54)                                              00908*17
APRDF09 DFHMDF ATTRB=(UNPROT,NORM),                                    X00909**3
               LENGTH=8,                                               X00910**3
               JUSTIFY=(LEFT,BLANK),                                   X00911**3
               PICOUT='ZZZZ9.99',                                      X00912**3
               COLOR=GREEN,                                            X00913**3
               HILIGHT=UNDERLINE,                                      X00914**3
               POS=(18,56)                                              00915*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00916*17
               LENGTH=1,                                               X00917*17
               INITIAL=' ',                                            X00918*17
               POS=(18,65)                                              00919*17
AQTY09  DFHMDF ATTRB=(UNPROT,NORM),                                    X00920**3
               LENGTH=7,                                               X00921**3
               JUSTIFY=(LEFT,BLANK),                                   X00922**3
               PICOUT='ZZZ,ZZ9',                                       X00923**3
               COLOR=GREEN,                                            X00924**3
               HILIGHT=UNDERLINE,                                      X00925**3
               POS=(18,67)                                              00926*17
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00927*17
               LENGTH=1,                                               X00928*17
               INITIAL=' ',                                            X00929*17
               POS=(18,75)                                              00930*17
ALNL09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00931**3
               LENGTH=3,                                               X00932**3
               COLOR=BLUE,                                             X00933**3
               POS=(18,77)                                              00934**3
*                                                                       00935**3
ALNF10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00936**3
               LENGTH=3,                                               X00937**3
               COLOR=BLUE,                                             X00938**4
               POS=(19,01)                                              00939**3
ASKU10  DFHMDF ATTRB=(UNPROT,NORM),                                    X00950**3
               LENGTH=8,                                               X00951**3
               COLOR=GREEN,                                            X00952**3
               HILIGHT=UNDERLINE,                                      X00953**3
               POS=(19,06)                                              00954*14
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00955**9
               LENGTH=1,                                               X00956**9
               INITIAL=' ',                                            X00957**9
               POS=(19,15)                                              00958*15
AUPC10  DFHMDF ATTRB=(UNPROT,NORM),                                    X00959**3
               LENGTH=13,                                              X00960**3
               COLOR=GREEN,                                            X00961**3
               HILIGHT=UNDERLINE,                                      X00962**3
               POS=(19,18)                                              00963*15
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00964*11
               LENGTH=1,                                               X00965*11
               INITIAL=' ',                                            X00966*11
               POS=(19,32)                                              00967*15
AORPR10 DFHMDF ATTRB=(UNPROT,NORM),                                    X00968**3
               LENGTH=8,                                               X00969**3
               JUSTIFY=(LEFT,BLANK),                                   X00970**3
               PICOUT='ZZZZ9.99',                                      X00971**3
               COLOR=GREEN,                                            X00972**3
               HILIGHT=UNDERLINE,                                      X00973**3
               POS=(19,34)                                              00974*14
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00975*12
               LENGTH=1,                                               X00976*12
               INITIAL=' ',                                            X00977*12
               POS=(19,43)                                              00978*14
ANWPR10 DFHMDF ATTRB=(UNPROT,NORM),                                    X00979**3
               LENGTH=8,                                               X00980**3
               JUSTIFY=(LEFT,BLANK),                                   X00981**3
               PICOUT='ZZZZ9.99',                                      X00982**3
               COLOR=GREEN,                                            X00983**3
               HILIGHT=UNDERLINE,                                      X00984**3
               POS=(19,45)                                              00985*14
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00986*13
               LENGTH=1,                                               X00987*13
               INITIAL=' ',                                            X00988*13
               POS=(19,54)                                              00989*14
APRDF10 DFHMDF ATTRB=(UNPROT,NORM),                                    X00990**3
               LENGTH=8,                                               X00991**3
               JUSTIFY=(LEFT,BLANK),                                   X00992**3
               PICOUT='ZZZZ9.99',                                      X00993**3
               COLOR=GREEN,                                            X00994**3
               HILIGHT=UNDERLINE,                                      X00995**3
               POS=(19,56)                                              00996*14
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00997*13
               LENGTH=1,                                               X00998*13
               INITIAL=' ',                                            X00999*13
               POS=(19,65)                                              01000*14
AQTY10  DFHMDF ATTRB=(UNPROT,NORM),                                    X01001**3
               LENGTH=7,                                               X01002**3
               JUSTIFY=(LEFT,BLANK),                                   X01003**3
               PICOUT='ZZZ,ZZ9',                                       X01004**3
               COLOR=GREEN,                                            X01005**3
               HILIGHT=UNDERLINE,                                      X01006**3
               POS=(19,67)                                              01007*14
        DFHMDF ATTRB=(ASKIP,DRK),                                      X01008*16
               LENGTH=1,                                               X01009*16
               INITIAL=' ',                                            X01010*16
               POS=(19,75)                                              01011*16
ALNL10  DFHMDF ATTRB=(ASKIP,NORM),                                     X01012**3
               LENGTH=3,                                               X01013**3
               COLOR=BLUE,                                             X01014**3
               POS=(19,77)                                              01015*14
*                                                                       01016**3
         DFHMSD TYPE=FINAL                                              01017   
         END                                                            01018   
