*          DATA SET PEKM194    AT LEVEL 013 AS OF 10/14/93                      
*          DATA SET PEKM194A1  AT LEVEL 007 AS OF 08/17/93              00001**8
*          DATA SET PEKM194    AT LEVEL 002 AS OF 01/27/93              00002**8
*          DATA SET PEKM194A1  AT LEVEL 004 AS OF 11/25/92              00003**8
  PRINT  NOGEN                                                          00004**8
*-------------------------------------------------------------------*   00005**8
*                                                                   *   00006**8
*        MAPSET  PEKM194                                            *   00007**8
*        MAP     PE194A                                             *   00008**8
*        PROGRAM PEKCS194                                           *   00009**8
*        TRANSID Q194                                               *   00010**8
*        SYSTEM  CICS ARCHITECTURE                                  *   00011**8
*                                                                   *   00012**8
*-------------------------------------------------------------------*   00013**8
PEKM194 DFHMSD TYPE=MAP,                                               X00014**8
               MODE=INOUT,                                             X00015**8
               LANG=COBOL,                                             X00016**8
               TIOAPFX=YES,                                            X00017**8
               CTRL=(FREEKB)                                            00018**8
PE194A  DFHMDI SIZE=(19,80),                                           X00019**8
               LINE=2,COLUMN=1,                                        X00020**8
               MAPATTS=(COLOR,HILIGHT),                                X00021**8
               DSATTS=(COLOR,HILIGHT)                                   00022**8
*                                                                       00023**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00024**8
               INITIAL='STORE...:',                                    X00025**8
               LENGTH=9,                                               X00026**8
               COLOR=NEUTRAL,                                          X00027**8
               POS=(02,2)                                               00028**8
ASTRN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00029**8
               LENGTH=4,                                               X00030**8
               COLOR=BLUE,                                             X00031**8
               POS=(02,12)                                              00032**8
ASTRNM  DFHMDF ATTRB=(ASKIP,BRT),                                      X00033**8
               LENGTH=25,                                              X00034**8
               COLOR=BLUE,                                             X00035**8
               POS=(02,17)                                              00036**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00037**8
               INITIAL='ITEMS:',                                       X00038**8
               LENGTH=6,                                               X00039**8
               COLOR=NEUTRAL,                                          X00040**8
               POS=(02,43)                                              00041**8
ASTRTIT DFHMDF ATTRB=(UNPROT,FSET,NUM,IC),                             X00042**8
               JUSTIFY=(LEFT,BLANK),                                   X00043**8
               PICOUT='ZZZ,ZZ9',                                       X00044**8
               LENGTH=7,                                               X00045**8
               COLOR=GREEN,                                            X00046**8
               HILIGHT=UNDERLINE,                                      X00047**8
               POS=(02,50)                                              00048**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00049**8
               INITIAL='TO',                                           X00050**8
               LENGTH=2,                                               X00051**8
               POS=(02,58)                                              00052**8
AENDIT   DFHMDF ATTRB=(ASKIP,NORM),                                    X00053**8
               JUSTIFY=(LEFT,BLANK),                                   X00054**8
               PICOUT='ZZZ,ZZ9',                                       X00055**8
               LENGTH=7,                                               X00056**8
               COLOR=BLUE,                                             X00057**8
               POS=(02,61)                                              00058**8
AOFIT    DFHMDF ATTRB=(ASKIP,BRT),                                     X00059**8
               INITIAL='OF',                                           X00060**8
               LENGTH=2,                                               X00061**8
               POS=(02,69)                                              00062**8
ATOTIT   DFHMDF ATTRB=(ASKIP,NORM),                                    X00063**8
               JUSTIFY=(LEFT,BLANK),                                   X00064**8
               PICOUT='ZZZ,ZZ9',                                       X00065**8
               LENGTH=7,                                               X00066**8
               COLOR=BLUE,                                             X00067**8
               POS=(02,72)                                              00068**8
*                                                                       00069**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00070**8
               INITIAL='DOCUMENT:',                                    X00071**8
               LENGTH=09,                                              X00072**8
               POS=(03,02)                                              00073**8
ADOCN    DFHMDF ATTRB=(ASKIP,NORM),                                    X00074**8
               LENGTH=7,                                               X00075**8
               COLOR=BLUE,                                             X00076**8
               POS=(03,12)                                              00077**8
*                                                                       00078**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00079**8
               INITIAL='TOTAL QUANTITY:',                              X00080**8
               LENGTH=15,                                              X00081**8
               POS=(04,53)                                              00082*13
AQTY    DFHMDF ATTRB=(ASKIP,NORM),                                     X00083**8
               JUSTIFY=(LEFT,BLANK),                                   X00084**8
               PICOUT='Z,ZZZ,ZZ9',                                     X00085**8
               LENGTH=9,                                               X00086**8
               COLOR=BLUE,                                             X00087**8
               POS=(04,69)                                              00088*13
*                                                                       00089**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00090**8
               INITIAL='ORIGINAL',                                     X00091**8
               LENGTH=08,                                              X00092**8
               POS=(05,45)                                              00093**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00094**8
               INITIAL='NEW',                                          X00095**8
               LENGTH=03,                                              X00096**8
               POS=(05,58)                                              00097**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00098**8
               INITIAL='PRICE',                                        X00099**8
               LENGTH=05,                                              X00100**8
               POS=(05,66)                                              00101**8
*                                                                       00102**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00103**8
               INITIAL='SEL',                                          X00104**8
               LENGTH=03,                                              X00105**8
               POS=(06,02)                                              00106**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00107**8
               INITIAL='ACT',                                          X00108**8
               LENGTH=03,                                              X00109**8
               POS=(06,07)                                              00110**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00111**8
               INITIAL='DEPT',                                         X00112**8
               LENGTH=4,                                               X00113**8
               POS=(06,11)                                              00114**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00115**8
               INITIAL='SCL',                                          X00116**8
               LENGTH=03,                                              X00117**8
               POS=(06,16)                                              00118**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00119**8
               INITIAL='SKU',                                          X00120**8
               LENGTH=03,                                              X00121**8
               POS=(06,23)                                              00122**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00123**8
               INITIAL='UPC',                                          X00124**8
               LENGTH=03,                                              X00125**8
               POS=(06,35)                                              00126**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00127**8
               INITIAL='PRICE',                                        X00128**8
               LENGTH=05,                                              X00129**8
               POS=(06,48)                                              00130**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00131**8
               INITIAL='PRICE',                                        X00132**8
               LENGTH=5,                                               X00133**8
               POS=(06,57)                                              00134**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00135**8
               INITIAL='DIFF.',                                        X00136**8
               LENGTH=05,                                              X00137**8
               POS=(06,66)                                              00138**8
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00139**8
               INITIAL='QUANTITY',                                     X00140**8
               LENGTH=08,                                              X00141**8
               POS=(06,72)                                              00142*12
*                                                                       00143**8
ASEL01  DFHMDF ATTRB=(UNPROT,FSET),                                    X00144**8
               LENGTH=1,                                               X00145**8
               COLOR=GREEN,                                            X00146**8
               HILIGHT=UNDERLINE,                                      X00147**8
               POS=(07,3)                                               00148**8
        DFHMDF ATTRB=(ASKIP),                                          X00149**8
               POS=(07,5),                                             X00150**8
               LENGTH=1                                                 00151**8
AACT01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00152**8
               LENGTH=3,                                               X00153**8
               COLOR=BLUE,                                             X00154**8
               POS=(07,7)                                               00155**8
ADPTN01 DFHMDF ATTRB=(ASKIP,NORM),                                     X00156**8
               LENGTH=3,                                               X00157**8
               COLOR=BLUE,                                             X00158**8
               POS=(07,11)                                              00159**8
ACL01   DFHMDF ATTRB=(ASKIP,NORM),                                     X00160**8
               LENGTH=2,                                               X00161**8
               COLOR=BLUE,                                             X00162**8
               POS=(07,16)                                              00163**8
ASKU01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00164**8
               LENGTH=8,                                               X00165**8
               COLOR=BLUE,                                             X00166**8
               POS=(07,20)                                              00167**8
AUPC01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00168**8
               LENGTH=13,                                              X00169**8
               COLOR=BLUE,                                             X00170**8
               POS=(07,30)                                              00171**8
AORIG01 DFHMDF ATTRB=(ASKIP,NORM),                                     X00172**8
               LENGTH=08,                                              X00173**8
               JUSTIFY=(LEFT,BLANK),                                   X00174**8
               PICOUT='ZZZZZ.99',                                      X00175**8
               COLOR=BLUE,                                             X00176**8
               POS=(07,45)                                              00177**8
ANEW01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00178**8
               LENGTH=08,                                              X00179**8
               JUSTIFY=(LEFT,BLANK),                                   X00180**8
               PICOUT='ZZZZZ.99',                                      X00181**8
               COLOR=BLUE,                                             X00182**8
               POS=(07,54)                                              00183**8
ADIFF01 DFHMDF ATTRB=(ASKIP,NORM),                                     X00184**8
               LENGTH=08,                                              X00185**8
               JUSTIFY=(LEFT,BLANK),                                   X00186**8
               PICOUT='ZZZZZ.99',                                      X00187**8
               COLOR=BLUE,                                             X00188**8
               POS=(07,63)                                              00189**8
AQTY01  DFHMDF ATTRB=(ASKIP,NORM),                                     X00190**8
               LENGTH=7,                                               X00191**8
               JUSTIFY=(LEFT,BLANK),                                   X00192**8
               PICOUT='ZZZ,ZZ9',                                       X00193**8
               COLOR=BLUE,                                             X00194**8
               POS=(07,72)                                              00195*11
*                                                                       00196**8
ASEL02  DFHMDF ATTRB=(UNPROT,FSET),                                    X00197**8
               LENGTH=1,                                               X00198**8
               COLOR=GREEN,                                            X00199**8
               HILIGHT=UNDERLINE,                                      X00200**8
               POS=(08,3)                                               00201**8
        DFHMDF ATTRB=(ASKIP),                                          X00202**8
               POS=(08,5),                                             X00203**8
               LENGTH=1                                                 00204**8
AACT02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00205**8
               LENGTH=3,                                               X00206**8
               COLOR=BLUE,                                             X00207**8
               POS=(08,7)                                               00208**8
ADPTN02 DFHMDF ATTRB=(ASKIP,NORM),                                     X00209**8
               LENGTH=3,                                               X00210**8
               COLOR=BLUE,                                             X00211**8
               POS=(08,11)                                              00212**8
ACL02   DFHMDF ATTRB=(ASKIP,NORM),                                     X00213**8
               LENGTH=2,                                               X00214**8
               COLOR=BLUE,                                             X00215**8
               POS=(08,16)                                              00216**8
ASKU02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00217**8
               LENGTH=8,                                               X00218**8
               COLOR=BLUE,                                             X00219**8
               POS=(08,20)                                              00220**8
AUPC02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00221**8
               LENGTH=13,                                              X00222**8
               COLOR=BLUE,                                             X00223**8
               POS=(08,30)                                              00224**8
AORIG02 DFHMDF ATTRB=(ASKIP,NORM),                                     X00225**8
               LENGTH=08,                                              X00226**8
               JUSTIFY=(LEFT,BLANK),                                   X00227**8
               PICOUT='ZZZZZ.99',                                      X00228**8
               COLOR=BLUE,                                             X00229**8
               POS=(08,45)                                              00230**8
ANEW02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00231**8
               LENGTH=08,                                              X00232**8
               JUSTIFY=(LEFT,BLANK),                                   X00233**8
               PICOUT='ZZZZZ.99',                                      X00234**8
               COLOR=BLUE,                                             X00235**8
               POS=(08,54)                                              00236**8
ADIFF02 DFHMDF ATTRB=(ASKIP,NORM),                                     X00237**8
               LENGTH=08,                                              X00238**8
               JUSTIFY=(LEFT,BLANK),                                   X00239**8
               PICOUT='ZZZZZ.99',                                      X00240**8
               COLOR=BLUE,                                             X00241**8
               POS=(08,63)                                              00242**8
AQTY02  DFHMDF ATTRB=(ASKIP,NORM),                                     X00243**8
               LENGTH=7,                                               X00244**8
               JUSTIFY=(LEFT,BLANK),                                   X00245**8
               PICOUT='ZZZ,ZZ9',                                       X00246**8
               COLOR=BLUE,                                             X00247**8
               POS=(08,72)                                              00248*11
*                                                                       00249**8
ASEL03  DFHMDF ATTRB=(UNPROT,FSET),                                    X00250**8
               LENGTH=1,                                               X00251**8
               COLOR=GREEN,                                            X00252**8
               HILIGHT=UNDERLINE,                                      X00253**8
               POS=(09,3)                                               00254**8
        DFHMDF ATTRB=(ASKIP),                                          X00255**8
               POS=(09,5),                                             X00256**8
               LENGTH=1                                                 00257**8
AACT03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00258**8
               LENGTH=3,                                               X00259**8
               COLOR=BLUE,                                             X00260**8
               POS=(09,7)                                               00261**8
ADPTN03 DFHMDF ATTRB=(ASKIP,NORM),                                     X00262**8
               LENGTH=3,                                               X00263**8
               COLOR=BLUE,                                             X00264**8
               POS=(09,11)                                              00265**8
ACL03   DFHMDF ATTRB=(ASKIP,NORM),                                     X00266**8
               LENGTH=2,                                               X00267**8
               COLOR=BLUE,                                             X00268**8
               POS=(09,16)                                              00269**8
ASKU03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00270**8
               LENGTH=8,                                               X00271**8
               COLOR=BLUE,                                             X00272**8
               POS=(09,20)                                              00273**8
AUPC03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00274**8
               LENGTH=13,                                              X00275**8
               COLOR=BLUE,                                             X00276**8
               POS=(09,30)                                              00277**8
AORIG03 DFHMDF ATTRB=(ASKIP,NORM),                                     X00278**8
               LENGTH=08,                                              X00279**8
               JUSTIFY=(LEFT,BLANK),                                   X00280**8
               PICOUT='ZZZZZ.99',                                      X00281**8
               COLOR=BLUE,                                             X00282**8
               POS=(09,45)                                              00283**8
ANEW03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00284**8
               LENGTH=08,                                              X00285**8
               JUSTIFY=(LEFT,BLANK),                                   X00286**8
               PICOUT='ZZZZZ.99',                                      X00287**8
               COLOR=BLUE,                                             X00288**8
               POS=(09,54)                                              00289**8
ADIFF03 DFHMDF ATTRB=(ASKIP,NORM),                                     X00290**8
               LENGTH=08,                                              X00291**8
               JUSTIFY=(LEFT,BLANK),                                   X00292**8
               PICOUT='ZZZZZ.99',                                      X00293**8
               COLOR=BLUE,                                             X00294**8
               POS=(09,63)                                              00295**8
AQTY03  DFHMDF ATTRB=(ASKIP,NORM),                                     X00296**8
               LENGTH=7,                                               X00297**8
               JUSTIFY=(LEFT,BLANK),                                   X00298**8
               PICOUT='ZZZ,ZZ9',                                       X00299**8
               COLOR=BLUE,                                             X00300**8
               POS=(09,72)                                              00301*11
*                                                                       00302**8
ASEL04  DFHMDF ATTRB=(UNPROT,FSET),                                    X00303**8
               LENGTH=1,                                               X00304**8
               COLOR=GREEN,                                            X00305**8
               HILIGHT=UNDERLINE,                                      X00306**8
               POS=(10,3)                                               00307**8
        DFHMDF ATTRB=(ASKIP),                                          X00308**8
               POS=(10,5),                                             X00309**8
               LENGTH=1                                                 00310**8
AACT04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00311**8
               LENGTH=3,                                               X00312**8
               COLOR=BLUE,                                             X00313**8
               POS=(10,7)                                               00314**8
ADPTN04 DFHMDF ATTRB=(ASKIP,NORM),                                     X00315**8
               LENGTH=3,                                               X00316**8
               COLOR=BLUE,                                             X00317**8
               POS=(10,11)                                              00318**8
ACL04   DFHMDF ATTRB=(ASKIP,NORM),                                     X00319**8
               LENGTH=2,                                               X00320**8
               COLOR=BLUE,                                             X00321**8
               POS=(10,16)                                              00322**8
ASKU04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00323**8
               LENGTH=8,                                               X00324**8
               COLOR=BLUE,                                             X00325**8
               POS=(10,20)                                              00326**8
AUPC04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00327**8
               LENGTH=13,                                              X00328**8
               COLOR=BLUE,                                             X00329**8
               POS=(10,30)                                              00330**8
AORIG04 DFHMDF ATTRB=(ASKIP,NORM),                                     X00331**8
               LENGTH=08,                                              X00332**8
               JUSTIFY=(LEFT,BLANK),                                   X00333**8
               PICOUT='ZZZZZ.99',                                      X00334**8
               COLOR=BLUE,                                             X00335**8
               POS=(10,45)                                              00336**8
ANEW04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00337**8
               LENGTH=08,                                              X00338**8
               JUSTIFY=(LEFT,BLANK),                                   X00339**8
               PICOUT='ZZZZZ.99',                                      X00340**8
               COLOR=BLUE,                                             X00341**8
               POS=(10,54)                                              00342**8
ADIFF04 DFHMDF ATTRB=(ASKIP,NORM),                                     X00343**8
               LENGTH=08,                                              X00344**8
               JUSTIFY=(LEFT,BLANK),                                   X00345**8
               PICOUT='ZZZZZ.99',                                      X00346**8
               COLOR=BLUE,                                             X00347**8
               POS=(10,63)                                              00348**8
AQTY04  DFHMDF ATTRB=(ASKIP,NORM),                                     X00349**8
               LENGTH=7,                                               X00350**8
               JUSTIFY=(LEFT,BLANK),                                   X00351**8
               PICOUT='ZZZ,ZZ9',                                       X00352**8
               COLOR=BLUE,                                             X00353**8
               POS=(10,72)                                              00354*11
*                                                                       00355**8
ASEL05  DFHMDF ATTRB=(UNPROT,FSET),                                    X00356**8
               LENGTH=1,                                               X00357**8
               COLOR=GREEN,                                            X00358**8
               HILIGHT=UNDERLINE,                                      X00359**8
               POS=(11,3)                                               00360**8
        DFHMDF ATTRB=(ASKIP),                                          X00361**8
               POS=(11,5),                                             X00362**8
               LENGTH=1                                                 00363**8
AACT05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00364**8
               LENGTH=3,                                               X00365**8
               COLOR=BLUE,                                             X00366**8
               POS=(11,7)                                               00367**8
ADPTN05 DFHMDF ATTRB=(ASKIP,NORM),                                     X00368**8
               LENGTH=3,                                               X00369**8
               COLOR=BLUE,                                             X00370**8
               POS=(11,11)                                              00371**8
ACL05   DFHMDF ATTRB=(ASKIP,NORM),                                     X00372**8
               LENGTH=2,                                               X00373**8
               COLOR=BLUE,                                             X00374**8
               POS=(11,16)                                              00375**8
ASKU05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00376**8
               LENGTH=8,                                               X00377**8
               COLOR=BLUE,                                             X00378**8
               POS=(11,20)                                              00379**8
AUPC05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00380**8
               LENGTH=13,                                              X00381**8
               COLOR=BLUE,                                             X00382**8
               POS=(11,30)                                              00383**8
AORIG05 DFHMDF ATTRB=(ASKIP,NORM),                                     X00384**8
               LENGTH=08,                                              X00385**8
               JUSTIFY=(LEFT,BLANK),                                   X00386**8
               PICOUT='ZZZZZ.99',                                      X00387**8
               COLOR=BLUE,                                             X00388**8
               POS=(11,45)                                              00389**8
ANEW05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00390**8
               LENGTH=08,                                              X00391**8
               JUSTIFY=(LEFT,BLANK),                                   X00392**8
               PICOUT='ZZZZZ.99',                                      X00393**8
               COLOR=BLUE,                                             X00394**8
               POS=(11,54)                                              00395**8
ADIFF05 DFHMDF ATTRB=(ASKIP,NORM),                                     X00396**8
               LENGTH=08,                                              X00397**8
               JUSTIFY=(LEFT,BLANK),                                   X00398**8
               PICOUT='ZZZZZ.99',                                      X00399**8
               COLOR=BLUE,                                             X00400**8
               POS=(11,63)                                              00401**8
AQTY05  DFHMDF ATTRB=(ASKIP,NORM),                                     X00402**8
               LENGTH=7,                                               X00403**8
               JUSTIFY=(LEFT,BLANK),                                   X00404**8
               PICOUT='ZZZ,ZZ9',                                       X00405**8
               COLOR=BLUE,                                             X00406**8
               POS=(11,72)                                              00407*11
*                                                                       00408**8
ASEL06  DFHMDF ATTRB=(UNPROT,FSET),                                    X00409**8
               LENGTH=1,                                               X00410**8
               COLOR=GREEN,                                            X00411**8
               HILIGHT=UNDERLINE,                                      X00412**8
               POS=(12,3)                                               00413**8
        DFHMDF ATTRB=(ASKIP),                                          X00414**8
               POS=(12,5),                                             X00415**8
               LENGTH=1                                                 00416**8
AACT06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00417**8
               LENGTH=3,                                               X00418**8
               COLOR=BLUE,                                             X00419**8
               POS=(12,7)                                               00420**8
ADPTN06 DFHMDF ATTRB=(ASKIP,NORM),                                     X00421**8
               LENGTH=3,                                               X00422**8
               COLOR=BLUE,                                             X00423**8
               POS=(12,11)                                              00424**8
ACL06   DFHMDF ATTRB=(ASKIP,NORM),                                     X00425**8
               LENGTH=2,                                               X00426**8
               COLOR=BLUE,                                             X00427**8
               POS=(12,16)                                              00428**8
ASKU06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00429**8
               LENGTH=8,                                               X00430**8
               COLOR=BLUE,                                             X00431**8
               POS=(12,20)                                              00432**8
AUPC06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00433**8
               LENGTH=13,                                              X00434**8
               COLOR=BLUE,                                             X00435**8
               POS=(12,30)                                              00436**8
AORIG06 DFHMDF ATTRB=(ASKIP,NORM),                                     X00437**8
               LENGTH=08,                                              X00438**8
               JUSTIFY=(LEFT,BLANK),                                   X00439**8
               PICOUT='ZZZZZ.99',                                      X00440**8
               COLOR=BLUE,                                             X00441**8
               POS=(12,45)                                              00442**8
ANEW06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00443**8
               LENGTH=08,                                              X00444**8
               JUSTIFY=(LEFT,BLANK),                                   X00445**8
               PICOUT='ZZZZZ.99',                                      X00446**8
               COLOR=BLUE,                                             X00447**8
               POS=(12,54)                                              00448**8
ADIFF06 DFHMDF ATTRB=(ASKIP,NORM),                                     X00449**8
               LENGTH=08,                                              X00450**8
               JUSTIFY=(LEFT,BLANK),                                   X00451**8
               PICOUT='ZZZZZ.99',                                      X00452**8
               COLOR=BLUE,                                             X00453**8
               POS=(12,63)                                              00454**8
AQTY06  DFHMDF ATTRB=(ASKIP,NORM),                                     X00455**8
               LENGTH=7,                                               X00456**8
               JUSTIFY=(LEFT,BLANK),                                   X00457**8
               PICOUT='ZZZ,ZZ9',                                       X00458**8
               COLOR=BLUE,                                             X00459**8
               POS=(12,72)                                              00460*11
*                                                                       00461**8
ASEL07  DFHMDF ATTRB=(UNPROT,FSET),                                    X00462**8
               LENGTH=1,                                               X00463**8
               COLOR=GREEN,                                            X00464**8
               HILIGHT=UNDERLINE,                                      X00465**8
               POS=(13,3)                                               00466**8
        DFHMDF ATTRB=(ASKIP),                                          X00467**8
               POS=(13,5),                                             X00468**8
               LENGTH=1                                                 00469**8
AACT07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00470**8
               LENGTH=3,                                               X00471**8
               COLOR=BLUE,                                             X00472**8
               POS=(13,7)                                               00473**8
ADPTN07 DFHMDF ATTRB=(ASKIP,NORM),                                     X00474**8
               LENGTH=3,                                               X00475**8
               COLOR=BLUE,                                             X00476**8
               POS=(13,11)                                              00477**8
ACL07   DFHMDF ATTRB=(ASKIP,NORM),                                     X00478**8
               LENGTH=2,                                               X00479**8
               COLOR=BLUE,                                             X00480**8
               POS=(13,16)                                              00481**8
ASKU07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00482**8
               LENGTH=8,                                               X00483**8
               COLOR=BLUE,                                             X00484**8
               POS=(13,20)                                              00485**8
AUPC07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00486**8
               LENGTH=13,                                              X00487**8
               COLOR=BLUE,                                             X00488**8
               POS=(13,30)                                              00489**8
AORIG07 DFHMDF ATTRB=(ASKIP,NORM),                                     X00490**8
               LENGTH=08,                                              X00491**8
               JUSTIFY=(LEFT,BLANK),                                   X00492**8
               PICOUT='ZZZZZ.99',                                      X00493**8
               COLOR=BLUE,                                             X00494**8
               POS=(13,45)                                              00495**8
ANEW07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00496**8
               LENGTH=08,                                              X00497**8
               JUSTIFY=(LEFT,BLANK),                                   X00498**8
               PICOUT='ZZZZZ.99',                                      X00499**8
               COLOR=BLUE,                                             X00500**8
               POS=(13,54)                                              00501**8
ADIFF07 DFHMDF ATTRB=(ASKIP,NORM),                                     X00502**8
               LENGTH=08,                                              X00503**8
               JUSTIFY=(LEFT,BLANK),                                   X00504**8
               PICOUT='ZZZZZ.99',                                      X00505**8
               COLOR=BLUE,                                             X00506**8
               POS=(13,63)                                              00507**8
AQTY07  DFHMDF ATTRB=(ASKIP,NORM),                                     X00508**8
               LENGTH=7,                                               X00509**8
               JUSTIFY=(LEFT,BLANK),                                   X00510**8
               PICOUT='ZZZ,ZZ9',                                       X00511**8
               COLOR=BLUE,                                             X00512**8
               POS=(13,72)                                              00513*11
*                                                                       00514**8
ASEL08  DFHMDF ATTRB=(UNPROT,FSET),                                    X00515**8
               LENGTH=1,                                               X00516**8
               COLOR=GREEN,                                            X00517**8
               HILIGHT=UNDERLINE,                                      X00518**8
               POS=(14,3)                                               00519**8
        DFHMDF ATTRB=(ASKIP),                                          X00520**8
               POS=(14,5),                                             X00521**8
               LENGTH=1                                                 00522**8
AACT08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00523**8
               LENGTH=3,                                               X00524**8
               COLOR=BLUE,                                             X00525**8
               POS=(14,7)                                               00526**8
ADPTN08 DFHMDF ATTRB=(ASKIP,NORM),                                     X00527**8
               LENGTH=3,                                               X00528**8
               COLOR=BLUE,                                             X00529**8
               POS=(14,11)                                              00530**8
ACL08   DFHMDF ATTRB=(ASKIP,NORM),                                     X00531**8
               LENGTH=2,                                               X00532**8
               COLOR=BLUE,                                             X00533**8
               POS=(14,16)                                              00534**8
ASKU08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00535**8
               LENGTH=8,                                               X00536**8
               COLOR=BLUE,                                             X00537**8
               POS=(14,20)                                              00538**8
AUPC08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00539**8
               LENGTH=13,                                              X00540**8
               COLOR=BLUE,                                             X00541**8
               POS=(14,30)                                              00542**8
AORIG08 DFHMDF ATTRB=(ASKIP,NORM),                                     X00543**8
               LENGTH=08,                                              X00544**8
               JUSTIFY=(LEFT,BLANK),                                   X00545**8
               PICOUT='ZZZZZ.99',                                      X00546**8
               COLOR=BLUE,                                             X00547**8
               POS=(14,45)                                              00548**8
ANEW08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00549**8
               LENGTH=08,                                              X00550**8
               JUSTIFY=(LEFT,BLANK),                                   X00551**8
               PICOUT='ZZZZZ.99',                                      X00552**8
               COLOR=BLUE,                                             X00553**8
               POS=(14,54)                                              00554**8
ADIFF08 DFHMDF ATTRB=(ASKIP,NORM),                                     X00555**8
               LENGTH=08,                                              X00556**8
               JUSTIFY=(LEFT,BLANK),                                   X00557**8
               PICOUT='ZZZZZ.99',                                      X00558**8
               COLOR=BLUE,                                             X00559**8
               POS=(14,63)                                              00560**8
AQTY08  DFHMDF ATTRB=(ASKIP,NORM),                                     X00561**8
               LENGTH=7,                                               X00562**8
               JUSTIFY=(LEFT,BLANK),                                   X00563**8
               PICOUT='ZZZ,ZZ9',                                       X00564**8
               COLOR=BLUE,                                             X00565**8
               POS=(14,72)                                              00566*11
*                                                                       00567**8
ASEL09  DFHMDF ATTRB=(UNPROT,FSET),                                    X00568**8
               LENGTH=1,                                               X00569**8
               COLOR=GREEN,                                            X00570**8
               HILIGHT=UNDERLINE,                                      X00571**8
               POS=(15,3)                                               00572**8
        DFHMDF ATTRB=(ASKIP),                                          X00573**8
               POS=(15,5),                                             X00574**8
               LENGTH=1                                                 00575**8
AACT09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00576**8
               LENGTH=3,                                               X00577**8
               COLOR=BLUE,                                             X00578**8
               POS=(15,7)                                               00579**8
ADPTN09 DFHMDF ATTRB=(ASKIP,NORM),                                     X00580**8
               LENGTH=3,                                               X00581**8
               COLOR=BLUE,                                             X00582**8
               POS=(15,11)                                              00583**8
ACL09   DFHMDF ATTRB=(ASKIP,NORM),                                     X00584**8
               LENGTH=2,                                               X00585**8
               COLOR=BLUE,                                             X00586**8
               POS=(15,16)                                              00587**8
ASKU09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00588**8
               LENGTH=8,                                               X00589**8
               COLOR=BLUE,                                             X00590**8
               POS=(15,20)                                              00591**8
AUPC09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00592**8
               LENGTH=13,                                              X00593**8
               COLOR=BLUE,                                             X00594**8
               POS=(15,30)                                              00595**8
AORIG09 DFHMDF ATTRB=(ASKIP,NORM),                                     X00596**8
               LENGTH=08,                                              X00597**8
               JUSTIFY=(LEFT,BLANK),                                   X00598**8
               PICOUT='ZZZZZ.99',                                      X00599**8
               COLOR=BLUE,                                             X00600**8
               POS=(15,45)                                              00601**8
ANEW09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00602**8
               LENGTH=08,                                              X00603**8
               JUSTIFY=(LEFT,BLANK),                                   X00604**8
               PICOUT='ZZZZZ.99',                                      X00605**8
               COLOR=BLUE,                                             X00606**8
               POS=(15,54)                                              00607**8
ADIFF09 DFHMDF ATTRB=(ASKIP,NORM),                                     X00608**8
               LENGTH=08,                                              X00609**8
               JUSTIFY=(LEFT,BLANK),                                   X00610**8
               PICOUT='ZZZZZ.99',                                      X00611**8
               COLOR=BLUE,                                             X00612**8
               POS=(15,63)                                              00613**8
AQTY09  DFHMDF ATTRB=(ASKIP,NORM),                                     X00614**8
               LENGTH=7,                                               X00615**8
               JUSTIFY=(LEFT,BLANK),                                   X00616**8
               PICOUT='ZZZ,ZZ9',                                       X00617**8
               COLOR=BLUE,                                             X00618**8
               POS=(15,72)                                              00619*11
*                                                                       00620**8
ASEL10  DFHMDF ATTRB=(UNPROT,FSET),                                    X00621**8
               LENGTH=1,                                               X00622**8
               COLOR=GREEN,                                            X00623**8
               HILIGHT=UNDERLINE,                                      X00624**8
               POS=(16,3)                                               00625**8
        DFHMDF ATTRB=(ASKIP),                                          X00626**8
               POS=(16,5),                                             X00627**8
               LENGTH=1                                                 00628**8
AACT10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00629**8
               LENGTH=3,                                               X00630**8
               COLOR=BLUE,                                             X00631**8
               POS=(16,7)                                               00632**8
ADPTN10 DFHMDF ATTRB=(ASKIP,NORM),                                     X00633**8
               LENGTH=3,                                               X00634**8
               COLOR=BLUE,                                             X00635**8
               POS=(16,11)                                              00636**8
ACL10   DFHMDF ATTRB=(ASKIP,NORM),                                     X00637**8
               LENGTH=2,                                               X00638**8
               COLOR=BLUE,                                             X00639**8
               POS=(16,16)                                              00640**8
ASKU10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00641**8
               LENGTH=8,                                               X00642**8
               COLOR=BLUE,                                             X00643**8
               POS=(16,20)                                              00644**8
AUPC10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00645**8
               LENGTH=13,                                              X00646**8
               COLOR=BLUE,                                             X00647**8
               POS=(16,30)                                              00648**8
AORIG10 DFHMDF ATTRB=(ASKIP,NORM),                                     X00649**8
               LENGTH=08,                                              X00650**8
               JUSTIFY=(LEFT,BLANK),                                   X00651**8
               PICOUT='ZZZZZ.99',                                      X00652**8
               COLOR=BLUE,                                             X00653**8
               POS=(16,45)                                              00654**8
ANEW10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00655**8
               LENGTH=08,                                              X00656**8
               JUSTIFY=(LEFT,BLANK),                                   X00657**8
               PICOUT='ZZZZZ.99',                                      X00658**8
               COLOR=BLUE,                                             X00659**8
               POS=(16,54)                                              00660**8
ADIFF10 DFHMDF ATTRB=(ASKIP,NORM),                                     X00661**8
               LENGTH=08,                                              X00662**8
               JUSTIFY=(LEFT,BLANK),                                   X00663**8
               PICOUT='ZZZZZ.99',                                      X00664**8
               COLOR=BLUE,                                             X00665**8
               POS=(16,63)                                              00666**8
AQTY10  DFHMDF ATTRB=(ASKIP,NORM),                                     X00667**8
               LENGTH=7,                                               X00668**8
               JUSTIFY=(LEFT,BLANK),                                   X00669**8
               PICOUT='ZZZ,ZZ9',                                       X00670**8
               COLOR=BLUE,                                             X00671**8
               POS=(16,72)                                              00672*11
*                                                                       00673**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00674**8
               INITIAL='TOTAL PRICE CHANGE AMOUNT:',                   X00675**8
               LENGTH=26,                                              X00676**8
               COLOR=NEUTRAL,                                          X00677**8
               POS=(18,39)                                              00678*11
APRCHG  DFHMDF ATTRB=(ASKIP,NORM),                                     X00679**8
               JUSTIFY=(LEFT,BLANK),                                   X00680**8
               LENGTH=13,                                              X00681**9
               COLOR=BLUE,                                             X00682**8
               POS=(18,66)                                              00683*11
*                                                                       00684**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00685**8
               INITIAL='NUMBER OF SELECTED ITEMS.:',                   X00686**8
               LENGTH=26,                                              X00687**8
               COLOR=NEUTRAL,                                          X00688**8
               POS=(19,39)                                              00689*11
ASELIT  DFHMDF ATTRB=(ASKIP,NORM),                                     X00690**8
               JUSTIFY=(LEFT,BLANK),                                   X00691**8
               PICOUT='ZZZ,ZZ9',                                       X00692**8
               LENGTH=7,                                               X00693**8
               COLOR=BLUE,                                             X00694**8
               POS=(19,71)                                              00695*11
*                                                                       00696**8
         DFHMSD TYPE=FINAL                                              00697**8
         END                                                            00698**8
