*          DATA SET PEKM191    AT LEVEL 009 AS OF 10/12/93                      
  PRINT  NOGEN                                                          00001**8
*-------------------------------------------------------------------*   00002**8
*                                                                   *   00003**8
*        MAPSET  PEKM191                                            *   00004**8
*        MAP     PE191A                                             *   00005**8
*        PROGRAM PEKCS191                                           *   00006**8
*        TRANSID Q191 - PERM PC STORE HEADER ADD                    *   00007**8
*        SYSTEM  PERM PRICE CHANGE                                  *   00008**8
*                                                                   *   00009**8
*-------------------------------------------------------------------*   00010**8
PEKM191 DFHMSD TYPE=MAP,                                               X00011**8
               MODE=INOUT,                                             X00012**8
               LANG=COBOL,                                             X00013**8
               TIOAPFX=YES,                                            X00014**8
               CTRL=(FREEKB)                                            00015**8
PE191A  DFHMDI LINE=2,COLUMN=1,                                        X00016**8
               SIZE=(19,80),                                           X00017**8
               MAPATTS=(COLOR,HILIGHT),                                X00018**8
               DSATTS=(COLOR,HILIGHT)                                   00019**8
*                                                                       00020**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021**8
               INITIAL='STORE.........:',                              X00022**8
               LENGTH=15,                                              X00023**8
               COLOR=NEUTRAL,                                          X00024**8
               POS=(05,05)                                              00025**8
ASTRN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00026**8
               LENGTH=4,                                               X00027**8
               COLOR=BLUE,                                             X00028**8
               POS=(05,21)                                              00029**8
ASTRNM  DFHMDF ATTRB=(ASKIP,BRT),                                      X00030**8
               LENGTH=25,                                              X00031**8
               COLOR=BLUE,                                             X00032**8
               POS=(05,26)                                              00033**8
*                                                                       00034**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00035**8
               INITIAL='DOCUMENT......:',                              X00036**8
               LENGTH=15,                                              X00037**8
               COLOR=NEUTRAL,                                          X00038**8
               POS=(08,05)                                              00039**8
ADOCN   DFHMDF ATTRB=(ASKIP,BRT),                                      X00040**8
               LENGTH=7,                                               X00041**8
               COLOR=BLUE,                                             X00042**8
               POS=(08,21)                                              00043**8
*                                                                       00044**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00045**8
               INITIAL='TYPE/REASON...:',                              X00046**8
               LENGTH=15,                                              X00047**8
               COLOR=NEUTRAL,                                          X00048**8
               POS=(10,05)                                              00049**8
ARSN    DFHMDF ATTRB=(UNPROT,NORM),                                    X00050**8
               LENGTH=3,                                               X00051**8
               COLOR=GREEN,                                            X00052**8
               HILIGHT=UNDERLINE,                                      X00053**8
               POS=(10,21)                                              00054**8
ATYPD   DFHMDF ATTRB=(ASKIP,BRT),                                      X00055**8
               LENGTH=8,                                               X00056**8
               COLOR=BLUE,                                             X00057**8
               POS=(10,25)                                              00058**8
ARSND   DFHMDF ATTRB=(ASKIP,BRT),                                      X00059**8
               LENGTH=12,                                              X00060**8
               COLOR=BLUE,                                             X00061**8
               POS=(10,34)                                              00062**8
*                                                                       00063**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00064**8
               INITIAL='PAGES TO PRINT:',                              X00065**8
               LENGTH=15,                                              X00066**8
               COLOR=NEUTRAL,                                          X00067**8
               POS=(12,05)                                              00068**8
APAGE   DFHMDF ATTRB=(UNPROT,NORM),                                    X00069**8
               LENGTH=3,                                               X00070**8
               COLOR=GREEN,                                            X00071**8
               HILIGHT=UNDERLINE,                                      X00072**8
               POS=(12,21)                                              00073**8
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00074**8
               LENGTH=1,                                               X00075**8
               INITIAL=' ',                                            X00076**8
               POS=(12,25)                                              00077**8
*                                                                       00078**8
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00079**8
               INITIAL='DEPT/AREA.....:',                              X00080**8
               LENGTH=15,                                              X00081**8
               COLOR=NEUTRAL,                                          X00082**8
               POS=(14,05)                                              00083**8
ADPTAR  DFHMDF ATTRB=(UNPROT,NORM),                                    X00084**8
               LENGTH=40,                                              X00085**8
               COLOR=GREEN,                                            X00086**8
               HILIGHT=UNDERLINE,                                      X00087**8
               POS=(14,21)                                              00088**8
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00089**8
               LENGTH=1,                                               X00090**8
               INITIAL=' ',                                            X00091**8
               POS=(14,62)                                              00092**8
*                                                                       00093**9
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00094**9
               INITIAL='PRINTER ID....:',                              X00095**9
               LENGTH=15,                                              X00096**9
               COLOR=NEUTRAL,                                          X00097**9
               POS=(16,05)                                              00098**9
APRTID  DFHMDF ATTRB=(UNPROT,NORM),                                    X00099**9
               LENGTH=8,                                               X00100**9
               COLOR=GREEN,                                            X00101**9
               HILIGHT=UNDERLINE,                                      X00102**9
               POS=(16,21)                                              00103**9
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00104**9
               LENGTH=1,                                               X00105**9
               INITIAL=' ',                                            X00106**9
               POS=(16,30)                                              00107**9
*                                                                       00108**8
*                                                                       00109**8
         DFHMSD TYPE=FINAL                                              00110**8
         END                                                            00111**8
