*          DATA SET PEKM145    AT LEVEL 003 AS OF 07/30/92                      
*          DATA SET PEKM145    AT LEVEL 022 AS OF 09/27/91              00001   
        PRINT  NOGEN                                                    00002   
PEKM145 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
PE145A  DFHMDI LINE=1,                                                 C00009   
               COLUMN=1,                                               C00010   
               CTRL=FREEKB,                                            C00011   
               MAPATTS=(COLOR,HILIGHT),                                C00012   
               DSATTS=(COLOR,HILIGHT),                                 C00013   
               SIZE=(24,80)                                             00014   
*                                                                       00015   
ADATE   DFHMDF POS=(1,2),                                              C00016   
               LENGTH=10,                                              C00017   
               COLOR=NEUTRAL,                                          C00018   
               ATTRB=(ASKIP,BRT)                                        00019   
ATIME   DFHMDF POS=(1,14),                                             C00020   
               LENGTH=8,                                               C00021   
               COLOR=NEUTRAL,                                          C00022   
               ATTRB=(ASKIP,BRT)                                        00023   
ATITLE  DFHMDF POS=(1,25),                                             C00024   
               LENGTH=30,                                              C00025   
               COLOR=NEUTRAL,                                          C00026   
               ATTRB=(ASKIP,BRT)                                        00027   
ANETNAM DFHMDF POS=(1,61),                                             C00028**2
               LENGTH=8,                                               C00029**3
               COLOR=NEUTRAL,                                          C00030   
               ATTRB=(ASKIP,BRT,FSET)                                   00031   
AMNEMIC DFHMDF POS=(1,71),                                             C00032**2
               LENGTH=8,                                               C00033   
               COLOR=NEUTRAL,                                          C00034   
               ATTRB=(ASKIP,BRT)                                        00035   
*                                                                       00036   
        DFHMDF POS=(3,43),                                             C00037   
               LENGTH=6,                                               C00038   
               INITIAL='ITEMS:',                                       C00039   
               COLOR=NEUTRAL,                                          C00040   
               ATTRB=(PROT,BRT)                                         00041   
ABEGITM DFHMDF POS=(3,50),                                             C00042   
               LENGTH=7,                                               C00043   
               PICOUT='ZZZ,ZZ9',                                       C00044   
               COLOR=GREEN,                                            C00045   
               HILIGHT=UNDERLINE,                                      C00046   
               ATTRB=(UNPROT,NORM,FSET)                                 00047   
        DFHMDF POS=(3,58),                                             C00048   
               LENGTH=2,                                               C00049   
               INITIAL='TO',                                           C00050   
               COLOR=NEUTRAL,                                          C00051   
               ATTRB=(ASKIP,BRT)                                        00052   
AENDITM DFHMDF POS=(3,61),                                             C00053   
               LENGTH=7,                                               C00054   
               PICOUT='ZZZ,ZZ9',                                       C00055   
               COLOR=BLUE,                                             C00056   
               ATTRB=(ASKIP,NORM)                                       00057   
AOF     DFHMDF POS=(3,69),                                             C00058   
               LENGTH=2,                                               C00059   
               INITIAL='OF',                                           C00060   
               COLOR=NEUTRAL,                                          C00061   
               ATTRB=(PROT,BRT)                                         00062   
ATOTITM DFHMDF POS=(3,72),                                             C00063   
               LENGTH=7,                                               C00064   
               PICOUT='ZZZ,ZZZ',                                       C00065   
               COLOR=BLUE,                                             C00066   
               ATTRB=(ASKIP,NORM)                                       00067   
*                                                                       00068   
        DFHMDF POS=(4,1),                                              C00069   
               LENGTH=1,                                               C00070   
               INITIAL=' ',                                            C00071   
               ATTRB=(ASKIP,DRK)                                        00072   
*                                                                       00073   
        DFHMDF POS=(5,1),                                              C00074   
               LENGTH=3,                                               C00075   
               INITIAL='SEL',                                          C00076   
               COLOR=NEUTRAL,                                          C00077   
               ATTRB=(PROT,BRT)                                         00078   
        DFHMDF POS=(5,7),                                              C00079   
               LENGTH=7,                                               C00080   
               INITIAL='VALUE',                                        C00081   
               COLOR=NEUTRAL,                                          C00082   
               ATTRB=(PROT,BRT)                                         00083   
        DFHMDF POS=(5,35),                                             C00084   
               LENGTH=11,                                              C00085   
               INITIAL='DESCRIPTION',                                  C00086   
               COLOR=NEUTRAL,                                          C00087   
               ATTRB=(PROT,BRT)                                         00088   
*                                                                       00089   
ASEL01  DFHMDF POS=(6,2),                                              C00090   
               LENGTH=1,                                               C00091   
               COLOR=GREEN,                                            C00092   
               HILIGHT=UNDERLINE,                                      C00093   
               ATTRB=(UNPROT,NORM,IC)                                   00094   
APAR01  DFHMDF POS=(6,4),                                              C00095   
               LENGTH=8,                                               C00096   
               COLOR=BLUE,                                             C00097   
               ATTRB=(ASKIP,NORM)                                       00098   
ADES01  DFHMDF POS=(6,15),                                             C00099   
               LENGTH=60,                                              C00100   
               COLOR=BLUE,                                             C00101   
               ATTRB=(ASKIP,NORM)                                       00102   
        DFHMDF POS=(6,76),                                             C00103   
               LENGTH=1,                                               C00104   
               ATTRB=ASKIP                                              00105   
*                                                                       00106   
ASEL02  DFHMDF POS=(7,2),                                              C00107   
               LENGTH=1,                                               C00108   
               COLOR=GREEN,                                            C00109   
               HILIGHT=UNDERLINE,                                      C00110   
               ATTRB=(UNPROT,NORM,IC)                                   00111   
APAR02  DFHMDF POS=(7,4),                                              C00112   
               LENGTH=8,                                               C00113   
               COLOR=BLUE,                                             C00114   
               ATTRB=(ASKIP,NORM)                                       00115   
ADES02  DFHMDF POS=(7,15),                                             C00116   
               LENGTH=60,                                              C00117   
               COLOR=BLUE,                                             C00118   
               ATTRB=(ASKIP,NORM)                                       00119   
        DFHMDF POS=(7,76),                                             C00120   
               LENGTH=1,                                               C00121   
               ATTRB=ASKIP                                              00122   
*                                                                       00123   
ASEL03  DFHMDF POS=(8,2),                                              C00124   
               LENGTH=1,                                               C00125   
               COLOR=GREEN,                                            C00126   
               HILIGHT=UNDERLINE,                                      C00127   
               ATTRB=(UNPROT,NORM,IC)                                   00128   
APAR03  DFHMDF POS=(8,4),                                              C00129   
               LENGTH=8,                                               C00130   
               COLOR=BLUE,                                             C00131   
               ATTRB=(ASKIP,NORM)                                       00132   
ADES03  DFHMDF POS=(8,15),                                             C00133   
               LENGTH=60,                                              C00134   
               COLOR=BLUE,                                             C00135   
               ATTRB=(ASKIP,NORM)                                       00136   
        DFHMDF POS=(8,76),                                             C00137   
               LENGTH=1,                                               C00138   
               ATTRB=ASKIP                                              00139   
*                                                                       00140   
ASEL04  DFHMDF POS=(9,2),                                              C00141   
               LENGTH=1,                                               C00142   
               COLOR=GREEN,                                            C00143   
               HILIGHT=UNDERLINE,                                      C00144   
               ATTRB=(UNPROT,NORM,IC)                                   00145   
APAR04  DFHMDF POS=(9,4),                                              C00146   
               LENGTH=8,                                               C00147   
               COLOR=BLUE,                                             C00148   
               ATTRB=(ASKIP,NORM)                                       00149   
ADES04  DFHMDF POS=(9,15),                                             C00150   
               LENGTH=60,                                              C00151   
               COLOR=BLUE,                                             C00152   
               ATTRB=(ASKIP,NORM)                                       00153   
        DFHMDF POS=(9,76),                                             C00154   
               LENGTH=1,                                               C00155   
               ATTRB=ASKIP                                              00156   
*                                                                       00157   
ASEL05  DFHMDF POS=(10,2),                                             C00158   
               LENGTH=1,                                               C00159   
               COLOR=GREEN,                                            C00160   
               HILIGHT=UNDERLINE,                                      C00161   
               ATTRB=(UNPROT,NORM,IC)                                   00162   
APAR05  DFHMDF POS=(10,4),                                             C00163   
               LENGTH=8,                                               C00164   
               COLOR=BLUE,                                             C00165   
               ATTRB=(ASKIP,NORM)                                       00166   
ADES05  DFHMDF POS=(10,15),                                            C00167   
               LENGTH=60,                                              C00168   
               COLOR=BLUE,                                             C00169   
               ATTRB=(ASKIP,NORM)                                       00170   
        DFHMDF POS=(10,76),                                            C00171   
               LENGTH=1,                                               C00172   
               ATTRB=ASKIP                                              00173   
*                                                                       00174   
ASEL06  DFHMDF POS=(11,2),                                             C00175   
               LENGTH=1,                                               C00176   
               COLOR=GREEN,                                            C00177   
               HILIGHT=UNDERLINE,                                      C00178   
               ATTRB=(UNPROT,NORM,IC)                                   00179   
APAR06  DFHMDF POS=(11,4),                                             C00180   
               LENGTH=8,                                               C00181   
               COLOR=BLUE,                                             C00182   
               ATTRB=(ASKIP,NORM)                                       00183   
ADES06  DFHMDF POS=(11,15),                                            C00184   
               LENGTH=60,                                              C00185   
               COLOR=BLUE,                                             C00186   
               ATTRB=(ASKIP,NORM)                                       00187   
        DFHMDF POS=(11,76),                                            C00188   
               LENGTH=1,                                               C00189   
               ATTRB=ASKIP                                              00190   
*                                                                       00191   
ASEL07  DFHMDF POS=(12,2),                                             C00192   
               LENGTH=1,                                               C00193   
               COLOR=GREEN,                                            C00194   
               HILIGHT=UNDERLINE,                                      C00195   
               ATTRB=(UNPROT,NORM,IC)                                   00196   
APAR07  DFHMDF POS=(12,4),                                             C00197   
               LENGTH=8,                                               C00198   
               COLOR=BLUE,                                             C00199   
               ATTRB=(ASKIP,NORM)                                       00200   
ADES07  DFHMDF POS=(12,15),                                            C00201   
               LENGTH=60,                                              C00202   
               COLOR=BLUE,                                             C00203   
               ATTRB=(ASKIP,NORM)                                       00204   
        DFHMDF POS=(12,76),                                            C00205   
               LENGTH=1,                                               C00206   
               ATTRB=ASKIP                                              00207   
*                                                                       00208   
ASEL08  DFHMDF POS=(13,2),                                             C00209   
               LENGTH=1,                                               C00210   
               COLOR=GREEN,                                            C00211   
               HILIGHT=UNDERLINE,                                      C00212   
               ATTRB=(UNPROT,NORM,IC)                                   00213   
APAR08  DFHMDF POS=(13,4),                                             C00214   
               LENGTH=8,                                               C00215   
               COLOR=BLUE,                                             C00216   
               ATTRB=(ASKIP,NORM)                                       00217   
ADES08  DFHMDF POS=(13,15),                                            C00218   
               LENGTH=60,                                              C00219   
               COLOR=BLUE,                                             C00220   
               ATTRB=(ASKIP,NORM)                                       00221   
        DFHMDF POS=(13,76),                                            C00222   
               LENGTH=1,                                               C00223   
               ATTRB=ASKIP                                              00224   
*                                                                       00225   
ASEL09  DFHMDF POS=(14,2),                                             C00226   
               LENGTH=1,                                               C00227   
               COLOR=GREEN,                                            C00228   
               HILIGHT=UNDERLINE,                                      C00229   
               ATTRB=(UNPROT,NORM,IC)                                   00230   
APAR09  DFHMDF POS=(14,4),                                             C00231   
               LENGTH=8,                                               C00232   
               COLOR=BLUE,                                             C00233   
               ATTRB=(ASKIP,NORM)                                       00234   
ADES09  DFHMDF POS=(14,15),                                            C00235   
               LENGTH=60,                                              C00236   
               COLOR=BLUE,                                             C00237   
               ATTRB=(ASKIP,NORM)                                       00238   
        DFHMDF POS=(14,76),                                            C00239   
               LENGTH=1,                                               C00240   
               ATTRB=ASKIP                                              00241   
*                                                                       00242   
ASEL10  DFHMDF POS=(15,2),                                             C00243   
               LENGTH=1,                                               C00244   
               COLOR=GREEN,                                            C00245   
               HILIGHT=UNDERLINE,                                      C00246   
               ATTRB=(UNPROT,NORM,IC)                                   00247   
APAR10  DFHMDF POS=(15,4),                                             C00248   
               LENGTH=8,                                               C00249   
               COLOR=BLUE,                                             C00250   
               ATTRB=(ASKIP,NORM)                                       00251   
ADES10  DFHMDF POS=(15,15),                                            C00252   
               LENGTH=60,                                              C00253   
               COLOR=BLUE,                                             C00254   
               ATTRB=(ASKIP,NORM)                                       00255   
        DFHMDF POS=(15,76),                                            C00256   
               LENGTH=1,                                               C00257   
               ATTRB=ASKIP                                              00258   
*                                                                       00259   
ASEL11  DFHMDF POS=(16,2),                                             C00260   
               LENGTH=1,                                               C00261   
               COLOR=GREEN,                                            C00262   
               HILIGHT=UNDERLINE,                                      C00263   
               ATTRB=(UNPROT,NORM,IC)                                   00264   
APAR11  DFHMDF POS=(16,4),                                             C00265   
               LENGTH=8,                                               C00266   
               COLOR=BLUE,                                             C00267   
               ATTRB=(ASKIP,NORM)                                       00268   
ADES11  DFHMDF POS=(16,15),                                            C00269   
               LENGTH=60,                                              C00270   
               COLOR=BLUE,                                             C00271   
               ATTRB=(ASKIP,NORM)                                       00272   
        DFHMDF POS=(16,76),                                            C00273   
               LENGTH=1,                                               C00274   
               ATTRB=ASKIP                                              00275   
*                                                                       00276   
ASEL12  DFHMDF POS=(17,2),                                             C00277   
               LENGTH=1,                                               C00278   
               COLOR=GREEN,                                            C00279   
               HILIGHT=UNDERLINE,                                      C00280   
               ATTRB=(UNPROT,NORM,IC)                                   00281   
APAR12  DFHMDF POS=(17,4),                                             C00282   
               LENGTH=8,                                               C00283   
               COLOR=BLUE,                                             C00284   
               ATTRB=(ASKIP,NORM)                                       00285   
ADES12  DFHMDF POS=(17,15),                                            C00286   
               LENGTH=60,                                              C00287   
               COLOR=BLUE,                                             C00288   
               ATTRB=(ASKIP,NORM)                                       00289   
        DFHMDF POS=(17,76),                                            C00290   
               LENGTH=1,                                               C00291   
               ATTRB=ASKIP                                              00292   
*                                                                       00293   
ASEL13  DFHMDF POS=(18,2),                                             C00294   
               LENGTH=1,                                               C00295   
               COLOR=GREEN,                                            C00296   
               HILIGHT=UNDERLINE,                                      C00297   
               ATTRB=(UNPROT,NORM,IC)                                   00298   
APAR13  DFHMDF POS=(18,4),                                             C00299   
               LENGTH=8,                                               C00300   
               COLOR=BLUE,                                             C00301   
               ATTRB=(ASKIP,NORM)                                       00302   
ADES13  DFHMDF POS=(18,15),                                            C00303   
               LENGTH=60,                                              C00304   
               COLOR=BLUE,                                             C00305   
               ATTRB=(ASKIP,NORM)                                       00306   
        DFHMDF POS=(18,76),                                            C00307   
               LENGTH=1,                                               C00308   
               ATTRB=ASKIP                                              00309   
*                                                                       00310   
ASEL14  DFHMDF POS=(19,2),                                             C00311   
               LENGTH=1,                                               C00312   
               COLOR=GREEN,                                            C00313   
               HILIGHT=UNDERLINE,                                      C00314   
               ATTRB=(UNPROT,NORM,IC)                                   00315   
APAR14  DFHMDF POS=(19,4),                                             C00316   
               LENGTH=8,                                               C00317   
               COLOR=BLUE,                                             C00318   
               ATTRB=(ASKIP,NORM)                                       00319   
ADES14  DFHMDF POS=(19,15),                                            C00320   
               LENGTH=60,                                              C00321   
               COLOR=BLUE,                                             C00322   
               ATTRB=(ASKIP,NORM)                                       00323   
        DFHMDF POS=(19,76),                                            C00324   
               LENGTH=1,                                               C00325   
               ATTRB=ASKIP                                              00326   
*                                                                       00327   
        DFHMDF POS=(20,45),                                            C00328   
               LENGTH=26,                                              C00329   
               INITIAL='NUMBER OF SELECTED ITEMS =',                   C00330   
               COLOR=NEUTRAL,                                          C00331   
               ATTRB=(PROT,BRT)                                         00332   
ATOTSEL DFHMDF POS=(20,72),                                            C00333   
               LENGTH=7,                                               C00334   
               PICOUT='ZZZ,ZZ9',                                       C00335   
               COLOR=BLUE,                                             C00336   
               ATTRB=(ASKIP,NORM)                                       00337   
*                                                                       00338   
AMSG    DFHMDF POS=(21,1),                                             C00339   
               LENGTH=78,                                              C00340   
               COLOR=NEUTRAL,                                          C00341   
               ATTRB=(ASKIP,BRT)                                        00342   
*                                                                       00343   
        DFHMDF POS=(22,1),                                             C00344   
               LENGTH=11,                                              C00345   
               INITIAL='COMMAND===>',                                  C00346   
               COLOR=NEUTRAL,                                          C00347   
               ATTRB=(PROT,BRT)                                         00348   
ANAVCMD DFHMDF POS=(22,13),                                            C00349   
               LENGTH=8,                                               C00350   
               COLOR=GREEN,                                            C00351   
               HILIGHT=UNDERLINE,                                      C00352   
               ATTRB=(UNPROT,NORM)                                      00353   
        DFHMDF POS=(22,22),                                            C00354   
               LENGTH=1,                                               C00355   
               ATTRB=(ASKIP,DRK)                                        00356   
        DFHMDF POS=(22,24),                                            C00357   
               LENGTH=7,                                               C00358   
               INITIAL='KEY===>',                                      C00359   
               COLOR=NEUTRAL,                                          C00360   
               ATTRB=(PROT,BRT)                                         00361   
ANAVKEY DFHMDF POS=(22,32),                                            C00362   
               LENGTH=25,                                              C00363   
               COLOR=GREEN,                                            C00364   
               HILIGHT=UNDERLINE,                                      C00365   
               ATTRB=(UNPROT,NORM)                                      00366   
        DFHMDF POS=(22,58),                                            C00367   
               LENGTH=1,                                               C00368   
               ATTRB=(ASKIP,DRK)                                        00369   
        DFHMDF POS=(22,63),                                            C00370   
               LENGTH=16,                                              C00371   
               INITIAL='PA2=OTHER F KEYS',                             C00372   
               ATTRB=(PROT,BRT)                                         00373   
*                                                                       00374   
AFKLIN1 DFHMDF POS=(23,1),                                             C00375   
               LENGTH=78,                                              C00376   
               COLOR=NEUTRAL,                                          C00377   
               ATTRB=(ASKIP,BRT)                                        00378   
*                                                                       00379   
AFKLIN2 DFHMDF POS=(24,1),                                             C00380   
               LENGTH=78,                                              C00381   
               COLOR=NEUTRAL,                                          C00382   
               ATTRB=(ASKIP,BRT)                                        00383   
        DFHMSD TYPE=FINAL                                               00384   
        END                                                             00385   
