      ******************************************************************        
      * PE700-A000-ORACLE-SETUP                                        *        
      ******************************************************************        
       PE700-A000-ORACLE-SETUP.                                                 
                                                                                
      * AUTO LOGON TO ORACLE FOR PRODUCTION                                     
           EXEC SQL                                                             
              CONNECT :PV-ORACLE-ID                                             
           END-EXEC.                                                            
                                                                                
           IF SQLCODE = 0                                                       
               DISPLAY 'CONNECTED TO ORACLE AS USER: ' PV-ORACLE-ID             
           ELSE                                                                 
               MOVE 'PE700-A000-ORACLE-SETUP' TO PV-PARAGRAPH-NAME              
               SET ABEND-4014-ORACLE-LOGON-ERROR TO TRUE                        
               PERFORM Z100-ABEND                                               
           END-IF.                                                              
                                                                                
      *** AUTO LOGON TO ORACLE FOR PRODUCTION ABOVE                             
      **** BELOW:  TESTING IN TEST AND ACCEPT, COMMENT OUT THE                  
      **** AUTO LOGON TO ORACLE ABOVE AND UNCOMMENT THE                         
      **** PMTEAM/PROMO SECTION BELOW AND UNCOMMENT                             
      **** SQL--CONNECT USERNAME SECTION BELOW:                                 
      *    MOVE 'PETEAM' TO USERNAME-ARR.                                       
      *    MOVE 6  TO USERNAME-LEN.                                             
      *    MOVE 'PERM' TO PASSWD-ARR.                                           
      *    MOVE 4  TO PASSWD-LEN.                                               
      *                                                                         
      *    MOVE 'PETEAM2' TO USERNAME-ARR.                                      
      *    MOVE 7  TO USERNAME-LEN.                                             
      *    MOVE 'PERM' TO PASSWD-ARR.                                           
      *    MOVE 4  TO PASSWD-LEN.                                               
      *                                                                         
      *    EXEC SQL                                                             
      *     CONNECT :USERNAME IDENTIFIED BY :PASSWD                             
      *    END-EXEC.                                                            
      **** ABOVE: FOR TESTING IN TEST AND ACCEPT                                
                                                                                
           IF SQLCODE = 0                                                       
             DISPLAY 'CONNECTED TO ORACLE AS USER: ' USERNAME                   
           END-IF.                                                              
           DISPLAY ' LOGIN SQLCODE: ' SQLCODE.                                  
                                                                                
           EXEC SQL                                                             
            ALTER SESSION                                                       
                  SET NLS_DATE_FORMAT = 'YYYY-MM-DD.HH24.MI.SS'                 
           END-EXEC.                                                            
           DISPLAY ' DATE FORMAT SQLCODE: ' SQLCODE.                            
                                                                                
           DISPLAY 'END OF PE700-A000-ORACLE-SETUP'.                            
                                                                                
