      ***************************************************************   00010000
      *    PERD106 - COPYBOOK FOR XXT_PRICG_GRID DOMAIN TABLE.      *   00020000
      *              THIS IS THE PERM NIGHTLY EXTRACT FOR THIS TBL. *   00030000
      *              TOTAL RECORD LENGTH IS 200.                    *   00040000
      ***************************************************************   00050000
       01  PE106-RECORD.                                                00060000
           05  PE106-PRICG-GRID-ID         PIC  9(10).                  00070000
           05  PE106-PRICG-GRID-DESC       PIC  X(20).                  00080000
           05  PE106-PRCHG-ID              PIC  9(10).                  00090002
           05  PE106-SOR-CRE-TMST          PIC  X(26).                  00100000
           05  PE106-SOR-LAST-UPD-TMST     PIC  X(26).                  00110000
           05  FILLER                      PIC  X(108).                 00120005
