      ***************************************************************   00010001
      *    PERD101 - COPYBOOK FOR XXT_PRCHG_TYP DOMAIN TABLE.       *   00020001
      *              THIS IS THE PERM NIGHTLY EXTRACT FOR THIS TBL. *   00030001
      *              TOTAL RECORD LENGTH IS 200.                    *   00040001
      ***************************************************************   00050001
       01  PE101-RECORD.                                                00060000
           05  PE101-EVNT-CTG-CDE          PIC  X(03).                  00071002
           05  PE101-PRCHG-TYP-CDE         PIC  X(03).                  00080000
           05  PE101-EVNT-CTG-DESC         PIC  X(30).                  00090000
           05  PE101-PRCHG-TYP-DESC        PIC  X(30).                  00100000
           05  PE101-ACTV-IND              PIC  X(01).                  00110000
           05  PE101-SOR-CRE-TMST          PIC  X(26).                  00120000
           05  PE101-SOR-LAST-UPD-TMST     PIC  X(26).                  00130004
           05  FILLER                      PIC  X(81).                  00140004
