      ***************************************************************   00010000
      *    PERD107 - COPYBOOK FOR XXT_PRICG_GRID_DTL DOMAIN TABLE.  *   00020000
      *              THIS IS THE PERM NIGHTLY EXTRACT FOR THIS TBL. *   00030000
      *              TOTAL RECORD LENGTH IS 200.                    *   00040000
      ***************************************************************   00050000
       01  PE107-RECORD.                                                00060000
           05  PE107-PRICG-GRID-ID         PIC  9(10).                  00070000
           05  PE107-PRICG-GRID-DTL-ID     PIC  9(10).                  00080000
           05  PE107-MIN-UNT-RTL-AMT       PIC  S9(07)V99.              00090001
           05  PE107-MAX-UNT-RTL-AMT       PIC  S9(07)V99.              00100001
           05  PE107-NEW-UNT-RTL-AMT       PIC  S9(07)V99.              00110001
           05  PE107-SOR-CRE-TMST          PIC  X(26).                  00120000
           05  PE107-SOR-LAST-UPD-TMST     PIC  X(26).                  00130000
           05  FILLER                      PIC  X(101).                 00140004
