      ***************************************************************   00010000
      *    PERD105 - COPYBOOK FOR XXT_PRCHG_MDSE DOMAIN TABLE.      *   00020001
      *              THIS IS THE PERM NIGHTLY EXTRACT FOR THIS TBL. *   00030000
      *              TOTAL RECORD LENGTH IS 200.                    *   00040000
      ***************************************************************   00050000
       01  PE105-RECORD.                                                00060000
           05  PE105-STR-GP-TYP-CDE        PIC  9(04).                  00070000
           05  PE105-STR-GP-ID             PIC  9(04).                  00080000
           05  PE105-PRCHG-ID              PIC  9(10).                  00090000
           05  PE105-PRCHG-MDSE-ID         PIC  9(10).                  00100001
           05  PE105-MDSE-HIER-CDE         PIC  X(03).                  00110001
           05  PE105-DEPT-NBR              PIC  9(04).                  00120001
           05  PE105-DEPT-NBR-NI           PIC  S9(04) COMP.            00130006
           05  PE105-MAJ-CL-NBR            PIC  9(04).                  00140001
           05  PE105-MAJ-CL-NBR-NI         PIC  S9(04) COMP.            00150006
           05  PE105-SUB-CL-NBR            PIC  9(04).                  00160001
           05  PE105-SUB-CL-NBR-NI         PIC  S9(04) COMP.            00170006
           05  PE105-STYL-ID               PIC  9(08).                  00180001
           05  PE105-STYL-ID-NI            PIC  S9(04) COMP.            00190006
           05  PE105-SKU-NBR               PIC  9(08).                  00200001
           05  PE105-SKU-NBR-NI            PIC  S9(04) COMP.            00210006
           05  PE105-MDSE-PRIC-AMT         PIC  S9(07)V99.              00220001
           05  PE105-MDSE-PRIC-AMT-NI      PIC  S9(04) COMP.            00230009
           05  PE105-GP-PRIC-ID            PIC  9(10).                  00240001
           05  PE105-GP-PRIC-ID-NI         PIC  S9(04) COMP.            00250006
           05  PE105-GP-PRIC-AMT           PIC  S9(07)V99.              00260001
           05  PE105-GP-PRIC-AMT-NI        PIC  S9(04) COMP.            00270006
           05  PE105-GP-QTY                PIC  S9(04).                 00280001
           05  PE105-GP-QTY-NI             PIC  S9(04) COMP.            00290006
           05  PE105-CLR-TYP-CDE           PIC  X(01).                  00300009
           05  PE105-CLR-TYP-CDE-NI        PIC  S9(04) COMP.            00310009
           05  PE105-PRICG-GRID-ID         PIC  9(10).                  00320009
           05  PE105-PRICG-GRID-ID-NI      PIC  S9(04) COMP.            00330009
           05  PE105-SOR-CRE-TMST          PIC  X(26).                  00340000
           05  PE105-SOR-LAST-UPD-TMST     PIC  X(26).                  00350002
           05  PE105-PREV-MDSE-PRIC-AMT    PIC  S9(07)V99.              00360010
           05  PE105-PREV-MDSE-PRIC-AMT-NI PIC  S9(04) COMP.            00370010
           05  FILLER                      PIC  X(13).                  00380010
