00001 *----------------------------------------------------------------*        
00002 *              IN-STORE EXCESSIVE UNITS RECORD LAYOUT            *        
00003 *                                                                *        
00004 *      FILE TYPE:    SEQ          FILE KEY:    NONE              *        
00005 *      REC LENGTH:   061                                         *        
00006 *      CREATE DATE:  08/08/93     CREATED BY:  AJR               *        
00007 *      MODIFY DATE:  01/04/05     MODIFIED BY: TODD C. MICHALEK  *        
00008 *----------------------------------------------------------------*        
00009 *                                                                         
00010  01  PE004-EXCESSIVE-UNITS-RECORD.                                        
00011      05  PE004-STORE-NBR                 PIC 9(04)   VALUE ZEROS.         
00012      05  PE004-EFF-DTE                   PIC X(10)   VALUE SPACES.        
00013      05  PE004-DOC-NBR                   PIC 9(07)   VALUE ZEROS.         
W24472*    05  PE004-DEPT-NBR                  PIC X(03)   VALUE SPACES.        
W24472*    05  PE004-CLASS-NBR                 PIC X(02)   VALUE SPACES.        
W24472*    05  PE004-SEQ-NBR                   PIC X(03)   VALUE SPACES.        
W24472     05  PE004-SKU-NBR                   PIC X(08)   VALUE SPACES.        
00017      05  PE004-QUANTITY                  PIC 9(06)   VALUE ZEROS.         
00018      05  PE004-PR-CHG-AMT                PIC 9(07)V99                     
00019                                                      VALUE ZEROS.         
00020      05  PE004-OLD-PRICE                 PIC 9(07)V99                     
00021                                                      VALUE ZEROS          
00022                                                      COMP-3.              
00023      05  PE004-NEW-PRICE                 PIC 9(07)V99                     
00024                                                      VALUE ZEROS          
00025                                                      COMP-3.              
00026      05  PE004-EXCESSIVE-SW              PIC X(01)   VALUE SPACES.        
00027          88  PE004-EXCESSIVE-UNITS-PRICE             VALUE 'B'.           
00028          88  PE004-EXCESSIVE-UNITS                   VALUE 'U'.           
00029          88  PE004-EXCESSIVE-PRICE-DIFF              VALUE 'P'.           
00030      05  FILLER                          PIC X(05)   VALUE SPACES.        
