00001 *----------------------------------------------------------------*10/17/93
00002 *            IN-STORE DOCUMENT HISTORY DELETE FILE               *PERD071 
00003 *                                                                *   LV003
00004 *      FILE TYPE:    SEQ          FILE KEY:    NONE              *PERD071 
00005 *      REC LENGTH:   20                                          *PERD071 
00006 *      CREATE DATE:  10/16/93     CREATED BY:  A. REILAND        *PERD071 
00007 *      MODIFY DATE:  03/25/05     MODIFIED BY: TODD C. MICHALEK  *PERD071 
00008 *----------------------------------------------------------------*PERD071 
00009 *                                                                 PERD071 
00010  01  PE071-INSTR-DOC-HST-DELETE-REC.                              PERD071 
00011      05  FILLER                          PIC  X(03) VALUE SPACES.    CL**2
00012      05  PE071-INSTR-DEST-LOC-NBR        PIC S9(04) COMP             CL**3
                                                          VALUE ZEROS.          
00013      05  PE071-INSTR-DOC-NBR             PIC S9(07) VALUE +0         CL**2
00014                                                     COMP-3.          CL**2
00015      05  FILLER                          PIC  X(11) VALUE SPACES.    CL**2
