      ***********************************************************       00010000
      **                      PERD113                          **       00020010
      **                     LRECL=43                          **       00030018
      **  THIS COPYBOOK IS THE LAYOUT FOR THE SAS OPTIMIZED    **       00040009
      **  PRICING FILE TAKEN DOWN TO METRO LEVEL AND WITH      **       00050010
      **  SYSTEM ID'S ADDED IN.                                **       00051016
      ***********************************************************       00060000
       01 PE113-ID-REC.                                                 00070013
          05 PE113-PRCHG-ID                PIC 9(10) VALUE 0.           00070110
          05 PE113-STR-GP-ASSN-ID          PIC 9(10) VALUE 0.           00070210
          05 PE113-METRO-NBR               PIC 9(04) VALUE 0.           00070319
          05 PE113-STYL-ID                 PIC 9(08) VALUE 0.           00070417
          05 PE113-PRICE                   PIC 9(09)V99 VALUE 0.        00092010
