      ***************************************************************   00010000
      *    PERD110 - COPYBOOK FOR BALANCE FILE CREATED IN PEKUT110. *   00020000
      *              TOTAL RECORD LENGTH IS 200.                    *   00040000
      ***************************************************************   00050000
       01  PE110-RECORD.                                                00060000
           05  PE110-PRCHG-ID              PIC  9(10).                  00070000
           05  PE110-PRCHG-EFF-DTE         PIC  X(10).                  00080000
           05  PE110-PRCHG-TYP-CDE         PIC  X(03).                  00090000
           05  PE110-PRCHG-SKU-NBR         PIC  9(08).                  00091000
           05  PE110-TOT-ACT-OH-QTY        PIC  S9(10).                 00100000
           05  PE110-TOT-ACT-PR-CHG-AMT    PIC  S9(09)V99.              00110000
           05  FILLER                      PIC  X(48).                  00360000
