      ***************************************************************   00010000
      *    PERD104 - COPYBOOK FOR XXT_ST_GP_PRCHG DOMAIN TABLE.     *   00020000
      *              THIS IS THE PERM NIGHTLY EXTRACT FOR THIS TBL. *   00030000
      *              TOTAL RECORD LENGTH IS 200.                    *   00040000
      ***************************************************************   00050000
       01  PE104-RECORD.                                                00060000
           05  PE104-STR-GP-TYP-CDE        PIC  9(04).                  00070000
           05  PE104-STR-GP-ID             PIC  9(04).                  00080000
           05  PE104-PRCHG-ID              PIC  9(10).                  00090000
           05  PE104-PRCHG-EFF-DTE.                                     00100006
               10  PE104-PRCHG-EFF-CC      PIC  X(02).                  00110006
               10  PE104-PRCHG-EFF-YY      PIC  X(02).                  00120006
               10  PE104-PRCHG-EFF-MM      PIC  X(02).                  00130006
               10  PE104-PRCHG-EFF-DD      PIC  X(02).                  00140006
           05  PE104-OH-AUTO-CNT-IND       PIC  X(01).                  00150005
           05  PE104-SOR-CRE-TMST          PIC  X(26).                  00160000
           05  PE104-SOR-LAST-UPD-TMST     PIC  X(26).                  00170004
           05  FILLER                      PIC  X(121).                 00180006
