00001 ******************************************************************08/17/93
00002 **                        PEWS068                               **PEWS068 
00003 **                                                              **   LV005
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR SYSTEM    **PEWS068 
00005 **  IN-STORE DOCUMENT MAINTENANCE WHICH WILL PASS INFORMATION   **PEWS068 
00006 **  FROM THE HEADER INQUIRY PROGRAM TO THE DETAIL INQUIRY.      **PEWS068 
00007 **  LENGTH:  200 BYTES                                          **PEWS068 
00008 ******************************************************************PEWS068 
00009          10  PE068-INTER-APPL-COMMAREA  REDEFINES                 PEWS068 
00010              INTER-APPL-COMMAREA.                                    CL**5
00011              15  FILLER                         PIC  X(01).       PEWS068 
00012              15  PE068-STORE-NUMBER             PIC S9(04).          CL**3
00013              15  PE068-STORE-NAME               PIC  X(25).          CL**3
00014              15  PE068-DOCUMENT-NUMBER          PIC S9(07)           CL**2
00015                                                     COMP-3.       PEWS068 
00016              15  PE068-HISTORY-SW               PIC  X(01).          CL**4
00017              15  FILLER                         PIC X(165).          CL**4
