000100*---------------------------------------------------------------  00010000
000101*         C O P Y   O F   P E W S 0 4 9    F O R   R C P          00020000
000102*---------------------------------------------------------------  00030000
000110****************************************************************  00040000
000200*                                                              *  00050000
000300* PERMANENT PRICE CHANGE CONSTANTS                             *  00060000
000400*     THIS COPYLIB CONTAINS ALL THE PERMANENT PRICE CHANGE     *  00070000
000500*     CONSTANTS AND THEIR VALUES.                              *  00080000
000600*     IT ALSO CONTAINS THE WORK AREAS FOR VARIOUS PERM VALUES. *  00090000
000700*                                                              *  00100000
000800*     04/15/92 - AJR - WR1851                                  *  00110000
000900*     ADDED MAXIMUM NUMBER OF LINES PER DOCUMENT.              *  00120000
001000*                                                              *  00130000
001100*     08/20/92 - AJR - WR1851                                  *  00140000
001200*     ADDED VENDOR UPC PRINT INDICATOR.                        *  00150000
001300*                                                              *  00160000
001400*     11/01/92 - LAL - WR1851                                  *  00170000
001500*     ADDED MARKUP MARKDOWN BATCH NUMBER.                      *  00180000
001600*                                                              *  00190000
001700*     12/01/92 - LAL - WR1851                                  *  00200000
001800*     ADDED DATE TO CHECK WHAT FISCAL CALENDAR TO USE.         *  00210000
001900*                                                              *  00220000
002000*     01/11/93 - AJR - WR2194                                  *  00230000
002100*     ADDED PERM FUNCTION NAME CONSTANT TO BE USED IN THE      *  00240000
002200*     CICS ARCHITECTURE.                                       *  00250000
002300*                                                              *  00260000
002400*     02/02/93 - AJR - WR2254                                  *  00270000
002500*     INCREASED THE SIZE OF MAX-LINES-PER-DOCUMENT TO 999.     *  00280000
002600*     ADDED A CUTOVER DATE WHICH WILL BE THE DATE THAT THE     *  00290000
002700*     PERM SYSTEM CHANGED OVER TO MORE THAN 20 LINES PER DOC.  *  00300000
002800*                                                              *  00310000
002900*     02/15/93 - LAL -                                         *  00320000
003000*     ADD HISTORY TO THE STATUS DESCRIPTIONS.                  *  00330000
003100*                                                              *  00340000
003200*     07/19/93 - AJR - WR 2401                                 *  00350000
003300*     ADDED IN-STORE STATUS, DESCRIPTIONS, REASON CODES,       *  00360000
003400*     BATCH NUMBER AND PERM RELEASE AVAILABILITY INDICATOR.    *  00370000
003500*                                                              *  00380000
003600*     10/25/93 - AJR - WR 2477                                 *  00390000
003700*     REMOVED THE MAX-LINES-CUTOVER-DATE.  ADDED A DOC-SEQ-    *  00400000
003800*     CUTOVER-DATE TO BE USED TO CHANGE THE BUYER PERM DOCUMENT*  00410000
003900*     SEQUENCE.  THE DOCUMENTS WILL BE CHANGED FROM VENDOR     *  00420000
004000*     STYLE/SKU SEQUENCE TO DEPT/CLASS/VENDOR STYLE/SEQ        *  00430000
004100*     SEQUENCE.                                                *  00440000
004200*                                                              *  00450000
004300*     11/30/93 - AJR - WR 2594                                 *  00460000
004400*     REMOVED THE VENDOR UPC PRINT INDICATOR WORK AREA.        *  00470000
004500*                                                              *  00480000
004600*     02/01/94 - LAL - WR 2644                                 *  00490000
004700*     ADD XMIT SEQUENCE NUMBERS TO DETERMINE WHAT SEQUENCE     *  00500000
004800*     THE DOCUMENT WHERE PRINTED IN                            *  00510000
004900*            0 = DEPT/CLASS/VENDOR STYLE /SEQ SEQUENCE         *  00520000
005000*            1 = DEPT/CLASS/VENDOR STYLE /SEQ SEQUENCE         *  00530000
005100*            2 = DEPT/CLASS/SEQ SEQUENCE                       *  00540000
005200*     CHANGE DOCUMENT CUT OVER DATE                            *  00550000
005300*                                                              *  00560000
005400*     11/16/94 - ADR - WR ????                                 *  00570000
005500*     ADDED INVENTORY MISSED MARKDOWN AS A VALID MARKDOWN      *  00580000
005600*     REASON.                                                  *  00590000
005700*                                                              *  00600000
005800*     01/05/95 - MED - WR ????                                 *  00610000
005900*     ADDED THE PE049-INV-MISSD-RSN-CODE VALUE '75' FOR THE    *  00620000
006000*     THE INVENTORY MISSED MARKDOWN CODE.                      *  00630000
006100*                                                              *  00640000
006200*     03/15/95 - LIH - WR 3347                                 *  00650000
006300*     CHANGED ZERO OUT DESCRIPTION TO CONTINUING CLEARANCE     *  00660000
006400*     MARKDOWN.  THIS CAUSED THE FOLLOWING PROGRAMS TO BE      *  00670000
006500*     RECOMPILED:  PEKCS190, PEKCS191, PEKCS192, PEKCS193,     *  00680000
006600*     PEKCS196, PEKCS008.                                      *  00690000
006700*                                                              *  00700000
006800*     12/01/95 - LIH - WR 3652                                 *  00710000
006900*     CHANGED DOC-SEQ-CUTOVER DATE TO THE NEW SEQUENCE         *  00720000
007000*     EFFECTIVE DATE.  ADDED THE WORKING-XMIT-SEQ SECTION      *  00730000
007100*     TO HELP IN DETERMINING WHAT ORDER DOCUMENTS SHOULD BE    *  00740000
007200*     PRINTED OR DISPLAYED.  ADDED 'SUMMARY COUNT' LITERAL.    *  00750000
007300*                                                              *  00760000
007400*     06/26/96 - TCM - WR 3966                                 *  00770000
007500*     ADD LOCATION TYPE CODES CONSTANTS                        *  00780000
007600*                                                              *  00790000
007700*     10/24/96 - TCM - WR 3904                                 *  00800000
007800*     ADD RETURN TO VENDOR IN-STORE REASON CODE ("65")         *  00810000
007900*                                                              *  00820000
008000*     04/14/97 - MP  - WR 5144                                 *  00830000
008100*     ADD '*' BEFORE LITERAL FOR PE049-IS-DOC-CUST-RET-DESC    *  00840000
008200*                                                              *  00850000
008300*     04/14/97 - MP  - WR 5171                                 *  00860000
008400*     ADDED PE049-PRT-DEST                                     *  00870000
008500*                                                              *  00880000
008600*     05/05/97 - LH  - WR 5136                                 *  00890000
008700*     ADDED PE049-SUB-DOC AND PE049-MSTR-DOC                   *  00900000
008800*     ADDED PE049-STORE-GROUP-CODES.                           *  00910000
008900*                                                              *  00920000
009000*     05/20/97 - TCM - WR 5136                                 *  00930000
009100*     ADDED -CLR-TO-ACTV FIELDS FOR PERM REASON CODE - "51" -  *  00940000
009200*         CLEARANCE TO ACTIVE                                  *  00950000
009300*                                                              *  00960000
009400*     11/06/97 - JA  - WR 5747                                 *  00970000
009500*     ADDED PE049-PRT-LOCAL, PE049-PRT-WINCS,                  *  00980000
009600*     PE049-PRT-CLASS-A, PE049-PRT-CLASS-3 AND                 *  00990000
009700*     PE049-PRT-FORM-STD.                                      *  01000000
009800*                                                              *  01010000
009900*     12/19/97 - KSS - WR 5408                                 *  01020000
010000*     ADDED PE049-MKDN-RPT-RSN-TABLE AND                       *  01030000
010100*     PE049-MKDN-RPT-RSN-VALUE-TABLE.                          *  01040000
010200*                                                              *  01050000
010300*     03/03/98 - JEC - WR 5895                                 *  01060000
010400*     REMOVED PE049-FISCAL-CALENDAR REFERENCES                 *  01070000
010500*                                                              *  01080000
010600*     03/03/98 - JA  - WR AUTOMATED COUNT ENTRY                *  01090000
010700*     ADDED PE049-SYSTEM-CONSTANT                              *  01100000
010710*                                                              *  01110000
010720*     09/29/99 - JFK - WR REGIONAL CLEARANCE PRICING           *  01120000
010730*     ADDED VALUES PE049-CLIMATE-ALL-STORE-GROUP               *  01130000
010740*              AND PE049-METRO-ALL-STORE-GROUP                 *  01140000
010750*               TO PE049-STORE-GROUP-CODES                     *  01150000
010751*                                                              *  01160000
010752*     11/02/99 - TCR COMPUWARE - WR 20195                      *  01170000
010753*     ADDED VALUES PE049-TIMESTAMP-INACTIVE-TIME               *  01180000
010754*              AND PE049-TIMESTAMP-ACTIVE-TIME                 *  01190000
010755*     CORRECTED SPELLING OF 88 LEVEL PE049-MARKDOWN-RSN        *  01200000
010756*     FROM (PE049-MARKDONW-RSN)                                *  01210000
010757*                                                              *  01220000
010758*     12/30/99 - JFK - WR 20195 - RCP                          *  01230000
010759*     ADDED -RCP-CLR-TO-ACTV FIELDS FOR PERM REASON CODE "52"  *  01240000
010761*         RCP CLEARANCE TO ACTIVE                              *  01250000
010762*                                                              *  01260000
010763*     01/18/2000 - JFK - WR 20195 - RCP                        *  01270000
010764*     ADDED PE049-BMKDN-REGN-CLR-RSN AND -DESC FOR             *  01280000
010765*         MARKDOWN / MARKUP REPORTING.                         *  01290000
010766*     CHANGED OCCURRANCES OF PE049-RSN-CODE-DESC-TABLE TO 50.  *  01300000
010767*                                                              *  01310000
010768*     06/06/2000 - TCM - WR 20195 - RCP                        *  01320000
010769*     ADDED PE049-BMKDN-RCP-CNCL-CTA-RSN, -DESC AND            *  01330000
010770*           PE049-OWN-RETURN-ADJ-RSN, -DESC FOR                *  01340000
010771*     MARKDOWN / MARKUP REPORTING.                             *  01350000
010772*     CHANGED OCCURRANCES OF PE049-RSN-CODE-DESC-TABLE TO 52.  *  01360000
010773*                                                              *  01370000
010774*     08/03/2000 - TCM - WR 20195 - RCP                        *  01380000
010775*     ADDED LONG/SHORT MKDN-CAN-MKUP DESCRIPTIONS FOR DISPLAY  *  01390000
010776*           OF MARKDOWN CANCEL/MARKUP TYPE DESCRIPTION ON      *  01400000
010777*           CORPORATE MAPS/REPORTS                             *  01410000
010778*     ADDED LONG CLR-ACT-MKUP/LONG RCP CLR-ACT-MKUP            *  01420000
010779*           DESCRIPTIONS FOR PRINTING OF 'CLR TO ACTV/MKUP'    *  01430000
010780*           ON STORE RETICKET NOTICE DOCUMENTS                 *  01440000
010781*                                                              *  01450000
010782*     11/25/00 - JFK - WR 21676                                   01460000
010783*     ADDED A 'FIRST-HIT-CLEARANCE 88 LEVEL TO THE                01470000
010784*       PE049-WORKING-RSN-CDE FOR THE PURPOSE OF NOT PRINTING     01480000
010785*       FIRST HIT CLEARANCE DOCUMENTS IF A STORE HAS NO ONHANDS   01490000
010786*       (THE 88 LEVEL IS CHECKED IN PEKUP005).                    01500000
010787*                                                              *  01510000
010788*     02/09/01 - JFK - WR                                         01520000
010789*     ADDED THE FOLLOWING CODES AND DESCRIPTIONS FOR THE RF       01530000
010789*       RED TICKET CLEARANCE PROJECT (NEW REASON CODE 112):       01540000
010789*       - PE049-RF-ZERO-OUT-RSN-CODE('12')                        01550000
010789*       - PE049-IS-SHORT-RF-ZERO-OUT DESCRIPTION                  01560000
010789*       - PE049-IS-RF-ZERO-OUT-RSN (+12) AS A VALUE OF            01570000
010789*         PE049-WORKING INSTR-RSN-CDE, ALSO AS A VALID REASON     01580000
010789*       - PE049-MKDN-ZERO-OUT-RSN (122) IN PE049-MARKDOWN-REASONS 01590000
010789*       - PE049-SMKDN-RF-ZERO-OUT-RSN AND DESC IN                 01600000
010789*         PE049-MKDN-RPT-RSN-VALUE-TABLE; INCREASED THE NUMBER    01610000
010790*         OF OCCURS FOR PE049-MKDN-RPT-RSN-TABLE TO 53.           01620000
010762*                                                              *  01630000
010763*     02/28/2002 - JFK - WR 23404 - EVERY DAY LOW PRICING      *  01640000
010764*     ADDED PE049-BMKDN-DENIM-ADJ-RSN AND -DESC FOR            *  01650000
010765*         MARKDOWN / MARKUP REPORTING.                         *  01660000
010766*     CHANGED OCCURRANCES OF PE049-RSN-CODE-DESC-TABLE TO 54.  *  01670000
010762*                                                              *  01680000
010763*     01/31/2003 - TCM - WR 24542 - JANUARY 2003 REPRICING     *  01690000
010764*       - CHANGE PE049-BMKDN-DENIM-ADJ-DESC, FOR REASON '060', *  01700000
010765*         FROM 'DENIM ADJUSTMENT      ' TO                     *  01710000
010765*         'SPRING REPRICING      '                             *  01720000
      *       - CHANGE PE049-SMKDN-CNCL-FIN-ADJ-DESC, FOR REASON     *  01730000
079863*         '295', FROM 'FINANCIAL ADJUSTMENT  ' TO              *  01740000
079863*         'RED TICKET MDC        '.                            *  01750000
079863*     09/23/03 - LJM  WR25349, ADD RSN-CODE-DESC FOR BUY ONE   *  01760000
079863*                GET ONE PROJECT                               *  01770000
009400*     01/19/04 - JA  -  P000625462                             *  01780000
079800*     EXPANDED PE049-MKDN-RPT-RSN-VALUE-TABLE BY ADDING PE049- *  01790000
009500*     BOGO-ERSN AND PE049-BOGO-EDESC (ENTRY '777').            *  01800000
010793*                                                              *  01810000
009400*     03/10/04 - KSH -  P000639863                             *  01820000
079800*     MODIFIED PE049-BOGO-EDESC FROM 'E-STR BUY ONE GET ONE'.  *  01830000
079800*     MODIFIED PE049-BOGO-DESC  FROM 'BUY ONE GET ONE      '.  *  01840000
      *                                                              *  01850000
      *     09/13/2004 - TCM - WR 27209                              *  01860000
      *       FOR THE 4 DIGIT STORE VPS PRINTER PROJECT, ADDED THE   *  01870000
      *       FOLLOWING FIELDS:                                      *  01880000
      *       - PE049-PRT-DEST-STORE, PE049-PRT-DEST-STORE-MAIN      *  01890000
      *                                                              *  01900000
      *     02/11/2005 - TCM - WR 27559                              *  01910000
      *       - ADDED THE NEW REASON CODE ("87") FOR                 *  01920000
      *       "COSMETICS TESTERS ONLY" IN-STORE DOCUMENTS            *  01930000
      *                                                              *  01940000
      *     02/22/2005 - TCM - WR 27559                              *  01950000
      *       - REPLACED THE FOLLOWING PE049-RSN-CODE-DESC TABLE     *  01960000
      *       DESCRIPTIONS:                                          *  01970000
      *       "SEASONAL CLEARANCE    " WITH "CLEARANCE               *  01980000
      *       "MISCELLANEOUS         " WITH "ACTIVE                  *  01990000
      *       "RF ZERO OUT - CONT CLR" WITH "CONTINUED CLR - RF"     *  02000000
W28543* W28543  05-02-2005 ROD JANSSEN MISSED MARKDOWN/MISSED MARKUP    02010000
W28543*                                ENHANCEMENTS                     02020000
W28543*         **  ADJUST THE PERM INSTORE MAINTENANCE SCREENS TO NOT  02030000
W28543*             ADD/UPDATE/CANCEL FUNCTIONALITY FOR INVENTORY       02040000
W28543*             MISSED MARKDOWNS. (RECOMPILE THIS MODULE...)        02050000
W28545* W28545  08-18-2005 ROD JANSSEN ADD REASON CODE 780 UNERND REWRD 02060000
      *                                                              *  02070000
W29145* W29145  09-23-2005 S. JACKSON  ADD CODES FOR SAS MKDN OPTIMIZE  02080000
W29145*                                CODE '025' 2ND-TIER MARKDOWN     02090000
W29145*                                CODE '026' FINAL-TIER MARKDOWN   02100000
W29145*                                CODE '189' IN-STORE MARK-OOS     02110000
      *                                                              *  02120000
      *     10/26/2005 - TCM - WR 28048                              *  02130000
      *       - REMOVED NO LONGER USED FIELDS                        *  02140000
      *       - ADDED THE NEW REASON CODE ("89") FOR                 *  02150000
      *       "MARK OUT-OF-STOCK - SALVAGE" IN-STORE DOCUMENTS       *  02160000
      *       - CORRECTED FIELD NAMES/LITERALS/OCCURS FOR SAS        *  02170000
      *       MARKDOWN OPTIMIZATION ADDITIONS                        *  02180000
      *                                                              *  02190003
      *     02/12/2007 - JMK - WR 31677                              *  02200003
      *       - DISABLED IN STORE MARKDOWN CODES #115 AND #315       *  02210003
      *       - COMMENTED OUT VALUE +15 IN 88 LEVEL                  *  02220003
      *         PE049-IS-VALID-CREATE-RSN                            *  02230003
      *                                                              *  02240004
PJ2029* PJ2029  10-27-2008 RONNA MCDONALD - ADD NEW MARKDOWN MARKUP  *  02250008
PJ2029*                                     REASON CODES 761, 762,   *  02260008
PJ2029*                                     763, 764                 *  02270008
      *                                                              *  02280009
W39372* W39372  08-02-2012 RONNA MCDONALD - ADD NEW MARKDOWN MARKUP  *  02290011
W39372*                                     REASON CODE  765         *  02300011
W39372*                                                              *  02310011
205464*CHG0205464 08-16-2018 JIM ARENDT   - ADD NEW NON-RECEIPT RETRN*  02320016
205464*                                     REASON CODE  710         *  02330016
205464*                                                              *  02340016
      ****************************************************************  02350000
010794*                                                                 02360000
010795*                                                                 02370000
010796*                                                                 02380000
010800 01  PE049-GP-STATUS-CDE.                                         02390000
010900     05  PE049-GP-PENDING-STATUS-CDE     PIC  X(02)  VALUE 'PE'.  02400000
011000     05  PE049-GP-IN-PROCESS-STATUS-CDE  PIC  X(02)  VALUE 'IP'.  02410000
011100     05  PE049-GP-COMPLETED-STATUS-CDE   PIC  X(02)  VALUE 'CP'.  02420000
011200     05  PE049-GP-HISTORY-STATUS-CDE     PIC  X(02)  VALUE 'HS'.  02430000
011300*                                                                 02440000
011400*                                                                 02450000
011500*                                                                 02460000
011600 01  PE049-PENDING-STATUS-CDES.                                   02470000
011700     05  PE049-APPROVED-STATUS-CDE       PIC  X(02)  VALUE 'AP'.  02480000
011800     05  PE049-APPRVL-SUSPEN-STATUS-CDE  PIC  X(02)  VALUE 'AS'.  02490000
011900     05  PE049-CANCELLED-STATUS-CDE      PIC  X(02)  VALUE 'CA'.  02500000
012000     05  PE049-NOT-COMPLETE-STATUS-CDE   PIC  X(02)  VALUE 'NC'.  02510000
012100     05  PE049-PENDNG-APPRVL-STATUS-CDE  PIC  X(02)  VALUE 'PA'.  02520000
012200     05  PE049-PENDING-STATUS-CDE        PIC  X(02)  VALUE 'PE'.  02530000
012300     05  PE049-REJECTED-STATUS-CDE       PIC  X(02)  VALUE 'RJ'.  02540000
012400*                                                                 02550000
012500 01  PE049-IN-PROCESS-STATUS-CDES.                                02560000
012600     05  PE049-IN-PROCESS-STATUS-CDE     PIC  X(02)  VALUE 'IP'.  02570000
012700*                                                                 02580000
012800 01  PE049-STORE-IP-STATUS-CDES.                                  02590000
012900     05  PE049-SI-IN-PROCESS-STATUS-CDE  PIC  X(02)  VALUE 'IP'.  02600000
013000     05  PE049-SI-AVAILABLE-STATUS-CDE   PIC  X(02)  VALUE 'AV'.  02610000
013100     05  PE049-SI-CNTS-ENTER-STATUS-CDE  PIC  X(02)  VALUE 'CE'.  02620000
013200     05  PE049-SI-SUSPENSE-STATUS-CDE    PIC  X(02)  VALUE 'SU'.  02630000
013300     05  PE049-SI-REVW-CNTS-STATUS-CDE   PIC  X(02)  VALUE 'RC'.  02640000
013400     05  PE049-SI-COMPLETED-STATUS-CDE   PIC  X(02)  VALUE 'CP'.  02650000
013500*                                                                 02660000
013600 01  PE049-COMPLETED-STATUS-CDES.                                 02670000
013700     05  PE049-COMPLETED-STATUS-CDE      PIC  X(02)  VALUE 'CP'.  02680000
013800*                                                                 02690000
013900 01  PE049-HISTORY-STATUS-CDES.                                   02700000
014000     05  PE049-HISTORY-STATUS-CDE        PIC  X(02)  VALUE 'HS'.  02710000
014100*                                                                 02720000
014200 01  PE049-IN-STORE-STATUS-CDES.                                  02730000
014300     05  PE049-IS-AVAILABLE-STATUS-CDE   PIC  X(02)  VALUE 'AV'.  02740000
014400     05  PE049-IS-CNTS-ENTER-STATUS-CDE  PIC  X(02)  VALUE 'CE'.  02750000
014500     05  PE049-IS-DELINQUENT-STATUS-CDE  PIC  X(02)  VALUE 'DQ'.  02760000
014600     05  PE049-IS-GENERATED-STATUS-CDE   PIC  X(02)  VALUE 'GE'.  02770000
014700     05  PE049-IS-CANCELLED-STATUS-CDE   PIC  X(02)  VALUE 'CA'.  02780000
014800     05  PE049-IS-COMPLETED-STATUS-CDE   PIC  X(02)  VALUE 'CP'.  02790000
014900     05  PE049-IS-HISTORY-STATUS-CDE     PIC  X(02)  VALUE 'HS'.  02800000
015000*                                                                 02810000
015100*                                                                 02820000
015200*                                                                 02830000
015300 01  PE049-INSTR-DOC-TYP-CDES.                                    02840000
015400     05  PE049-STORE-DOC-TYPE-CDE        PIC  X(01)  VALUE 'S'.   02850000
015500*                                                                 02860000
015600 01  PE049-DOC-TYP-CDES.                                          02870000
015700     05  PE049-CORPORATE-DOC-TYPE-CDE    PIC  X(01)  VALUE 'C'.   02880000
015800     05  PE049-SUB-DOC                   PIC  X(01)  VALUE 'S'.   02890000
015900     05  PE049-MSTR-DOC                  PIC  X(01)  VALUE 'M'.   02900000
016000*                                                                 02910000
016100*                                                                 02920000
016200*                                                                 02930000
016300 01  PE049-TYP-CDES.                                              02940000
016400     05  PE049-MARKDOWN-TYPE-CDE         PIC  X(01)  VALUE '1'.   02950000
016500     05  PE049-MARKDOWN-CAN-TYPE-CDE     PIC  X(01)  VALUE '2'.   02960000
016600     05  PE049-MARKUP-TYPE-CDE           PIC  X(01)  VALUE '3'.   02970000
016700     05  PE049-MARKUP-CAN-TYPE-CDE       PIC  X(01)  VALUE '4'.   02980000
016800*                                                                 02990000
016900*                                                                 03000000
017000*                                                                 03010000
017100 01  PE049-RSN-CDES.                                              03020000
017400     05  PE049-SEASONAL-CLEAR-RSN-CDE    PIC S9(02)  VALUE +21    03030000
017500                                                     COMP-3.      03040000
017600     05  PE049-SLOW-SELL-CLEAR-RSN-CDE   PIC S9(02)  VALUE +22    03050000
017700                                                     COMP-3.      03060000
017800     05  PE049-MISC-CLEAR-RSN-CDE        PIC S9(02)  VALUE +23    03070000
017900                                                     COMP-3.      03080000
018000     05  PE049-REGNL-CLEARANCE-RSN-CDE   PIC S9(02)  VALUE +24    03090000
018100                                                     COMP-3.      03100000
018200     05  PE049-COMPETITIVE-RSN-CDE       PIC S9(02)  VALUE +30    03110000
018300                                                     COMP-3.      03120000
018400     05  PE049-DISCONTINUED-RSN-CDE      PIC S9(02)  VALUE +40    03130000
018500                                                     COMP-3.      03140000
018600     05  PE049-MISCELLANEOUS-RSN-CDE     PIC S9(02)  VALUE +50    03150000
018700                                                     COMP-3.      03160000
018800     05  PE049-CLR-TO-ACTV-RSN-CDE       PIC S9(02)  VALUE +51    03170000
018900                                                     COMP-3.      03180000
018910     05  PE049-RCP-CLR-TO-ACTV-RSN-CDE   PIC S9(02)  VALUE +52    03190000
018920                                                     COMP-3.      03200000
019000*                                                                 03210000
019100*                                                                 03220000
019200*                                                                 03230000
019300 01  PE049-RSN-XCDES.                                             03240000
020210     05  PE049-RCP-CLR-TO-ACTV-RSN-XCDE  PIC  X(02)  VALUE '52'.  03250000
020300*                                                                 03260000
020400*                                                                 03270000
020500*                                                                 03280000
020600 01  PE049-TKT-TYP-CDES.                                          03290000
020700     05  PE049-NON-CLEAR-TKT-TYP-CDE     PIC X(01)   VALUE '1'.   03300000
020800     05  PE049-CLEARANCE-TKT-TYP-CDE     PIC X(01)   VALUE '2'.   03310000
020900*                                                                 03320000
021000*                                                                 03330000
021100*                                                                 03340000
021200 01  PE049-STORE-GROUP-CODES.                                     03350000
021300     05  PE049-ALL-STORE-IND             PIC X(01)   VALUE 'S'.   03360000
021500     05  PE049-CLIMATE-GROUP             PIC X(01)   VALUE 'C'.   03370000
021600     05  PE049-CLIMATE-ALL-STORE-GROUP   PIC X(01)   VALUE 'D'.   03380000
021700     05  PE049-METRO-AREA-GROUP          PIC X(01)   VALUE 'M'.   03390000
021710     05  PE049-METRO-ALL-STORE-GROUP     PIC X(01)   VALUE 'N'.   03400000
021720     05  PE049-AD-VERSION-GROUP          PIC X(01)   VALUE 'A'.   03410000
021721     05  PE049-ADV-ALL-STORE-GROUP       PIC X(01)   VALUE 'B'.   03420000
021730*                                                                 03430000
021740*                                                                 03440000
021750*                                                                 03450000
021760 01  PE049-ALL-STRG-INDS.                                         03460000
021770     05  PE049-ALL-STRG-IND              PIC X(01)   VALUE 'S'.   03470000
021780     05  PE049-NOT-SEL-ALL-STRG-IND      PIC X(01)   VALUE ' '.   03480000
021790*                                                                 03490000
021800*                                                                 03500000
021900*                                                                 03510000
022000 01  PE049-LOCATION-TYPE-CODES.                                   03520000
022100     05  PE049-HQ-LOC-TYP-CDE            PIC X(02)   VALUE 'HQ'.  03530000
022200     05  PE049-CENT-STK-LOC-TYP-CDE      PIC X(02)   VALUE 'CS'.  03540000
022300     05  PE049-DISTRB-CNTR-LOC-TYP-CDE   PIC X(02)   VALUE 'DC'.  03550000
022400     05  PE049-DEPT-STR-LOC-TYP-CDE      PIC X(02)   VALUE 'DS'.  03560000
022500     05  PE049-RET-TO-VND-LOC-TYP-CDE    PIC X(02)   VALUE 'RV'.  03570000
022600*                                                                 03580000
022700*                                                                 03590000
022800*                                                                 03600000
022900 01  PE049-UPD-INDS.                                              03610000
023000     05  PE049-PARM-CAN-BE-UPD-IND       PIC X(01)   VALUE 'Y'.   03620000
023100     05  PE049-PARM-CANNOT-BE-UPD-IND    PIC X(01)   VALUE 'N'.   03630000
023200*                                                                 03640000
023300*                                                                 03650000
023400*                                                                 03660000
023500 01  PE049-GMM-APPRVL-INDS.                                       03670000
023600     05  PE049-GMM-APPRVL-NEEDED         PIC X(01)   VALUE 'Y'.   03680000
023700     05  PE049-GMM-APPRVL-NOT-NEEDED     PIC X(01)   VALUE ' '.   03690000
023800*                                                                 03700000
023900*                                                                 03710000
024000*                                                                 03720000
024100 01  PE049-APPRVL-SUB-INDS.                                       03730000
024200     05  PE049-SUBMITTED-DMM-APPRVL      PIC X(01)   VALUE 'Y'.   03740000
024300     05  PE049-NOT-SUBMITTED-DMM-APPRVL  PIC X(01)   VALUE 'N'.   03750000
024400                                                                  03760000
024500*                                                                 03770000
024600*                                                                 03780000
024700*                                                                 03790000
024800 01  PE049-PRC-INDS.                                              03800000
024900     05  PE049-ALL-STRS-COMPL-DOC        PIC X(01)   VALUE 'Y'.   03810000
025000     05  PE049-NOT-ALL-STRS-COMPL-DOC    PIC X(01)   VALUE ' '.   03820000
025100                                                                  03830000
025200*                                                                 03840000
025300*                                                                 03850000
025400*                                                                 03860000
025500 01  PE049-ZERO-OUT-EXCLUSION-INDS.                               03870000
025600     05  PE049-EXCLUDED-FROM-ZERO-OUT    PIC X(01)   VALUE 'Y'.   03880000
025700     05  PE049-INCLUDED-IN-ZERO-OUT      PIC X(01)   VALUE ' '.   03890000
025800                                                                  03900000
025900*                                                                 03910000
026000*                                                                 03920000
026100                                                                  03930000
026200*                                                                 03940000
026300*                                                                 03950000
026400*                                                                 03960000
026500 01  PE049-PRT-RNBR-SKU-IND.                                      03970000
026600     05  PE049-PRT-RNBR-UPC              PIC X(01)   VALUE 'Y'.   03980000
026700     05  PE049-NO-PRT-RNBR-UPC           PIC X(01)   VALUE ' '.   03990000
026800                                                                  04000000
026900*                                                                 04010000
027000*                                                                 04020000
027100*                                                                 04030000
027200 01  PE049-DEFAULT-DATE                  PIC X(10)   VALUE        04040000
027300     '9999-09-09'.                                                04050000
027400 01  PE049-DEFAULT-TIME                  PIC X(08)   VALUE        04060000
027500     '00.00.00'.                                                  04070000
027600 01  PE049-DEFAULT-TIMESTAMP             PIC X(26)   VALUE        04080000
027700     '9999-09-09-23.59.00.000000'.                                04090000
027800 01  PE049-TIMESTAMP-INACTIVE-TIME.                               04100000
027900     05  PE049-INACTIVE-TIME-DASH        PIC X(01)   VALUE '-'.   04110000
028000     05  PE049-INACTIVE-TIME-VALUE       PIC X(15)   VALUE        04120000
028100     '23.59.59.999999'.                                           04130000
028200 01  PE049-TIMESTAMP-ACTIVE-TIME.                                 04140000
028300     05  PE049-ACTIVE-TIME-DASH          PIC X(01)   VALUE '-'.   04150000
028400     05  PE049-ACTIVE-TIME-VALUE         PIC X(15)   VALUE        04160000
028500     '00.00.00.000000'.                                           04170000
028600*                                                                 04180000
028700 01  PE049-PRT-AREA.                                              04190000
           05  PE049-PRT-DEST-STORE            PIC  X(02)  VALUE 'S0'.  04200000
           05  PE049-PRT-DEST-STORE-MAIN       PIC  X(02)  VALUE '61'.  04210000
028800     05  PE049-PRT-DEST                  PIC  X(02)  VALUE 'U6'.  04220000
028900     05  PE049-PRT-LOCAL                 PIC  X(08)  VALUE        04230000
029000                                                     'LOCAL   '.  04240000
029100     05  PE049-PRT-WINCS                 PIC  X(08)  VALUE        04250000
029200                                                     'U4060   '.  04260000
029300     05  PE049-PRT-CLASS-A               PIC  X(01)  VALUE 'A'.   04270000
029400     05  PE049-PRT-CLASS-3               PIC  X(01)  VALUE '3'.   04280000
029500     05  PE049-PRT-FORM-STD              PIC  X(04)  VALUE        04290000
029600                                                     'STD '.      04300000
029700*    PE049-PRT-WRTR-SSTD - PORTRAIT                               04310000
029800     05  PE049-PRT-WRTR-SSTD             PIC  X(08)  VALUE        04320000
029900                                                     'SSTD    '.  04330000
030000*    PE049-PRT-WRTR-SLET - LANDSCAPE                              04340000
030100     05  PE049-PRT-WRTR-SLET             PIC  X(08)  VALUE        04350000
030200                                                     'SLET    '.  04360000
030300*                                                                 04370000
030400 01  PE049-MAX-LINES-PER-DOCUMENT        PIC 9(03)   VALUE 999.   04380000
030500*                                                                 04390000
030600 01  PE049-DOC-SEQ-CUTOVER-DATE          PIC X(10)   VALUE        04400000
030700     '1995-11-29'.                                                04410000
030800*                                                                 04420000
030900 01  PE049-XMIT-SEQ-NUMBERS.                                      04430000
031000******** SEQUENCE DEPT/CLASS/VENDOR STYLE /SEQ                    04440000
031100     05  PE049-OLD-SEQ                   PIC S9(4)   VALUE +0     04450000
031200                                                     COMP.        04460000
031300******** SEQUENCE DEPT/CLASS/VENDOR STYLE /SEQ                    04470000
031400     05  PE049-SUPPRESSED-SEQ            PIC S9(4)   VALUE +1     04480000
031500                                                     COMP.        04490000
031600******** SEQUENCE DEPT/CLASS/SEQ                                  04500000
031700     05  PE049-TICKETED-SEQ              PIC S9(4)   VALUE +2     04510000
031800                                                     COMP.        04520000
031900******** SEQUENCE DEPT / CLASS / VENDOR / REG PRICE / NEW PRICE / 04530000
032000******** VENDOR STYLE                                             04540000
032100     05  PE049-SUPPRESSED-SEQ-DEC95      PIC S9(4)   VALUE +3     04550000
032200                                                     COMP.        04560000
032300******** SEQUENCE DEPT / CLASS / VENDOR / REG PRICE / NEW PRICE / 04570000
032400******** SKU                                                      04580000
032500     05  PE049-TICKETED-SEQ-DEC95        PIC S9(4)   VALUE +4     04590000
032600                                                     COMP.        04600000
032700*                                                                 04610000
032800 01  PE049-SUMMARY-COUNT                 PIC  X(13)  VALUE        04620000
032900     'SUMMARY COUNT'.                                             04630000
033000*                                                                 04640000
033100 01  PE049-SYSTEM-CONSTANT               PIC  X(06)  VALUE        04650000
033200     'SYSTEM'.                                                    04660000
033300*                                                                 04670000
033400 01  PE049-LONG-MKDN-MKUP-DESC.                                   04680000
033500     05  PE049-LONG-MKDN-DESC            PIC X(13)   VALUE        04690000
033600         'MARKDOWN     '.                                         04700000
033700     05  PE049-LONG-MKDN-DESC1           PIC X(12)   VALUE        04710000
033800         'MARKDOWN    '.                                          04720000
033900*                                                                 04730000
034000     05  PE049-LONG-MKUP-DESC            PIC X(13)   VALUE        04740000
034100         'MARKUP       '.                                         04750000
034200     05  PE049-LONG-MKUP-DESC1           PIC X(12)   VALUE        04760000
034300         'MARKUP      '.                                          04770000
034400*                                                                 04780000
034500     05  PE049-LONG-MKDN-CANCEL-DESC     PIC X(13)   VALUE        04790000
034600         'MARKDOWN CANC'.                                         04800000
034700     05  PE049-LONG-MKDN-CANCEL-DESC1    PIC X(12)   VALUE        04810000
034800         'MKDN CANCEL '.                                          04820000
034900*                                                                 04830000
034910     05  PE049-LONG-MKDN-CAN-MKUP-DESC   PIC X(13)   VALUE        04840000
034920         'MKDN CAN/MKUP'.                                         04850000
034930     05  PE049-LONG-MKDN-CAN-MKUP-DESC1  PIC X(12)   VALUE        04860000
034940         'MKD CAN/MKU '.                                          04870000
034950*                                                                 04880000
035000     05  PE049-LONG-MKUP-CANCEL-DESC     PIC X(13)   VALUE        04890000
035100         'MARKUP CANCEL'.                                         04900000
035200     05  PE049-LONG-MKUP-CANCEL-DESC1    PIC X(12)   VALUE        04910000
035300         'MKUP CANCEL '.                                          04920000
035400                                                                  04930000
035500*                                                                 04940000
035600*                                                                 04950000
035700*                                                                 04960000
035800 01  PE049-SHORT-MKDN-MKUP-DESC.                                  04970000
035900     05  PE049-SHORT-MKDN-DESC           PIC X(08)   VALUE        04980000
036000         'MKDN    '.                                              04990000
036100     05  PE049-SHORT-MKDN-DESC1          PIC X(08)   VALUE        05000000
036200         'MARKDOWN'.                                              05010000
036300     05  PE049-SHORT-MKUP-DESC           PIC X(08)   VALUE        05020000
036400         'MKUP    '.                                              05030000
036500     05  PE049-SHORT-MKUP-DESC1          PIC X(08)   VALUE        05040000
036600         'MARKUP  '.                                              05050000
036700     05  PE049-SHORT-MKDN-CANCEL-DESC    PIC X(08)   VALUE        05060000
036800         'MKDN/CAN'.                                              05070000
037030     05  PE049-SHRT-MKDN-CAN-MKUP-DESC   PIC X(08)   VALUE        05080000
037040         'MD CA/MU'.                                              05090000
037070     05  PE049-SHRT-MKDN-CAN-MKUP-DESC2  PIC X(04)   VALUE        05100000
037080         'MDC '.                                                  05110000
037100     05  PE049-SHORT-MKUP-CANCEL-DESC    PIC X(08)   VALUE        05120000
037200         'MKUP/CAN'.                                              05130000
037500*                                                                 05140000
037600 01  PE049-MRKDWN-MRKUP-BATCH-NBR        PIC X(3)    VALUE '999'. 05150000
037700 01  PE049-INSTR-MKDN-MKUP-BTCH-NBR      PIC X(3)    VALUE '888'. 05160000
037800                                                                  05170000
037900*                                                                 05180000
038000*                                                                 05190000
038100 01  PE049-TICKET-COLORS.                                         05200000
038200     05  PE049-CLEAR-TICKET-COLOR        PIC X(06)   VALUE        05210000
038300         'YELLOW'.                                                05220000
038400     05  PE049-NONCLEAR-TICKET-COLOR     PIC X(06)   VALUE        05230000
038500         'WHITE '.                                                05240000
038600*                                                                 05250000
038700*                                                                 05260000
038800*                                                                 05270000
040700 01  PE049-LONG-RSN-DESC.                                         05280000
040800     05  PE049-LONG-SEASONAL-CLEAR-DESC  PIC X(21)   VALUE        05290000
040900         'SEASONAL CLEARANCE   '.                                 05300000
041000     05  PE049-LONG-SEASONAL-CLEAR-DES1  PIC X(25)   VALUE        05310000
041100         'SEASONAL CLEARANCE       '.                             05320000
041200     05  PE049-LONG-SEASONAL-CLEAR-DES2  PIC X(14)   VALUE        05330000
041300         'SEASONAL CLEAR'.                                        05340000
041400*                                                                 05350000
041500     05  PE049-LONG-SLOW-CLEAR-DESC      PIC X(21)   VALUE        05360000
041600         'SLOW SELLER CLEARANCE'.                                 05370000
041700     05  PE049-LONG-SLOW-CLEAR-DESC1     PIC X(25)   VALUE        05380000
041800         'SLOW SELLER CLEARANCE    '.                             05390000
041900     05  PE049-LONG-SLOW-CLEAR-DESC2     PIC X(14)   VALUE        05400000
042000         'SLOW SELL CLR '.                                        05410000
042100*                                                                 05420000
042200     05  PE049-LONG-MISC-CLEAR-DESC      PIC X(21)   VALUE        05430000
042300         'MISC CLEARANCE       '.                                 05440000
042400     05  PE049-LONG-MISC-CLEAR-DESC1     PIC X(25)   VALUE        05450000
042500         'MISC. CLEARANCE          '.                             05460000
042600     05  PE049-LONG-MISC-CLEAR-DESC2     PIC X(14)   VALUE        05470000
042700         'MISC CLEAR    '.                                        05480000
042800*                                                                 05490000
042810     05  PE049-LONG-REGNL-CLEAR-DESC     PIC X(21)   VALUE        05500000
042820         'REGIONAL CLEARANCE   '.                                 05510000
042821     05  PE049-LONG-REGNL-CLEAR-DESC1    PIC X(25)   VALUE        05520000
042822         'REGIONAL CLEARANCE       '.                             05530000
042830*                                                                 05540000
042840     05  PE049-LONG-COMPETITIVE-DESC     PIC X(21)   VALUE        05550000
042850         'COMPETITIVE          '.                                 05560000
042860     05  PE049-LONG-COMPETITIVE-DESC1    PIC X(25)   VALUE        05570000
042870         'COMPETITIVE              '.                             05580000
042880     05  PE049-LONG-COMPETITIVE-DESC2    PIC X(14)   VALUE        05590000
042890         'COMPETITIVE   '.                                        05600000
042900*                                                                 05610000
043000     05  PE049-LONG-DISCONTINUED-DESC    PIC X(21)   VALUE        05620000
043100         'DISCONTINUED         '.                                 05630000
043200     05  PE049-LONG-DISCONTINUED-DESC1   PIC X(25)   VALUE        05640000
043300         'DISCONTINUED             '.                             05650000
043400     05  PE049-LONG-DISCONTINUED-DESC2   PIC X(14)   VALUE        05660000
043500         'DISCONTINUED  '.                                        05670000
043600*                                                                 05680000
043700     05  PE049-LONG-CLR-TO-ACTV-DESC     PIC X(21)   VALUE        05690000
043800         'CLEARANCE TO ACTIVE  '.                                 05700000
043900     05  PE049-LONG-CLR-TO-ACTV-DESC1    PIC X(25)   VALUE        05710000
044000         'CLEARANCE TO ACTIVE      '.                             05720000
044100     05  PE049-LONG-CLR-TO-ACTV-DESC2    PIC X(14)   VALUE        05730000
044200         'CLR TO ACTV   '.                                        05740000
044210*                                                                 05750000
044220     05  PE049-LONG-RCP-CLR-TO-ACT-DESC  PIC X(21)   VALUE        05760000
044230         'RCP CLEARANCE TO ACTV'.                                 05770000
044240     05  PE049-LONG-RCP-CLR-TO-ACT-DES2  PIC X(14)   VALUE        05780000
044250         'RCP CLR TO ACT'.                                        05790000
044300*                                                                 05800000
044400     05  PE049-LONG-MISC-DESC            PIC X(21)   VALUE        05810000
044500         'MISCELLANEOUS        '.                                 05820000
044600     05  PE049-LONG-MISC-DESC1           PIC X(25)   VALUE        05830000
044700         'MISC.                    '.                             05840000
044800     05  PE049-LONG-MISC-DESC2           PIC X(14)   VALUE        05850000
044900         'MISCELLANEOUS '.                                        05860000
045000*                                                                 05870000
045300     05  PE049-LONG-UNKNOWN-DESC1        PIC X(25)   VALUE        05880000
045400         'UNKNOWN                  '.                             05890000
045000*                                                                 05900000
045600*                                                                 05910000
045700 01  PE049-CLR-TO-ACTV-EXPL-TXT          PIC X(79)   VALUE        05920000
045800     'IF MULTIPLE CURRENT RETAIL PRICES FOR ONE SKU, RECORD EACH P05930000
045900-    'RICE/QTY SEPARATELY'.                                       05940000
046000*                                                                 05950000
046100*                                                                 05960000
046200*                                                                 05970000
046300 01  PE049-INSTR-SHORT-RSN-DESC.                                  05980000
046303     05  PE049-IS-SHORT-ZERO-OUT-DESC    PIC X(12)   VALUE        05990000
046310         'PRCPT/CT CLR'.                                          06000000
046311     05  PE049-IS-SHORT-RF-ZERO-OUT      PIC X(12)   VALUE        06010000
046312         'RF PRCPT CLR'.                                          06020000
046320***  05  PE049-IS-SHORT-ZERO-OUT-DESC    PIC X(12)   VALUE        06030000
046330***      'CONT CL MKDN'.                                          06040000
046600     05  PE049-IS-SHORT-CORRECTION-DESC  PIC X(12)   VALUE        06050000
046700         'CORRECTIONS '.                                          06060000
046800     05  PE049-IS-SHORT-BYR-MISSED-DESC  PIC X(12)   VALUE        06070000
046900         'MISSED MRKDN'.                                          06080000
047000     05  PE049-IS-SHORT-CUST-RET-DESC    PIC X(12)   VALUE        06090000
047100         'CUST RETURN '.                                          06100000
047200     05  PE049-IS-SHORT-THEFT-DESC       PIC X(12)   VALUE        06110000
047300         'KNOWN THEFT '.                                          06120000
047400     05  PE049-IS-SHORT-INSTR-DMG-DESC   PIC X(12)   VALUE        06130000
047500         'DAMAGED     '.                                          06140000
           05  PE049-IS-SHORT-CSMTCS-TST-DESC  PIC X(12)   VALUE        06150000
               'COSMETIC TST'.                                          06160000
           05  PE049-IS-SHORT-MOS-SALVAGE      PIC X(12)   VALUE        06170000
               'SALVAGE     '.                                          06180000
047600     05  PE049-IS-SHORT-FIN-ADJ-DESC     PIC X(12)   VALUE        06190000
047700         'FIN ADJ     '.                                          06200000
047800     05  PE049-IS-SHORT-POSS-INV-MSSD    PIC X(12)   VALUE        06210000
047900         'POS INV MSSD'.                                          06220000
048000     05  PE049-IS-SHORT-RTN-TO-VNDR      PIC X(12)   VALUE        06230000
048100         'RTN-TO-VNDR '.                                          06240000
048200*                                                                 06250000
048300*                                                                 06260000
048400*                                                                 06270000
048500*   THE  FOLLOWING DOC DESC WILL ONLY BE USED ON THE DOCUMENT     06280000
048600*   AS THE REASON CODE DESCRIPTIONS                               06290000
048700*                                                                 06300000
048800 01  PE049-INSTR-DOC-RSN-DESC.                                    06310000
048810     05  PE049-IS-DOC-ZERO-OUT-DESC      PIC X(46)   VALUE        06320000
048820         ' PRICE POINT/CONTINUING CLEARANCE MARKDOWNS '.          06330000
048900***  05  PE049-IS-DOC-ZERO-OUT-DESC      PIC X(46)   VALUE        06340000
049000***      ' CONTINUING CLEARANCE MARKDOWNS             '.          06350000
049100     05  PE049-IS-DOC-MISSED-MKDN-DESC   PIC X(46)   VALUE        06360000
049200         ' MISSED MARKDOWNS                           '.          06370000
049300     05  PE049-IS-DOC-CUST-RET-DESC      PIC X(46)   VALUE        06380000
049400         '*CUSTOMER RETURNED DAMAGED TO $0.00 OR % OFF'.          06390000
049500     05  PE049-IS-DOC-THEFT-DESC         PIC X(46)   VALUE        06400000
049600         '*KNOWN THEFT (OFFICE USE ONLY)              '.          06410000
049700     05  PE049-IS-DOC-INSTR-DMG-DESC     PIC X(46)   VALUE        06420000
049800         '*DAMAGED                                    '.          06430000
049700     05  PE049-IS-DOC-CSMTCS-TST-DESC    PIC X(46)   VALUE        06440000
049800         '*COSMETICS TESTERS ONLY                     '.          06450000
049700     05  PE049-IS-DOC-MOS-SALVAGE-DESC   PIC X(46)   VALUE        06460000
049800         '*MARK OUT-OF-STOCK - SALVAGE                '.          06470000
049900     05  PE049-IS-DOC-CORRECTION-DESC    PIC X(30)   VALUE        06480000
050000         'CORRECTIONS                   '.                        06490000
050100     05  PE049-IS-DOC-MISSED-MKUP-DESC   PIC X(30)   VALUE        06500000
050200         'MISSED MARKUPS AND ISC        '.                        06510000
048000     05  PE049-IS-UNIT-FIN-DESC          PIC X(18)   VALUE        06520000
048100         'UNIT AND FINANCIAL'.                                    06530000
048000     05  PE049-IS-FINANCIAL-DESC         PIC X(18)   VALUE        06540000
048100         'FINANCIAL         '.                                    06550000
050300*                                                                 06560000
050400*                                                                 06570000
050500*                                                                 06580000
050600 01  PE049-STATUS-DESC.                                           06590000
050700     05  PE049-APPROVED-STATUS-DESC      PIC X(12)   VALUE        06600000
050800         'APPROVED    '.                                          06610000
050900     05  PE049-CANCELLED-STATUS-DESC     PIC X(12)   VALUE        06620000
051000         'CANCELLED   '.                                          06630000
051100     05  PE049-APP-SUSPENSE-STATUS-DESC  PIC X(12)   VALUE        06640000
051200         'APP SUSPENSE'.                                          06650000
051300     05  PE049-NOT-COMPLETE-STATUS-DESC  PIC X(12)   VALUE        06660000
051400         'NOT COMPLETE'.                                          06670000
051500     05  PE049-PEND-APPRVL-STATUS-DESC   PIC X(12)   VALUE        06680000
051600         'PND APPROVAL'.                                          06690000
051700     05  PE049-PENDING-STATUS-DESC       PIC X(12)   VALUE        06700000
051800         'PENDING     '.                                          06710000
051900     05  PE049-REJECTED-STATUS-DESC      PIC X(12)   VALUE        06720000
052000         'REJECTED    '.                                          06730000
052100     05  PE049-AVAILABLE-STATUS-DESC     PIC X(12)   VALUE        06740000
052200         'AVAILABLE   '.                                          06750000
052300     05  PE049-SUSPENSE-STATUS-DESC      PIC X(12)   VALUE        06760000
052400         'SUSPENSE    '.                                          06770000
052500     05  PE049-CNTS-ENTERED-STATUS-DESC  PIC X(12)   VALUE        06780000
052600         'CNTS ENTERED'.                                          06790000
052700     05  PE049-REVIEW-CNTS-STATUS-DESC   PIC X(12)   VALUE        06800000
052800         'REVIEW CNTS '.                                          06810000
052900     05  PE049-COMPLETE-STATUS-DESC      PIC X(12)   VALUE        06820000
053000         'COMPLETE    '.                                          06830000
053100     05  PE049-IN-PROCESS-STATUS-DESC    PIC X(12)   VALUE        06840000
053200         'IN PROCESS  '.                                          06850000
053300     05  PE049-HISTORY-STATUS-DESC       PIC X(12)   VALUE        06860000
053400         'HISTORY     '.                                          06870000
053500     05  PE049-GENERATED-STATUS-DESC     PIC X(12)   VALUE        06880000
053600         'GENERATED   '.                                          06890000
053700     05  PE049-DELINQUENT-STATUS-DESC    PIC X(12)   VALUE        06900000
053800         'DELINQUENT  '.                                          06910000
053900*                                                                 06920000
054000***************************************************************   06930000
054100*   WORK AREAS                                                    06940000
054200***************************************************************   06950000
054300*                                                                 06960000
054400*                                                                 06970000
054500 01  PE049-WORKING-TYPE-CDE              PIC X(01)   VALUE SPACES.06980000
054600     88  PE049-MARKDOWN                              VALUE '1'.   06990000
054700     88  PE049-MARKDOWN-CANCEL                       VALUE '2'.   07000000
054800     88  PE049-MARKUP                                VALUE '3'.   07010000
054900     88  PE049-MARKUP-CANCEL                         VALUE '4'.   07020000
055000     88  PE049-VALID-TYPE-CDE                        VALUE '1'    07030000
055100                                                           '2'    07040000
055200                                                           '3'    07050000
055300                                                           '4'.   07060000
055400*                                                                 07070000
055500*                                                                 07080000
055600*                                                                 07090000
055700 01  PE049-WORKING-TKT-TYP-CDE           PIC X(01)   VALUE '0'.   07100000
055800     88  PE049-NON-CLEAR-TKT-TYP                     VALUE '1'.   07110000
055900     88  PE049-CLEARANCE-TKT-TYP                     VALUE '2'.   07120000
056000*                                                                 07130000
056100*                                                                 07140000
056200*                                                                 07150000
056300 01  PE049-WORKING-RSN-CDE               PIC S9(02)  VALUE 0      07160000
056400                                                     COMP-3.      07170000
056500     88  PE049-UNKNOWN                               VALUE +0.    07180000
056600     88  PE049-SEASONAL-CLEARANCE                    VALUE +21.   07190000
056700     88  PE049-SLOW-SELLER-CLEARANCE                 VALUE +22.   07200000
056800     88  PE049-MISC-CLEARANCE                        VALUE +23.   07210000
056810     88  PE049-REGNL-CLEARANCE                       VALUE +24.   07220000
056900     88  PE049-COMPETITIVE                           VALUE +30.   07230000
057000     88  PE049-DISCONTINUED                          VALUE +40.   07240000
057100     88  PE049-MISCELLANEOUS                         VALUE +50.   07250000
057200     88  PE049-CLR-TO-ACTV                           VALUE +51.   07260000
057210     88  PE049-RCP-CLR-TO-ACTV                       VALUE +52.   07270000
057220     88  PE049-FIRST-HIT-CLEARANCE                   VALUE +21    07280000
057230                                                           +22    07290000
057240                                                           +23.   07300000
057300*                                                                 07310000
057400*                                                                 07320000
057500*                                                                 07330000
057600 01  PE049-WORKING-RSN-XCDES             PIC  X(02)  VALUE SPACES.07340000
057700     88  PE049-UNKNOWN-XCDE                          VALUE '  '.  07350000
057800     88  PE049-SEASONAL-CLEAR-XCDE                   VALUE '21'.  07360000
057900     88  PE049-SLOW-SELL-CLEAR-XCDE                  VALUE '22'.  07370000
058000     88  PE049-MISC-CLEAR-XCDE                       VALUE '23'.  07380000
058100     88  PE049-COMPETITIVE-XCDE                      VALUE '30'.  07390000
058200     88  PE049-DISCONTINUED-XCDE                     VALUE '40'.  07400000
058300     88  PE049-MISCELLANEOUS-XCDE                    VALUE '50'.  07410000
058400     88  PE049-CLR-TO-ACTV-XCDE                      VALUE '51'.  07420000
058410     88  PE049-RCP-CLR-TO-ACTV-XCDE                  VALUE '52'.  07430000
058500*                                                                 07440000
058600*                                                                 07450000
058700*                                                                 07460000
060800 01  PE049-WORKING-XMIT-SEQ              PIC S9(4).               07470000
060900******** SEQUENCE DEPT/CLASS/VENDOR STYLE /SEQ                    07480000
061000     88  PE049-OLD-XMIT-SEQ              VALUE +0.                07490000
061100******** SEQUENCE DEPT/CLASS/VENDOR STYLE /SEQ                    07500000
061200     88  PE049-SUPPRESSED-XMIT-SEQ       VALUE +1.                07510000
061300******** SEQUENCE DEPT/CLASS/SEQ                                  07520000
061400     88  PE049-TICKETED-XMIT-SEQ         VALUE +2.                07530000
061500******** SEQUENCE DEPT / CLASS / VENDOR / REG PRICE / NEW PRICE / 07540000
061600******** VENDOR STYLE                                             07550000
061700     88  PE049-SUPP-XMIT-SEQ-DEC95       VALUE +3.                07560000
061800******** SEQUENCE DEPT / CLASS / VENDOR / REG PRICE / NEW PRICE / 07570000
061900******** SKU                                                      07580000
062000     88  PE049-TICKETED-XMIT-SEQ-DEC95   VALUE +4.                07590000
062100     88  PE049-GROUPED-XMIT-SEQ          VALUE +3                 07600000
062200                                               +4.                07610000
062300*                                                                 07620000
062400*                                                                 07630000
062500 01  PE049-WORKING-INSTR-RSN-CDE         PIC S9(02)  VALUE ZEROS. 07640000
062600     88  PE049-IS-VALID-RSN                          VALUE +10    07650000
062700                                                           +12    07660000
062710                                                           +15    07670000
062800                                                           +60    07680000
062900                                                           +65    07690000
063000                                                           +70    07700000
063100                                                           +75    07710000
063200                                                           +80    07720000
063300                                                           +85    07730000
                                                                 +87    07740000
W29145                                                           +89    07750000
063400                                                           +95.   07760000
062600     88  PE049-IS-VALID-CREATE-RSN                   VALUE +70    07770002
062700*****************************************                  +15    07780002
W28543*****************************************                  +75    07790000
062700                                                           +80    07800000
062710                                                           +85    07810000
062710                                                           +87    07820000
062710                                                           +89.   07830000
063500     88  PE049-IS-ZERO-OUT-RSN                       VALUE +10.   07840000
063510     88  PE049-IS-RF-ZERO-OUT-RSN                    VALUE +12.   07850000
063600     88  PE049-IS-CORRECTION-RSN                     VALUE +70.   07860000
063700     88  PE049-IS-BUYER-GEN-MISSED-RSN               VALUE +15.   07870000
063800     88  PE049-IS-CUSTOMER-RET-RSN                   VALUE +60.   07880000
063900     88  PE049-IS-RTN-TO-VNDR-RSN                    VALUE +65.   07890000
           88  PE049-IS-INVENTORY-MISSED-RSN               VALUE +75.   07900000
064100     88  PE049-IS-KNOWN-THEFT-RSN                    VALUE +80.   07910000
064200     88  PE049-IS-INSTR-DAMAGE-RSN                   VALUE +85.   07920000
           88  PE049-IS-COSMETICS-TESTER-RSN               VALUE +87.   07930000
W29145     88  PE049-IS-MOS-SALVAGE-RSN                    VALUE +89.   07940000
064300     88  PE049-IS-FINANCIAL-ADJ-RSN                  VALUE +95.   07950000
064400*                                                                 07960000
064500*                                                                 07970000
064600*                                                                 07980000
064700 01  PE049-WORKING-GMM-APPRVL            PIC X(01)   VALUE SPACES.07990000
064800     88  PE049-GMM-APPRVL                            VALUE 'Y'.   08000000
064900     88  PE049-NO-GMM-APPRVL                         VALUE ' '.   08010000
065000*                                                                 08020000
065100*                                                                 08030000
065200*                                                                 08040000
065300 01  PE049-WORKING-APPRVL-SUB            PIC X(01)   VALUE SPACES.08050000
065400     88  PE049-APPROVAL-SUB                          VALUE 'Y'.   08060000
065500     88  PE049-NO-APPROVAL-SUB                       VALUE 'N'    08070000
065600                                                           ' '.   08080000
065700*                                                                 08090000
065800*                                                                 08100000
065900*                                                                 08110000
066000 01  PE049-WORKING-STATUS-CODE           PIC X(02)   VALUE SPACES.08120000
066100     88  PE049-APPROVED-STATUS                       VALUE 'AP'.  08130000
066200     88  PE049-APPRVL-SUSPEN-STATUS                  VALUE 'AS'.  08140000
066300     88  PE049-CANCELLED-STATUS                      VALUE 'CA'.  08150000
066400     88  PE049-COMPLETED-STATUS                      VALUE 'CP'.  08160000
066500     88  PE049-HISTORY-STATUS                        VALUE 'HS'.  08170000
066600     88  PE049-IN-PROCESS-STATUS                     VALUE 'IP'.  08180000
066700     88  PE049-NOT-COMPLETE-STATUS                   VALUE 'NC'.  08190000
066800     88  PE049-PENDNG-APPRVL-STATUS                  VALUE 'PA'.  08200000
066900     88  PE049-PENDING-STATUS                        VALUE 'PE'.  08210000
067000     88  PE049-REJECTED-STATUS                       VALUE 'RJ'.  08220000
067100*                                                                 08230000
067200*                                                                 08240000
067300*                                                                 08250000
067400 01  PE049-WORKING-STR-STATUS-CODE       PIC  X(02)  VALUE SPACES.08260000
067500     88  PE049-SI-IN-PROCESS-STAT-CDE                VALUE 'IP'.  08270000
067600     88  PE049-SI-AVAILABLE-STAT-CDE                 VALUE 'AV'.  08280000
067700     88  PE049-SI-CNTS-ENTER-STAT-CDE                VALUE 'CE'.  08290000
067800     88  PE049-SI-SUSPENSE-STAT-CDE                  VALUE 'SU'.  08300000
067900     88  PE049-SI-REVW-CNTS-STAT-CDE                 VALUE 'RC'.  08310000
068000     88  PE049-SI-COMPLETED-STAT-CDE                 VALUE 'CP'.  08320000
068100*                                                                 08330000
068200*                                                                 08340000
068300*                                                                 08350000
068400 01  PE049-WORKING-INSTR-STATUS-CDE      PIC  X(02)  VALUE SPACES.08360000
068500     88  PE049-IS-AVAILABLE-STAT-CDE                 VALUE 'AV'.  08370000
068600     88  PE049-IS-CNTS-ENTER-STAT-CDE                VALUE 'CE'.  08380000
068700     88  PE049-IS-CANCELLED-STAT-CDE                 VALUE 'CA'.  08390000
068800     88  PE049-IS-GENERATED-STAT-CDE                 VALUE 'GE'.  08400000
068900     88  PE049-IS-DELINQUENT-STAT-CDE                VALUE 'DQ'.  08410000
069000     88  PE049-IS-COMPLETED-STAT-CDE                 VALUE 'CP'.  08420000
069100     88  PE049-IS-HISTORY-STAT-CDE                   VALUE 'HS'.  08430000
069200*                                                                 08440000
069300*                                                                 08450000
069400*                                                                 08460000
069500*                                                                 08470000
069600 01  PE049-WORKING-GMA-TYPE              PIC X(01)   VALUE SPACES.08480000
069700     88  PE049-GMA-HARDLINES                         VALUE '1'.   08490000
069800     88  PE049-GMA-SOFTLINES                         VALUE '2'.   08500000
069900*                                                                 08510000
070000*                                                                 08520000
070100*                                                                 08530000
070200 01  PE049-WORKING-ZERO-OUT-EXC-IND      PIC X(01)   VALUE SPACES.08540000
070300     88  PE049-ZERO-OUT-EXLUDED                      VALUE 'Y'.   08550000
070400     88  PE049-ZERO-OUT-INCLUDED                     VALUE ' '.   08560000
070410*                                                                 08570000
070420*                                                                 08580000
070430*                                                                 08590000
070440 01  PE049-WORKING-STR-GP-CDE            PIC X(01)   VALUE SPACES.08600000
070450     88  PE049-RCP-STORE-GROUPS                      VALUE 'A'    08610000
070451                                                           'B'    08620000
070452                                                           'C'    08630000
070453                                                           'D'    08640000
070454                                                           'M'    08650000
070455                                                           'N'.   08660000
070470     88  PE049-RCP-CLIMATE-STR-GRPS                  VALUE 'C'    08670000
070471                                                           'D'.   08680000
070472     88  PE049-RCP-METRO-STR-GRPS                    VALUE 'M'    08690000
070473                                                           'N'.   08700000
070474     88  PE049-RCP-AD-VERSION-GRPS                   VALUE 'A'    08710000
070475                                                           'B'.   08720000
070476     88  PE049-RCP-ALL-STORE-GRPS                    VALUE 'B'    08730000
070477                                                           'D'    08740000
070478                                                           'N'.   08750000
070479     88  PE049-RCP-NOT-ALL-STORE-GRPS                VALUE 'A'    08760000
070480                                                           'C'    08770000
070490                                                           'M'.   08780000
070500*                                                                 08790000
070600*                                                                 08800000
070700*                                                                 08810000
070800*                                                                 08820000
070810 01  PE049-WORKING-EDIT-STR-GRP-CDE      PIC X(01)   VALUE SPACES.08830000
070880     88  PE049-RCP-EDIT-CLIMATE-GRPS                 VALUE 'C'    08840000
070890                                                           'D'.   08850000
070891     88  PE049-RCP-EDIT-METRO-STR-GRPS               VALUE 'M'    08860000
070892                                                           'N'.   08870000
070893     88  PE049-RCP-EDIT-AD-VERSION-GRPS              VALUE 'A'    08880000
070894                                                           'B'.   08890000
070901*                                                                 08900000
070902*                                                                 08910000
070903*                                                                 08920000
070904*                                                                 08930000
070910 01  PE049-PERM-FUNCTION-NAME            PIC X(08)   VALUE        08940000
071000                                                    'PEALLSTR'.   08950000
071100 01  PE049-CNCL-FUNCTION                 PIC X(08)   VALUE        08960000
071200                                                    'CANCEL  '.   08970000
071300 01  PE049-CNCL-FUNCTION-IP              PIC X(08)   VALUE        08980000
071400                                                    'PECNCLIP'.   08990000
071500*                                                                 09000000
071600 01  PE049-PERM-RELEASE-AVAIL.                                    09010000
071700     05  PE049-RELEASE-UNINITIALIZED     PIC 9(01)   VALUE 0.     09020000
071800     05  PE049-RELEASE-COUNT-ENTRY       PIC 9(01)   VALUE 1.     09030000
071900     05  PE049-RELEASE-INSTR-PR-CHG      PIC 9(01)   VALUE 2.     09040000
072000*                                                                 09050000
072100*MED -- INVENTORY MISSED MARKDOWN REASON CODE --                  09060000
072200*                                                                 09070000
072300 01  PE049-ZERO-OUT-RSN-CODE             PIC X(02)   VALUE '10'.  09080000
072300 01  PE049-RF-ZERO-OUT-RSN-CODE          PIC X(02)   VALUE '12'.  09090000
072300 01  PE049-CUST-RTN-RSN-CODE             PIC X(02)   VALUE '60'.  09100000
072300 01  PE049-RTN-TO-VNDR-RSN-CODE          PIC X(02)   VALUE '65'.  09110000
072400 01  PE049-INV-MISSD-RSN-CODE            PIC X(02)   VALUE '75'.  09120000
072500 01  PE049-LOSS-PREV-RSN-CODE            PIC X(02)   VALUE '95'.  09130000
072600*                                                                 09140000
072700 01  PE049-INSTR-RSN-TABLE.                                       09150000
072800     05  PE049-TYPE-CODE-TABLE           OCCURS 4 TIMES           09160000
072900                                         INDEXED BY               09170000
073000                                         PE049-TYPE-IDX.          09180000
073100         10  PE049-TYPE-CODE             PIC 9(01).               09190000
073200         10  PE049-REASON-CODE-TABLE     OCCURS 10 TIMES          09200000
073300                                         INDEXED BY               09210000
073400                                         PE049-RSN-IDX.           09220000
073500             15  PE049-REASON-CODE       PIC 9(02).               09230000
073600             15  PE049-CONVERT-CODE      PIC 9(01).               09240000
073700 01  PE049-INSTR-RSN-VALUE-TABLE.                                 09250000
073800     05  PE049-MARKDOWN-TYPE             PIC 9(01)  VALUE 1.      09260000
073900     05  PE049-MARKDOWN-REASONS.                                  09270000
074010         10  PE049-MKDN-RF-ZERO-OUT-RSN  PIC 9(03)  VALUE 122.    09280000
074100         10  PE049-MKDN-BUYER-MISS-RSN   PIC 9(03)  VALUE 152.    09290000
074300         10  PE049-MKDN-RTN-TO-VNDR-RSN  PIC 9(03)  VALUE 654.    09300000
074400         10  PE049-MKDN-INV-MISSD-MKDN   PIC 9(03)  VALUE 752.    09310000
074500         10  PE049-MKDN-KNOWN-THEFT-RSN  PIC 9(03)  VALUE 807.    09320000
074600         10  PE049-MKDN-INSTR-DAMAGE-RSN PIC 9(03)  VALUE 857.    09330000
074600         10  PE049-MKDN-COSMETIC-TST-RSN PIC 9(03)  VALUE 877.    09340000
074200         10  PE049-MKDN-MOS-SALVAGE-RSN  PIC 9(03)  VALUE 897.    09350000
074700         10  PE049-MKDN-FIN-ADJ-RSN      PIC 9(03)  VALUE 955.    09360000
074000         10  PE049-MKDN-FILLER1          PIC 9(03)  VALUE ZEROES. 09370000
075000     05  PE049-MARKDOWN-CANCEL-TYPE      PIC 9(01)  VALUE 2.      09380000
075100     05  PE049-MARKDOWN-CANCEL-REASONS.                           09390000
075200         10  PE049-MKDNCAN-CORRECT-RSN   PIC 9(03)  VALUE 702.    09400000
075300         10  PE049-MKDNCAN-FIN-ADJ-RSN   PIC 9(03)  VALUE 955.    09410000
075400         10  PE049-MKDNCAN-FILLER1       PIC 9(03)  VALUE ZEROES. 09420000
075500         10  PE049-MKDNCAN-FILLER2       PIC 9(03)  VALUE ZEROES. 09430000
075600         10  PE049-MKDNCAN-FILLER3       PIC 9(03)  VALUE ZEROES. 09440000
075700         10  PE049-MKDNCAN-FILLER4       PIC 9(03)  VALUE ZEROES. 09450000
075800         10  PE049-MKDNCAN-FILLER5       PIC 9(03)  VALUE ZEROES. 09460000
075900         10  PE049-MKDNCAN-FILLER6       PIC 9(03)  VALUE ZEROES. 09470000
076000         10  PE049-MKDNCAN-FILLER7       PIC 9(03)  VALUE ZEROES. 09480000
076100         10  PE049-MKDNCAN-FILLER8       PIC 9(03)  VALUE ZEROES. 09490000
076200     05  PE049-MARKUP-TYPE               PIC 9(01)  VALUE 3.      09500000
076300     05  PE049-MARKUP-REASONS.                                    09510000
076400         10  PE049-MKUP-BUYER-MISS-RSN   PIC 9(03)  VALUE 152.    09520000
076500         10  PE049-MKUP-FIN-ADJ-RSN      PIC 9(03)  VALUE 955.    09530000
076600         10  PE049-MKUP-FILLER1          PIC 9(03)  VALUE ZEROES. 09540000
076700         10  PE049-MKUP-FILLER2          PIC 9(03)  VALUE ZEROES. 09550000
076800         10  PE049-MKUP-FILLER3          PIC 9(03)  VALUE ZEROES. 09560000
076900         10  PE049-MKUP-FILLER4          PIC 9(03)  VALUE ZEROES. 09570000
077000         10  PE049-MKUP-FILLER5          PIC 9(03)  VALUE ZEROES. 09580000
077100         10  PE049-MKUP-FILLER6          PIC 9(03)  VALUE ZEROES. 09590000
077200         10  PE049-MKUP-FILLER7          PIC 9(03)  VALUE ZEROES. 09600000
077300         10  PE049-MKUP-FILLER8          PIC 9(03)  VALUE ZEROES. 09610000
077400     05  PE049-MARKUP-CANCEL-TYPE        PIC 9(01)  VALUE 4.      09620000
077500     05  PE049-MARKUP-CANCEL-REASONS.                             09630000
077600         10  PE049-MKUPCAN-FIN-ADJ-RSN   PIC 9(03)  VALUE 955.    09640000
077700         10  PE049-MKUPCAN-FILLER1       PIC 9(03)  VALUE ZEROES. 09650000
077800         10  PE049-MKUPCAN-FILLER2       PIC 9(03)  VALUE ZEROES. 09660000
077900         10  PE049-MKUPCAN-FILLER3       PIC 9(03)  VALUE ZEROES. 09670000
078000         10  PE049-MKUPCAN-FILLER4       PIC 9(03)  VALUE ZEROES. 09680000
078100         10  PE049-MKUPCAN-FILLER5       PIC 9(03)  VALUE ZEROES. 09690000
078200         10  PE049-MKUPCAN-FILLER6       PIC 9(03)  VALUE ZEROES. 09700000
078300         10  PE049-MKUPCAN-FILLER7       PIC 9(03)  VALUE ZEROES. 09710000
078400         10  PE049-MKUPCAN-FILLER8       PIC 9(03)  VALUE ZEROES. 09720000
078500         10  PE049-MKUPCAN-FILLER9       PIC 9(03)  VALUE ZEROES. 09730000
078600                                                                  09740000
078700 01  PE049-MESSAGES.                                              09750000
078800     05  PE049-MULT-EFF-DATE-MSG         PIC X(24)  VALUE         09760000
078900        'MULTIPLE EFFECTIVE DATES'.                               09770000
079000                                                                  09780000
079100 01  PE049-MKDN-RPT-RSN-TABLE.                                    09790000
205464     05  PE049-RSN-CODE-DESC-TABLE       OCCURS 70 TIMES          09800016
079300                                         INDEXED BY               09810000
079400                                         PE049-RSN-CDE-IDX.       09820000
079500         10  PE049-RPT-RSN-CODE          PIC X(03).               09830000
079600         10  PE049-RPT-RSN-CODE-DESC     PIC X(22).               09840000
079700                                                                  09850000
079800 01  PE049-MKDN-RPT-RSN-VALUE-TABLE.                              09860000
079801     05  PE049-REASON-CODE-NOT-FOUND     PIC X(03)  VALUE '   '.  09870000
079802     05  PE049-REASON-CODE-NOT-FND-DESC  PIC X(22)  VALUE         09880000
079803         'UNCATEGORIZED         '.                                09890000
079804     05  PE049-BMKDN-SEASON-CLR-RSN      PIC X(03)  VALUE '021'.  09900000
079805     05  PE049-BMKDN-SEASON-CLR-DESC     PIC X(22)  VALUE         09910000
079806         'CLEARANCE             '.                                09920000
079807     05  PE049-BMKDN-SLOW-CLR-RSN        PIC X(03)  VALUE '022'.  09930000
079808     05  PE049-BMKDN-SLOW-CLR-DESC       PIC X(22)  VALUE         09940000
079809         'SLOW SELLER CLEARANCE '.                                09950000
079810     05  PE049-BMKDN-MISC-CLR-RSN        PIC X(03)  VALUE '023'.  09960000
079811     05  PE049-BMKDN-MISC-CLR-DESC       PIC X(22)  VALUE         09970000
079812         'MISCELLANEOUS CLEARANC'.                                09980000
079813     05  PE049-BMKDN-REGN-CLR-RSN        PIC X(03)  VALUE '024'.  09990000
079814     05  PE049-BMKDN-REGN-CLR-DESC       PIC X(22)  VALUE         10000000
079815         'REGIONAL CLEARANCE    '.                                10010000
079813     05  PE049-BMKDN-SAS-TIER2-RSN       PIC X(03)  VALUE '025'.  10020000
079814     05  PE049-BMKDN-SAS-TIER2-DESC      PIC X(22)  VALUE         10030000
079815         'INTERIM CLEARANCE     '.                                10040000
079813     05  PE049-BMKDN-SAS-FINAL-RSN       PIC X(03)  VALUE '026'.  10050000
079814     05  PE049-BMKDN-SAS-FINAL-DESC      PIC X(22)  VALUE         10060000
079815         'FINAL CLEARANCE       '.                                10070000
079816     05  PE049-BMKDN-COMPETITIVE-RSN     PIC X(03)  VALUE '030'.  10080000
079817     05  PE049-BMKDN-COMPETITIVE-DESC    PIC X(22)  VALUE         10090000
079818         'COMPETITIVE           '.                                10100000
079819     05  PE049-BMKDN-DISCONT-RSN         PIC X(03)  VALUE '040'.  10110000
079820     05  PE049-BMKDN-DISCONT-DESC        PIC X(22)  VALUE         10120000
079821         'DISCONTINUED          '.                                10130000
079822     05  PE049-BUYER-MISC-RSN            PIC X(03)  VALUE '050'.  10140000
079823     05  PE049-BUYER-MISC-DESC           PIC X(22)  VALUE         10150000
079824         'ACTIVE                '.                                10160000
079825     05  PE049-BMKDN-CNCL-CTA-RSN        PIC X(03)  VALUE '051'.  10170000
079826     05  PE049-BMKDN-CNCL-CTA-DESC       PIC X(22)  VALUE         10180000
079827         'CLEARANCE TO ACTIVE   '.                                10190000
079828     05  PE049-BMKDN-RCP-CNCL-CTA-RSN    PIC X(03)  VALUE '052'.  10200000
079829     05  PE049-BMKDN-RCP-CNCL-CTA-DESC   PIC X(22)  VALUE         10210000
079830         'RCP CLEARANCE TO ACTV '.                                10220000
 JFK       05  PE049-BMKDN-DENIM-ADJ-RSN       PIC X(03)  VALUE '060'.  10230000
 JFK       05  PE049-BMKDN-DENIM-ADJ-DESC      PIC X(22)  VALUE         10240000
 JFK           'SPRING REPRICING      '.                                10250000
079831     05  PE049-SMKDN-ZERO-OUT-RSN        PIC X(03)  VALUE '110'.  10260000
079832     05  PE049-SMKDN-ZERO-OUT-DESC       PIC X(22)  VALUE         10270000
079833         'ZERO OUT - CONT. CLR  '.                                10280000
079834     05  PE049-SMKDN-RF-ZERO-OUT-RSN     PIC X(03)  VALUE '112'.  10290000
079835     05  PE049-SMKDN-RF-ZERO-OUT-DESC    PIC X(22)  VALUE         10300000
079836         'CONTINUED CLR - RF    '.                                10310000
079837     05  PE049-SMKDN-BUYER-MISS-RSN      PIC X(03)  VALUE '115'.  10320000
079838     05  PE049-SMKDN-BUYER-MISS-DESC     PIC X(22)  VALUE         10330000
079839         'MISSED MARKDOWN       '.                                10340000
079839****     'BUYER MISSED          '.                                10350000
079840     05  PE049-SMKDN-CUST-RET-RSN        PIC X(03)  VALUE '160'.  10360000
079841     05  PE049-SMKDN-CUST-RET-DESC       PIC X(22)  VALUE         10370000
079842         'CUSTOMER RETURNED     '.                                10380000
079843     05  PE049-SMKDN-RTN-VND-RSN         PIC X(03)  VALUE '165'.  10390000
079844     05  PE049-SMKDN-RTN-VND-DESC        PIC X(22)  VALUE         10400000
079845         'RETURN TO VENDOR      '.                                10410000
079846     05  PE049-SMKDN-MISSED-INV-RSN      PIC X(03)  VALUE '175'.  10420000
079847     05  PE049-SMKDN-MISSED-INV-DESC     PIC X(22)  VALUE         10430000
079848         'INVENTORY MISSED      '.                                10440000
079849     05  PE049-SMKDN-THEFT-RSN           PIC X(03)  VALUE '180'.  10450000
079850     05  PE049-SMKDN-THEFT-DESC          PIC X(22)  VALUE         10460000
079851         'KNOWN THEFT           '.                                10470000
079852     05  PE049-SMKDN-INSTR-DMG-RSN       PIC X(03)  VALUE '185'.  10480000
079853     05  PE049-SMKDN-INSTR-DMG-DESC      PIC X(22)  VALUE         10490000
079854         'DAMAGED               '.                                10500000
079854****     'IN STORE DAMAGE       '.                                10510000
           05  PE049-COSMETICS-TST-INSTR-RSN   PIC X(03)  VALUE '187'.  10520000
           05  PE049-COSMETICS-TST-INSTR-DESC  PIC X(22)  VALUE         10530000
               'COSMETICS TESTERS ONLY'.                                10540000
W29145     05  PE049-SAS-MARK-OUT-OF-STK-RSN   PIC X(03)  VALUE '189'.  10550000
W29145     05  PE049-SAS-MARK-OUT-OF-STK-DESC  PIC X(22)  VALUE         10560000
W29145         'MOS-SALVAGE           '.                                10570000
079855     05  PE049-SMKDN-FIN-ADJ-RSN         PIC X(03)  VALUE '195'.  10580000
079856     05  PE049-SMKDN-FIN-ADJ-DESC        PIC X(22)  VALUE         10590000
079857         'FINANCIAL ADJUSTMENT  '.                                10600000
079858     05  PE049-SMKDN-CNCL-CORR-RSN       PIC X(03)  VALUE '270'.  10610000
079859     05  PE049-SMKDN-CNCL-CORR-DESC      PIC X(22)  VALUE         10620000
079860         'CORRECTION            '.                                10630000
079861     05  PE049-SMKDN-CNCL-FIN-ADJ-RSN    PIC X(03)  VALUE '295'.  10640000
079862     05  PE049-SMKDN-CNCL-FIN-ADJ-DESC   PIC X(22)  VALUE         10650000
079863         'RED TICKET MDC        '.                                10660000
079864     05  PE049-SMKUP-BUYER-MISS-RSN      PIC X(03)  VALUE '315'.  10670000
079865     05  PE049-SMKUP-BUYER-MISS-DESC     PIC X(22)  VALUE         10680000
079866         'BUYER MISSED          '.                                10690000
079867     05  PE049-SMKUP-FIN-ADJ-RSN         PIC X(03)  VALUE '395'.  10700000
079868     05  PE049-SMKUP-FIN-ADJ-DESC        PIC X(22)  VALUE         10710000
079869         'FINANCIAL ADJUSTMENT  '.                                10720000
079870     05  PE049-DEBIT-ALLOW2-RSN          PIC X(03)  VALUE '402'.  10730000
079871     05  PE049-DEBIT-ALLOW2-DESC         PIC X(22)  VALUE         10740000
079872         'DEBIT ALLOWANCE       '.                                10750000
079873     05  PE049-DEBIT-ALLOW3-RSN          PIC X(03)  VALUE '403'.  10760000
079874     05  PE049-DEBIT-ALLOW3-DESC         PIC X(22)  VALUE         10770000
079875         'DEBIT ALLOWANCE       '.                                10780000
079876     05  PE049-DEBIT-ALLOW4-RSN          PIC X(03)  VALUE '404'.  10790000
079877     05  PE049-DEBIT-ALLOW4-DESC         PIC X(22)  VALUE         10800000
079878         'DEBIT ALLOWANCE       '.                                10810000
079879     05  PE049-DEBIT-ALLOW5-RSN          PIC X(03)  VALUE '405'.  10820000
079880     05  PE049-DEBIT-ALLOW5-DESC         PIC X(22)  VALUE         10830000
079881         'DEBIT ALLOWANCE       '.                                10840000
079882     05  PE049-SMKUP-CNCL-FIN-ADJ-RSN    PIC X(03)  VALUE '495'.  10850000
079883     05  PE049-SMKUP-CNCL-FIN-ADJ-DESC   PIC X(22)  VALUE         10860000
079884         'FINANCIAL ADJUSTMENT  '.                                10870000
079885     05  PE049-INVCNTL-ASSET-RECOV-RSN   PIC X(03)  VALUE '501'.  10880000
079886     05  PE049-INVCNTL-ASSET-RECOV-DESC  PIC X(22)  VALUE         10890000
079887         'ASSET RECOVERY        '.                                10900000
079888     05  PE049-INVCNTL-MISC-RSN          PIC X(03)  VALUE '502'.  10910000
079889     05  PE049-INVCNTL-MISC-DESC         PIC X(22)  VALUE         10920000
079890         'INVENTORY CONTROL MISC'.                                10930000
079891     05  PE049-SIGNING-ERR-RSN           PIC X(03)  VALUE '701'.  10940000
079892     05  PE049-SIGNING-ERR-DESC          PIC X(22)  VALUE         10950000
079893         'SIGNING ERROR         '.                                10960000
079894     05  PE049-PLU-ERR-RSN               PIC X(03)  VALUE '702'.  10970000
079895     05  PE049-PLU-ERR-DESC              PIC X(22)  VALUE         10980000
079896         'PLU ERROR             '.                                10990000
079897     05  PE049-DMG-MDSE-RSN              PIC X(03)  VALUE '703'.  11000000
079898     05  PE049-DMG-MDSE-DESC             PIC X(22)  VALUE         11010000
079899         'DAMAGED MERCHANDISE   '.                                11020000
079900     05  PE049-GWP-RSN                   PIC X(03)  VALUE '704'.  11030000
079901     05  PE049-GWP-DESC                  PIC X(22)  VALUE         11040000
079902         'GIFT WITH PURCHASE    '.                                11050000
079903     05  PE049-INV-UPC-MKDN-RSN          PIC X(03)  VALUE '705'.  11060000
079904     05  PE049-INV-UPC-MKDN-DESC         PIC X(22)  VALUE         11070000
079905         'OPERATOR MARKDOWN     '.                                11080000
079906     05  PE049-RAINCHECK-RSN             PIC X(03)  VALUE '706'.  11090000
079907     05  PE049-RAINCHECK-DESC            PIC X(22)  VALUE         11100000
079908         'RAINCHECK             '.                                11110000
079909     05  PE049-REG-COMPETITIVE-RSN       PIC X(03)  VALUE '707'.  11120000
079910     05  PE049-REG-COMPETITIVE-DESC      PIC X(22)  VALUE         11130000
079911         'COMPETITIVE           '.                                11140000
079912     05  PE049-SPECIAL-PROMO-RSN         PIC X(03)  VALUE '708'.  11150000
079913     05  PE049-SPECIAL-PROMO-DESC        PIC X(22)  VALUE         11160000
079914         'SPECIAL PROMOTION     '.                                11170000
079915     05  PE049-YES-WE-CAN-RSN            PIC X(03)  VALUE '709'.  11180000
079916     05  PE049-YES-WE-CAN-DESC           PIC X(22)  VALUE         11190000
079917         'YES WE CAN            '.                                11200000
205464     05  PE049-NON-RCPT-RSN              PIC X(03)  VALUE '710'.  11210016
205464     05  PE049-NON-RCPT-RTRN-DESC        PIC X(22)  VALUE         11220016
205464         'NON-RECEIPTED RETURN  '.                                11230016
079918     05  PE049-SR-CITIZEN-DISC-RSN       PIC X(03)  VALUE '728'.  11240000
079919     05  PE049-SR-CITIZEN-DISC-DESC      PIC X(22)  VALUE         11250000
079920         'SR CITIZEN DISCOUNT   '.                                11260000
079921     05  PE049-KOHLS-CHRG-DISC-RSN       PIC X(03)  VALUE '733'.  11270000
079922     05  PE049-KOHLS-CHRG-DISC-DESC      PIC X(22)  VALUE         11280000
079923         'KOHL''S CHARGE DISCOUNT'.                               11290000
079924     05  PE049-TRANS-LVL-DISC-RSN        PIC X(03)  VALUE '734'.  11300000
079925     05  PE049-TRANS-LVL-DISC-DESC       PIC X(22)  VALUE         11310000
079926         'TRANSACTION LEVEL DISC'.                                11320000
079927     05  PE049-PROMOTIONAL-RSN           PIC X(03)  VALUE '746'.  11330000
079928     05  PE049-PROMOTIONAL-DESC          PIC X(22)  VALUE         11340000
079929         'PROMOTIONAL           '.                                11350000
079930     05  PE049-GOLDSTAR-RSN              PIC X(03)  VALUE '753'.  11360000
079931     05  PE049-GOLDSTAR-DESC             PIC X(22)  VALUE         11370000
079932         'GOLDSTAR              '.                                11380000
PJ2029     05  PE049-OFFER-COUPON              PIC X(03)  VALUE '760'.  11390008
PJ2029     05  PE049-OFFER-COUPON-DESC         PIC X(22)  VALUE         11400008
PJ2029         'OFFER COUPON          '.                                11410008
PJ2029     05  PE049-OFFER-TLD-TIER            PIC X(03)  VALUE '761'.  11420008
PJ2029     05  PE049-OFFER-TLD-TIER-DESC       PIC X(22)  VALUE         11430008
PJ2029         'OFFER TLD TIER        '.                                11440008
PJ2029     05  PE049-OFFER-LID-TIER            PIC X(03)  VALUE '762'.  11450008
PJ2029     05  PE049-OFFER-LID-TIER-DESC       PIC X(22)  VALUE         11460008
PJ2029         'OFFER LID TIER        '.                                11470008
PJ2029     05  PE049-OFFER-GWP-PWP             PIC X(03)  VALUE '763'.  11480008
PJ2029     05  PE049-OFFER-GWP-PWP-DESC        PIC X(22)  VALUE         11490008
PJ2029         'OFFER GWP/PWP PRORATED'.                                11500008
PJ2029     05  PE049-OFFER-GWP-PWP             PIC X(03)  VALUE '764'.  11510008
PJ2029     05  PE049-OFFER-GWP-PWP-DESC        PIC X(22)  VALUE         11520008
PJ2029         'OFFER GWP/PWP RECEIPT '.                                11530008
W39372     05  PE049-UU-GFT-RCPT-RTRN          PIC X(03)  VALUE '765'.  11540011
W39372     05  PE049-UU-GFT-RCPT-RTRN-DESC     PIC X(22)  VALUE         11550011
W39372         'UNEARND GFT RCPT RTRN '.                                11560011
079933     05  PE049-FWP-VOID-CORR-RSN         PIC X(03)  VALUE '771'.  11570000
079934     05  PE049-FWP-VOID-CORR-DESC        PIC X(22)  VALUE         11580000
079935         'GWP VOID CORRECT      '.                                11590000
079933     05  PE049-BOGO-RSN                  PIC X(03)  VALUE '775'.  11600000
079934     05  PE049-BOGO-DESC                 PIC X(22)  VALUE         11610000
079935         'BOGO                  '.                                11620000
PJ2029     05  PE049-CRCTN-BOGO                PIC X(03)  VALUE '776'.  11630008
PJ2029     05  PE049-DRCTN-BOGO-DESC           PIC X(22)  VALUE         11640008
PJ2029         'CORRECTION BOGO       '.                                11650008
           05  PE049-BOGO-ERSN                 PIC X(03)  VALUE '777'.  11660001
           05  PE049-BOGO-EDESC                PIC X(22)  VALUE         11670001
               'ENHANCED BOGO         '.                                11680000
W28545     05  PE049-UNERND-RWD-RSN            PIC X(03)  VALUE '780'.  11690000
W28545     05  PE049-UNERND-RWD-DESC           PIC X(22)  VALUE         11700000
W28545         'UNEARNED REWARD       '.                                11710000
           05  PE049-EMPL-DISC-RSN             PIC X(03)  VALUE '790'.  11720000
           05  PE049-EMPL-DISC-DESC            PIC X(22)  VALUE         11730000
               'EMPLOYEE DISCOUNT     '.                                11740000
079936     05  PE049-OWN-RETURN-ADJ-RSN        PIC X(03)  VALUE '792'.  11750000
079937     05  PE049-OWN-RETURN-ADJ-DESC       PIC X(22)  VALUE         11760000
079938         'OWNERSHIP RETURN ADJMT'.                                11770000
079939     05  PE049-OWN-ADJ-RSN               PIC X(03)  VALUE '796'.  11780000
079940     05  PE049-OWN-ADJ-DESC              PIC X(22)  VALUE         11790000
079941         'OWNERSHIP ADJUSTMENT  '.                                11800000
079942     05  PE049-OWN-ADJ-CORR-RSN          PIC X(03)  VALUE '797'.  11810000
079943     05  PE049-OWN-ADJ-CORR-DESC         PIC X(22)  VALUE         11820000
079944         'OWNERSHIP ADJMT CORR  '.                                11830000
079945     05  PE049-UNKNOWN-MKDN-RSN          PIC X(03)  VALUE '798'.  11840000
079946     05  PE049-UNKNOWN-MKDN-DESC         PIC X(22)  VALUE         11850000
079947         'UNKNOWN MARKDOWN      '.                                11860000
079948     05  PE049-MANUAL-LID-CORR-RSN       PIC X(03)  VALUE '799'.  11870000
079949     05  PE049-MANUAL-LID-CORR-DESC      PIC X(22)  VALUE         11880000
079950         'MANUAL LID CORRECT    '.                                11890000
079951     05  PE049-SC-OWNERSHIP-ADJUST-RSN   PIC X(03)  VALUE '997'.  11900000
079952     05  PE049-SC-OWNERSHIP-ADJUST-DESC  PIC X(22)  VALUE         11910000
079953         'SALES CORR - OWN ADJ  '.                                11920000
079954     05  PE049-SC-MKDN-MKDNCNCL-RSN      PIC X(03)  VALUE '998'.  11930000
079955     05  PE049-SC-MKDN-MKDNCNCL-DESC     PIC X(22)  VALUE         11940000
079956         'SLS CORR-MKDN/MKDN CAN'.                                11950000
079957     05  PE049-DATA-ENTRY-RSN            PIC X(03)  VALUE '999'.  11960000
079958     05  PE049-DATA-ENTRY-DESC           PIC X(22)  VALUE         11970000
079960         'VENDOR DEBIT ALLOWANCE'.                                11980000
