00001 ****************************************************************  09/08/94
00002 * PERMANENT PRICE CHANGE CONTROL NUMBERS                       *  PEWS048 
00003 *     THIS COPYLIB CONTAINS ALL THE CONTROL NUMBERS ASSOCIATED *     LV002
00004 *     WITH THE TPPCCTL TABLE.                                  *  PEWS048 
00005 *                                                              *  PEWS048 
00006 *   ALSO INCLUDED IS A HOLD AREA FOR THE PARAMETER AMOUNT      *  PEWS048 
00007 *   ONCE IT IS READ OFF THE TPPCCTL TABLE.                     *  PEWS048 
00008 *                                                              *  PEWS048 
00009 *   2/10/92 - AJR - PERM PHASE 2 - #1851                       *  PEWS048 
00010 *   ADDED CONTROL NUMBER 24 - NON-CLEARANCE DOC PRINT TIMEFRAME*  PEWS048 
00011 *   FOR STORES BY SOFT OPENING.  A NON-CLEARANCE DOC WILL NOT  *  PEWS048 
00012 *   PRINT FOR A STORE/STORAGE LOCATION, EVEN IF SELECTED, IF   *  PEWS048 
00013 *   THE EFFECTIVE DATE OF THE DOC IS MORE THAN THIS NUMBER OF  *  PEWS048 
00014 *   DAYS BEFORE THE STORE/STORAGE LOCATION'S SOFT OPENING.     *  PEWS048 
00015 *                                                              *  PEWS048 
00016 *   4/15/92 - AJR - PERM PHASE 2 - #1851                       *  PEWS048 
00017 *   ADDED CONTROL NUMBER 25 - NUMBER OF LINES PER DOCUMENT.    *  PEWS048 
00018 *   THIS FIELD WILL BE USED AS THE SOFT LIMIT FOR THE NUMBER   *  PEWS048 
00019 *   OF LINES PER DOCUMENT.  THE MAXIMUM FIXED LIMIT FOR THE    *  PEWS048 
00020 *   NUMBER OF LINES PER DOCUMENT WILL BE STORED IN PEWS049.    *  PEWS048 
00021 *                                                              *  PEWS048 
00022 *   9/01/92 - AJR - PERM PHASE 2 - #1851                       *  PEWS048 
00023 *   ADDED CONTROL NUMBER 26 - PRINT DOCUMENT TIMEFRAME.        *  PEWS048 
00024 *   THE NUMBER OF DAYS BEFORE THE EFFECTIVE DATE THAT A        *  PEWS048 
00025 *   DOCUMENT WILL BE INITIALLY PRINTED AND SET 'IN-PROCESS'.   *  PEWS048 
00026 *   DOCUMENTS CAN BE CREATED/APPROVED INSIDE OF THIS TIMEFRAME *  PEWS048 
00027 *   AND IN THAT CASE, ARE PRINTED AND SET 'IN-PROCESS THAT     *  PEWS048 
00028 *   NIGHT.                                                     *  PEWS048 
00029 *   ADDED CONTROL NUMBER 27 - COUNT ENTRY UPDATE TIMEFRAME.    *  PEWS048 
00030 *   THE NUMBER OF DAYS AFTER THE INITIAL COUNT ENTRY DATE      *  PEWS048 
00031 *   THAT APPROVED STORE LEVEL CORP PRICE CHANGE COUNTS CAN BE  *  PEWS048 
00032 *   MODIFIED BEFORE THEY ARE COMMITTED.  AFTER THIS POINT,     *  PEWS048 
00033 *   MODIFICATIONS MUST BE HANDLED ON IN-STORE MODIFICATIONS.   *  PEWS048 
00034 *                                                              *  PEWS048 
00035 *   7/23/93 - AJR - IN-STORE DOCUMENT CHANGES  WR 2401         *  PEWS048 
00036 * - ADDED CONTROL NUMBER 28 - IN STORE DOCUMENT DELINQUENT     *  PEWS048 
00037 *   TIMEFRAME.  THIS IS THE NUMBER OF DAYS BEFORE MONTH END IN *  PEWS048 
00038 *   WHICH AN IN-STORE DOCUMENT WILL BE CONSIDERED DELINQUENT.  *  PEWS048 
00039 * - ADDED CONTROL NUMBER 29 - IN STORE PAGES PER DOCUMENT.     *  PEWS048 
00040 *   THIS IS THE MAXIMUM NUMBER OF PAGES ON AN IN-STORE DOC.    *  PEWS048 
00041 * - ADDED CONTROL NUMBER 30 - IN STORE EXCESSIVE QUANITIES.    *  PEWS048 
00042 *   THIS IS THE NUMBER OF UNITS WHICH WILL BE FLAGGED AS AN    *  PEWS048 
00043 *   EXCESSIVE AMOUNT FOR EACH LINE ON THE IN-STORE PRICE CHG.  *  PEWS048 
00044 * - ADDED CONTROL NUMBER 31 - IN STORE DOCUMENT ISSUE DATE     *  PEWS048 
00045 *   DELINQUENT TIMEFRAME.  THIS IS THE NUMBER OF DAYS AFTER THE*  PEWS048 
00046 *   ISSUE DATE IN WHICH AN IN-STORE DOCUMENT WILL BE CONSIDERED*  PEWS048 
00047 *   DELINQUENT.                                                *  PEWS048 
00048 * - ADDED CONTROL NUMBER 32 - MAX PERM RELEASE AVAILABILITY    *  PEWS048 
00049 *   NUMBER.  THE PERM RELEASE AVAILABILITY NUMBER SHOWS WHICH  *  PEWS048 
00050 *   PERM RELEASE A STORE IS AT.  THIS NUMBER WILL HELP ROLL-OUT*  PEWS048 
00051 *   INDIVIDUAL STORES TO NEW PERM SOFTWARE.  THE MAXIMUM       *  PEWS048 
00052 *   RELEASE AVAILABILITY NUMBER IS THE MAXIMUM RELEASE NUMBER  *  PEWS048 
00053 *   AVAILABLE TO THE STORES.                                   *  PEWS048 
00054 *                                                              *  PEWS048 
00055 *   12/06/93- AJR - WR 2195                                    *  PEWS048 
00056 *   ADDED CONTROL NUMBER 33 - EXCESSIVE IN-STORE DOLLAR AMOUNT *  PEWS048 
00057 *                                                              *     CL**2
00058 *   09/08/94- PAT DOYLE                                        *     CL**2
00059 *   ADDED CONTROL NUMBER 34 - THE NUMBER OF DAYS AFTER A SKU   *     CL**2
00060 *   IS CHANGED TO CLEARANCE, THAT IT IS PROTECTED FROM GETTING *     CL**2
00061 *   ITS PRICE REDUCED BY THE ZERO OUT JOB.                     *     CL**2
      *                                                              *          
00058 *   08/03/99 - TODD MICHALEK - WR ????                         *     CL**2
00059 *   ADDED CONTROL NUMBER 35 - THE NUMBER OF DAYS BEFORE A NEW  *     CL**2
00060 *   STORE OPENS THAT PREVIOUS REGIONAL CLEARANCE PRICE         *     CL**2
00061 *   CHANGES, THAT WOULD HAVE BEEN EFFECTIVE FOR THE NEW STORE  *     CL**2
00061 *   HAD IT BEEN OPEN (IN ITS CLIMATE/METRO AREA) AT THE TIME,  *     CL**2
00061 *   ARE ADDED TO A VSM TABLE.                                  *     CL**2
      *                                                              *          
00058 *   10/28/99 - DAVE COLOMBO  - WR ????                         *     CL**2
00059 *   ADDED CONTROL NUMBER 36 - THE MAXIUM NUMBER OF TIERS       *     CL**2
00060 *   ALLOWED FOR A REGIONAL CLEARANCE PRICE DOCUMENT.           *     CL**2
0110  *                                                              *          
0110  *   01/10/00 - CHRIS KUNSTMANN - WR ????                       *     CL**2
0110  *   ADDED CONTROL NUMBER 37 - THE MINIMUM NUMBER OF DAYS       *     CL**2
0110  *    BETWEEN SUCCESSIVE TIER EFFECTIVE DATES FOR A REGIONAL    *     CL**2
0110  *    CLEARANCE DOCUMENT.                                       *     CL**2
00062 ****************************************************************  PEWS048 
00063 *                                                                 PEWS048 
00064  01  PE048-CURR-FISCAL-ME-DATE-NBR       PIC S9(03)  COMP-3       PEWS048 
00065                                                      VALUE 1.     PEWS048 
00066  01  PE048-CURR-FISCAL-ME-DATE-AMT       PIC  9(08)  VALUE ZERO.  PEWS048 
00067  01  FILLER  REDEFINES  PE048-CURR-FISCAL-ME-DATE-AMT.            PEWS048 
00068      05  PE048-CURR-FISCAL-ME-CCYY       PIC  9(04).              PEWS048 
00069      05  FILLER  REDEFINES  PE048-CURR-FISCAL-ME-CCYY.            PEWS048 
00070          10  PE048-CURR-FISCAL-ME-CC     PIC  9(02).              PEWS048 
00071          10  PE048-CURR-FISCAL-ME-YY     PIC  9(02).              PEWS048 
00072      05  PE048-CURR-FISCAL-ME-MM         PIC  9(02).              PEWS048 
00073      05  PE048-CURR-FISCAL-ME-DD         PIC  9(02).              PEWS048 
00074 *                                                                 PEWS048 
00075 *                                                                 PEWS048 
00076  01  PE048-CURR-FISCAL-YM-DATE-NBR       PIC S9(03)  COMP-3       PEWS048 
00077                                                      VALUE 2.     PEWS048 
00078  01  PE048-CURR-FISCAL-YM-DATE-AMT       PIC  9(08)  VALUE ZERO.  PEWS048 
00079  01  FILLER  REDEFINES  PE048-CURR-FISCAL-YM-DATE-AMT.            PEWS048 
00080      05  FILLER                          PIC  9(02).              PEWS048 
00081      05  PE048-CURR-FISCAL-YM-CCYY       PIC  9(04).              PEWS048 
00082      05  FILLER  REDEFINES  PE048-CURR-FISCAL-YM-CCYY.            PEWS048 
00083          10  PE048-CURR-FISCAL-YM-CC     PIC  9(02).              PEWS048 
00084          10  PE048-CURR-FISCAL-YM-YY     PIC  9(02).              PEWS048 
00085      05  PE048-CURR-FISCAL-YM-MM         PIC  9(02).              PEWS048 
00086 *                                                                 PEWS048 
00087 *                                                                 PEWS048 
00088  01  PE048-NEXT-FISCAL-ME-DATE-NBR       PIC S9(03)  COMP-3       PEWS048 
00089                                                      VALUE 3.     PEWS048 
00090  01  PE048-NEXT-FISCAL-ME-DATE-AMT       PIC  9(08)  VALUE ZERO.  PEWS048 
00091  01  FILLER  REDEFINES  PE048-NEXT-FISCAL-ME-DATE-AMT.            PEWS048 
00092      05  PE048-NEXT-FISCAL-ME-CCYY       PIC  9(04).              PEWS048 
00093      05  FILLER  REDEFINES  PE048-NEXT-FISCAL-ME-CCYY.            PEWS048 
00094          10  PE048-NEXT-FISCAL-ME-CC     PIC  9(02).              PEWS048 
00095          10  PE048-NEXT-FISCAL-ME-YY     PIC  9(02).              PEWS048 
00096      05  PE048-NEXT-FISCAL-ME-MM         PIC  9(02).              PEWS048 
00097      05  PE048-NEXT-FISCAL-ME-DD         PIC  9(02).              PEWS048 
00098 *                                                                 PEWS048 
00099 *                                                                 PEWS048 
00100  01  PE048-NEXT-FISCAL-YM-DATE-NBR       PIC S9(03)  COMP-3       PEWS048 
00101                                                      VALUE 4.     PEWS048 
00102  01  PE048-NEXT-FISCAL-YM-DATE-AMT       PIC  9(08)  VALUE ZERO.  PEWS048 
00103  01  FILLER  REDEFINES  PE048-NEXT-FISCAL-YM-DATE-AMT.            PEWS048 
00104      05  FILLER                          PIC  9(02).              PEWS048 
00105      05  PE048-NEXT-FISCAL-YM-CCYY       PIC  9(04).              PEWS048 
00106      05  FILLER  REDEFINES  PE048-NEXT-FISCAL-YM-CCYY.            PEWS048 
00107          10  PE048-NEXT-FISCAL-YM-CC     PIC  9(02).              PEWS048 
00108          10  PE048-NEXT-FISCAL-YM-YY     PIC  9(02).              PEWS048 
00109      05  PE048-NEXT-FISCAL-YM-MM         PIC  9(02).              PEWS048 
00110 *                                                                 PEWS048 
00111 *                                                                 PEWS048 
00112  01  PE048-PHY-INV-LEAD-TIME-NBR         PIC S9(03)  COMP-3       PEWS048 
00113                                                      VALUE 5.     PEWS048 
00114  01  PE048-PHY-INV-LEAD-TIME-AMT         PIC S9(08)  VALUE ZERO.  PEWS048 
00115 *                                                                 PEWS048 
00116 *                                                                 PEWS048 
00117  01  PE048-PHY-INV-DATE-NBR              PIC S9(03)  COMP-3       PEWS048 
00118                                                      VALUE 6.     PEWS048 
00119  01  PE048-PHY-INV-DATE-AMT              PIC  9(08)  VALUE ZERO.  PEWS048 
00120  01  FILLER  REDEFINES  PE048-PHY-INV-DATE-AMT.                   PEWS048 
00121      05  PE048-PHY-INV-DATE-CCYY         PIC  9(04).              PEWS048 
00122      05  FILLER  REDEFINES  PE048-PHY-INV-DATE-CCYY.              PEWS048 
00123          10  PE048-PHY-INV-DATE-CC       PIC  9(02).              PEWS048 
00124          10  PE048-PHY-INV-DATE-YY       PIC  9(02).              PEWS048 
00125      05  PE048-PHY-INV-DATE-MM           PIC  9(02).              PEWS048 
00126      05  PE048-PHY-INV-DATE-DD           PIC  9(02).              PEWS048 
00127 *                                                                 PEWS048 
00128 *                                                                 PEWS048 
00129  01  PE048-MINIMUM-LEAD-TIME-NBR         PIC S9(03)  COMP-3       PEWS048 
00130                                                      VALUE 7.     PEWS048 
00131  01  PE048-MINIMUM-LEAD-TIME-AMT         PIC S9(08)  VALUE ZERO.  PEWS048 
00132 *                                                                 PEWS048 
00133 *                                                                 PEWS048 
00134  01  PE048-CENTRAL-PPC-MAX-DLR-NBR       PIC S9(03)  COMP-3       PEWS048 
00135                                                      VALUE 8.     PEWS048 
00136  01  PE048-CENTRAL-PPC-MAX-DLR-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00137 *                                                                 PEWS048 
00138 *                                                                 PEWS048 
00139  01  PE048-CENTRAL-PPC-MAX-UNIT-NBR      PIC S9(03)  COMP-3       PEWS048 
00140                                                      VALUE 9.     PEWS048 
00141  01  PE048-CENTRAL-PPC-MAX-UNIT-AMT      PIC S9(08)  VALUE ZERO.  PEWS048 
00142 *                                                                 PEWS048 
00143 *                                                                 PEWS048 
00144  01  PE048-STORE-PPC-MAX-DLR-NBR         PIC S9(03)  COMP-3       PEWS048 
00145                                                      VALUE 10.    PEWS048 
00146  01  PE048-STORE-PPC-MAX-DLR-AMT         PIC S9(08)  VALUE ZERO.  PEWS048 
00147 *                                                                 PEWS048 
00148 *                                                                 PEWS048 
00149  01  PE048-STORE-PPC-MAX-UNIT-NBR        PIC S9(03)  COMP-3       PEWS048 
00150                                                      VALUE 11.    PEWS048 
00151  01  PE048-STORE-PPC-MAX-UNIT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00152 *                                                                 PEWS048 
00153 *                                                                 PEWS048 
00154  01  PE048-ZOUT-MAX-DLR-NBR              PIC S9(03)  COMP-3       PEWS048 
00155                                                      VALUE 12.    PEWS048 
00156  01  PE048-ZOUT-MAX-DLR-AMT              PIC S9(08)  VALUE ZERO.  PEWS048 
00157 *                                                                 PEWS048 
00158 *                                                                 PEWS048 
00159  01  PE048-CORP-DOC-PROC-TIMEFR-NBR      PIC S9(03)  COMP-3       PEWS048 
00160                                                      VALUE 13.    PEWS048 
00161  01  PE048-CORP-DOC-PROC-TIMEFR-AMT      PIC S9(08)  VALUE ZERO.  PEWS048 
00162 *                                                                 PEWS048 
00163 *                                                                 PEWS048 
00164  01  PE048-ZOUT-PROC-TIMEFR-NBR          PIC S9(03)  COMP-3       PEWS048 
00165                                                      VALUE 14.    PEWS048 
00166  01  PE048-ZOUT-PROC-TIMEFR-AMT          PIC S9(08)  VALUE ZERO.  PEWS048 
00167 *                                                                 PEWS048 
00168 *                                                                 PEWS048 
00169  01  PE048-MAX-HARDLN-PPC-PCT-NBR        PIC S9(03)  COMP-3       PEWS048 
00170                                                      VALUE 15.    PEWS048 
00171  01  PE048-MAX-HARDLN-PPC-PCT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00172  01  PE048-MAX-HARDLN-DEC-PCT-AMT  REDEFINES                      PEWS048 
00173                                    PE048-MAX-HARDLN-PPC-PCT-AMT   PEWS048 
00174                                          PIC S9(06)V99.           PEWS048 
00175 *                                                                 PEWS048 
00176 *                                                                 PEWS048 
00177  01  PE048-RECOM-HL-CLEAR-PCT-NBR        PIC S9(03)  COMP-3       PEWS048 
00178                                                      VALUE 16.    PEWS048 
00179  01  PE048-RECOM-HL-CLEAR-PCT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00180  01  PE048-RECOM-HL-CL-DEC-PCT-AMT  REDEFINES                     PEWS048 
00181                                     PE048-RECOM-HL-CLEAR-PCT-AMT  PEWS048 
00182                                          PIC S9(06)V99.           PEWS048 
00183 *                                                                 PEWS048 
00184 *                                                                 PEWS048 
00185  01  PE048-MAX-SOFTLN-PPC-PCT-NBR        PIC S9(03)  COMP-3       PEWS048 
00186                                                      VALUE 17.    PEWS048 
00187  01  PE048-MAX-SOFTLN-PPC-PCT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00188  01  PE048-MAX-SOFTLN-DEC-PCT-AMT  REDEFINES                      PEWS048 
00189                                    PE048-MAX-SOFTLN-PPC-PCT-AMT   PEWS048 
00190                                          PIC S9(06)V99.           PEWS048 
00191 *                                                                 PEWS048 
00192 *                                                                 PEWS048 
00193  01  PE048-RECOM-SL-CLEAR-PCT-NBR        PIC S9(03)  COMP-3       PEWS048 
00194                                                      VALUE 18.    PEWS048 
00195  01  PE048-RECOM-SL-CLEAR-PCT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00196  01  PE048-RECOM-SL-CL-DEC-PCT-AMT  REDEFINES                     PEWS048 
00197                                     PE048-RECOM-SL-CLEAR-PCT-AMT  PEWS048 
00198                                          PIC S9(06)V99.           PEWS048 
00199 *                                                                 PEWS048 
00200 *                                                                 PEWS048 
00201  01  PE048-MIN-PPC-PCT-NBR               PIC S9(03)  COMP-3       PEWS048 
00202                                                      VALUE 19.    PEWS048 
00203  01  PE048-MIN-PPC-PCT-AMT               PIC S9(08)  VALUE ZERO.  PEWS048 
00204  01  PE048-MIN-PPC-DEC-PCT-AMT  REDEFINES                         PEWS048 
00205                                 PE048-MIN-PPC-PCT-AMT             PEWS048 
00206                                          PIC S9(06)V99.           PEWS048 
00207 *                                                                 PEWS048 
00208 *                                                                 PEWS048 
00209  01  PE048-VOL-RPT-LEAD-TIME-NBR         PIC S9(03)  COMP-3       PEWS048 
00210                                                      VALUE 20.    PEWS048 
00211  01  PE048-VOL-RPT-LEAD-TIME-AMT         PIC S9(08)  VALUE ZERO.  PEWS048 
00212 *                                                                 PEWS048 
00213 *                                                                 PEWS048 
00214  01  PE048-ZOUT-CHG-LEAD-TIME-NBR        PIC S9(03)  COMP-3       PEWS048 
00215                                                      VALUE 21.    PEWS048 
00216  01  PE048-ZOUT-CHG-LEAD-TIME-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00217 *                                                                 PEWS048 
00218 *                                                                 PEWS048 
00219  01  PE048-INACT-DEL-TIMEFR-NBR          PIC S9(03)  COMP-3       PEWS048 
00220                                                      VALUE 22.    PEWS048 
00221  01  PE048-INACT-DEL-TIMEFR-AMT          PIC S9(08)  VALUE ZERO.  PEWS048 
00222 *                                                                 PEWS048 
00223 *                                                                 PEWS048 
00224  01  PE048-INACT-PND-DEL-TIMEFR-NBR      PIC S9(03)  COMP-3       PEWS048 
00225                                                      VALUE 23.    PEWS048 
00226  01  PE048-INACT-PND-DEL-TIMEFR-AMT      PIC S9(08)  VALUE ZERO.  PEWS048 
00227 *                                                                 PEWS048 
00228 *                                                                 PEWS048 
00229 *                                                                 PEWS048 
00230  01  PE048-NONCLEAR-DOC-NOPRT-NBR        PIC S9(03)  COMP-3       PEWS048 
00231                                                      VALUE 24.    PEWS048 
00232  01  PE048-NONCLEAR-DOC-NOPRT-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00233  01  FILLER  REDEFINES  PE048-NONCLEAR-DOC-NOPRT-AMT.             PEWS048 
00234      05  FILLER                          PIC  9(03).              PEWS048 
00235      05  PE048-NONCLEAR-DOC-NOPRT-DAYS   PIC  9(05).              PEWS048 
00236 *                                                                 PEWS048 
00237 *                                                                 PEWS048 
00238 *                                                                 PEWS048 
00239  01  PE048-LINES-PER-DOC-NBR             PIC S9(03)  COMP-3       PEWS048 
00240                                                      VALUE 25.    PEWS048 
00241  01  PE048-LINES-PER-DOC-AMT             PIC S9(08)  VALUE ZERO.  PEWS048 
00242 *                                                                 PEWS048 
00243 *                                                                 PEWS048 
00244 *                                                                 PEWS048 
00245  01  PE048-CORP-DOC-PRT-TIMEFR-NBR       PIC S9(03)  COMP-3       PEWS048 
00246                                                      VALUE 26.    PEWS048 
00247  01  PE048-CORP-DOC-PRT-TIMEFR-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00248 *                                                                 PEWS048 
00249 *                                                                 PEWS048 
00250 *                                                                 PEWS048 
00251  01  PE048-COUNT-ENTRY-TIMEFR-NBR        PIC S9(03)  COMP-3       PEWS048 
00252                                                      VALUE 27.    PEWS048 
00253  01  PE048-COUNT-ENTRY-TIMEFR-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00254 *                                                                 PEWS048 
00255 *                                                                 PEWS048 
00256 *                                                                 PEWS048 
00257  01  PE048-INSTR-ME-DQ-TIMEFR-NBR        PIC S9(03)  COMP-3       PEWS048 
00258                                                      VALUE 28.    PEWS048 
00259  01  PE048-INSTR-ME-DQ-TIMEFR-AMT        PIC S9(08)  VALUE ZERO.  PEWS048 
00260 *                                                                 PEWS048 
00261 *                                                                 PEWS048 
00262 *                                                                 PEWS048 
00263  01  PE048-INSTR-PAGES-PER-DOC-NBR       PIC S9(03)  COMP-3       PEWS048 
00264                                                      VALUE 29.    PEWS048 
00265  01  PE048-INSTR-PAGES-PER-DOC-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00266 *                                                                 PEWS048 
00267 *                                                                 PEWS048 
00268 *                                                                 PEWS048 
00269 *                                                                 PEWS048 
00270  01  PE048-INSTR-EXCESSIVE-UNIT-NBR      PIC S9(03)  COMP-3       PEWS048 
00271                                                      VALUE 30.    PEWS048 
00272  01  PE048-INSTR-EXCESSIVE-UNIT-AMT      PIC S9(08)  VALUE ZERO.  PEWS048 
00273 *                                                                 PEWS048 
00274 *                                                                 PEWS048 
00275 *                                                                 PEWS048 
00276  01  PE048-INSTR-ISS-DQ-TIMEFR-NBR       PIC S9(03)  COMP-3       PEWS048 
00277                                                      VALUE 31.    PEWS048 
00278  01  PE048-INSTR-ISS-DQ-TIMEFR-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00279 *                                                                 PEWS048 
00280 *                                                                 PEWS048 
00281 *                                                                 PEWS048 
00282  01  PE048-MAX-PERM-RLSE-AVAIL-NBR       PIC S9(03)  COMP-3       PEWS048 
00283                                                      VALUE 32.    PEWS048 
00284  01  PE048-MAX-PERM-RLSE-AVAIL-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00285 *                                                                 PEWS048 
00286 *                                                                 PEWS048 
00287 *                                                                 PEWS048 
00288  01  PE048-INSTR-EXCESSIVE-DLR-NBR       PIC S9(03)  COMP-3       PEWS048 
00289                                                      VALUE 33.    PEWS048 
00290  01  PE048-INSTR-EXCESSIVE-DLR-AMT       PIC S9(08)  VALUE ZERO.  PEWS048 
00291 *                                                                    CL**2
00292 *                                                                    CL**2
00293 *                                                                    CL**2
00294  01  PE048-ZEROUT-PROTECT-DAYS-NBR       PIC S9(03)  COMP-3          CL**2
00295                                                      VALUE 34.       CL**2
00296  01  PE048-ZEROUT-PROTECT-DAYS-AMT       PIC S9(08)  VALUE ZERO.     CL**2
00291 *                                                                    CL**2
00292 *                                                                    CL**2
00293 *                                                                    CL**2
00294  01  PE048-ADD-NEW-STR-PREV-RCP-NBR      PIC S9(03)  COMP-3          CL**2
00295                                                      VALUE 35.       CL**2
00296  01  PE048-ADD-NEW-STR-PREV-RCP-AMT      PIC S9(08)  VALUE ZERO.     CL**2
00291 *                                                                    CL**2
00292 *                                                                    CL**2
00293 *                                                                    CL**2
00294  01  PE048-RCP-MAXIUM-TIERS-NBR          PIC S9(03)  COMP-3          CL**2
00295                                                      VALUE 36.       CL**2
00296  01  PE048-RCP-MAXIUM-TIERS-AMT          PIC S9(08)  VALUE ZERO.     CL**2
0110  *                                                                    CL**2
0110   01  PE048-MIN-DAYS-RCP-TIERS-NBR        PIC S9(03)  COMP-3          CL**2
0110                                                       VALUE 37.       CL**2
0110   01  PE048-MIN-DAYS-RCP-TIERS-AMT        PIC S9(08)  VALUE ZERO.     CL**2
