00001 ******************************************************************10/13/93
00002 *                         PEWS056                                *PEWS056 
00003 *                                                                *   LV005
00004 *   THIS IS THE APPLICATION SPECIFIC COMMUNICATION AREA FOR      *   CL**2
00005 *   THE IN-STORE DOCUMENT PRINT PROGRAM PEKCS008.  PROGRAMS      *   CL**2
00006 *   WHICH PASS DATA TO PEKCS008 WILL USE THIS AREA.              *   CL**2
00007 *                                                                *   CL**2
00008 *   THE PROGRAM MUST FILL IN THE STORE NUMBER WHICH THE DOCUMENT *   CL**2
00009 *   WILL BE PRINTED FOR, AND THE STORE NUMBER WHERE THE DOCUMENT *   CL**2
00010 *   WILL BE PRINTED AT.  IF ONLY ONE DOCUMENT IS TO BE PRINTED,  *   CL**2
00011 *   THE SINGLE DOCUMENT NUMBER WILL BE FILLED IN AND THE PRINT   *   CL**2
00012 *   QUEUE NAME FILLED WITH SPACES.  IF MORE THAN ONE DOCUMENT IS *   CL**2
00013 *   TO BE PRINTED, THE DOCUMENTS WILL BE WRITTEN TO A TEMP       *   CL**2
00014 *   STORAGE QUEUE WITH THE TEMP STORAGE QUEUE NAME FILLED THE    *   CL**2
00015 *   NAME BELOW.                                                  *   CL**2
00016 *   LENGTH:  35 BYTES                                            *   CL**5
00017 ******************************************************************   CL**2
00018  01  PE056-SPECIFIC-COMMAREA.                                        CL**2
00019      05  PE056-PRINT-FOR-STORE-NUMBER                                CL**2
00020                                      PIC  9(04)    VALUE ZEROS.      CL**2
00021      05  PE056-PRINT-AT-STORE-NUMBER PIC  9(04)    VALUE ZEROS.      CL**2
00022      05  PE056-PRINT-AT-LOC-TYPE     PIC  X(02)    VALUE SPACES.     CL**5
00023      05  PE056-PRINT-TYPE            PIC  X(01)    VALUE SPACES.     CL**2
00024          88  PE056-INSTR-PRINT                     VALUE ' '.        CL**2
00025          88  PE056-INSTR-REPRINT                   VALUE 'R'.        CL**2
00026          88  PE056-INSTR-GENERATED                 VALUE 'G'.        CL**2
00027          88  PE056-INSTR-GENERATED-REPRINT         VALUE 'X'.        CL**2
00028      05  PE056-MAX-PAGES-TO-PRINT    PIC  9(03)    VALUE ZERO.       CL**2
00029      05  PE056-PRINT-DOCUMENT-NUMBER PIC S9(07)    VALUE +0          CL**2
00030                                                    COMP-3.           CL**2
00031      05  PE056-PRINT-QUEUE.                                          CL**2
00032          10  PE056-PRINT-TRANID      PIC  X(04)    VALUE SPACES.     CL**2
00033          10  PE056-PRINT-TASK        PIC S9(07)    VALUE +0          CL**2
00034                                                    COMP-3.           CL**2
00035          10  PE056-PRINT-SEQ         PIC  9(01)    VALUE  0.         CL**2
00036      05  PE056-PRINTER-ID            PIC  X(08)    VALUE SPACES.     CL**4
