00001 ******************************************************************08/17/93
00002 *                        PEWS064                                  PEWS064 
00003 *                                                                    LV007
00004 *   THIS IS THE INTER APPLICATION COMMAREA FOR: PEKCS190             CL**5
00005 *   LENGTH:  200 BYTES                                               CL**5
00006 ******************************************************************   CL**5
00007          10  PE064-INTER-APPL-COMMAREA REDEFINES                     CL**5
00008              INTER-APPL-COMMAREA.                                    CL**7
00009              15  PE064-INTER-APPL-FORMAT-IND         PIC  X(01).     CL**5
00010              15  FILLER                              PIC  X(08).     CL**5
00011              15  PE064-REQUEST-DATA.                                 CL**5
00012                  20  PE064-STORE-NUMBER              PIC S9(04).     CL**5
00013                  20  PE064-STORE-NAME                PIC  X(25).     CL**5
00014                  20  PE064-DOCUMENT-NUMBER           PIC  X(07).     CL**5
00015                  20  PE064-DEPT-NUMBER               PIC  X(03).     CL**5
00016                  20  PE064-STATUS-CODE               PIC  X(02).     CL**5
00017                  20  PE064-REASON-CODE               PIC  X(03).     CL**5
00018                  20  PE064-DATE-FROM.                                CL**5
00019                      25  PE064-CENTURY-FROM          PIC  X(02).     CL**6
00020                      25  PE064-YEAR-FROM             PIC  X(02).     CL**6
00021                      25  FILLER                      PIC  X(01).     CL**6
00022                      25  PE064-MONTH-FROM            PIC  X(02).     CL**6
00023                      25  FILLER                      PIC  X(01).     CL**6
00024                      25  PE064-DAY-FROM              PIC  X(02).     CL**5
00025                  20  PE064-DATE-TO.                                  CL**5
00026                      25  PE064-CENTURY-TO            PIC  X(02).     CL**6
00027                      25  PE064-YEAR-TO               PIC  X(02).     CL**6
00028                      25  FILLER                      PIC  X(01).     CL**6
00029                      25  PE064-MONTH-TO              PIC  X(02).     CL**5
00030                      25  FILLER                      PIC  X(01).     CL**6
00031                      25  PE064-DAY-TO                PIC  X(02).     CL**5
00032              15  FILLER                              PIC  X(127).    CL**6
