000100***********************************************************       00010000
000200**                      PMRD107                          **       00020002
000300**                     LRECL=243                         **       00030008
000400**  THIS COPYBOOK IS THE LAYOUT FOR THE EXCEPTION        **       00040000
000500**  PRICING EXTRACT EXPLODED BY SKU/STORE FOR THE        **       00050002
000500**  NEW PROMO SYSTEM.                                    **       00051002
000600***********************************************************       00060000
000700 01 PM107-EXCPT-PRCG-EXT-SKU.                                     00070002
000701    05 PM107-SKU-NBR                 PIC 9(08) VALUE 0.           00070102
000701    05 PM107-LOC-NBR                 PIC 9(05) VALUE 0.           00070202
000717    05 PM107-PROMO-INTFC-ID          PIC 9(10) VALUE 0.           00070302
000708    05 PM107-MDSE-SELN-ID            PIC 9(10) VALUE 0.           00070402
000709    05 PM107-MDSE-SELN-LNE-ID        PIC 9(10) VALUE 0.           00070502
000703    05 PM107-AD-EVNT-ID              PIC 9(10) VALUE 0.           00070602
000705    05 PM107-PROMO-ID                PIC 9(10) VALUE 0.           00070902
000734    05 PM107-PROMO-STRT-TMST         PIC X(19) VALUE SPACES.      00071003
000735    05 PM107-PROMO-END-TMST          PIC X(19) VALUE SPACES.      00071103
000707    05 PM107-PROMO-ITM-ID            PIC 9(10) VALUE 0.           00071202
000711    05 PM107-DEPT-NBR                PIC 9(04) VALUE 0.           00071302
000711    05 PM107-MAJ-CL-NBR              PIC 9(04) VALUE 0.           00071406
000711    05 PM107-SUB-CL-NBR              PIC 9(04) VALUE 0.           00071506
000711    05 PM107-VS-ID                   PIC 9(09) VALUE 0.           00071606
000711    05 PM107-VS-NBR                  PIC X(20) VALUE SPACES.      00071707
000716    05 PM107-PROMO-PRICG-TYP-CDE     PIC X(03) VALUE SPACES.      00071802
000718    05 PM107-PROMO-PRICG-AMT         PIC 9(07)V9(03) VALUE 0.     00071902
000718    05 PM107-PROMO-PRIC-PT-AMT       PIC 9(07)V9(03) VALUE 0.     00072002
000719    05 PM107-PROMO-GP-QTY            PIC 9(05) VALUE 0.           00073002
000718    05 PM107-PROMO-GP-AMT            PIC 9(07)V9(02) VALUE 0.     00073102
000718    05 PM107-UNT-RTL-AMT             PIC 9(07)V9(02) VALUE 0.     00073202
000719    05 PM107-GP-RTL-QTY              PIC 9(05) VALUE 0.           00073302
000718    05 PM107-GP-RTL-AMT              PIC 9(07)V9(02) VALUE 0.     00073402
000716    05 PM107-LOC-SKU-STAT-CDE        PIC X(02) VALUE SPACES.      00073502
000719    05 PM107-OH-UNT-QTY              PIC 9(07) VALUE 0.           00073605
000719    05 PM107-ONORD-UNT-QTY-IND       PIC X(01) VALUE SPACES.      00073706
000716    05 PM107-FRST-RCVD-DTE           PIC X(10) VALUE SPACES.      00073805
000716    05 PM107-DONT-SHIP-BEF-DTE       PIC X(10) VALUE SPACES.      00073902
000719    05 PM107-MDSE-HIER-LVL-CDE       PIC 9(01) VALUE 0.           00074010
