      ***********************************************************       00010000
      **                      PMRD123                          **       00020000
      **                     LRECL=300                         **       00030000
      **  THIS COPYBOOK IS THE LAYOUT OF THE EARLY RECEIPTS    **       00040000
      **  NOTIFICATION REPORT EXTRACT FILE                     **       00050000
      ***********************************************************       00060000
       01 PM123-EARLY-REC-FILE.                                         00070000
          05 PM123-GMA-NBR                 PIC X(02) VALUE SPACES.      00080008
          05 PM123-GMM-FIRST-NAME          PIC X(12) VALUE ZEROES.      00090002
          05 PM123-GMM-LAST-NAME           PIC X(18) VALUE ZEROES.      00091002
          05 PM123-DMA-NBR                 PIC X(02) VALUE SPACES.      00100008
          05 PM123-DMM-FIRST-NAME          PIC X(12) VALUE SPACES.      00110002
          05 PM123-DMM-LAST-NAME           PIC X(18) VALUE SPACES.      00111002
          05 PM123-BYR-NBR                 PIC X(03) VALUE SPACES.      00120009
          05 PM123-BUYER-FIRST-NAME        PIC X(12) VALUE SPACES.      00130003
          05 PM123-BUYER-LAST-NAME         PIC X(18) VALUE SPACES.      00131003
          05 PM123-DEPT-NBR                PIC X(04) VALUE SPACES.      00140000
          05 PM123-DEPT-DESC               PIC X(25) VALUE SPACES.      00150000
          05 PM123-MAJ-CL-NBR              PIC X(04) VALUE SPACES.      00160000
          05 PM123-SUB-CL-NBR              PIC X(04) VALUE SPACES.      00170000
          05 PM123-VS-ID                   PIC X(08) VALUE SPACES.      00180000
          05 PM123-VS-NBR                  PIC X(20) VALUE SPACES.      00190000
          05 PM123-VS-DESC                 PIC X(30) VALUE SPACES.      00200000
          05 PM123-SKU                     PIC X(08) VALUE SPACES.      00210000
          05 PM123-SKU-DESC                PIC X(30) VALUE SPACES.      00210106
          05 PM123-DONT-SHIP-BEF-PLS8      PIC X(10) VALUE SPACES.      00211003
          05 PM123-FIRST-RCVD-DATE         PIC X(10) VALUE SPACES.      00212001
          05 PM123-GP-CDE                  PIC X(03) VALUE SPACES.      00212110
          05 PM123-INTR-UPC-ID             PIC S9(9) COMP VALUE +0.     00213007
          05 PM123-UNT-RTL-AMT             PIC S9(7)V99 COMP-3 VALUE +0.00214011
          05 FILLER                        PIC X(30) VALUE SPACES.      00220011
