      ***********************************************************       00010000
      **                      PMRD140                          **       00020002
      **                     LRECL=80                          **       00030002
      ** THIS COPYBOOK IS THE LAYOUT FOR THE VENDOR AD SPACE   **       00040000
      ** COST PER PAGE FILE.                                   **       00040102
      ***********************************************************       00050000
       01  PM140-COST-REC.                                              00140002
           05  PM140-COST-SUNDAY-STD          PIC  9(07).               00150002
           05  FILLER                         PIC  X(01).               00160002
           05  PM140-COST-SUNDAY-TAB          PIC  9(07).               00170002
           05  FILLER                         PIC  X(01).               00180002
           05  PM140-COST-SUNDAY-FLEXI        PIC  9(07).               00190002
           05  FILLER                         PIC  X(01).               00200002
           05  PM140-COST-WEEKEND-STD         PIC  9(07).               00210002
           05  FILLER                         PIC  X(01).               00220002
           05  PM140-COST-WEEKEND-TAB         PIC  9(07).               00230002
           05  FILLER                         PIC  X(01).               00240002
           05  PM140-COST-WEEKEND-FLEXI       PIC  9(07).               00250002
           05  FILLER                         PIC  X(01).               00260002
           05  PM140-COST-MID-WEEK-STD        PIC  9(07).               00270002
           05  FILLER                         PIC  X(01).               00280002
           05  PM140-COST-MID-WEEK-TAB        PIC  9(07).               00290002
           05  FILLER                         PIC  X(01).               00300002
           05  PM140-COST-MID-WEEK-FLEXI      PIC  9(07).               00310002
           05  FILLER                         PIC  X(09).               00320002
