      ***********************************************************       00010000
      **                      PMRD138                          **       00020007
      **                     LRECL=300                         **       00030006
      ** THIS COPYBOOK IS THE LAYOUT FOR THE VENDOR AD SPACE   **       00040003
      ** ASSIGNMENT EXTRACT FILE.                              **       00041003
      ***********************************************************       00050000
       01 PM138-VENDOR-ADSP-REC.                                        00060007
          05 PM138-GMA-NBR                 PIC 9(04) VALUE 0.           00070007
          05 PM138-GMM-FIRST-NM            PIC X(10) VALUE SPACES.      00090007
          05 PM138-GMM-LAST-NM             PIC X(20) VALUE SPACES.      00100007
          05 PM138-DMA-NBR                 PIC 9(04) VALUE 0.           00110007
          05 PM138-DMM-FIRST-NM            PIC X(10) VALUE SPACES.      00120007
          05 PM138-DMM-LAST-NM             PIC X(20) VALUE SPACES.      00130007
          05 PM138-BYR-NBR                 PIC 9(04) VALUE 0.           00140007
          05 PM138-BYR-FIRST-NM            PIC X(10) VALUE SPACES.      00150007
          05 PM138-BYR-LAST-NM             PIC X(20) VALUE SPACES.      00160007
          05 PM138-VND-NBR                 PIC X(10) VALUE SPACES.      00170007
          05 PM138-VND-NM                  PIC X(30) VALUE SPACES.      00180007
          05 PM138-SECTION                 PIC X(08) VALUE SPACES.      00190007
          05 PM138-SECTION-SORT            PIC 9(01) VALUE 0.           00200007
          05 PM138-MDA-SIZE                PIC X(07) VALUE SPACES.      00210007
          05 PM138-MDA-SIZE-SORT           PIC 9(01) VALUE 0.           00220007
          05 PM138-COST-PER-PAGE           PIC 9(07) VALUE 0.           00230007
          05 PM138-AD-EVNT-NBR-TXT         PIC X(10) VALUE SPACES.      00240007
          05 PM138-AD-EVNT-NM              PIC X(20) VALUE SPACES.      00250007
          05 PM138-PROMO-NBR-TXT           PIC X(10) VALUE SPACES.      00260007
          05 PM138-PROMO-NM                PIC X(20) VALUE SPACES.      00270007
          05 PM138-PROMO-STRT-TMST         PIC X(16) VALUE SPACES.      00280007
          05 PM138-PROMO-END-TMST          PIC X(16) VALUE SPACES.      00290007
          05 PM138-MDA-PG-QTY              PIC 9(05) VALUE 0.           00300007
          05 PM138-AD-PG-NBR               PIC 9(03) VALUE 0.           00310007
          05 PM138-AD-PG-SEQ-NBR           PIC 9(03) VALUE 0.           00320007
          05 PM138-AD-SP-CDE               PIC X(04) VALUE SPACES.      00330007
          05 PM138-AD-SP-SIZE              PIC 9V999 VALUE 0.           00340007
          05 PM138-EST-COST                PIC 9(09)V99 VALUE 0.        00350007
          05 FILLER                        PIC X(12) VALUE SPACES.      00360005
