000100***********************************************************       00010000
000200**                      PMRD702                          **       00020003
000300**                     LRECL=250                         **       00030007
      **                ACTUAL LENGTH = 247                    **       00040007
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PROMOTION        **       00050000
000500**  BUSINESS EVENT. (PMKUT072)                           **       00060012
000600***********************************************************       00070000
000700 01  PM702-PROMOTION-RECORD.                                      00080002
000800   05 PM702-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.       00090014
000900   05 PM702-ACTION-CDE               PIC X(01) VALUE SPACES.      00100002
001000   05 PM702-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00110002
001100   05 PM702-PROMO-ID                 PIC 9(10) VALUE ZEROS.       00120014
001200   05 PM702-AD-EVNT-ID               PIC 9(10) VALUE ZEROS.       00130014
001300   05 PM702-PROMO-TYP-CDE            PIC X(02) VALUE SPACES.      00140002
001400   05 PM702-PROMO-NBR-TXT            PIC X(15) VALUE SPACES.      00150002
001500   05 PM702-CPLT-NM                  PIC X(40) VALUE SPACES.      00160002
001600   05 PM702-ABBR-NM                  PIC X(05) VALUE SPACES.      00170002
001700   05 PM702-REG-PROMO-TYP-CDE        PIC X(02) VALUE SPACES.      00180002
001800   05 PM702-SPECIFIC-PROMO-TYP-CDE   PIC X(02) VALUE SPACES.      00190002
001900   05 PM702-STRT-TMST                PIC X(26) VALUE SPACES.      00200002
002000   05 PM702-END-TMST                 PIC X(26) VALUE SPACES.      00210002
         05 PM702-ACT-STRT-TMST            PIC X(26) VALUE SPACES.      00211006
         05 PM702-ACT-END-TMST             PIC X(26) VALUE SPACES.      00212006
         05 PM702-ESL-TOPR-TYP             PIC X(03) VALUE SPACES.      00213008
002100   05 PM702-STAT-CDE                 PIC X(01) VALUE SPACES.      00220002
002200   05 PM702-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00230002
         05 FILLER                         PIC X(03) VALUE SPACES.      00240007
