      ***********************************************************               
      **                      PMRD703                          **               
      **                     LRECL=80                          **               
      **                ACTUAL LENGTH = 79                     **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO PRICE VERSION    **               
      **  BUSINESS EVENT. (PMKUT073)                           **               
      ***********************************************************               
       01  PM703-PRICE-VERSION-RECORD.                                          
         05 PM703-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.               
         05 PM703-ACTION-CDE               PIC X(01) VALUE SPACES.              
         05 PM703-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.              
         05 PM703-PROMO-PRIC-VER-ID        PIC 9(10) VALUE ZEROS.               
         05 PM703-PROMO-ID                 PIC 9(10) VALUE ZEROS.               
         05 PM703-PRIC-VER-ABBR-NM         PIC X(02) VALUE SPACES.              
         05 PM703-STAT-CDE                 PIC X(01) VALUE SPACES.              
         05 PM703-LAST-UPD-TMST            PIC X(26) VALUE SPACES.              
         05 FILLER                         PIC X(01) VALUE SPACES.              
