      ***********************************************************               
      **                      PMRD706                          **               
      **                     LRECL=258                         **               
      **                ACTUAL LENGTH = 258                    **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO PRICING          **               
      **  BUSINESS EVENT. (PMKUT076)                           **               
      ***********************************************************               
       01  PM706-PRICING-RECORD.                                                
         05 PM706-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.               
         05 PM706-ACTION-CDE               PIC X(01) VALUE SPACES.              
         05 PM706-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.              
         05 PM706-PROMO-INTFC-ID           PIC 9(10) VALUE ZEROS.               
         05 PM706-PROMO-INTFC-SUB-ID       PIC 9(10) VALUE ZEROS.               
         05 PM706-PRCG-TYP-CDE             PIC X(03) VALUE SPACES.              
         05 PM706-PROMO-ID                 PIC 9(10) VALUE ZEROS.               
         05 PM706-PROMO-ITM-ID             PIC 9(10) VALUE ZEROS.               
         05 PM706-MDSE-LNE-ID              PIC 9(10) VALUE ZEROS.               
         05 PM706-MDSE-HIER-CDE            PIC X(03) VALUE SPACES.              
         05 PM706-DEPT-NBR                 PIC 9(04) VALUE ZEROS.               
         05 PM706-MAJ-CL-NBR               PIC 9(04) VALUE ZEROS.               
         05 PM706-SUB-CL-NBR               PIC 9(04) VALUE ZEROS.               
         05 PM706-STYLE-ID                 PIC 9(08) VALUE ZEROS.               
         05 PM706-SKU-NBR                  PIC 9(08) VALUE ZEROS.               
         05 PM706-ADV-IND                  PIC X(01) VALUE SPACES.              
         05 PM706-CLRNC-TYP-CDE            PIC X(01) VALUE SPACES.              
         05 PM706-PRICG-AMT                PIC 9(07).9(03)                      
                                                     VALUE ZEROS.               
         05 PM706-GP-QTY                   PIC 9(05) VALUE ZEROS.               
         05 PM706-GP-AMT                   PIC 9(07).99                         
                                                     VALUE ZEROS.               
         05 PM706-THRS-QTY                 PIC 9(05) VALUE ZEROS.               
         05 PM706-THRS-AMT                 PIC 9(07).99                         
                                                     VALUE ZEROS.               
         05 PM706-DISC-AMT                 PIC 9(07).99                         
                                                     VALUE ZEROS.               
         05 PM706-DISC-PCT                 PIC 9(03).9(03)                      
                                                     VALUE ZEROS.               
         05 PM706-RCPT-CMMT-TXT            PIC X(40) VALUE SPACES.              
         05 PM706-BUY-THRS-AMT             PIC 9(07).9(03)                      
                                                     VALUE ZEROS.               
         05 PM706-MUST-BUY-ALL-IND         PIC X(01) VALUE SPACES.              
         05 PM706-RPETG-BWP-IND            PIC X(01) VALUE SPACES.              
         05 PM706-ASSN-LVL-CDE             PIC X(01) VALUE SPACES.              
         05 PM706-ESL-TOPR-TYP             PIC X(03) VALUE SPACES.              
         05 PM706-STAT-CDE                 PIC X(01) VALUE SPACES.              
         05 PM706-LAST-UPD-TMST            PIC X(26) VALUE SPACES.              
