      ***********************************************************       00010000
      **                      PMRD132                          **       00020000
      **                     LRECL=200                         **       00030000
      **  THIS COPYBOOK IS THE EVENT LAYOUT FILE FOR SAS.      **       00040000
      ***********************************************************       00050000
       01 PM132-SAS-EVENT.                                              00060000
          05 PM132-AD-EVNT-ID-NM           PIC X(51) VALUE SPACES.      00070000
          05 FILLER                        PIC X(01) VALUE '|'.         00080000
          05 PM132-EVNT-STRT-TMST.                                      00090002
             10 PM132-EVNT-STRT-TMST-MM    PIC XX       VALUE SPACES.   00100002
             10 FILLER                     PIC X     VALUE '-'.         00110000
             10 PM132-EVNT-STRT-TMST-DD    PIC XX       VALUE SPACES.   00120002
             10 FILLER                     PIC X     VALUE '-'.         00130000
             10 PM132-EVNT-STRT-TMST-YYYY  PIC X(04) VALUE SPACES.      00140002
             10 FILLER                     PIC X     VALUE '-'.         00150000
             10 PM132-EVNT-STRT-TMST-HH24  PIC X(02) VALUE SPACES.      00160002
             10 FILLER                     PIC X     VALUE '.'.         00170000
             10 PM132-EVNT-STRT-TMST-MI    PIC X(02) VALUE SPACES.      00180002
             10 FILLER                     PIC X     VALUE '.'.         00190000
             10 PM132-EVNT-STRT-TMST-SS    PIC X(02) VALUE SPACES.      00200002
          05 FILLER                        PIC X(01) VALUE '|'.         00210000
          05 PM132-EVNT-END-TMST.                                       00220002
             10 PM132-EVNT-END-TMST-MM     PIC XX    VALUE SPACES.      00230002
             10 FILLER                     PIC X     VALUE '-'.         00240000
             10 PM132-EVNT-END-TMST-DD     PIC XX    VALUE SPACES.      00250002
             10 FILLER                     PIC X     VALUE '-'.         00260000
             10 PM132-EVNT-END-TMST-YYYY   PIC X(04) VALUE SPACES.      00270002
             10 FILLER                     PIC X     VALUE '-'.         00280000
             10 PM132-EVNT-END-TMST-HH24   PIC X(02) VALUE SPACES.      00290002
             10 FILLER                     PIC X     VALUE '.'.         00300000
             10 PM132-EVNT-END-TMST-MI     PIC X(02) VALUE SPACES.      00310002
             10 FILLER                     PIC X     VALUE '.'.         00320000
             10 PM132-EVNT-END-TMST-SS     PIC X(02) VALUE SPACES.      00330002
          05 FILLER                        PIC X(01) VALUE '|'.         00340000
          05 PM132-AD-EVNT-NM              PIC X(40) VALUE SPACES.      00350001
          05 FILLER                        PIC X(01) VALUE '|'.         00360000
          05 FILLER                        PIC X(01) VALUE '|'.         00370000
          05 PM132-AD-EVNT-STAT-CDE        PIC X(01) VALUE SPACES.      00380001
          05 FILLER                        PIC X(01) VALUE '|'.         00390001
          05 FILLER                        PIC X(01) VALUE '|'.         00400001
          05 FILLER                        PIC X(01) VALUE '|'.         00410001
