      ****************************************************************          
      * LPS ELIGIBLE UPCS INFORMATION.                               *          
      * ACTUAL RECORD LENGTH IS 6 (TOTAL RECORD LENGTH IS 6).        *          
      ****************************************************************          
       01  PM045-PM-LPS-ELIG-UPCS.                                              
           05 PM045-STR-NBR              PIC  S9(4) COMP VALUE 0.               
           05 PM045-UPC-ID               PIC  S9(9) COMP VALUE 0.               
