      ***********************************************************               
      **                      PMRD169                          **               
      **                     LRECL=373                         **               
      **  THIS COPYBOOK IS THE LAYOUT FOR THE PROMO REPORT FILE**               
      **  THAT WILL BE CREATED AS AN OUTPUT  FILE BY THE       **               
      **  PROGRAM PMKUT642 FOR THE PROMOTIONS THAT HAVE        **               
      **  APPROVED SKU'S WITH MARK UP AND DOWN PRICE CHANGES   **               
      ***********************************************************               
       01 PM169-PROMO-PRIC-CHGS.                                                
          05 PM169-GMA-NBR                 PIC 9(04) VALUE 0.                   
          05 PM169-GMM-FRST-NM             PIC X(20) VALUE SPACES.              
          05 PM169-GMM-LAST-NM             PIC X(30) VALUE SPACES.              
          05 PM169-DMA-NBR                 PIC 9(04) VALUE 0.                   
          05 PM169-DMM-FRST-NM             PIC X(20) VALUE SPACES.              
          05 PM169-DMM-LAST-NM             PIC X(30) VALUE SPACES.              
          05 PM169-BYR-NBR                 PIC 9(04) VALUE 0.                   
          05 PM169-BYR-FRST-NM             PIC X(20) VALUE SPACES.              
          05 PM169-BYR-LAST-NM             PIC X(30) VALUE SPACES.              
          05 PM169-DEPT-NBR                PIC 9(04) VALUE 0.                   
          05 PM169-DEPT-NM                 PIC X(20) VALUE SPACES.              
          05 PM169-SUB-CL-NBR              PIC 9(04) VALUE 0.                   
          05 PM169-GP-CDE                  PIC X(03) VALUE SPACES.              
          05 PM169-SKU-NBR                 PIC 9(08) VALUE 0.                   
          05 PM169-SKU-DESC                PIC X(30) VALUE SPACES.              
          05 PM169-PRCH-TYP-CDE            PIC X(03) VALUE SPACES.              
          05 PM169-EFF-DTE                 PIC X(10) VALUE SPACES.              
          05 PM169-NW-LNE-PRIC-AMT         PIC 9(07)V99 VALUE 0.                
          05 PM169-CURR-LNE-PRIC-AMT       PIC 9(07)V99 VALUE 0.                
          05 PM169-PROMO-ID                PIC 9(10) VALUE 0.                   
          05 PM169-PROMO-NM                PIC X(40) VALUE SPACES.              
          05 PM169-PROMO-ITM-DESC          PIC X(31) VALUE SPACES.              
          05 PM169-PROMO-PRIC-PT-AMT       PIC 9(07)V99 VALUE 0.                
          05 PM169-TIER-PRIC-IND           PIC X(01) VALUE SPACES.              
          05 FILLER                        PIC X(20) VALUE SPACES.              
