      ***********************************************************       00010000
      **                      PMRD115                          **       00020000
      **                     LRECL=80                          **       00030000
      **  THIS COPYBOOK IS THE LAYOUT FOR THE PROMO ID, AD ID  **       00040000
      **  AND REPORT TYPE PASSED.                              **       00050000
      **  USED FOR BUSINESS RULE PRICING EXCEPTION REPORTS.    **       00060000
      ***********************************************************       00070000
       01 PM115-PROMO-RPT-FILE.                                         00080000
          05 PM115-AD-ID                   PIC 9(10) VALUE 0.           00090000
          05 FILLER                        PIC X(01) VALUE SPACES.      00091000
          05 PM115-PROMO-ID                PIC 9(10) VALUE 0.           00091100
          05 FILLER                        PIC X(01) VALUE SPACES.      00091200
          05 PM115-REPORT-TYPE             PIC 9(02) VALUE 0.           00092000
          05 FILLER                        PIC X(56) VALUE SPACES.      00093000
