000100***********************************************************       00010000
000200**                      PMRD109                          **       00020000
000300**                     LRECL=250                         **       00030000
000400**  THIS COPYBOOK IS THE LAYOUT FOR THE EVERYTHING ON    **       00040000
000500**  SALE ALL-SKUS FILE.                                  **       00050000
000600***********************************************************       00060000
000700 01 PM109-ALL-SKUS.                                               00070000
000800    05 PM109-GMM-NBR                 PIC X(02) VALUE SPACES.      00080000
000900    05 PM109-GMM-FIR-NAME            PIC X(12) VALUE SPACES.      00090000
001000    05 PM109-GMM-LAST-NAME           PIC X(18) VALUE SPACES.      00100000
001100    05 PM109-DMM-NBR                 PIC X(02) VALUE SPACES.      00110000
001200    05 PM109-DMM-FIR-NAME            PIC X(12) VALUE SPACES.      00120000
001300    05 PM109-DMM-LAST-NAME           PIC X(18) VALUE SPACES.      00130000
001400    05 PM109-BYR-NBR                 PIC X(03) VALUE SPACES.      00140000
001500    05 PM109-BYR-FIR-NAME            PIC X(12) VALUE SPACES.      00150000
001600    05 PM109-BYR-LAST-NAME           PIC X(18) VALUE SPACES.      00160000
001700    05 PM109-DEPT-NBR                PIC X(03) VALUE SPACES.      00170000
001800    05 PM109-DEPT-DESC               PIC X(25) VALUE SPACES.      00180000
001900    05 PM109-SUB-CL-NBR              PIC 9(04) VALUE 0.           00190000
002000    05 PM109-SKU-NBR                 PIC 9(08) VALUE 0.           00200000
002100    05 PM109-SKU-DESC                PIC X(30) VALUE SPACES.      00210000
002200    05 PM109-UNT-RTL-AMT             PIC 9(07)V9(02) VALUE 0.     00220000
002300    05 PM109-FRST-RCVD-DTE           PIC X(10) VALUE SPACES.      00230000
002400    05 PM109-LAST-RCVD-DTE           PIC X(10) VALUE SPACES.      00240000
002500    05 PM109-DONT-SHIP-BEF-DTE       PIC X(10) VALUE SPACES.      00250000
002600    05 PM109-OH-UNT-QTY              PIC 9(07) VALUE 0.           00260000
002700    05 PM109-YTD-SALES-UNIT-QTY      PIC 9(07) VALUE 0.           00270000
002800    05 PM109-WEB-EXCLUSIVE-IND       PIC X(01) VALUE SPACES.      00280000
002900    05 FILLER                        PIC X(30) VALUE SPACES.      00290000
