000100***********************************************************       00010000
000200**                      PMRD124                          **       00020000
000300**                     LRECL= 400                        **       00030001
000300**                    ACTUAL= 359                        **       00040001
000400**  THIS COPYBOOK IS THE LAYOUT FOR THE EXCEPTION        **       00050000
000500**  PRICING EXTRACT FOR THE NEW PROMO SYSTEM.            **       00060000
000600***********************************************************       00070000
000700 01 PM124-EXCPT-PRCG-EXT.                                         00080000
000701    05 PM124-REC-TYP-CDE             PIC 9(01) VALUE 0.           00090000
000703    05 PM124-AD-EVNT-ID              PIC 9(10) VALUE 0.           00100000
000705    05 PM124-PROMO-ID                PIC 9(10) VALUE 0.           00110000
000707    05 PM124-PROMO-ITM-ID            PIC 9(10) VALUE 0.           00120000
000708    05 PM124-MDSE-SELN-ID            PIC 9(10) VALUE 0.           00130000
000709    05 PM124-MDSE-SELN-LNE-ID        PIC 9(10) VALUE 0.           00140000
000710    05 PM124-MDSE-HIER-CDE           PIC X(03) VALUE SPACES.      00150000
000711    05 PM124-DEPT-NBR                PIC 9(04) VALUE 0.           00160000
000712    05 PM124-MAJ-CL-NBR              PIC 9(04) VALUE 0.           00170000
000713    05 PM124-SUB-CL-NBR              PIC 9(04) VALUE 0.           00180000
000714    05 PM124-VS-ID                   PIC 9(09) VALUE 0.           00190000
000715    05 PM124-SKU-NBR                 PIC 9(08) VALUE 0.           00200000
000716    05 PM124-PRICG-TYP-CDE           PIC X(03) VALUE SPACES.      00210000
000717    05 PM124-PROMO-INTFC-ID          PIC 9(10) VALUE 0.           00220000
000718    05 PM124-PRICG-AMT               PIC 9(07)V9(03) VALUE 0.     00230000
000719    05 PM124-GROUP-QTY               PIC 9(05) VALUE 0.           00240000
000734    05 PM124-STRT-TMST               PIC X(19) VALUE SPACES.      00250000
000735    05 PM124-END-TMST                PIC X(19) VALUE SPACES.      00260000
000736    05 PM124-STR-NBR                 PIC 9(05) VALUE 0.           00270000
000736    05 PM124-AD-EVNT-NM              PIC X(40) VALUE SPACES.      00280000
000736    05 PM124-PROMO-NM                PIC X(40) VALUE SPACES.      00290000
000736    05 PM124-PROMO-ABBR-NM           PIC X(05) VALUE SPACES.      00300000
000736    05 PM124-PROMO-ITM-DESC          PIC X(100) VALUE SPACES.     00310000
000736    05 PM124-MDSE-SELN-DESC          PIC X(20) VALUE SPACES.      00320000
000736    05 PM124-AD-PG-NBR               PIC 9(03) VALUE ZEROES.      00330002
000736    05 PM124-AD-PG-SEQ-NBR           PIC 9(03) VALUE ZEROES.      00340003
000736    05 PM124-AD-SP-CDE               PIC X(04) VALUE SPACES.      00350002
