      ******************************************************************        
      **                   PMRD801                                    **        
      **                                                              **        
      **  THIS COPYBOOK CONTAINS THE WORKING-STORAGE ELEMENTS         **        
      **  REQUIRED BY THE GET DB2 INFO FOR ORACLE PROGRAMS            **        
      **  SUBROUTINE (PMKUT091).                                      **        
      ******************************************************************        
       01  PM801-PARAMETERS.                                                    
           05  PM801-IO-PARMS.                                                  
               10  PM801-FUNCTION-CODE         PIC   X(1).                      
                   88  PM801-GET-ONHAND-QTY                VALUE 'Q'.           
                   88  PM801-NOTHING                       VALUE 'Z'.           
                                                                                
               10  PM801-HIER-LVL-CDE          PIC  X(03)  VALUE SPACES.        
               10  PM801-DEPT-NBR              PIC S9(04)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM801-MCL-NBR               PIC S9(04)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM801-SCL-NBR               PIC S9(04)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM801-VS-ID                 PIC S9(09)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM801-SKU-NBR               PIC S9(08)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM801-RUN-DATE              PIC  X(08)  VALUE SPACES.        
                                                                                
           05  PM801-GET-QTY-OUTPUT-PARMS.                                      
               10  PM801-ONHAND-TABLE        OCCURS 99999 TIMES.                
                   15  PM801-SKU-NBR-OUT     PIC  9(08)  VALUE ZEROS.           
                   15  PM801-ONHAND-QTY      PIC S9(07)V VALUE ZEROS.           
                                                                                
           05  PM801-INDEX                     PIC  9(05)  VALUE ZEROS.         
           05  PM801-SQLCODE                   PIC S9(04)  VALUE ZEROS.         
           05  PM801-ERROR-MESSAGE             PIC  X(80).                      
           05  PM801-RETURN-CODE               PIC  9(01).                      
               88  PM801-SUCCESSFUL-CALL                   VALUE 0.             
               88  PM801-UNSUCCESSFUL-CALL                 VALUE 1.             
