      ***********************************************************               
      **                      PMRD705                          **               
      **                     LRECL=125                         **               
      **                  ACTUAL LENGTH = 124                  **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO ADHOC STORE      **               
      **  LIST BUSINESS EVENT. (PMKUT075)                      **               
      ***********************************************************               
       01  PM705-ADHOC-STR-LST-RECORD.                                          
         05 PM705-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.               
         05 PM705-ACTION-CDE               PIC X(01) VALUE SPACES.              
         05 PM705-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.              
         05 PM705-ADHC-STR-GP-ID           PIC 9(10) VALUE ZEROS.               
         05 PM705-STR-NBR                  PIC 9(05) VALUE ZEROS.               
         05 PM705-STRT-TMST                PIC X(26) VALUE SPACES.              
         05 PM705-END-TMST                 PIC X(26) VALUE SPACES.              
         05 PM705-STAT-CDE                 PIC X(01) VALUE SPACES.              
         05 PM705-LAST-UPD-TMST            PIC X(26) VALUE SPACES.              
         05 FILLER                         PIC X(01) VALUE SPACES.              
