      ***********************************************************               
      **                      PMRD709                          **               
      **                     LRECL=235                         **               
      **                ACTUAL LENGTH = 231                    **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO PRICING STORE    **               
      **  GROUP BUSINESS EVENT. (PMKUT079)                     **               
      ***********************************************************               
       01  PM709-PRICING-STR-GP-RECORD.                                         
         05 PM709-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.               
         05 PM709-ACTION-CDE               PIC X(01) VALUE SPACES.              
         05 PM709-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.              
         05 PM709-PROMO-INTFC-ID           PIC 9(10) VALUE ZEROS.               
         05 PM709-MDSE-LNE-ID              PIC 9(10) VALUE ZEROS.               
         05 PM709-PROMO-PRIC-VER-ID        PIC 9(10) VALUE ZEROS.               
         05 PM709-STR-SELN-TYP-CDE         PIC X(01) VALUE SPACES.              
         05 PM709-STR-SELN-HIER-LVL-CDE    PIC X(02) VALUE SPACES.              
         05 PM709-ADHC-STR-GP-ID           PIC 9(10) VALUE ZEROS.               
         05 PM709-STR-GP-TYP-CDE           PIC X(04) VALUE SPACES.              
         05 PM709-STR-GP-ID                PIC 9(04) VALUE ZEROS.               
         05 PM709-PRNT-OV-STR-SELN-CDE     PIC X(01) VALUE SPACES.              
         05 PM709-PRNT-OV-STR-GP-CDE       PIC 9(04) VALUE ZEROS.               
         05 PM709-PRNT-OV-STR-GP-ID        PIC 9(04) VALUE ZEROS.               
         05 PM709-PRNT-ADHC-STR-GP-ID      PIC 9(10) VALUE ZEROS.               
         05 PM709-STRT-TMST                PIC X(26) VALUE SPACES.              
         05 PM709-END-TMST                 PIC X(26) VALUE SPACES.              
         05 PM709-ACT-STRT-TMST            PIC X(26) VALUE SPACES.              
         05 PM709-ACT-END-TMST             PIC X(26) VALUE SPACES.              
         05 PM709-ESL-TOPR-TYP-CDE         PIC X(03) VALUE SPACES.              
         05 PM709-STAT-CDE                 PIC X(01) VALUE SPACES.              
         05 PM709-LAST-UPD-TMST            PIC X(26) VALUE SPACES.              
         05 FILLER                         PIC X(04) VALUE SPACES.              
