      ******************************************************************        
      **                   PMRD117                                    **        
      **                                                              **        
      **  THIS COPYBOOK CONTAINS THE WORKING-STORAGE ELEMENTS         **        
      **  REQUIRED BY THE GET DB2 INFO FOR ORACLE PROGRAMS            **        
      **  SUBROUTINE (PMKUT117).                                      **        
      ******************************************************************        
       01  PM117-PARAMETERS.                                                    
           05  PM117-IO-PARMS.                                                  
               10  PM117-FUNCTION-CODE         PIC   X(1).                      
                   88  PM117-GET-DESC                      VALUE 'A'.           
                   88  PM117-GET-SIGNS                     VALUE 'B'.           
                   88  PM117-NOTHING                       VALUE 'Z'.           
                                                                                
               10  PM117-SKU-NBR               PIC  S9(8)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM117-MAIN-PROMO-ID         PIC  S9(10) COMP-3               
                                                           VALUE ZEROS.         
               10  PM117-NON-MAIN-PROMO-ID     PIC  S9(10) COMP                 
                                                           VALUE ZEROS.         
                                                                                
           05  PM117-GET-SIGN-DESC-O-PARMS.                                     
               10  PM117-SKU-DESC              PIC  X(30)  VALUE SPACES.        
               10  PM117-UPC-ID                PIC S9(9) COMP VALUE +0.         
           05  PM117-MAIN-SIGN-TABLE-PARMS.                                     
               10  PM117-MAIN-SIGN-TABLE         OCCURS 20000 TIMES.            
                   15 PM117-MAIN-SIGN-NBR      PIC S9(10) COMP-3                
                                                          VALUE ZEROS.          
           05  PM117-NMAIN-SIGN-TABLE-PARMS.                                    
               10  PM117-NON-MAIN-SIGN-TABLE     OCCURS 20000 TIMES.            
                   15  PM117-NON-MAIN-SIGN-NBR   PIC S9(10) COMP-3              
                                                          VALUE ZEROS.          
                                                                                
           05  PM117-MAIN-INDEX                PIC S9(04)  VALUE ZEROS.         
           05  PM117-NON-MAIN-INDEX            PIC S9(04)  VALUE ZEROS.         
           05  PM117-SQLCODE                   PIC S9(04)  VALUE ZEROS.         
           05  PM117-ERROR-MESSAGE             PIC  X(80).                      
           05  PM117-RETURN-CODE               PIC  9(01).                      
               88  PM117-SUCCESSFUL-CALL                   VALUE 0.             
               88  PM117-UNSUCCESSFUL-CALL                 VALUE 1.             
