00001 ****************************************************************  10/18/94
00002 *                                                              *  PMRD009 
00003 * PROMOTIONAL RESULTS EXTRACT RECORD.                          *     LV002
00004 *                                                              *  PMRD009 
00005 * ACTUAL RECORD LENGTH IS 300.                                 *     CL**2
00006 ****************************************************************  PMRD009 
00007 *                                                                 PMRD009 
00008 *                                                                 PMRD009 
00009  01  PM009-PM-RESULTS-REC.                                        PMRD009 
00010      05  PM009-SORT-DATA.                                         PMRD009 
00011          10  PM009-SD-GMM-NBR            PIC  X(02).              PMRD009 
00012          10  PM009-SD-DMM-NBR            PIC  X(02).              PMRD009 
00013          10  PM009-SD-BYR-NBR            PIC  X(03).              PMRD009 
00014          10  PM009-SD-MDSEDP-NBR         PIC  X(3).               PMRD009 
00015          10  PM009-SD-ADEVNT-ID          PIC  X(8).               PMRD009 
00016          10  PM009-SD-PROMO-NBR          PIC  S9(3)V COMP-3.      PMRD009 
00017          10  PM009-SD-ADITEM-NBR         PIC  S9(9)V COMP-3.      PMRD009 
00018          10  PM009-SD-ADITEM-CAT-PG-NBR  PIC  S9(4)   COMP.       PMRD009 
00019          10  PM009-SD-ADITEM-RPT-SEQ-NBR PIC  S9(4)   COMP.       PMRD009 
00020          10  FILLER                      PIC  X(10).              PMRD009 
00021                                                                   PMRD009 
00022      05  PM009-HEADER-DATA.                                       PMRD009 
00023          10 PM009-ADEVNT-NAME            PIC X(15).               PMRD009 
00024          10 PM009-PROMO-NAME             PIC X(15).               PMRD009 
00025          10 PM009-BEG-DTE                PIC X(10).               PMRD009 
00026          10 PM009-END-DTE                PIC X(10).               PMRD009 
00027          10 PM009-BEG-HR-TIME            PIC S9(2)V COMP-3.       PMRD009 
00028          10 PM009-BEG-MIN-TIME           PIC S9(2)V COMP-3.       PMRD009 
00029          10 PM009-END-HR-TIME            PIC S9(2)V COMP-3.       PMRD009 
00030          10 PM009-END-MIN-TIME           PIC S9(2)V COMP-3.       PMRD009 
00031                                                                   PMRD009 
00032      05  PM009-DETAIL-DATA.                                       PMRD009 
00033          10  PM009-ADITEM-DESC           PIC  X(25).              PMRD009 
00034          10  PM009-PRICING-STRATEGY      PIC  X(15).              PMRD009 
00035          10  PM009-CAT-SPC-CDE           PIC  X(04).              PMRD009 
00036          10  PM009-ACTV-MDSE-IND         PIC  X(01).              PMRD009 
00037          10  PM009-PR-RED-IND            PIC  X(01).              PMRD009 
00038                                                                      CL**2
00039      05  PM009-FORECAST-DATA.                                     PMRD009 
00040          10  PM009-FC-BOH-UNIT-QTY       PIC  S9(9) COMP.         PMRD009 
00041          10  PM009-FC-TOT-UNIT-SLD-QTY   PIC  S9(9) COMP.         PMRD009 
00042          10  PM009-FC-MIN-REG-RTL-AMT    PIC  S9(5)V9(2) COMP-3.  PMRD009 
00043          10  PM009-FC-MAX-REG-RTL-AMT    PIC  S9(5)V9(2) COMP-3.  PMRD009 
00044          10  PM009-FC-MIN-PROMO-AMT      PIC  S9(5)V9(2) COMP-3.  PMRD009 
00045          10  PM009-FC-MAX-PROMO-AMT      PIC  S9(5)V9(2) COMP-3.  PMRD009 
00046          10  PM009-FC-TOT-SALE-AMT       PIC  S9(9)V9(2) COMP-3.  PMRD009 
00047          10  PM009-FC-TOT-MD-AMT         PIC  S9(9)V9(2) COMP-3.  PMRD009 
00048          10  PM009-FC-TOT-REG-COST-AMT   PIC  S9(9)V9(2) COMP-3.  PMRD009 
00049          10  PM009-FC-MU-PCT             PIC  S9(2)V9(1) COMP-3.  PMRD009 
00050                                                                   PMRD009 
00051      05  PM009-ACTUAL-RESULTS-DATA.                               PMRD009 
00052          10  PM009-AR-BOH-UNIT-QTY       PIC  S9(9) COMP.         PMRD009 
00053          10  PM009-AR-TOT-UNIT-SLD-QTY   PIC  S9(9) COMP.         PMRD009 
00054          10  PM009-AR-MIN-REG-RTL-AMT    PIC  S9(5)V9(2) COMP-3.  PMRD009 
00055          10  PM009-AR-MAX-REG-RTL-AMT    PIC  S9(5)V9(2) COMP-3.  PMRD009 
00056          10  PM009-AR-MIN-PROMO-AMT      PIC  S9(5)V9(2) COMP-3.  PMRD009 
00057          10  PM009-AR-MAX-PROMO-AMT      PIC  S9(5)V9(2) COMP-3.  PMRD009 
00058          10  PM009-AR-TOT-SALE-AMT       PIC  S9(9)V9(2) COMP-3.  PMRD009 
00059          10  PM009-AR-TOT-MD-AMT         PIC  S9(9)V9(2) COMP-3.  PMRD009 
00060          10  PM009-AR-TOT-REG-COST-AMT   PIC  S9(9)V9(2) COMP-3.  PMRD009 
00061          10  PM009-AR-MU-PCT             PIC  S9(2)V9(1) COMP-3.  PMRD009 
00062          10  PM009-AR-TOT-ADJ-SOLD-QTY   PIC  S9(9) COMP.         PMRD009 
00063          10  PM009-AR-TOT-ADJ-SOLD-AMT   PIC  S9(9)V9(2) COMP-3.  PMRD009 
00064          10  PM009-AR-TOT-ADJ-MD-AMT     PIC  S9(9)V9(2) COMP-3.  PMRD009 
00065                                                                   PMRD009 
00066      05  FILLER                          PIC  X(53).                 CL**2
