      ***********************************************************       00010000
      **                      PMRD114                          **       00020000
      **                     LRECL=80                          **       00030001
      **  THIS COPYBOOK IS THE LAYOUT FOR THE PROMO ID         **       00040000
      **  AND REPORT TYPE PASSED FROM PMKUT114 TO PMKRP130     **       00050000
      **  TO CREATE BUSINESS RULE PRICING EXCEPTION REPORTS.   **       00060000
      ***********************************************************       00070000
       01 PM114-PROMO-RPT-FILE.                                         00080000
          05 PM114-PROMO-ID                PIC 9(10) VALUE 0.           00090000
          05 FILLER                        PIC X(01) VALUE SPACES.      00091002
          05 PM114-REPORT-TYPE             PIC 9(02) VALUE 0.           00100000
          05 FILLER                        PIC X(67) VALUE SPACES.      00110002
