      ******************************************************************        
      **                   PMRD108                                    **        
      **                                                              **        
      **  THIS COPYBOOK CONTAINS THE WORKING-STORAGE ELEMENTS         **        
      **  REQUIRED BY THE GET ORACLE INFO FOR DB2 PROGRAMS            **        
      **  SUBROUTINE (PMKUT119).                                      **        
      ******************************************************************        
       01  PM108-PARAMETERS.                                                    
           05  PM108-IO-PARMS.                                                  
               10  PM108-FUNCTION-CODE         PIC   X(01).                     
                   88  PM108-GET-ADITEM-DESC               VALUE 'Q'.           
                   88  PM108-NOTHING                       VALUE 'Z'.           
                                                                                
               10  PM108-DPT-NBR               PIC  X(04)  VALUE SPACES.        
               10  PM108-LPS-PROMO-ITM-ID      PIC S9(10)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM108-MP-ITM-ID             PIC S9(10)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM108-MP-PROMO-ID           PIC S9(10)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM108-NMP-ITM-ID            PIC S9(10)V COMP-3               
                                                           VALUE ZEROS.         
               10  PM108-NMP-PROMO-ID          PIC S9(10)V COMP-3               
                                                           VALUE ZEROS.         
                                                                                
           05  PM108-GET-AD-DESC-OUT-PARMS.                                     
               10  PM108-LPS-ADITM-DESC        PIC X(100)  VALUE SPACES.        
               10  PM108-MP-ADITM-DESC         PIC X(100)  VALUE SPACES.        
               10  PM108-NMP-ADITM-DESC        PIC X(100)  VALUE SPACES.        
                                                                                
           05  PM108-SQLCODE                   PIC S9(04)  VALUE ZEROS.         
           05  PM108-ERROR-MESSAGE             PIC  X(80).                      
           05  PM108-RETURN-CODE               PIC  9(01).                      
               88  PM108-SUCCESSFUL-CALL                   VALUE 0.             
               88  PM108-UNSUCCESSFUL-CALL                 VALUE 1.             
