      ***********************************************************       00010000
      **                      PMRD133                          **       00020000
      **                     LRECL=200                         **       00030000
      **  THIS COPYBOOK IS THE VEHICLE LAYOUT FILE FOR SAS.    **       00040000
      ***********************************************************       00050000
       01 PM133-SAS-VEHICLE.                                            00060000
          05 PM133-PROMO-ID-NM             PIC X(40) VALUE SPACES.      00070004
          05 FILLER                        PIC X(01) VALUE '|'.         00080000
          05 PM133-VEHICLE-CATEGORY-ID     PIC X(07) VALUE SPACES.      00090000
          05 FILLER                        PIC X(01) VALUE '|'.         00100000
          05 PM133-CAL-ID                  PIC X(07) VALUE SPACES.      00110000
          05 FILLER                        PIC X(01) VALUE '|'.         00120000
          05 PM133-AD-EVNT-ID-NM           PIC X(51) VALUE SPACES.      00130000
          05 FILLER                        PIC X(01) VALUE '|'.         00140000
          05 PM133-PROMO-STRT-TMST.                                     00150000
             10 PM133-PROMO-STRT-TMST-MM   PIC XX    VALUE SPACES.      00160000
             10 FILLER                     PIC X     VALUE '-'.         00170000
             10 PM133-PROMO-STRT-TMST-DD   PIC XX    VALUE SPACES.      00180000
             10 FILLER                     PIC X     VALUE '-'.         00190000
             10 PM133-PROMO-STRT-TMST-YYYY PIC X(04) VALUE SPACES.      00200000
             10 FILLER                     PIC X     VALUE '-'.         00210000
             10 PM133-PROMO-STRT-TMST-HH24 PIC X(02) VALUE SPACES.      00220000
             10 FILLER                     PIC X     VALUE '.'.         00230000
             10 PM133-PROMO-STRT-TMST-MI   PIC X(02) VALUE SPACES.      00240000
             10 FILLER                     PIC X     VALUE '.'.         00250000
             10 PM133-PROMO-STRT-TMST-SS   PIC X(02) VALUE SPACES.      00260000
          05 FILLER                        PIC X(01) VALUE '|'.         00270000
          05 PM133-PROMO-END-TMST.                                      00280000
             10 PM133-PROMO-END-TMST-MM    PIC XX    VALUE SPACES.      00290000
             10 FILLER                     PIC X     VALUE '-'.         00300000
             10 PM133-PROMO-END-TMST-DD    PIC XX    VALUE SPACES.      00310000
             10 FILLER                     PIC X     VALUE '-'.         00320000
             10 PM133-PROMO-END-TMST-YYYY  PIC X(04) VALUE SPACES.      00330000
             10 FILLER                     PIC X     VALUE '-'.         00340000
             10 PM133-PROMO-END-TMST-HH24  PIC X(02) VALUE SPACES.      00350000
             10 FILLER                     PIC X     VALUE '.'.         00360000
             10 PM133-PROMO-END-TMST-MI    PIC X(02) VALUE SPACES.      00370000
             10 FILLER                     PIC X     VALUE '.'.         00380000
             10 PM133-PROMO-END-TMST-SS    PIC X(02) VALUE SPACES.      00390000
          05 FILLER                        PIC X(01) VALUE '|'.         00400000
          05 FILLER                        PIC X(01) VALUE '|'.         00410002
          05 FILLER                        PIC X(01) VALUE '|'.         00420000
          05 FILLER                        PIC X(01) VALUE '|'.         00430000
          05 FILLER                        PIC X(01) VALUE '|'.         00440000
          05 FILLER                        PIC X(01) VALUE '|'.         00450000
          05 FILLER                        PIC X(01) VALUE '|'.         00460000
          05 FILLER                        PIC X(01) VALUE '|'.         00470000
          05 PM133-CHANGE-FLG              PIC X(01) VALUE 'I'.         00480001
