      ***********************************************************       00010000
      **                      PMRD110                          **       00020000
      **                     LRECL=793                         **       00030000
      **  THIS COPYBOOK IS THE LAYOUT OF THE PROMO ITEM        **       00040000
      **  SUMMARY BY AD VERSION BY AD PAGE EXTRACT.            **       00050000
      ** GOES BEFORE AD VERSION ARRAY.                                  00060000
      ***********************************************************       00070000
       01 PM110-PROMO-ITM-SUMM.                                         00080000
          05 PM110-SLS-TYP-CDE             PIC  X(01) VALUE SPACES.     00090000
             88 PM110-ADMN-TIER-PRICG                 VALUE 'A'.        00100000
             88 PM110-SMPL-PRICG                      VALUE 'S'.        00110000
             88 PM110-TIER-PRICG                      VALUE 'T'.        00120000
          05 PM110-VER-PRICES              PIC  X(01) VALUE SPACES.     00130000
          05 PM110-AD-EVNT-ID              PIC  9(10) VALUE ZEROES.     00140000
          05 PM110-AD-EVNT-NM              PIC  X(40) VALUE SPACES.     00150000
          05 PM110-AD-EVNT-NBR-TXT         PIC  X(15) VALUE SPACES.     00160000
          05 PM110-AD-EVNT-STRT-TMST       PIC  X(19) VALUE SPACES.     00170000
          05 PM110-AD-EVNT-END-TMST        PIC  X(19) VALUE SPACES.     00180000
          05 PM110-PROMO-ID                PIC  9(10) VALUE ZEROES.     00190000
          05 PM110-PROMO-TYP-CDE           PIC  X(02) VALUE SPACES.     00200000
          05 PM110-PROMO-REG-TYP-CDE       PIC  X(02) VALUE SPACES.     00210000
          05 PM110-PROMO-NM                PIC  X(40) VALUE SPACES.     00220000
          05 PM110-PROMO-ABBR-NM           PIC  X(05) VALUE SPACES.     00230000
          05 PM110-PROMO-STRT-TMST         PIC  X(19) VALUE SPACES.     00240000
          05 PM110-PROMO-END-TMST          PIC  X(19) VALUE SPACES.     00250000
          05 PM110-PROMO-STRT-DTE          PIC  X(10) VALUE SPACES.     00260000
          05 PM110-PROMO-END-DTE           PIC  X(10) VALUE SPACES.     00270000
          05 PM110-GMA-NBR                 PIC  9(04) VALUE ZEROES.     00280000
          05 PM110-GMA-FRST-NM             PIC  X(40) VALUE SPACES.     00290000
          05 PM110-GMA-LAST-NM             PIC  X(40) VALUE SPACES.     00300000
          05 PM110-DMA-NBR                 PIC  9(04) VALUE ZEROES.     00310000
          05 PM110-DMA-FRST-NM             PIC  X(40) VALUE SPACES.     00320000
          05 PM110-DMA-LAST-NM             PIC  X(40) VALUE SPACES.     00330000
          05 PM110-BYR-NBR                 PIC  9(04) VALUE ZEROES.     00340000
          05 PM110-BYR-FRST-NM             PIC  X(40) VALUE SPACES.     00350000
          05 PM110-BYR-LAST-NM             PIC  X(40) VALUE SPACES.     00360000
          05 PM110-DEPT-NBR                PIC  9(04) VALUE ZEROES.     00370000
          05 PM110-DEPT-NM                 PIC  X(20) VALUE SPACES.     00380000
          05 PM110-PROMO-ITM-ID            PIC  9(10) VALUE ZEROES.     00390000
          05 PM110-PROMO-ITM-DESC          PIC  X(50) VALUE SPACES.     00400000
          05 PM110-PROMO-ITM-ADV-IND       PIC  X(01) VALUE SPACES.     00410000
          05 PM110-PROMO-ITM-STRT-TMST     PIC  X(19) VALUE SPACES.     00420000
          05 PM110-PROMO-ITM-END-TMST      PIC  X(19) VALUE SPACES.     00430000
          05 PM110-AD-PG-NBR               PIC  9(03) VALUE ZEROES.     00440000
          05 PM110-AD-SP-CDE               PIC  X(04) VALUE SPACES.     00450000
          05 PM110-AD-PG-SEQ-NBR           PIC  9(03) VALUE 0.          00460000
                                                                        00470000
          05 PM110-PRICG-REC.                                           00480000
             10 PM110-TOTAL-SLS            PIC S9(08)V9(02) COMP-3      00490000
                                                     VALUE +0.          00500000
             10 PM110-AVG-TOTAL-SLS        PIC S9(03)V9(02) COMP-3      00510000
                                                      VALUE +0.         00520000
             10 PM110-PRT-VER-ABBR-NM-1    PIC  X(02) VALUE SPACES.     00530000
             10 PM110-VER-SLS-1            PIC S9(08)V9(02) COMP-3      00540000
                                                      VALUE +0.         00550000
             10 PM110-AVG-SLS-1            PIC S9(03)V9(02) COMP-3      00560000
                                                      VALUE +0.         00570000
             10 PM110-PERC-TO-CORE-1       PIC S9(04)V9(01) COMP-3      00580000
                                                      VALUE +0.         00590000
             10 PM110-PRT-VER-ABBR-NM-2    PIC  X(02) VALUE SPACES.     00600000
             10 PM110-VER-SLS-2            PIC S9(08)V9(02) COMP-3      00610000
                                                      VALUE +0.         00620000
             10 PM110-AVG-SLS-2            PIC S9(03)V9(02) COMP-3      00630000
                                                      VALUE +0.         00640000
             10 PM110-PERC-TO-CORE-2       PIC S9(04)V9(01) COMP-3      00650000
                                                      VALUE +0.         00660000
             10 PM110-PRT-VER-ABBR-NM-3    PIC  X(02) VALUE SPACES.     00670000
             10 PM110-VER-SLS-3            PIC S9(08)V9(02) COMP-3      00680000
                                                      VALUE +0.         00690000
             10 PM110-AVG-SLS-3            PIC S9(03)V9(02) COMP-3      00700000
                                                      VALUE +0.         00710000
             10 PM110-PERC-TO-CORE-3       PIC S9(04)V9(01) COMP-3      00720000
                                                      VALUE +0.         00730000
             10 PM110-PRT-VER-ABBR-NM-4    PIC  X(02) VALUE SPACES.     00740000
             10 PM110-VER-SLS-4            PIC S9(08)V9(02) COMP-3      00750000
                                                      VALUE +0.         00760000
             10 PM110-AVG-SLS-4            PIC S9(03)V9(02) COMP-3      00770000
                                                      VALUE +0.         00780000
             10 PM110-PERC-TO-CORE-4       PIC S9(04)V9(01) COMP-3      00790000
                                                      VALUE +0.         00800000
             10 PM110-PRT-VER-ABBR-NM-5    PIC  X(02) VALUE SPACES.     00810000
             10 PM110-VER-SLS-5            PIC S9(08)V9(02) COMP-3      00820000
                                                      VALUE +0.         00830000
             10 PM110-AVG-SLS-5            PIC S9(03)V9(02) COMP-3      00840000
                                                      VALUE +0.         00850000
             10 PM110-PERC-TO-CORE-5       PIC S9(04)V9(01) COMP-3      00860000
                                                      VALUE +0.         00870000
             10 PM110-PRT-VER-ABBR-NM-6    PIC  X(02) VALUE SPACES.     00880000
             10 PM110-VER-SLS-6            PIC S9(08)V9(02) COMP-3      00890000
                                                      VALUE +0.         00900000
             10 PM110-AVG-SLS-6            PIC S9(03)V9(02) COMP-3      00910000
                                                      VALUE +0.         00920000
             10 PM110-PERC-TO-CORE-6       PIC S9(04)V9(01) COMP-3      00930000
                                                      VALUE +0.         00940000
             10 PM110-PRT-VER-ABBR-NM-7    PIC  X(02) VALUE SPACES.     00950000
             10 PM110-VER-SLS-7            PIC S9(08)V9(02) COMP-3      00960000
                                                      VALUE +0.         00970000
             10 PM110-AVG-SLS-7            PIC S9(03)V9(02) COMP-3      00980000
                                                      VALUE +0.         00990000
             10 PM110-PERC-TO-CORE-7       PIC S9(04)V9(01) COMP-3      01000000
                                                      VALUE +0.         01010000
             10 PM110-PRT-VER-ABBR-NM-8    PIC  X(02) VALUE SPACES.     01020000
             10 PM110-VER-SLS-8            PIC S9(08)V9(02) COMP-3      01030000
                                                      VALUE +0.         01040000
             10 PM110-AVG-SLS-8            PIC S9(03)V9(02) COMP-3      01050000
                                                      VALUE +0.         01060000
             10 PM110-PERC-TO-CORE-8       PIC S9(04)V9(01) COMP-3      01070000
                                                      VALUE +0.         01080000
          05 PM110-TIER-PRICG-REC.                                      01090000
             10 PM110-TIER-THRS-AMT        PIC S9(08)V9(02) COMP-3.     01100000
             10 PM110-TIER-DISC-PCT        PIC S9(03)V9(03) COMP-3.     01110000
             10 PM110-TIER-DISC-AMT        PIC S9(08)V9(02) COMP-3.     01120000
             10 PM110-TIER-THRS-QTY        PIC  9(05).                  01130000
             10 PM110-TIER-PRICG-GP-TIER-ID  PIC  9(10).                01140002
             10 PM110-TIER-RCPT-CMMT-TXT   PIC  X(40).                  01150000
             10 PM110-TIER-PRICG-TYP-CDE   PIC  X(03).                  01160000
             10 PM110-TIER-PROMO-NM        PIC  X(05).                  01170001
                                                                        01180000
          05 PM110-AD-VERSION-ARRAY.                                    01190000
             10 FILLER                     OCCURS 15 TIMES              01200000
                                           INDEXED BY AD-VER-INDX.      01210000
                15 PM110-AD-VERSION        PIC  X(02) VALUE SPACES.     01220000
