      ***********************************************************       00010000
      **                      PMRD131                          **       00020000
      **                     LRECL=200                         **       00030000
      **  THIS COPYBOOK IS THE CLRNC LAYOUT FOR INPUT INTO     **       00040001
      **  PXXXXXXX TO IDENTIFY THE REGULAR PRICE AND TICKET    **       00050002
      **  COLOR.                                               **       00060001
      ***********************************************************       00070000
       01 PM131-SAS-CLRNC-PRICE.                                        00080001
          05 PM131-LOC-NBR                 PIC 9(05) VALUE 0.           00090008
          05 FILLER                        PIC X(01) VALUE '|'.         00100004
          05 PM131-DEPT-NBR                PIC 9(04) VALUE 0.           00110007
          05 FILLER                        PIC X(01) VALUE '|'.         00120007
          05 PM131-MAJ-CL-NBR              PIC 9(04) VALUE 0.           00130007
          05 FILLER                        PIC X(01) VALUE '|'.         00140007
          05 PM131-SUB-CL-NBR              PIC 9(04) VALUE 0.           00150007
          05 FILLER                        PIC X(01) VALUE '|'.         00160004
          05 PM131-STRT-TMST.                                           00170000
             10 PM131-STRT-TMST-MM         PIC XX    VALUE SPACES.      00180000
             10 FILLER                     PIC X     VALUE '-'.         00190000
             10 PM131-STRT-TMST-DD         PIC XX    VALUE SPACES.      00200000
             10 FILLER                     PIC X     VALUE '-'.         00210000
             10 PM131-STRT-TMST-YYYY       PIC X(04) VALUE SPACES.      00220000
             10 FILLER                     PIC X     VALUE '-'.         00230000
             10 PM131-STRT-TMST-HH24       PIC X(02) VALUE SPACES.      00240000
             10 FILLER                     PIC X     VALUE '.'.         00250000
             10 PM131-STRT-TMST-MI         PIC X(02) VALUE SPACES.      00260000
             10 FILLER                     PIC X     VALUE '.'.         00270000
             10 PM131-STRT-TMST-SS         PIC X(02) VALUE SPACES.      00280000
          05 FILLER                        PIC X(01) VALUE '|'.         00290004
          05 PM131-END-TMST.                                            00300000
             10 PM131-END-TMST-MM          PIC XX    VALUE SPACES.      00310000
             10 FILLER                     PIC X     VALUE '-'.         00320000
             10 PM131-END-TMST-DD          PIC XX    VALUE SPACES.      00330000
             10 FILLER                     PIC X     VALUE '-'.         00340000
             10 PM131-END-TMST-YYYY        PIC X(04) VALUE SPACES.      00350000
             10 FILLER                     PIC X     VALUE '-'.         00360000
             10 PM131-END-TMST-HH24        PIC X(02) VALUE SPACES.      00370000
             10 FILLER                     PIC X     VALUE '.'.         00380000
             10 PM131-END-TMST-MI          PIC X(02) VALUE SPACES.      00390000
             10 FILLER                     PIC X     VALUE '.'.         00400000
             10 PM131-END-TMST-SS          PIC X(02) VALUE SPACES.      00410000
          05 FILLER                        PIC X(01) VALUE '|'.         00420004
          05 PM131-CLRNC-PRICG-TYP-CDE     PIC X(03) VALUE SPACES.      00430001
          05 FILLER                        PIC X(01) VALUE '|'.         00440004
          05 PM131-CLRNC-PRICG-AMT         PIC 9(07).999 VALUE ZEROES.  00450006
          05 FILLER                        PIC X(01) VALUE '|'.         00460004
          05 PM131-CLRNC-TYP-CDE           PIC X(01) VALUE SPACES.      00470001
          05 FILLER                        PIC X(01) VALUE '|'.         00480004
