      ***********************************************************       00010000
      **                      PMRD700                          **       00020000
      **                     LRECL=15                          **       00030000
      **                  ACTUAL LENGTH = 15                   **       00040000
      **  THIS COPYBOOK IS USED FOR THE TOTAL ROW IN THE       **       00050000
      **  INTEGRITY PROCESS FLOW.                              **       00060000
      ***********************************************************       00070000
       01  PM700-TOTAL-RECORD.                                          00080000
         05 PM700-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00090000
         05 PM700-ACTION-CDE               PIC X(01) VALUE 'T'.         00100000
         05 PM700-TOTAL-NBR-OF-RECS        PIC 9(11) VALUE ZERO.        00110000
