      ***********************************************************               
      **                      PMRD708                          **               
      **                     LRECL=130                         **               
      **                ACTUAL LENGTH = 128                    **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO PRICING EXCLUSION**               
      **  BUSINESS EVENT. (PMKUT078)                           **               
      ***********************************************************               
       01  PM708-PRICING-EXCLSNS-RECORD.                                        
         05 PM708-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.               
         05 PM708-ACTION-CDE               PIC X(01) VALUE SPACES.              
         05 PM708-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.              
         05 PM708-PROMO-INTFC-ID           PIC 9(10) VALUE ZEROS.               
         05 PM708-PROMO-INTFC-SUB-ID       PIC 9(10) VALUE ZEROS.               
         05 PM708-MDSE-LNE-ID              PIC 9(10) VALUE ZEROS.               
         05 PM708-MDSE-LNE-EXCLN-ID        PIC 9(10) VALUE ZEROS.               
         05 PM708-MDSE-HIER-CDE            PIC X(03) VALUE SPACES.              
         05 PM708-DEPT-NBR                 PIC 9(04) VALUE ZEROS.               
         05 PM708-MAJ-CL-NBR               PIC 9(04) VALUE ZEROS.               
         05 PM708-SUB-CL-NBR               PIC 9(04) VALUE ZEROS.               
         05 PM708-STYLE-ID                 PIC 9(08) VALUE ZEROS.               
         05 PM708-SKU-NBR                  PIC 9(08) VALUE ZEROS.               
         05 PM708-STAT-CDE                 PIC X(01) VALUE SPACES.              
         05 PM708-LAST-UPD-TMST            PIC X(26) VALUE SPACES.              
