      ***********************************************************       00010000
      **                      PMRD129                          **       00020000
      **                -------SAS-----------                  **       00030004
      **  THIS COPYBOOK IS THE LAYOUT FOR THE SAS PROOF OF     **       00040000
      **  VALUE PROJECT.  STG_PROMOTION TABLE                  **       00050000
      ***********************************************************       00060000
       01 PM129-SAS-PROMOTION.                                          00070006
      *STG_PROMOTION.DEPT_ID                                            00080012
          05 PM129-DEPT-NBR                PIC 9(04) VALUE 0.           00090012
          05 FILLER                        PIC X(01) VALUE '|'.         00100001
      *STG_PROMOTION.CLASS_ID                                           00110012
          05 PM129-MAJ-CL-NBR              PIC 9(04) VALUE 0.           00120012
          05 FILLER                        PIC X(01) VALUE '|'.         00130012
      *STG_PROMOTION.SUBCLASS_ID                                        00140012
          05 PM129-SUB-CL-NBR              PIC 9(04) VALUE 0.           00150012
          05 FILLER                        PIC X(01) VALUE '|'.         00160012
      *STG_PROMOTION.GEO_ID                                             00170000
          05 PM129-LOC-NBR                 PIC 9(05) VALUE 0.           00180000
          05 FILLER                        PIC X(01) VALUE '|'.         00190001
      *STG_PROMOTION.VEHICLE_NM                                         00200003
          05 PM129-PROMO-ID-NAME           PIC X(25) VALUE SPACES.      00210007
          05 FILLER                        PIC X(01) VALUE '|'.         00220001
      *STG_PROMOTION.START_DT                                           00230000
          05 PM129-PROMO-STRT-DATE.                                     00240000
             10 PM129-STRT-TMST-MM         PIC XX    VALUE SPACES.      00250003
             10 FILLER                     PIC X     VALUE '-'.         00260003
             10 PM129-STRT-TMST-DD         PIC XX    VALUE SPACES.      00270003
             10 FILLER                     PIC X     VALUE '-'.         00280003
             10 PM129-STRT-TMST-YYYY       PIC X(04) VALUE SPACES.      00290003
             10 FILLER                     PIC X     VALUE '-'.         00300003
             10 PM129-STRT-TMST-HH24       PIC X(02) VALUE SPACES.      00310003
             10 FILLER                     PIC X     VALUE '.'.         00320003
             10 PM129-STRT-TMST-MI         PIC X(02) VALUE SPACES.      00330003
             10 FILLER                     PIC X     VALUE '.'.         00340003
             10 PM129-STRT-TMST-SS         PIC X(02) VALUE SPACES.      00350003
          05 FILLER                        PIC X(01) VALUE '|'.         00360001
      *STG_PROMOTION.SOURCE_SYSTEM_CD                                   00370000
          05 FILLER                        PIC X(01) VALUE '|'.         00380001
      *STG_PROMOTION.END_DT                                             00390000
          05 PM129-PROMO-END-DATE.                                      00400000
             10 PM129-END-TMST-MM          PIC XX    VALUE SPACES.      00410003
             10 FILLER                     PIC X     VALUE '-'.         00420003
             10 PM129-END-TMST-DD          PIC XX    VALUE SPACES.      00430003
             10 FILLER                     PIC X     VALUE '-'.         00440003
             10 PM129-END-TMST-YYYY        PIC X(04) VALUE SPACES.      00450003
             10 FILLER                     PIC X     VALUE '-'.         00460003
             10 PM129-END-TMST-HH24        PIC X(02) VALUE SPACES.      00470003
             10 FILLER                     PIC X     VALUE '.'.         00480003
             10 PM129-END-TMST-MI          PIC X(02) VALUE SPACES.      00490003
             10 FILLER                     PIC X     VALUE '.'.         00500003
             10 PM129-END-TMST-SS          PIC X(02) VALUE SPACES.      00510003
          05 FILLER                        PIC X(01) VALUE '|'.         00520001
      *STG_PROMOTION.EVENT_NM                                           00530003
          05 FILLER                        PIC X(01) VALUE '|'.         00540011
