      ***********************************************************               
      **                      PMRD065                          **               
      **                     LRECL= 160                        **               
      **                  ACTUAL LENGTH = 148                  **               
      **  THIS COPYBOOK IS USED FOR NEW PROMO REBATE FORM      **               
      **  LIST BUSINESS EVENT. (PMKUT065)                      **               
      ***********************************************************               
       01  PM065-REBT-FORM-RECORD.                                              
         05 PM065-BUSINESS-EVNT-ID           PIC 9(03) VALUE ZEROS.             
         05 PM065-ACTION-CDE                 PIC X(01) VALUE SPACES.            
         05 PM065-REBT-PROMO-ID              PIC 9(10) VALUE ZEROS.             
         05 PM065-REBT-FM-ID                 PIC 9(10) VALUE ZEROS.             
         05 PM065-MDSE-SELN-SEQ-NBR          PIC 9(10) VALUE ZEROS.             
         05 PM065-INCTV-PROMO-INTFC-ID       PIC 9(10) VALUE ZEROS.             
         05 PM065-FM-SECT-TYP-CDE            PIC X(03) VALUE SPACES.            
         05 PM065-FM-LNE-TYP-CDE             PIC X(03) VALUE SPACES.            
         05 PM065-FM-LNE-NBR                 PIC 9(03) VALUE ZEROS.             
         05 PM065-EFF-END-TMST               PIC X(26) VALUE SPACES.            
         05 PM065-FM-TXT                     PIC X(42) VALUE SPACES.            
         05 PM065-STAT-CDE                   PIC X(01) VALUE SPACES.            
         05 PM065-LAST-UPD-TMST              PIC X(26) VALUE SPACES.            
         05 FILLER                           PIC X(12) VALUE SPACES.            
