000100***********************************************************       00010000
000200**                      PMRD122                          **       00020000
000300**                     LRECL=80                          **       00030000
000400**  THIS COPYBOOK IS THE LAYOUT OF THE PROMO ID FILES    **       00040000
000500**  FOR THE LPS REPORTS.                                 **       00050000
000600***********************************************************       00060000
000700 01 PM122-PROMO-ID-REC.                                           00070000
000701    05 PM122-RUN-DTE.                                             00070102
000702       10 PM122-RUN-DTE-CCYY         PIC X(04) VALUE SPACES.      00070202
000703       10 PM122-RUN-DTE-MM           PIC X(02) VALUE SPACES.      00070302
000704       10 PM122-RUN-DTE-DD           PIC X(02) VALUE SPACES.      00070402
000705    05 FILLER                        PIC X(01) VALUE SPACES.      00070501
000706    05 PM122-PROMO-ID                PIC 9(10) VALUE 0.           00070601
000707    05 FILLER                        PIC X(01) VALUE SPACES.      00070700
000708    05 PM122-PROMO-TYP-IND           PIC X(01) VALUE SPACES.      00070801
000709    05 FILLER                        PIC X(01) VALUE SPACES.      00070900
000710    05 PM122-HIST-FUT-IND            PIC X(01) VALUE SPACES.      00071001
000720    05 FILLER                        PIC X(57) VALUE SPACES.      00072001
