      ***********************************************************       00010002
      **                      PMRD701                          **       00020003
      **                     LRECL=175                         **       00030004
      **                  ACTUAL LENGTH = 174                  **       00040001
      **  THIS COPYBOOK IS USED FOR NEW PROMO ADEVENT BUSINESS **       00050002
      **  EVENT. (PMKUT071)                                    **       00060008
      ***********************************************************       00070002
       01  PM701-ADEVENT-RECORD.                                        00080003
         05 PM701-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZEROS.       00090010
         05 PM701-ACTION-CDE               PIC X(01) VALUE SPACES.      00100003
         05 PM701-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00110003
         05 PM701-AD-EVNT-ID               PIC 9(10) VALUE ZEROS.       00120010
         05 PM701-AD-EVNT-NBR-TXT          PIC X(15) VALUE SPACES.      00130003
         05 PM701-CPLT-NM                  PIC X(40) VALUE SPACES.      00140003
         05 PM701-STRT-DTE                 PIC X(26) VALUE SPACES.      00150003
         05 PM701-END-DTE                  PIC X(26) VALUE SPACES.      00160003
         05 PM701-STAT-CDE                 PIC X(01) VALUE SPACES.      00170003
         05 PM701-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00180003
         05 FILLER                         PIC X(01) VALUE SPACES.      00190005
