00001                                                                   04/05/94
00002 ***************************************************************   PMWS235 
00003 *   USED FOR LOWEST PRICE IN THE LAST 6 WEEKS                 *      LV001
00004 ***************************************************************   PMWS235 
00005  01  PLU-MASTER.                                                  PMWS235 
00006                                                                   PMWS235 
00007      05  PLUMAST-PRIMKEY-ALTKEY.                                  PMWS235 
00008          10  PLUMAST-ALTKEY.                                      PMWS235 
00009              15  PLUMAST-ADNUM           PIC X(10).               PMWS235 
00010 *                                    AD EVENT NUMBER              PMWS235 
00011                                                                   PMWS235 
00012              15  PLUMAST-DEPTNO          PIC 9(3).                PMWS235 
00013 *                                    DEPARTMENT NUMBER            PMWS235 
00014                                                                   PMWS235 
00015              15  PLUMAST-CLASSNO         PIC X(3).                PMWS235 
00016 *                                    CLASS NUMBER                 PMWS235 
00017 *                               (RIGHT MOST DIGIT IS ALWAYS 0)    PMWS235 
00018                                                                   PMWS235 
00019              15  FILLER REDEFINES PLUMAST-CLASSNO.                PMWS235 
00020                  20  PLUMAST-CLASSNBR    PIC XX.                  PMWS235 
00021                  20  FILLER              PIC X.                   PMWS235 
00022                                                                   PMWS235 
00023              15  PLUMAST-SKUNO.                                   PMWS235 
00024                  20  PLUMAST-SKUVEND     PIC X(3).                PMWS235 
00025 *                                    INHOUSE VENDOR NUMBER        PMWS235 
00026                                                                   PMWS235 
00027                  20  PLUMAST-SKU5.                                PMWS235 
00028                      25  PLUMAST-SKUSTYL  PIC X(4).               PMWS235 
00029 *                                    SKU STYLE NUMBER             PMWS235 
00030                                                                   PMWS235 
00031                      25  PLUMAST-SKUCKDG  PIC X(1).               PMWS235 
00032 *                                    SKU CHECK DIGIT              PMWS235 
00033                                                                   PMWS235 
00034                                                                   PMWS235 
00035              15  FILLER REDEFINES PLUMAST-SKUNO.                  PMWS235 
00036                  20  FILLER              PIC X(4).                PMWS235 
00037 *                                    MUST BE ZERO FOR             PMWS235 
00038 *                                    TYPE 1 PLU TRANSACTION       PMWS235 
00039                  20  PLUMAST-SEQNO       PIC X(3).                PMWS235 
00040 *                                    SEQUENCE NUMBER              PMWS235 
00041                  20  FILLER              PIC X(1).                PMWS235 
00042                                                                   PMWS235 
00043              15  PLUMAST-STORNO          PIC X(3).                PMWS235 
00044 *                                    SALE STORE NUMBER            PMWS235 
00045                  88  PLUMAST-ALL-STORES     VALUE 'ALL'.          PMWS235 
00046                  88  PLUMAST-STORE-ONLY                           PMWS235 
00047                                         VALUE '001' THRU '999'.   PMWS235 
00048                  88  PLUMAST-DISTRICT-ONLY                        PMWS235 
00049                                         VALUE 'DET' 'ILL' 'IND'   PMWS235 
00050                                               'MCH' 'MIN' 'OHO'   PMWS235 
00051                                               'WIS' 'IOW'.        PMWS235 
00052                                                                   PMWS235 
00053              15  PLUMAST-RECTYPE         PIC X.                   PMWS235 
00054 *                                    PLU RECORD TYPE              PMWS235 
00055                  88  PLUMAST-ORIGINAL    VALUE SPACE.             PMWS235 
00056                  88  PLUMAST-EXPANDED    VALUE 'E'.               PMWS235 
00057                                                                   PMWS235 
00058          10  FILLER                  PIC X(10).                   PMWS235 
00059      05  FILLER REDEFINES PLUMAST-PRIMKEY-ALTKEY.                 PMWS235 
00060          10  FILLER                      PIC X(10).               PMWS235 
00061                                                                   PMWS235 
00062          10  PLUMAST-PRIMKEY.                                     PMWS235 
00063              15  FILLER                  PIC X(18).               PMWS235 
00064              15  PLUMAST-ADNUM-PRIM      PIC X(10).               PMWS235 
00065 *                                    AD EVENT NUMBER              PMWS235 
00066 *                                    USED FOR PRIMARY KEY         PMWS235 
00067                                                                   PMWS235 
00068      05  PLUMAST-DOCNO           PIC 9(5).                        PMWS235 
00069 *                                PLU PRICE CHANGE                 PMWS235 
00070 *                                DOCUMENT NUMBER                  PMWS235 
00071                                                                   PMWS235 
00072      05  PLUMAST-BATCHNO         PIC 9(3).                        PMWS235 
00073 *                                PLU BATCH NUMBER FOR DATA ENTRY  PMWS235 
00074                                                                   PMWS235 
00075      05  PLUMAST-TYPECD              PIC X.                       PMWS235 
00076 *                                    SALE TYPE CODE               PMWS235 
00077                                                                   PMWS235 
00078          88  PLUMAST-SALE-PRICE-TYPE VALUE '1'.                   PMWS235 
00079          88  PLUMAST-PERCENT-TYPE    VALUE '2'.                   PMWS235 
00080                                                                   PMWS235 
00081      05  PLUMAST-LINENO              PIC 9(2).                    PMWS235 
00082 *                                    LINE NUMBER ON               PMWS235 
00083 *                                    PLU PRICE CHANGE DOCUMENT    PMWS235 
00084                                                                   PMWS235 
00085          88  PLUMAST-VALID-LINENO    VALUES ARE 01 THRU 10.       PMWS235 
00086                                                                   PMWS235 
00087      05  PLUMAST-REASNCD               PIC X.                     PMWS235 
00088 *                                      SALE REASON CODE           PMWS235 
00089                                                                   PMWS235 
00090          88  PLUMAST-ADVERTISING-SALE  VALUE '1'.                 PMWS235 
00091          88  PLUMAST-OTHERS-SALE       VALUE '5'.                 PMWS235 
00092                                                                   PMWS235 
00093      05  PLUMAST-RETLPRC         PIC S9(4)V99   COMP-3.           PMWS235 
00094 *                                RETAIL (REGULAR) PRICE           PMWS235 
00095 *                                FOR THIS DEPT/CLASS/SKU          PMWS235 
00096 *                                REQUIRED FOR TYPE 1 PLU          PMWS235 
00097 *                                TRANSACTION MUST BE ZERO         PMWS235 
00098 *                                FOR TYPE 2 PLU TRANSACTION       PMWS235 
00099                                                                   PMWS235 
00100      05  PLUMAST-SALEPRC         PIC S9(4)V99   COMP-3.           PMWS235 
00101 *                                SALE PRICE                       PMWS235 
00102 *                                FOR THIS DEPT/CLASS/SKU          PMWS235 
00103 *                                REQUIRED FOR TYPE 1 PLU          PMWS235 
00104 *                                TRANSACTION MUST BE ZERO         PMWS235 
00105 *                                FOR TYPE 2 PLU TRANSACTION       PMWS235 
00106                                                                   PMWS235 
00107      05  PLUMAST-DIFFPRC         PIC S9(4)V99   COMP-3.           PMWS235 
00108 *                                DIFFERENCE BETWEEN               PMWS235 
00109 *                                RETAIL AND SALE PRICE            PMWS235 
00110 *                                (IE. RETAIL PRICE - SALE PRICE)  PMWS235 
00111 *                                REQUIRED FOR TYPE 1 PLU          PMWS235 
00112 *                                TRANSACTION MUST BE ZERO         PMWS235 
00113 *                                FOR TYPE 2 PLU TRANSACTION       PMWS235 
00114 *                                AND MUST MATCH THE CALCULATED    PMWS235 
00115 *                                DIFFERENCE BETWEEN RETAIL        PMWS235 
00116 *                                AND SALE PRICE                   PMWS235 
00117                                                                   PMWS235 
00118      05  PLUMAST-DISCPCT         PIC S99V999    COMP-3.           PMWS235 
00119 *                                SALE DISCOUNT PERCENT OFF        PMWS235 
00120 *                                RETAIL (REGULAR) PRICE           PMWS235 
00121 *                                THIS APPLIES ONLY TO DEPT,       PMWS235 
00122 *                                OR DEPT/CLASS PLU TRANSACTION    PMWS235 
00123 *                                (IE. TYPE 1 PLU TRANSACTION      PMWS235 
00124 *                                 MUST BE ZERO FOR TYPE 1 PLU     PMWS235 
00125 *                                 TRANSACTION)                    PMWS235 
00126                                                                   PMWS235 
00127      05  PLUMAST-REMARKS.                                         PMWS235 
00128 *                                GROUP PRICE FOR A CERTAIN        PMWS235 
00129 *                                  NUMBER OF UNITS AND THE CODE   PMWS235 
00130 *                                  USED FOR THIS COMBINATION      PMWS235 
00131 *                                PLUS                             PMWS235 
00132 *                                BUYERS REMARKS TO                PMWS235 
00133 *                                  STORE MANAGERS                 PMWS235 
00134          10  PLUMAST-GRP-PRICE   PIC S999V99.                     PMWS235 
00135          10  PLUMAST-GRP-UNITS   PIC S99.                         PMWS235 
00136          10  PLUMAST-GRP-CODE    PIC S999.                        PMWS235 
00137          10  PLUMAST-DESCRIPTION PIC X(20).                       PMWS235 
00138                                                                   PMWS235 
00139      05  PLUMAST-PRCCDE          PIC X.                           PMWS235 
00140 *                                PRICE CHANGE TYPE                PMWS235 
00141 *                                FOR MARKDOWN OR MARKUP           PMWS235 
00142 *                                CANCELLATIONS                    PMWS235 
00143          88  PLUMAST-MD          VALUE '1'.                       PMWS235 
00144          88  PLUMAST-MUC         VALUE '2'.                       PMWS235 
00145                                                                   PMWS235 
00146                                                                   PMWS235 
00147      05  PLUMAST-MDAMT           PIC S9(7)V99 COMP-3.             PMWS235 
00148 *                                PLU MARK DOWN AMOUNT             PMWS235 
00149 *                                (SUMMATION OF MARKDOWNS =        PMWS235 
00150 *                                 KEYED RETAIL - KEYED SALE)      PMWS235 
00151                                                                   PMWS235 
00152      05  PLUMAST-MUCAMT          PIC S9(7)V99 COMP-3.             PMWS235 
00153 *                                PLU MARKUP CANCELLATION AMT      PMWS235 
00154 *                           (SUMMATION OF MARKUP CANCELLATION =   PMWS235 
00155 *                                KEYED RETAIL - KEYED SALE)       PMWS235 
00156                                                                   PMWS235 
00157      05  PLUMAST-SALUNIT         PIC S9(5)   COMP-3.              PMWS235 
00158 *                                PLU SALES UNITS                  PMWS235 
00159                                                                   PMWS235 
00160      05  PLUMAST-MDMUC-UNITS     PIC S9(5)   COMP-3.              PMWS235 
00161 *                                PLU MARKUP CANCELLATION/         PMWS235 
00162 *                                MARKDOWN UNITS.                  PMWS235 
00163                                                                   PMWS235 
00164      05  PLUMAST-CRDTE           PIC S9(6)   COMP-3.              PMWS235 
00165 *                                CREATION DATE FOR ORIGINAL       PMWS235 
00166 *                                PLU TRANSACTION.  FIRST ACTIVITY PMWS235 
00167 *                                DATE FOR EXPANDED PLU TRANSACTIONPMWS235 
00168 *                                (IN YYMMDD FORMAT)               PMWS235 
00169                                                                   PMWS235 
00170      05  PLUMAST-MAINDTE         PIC S9(6)   COMP-3.              PMWS235 
00171 *                                LAST MAINTENANCE DATE FOR        PMWS235 
00172 *                                ORIGINAL PLU TRANSACTION.  LAST  PMWS235 
00173 *                                ACTIVITY DATE FOR EXPANDED PLU   PMWS235 
00174 *                                TRANSACTION (IN YYMMDD FORMAT)   PMWS235 
00175                                                                   PMWS235 
00176      05  PLUMAST-STRTDTE         PIC S9(6) COMP-3.                PMWS235 
00177 *                                PLU SALE START DATE              PMWS235 
00178 *                                FOR THIS DEPT/CLASS/SKU          PMWS235 
00179 *                                IN YYMMDD FORMAT                 PMWS235 
00180 *                                MUST BE EQUAL TO OR GREATER      PMWS235 
00181 *                                THAN AD EVENT START DATE AND     PMWS235 
00182 *                                MUST BE LESS THAN OR EQUAL TO    PMWS235 
00183 *                                PLU TRANSACTION SALE END DATE    PMWS235 
00184                                                                   PMWS235 
00185                                                                   PMWS235 
00186      05  PLUMAST-ENDDTE          PIC S9(6) COMP-3.                PMWS235 
00187 *                                PLU SALE END DATE                PMWS235 
00188 *                                FOR THIS DEPT/CLASS/SKU          PMWS235 
00189 *                                IN YYMMDD FORMAT                 PMWS235 
00190 *                                MUST BE EQUAL TO OR LESS THAN    PMWS235 
00191 *                                AD EVENT END DATE AND MUST BE    PMWS235 
00192 *                                GREATER THAN OR EQUAL TO PLU     PMWS235 
00193 *                                TRANSACTION START DATE           PMWS235 
00194                                                                   PMWS235 
00195                                                                   PMWS235 
00196      05  PLUMAST-BONUS              PIC X.                        PMWS235 
00197 *                                   BONUS DAY FLAG                PMWS235 
00198          88  PLUMAST-BONUS-DAY      VALUE 'B'.                    PMWS235 
00199          88  PLUMAST-NON-BONUS-DAY  VALUE 'R'.                    PMWS235 
00200                                                                   PMWS235 
00201                                                                   PMWS235 
00202      05  TOTAL-SALE-DLRS            PIC S9(7)V99  COMP-3.         PMWS235 
00203                                                                   PMWS235 
00204                                                                   PMWS235 
00205      05  PLUMAST-FILECD          PIC X(01).                       PMWS235 
00206          88  PLUMAST-REGULAR-PLU-FILE         VALUE LOW-VALUE.    PMWS235 
00207          88  PLUMAST-PERM-GROUP-FILE          VALUE 'G'.          PMWS235 
00208          88  PLUMAST-EXCEPTION-FILE           VALUE 'E'.          PMWS235 
00209                                                                   PMWS235 
00210      05  FILLER                  PIC X(15).                       PMWS235 
00211                                                                   PMWS235 
00212                                                                   PMWS235 
