*          DATA SET POKM112                                                     
  PRINT  NOGEN                                                          00001**2
************************************************************            00004   
*  BMS MAPSET :  POKM112                                                00005   
*      MAP    :  PO112A                                                 00006   
*      PROGRAM : POKCS112                                               00007*10
*      TRANSID : W112 - INNER PACK INQUIRY (P)                          00008*10
*      SYSTEM  : CICS ARCHITECTURE                                      00009*10
************************************************************            00007   
POKM112 DFHMSD TYPE=&SYSPARM,                                          X00010**2
               LANG=COBOL,                                             X00011**2
               MODE=INOUT,                                             X00012**2
               CTRL=(FREEKB),                                          X00018**2
               TERM=3270-2,                                            X00014**2
               STORAGE=AUTO,                                           X00013**2
               MAPATTS=(COLOR,HILIGHT),                                X00019**2
               DSATTS=(COLOR,HILIGHT),                                 X00020**2
               EXTATT=YES,                                             X00011   
               TIOAPFX=YES                                              00015**2
PO112A  DFHMDI LINE=2,COLUMN=1,                                        X00016**5
               SIZE=(19,80)                                             00017**2
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00024   
               INITIAL='ITEMS:',                                       X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=6,                                               X00027   
               POS=(01,44)                                              00028   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029   
               COLOR=GREEN,                                            X00030   
               HILIGHT=UNDERLINE,                                      X00031   
               PICOUT='ZZZ,ZZ9',                                       X00032   
               LENGTH=7,                                               X00033   
               POS=(01,51)                                              00034   
         DFHMDF ATTRB=(ASKIP),                                         X00035   
               INITIAL='TO',                                           X00036   
               COLOR=NEUTRAL,                                          X00037   
               LENGTH=2,                                               X00038   
               POS=(01,59)                                              00039   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZ,ZZ9',                                        X00042   
               LENGTH=6,                                               X00043   
               POS=(01,63)                                              00044   
         DFHMDF ATTRB=(ASKIP),                                         X00045   
               INITIAL='OF',                                           X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=2,                                               X00048   
               POS=(01,70)                                              00049   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZ,ZZ9',                                        X00052   
               LENGTH=6,                                               X00053   
               POS=(01,74)                                              00054   
*                                                                       00055   
         DFHMDF ATTRB=(ASKIP),                                         X00026**2
               INITIAL='PO NUMBER:',                                   X00027**2
               COLOR=NEUTRAL,                                          X00034   
               LENGTH=10,                                              X00028**2
               POS=(02,1)                                               00029**2
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00037   
               COLOR=BLUE,                                             X00038   
               PICOUT='ZZZZZZZZ',                                      X00039   
               LENGTH=8,                                               X00040   
               POS=(02,12)                                              00041   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='PACK ID:',                                     X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=08,                                              X00082   
               POS=(02,29)                                              00083   
APACKID  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='Z9',                                            X00031   
               LENGTH=2,                                               X00086   
               POS=(02,38)                                              00087   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00024   
               INITIAL='PACK SKU:',                                    X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=9,                                               X00027   
               POS=(02,41)                                              00028   
APCKSKU  DFHMDF ATTRB=(ASKIP),                                         X00029   
               COLOR=BLUE,                                             X00030   
               PICOUT='ZZZZZZZ9',                                      X00031   
               LENGTH=8,                                               X00032   
               POS=(02,51)                                              00034   
         DFHMDF ATTRB=(ASKIP),                                         X00024   
               INITIAL='PACK:',                                        X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=5,                                               X00027   
               POS=(02,60)                                              00028   
ASTRTPK  DFHMDF ATTRB=(ASKIP),                                         X00029   
               COLOR=BLUE,                                             X00030   
               PICOUT='Z,ZZ9',                                         X00031   
               LENGTH=5,                                               X00032   
               POS=(02,66)                                              00034   
         DFHMDF ATTRB=(ASKIP),                                         X00045   
               INITIAL='OF',                                           X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=2,                                               X00048   
               POS=(02,72)                                              00049   
ATOTPK   DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='Z,ZZ9',                                         X00052   
               LENGTH=5,                                               X00053   
               POS=(02,75)                                              00054   
*                                                                       00055   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='DESCRIPTION:',                                 X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=12,                                              X00082   
               POS=(03,1)                                               00083   
APDESCR  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               LENGTH=40,                                              X00086   
               POS=(03,14)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='PACK UPC:',                                    X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=09,                                              X00082   
               POS=(03,55)                                              00083   
APCKUPC  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               LENGTH=15,                                              X00086   
               POS=(03,65)                                              00087   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='TOTAL UNITS.....:',                            X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=17,                                              X00082   
               POS=(04,1)                                               00083   
ATOTUNT  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZ',                                       X00039   
               LENGTH=7,                                               X00086   
               POS=(04,22)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='CONVEYABLE INNER PACKS:',                      X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=23,                                              X00082   
               POS=(04,34)                                              00083   
ACIPIND  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               LENGTH=1,                                               X00086   
               POS=(04,58)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='(Y OR N)',                                     X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=8,                                               X00082   
               POS=(04,60)                                              00083   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='# OF CARTONS....:',                            X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=17,                                              X00082   
               POS=(05,01)                                              00083   
ANOFCTN  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZ',                                       X00039   
               LENGTH=7,                                               X00086   
               POS=(05,22)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='UNITS PER CARTON......:',                      X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=23,                                              X00082   
               POS=(05,34)                                              00083   
AUPRCTN  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZ9',                                        X00039   
               LENGTH=6,                                               X00086   
               POS=(05,58)                                              00087   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='# OF INNER PACKS:',                            X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=17,                                              X00082   
               POS=(06,01)                                              00083   
ANOFINP  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZ',                                       X00039   
               LENGTH=7,                                               X00086   
               POS=(06,22)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='UNITS PER INNER PACK..:',                      X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=23,                                              X00082   
               POS=(06,34)                                              00083   
AUPRINP  DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZ9',                                        X00039   
               LENGTH=6,                                               X00086   
               POS=(06,58)                                              00087   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='MJ SU',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(07,05)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='PACK',                                         X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=4,                                               X00082   
               POS=(07,67)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='ORDER',                                        X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=5,                                               X00082   
               POS=(07,74)                                              00083   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='DPT CL CL SKU',                                X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=13,                                              X00082   
               POS=(08,1)                                               00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='STYLE',                                        X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=5,                                               X00082   
               POS=(08,20)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='DESCRIPTION',                                  X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=11,                                              X00082   
               POS=(08,31)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='COLOR',                                        X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=5,                                               X00082   
               POS=(08,45)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='SIZE',                                         X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=4,                                               X00082   
               POS=(08,56)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='RATIO',                                        X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=5,                                               X00082   
               POS=(08,67)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='QTY',                                          X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=3,                                               X00082   
               POS=(08,75)                                              00083   
*                                                                               
ASKUD1   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(09,1)                                               00183   
ASKUMC1  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(09,5)                                                       
ASKUC1   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(09,8)                                               00188   
ASKU1    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(09,11)                                              00193   
ASTYL1   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(09,20)                                              00213   
ADESC1   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(09,31)                                              00213   
ACOLR1   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(09,45)                                              00217   
ASIZE1   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(09,56)                                              00221   
APRAT1   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(09,67)                                              00221   
AOQTY1   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(09,73)                                              00166**3
*                                                                               
ASKUD2   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(10,1)                                               00183   
ASKUMC2  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(10,5)                                                       
ASKUC2   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(10,8)                                               00188   
ASKU2    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(10,11)                                              00193   
ASTYL2   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(10,20)                                              00213   
ADESC2   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(10,31)                                              00213   
ACOLR2   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(10,45)                                              00217   
ASIZE2   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(10,56)                                              00221   
APRAT2   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(10,67)                                              00221   
AOQTY2   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(10,73)                                              00166**3
*                                                                               
ASKUD3   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(11,1)                                               00183   
ASKUMC3  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(11,5)                                                       
ASKUC3   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(11,8)                                               00188   
ASKU3    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(11,11)                                              00193   
ASTYL3   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(11,20)                                              00213   
ADESC3   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(11,31)                                              00213   
ACOLR3   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(11,45)                                              00217   
ASIZE3   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(11,56)                                              00221   
APRAT3   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(11,67)                                              00221   
AOQTY3   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(11,73)                                              00166**3
*                                                                               
ASKUD4   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(12,1)                                               00183   
ASKUMC4  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(12,5)                                                       
ASKUC4   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(12,8)                                               00188   
ASKU4    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(12,11)                                              00193   
ASTYL4   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(12,20)                                              00213   
ADESC4   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(12,31)                                              00213   
ACOLR4   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(12,45)                                              00217   
ASIZE4   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(12,56)                                              00221   
APRAT4   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(12,67)                                              00221   
AOQTY4   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(12,73)                                              00166**3
*                                                                               
ASKUD5   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(13,1)                                               00183   
ASKUMC5  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(13,5)                                                       
ASKUC5   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(13,8)                                               00188   
ASKU5    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(13,11)                                              00193   
ASTYL5   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(13,20)                                              00213   
ADESC5   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(13,31)                                              00213   
ACOLR5   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(13,45)                                              00217   
ASIZE5   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(13,56)                                              00221   
APRAT5   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(13,67)                                              00221   
AOQTY5   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(13,73)                                              00166**3
*                                                                               
ASKUD6   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(14,1)                                               00183   
ASKUMC6  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(14,5)                                                       
ASKUC6   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(14,8)                                               00188   
ASKU6    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(14,11)                                              00193   
ASTYL6   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(14,20)                                              00213   
ADESC6   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(14,31)                                              00213   
ACOLR6   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(14,45)                                              00217   
ASIZE6   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(14,56)                                              00221   
APRAT6   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(14,67)                                              00221   
AOQTY6   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(14,73)                                              00166**3
*                                                                               
ASKUD7   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(15,1)                                               00183   
ASKUMC7  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(15,5)                                                       
ASKUC7   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(15,8)                                               00188   
ASKU7    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(15,11)                                              00193   
ASTYL7   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(15,20)                                              00213   
ADESC7   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(15,31)                                              00213   
ACOLR7   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(15,45)                                              00217   
ASIZE7   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(15,56)                                              00221   
APRAT7   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(15,67)                                              00221   
AOQTY7   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(15,73)                                              00166**3
*                                                                               
ASKUD8   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(16,1)                                               00183   
ASKUMC8  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(16,5)                                                       
ASKUC8   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(16,8)                                               00188   
ASKU8    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(16,11)                                              00193   
ASTYL8   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(16,20)                                              00213   
ADESC8   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(16,31)                                              00213   
ACOLR8   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(16,45)                                              00217   
ASIZE8   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(16,56)                                              00221   
APRAT8   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(16,67)                                              00221   
AOQTY8   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(16,73)                                              00166**3
*                                                                               
ASKUD9   DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(17,1)                                               00183   
ASKUMC9  DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(17,5)                                                       
ASKUC9   DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(17,8)                                               00188   
ASKU9    DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(17,11)                                              00193   
ASTYL9   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(17,20)                                              00213   
ADESC9   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(17,31)                                              00213   
ACOLR9   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(17,45)                                              00217   
ASIZE9   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(17,56)                                              00221   
APRAT9   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(17,67)                                              00221   
AOQTY9   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(17,73)                                              00166**3
*                                                                               
ASKUD10  DFHMDF ATTRB=(ASKIP),                                         X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=3,                                               X00182   
               POS=(18,1)                                               00183   
ASKUMC10 DFHMDF ATTRB=(ASKIP),                                         X        
               JUSTIFY=(LEFT,BLANK),                                   X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(18,5)                                                       
ASKUC10  DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(18,8)                                               00188   
ASKU10   DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(18,11)                                              00193   
ASTYL10  DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=10,                                              X00212   
               POS=(18,20)                                              00213   
ADESC10  DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=13,                                              X00212   
               POS=(18,31)                                              00213   
ACOLR10  DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=10,                                              X00216   
               POS=(18,45)                                              00217   
ASIZE10  DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(18,56)                                              00221   
APRAT10  DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               PICOUT='ZZ9',                                           X00164   
               LENGTH=3,                                               X00220   
               POS=(18,67)                                              00221   
AOQTY10  DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZ9',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(18,73)                                              00166**3
         DFHMSD TYPE=FINAL                                              00078**2
         END                                                            00079**2
