*          DATA SET POKM066    AT LEVEL 016 AS OF 02/20/95                      
  PRINT  NOGEN                                                          00001   
*********************************************************************** 00002   
*                                                                       00003   
*        MAPSET  : POKM066                                              00004   
*        MAP     : PO066A                                               00005   
*        PROGRAM : POKCS066                                             00006   
*        TRANSID : W066 - EDI DATA TRANSMISSION INQUIRY                 00007**9
*        SYSTEM  : CICS ARCHITECTURE                                    00008   
*                                                                       00009   
*********************************************************************** 00010   
POKM066  DFHMSD TYPE=MAP,                                              X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
PO066A   DFHMDI LINE=02,                                               X00016   
               COLUMN=01,                                              X00017   
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
         DFHMDF ATTRB=(PROT),                                          X00021**6
               INITIAL='ITEMS:',                                       X00022**6
               COLOR=NEUTRAL,                                          X00023**6
               LENGTH=6,                                               X00024**6
               POS=(01,44)                                              00025**6
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00026**6
               COLOR=GREEN,                                            X00027**6
               HILIGHT=UNDERLINE,                                      X00028**6
               PICOUT='ZZZ,ZZ9',                                       X00029**6
               LENGTH=7,                                               X00030**6
               POS=(01,51)                                              00031**6
         DFHMDF ATTRB=(PROT),                                          X00032**6
               INITIAL='TO',                                           X00033**6
               COLOR=NEUTRAL,                                          X00034**6
               LENGTH=2,                                               X00035**6
               POS=(01,59)                                              00036**6
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00037**6
               COLOR=BLUE,                                             X00038**6
               PICOUT='ZZZ,ZZ9',                                       X00039**6
               LENGTH=7,                                               X00040**6
               POS=(01,62)                                              00041**6
         DFHMDF ATTRB=(PROT),                                          X00042**6
               INITIAL='OF',                                           X00043**6
               COLOR=NEUTRAL,                                          X00044**6
               LENGTH=2,                                               X00045**6
               POS=(01,70)                                              00046**6
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00047**6
               COLOR=BLUE,                                             X00048**6
               PICOUT='ZZZ,ZZ9',                                       X00049**6
               LENGTH=7,                                               X00050**6
               POS=(01,73)                                              00051**6
         DFHMDF ATTRB=(ASKIP),                                         X00052   
               INITIAL='VENDOR NAME:',                                 X00053*15
               COLOR=NEUTRAL,                                          X00054   
               LENGTH=12,                                              X00055*15
               POS=(02,03)                                              00056*15
AVDRNAM  DFHMDF ATTRB=(ASKIP),                                         X00057*15
               COLOR=BLUE,                                             X00058*15
               LENGTH=30,                                              X00059*15
               POS=(02,16)                                              00060*15
         DFHMDF ATTRB=(ASKIP),                                         X00079**5
               INITIAL='BLANKET REL..:',                               X00080*13
               COLOR=NEUTRAL,                                          X00081**5
               LENGTH=14,                                              X00082*11
               POS=(02,55)                                              00083*16
ABLKRLS  DFHMDF ATTRB=(ASKIP),                                         X00084**5
               COLOR=BLUE,                                             X00085**5
               LENGTH=1,                                               X00086**5
               POS=(02,70)                                              00087*16
         DFHMDF ATTRB=(ASKIP),                                         X00061*15
               INITIAL='PO NUMBER..:',                                 X00062*15
               COLOR=NEUTRAL,                                          X00063*15
               LENGTH=12,                                              X00064*15
               POS=(03,03)                                              00065*15
APONMBR  DFHMDF ATTRB=(ASKIP),                                         X00066**5
               COLOR=BLUE,                                             X00067**5
               PICOUT='ZZZZZZZZ',                                      X00039**6
               LENGTH=08,                                              X00068*16
               POS=(03,16)                                              00069*15
         DFHMDF ATTRB=(ASKIP),                                         X00070**5
               INITIAL='NETWORK:',                                     X00071*11
               COLOR=NEUTRAL,                                          X00072**5
               LENGTH=08,                                              X00073*11
               POS=(03,27)                                              00074*16
ANETWRK  DFHMDF ATTRB=(ASKIP),                                         X00075**5
               COLOR=BLUE,                                             X00076**5
               LENGTH=15,                                              X00077**7
               POS=(03,36)                                              00078*16
         DFHMDF ATTRB=(ASKIP),                                         X00079**5
               INITIAL='PACK BY STORE:',                               X00080*13
               COLOR=NEUTRAL,                                          X00081**5
               LENGTH=14,                                              X00082*11
               POS=(03,55)                                              00083*16
APKSTOR  DFHMDF ATTRB=(ASKIP),                                         X00084**5
               COLOR=BLUE,                                             X00085**5
               LENGTH=1,                                               X00086**5
               POS=(03,70)                                              00087*16
         DFHMDF ATTRB=(ASKIP),                                         X00088**5
               INITIAL='PO OUT TO NTWK',                               X00089**5
               COLOR=NEUTRAL,                                          X00090**5
               LENGTH=14,                                              X00091**5
               POS=(05,04)                                              00092*14
         DFHMDF ATTRB=(ASKIP),                                         X00093   
               INITIAL='IN NTWK MAILBOX',                              X00094**3
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=15,                                              X00096**3
               POS=(05,22)                                              00097*10
         DFHMDF ATTRB=(ASKIP),                                         X00098   
               INITIAL='VENDOR PICKUP',                                X00099**3
               COLOR=NEUTRAL,                                          X00100   
               LENGTH=13,                                              X00101**3
               POS=(05,42)                                              00102*10
         DFHMDF ATTRB=(ASKIP),                                         X00103**3
               INITIAL='VDR',                                          X00104**3
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=03,                                              X00106**3
               POS=(05,59)                                              00107*10
         DFHMDF ATTRB=(ASKIP),                                         X00108**3
               INITIAL='TEST/',                                        X00109*12
               COLOR=NEUTRAL,                                          X00110   
               LENGTH=05,                                              X00111**3
               POS=(05,64)                                              00112*10
         DFHMDF ATTRB=(ASKIP),                                         X00113**3
               INITIAL='DATE    TIME',                                 X00114**3
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=12,                                              X00116**3
               POS=(06,05)                                              00117*10
         DFHMDF ATTRB=(ASKIP),                                         X00118**3
               INITIAL='DATE    TIME',                                 X00119**3
               COLOR=NEUTRAL,                                          X00120**3
               LENGTH=12,                                              X00121**3
               POS=(06,24)                                              00122*10
         DFHMDF ATTRB=(ASKIP),                                         X00123**3
               INITIAL='DATE    TIME',                                 X00124**3
               COLOR=NEUTRAL,                                          X00125**3
               LENGTH=12,                                              X00126**3
               POS=(06,43)                                              00127*10
         DFHMDF ATTRB=(ASKIP),                                         X00128**3
               INITIAL='ACK',                                          X00129**3
               COLOR=NEUTRAL,                                          X00130**3
               LENGTH=03,                                              X00131**3
               POS=(06,59)                                              00132*10
         DFHMDF ATTRB=(ASKIP),                                         X00133**3
               INITIAL='PROD',                                         X00134**3
               COLOR=NEUTRAL,                                          X00135**3
               LENGTH=04,                                              X00136**3
               POS=(06,64)                                              00137*10
AOTDT01  DFHMDF ATTRB=(ASKIP),                                         X00138**3
               COLOR=BLUE,                                             X00139   
               LENGTH=08,                                              X00140**3
               POS=(07,03)                                              00141*10
AOTTM01  DFHMDF ATTRB=(ASKIP),                                         X00142**3
               COLOR=BLUE,                                             X00143**3
               LENGTH=05,                                              X00144**3
               POS=(07,13)                                              00145*10
AINDT01  DFHMDF ATTRB=(ASKIP),                                         X00146**3
               COLOR=BLUE,                                             X00147**3
               LENGTH=08,                                              X00148**3
               POS=(07,22)                                              00149*10
AINTM01  DFHMDF ATTRB=(ASKIP),                                         X00150**3
               COLOR=BLUE,                                             X00151**3
               LENGTH=05,                                              X00152**3
               POS=(07,32)                                              00153*10
APUDT01  DFHMDF ATTRB=(ASKIP),                                         X00154**3
               COLOR=BLUE,                                             X00155**3
               LENGTH=08,                                              X00156**3
               POS=(07,41)                                              00157*10
APUTM01  DFHMDF ATTRB=(ASKIP),                                         X00158**3
               COLOR=BLUE,                                             X00159**3
               LENGTH=05,                                              X00160**3
               POS=(07,51)                                              00161*10
AACKN01  DFHMDF ATTRB=(ASKIP),                                         X00162**3
               COLOR=BLUE,                                             X00163**3
               LENGTH=01,                                              X00164**3
               POS=(07,60)                                              00165*10
ATPIN01  DFHMDF ATTRB=(ASKIP),                                         X00166**3
               COLOR=BLUE,                                             X00167**3
               LENGTH=01,                                              X00168**3
               POS=(07,65)                                              00169*10
AOTDT02  DFHMDF ATTRB=(ASKIP),                                         X00170**3
               COLOR=BLUE,                                             X00171**3
               LENGTH=08,                                              X00172**3
               POS=(08,03)                                              00173*10
AOTTM02  DFHMDF ATTRB=(ASKIP),                                         X00174**3
               COLOR=BLUE,                                             X00175**3
               LENGTH=05,                                              X00176**3
               POS=(08,13)                                              00177*10
AINDT02  DFHMDF ATTRB=(ASKIP),                                         X00178**3
               COLOR=BLUE,                                             X00179**3
               LENGTH=08,                                              X00180**3
               POS=(08,22)                                              00181*10
AINTM02  DFHMDF ATTRB=(ASKIP),                                         X00182**3
               COLOR=BLUE,                                             X00183**3
               LENGTH=05,                                              X00184**3
               POS=(08,32)                                              00185*10
APUDT02  DFHMDF ATTRB=(ASKIP),                                         X00186**3
               COLOR=BLUE,                                             X00187**3
               LENGTH=08,                                              X00188**3
               POS=(08,41)                                              00189*10
APUTM02  DFHMDF ATTRB=(ASKIP),                                         X00190**3
               COLOR=BLUE,                                             X00191**3
               LENGTH=05,                                              X00192**3
               POS=(08,51)                                              00193*10
AACKN02  DFHMDF ATTRB=(ASKIP),                                         X00194**3
               COLOR=BLUE,                                             X00195**3
               LENGTH=01,                                              X00196**3
               POS=(08,60)                                              00197*10
ATPIN02  DFHMDF ATTRB=(ASKIP),                                         X00198**3
               COLOR=BLUE,                                             X00199**3
               LENGTH=01,                                              X00200**3
               POS=(08,65)                                              00201*10
AOTDT03  DFHMDF ATTRB=(ASKIP),                                         X00202**3
               COLOR=BLUE,                                             X00203**3
               LENGTH=08,                                              X00204**3
               POS=(09,03)                                              00205*10
AOTTM03  DFHMDF ATTRB=(ASKIP),                                         X00206**3
               COLOR=BLUE,                                             X00207**3
               LENGTH=05,                                              X00208**3
               POS=(09,13)                                              00209*10
AINDT03  DFHMDF ATTRB=(ASKIP),                                         X00210**3
               COLOR=BLUE,                                             X00211**3
               LENGTH=08,                                              X00212**3
               POS=(09,22)                                              00213*10
AINTM03  DFHMDF ATTRB=(ASKIP),                                         X00214**3
               COLOR=BLUE,                                             X00215**3
               LENGTH=05,                                              X00216**3
               POS=(09,32)                                              00217*10
APUDT03  DFHMDF ATTRB=(ASKIP),                                         X00218**3
               COLOR=BLUE,                                             X00219**3
               LENGTH=08,                                              X00220**3
               POS=(09,41)                                              00221*10
APUTM03  DFHMDF ATTRB=(ASKIP),                                         X00222**3
               COLOR=BLUE,                                             X00223**3
               LENGTH=05,                                              X00224**3
               POS=(09,51)                                              00225*10
AACKN03  DFHMDF ATTRB=(ASKIP),                                         X00226**3
               COLOR=BLUE,                                             X00227**3
               LENGTH=01,                                              X00228**3
               POS=(09,60)                                              00229*10
ATPIN03  DFHMDF ATTRB=(ASKIP),                                         X00230**3
               COLOR=BLUE,                                             X00231**3
               LENGTH=01,                                              X00232**3
               POS=(09,65)                                              00233*10
AOTDT04  DFHMDF ATTRB=(ASKIP),                                         X00234**3
               COLOR=BLUE,                                             X00235**3
               LENGTH=08,                                              X00236**3
               POS=(10,03)                                              00237*10
AOTTM04  DFHMDF ATTRB=(ASKIP),                                         X00238**3
               COLOR=BLUE,                                             X00239**3
               LENGTH=05,                                              X00240**3
               POS=(10,13)                                              00241*10
AINDT04  DFHMDF ATTRB=(ASKIP),                                         X00242**3
               COLOR=BLUE,                                             X00243**3
               LENGTH=08,                                              X00244**3
               POS=(10,22)                                              00245*10
AINTM04  DFHMDF ATTRB=(ASKIP),                                         X00246**3
               COLOR=BLUE,                                             X00247**3
               LENGTH=05,                                              X00248**3
               POS=(10,32)                                              00249*10
APUDT04  DFHMDF ATTRB=(ASKIP),                                         X00250**3
               COLOR=BLUE,                                             X00251**3
               LENGTH=08,                                              X00252**3
               POS=(10,41)                                              00253*10
APUTM04  DFHMDF ATTRB=(ASKIP),                                         X00254**3
               COLOR=BLUE,                                             X00255**3
               LENGTH=05,                                              X00256**3
               POS=(10,51)                                              00257*10
AACKN04  DFHMDF ATTRB=(ASKIP),                                         X00258**3
               COLOR=BLUE,                                             X00259**3
               LENGTH=01,                                              X00260**3
               POS=(10,60)                                              00261*10
ATPIN04  DFHMDF ATTRB=(ASKIP),                                         X00262**3
               COLOR=BLUE,                                             X00263**3
               LENGTH=01,                                              X00264**3
               POS=(10,65)                                              00265*10
AOTDT05  DFHMDF ATTRB=(ASKIP),                                         X00266**3
               COLOR=BLUE,                                             X00267**3
               LENGTH=08,                                              X00268**3
               POS=(11,03)                                              00269*10
AOTTM05  DFHMDF ATTRB=(ASKIP),                                         X00270**3
               COLOR=BLUE,                                             X00271**3
               LENGTH=05,                                              X00272**3
               POS=(11,13)                                              00273*10
AINDT05  DFHMDF ATTRB=(ASKIP),                                         X00274**3
               COLOR=BLUE,                                             X00275**3
               LENGTH=08,                                              X00276**3
               POS=(11,22)                                              00277*10
AINTM05  DFHMDF ATTRB=(ASKIP),                                         X00278**3
               COLOR=BLUE,                                             X00279**3
               LENGTH=05,                                              X00280**3
               POS=(11,32)                                              00281*10
APUDT05  DFHMDF ATTRB=(ASKIP),                                         X00282**3
               COLOR=BLUE,                                             X00283**3
               LENGTH=08,                                              X00284**3
               POS=(11,41)                                              00285*10
APUTM05  DFHMDF ATTRB=(ASKIP),                                         X00286**3
               COLOR=BLUE,                                             X00287**3
               LENGTH=05,                                              X00288**3
               POS=(11,51)                                              00289*10
AACKN05  DFHMDF ATTRB=(ASKIP),                                         X00290**3
               COLOR=BLUE,                                             X00291**3
               LENGTH=01,                                              X00292**3
               POS=(11,60)                                              00293*10
ATPIN05  DFHMDF ATTRB=(ASKIP),                                         X00294**3
               COLOR=BLUE,                                             X00295**3
               LENGTH=01,                                              X00296**3
               POS=(11,65)                                              00297*10
AOTDT06  DFHMDF ATTRB=(ASKIP),                                         X00298**3
               COLOR=BLUE,                                             X00299**3
               LENGTH=08,                                              X00300**3
               POS=(12,03)                                              00301*10
AOTTM06  DFHMDF ATTRB=(ASKIP),                                         X00302**3
               COLOR=BLUE,                                             X00303**3
               LENGTH=05,                                              X00304**3
               POS=(12,13)                                              00305*10
AINDT06  DFHMDF ATTRB=(ASKIP),                                         X00306**3
               COLOR=BLUE,                                             X00307**3
               LENGTH=08,                                              X00308**3
               POS=(12,22)                                              00309*10
AINTM06  DFHMDF ATTRB=(ASKIP),                                         X00310**3
               COLOR=BLUE,                                             X00311**3
               LENGTH=05,                                              X00312**3
               POS=(12,32)                                              00313*10
APUDT06  DFHMDF ATTRB=(ASKIP),                                         X00314**3
               COLOR=BLUE,                                             X00315**3
               LENGTH=08,                                              X00316**3
               POS=(12,41)                                              00317*10
APUTM06  DFHMDF ATTRB=(ASKIP),                                         X00318**3
               COLOR=BLUE,                                             X00319**3
               LENGTH=05,                                              X00320**3
               POS=(12,51)                                              00321*10
AACKN06  DFHMDF ATTRB=(ASKIP),                                         X00322**3
               COLOR=BLUE,                                             X00323**3
               LENGTH=01,                                              X00324**3
               POS=(12,60)                                              00325*10
ATPIN06  DFHMDF ATTRB=(ASKIP),                                         X00326**3
               COLOR=BLUE,                                             X00327**3
               LENGTH=01,                                              X00328**3
               POS=(12,65)                                              00329*10
AOTDT07  DFHMDF ATTRB=(ASKIP),                                         X00330**3
               COLOR=BLUE,                                             X00331**3
               LENGTH=08,                                              X00332**3
               POS=(13,03)                                              00333*10
AOTTM07  DFHMDF ATTRB=(ASKIP),                                         X00334**3
               COLOR=BLUE,                                             X00335**3
               LENGTH=05,                                              X00336**3
               POS=(13,13)                                              00337*10
AINDT07  DFHMDF ATTRB=(ASKIP),                                         X00338**3
               COLOR=BLUE,                                             X00339**3
               LENGTH=08,                                              X00340**3
               POS=(13,22)                                              00341*10
AINTM07  DFHMDF ATTRB=(ASKIP),                                         X00342**3
               COLOR=BLUE,                                             X00343**3
               LENGTH=05,                                              X00344**3
               POS=(13,32)                                              00345*10
APUDT07  DFHMDF ATTRB=(ASKIP),                                         X00346**3
               COLOR=BLUE,                                             X00347**3
               LENGTH=08,                                              X00348**3
               POS=(13,41)                                              00349*10
APUTM07  DFHMDF ATTRB=(ASKIP),                                         X00350**3
               COLOR=BLUE,                                             X00351**3
               LENGTH=05,                                              X00352**3
               POS=(13,51)                                              00353*10
AACKN07  DFHMDF ATTRB=(ASKIP),                                         X00354**3
               COLOR=BLUE,                                             X00355**3
               LENGTH=01,                                              X00356**3
               POS=(13,60)                                              00357*10
ATPIN07  DFHMDF ATTRB=(ASKIP),                                         X00358**3
               COLOR=BLUE,                                             X00359**3
               LENGTH=01,                                              X00360**3
               POS=(13,65)                                              00361*10
AOTDT08  DFHMDF ATTRB=(ASKIP),                                         X00362**3
               COLOR=BLUE,                                             X00363**3
               LENGTH=08,                                              X00364**3
               POS=(14,03)                                              00365*10
AOTTM08  DFHMDF ATTRB=(ASKIP),                                         X00366**3
               COLOR=BLUE,                                             X00367**3
               LENGTH=05,                                              X00368**3
               POS=(14,13)                                              00369*10
AINDT08  DFHMDF ATTRB=(ASKIP),                                         X00370**3
               COLOR=BLUE,                                             X00371**3
               LENGTH=08,                                              X00372**3
               POS=(14,22)                                              00373*10
AINTM08  DFHMDF ATTRB=(ASKIP),                                         X00374**3
               COLOR=BLUE,                                             X00375**3
               LENGTH=05,                                              X00376**3
               POS=(14,32)                                              00377*10
APUDT08  DFHMDF ATTRB=(ASKIP),                                         X00378**3
               COLOR=BLUE,                                             X00379**3
               LENGTH=08,                                              X00380**3
               POS=(14,41)                                              00381*10
APUTM08  DFHMDF ATTRB=(ASKIP),                                         X00382**3
               COLOR=BLUE,                                             X00383**3
               LENGTH=05,                                              X00384**3
               POS=(14,51)                                              00385*10
AACKN08  DFHMDF ATTRB=(ASKIP),                                         X00386**3
               COLOR=BLUE,                                             X00387**3
               LENGTH=01,                                              X00388**3
               POS=(14,60)                                              00389*10
ATPIN08  DFHMDF ATTRB=(ASKIP),                                         X00390**3
               COLOR=BLUE,                                             X00391**3
               LENGTH=01,                                              X00392**3
               POS=(14,65)                                              00393*10
AOTDT09  DFHMDF ATTRB=(ASKIP),                                         X00394**3
               COLOR=BLUE,                                             X00395**3
               LENGTH=08,                                              X00396**3
               POS=(15,03)                                              00397*10
AOTTM09  DFHMDF ATTRB=(ASKIP),                                         X00398**3
               COLOR=BLUE,                                             X00399**3
               LENGTH=05,                                              X00400**3
               POS=(15,13)                                              00401*10
AINDT09  DFHMDF ATTRB=(ASKIP),                                         X00402**3
               COLOR=BLUE,                                             X00403**3
               LENGTH=08,                                              X00404**3
               POS=(15,22)                                              00405*10
AINTM09  DFHMDF ATTRB=(ASKIP),                                         X00406**3
               COLOR=BLUE,                                             X00407**3
               LENGTH=05,                                              X00408**3
               POS=(15,32)                                              00409*10
APUDT09  DFHMDF ATTRB=(ASKIP),                                         X00410**3
               COLOR=BLUE,                                             X00411**3
               LENGTH=08,                                              X00412**3
               POS=(15,41)                                              00413*10
APUTM09  DFHMDF ATTRB=(ASKIP),                                         X00414**3
               COLOR=BLUE,                                             X00415**3
               LENGTH=05,                                              X00416**3
               POS=(15,51)                                              00417*10
AACKN09  DFHMDF ATTRB=(ASKIP),                                         X00418**3
               COLOR=BLUE,                                             X00419**3
               LENGTH=01,                                              X00420**3
               POS=(15,60)                                              00421*10
ATPIN09  DFHMDF ATTRB=(ASKIP),                                         X00422**3
               COLOR=BLUE,                                             X00423**3
               LENGTH=01,                                              X00424**3
               POS=(15,65)                                              00425*10
AOTDT10  DFHMDF ATTRB=(ASKIP),                                         X00426**3
               COLOR=BLUE,                                             X00427**3
               LENGTH=08,                                              X00428**3
               POS=(16,03)                                              00429*10
AOTTM10  DFHMDF ATTRB=(ASKIP),                                         X00430**3
               COLOR=BLUE,                                             X00431**3
               LENGTH=05,                                              X00432**3
               POS=(16,13)                                              00433*10
AINDT10  DFHMDF ATTRB=(ASKIP),                                         X00434**3
               COLOR=BLUE,                                             X00435**3
               LENGTH=08,                                              X00436**3
               POS=(16,22)                                              00437*10
AINTM10  DFHMDF ATTRB=(ASKIP),                                         X00438**3
               COLOR=BLUE,                                             X00439**3
               LENGTH=05,                                              X00440**3
               POS=(16,32)                                              00441*10
APUDT10  DFHMDF ATTRB=(ASKIP),                                         X00442**3
               COLOR=BLUE,                                             X00443**3
               LENGTH=08,                                              X00444**3
               POS=(16,41)                                              00445*10
APUTM10  DFHMDF ATTRB=(ASKIP),                                         X00446**3
               COLOR=BLUE,                                             X00447**3
               LENGTH=05,                                              X00448**3
               POS=(16,51)                                              00449*10
AACKN10  DFHMDF ATTRB=(ASKIP),                                         X00450**3
               COLOR=BLUE,                                             X00451**3
               LENGTH=01,                                              X00452**3
               POS=(16,60)                                              00453*10
ATPIN10  DFHMDF ATTRB=(ASKIP),                                         X00454**3
               COLOR=BLUE,                                             X00455**3
               LENGTH=01,                                              X00456**3
               POS=(16,65)                                              00457*10
AOTDT11  DFHMDF ATTRB=(ASKIP),                                         X00458**3
               COLOR=BLUE,                                             X00459**3
               LENGTH=08,                                              X00460**3
               POS=(17,03)                                              00461*10
AOTTM11  DFHMDF ATTRB=(ASKIP),                                         X00462**3
               COLOR=BLUE,                                             X00463**3
               LENGTH=05,                                              X00464**3
               POS=(17,13)                                              00465*10
AINDT11  DFHMDF ATTRB=(ASKIP),                                         X00466**3
               COLOR=BLUE,                                             X00467**3
               LENGTH=08,                                              X00468**3
               POS=(17,22)                                              00469*10
AINTM11  DFHMDF ATTRB=(ASKIP),                                         X00470**3
               COLOR=BLUE,                                             X00471**3
               LENGTH=05,                                              X00472**3
               POS=(17,32)                                              00473*10
APUDT11  DFHMDF ATTRB=(ASKIP),                                         X00474**3
               COLOR=BLUE,                                             X00475**3
               LENGTH=08,                                              X00476**3
               POS=(17,41)                                              00477*10
APUTM11  DFHMDF ATTRB=(ASKIP),                                         X00478**3
               COLOR=BLUE,                                             X00479**3
               LENGTH=05,                                              X00480**3
               POS=(17,51)                                              00481*10
AACKN11  DFHMDF ATTRB=(ASKIP),                                         X00482**3
               COLOR=BLUE,                                             X00483**3
               LENGTH=01,                                              X00484**3
               POS=(17,60)                                              00485*10
ATPIN11  DFHMDF ATTRB=(ASKIP),                                         X00486**3
               COLOR=BLUE,                                             X00487**3
               LENGTH=01,                                              X00488**3
               POS=(17,65)                                              00489*10
AOTDT12  DFHMDF ATTRB=(ASKIP),                                         X00490**3
               COLOR=BLUE,                                             X00491**3
               LENGTH=08,                                              X00492**3
               POS=(18,03)                                              00493*10
AOTTM12  DFHMDF ATTRB=(ASKIP),                                         X00494**3
               COLOR=BLUE,                                             X00495**3
               LENGTH=05,                                              X00496**3
               POS=(18,13)                                              00497*10
AINDT12  DFHMDF ATTRB=(ASKIP),                                         X00498**3
               COLOR=BLUE,                                             X00499**3
               LENGTH=08,                                              X00500**3
               POS=(18,22)                                              00501*10
AINTM12  DFHMDF ATTRB=(ASKIP),                                         X00502**3
               COLOR=BLUE,                                             X00503**3
               LENGTH=05,                                              X00504**3
               POS=(18,32)                                              00505*10
APUDT12  DFHMDF ATTRB=(ASKIP),                                         X00506**3
               COLOR=BLUE,                                             X00507**3
               LENGTH=08,                                              X00508**3
               POS=(18,41)                                              00509*10
APUTM12  DFHMDF ATTRB=(ASKIP),                                         X00510**3
               COLOR=BLUE,                                             X00511**3
               LENGTH=05,                                              X00512**3
               POS=(18,51)                                              00513*10
AACKN12  DFHMDF ATTRB=(ASKIP),                                         X00514**3
               COLOR=BLUE,                                             X00515**3
               LENGTH=01,                                              X00516**3
               POS=(18,60)                                              00517*10
ATPIN12  DFHMDF ATTRB=(ASKIP),                                         X00518**3
               COLOR=BLUE,                                             X00519**3
               LENGTH=01,                                              X00520**3
               POS=(18,65)                                              00521*10
         DFHMSD TYPE=FINAL                                              00522   
         END                                                            00523   
