*          DATA SET POKM099                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM099                                            *           
*        MAP     PO099A                                             *           
*        PROGRAM POKCS099                                           *           
*        TRANSID W099                                               *           
*        SYSTEM  CICS ARCH - PO SET LIST                            *           
*-------------------------------------------------------------------*           
POKM099 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
*                                                                               
PO099A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
AORDER  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=YELLOW,                                           X        
               LENGTH=26,                                              X        
               POS=(01,05)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='ITEMS:',                                       X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=06,                                              X        
               POS=(01,44)                                                      
ASTRTIT DFHMDF ATTRB=(UNPROT,NUM),                                     X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=07,                                              X        
               POS=(01,51),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,59)                                                      
AENDIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,62),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='OF',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,70)                                                      
ATOTIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,73),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
        DFHMDF POS=(02,005),                                           X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT),                                      X        
               LENGTH=015,                                             X        
               INITIAL='SEARCH FOR SET:'                                        
AREQSET DFHMDF POS=(02,021),                                           X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=005,                                             X        
               INITIAL='     '                                                  
         DFHMDF POS=(02,027),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001,                                             X        
               INITIAL=' '                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SHORT',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=05,                                              X        
               POS=(03,05)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='LONG',                                         X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=04,                                              X        
               POS=(03,11)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='RELS TO STORE',                                X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=13,                                              X        
               POS=(03,43)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='STORE SETUP',                                  X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=11,                                              X        
               POS=(03,62)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SEL',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(04,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NAME  NAME',                                   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=10,                                              X        
               POS=(04,05)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TYP YEAR',                                     X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=09,                                              X        
               POS=(04,32)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='BEGIN',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=05,                                              X        
               POS=(04,42)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='END',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=04,                                              X        
               POS=(04,53)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='BEGIN',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=05,                                              X        
               POS=(04,60)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='END',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(04,71)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='RPT',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(04,76)                                                      
*                                                                               
ASEL01  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(05,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(05,03)                                                      
ASNM01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(05,05)                                                      
ALNM01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(05,11)                                                      
ATYP01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(05,32)                                                      
AYEAR01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(05,36)                                                      
ARBEG01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,41)                                                      
AREND01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,50)                                                      
ASBEG01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,59)                                                      
ASEND01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,68)                                                      
ARPT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(05,78)                                                      
*                                                                               
ASEL02  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(06,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(06,03)                                                      
ASNM02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(06,05)                                                      
ALNM02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(06,11)                                                      
ATYP02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(06,32)                                                      
AYEAR02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(06,36)                                                      
ARBEG02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,41)                                                      
AREND02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,50)                                                      
ASBEG02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,59)                                                      
ASEND02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,68)                                                      
ARPT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(06,78)                                                      
*                                                                               
ASEL03  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(07,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(07,03)                                                      
ASNM03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(07,05)                                                      
ALNM03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(07,11)                                                      
ATYP03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(07,32)                                                      
AYEAR03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(07,36)                                                      
ARBEG03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,41)                                                      
AREND03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,50)                                                      
ASBEG03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,59)                                                      
ASEND03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,68)                                                      
ARPT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(07,78)                                                      
*                                                                               
ASEL04  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(08,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(08,03)                                                      
ASNM04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(08,05)                                                      
ALNM04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(08,11)                                                      
ATYP04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(08,32)                                                      
AYEAR04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(08,36)                                                      
ARBEG04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,41)                                                      
AREND04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,50)                                                      
ASBEG04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,59)                                                      
ASEND04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,68)                                                      
ARPT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(08,78)                                                      
*                                                                               
ASEL05  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(09,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(09,03)                                                      
ASNM05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(09,05)                                                      
ALNM05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(09,11)                                                      
ATYP05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(09,32)                                                      
AYEAR05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(09,36)                                                      
ARBEG05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,41)                                                      
AREND05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,50)                                                      
ASBEG05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,59)                                                      
ASEND05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,68)                                                      
ARPT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(09,78)                                                      
*                                                                               
ASEL06  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(10,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(10,03)                                                      
ASNM06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(10,05)                                                      
ALNM06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(10,11)                                                      
ATYP06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(10,32)                                                      
AYEAR06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(10,36)                                                      
ARBEG06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,41)                                                      
AREND06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,50)                                                      
ASBEG06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,59)                                                      
ASEND06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,68)                                                      
ARPT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(10,78)                                                      
*                                                                               
ASEL07  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(11,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(11,03)                                                      
ASNM07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(11,05)                                                      
ALNM07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(11,11)                                                      
ATYP07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(11,32)                                                      
AYEAR07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(11,36)                                                      
ARBEG07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,41)                                                      
AREND07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,50)                                                      
ASBEG07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,59)                                                      
ASEND07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,68)                                                      
ARPT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(11,78)                                                      
*                                                                               
ASEL08  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(12,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(12,03)                                                      
ASNM08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(12,05)                                                      
ALNM08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(12,11)                                                      
ATYP08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(12,32)                                                      
AYEAR08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(12,36)                                                      
ARBEG08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,41)                                                      
AREND08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,50)                                                      
ASBEG08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,59)                                                      
ASEND08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,68)                                                      
ARPT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(12,78)                                                      
*                                                                               
ASEL09  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(13,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(13,03)                                                      
ASNM09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(13,05)                                                      
ALNM09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(13,11)                                                      
ATYP09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(13,32)                                                      
AYEAR09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(13,36)                                                      
ARBEG09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,41)                                                      
AREND09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,50)                                                      
ASBEG09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,59)                                                      
ASEND09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,68)                                                      
ARPT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(13,78)                                                      
*                                                                               
ASEL10  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(14,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(14,03)                                                      
ASNM10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(14,05)                                                      
ALNM10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(14,11)                                                      
ATYP10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(14,32)                                                      
AYEAR10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(14,36)                                                      
ARBEG10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,41)                                                      
AREND10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,50)                                                      
ASBEG10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,59)                                                      
ASEND10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,68)                                                      
ARPT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(14,78)                                                      
*                                                                               
ASEL11  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(15,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(15,03)                                                      
ASNM11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(15,05)                                                      
ALNM11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(15,11)                                                      
ATYP11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(15,32)                                                      
AYEAR11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(15,36)                                                      
ARBEG11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,41)                                                      
AREND11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,50)                                                      
ASBEG11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,59)                                                      
ASEND11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,68)                                                      
ARPT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(15,78)                                                      
*                                                                               
ASEL12  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(16,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               POS=(16,03)                                                      
ASNM12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(16,05)                                                      
ALNM12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=20,                                              X        
               POS=(16,11)                                                      
ATYP12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(16,32)                                                      
AYEAR12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(16,36)                                                      
ARBEG12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,41)                                                      
AREND12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,50)                                                      
ASBEG12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,59)                                                      
ASEND12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,68)                                                      
ARPT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=01,                                              X        
               POS=(16,78)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=25,                                              X        
               POS=(18,47)                                                      
ASELIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(18,73),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
