*          DATA SET POKM033    AT LEVEL 009 AS OF 10/06/93                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*      MAPSET :  POKM033                                                00004**6
*      MAP    :  PO033A                                                 00005**6
*      PROGRAM:  POKCS033                                               00006**6
*                                                                       00007   
************************************************************            00008   
POKM033  DFHMSD TYPE=MAP,                                              X00009**6
               CTRL=(FREEKB),                                          X00010   
               LANG=COBOL,                                             X00011   
               MODE=INOUT,                                             X00012   
               TIOAPFX=YES                                              00013   
PO033A   DFHMDI LINE=02,                                               X00014**6
               COLUMN=01,                                              X00015   
               SIZE=(19,80),                                           X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT)                                   00018   
         DFHMDF ATTRB=(ASKIP),                                         X00019   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00020   
               COLOR=NEUTRAL,                                          X00021   
               LENGTH=22,                                              X00022**2
               POS=(03,1)                                               00023   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00024   
               JUSTIFY=(LEFT,BLANK),                                   X00025   
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZZZZZ',                                      X00027**8
               LENGTH=8,                                               X00028**8
               POS=(03,24)                                              00029   
         DFHMDF ATTRB=(ASKIP),                                         X00039   
               INITIAL='VENDOR NAME..........:',                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=22,                                              X00042   
               POS=(04,1)                                               00043   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=35,                                              X00046   
               POS=(04,24)                                              00047   
         DFHMDF ATTRB=(ASKIP),                                         X00030   
               INITIAL='DEPARTMENT...........:',                       X00031   
               COLOR=NEUTRAL,                                          X00032   
               LENGTH=22,                                              X00033   
               POS=(05,01)                                              00034   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00035   
               COLOR=BLUE,                                             X00036   
               LENGTH=3,                                               X00037   
               POS=(05,24)                                              00038   
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='OFFICE OF PLACEMENT.....:',                    X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=25,                                              X00051   
               POS=(07,1)                                               00052   
AOFPLAC  DFHMDF ATTRB=(ASKIP),                                         X00053**6
               COLOR=BLUE,                                             X00054**6
               LENGTH=40,                                              X00055   
               POS=(07,27)                                              00056   
         DFHMDF ATTRB=(ASKIP),                                         X00075   
               INITIAL='PARENT..................:',                    X00076   
               COLOR=NEUTRAL,                                          X00077   
               LENGTH=25,                                              X00078   
               POS=(08,1)                                               00079   
APARENT  DFHMDF ATTRB=(ASKIP),                                         X00080**6
               COLOR=BLUE,                                             X00081**6
               LENGTH=35,                                              X00082   
               POS=(08,27)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00057   
               INITIAL='FACTORY NAME............:',                    X00058   
               COLOR=NEUTRAL,                                          X00059   
               LENGTH=25,                                              X00060   
               POS=(09,1)                                               00061   
AFACTNM  DFHMDF ATTRB=(ASKIP),                                         X00062**6
               COLOR=BLUE,                                             X00063**6
               LENGTH=35,                                              X00064   
               POS=(09,27)                                              00065   
         DFHMDF ATTRB=(ASKIP),                                         X00066   
               INITIAL='COUNTRY OF PRODUCTION...:',                    X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=25,                                              X00069   
               POS=(10,1)                                               00070   
ACOUNPR  DFHMDF ATTRB=(ASKIP),                                         X00071**6
               COLOR=BLUE,                                             X00072**6
               LENGTH=40,                                              X00073   
               POS=(10,27)                                              00074   
***********************************************                                 
         DFHMDF ATTRB=(ASKIP),                                         X00076   
               INITIAL='QUOTA CATEGORY CODE.....:',                    X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=25,                                              X00079   
               POS=(11,1)                                               00080   
AQTACTG  DFHMDF ATTRB=(ASKIP),                                         X00081   
               COLOR=BLUE,                                             X00082   
               LENGTH=05,                                              X00084   
               POS=(11,27)                                              00085   
AQTADSC  DFHMDF ATTRB=(ASKIP),                                         X00081   
               COLOR=BLUE,                                             X00082   
               LENGTH=40,                                              X00084   
               POS=(11,33)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00066   
               INITIAL='FREE ON BOARD(FOB)......:',                    X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=25,                                              X00069   
               POS=(12,1)                                               00070   
AFOB     DFHMDF ATTRB=(ASKIP),                                         X00071**6
               COLOR=BLUE,                                             X00072**6
               LENGTH=30,                                              X00073   
               POS=(12,27)                                              00074   
AFOBCTY  DFHMDF ATTRB=(ASKIP),                                         X00125   
               COLOR=BLUE,                                             X00126   
               LENGTH=3,                                               X00128   
               POS=(12,59)                                              00129   
         DFHMDF ATTRB=(ASKIP),                                         X00112   
               INITIAL='PORT OF ENTRY (POE).....:',                    X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=25,                                              X00115   
               POS=(13,1)                                               00116**9
APORENT  DFHMDF ATTRB=(ASKIP),                                         X00117**6
               COLOR=BLUE,                                             X00118**6
               LENGTH=30,                                              X00119   
               POS=(13,27)                                              00120**9
APENTST  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=02,                                              X00156   
               POS=(13,59)                                              00157**8
         DFHMDF ATTRB=(ASKIP),                                         X00112   
               INITIAL='UNITS/CUBIC METERS (CBM):',                    X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=25,                                              X00115   
               POS=(14,1)                                               00116**9
AUNTCBM  DFHMDF ATTRB=(ASKIP),                                         X00117**6
               PICOUT='ZZZZZ9',                                        X00027**7
               COLOR=BLUE,                                             X00118**6
               LENGTH=06,                                              X00119   
               POS=(14,27)                                              00120**9
         DFHMDF ATTRB=(ASKIP),                                         X00117**6
               INITIAL='HANG TAG NUMBER.........:',                    X00122   
               COLOR=NEUTRAL,                                          X00118**6
               LENGTH=25,                                              X00119   
               POS=(15,01)                                              00120**9
ATAGID   DFHMDF ATTRB=(ASKIP),                                         X00126**6
               COLOR=BLUE,                                             X00127**6
               LENGTH=09,                                              X00128   
               POS=(15,27)                                              00129**9
         DFHMDF ATTRB=(ASKIP),                                         X00117**6
               INITIAL='HANG TAG DESCRIPTION....:',                    X00122   
               COLOR=NEUTRAL,                                          X00118**6
               LENGTH=25,                                              X00119   
               POS=(16,01)                                              00120**9
ATAGNBR  DFHMDF ATTRB=(ASKIP),                                         X00126**6
               COLOR=BLUE,                                             X00127**6
               LENGTH=20,                                              X00128   
               POS=(16,27)                                              00129**9
         DFHMDF ATTRB=(ASKIP),                                         X00121   
               INITIAL='START X-FACTORY DATE....:',                    X00122   
               COLOR=NEUTRAL,                                          X00123   
               LENGTH=25,                                              X00124   
               POS=(18,1)                                               00125**9
ASTEXT   DFHMDF ATTRB=(ASKIP),                                         X00126**6
               COLOR=BLUE,                                             X00127**6
               LENGTH=10,                                              X00128   
               POS=(18,27)                                              00129**9
         DFHMDF ATTRB=(ASKIP),                                         X00121   
               INITIAL='TRIP START DATE:',                             X00122   
               COLOR=NEUTRAL,                                          X00123   
               LENGTH=16,                                              X00124   
               POS=(18,40)                                              00125**9
ATRPSTT  DFHMDF ATTRB=(ASKIP),                                         X00126**6
               COLOR=BLUE,                                             X00127**6
               LENGTH=10,                                              X00128   
               POS=(18,57)                                              00129**9
         DFHMDF ATTRB=(ASKIP),                                         X00130**7
               INITIAL='LAST X-FACTORY DATE.....:',                    X00131**7
               COLOR=NEUTRAL,                                          X00132**7
               LENGTH=25,                                              X00133**7
               POS=(19,1)                                               00134**9
ALASEXT  DFHMDF ATTRB=(ASKIP),                                         X00135**7
               COLOR=BLUE,                                             X00136**7
               LENGTH=10,                                              X00137**7
               POS=(19,27)                                              00138**9
         DFHMDF ATTRB=(ASKIP),                                         X00130**7
               INITIAL='ELC LOAD DATE..:',                             X00131**7
               COLOR=NEUTRAL,                                          X00132**7
               LENGTH=16,                                              X00133**7
               POS=(19,40)                                              00134**9
AELCLOT  DFHMDF ATTRB=(ASKIP),                                         X00135**7
               COLOR=BLUE,                                             X00136**7
               LENGTH=10,                                              X00137**7
               POS=(19,57)                                              00138**9
         DFHMSD TYPE=FINAL                                              00139   
         END                                                            00140   
