  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  POKM106                                            *   00005   
*        MAP     PO106A                                             *   00006   
*        PROGRAM POKCS106                                           *   00007   
*        TRANSID W106                                               *   00008   
*        SYSTEM  CICS ARCH - PO ITEM SUMMARY LIST                   *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
POKM106 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
PO106A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
         DFHMDF ATTRB=(PROT),                                          X00024   
               INITIAL='ITEMS:',                                       X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=6,                                               X00027   
               POS=(01,44)                                              00028   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029   
               COLOR=GREEN,                                            X00030   
               HILIGHT=UNDERLINE,                                      X00031   
               PICOUT='ZZZ,ZZ9',                                       X00032   
               LENGTH=7,                                               X00033   
               POS=(01,51)                                              00034   
         DFHMDF ATTRB=(PROT),                                          X00035   
               INITIAL='TO',                                           X00036   
               COLOR=NEUTRAL,                                          X00037   
               LENGTH=2,                                               X00038   
               POS=(01,59)                                              00039   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZ,ZZ9',                                       X00042   
               LENGTH=7,                                               X00043   
               POS=(01,62)                                              00044   
         DFHMDF ATTRB=(PROT),                                          X00045   
               INITIAL='OF',                                           X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=2,                                               X00048   
               POS=(01,70)                                              00049   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZZ,ZZ9',                                       X00052   
               LENGTH=7,                                               X00053   
               POS=(01,73)                                              00054   
*                                                                       00055   
         DFHMDF ATTRB=(ASKIP),                                         X00056   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00057   
               COLOR=NEUTRAL,                                          X00058   
               LENGTH=22,                                              X00059   
               POS=(02,1)                                               00060   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00061   
               COLOR=BLUE,                                             X00062   
               PICOUT='ZZZZZZZZ',                                      X00063   
               LENGTH=8,                                               X00064   
               POS=(02,24)                                              00065   
         DFHMDF ATTRB=(ASKIP),                                         X00066   
               INITIAL='DEPARTMENT:',                                  X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=11,                                              X00069   
               POS=(02,37)                                              00070   
AHDEPT   DFHMDF ATTRB=(ASKIP),                                         X00071   
               COLOR=BLUE,                                             X00072   
               LENGTH=3,                                               X00073   
               POS=(02,49)                                              00074   
*                                                                       00075   
         DFHMDF ATTRB=(ASKIP),                                         X00076   
               INITIAL='VENDOR NAME:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(03,1)                                               00080   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00081   
               COLOR=BLUE,                                             X00082   
               LENGTH=30,                                              X00083   
               POS=(03,14)                                              00084   
*                                                                       00085   
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='MJ SU',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(06,14)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00113   
               INITIAL='SEL LINE DPT CL CL SKU',                       X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=22,                                              X00116   
               POS=(07,1)                                               00117   
         DFHMDF ATTRB=(ASKIP),                                         X00118   
               INITIAL='VENDOR / COLOR DESC',                          X00119**3
               COLOR=NEUTRAL,                                          X00120   
               LENGTH=19,                                              X00121**3
               POS=(07,29)                                              00122   
         DFHMDF ATTRB=(ASKIP),                                         X00123   
               INITIAL='SIZE DESC           QUANTITY',                 X00124**4
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=28,                                              X00126**4
               POS=(07,50)                                              00127**4
*                                                                       00128   
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00129   
               COLOR=GREEN,                                            X00130   
               HILIGHT=UNDERLINE,                                      X00131   
               LENGTH=1,                                               X00132   
               POS=(08,2)                                               00133   
         DFHMDF ATTRB=(ASKIP),                                         X00134   
               LENGTH=1,                                               X00136   
               POS=(08,4)                                               00135   
ALNE1    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(08,06)                                              00141   
ADPT1    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=3,                                               X00144   
               POS=(08,10)                                              00145**3
AMCL1    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(08,14)                                                      
ACL1     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(08,17)                                              00149**3
ASKU1    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(08,20)                                              00153**3
AVDES1   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(08,29)                                              00157   
ASDES1   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(08,50)                                              00157   
AQTY1    DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(08,72)                                              00166**3
ACDES1   DFHMDF ATTRB=(ASKIP),                                         X00186   
               COLOR=BLUE,                                             X00187   
               LENGTH=25,                                              X00188   
               POS=(09,29)                                              00189   
*                                                                       00194   
ASEL2    DFHMDF ATTRB=(UNPROT),                                        X00195   
               COLOR=GREEN,                                            X00196   
               HILIGHT=UNDERLINE,                                      X00197   
               LENGTH=1,                                               X00198   
               POS=(10,2)                                               00199   
         DFHMDF ATTRB=(ASKIP),                                         X00200   
               LENGTH=1,                                               X00202   
               POS=(10,4)                                               00201   
ALNE2    DFHMDF ATTRB=(ASKIP),                                         X00203   
               COLOR=BLUE,                                             X00204   
               PICOUT='ZZZ',                                           X00205   
               LENGTH=3,                                               X00206   
               POS=(10,06)                                              00207   
ADPT2    DFHMDF ATTRB=(ASKIP),                                         X00208   
               COLOR=BLUE,                                             X00209   
               LENGTH=3,                                               X00210   
               POS=(10,10)                                              00211**3
AMCL2    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(10,14)                                                      
ACL2     DFHMDF ATTRB=(ASKIP),                                         X00212   
               COLOR=BLUE,                                             X00213   
               LENGTH=2,                                               X00214   
               POS=(10,17)                                              00215**3
ASKU2    DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=BLUE,                                             X00217   
               LENGTH=8,                                               X00218   
               POS=(10,20)                                              00219**3
AVDES2   DFHMDF ATTRB=(ASKIP),                                         X00220   
               COLOR=BLUE,                                             X00221   
               LENGTH=20,                                              X00222   
               POS=(10,29)                                              00223   
ASDES2   DFHMDF ATTRB=(ASKIP),                                         X00220   
               COLOR=BLUE,                                             X00221   
               LENGTH=20,                                              X00222   
               POS=(10,50)                                              00223   
AQTY2    DFHMDF ATTRB=(ASKIP),                                         X00228   
               COLOR=BLUE,                                             X00229   
               PICOUT='ZZZZZZ',                                        X00230   
               LENGTH=6,                                               X00231   
               POS=(10,72)                                              00232**3
ACDES2   DFHMDF ATTRB=(ASKIP),                                         X00252   
               COLOR=BLUE,                                             X00253   
               LENGTH=25,                                              X00254   
               POS=(11,29)                                              00255   
*                                                                       00260   
ASEL3    DFHMDF ATTRB=(UNPROT),                                        X00261   
               COLOR=GREEN,                                            X00262   
               HILIGHT=UNDERLINE,                                      X00263   
               LENGTH=1,                                               X00264   
               POS=(12,2)                                               00265   
         DFHMDF ATTRB=(ASKIP),                                         X00266   
               LENGTH=1,                                               X00268   
               POS=(12,4)                                               00267   
ALNE3    DFHMDF ATTRB=(ASKIP),                                         X00269   
               COLOR=BLUE,                                             X00270   
               PICOUT='ZZZ',                                           X00271   
               LENGTH=3,                                               X00272   
               POS=(12,06)                                              00273   
ADPT3    DFHMDF ATTRB=(ASKIP),                                         X00274   
               COLOR=BLUE,                                             X00275   
               LENGTH=3,                                               X00276   
               POS=(12,10)                                              00277**3
AMCL3    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(12,14)                                                      
ACL3     DFHMDF ATTRB=(ASKIP),                                         X00278   
               COLOR=BLUE,                                             X00279   
               LENGTH=2,                                               X00280   
               POS=(12,17)                                              00281**3
ASKU3    DFHMDF ATTRB=(ASKIP),                                         X00282   
               COLOR=BLUE,                                             X00283   
               LENGTH=8,                                               X00284   
               POS=(12,20)                                              00285**3
AVDES3   DFHMDF ATTRB=(ASKIP),                                         X00286   
               COLOR=BLUE,                                             X00287   
               LENGTH=20,                                              X00288   
               POS=(12,29)                                              00289   
ASDES3   DFHMDF ATTRB=(ASKIP),                                         X00286   
               COLOR=BLUE,                                             X00287   
               LENGTH=20,                                              X00288   
               POS=(12,50)                                              00289   
AQTY3    DFHMDF ATTRB=(ASKIP),                                         X00294   
               COLOR=BLUE,                                             X00295   
               PICOUT='ZZZZZZ',                                        X00296   
               LENGTH=6,                                               X00297   
               POS=(12,72)                                              00298**3
ACDES3   DFHMDF ATTRB=(ASKIP),                                         X00318   
               COLOR=BLUE,                                             X00319   
               LENGTH=25,                                              X00320   
               POS=(13,29)                                              00321   
*                                                                       00326   
ASEL4    DFHMDF ATTRB=(UNPROT),                                        X00327   
               COLOR=GREEN,                                            X00328   
               HILIGHT=UNDERLINE,                                      X00329   
               LENGTH=1,                                               X00330   
               POS=(14,2)                                               00331   
         DFHMDF ATTRB=(ASKIP),                                         X00332   
               LENGTH=1,                                               X00334   
               POS=(14,4)                                               00333   
ALNE4    DFHMDF ATTRB=(ASKIP),                                         X00335   
               COLOR=BLUE,                                             X00336   
               PICOUT='ZZZ',                                           X00337   
               LENGTH=3,                                               X00338   
               POS=(14,06)                                              00339   
ADPT4    DFHMDF ATTRB=(ASKIP),                                         X00340   
               COLOR=BLUE,                                             X00341   
               LENGTH=3,                                               X00342   
               POS=(14,10)                                              00343**3
AMCL4    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(14,14)                                                      
ACL4     DFHMDF ATTRB=(ASKIP),                                         X00344   
               COLOR=BLUE,                                             X00345   
               LENGTH=2,                                               X00346   
               POS=(14,17)                                              00347**3
ASKU4    DFHMDF ATTRB=(ASKIP),                                         X00348   
               COLOR=BLUE,                                             X00349   
               LENGTH=8,                                               X00350   
               POS=(14,20)                                              00351**3
AVDES4   DFHMDF ATTRB=(ASKIP),                                         X00352   
               COLOR=BLUE,                                             X00353   
               LENGTH=20,                                              X00354   
               POS=(14,29)                                              00355   
ASDES4   DFHMDF ATTRB=(ASKIP),                                         X00352   
               COLOR=BLUE,                                             X00353   
               LENGTH=20,                                              X00354   
               POS=(14,50)                                              00355   
AQTY4    DFHMDF ATTRB=(ASKIP),                                         X00360   
               COLOR=BLUE,                                             X00361   
               PICOUT='ZZZZZZ',                                        X00362   
               LENGTH=6,                                               X00363   
               POS=(14,72)                                              00364**3
ACDES4   DFHMDF ATTRB=(ASKIP),                                         X00384   
               COLOR=BLUE,                                             X00385   
               LENGTH=25,                                              X00386   
               POS=(15,29)                                              00387   
*                                                                       00392   
ASEL5    DFHMDF ATTRB=(UNPROT),                                        X00393   
               COLOR=GREEN,                                            X00394   
               HILIGHT=UNDERLINE,                                      X00395   
               LENGTH=1,                                               X00396   
               POS=(16,2)                                               00397   
         DFHMDF ATTRB=(ASKIP),                                         X00398   
               LENGTH=1,                                               X00400   
               POS=(16,4)                                               00399   
ALNE5    DFHMDF ATTRB=(ASKIP),                                         X00401   
               COLOR=BLUE,                                             X00402   
               PICOUT='ZZZ',                                           X00403   
               LENGTH=3,                                               X00404   
               POS=(16,06)                                              00405   
ADPT5    DFHMDF ATTRB=(ASKIP),                                         X00406   
               COLOR=BLUE,                                             X00407   
               LENGTH=3,                                               X00408   
               POS=(16,10)                                              00409**3
AMCL5    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(16,14)                                                      
ACL5     DFHMDF ATTRB=(ASKIP),                                         X00410   
               COLOR=BLUE,                                             X00411   
               LENGTH=2,                                               X00412   
               POS=(16,17)                                              00413**3
ASKU5    DFHMDF ATTRB=(ASKIP),                                         X00414   
               COLOR=BLUE,                                             X00415   
               LENGTH=8,                                               X00416   
               POS=(16,20)                                              00417**3
AVDES5   DFHMDF ATTRB=(ASKIP),                                         X00418   
               COLOR=BLUE,                                             X00419   
               LENGTH=20,                                              X00420   
               POS=(16,29)                                              00421   
ASDES5   DFHMDF ATTRB=(ASKIP),                                         X00418   
               COLOR=BLUE,                                             X00419   
               LENGTH=20,                                              X00420   
               POS=(16,50)                                              00421   
AQTY5    DFHMDF ATTRB=(ASKIP),                                         X00426   
               COLOR=BLUE,                                             X00427   
               PICOUT='ZZZZZZ',                                        X00428   
               LENGTH=6,                                               X00429   
               POS=(16,72)                                              00430**3
ACDES5   DFHMDF ATTRB=(ASKIP),                                         X00450**3
               COLOR=BLUE,                                             X00451   
               LENGTH=25,                                              X00452   
               POS=(17,29)                                              00453   
*                                                                       00458   
         DFHMDF ATTRB=(PROT),                                          X00459   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00460   
               COLOR=NEUTRAL,                                          X00461   
               LENGTH=25,                                              X00462   
               POS=(19,45)                                              00463   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00464   
               COLOR=BLUE,                                             X00465   
               PICOUT='ZZZ,ZZ9',                                       X00466   
               LENGTH=7,                                               X00467   
               POS=(19,72)                                              00468   
*                                                                       00469   
         DFHMSD TYPE=FINAL                                              00470   
         END                                                            00471   
