*          DATA SET POKM103                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM103                                            *           
*        MAP     PO103A                                             *           
*        PROGRAM POKCS103                                           *           
*        TRANSID W103                                               *           
*        SYSTEM  CICS ARCH - PURCHASE ORDER SELECTION INQUIRY       *           
*-------------------------------------------------------------------*           
POKM103 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TIOAPFX=YES,                                            X        
               TERM=3270-2                                                      
PO103A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*       *                                                                       
ASETNME  DFHMDF ATTRB=(ASKIP,PROT),                                    X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=05,                                              X        
               POS=(01,33)                                                      
ASETYR   DFHMDF ATTRB=(ASKIP,PROT),                                    X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=04,                                              X        
               POS=(01,39)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='SET',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(01,44)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='+----------------+',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(02,61)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='PURCHASE ORDER NUMBER:',                       X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=22,                                              X        
               POS=(03,2)                                                       
APONUM   DFHMDF ATTRB=(UNPROT,IC),                                     X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZZZZZ',                                      X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(03,25)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(03,34)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='| WKS-WORKSHEET  |',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(03,61)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='DPT MCL SCL....:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(04,2)                                                       
ADEPT    DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=3,                                               X        
               POS=(04,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(04,23)                                                      
AMCL     DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X        
               POS=(04,25)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL=' ',                                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=1,                                               X        
               POS=(04,28)                                                      
ACLASS   DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X        
               POS=(04,30)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(04,33)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='| ACT-ACTIVE     |',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(04,61)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='SKU............:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(05,2)                                                       
ASKU     DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(05,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(05,28)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STATUS GROUP...:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(05,36)                                                      
ASTGRP   DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=3,                                               X        
               POS=(05,53)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='===>| CMP-COMPLETE   |',                       X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=22,                                              X        
               POS=(05,57)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STORE..........:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(06,2)                                                       
ASTORE   DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=4,                                               X        
               POS=(06,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(06,24)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STATUS CODE....:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(06,36)                                                      
ASC1     DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X        
               POS=(06,53)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(06,56)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='| BTH-ACTIVE AND |',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(06,61)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='AD DATE........:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(07,2)                                                       
ADDATE   DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(07,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(07,28)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='PO TYPE........:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(07,36)                                                      
APOTYPE  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=2,                                               X        
               POS=(07,53)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(07,56)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='|     COMPLETE   |',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(07,61)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='OTB RANGE(MMYY):',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(08,2)                                                       
AOTBBEG  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=4,                                               X        
               POS=(08,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=2,                                               X        
               POS=(08,24)                                                      
AOTBEND  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=4,                                               X        
               POS=(08,27)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(08,32)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='+----------------+',                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=18,                                              X        
               POS=(08,61)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='SHIP (MMDDYY)..:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(09,2)                                                       
ASHPBEG  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=6,                                               X        
               POS=(09,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=2,                                               X        
               POS=(09,26)                                                      
ASHPEND  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=6,                                               X        
               POS=(09,29)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(09,36)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='NEW STORE IND..:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(10,02)                                                      
ANEWSTR  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=1,                                               X        
               POS=(10,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(10,21)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='IMPORT PO NUMBER:',                            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=17,                                              X        
               POS=(10,36)                                                      
AIPONUM  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZZZZZ',                                      X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(10,54)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(10,63)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='VENDOR NAME....:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(12,2)                                                       
AVENDNM  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=30,                                              X        
               POS=(12,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(12,50)                                                      
*       *                                                                       
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='VENDOR STYLE...:',                             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=16,                                              X        
               POS=(13,02)                                                      
ASTYLE   DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=20,                                              X        
               POS=(13,19)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(13,40)                                                      
*       *                                                                       
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
