*          DATA SET POKM067    AT LEVEL 012 AS OF 06/12/95                      
*          DATA SET POKM067    AT LEVEL 002 AS OF 05/22/95              00001*10
*          DATA SET POKM067    AT LEVEL 013 AS OF 05/04/95              00002*10
*          DATA SET POKM067    AT LEVEL 001 AS OF 04/20/95              00003*10
*          DATA SET POKM067    AT LEVEL 001 AS OF 04/12/95              00004*10
*          DATA SET POKM067    AT LEVEL 003 AS OF 03/27/95              00005*10
*          DATA SET POKM067    AT LEVEL 002 AS OF 02/20/95              00006*10
*          DATA SET POKM067    AT LEVEL 008 AS OF 02/17/95              00007*10
*          DATA SET POKM066A1  AT LEVEL 008 AS OF 01/23/95              00008*10
  PRINT  NOGEN                                                          00009*10
*********************************************************************** 00010*10
*                                                                       00011*10
*        MAPSET  : POKM067                                              00012*10
*        MAP     : PO067A                                               00013*10
*        PROGRAM : POKCS067                                             00014*10
*        TRANSID : W067 - ADDITIONAL PO INFORMATION MENU                00015*10
*        SYSTEM  : CICS ARCHITECTURE                                    00016*10
*                                                                       00017*10
*********************************************************************** 00018*10
POKM067  DFHMSD TYPE=MAP,                                              X00019*10
               MODE=INOUT,                                             X00020*10
               LANG=COBOL,                                             X00021*10
               TIOAPFX=YES,                                            X00022*10
               CTRL=(FREEKB)                                            00023*10
PO067A   DFHMDI LINE=02,                                               X00024*10
               COLUMN=01,                                              X00025*10
               SIZE=(19,80),                                           X00026*10
               MAPATTS=(COLOR,HILIGHT),                                X00027*10
               DSATTS=(COLOR,HILIGHT)                                   00028*10
         DFHMDF ATTRB=(ASKIP),                                         X00029*10
               INITIAL='PO NUMBER:',                                   X00030*10
               COLOR=NEUTRAL,                                          X00031*10
               LENGTH=10,                                              X00032*10
               POS=(04,28)                                              00033*10
APONMBR  DFHMDF ATTRB=(PROT),                                          X00034*10
               COLOR=BLUE,                                             X00035*10
               PICOUT='ZZZZZZZZ',                                      X00036*10
               LENGTH=08,                                              X00037*10
               POS=(04,39)                                              00038*10
         DFHMDF ATTRB=(ASKIP),                                         X00039*10
               INITIAL='VENDOR...:',                                   X00040*10
               COLOR=NEUTRAL,                                          X00041*10
               LENGTH=10,                                              X00042*10
               POS=(05,28)                                              00043*10
AVDRNAM  DFHMDF ATTRB=(PROT),                                          X00044*10
               COLOR=BLUE,                                             X00045*10
               LENGTH=30,                                              X00046*10
               POS=(05,39)                                              00047*10
         DFHMDF ATTRB=(ASKIP),                                         X00048*11
               INITIAL='DEPT.....:',                                   X00049*11
               COLOR=NEUTRAL,                                          X00050*11
               LENGTH=10,                                              X00051*11
               POS=(06,28)                                              00052*11
ADEPTNO  DFHMDF ATTRB=(PROT),                                          X00053*11
               COLOR=BLUE,                                             X00054*11
               LENGTH=3,                                               X00055*11
               POS=(06,39)                                              00056*11
         DFHMDF ATTRB=(ASKIP),                                         X00057*10
               INITIAL='ADDITIONAL PO INFORMATION MENU',               X00058*10
               COLOR=NEUTRAL,                                          X00059*10
               LENGTH=30,                                              X00060*10
               POS=(08,28)                                              00061*10
         DFHMDF ATTRB=(ASKIP),                                         X00062*10
               INITIAL='PF13  EDI - PO',                               X00063*12
               COLOR=NEUTRAL,                                          X00064*10
               LENGTH=14,                                              X00065*10
               POS=(10,28)                                              00066*10
         DFHMDF ATTRB=(ASKIP),                                         X00067*10
               INITIAL='PF14  EDI - ASN',                              X00068*12
               COLOR=NEUTRAL,                                          X00069*10
               LENGTH=15,                                              X00070*10
               POS=(11,28)                                              00071*10
         DFHMDF ATTRB=(ASKIP),                                         X00072*10
               INITIAL='PF15  EDI - INVOICE',                          X00073*12
               COLOR=NEUTRAL,                                          X00074*10
               LENGTH=19,                                              X00075*10
               POS=(12,28)                                              00076*10
         DFHMDF ATTRB=(ASKIP),                                         X00077*10
               INITIAL='PF16  RECEIPTS',                               X00078*12
               COLOR=NEUTRAL,                                          X00079*10
               LENGTH=14,                                              X00080*10
               POS=(13,28)                                              00081*10
         DFHMDF ATTRB=(ASKIP),                                         X00082*10
               INITIAL='PF17  TRANSPORTATION',                         X00083*12
               COLOR=NEUTRAL,                                          X00084*10
               LENGTH=20,                                              X00085*10
               POS=(14,28)                                              00086*10
         DFHMDF ATTRB=(ASKIP),                                         X00087*10
               INITIAL='PF18  INVOICES',                               X00088*12
               COLOR=NEUTRAL,                                          X00089*10
               LENGTH=14,                                              X00090*10
               POS=(15,28)                                              00091*10
         DFHMDF ATTRB=(ASKIP),                                         X00092*10
               INITIAL='PF21  IMPORT',                                 X00093*12
               COLOR=NEUTRAL,                                          X00094*10
               LENGTH=12,                                              X00095*10
               POS=(16,28)                                              00096*10
         DFHMDF ATTRB=(ASKIP),                                         X00092*10
               INITIAL='PF22  SHIPPING WINDOW HISTORY',                X00093*12
               COLOR=NEUTRAL,                                          X00094*10
               LENGTH=29,                                              X00095*10
               POS=(17,28)                                              00096*10
         DFHMDF ATTRB=(ASKIP),                                         X00092*10
               INITIAL='PF23  PRETICKET',                              X00093*12
               COLOR=NEUTRAL,                                          X00094*10
               LENGTH=15,                                              X00095*10
               POS=(18,28)                                              00096*10
         DFHMDF ATTRB=(ASKIP),                                         X00092*10
               INITIAL='PF24  EDI - IMPORT',                           X00093*12
               COLOR=NEUTRAL,                                          X00094*10
               LENGTH=18,                                              X00095*10
               POS=(19,28)                                              00096*10
         DFHMSD TYPE=FINAL                                              00097*10
         END                                                            00098*10
