*          DATA SET POKM061    AT LEVEL 002 AS OF 02/22/95                      
*          DATA SET POKM061    AT LEVEL 020 AS OF 02/22/95              00001   
  PRINT  NOGEN                                                          00002   
POKM061  DFHMSD TYPE=&SYSPARM,                                         X00003   
               TERM=3270-2,                                            X00004   
               LANG=COBOL,                                             X00005   
               MODE=INOUT,                                             X00006   
               TIOAPFX=YES,                                            X00007   
               STORAGE=AUTO                                             00008   
PO061A   DFHMDI LINE=02,                                               X00009   
               COLUMN=01,                                              X00010   
               SIZE=(19,80),                                           X00011   
               MAPATTS=(COLOR,HILIGHT),                                X00012   
               DSATTS=(COLOR,HILIGHT)                                   00013   
         DFHMDF ATTRB=(ASKIP),                                         X00014   
               POS=(01,1),                                             X00015   
               INITIAL=' ',                                            X00016   
               LENGTH=1                                                 00017   
         DFHMDF ATTRB=(PROT),                                          X00018   
               INITIAL='ITEMS:',                                       X00019   
               COLOR=NEUTRAL,                                          X00020   
               LENGTH=6,                                               X00021   
               POS=(01,44)                                              00022   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00023   
               JUSTIFY=(LEFT,BLANK),                                   X00024   
               COLOR=GREEN,                                            X00025   
               HILIGHT=UNDERLINE,                                      X00026   
               PICOUT='ZZZ,ZZ9',                                       X00027   
               LENGTH=7,                                               X00028   
               POS=(01,51)                                              00029   
         DFHMDF ATTRB=(PROT),                                          X00030   
               INITIAL='TO',                                           X00031   
               COLOR=NEUTRAL,                                          X00032   
               LENGTH=2,                                               X00033   
               POS=(01,59)                                              00034   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00035   
               JUSTIFY=(LEFT,BLANK),                                   X00036   
               COLOR=BLUE,                                             X00037   
               PICOUT='ZZZ,ZZ9',                                       X00038   
               LENGTH=7,                                               X00039   
               POS=(01,62)                                              00040   
         DFHMDF ATTRB=(PROT),                                          X00041   
               INITIAL='OF',                                           X00042   
               COLOR=NEUTRAL,                                          X00043   
               LENGTH=2,                                               X00044   
               POS=(01,70)                                              00045   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00046   
               JUSTIFY=(LEFT,BLANK),                                   X00047   
               COLOR=BLUE,                                             X00048   
               PICOUT='ZZZ,ZZ9',                                       X00049   
               LENGTH=7,                                               X00050   
               POS=(01,73)                                              00051   
         DFHMDF ATTRB=(PROT),                                          X00052   
               INITIAL='RLSE',                                         X00053   
               COLOR=NEUTRAL,                                          X00054   
               LENGTH=4,                                               X00055   
               POS=(03,14)                                              00056   
         DFHMDF ATTRB=(PROT),                                          X00057   
               INITIAL='RLSE',                                         X00058   
               COLOR=NEUTRAL,                                          X00059   
               LENGTH=4,                                               X00060   
               POS=(03,20)                                              00061   
         DFHMDF ATTRB=(PROT),                                          X00062   
               INITIAL='SHIP',                                         X00063   
               COLOR=NEUTRAL,                                          X00064   
               LENGTH=4,                                               X00065   
               POS=(03,48)                                              00066   
         DFHMDF ATTRB=(PROT),                                          X00067   
               INITIAL='CANCEL',                                       X00068   
               COLOR=NEUTRAL,                                          X00069   
               LENGTH=6,                                               X00070   
               POS=(03,55)                                              00071   
         DFHMDF ATTRB=(PROT),                                          X00072   
               INITIAL='SEL',                                          X00073   
               COLOR=NEUTRAL,                                          X00074   
               LENGTH=3,                                               X00075   
               POS=(03,80)                                              00076   
         DFHMDF ATTRB=(PROT),                                          X00077   
               INITIAL='PO',                                           X00078   
               COLOR=NEUTRAL,                                          X00079   
               LENGTH=2,                                               X00080   
               POS=(04,6)                                               00081   
         DFHMDF ATTRB=(PROT),                                          X00082   
               INITIAL='NUM',                                          X00083   
               COLOR=NEUTRAL,                                          X00084   
               LENGTH=3,                                               X00085   
               POS=(04,9)                                               00086   
         DFHMDF ATTRB=(PROT),                                          X00087   
               INITIAL='DAYS',                                         X00088   
               COLOR=NEUTRAL,                                          X00089   
               LENGTH=4,                                               X00090   
               POS=(04,14)                                              00091   
         DFHMDF ATTRB=(PROT),                                          X00092   
               INITIAL='DATE',                                         X00093   
               COLOR=NEUTRAL,                                          X00094   
               LENGTH=4,                                               X00095   
               POS=(04,20)                                              00096   
         DFHMDF ATTRB=(PROT),                                          X00097   
               INITIAL='DPT',                                          X00098   
               COLOR=NEUTRAL,                                          X00099   
               LENGTH=3,                                               X00100   
               POS=(04,26)                                              00101   
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(04,30),                                            X        
               INITIAL='MCL',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=3                                                         
         DFHMDF ATTRB=(ASKIP),                                         X00102   
               POS=(04,34),                                            X00103   
               INITIAL='SCL',                                          X00104   
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=3                                                 00106   
         DFHMDF ATTRB=(PROT),                                          X00107   
               INITIAL='VENDOR',                                       X00108   
               COLOR=NEUTRAL,                                          X00109   
               LENGTH=6,                                               X00110   
               POS=(04,38)                                              00111   
         DFHMDF ATTRB=(PROT),                                          X00112   
               INITIAL='DATE',                                         X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=4,                                               X00115   
               POS=(04,48)                                              00116   
         DFHMDF ATTRB=(PROT),                                          X00117   
               INITIAL='DATE',                                         X00118   
               COLOR=NEUTRAL,                                          X00119   
               LENGTH=4,                                               X00120   
               POS=(04,55)                                              00121   
         DFHMDF ATTRB=(PROT),                                          X00122   
               INITIAL='STATUS',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(04,67)                                              00126   
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00132   
               COLOR=GREEN,                                            X00133   
               HILIGHT=UNDERLINE,                                      X00134   
               LENGTH=1,                                               X00135   
               POS=(05,1)                                               00136   
AREL1    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=NEUTRAL,                                          X00138   
               LENGTH=1,                                               X00139   
               POS=(05,3)                                               00140   
APO1     DFHMDF ATTRB=(ASKIP),                                         X00141   
               COLOR=BLUE,                                             X00142   
               LENGTH=8,                                               X00143   
               PICOUT='ZZZZZZZ9',                                      X00144   
               POS=(05,5)                                               00145   
ARLS1    DFHMDF ATTRB=(ASKIP),                                         X00146   
               JUSTIFY=(LEFT,BLANK),                                   X00147   
               COLOR=BLUE,                                             X00148   
               PICOUT='-999',                                          X00149   
               LENGTH=4,                                               X00150   
               POS=(05,14)                                              00151   
ARLDT1   DFHMDF ATTRB=(ASKIP),                                         X00152   
               COLOR=BLUE,                                             X00153   
               LENGTH=6,                                               X00154   
               POS=(05,19)                                              00155   
ADPT1    DFHMDF ATTRB=(ASKIP),                                         X00156   
               COLOR=BLUE,                                             X00157   
               LENGTH=3,                                               X00158   
               POS=(05,26)                                              00159   
AMCL1    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(05,30)                                                      
ASCL1    DFHMDF ATTRB=(ASKIP),                                         X00160   
               COLOR=BLUE,                                             X00161   
               LENGTH=2,                                               X00162   
               POS=(05,34)                                              00163   
AVEND1   DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=10,                                              X00166   
               POS=(05,37)                                              00167   
ASHDT1   DFHMDF ATTRB=(ASKIP),                                         X00168   
               COLOR=BLUE,                                             X00169   
               LENGTH=6,                                               X00170   
               POS=(05,48)                                              00171   
ACADT1   DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               LENGTH=6,                                               X00174   
               POS=(05,55)                                              00175   
ASTS1    DFHMDF ATTRB=(ASKIP),                                         X00176   
               COLOR=BLUE,                                             X00177   
               LENGTH=18,                                              X00178   
               POS=(05,62)                                              00179   
ASEL2    DFHMDF ATTRB=(UNPROT),                                        X00186**2
               COLOR=GREEN,                                            X00187   
               HILIGHT=UNDERLINE,                                      X00188   
               LENGTH=1,                                               X00189   
               POS=(06,1)                                               00190   
AREL2    DFHMDF ATTRB=(ASKIP),                                         X00191   
               COLOR=NEUTRAL,                                          X00192   
               LENGTH=1,                                               X00193   
               POS=(06,3)                                               00194   
APO2     DFHMDF ATTRB=(ASKIP),                                         X00195   
               COLOR=BLUE,                                             X00196   
               LENGTH=8,                                               X00197   
               PICOUT='ZZZZZZZ9',                                      X00198   
               POS=(06,5)                                               00199   
ARLS2    DFHMDF ATTRB=(ASKIP),                                         X00200   
               JUSTIFY=(LEFT,BLANK),                                   X00201   
               COLOR=BLUE,                                             X00202   
               PICOUT='-999',                                          X00203   
               LENGTH=4,                                               X00204   
               POS=(06,14)                                              00205   
ARLDT2   DFHMDF ATTRB=(ASKIP),                                         X00206   
               COLOR=BLUE,                                             X00207   
               LENGTH=6,                                               X00208   
               POS=(06,19)                                              00209   
ADPT2    DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=3,                                               X00212   
               POS=(06,26)                                              00213   
AMCL2    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(06,30)                                                      
ASCL2    DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=2,                                               X00216   
               POS=(06,34)                                              00217   
AVEND2   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=10,                                              X00220   
               POS=(06,37)                                              00221   
ASHDT2   DFHMDF ATTRB=(ASKIP),                                         X00222   
               COLOR=BLUE,                                             X00223   
               LENGTH=6,                                               X00224   
               POS=(06,48)                                              00225   
ACADT2   DFHMDF ATTRB=(ASKIP),                                         X00226   
               COLOR=BLUE,                                             X00227   
               LENGTH=6,                                               X00228   
               POS=(06,55)                                              00229   
ASTS2    DFHMDF ATTRB=(ASKIP),                                         X00230   
               COLOR=BLUE,                                             X00231   
               LENGTH=18,                                              X00232   
               POS=(06,62)                                              00233   
ASEL3    DFHMDF ATTRB=(UNPROT),                                        X00240**2
               COLOR=GREEN,                                            X00241   
               HILIGHT=UNDERLINE,                                      X00242   
               LENGTH=1,                                               X00243   
               POS=(07,1)                                               00244   
AREL3    DFHMDF ATTRB=(ASKIP),                                         X00245   
               COLOR=NEUTRAL,                                          X00246   
               LENGTH=1,                                               X00247   
               POS=(07,3)                                               00248   
APO3     DFHMDF ATTRB=(ASKIP),                                         X00249   
               COLOR=BLUE,                                             X00250   
               LENGTH=8,                                               X00251   
               PICOUT='ZZZZZZZ9',                                      X00252   
               POS=(07,5)                                               00253   
ARLS3    DFHMDF ATTRB=(ASKIP),                                         X00254   
               JUSTIFY=(LEFT,BLANK),                                   X00255   
               COLOR=BLUE,                                             X00256   
               PICOUT='-999',                                          X00257   
               LENGTH=4,                                               X00258   
               POS=(07,14)                                              00259   
ARLDT3   DFHMDF ATTRB=(ASKIP),                                         X00260   
               COLOR=BLUE,                                             X00261   
               LENGTH=6,                                               X00262   
               POS=(07,19)                                              00263   
ADPT3    DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=BLUE,                                             X00265   
               LENGTH=3,                                               X00266   
               POS=(07,26)                                              00267   
AMCL3    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(07,30)                                                      
ASCL3    DFHMDF ATTRB=(ASKIP),                                         X00268   
               COLOR=BLUE,                                             X00269   
               LENGTH=2,                                               X00270   
               POS=(07,34)                                              00271   
AVEND3   DFHMDF ATTRB=(ASKIP),                                         X00272   
               COLOR=BLUE,                                             X00273   
               LENGTH=10,                                              X00274   
               POS=(07,37)                                              00275   
ASHDT3   DFHMDF ATTRB=(ASKIP),                                         X00276   
               COLOR=BLUE,                                             X00277   
               LENGTH=6,                                               X00278   
               POS=(07,48)                                              00279   
ACADT3   DFHMDF ATTRB=(ASKIP),                                         X00280   
               COLOR=BLUE,                                             X00281   
               LENGTH=6,                                               X00282   
               POS=(07,55)                                              00283   
ASTS3    DFHMDF ATTRB=(ASKIP),                                         X00284   
               COLOR=BLUE,                                             X00285   
               LENGTH=18,                                              X00286   
               POS=(07,62)                                              00287   
ASEL4    DFHMDF ATTRB=(UNPROT),                                        X00294**2
               COLOR=GREEN,                                            X00295   
               HILIGHT=UNDERLINE,                                      X00296   
               LENGTH=1,                                               X00297   
               POS=(08,1)                                               00298   
AREL4    DFHMDF ATTRB=(ASKIP),                                         X00299   
               COLOR=NEUTRAL,                                          X00300   
               LENGTH=1,                                               X00301   
               POS=(08,3)                                               00302   
APO4     DFHMDF ATTRB=(ASKIP),                                         X00303   
               COLOR=BLUE,                                             X00304   
               LENGTH=8,                                               X00305   
               PICOUT='ZZZZZZZ9',                                      X00306   
               POS=(08,5)                                               00307   
ARLS4    DFHMDF ATTRB=(ASKIP),                                         X00308   
               JUSTIFY=(LEFT,BLANK),                                   X00309   
               COLOR=BLUE,                                             X00310   
               PICOUT='-999',                                          X00311   
               LENGTH=4,                                               X00312   
               POS=(08,14)                                              00313   
ARLDT4   DFHMDF ATTRB=(ASKIP),                                         X00314   
               COLOR=BLUE,                                             X00315   
               LENGTH=6,                                               X00316   
               POS=(08,19)                                              00317   
ADPT4    DFHMDF ATTRB=(ASKIP),                                         X00318   
               COLOR=BLUE,                                             X00319   
               LENGTH=3,                                               X00320   
               POS=(08,26)                                              00321   
AMCL4    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(08,30)                                                      
ASCL4    DFHMDF ATTRB=(ASKIP),                                         X00322   
               COLOR=BLUE,                                             X00323   
               LENGTH=2,                                               X00324   
               POS=(08,34)                                              00325   
AVEND4   DFHMDF ATTRB=(ASKIP),                                         X00326   
               COLOR=BLUE,                                             X00327   
               LENGTH=10,                                              X00328   
               POS=(08,37)                                              00329   
ASHDT4   DFHMDF ATTRB=(ASKIP),                                         X00330   
               COLOR=BLUE,                                             X00331   
               LENGTH=6,                                               X00332   
               POS=(08,48)                                              00333   
ACADT4   DFHMDF ATTRB=(ASKIP),                                         X00334   
               COLOR=BLUE,                                             X00335   
               LENGTH=6,                                               X00336   
               POS=(08,55)                                              00337   
ASTS4    DFHMDF ATTRB=(ASKIP),                                         X00338   
               COLOR=BLUE,                                             X00339   
               LENGTH=18,                                              X00340   
               POS=(08,62)                                              00341   
ASEL5    DFHMDF ATTRB=(UNPROT),                                        X00348**2
               COLOR=GREEN,                                            X00349   
               HILIGHT=UNDERLINE,                                      X00350   
               LENGTH=1,                                               X00351   
               POS=(09,1)                                               00352   
AREL5    DFHMDF ATTRB=(ASKIP),                                         X00353   
               COLOR=NEUTRAL,                                          X00354   
               LENGTH=1,                                               X00355   
               POS=(09,3)                                               00356   
APO5     DFHMDF ATTRB=(ASKIP),                                         X00357   
               COLOR=BLUE,                                             X00358   
               LENGTH=8,                                               X00359   
               PICOUT='ZZZZZZZ9',                                      X00360   
               POS=(09,5)                                               00361   
ARLS5    DFHMDF ATTRB=(ASKIP),                                         X00362   
               JUSTIFY=(LEFT,BLANK),                                   X00363   
               COLOR=BLUE,                                             X00364   
               PICOUT='-999',                                          X00365   
               LENGTH=4,                                               X00366   
               POS=(09,14)                                              00367   
ARLDT5   DFHMDF ATTRB=(ASKIP),                                         X00368   
               COLOR=BLUE,                                             X00369   
               LENGTH=6,                                               X00370   
               POS=(09,19)                                              00371   
ADPT5    DFHMDF ATTRB=(ASKIP),                                         X00372   
               COLOR=BLUE,                                             X00373   
               LENGTH=3,                                               X00374   
               POS=(09,26)                                              00375   
AMCL5    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(09,30)                                                      
ASCL5    DFHMDF ATTRB=(ASKIP),                                         X00376   
               COLOR=BLUE,                                             X00377   
               LENGTH=2,                                               X00378   
               POS=(09,34)                                              00379   
AVEND5   DFHMDF ATTRB=(ASKIP),                                         X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=10,                                              X00382   
               POS=(09,37)                                              00383   
ASHDT5   DFHMDF ATTRB=(ASKIP),                                         X00384   
               COLOR=BLUE,                                             X00385   
               LENGTH=6,                                               X00386   
               POS=(09,48)                                              00387   
ACADT5   DFHMDF ATTRB=(ASKIP),                                         X00388   
               COLOR=BLUE,                                             X00389   
               LENGTH=6,                                               X00390   
               POS=(09,55)                                              00391   
ASTS5    DFHMDF ATTRB=(ASKIP),                                         X00392   
               COLOR=BLUE,                                             X00393   
               LENGTH=18,                                              X00394   
               POS=(09,62)                                              00395   
ASEL6    DFHMDF ATTRB=(UNPROT),                                        X00402**2
               COLOR=GREEN,                                            X00403   
               HILIGHT=UNDERLINE,                                      X00404   
               LENGTH=1,                                               X00405   
               POS=(10,1)                                               00406   
AREL6    DFHMDF ATTRB=(ASKIP),                                         X00407   
               COLOR=NEUTRAL,                                          X00408   
               LENGTH=1,                                               X00409   
               POS=(10,3)                                               00410   
APO6     DFHMDF ATTRB=(ASKIP),                                         X00411   
               COLOR=BLUE,                                             X00412   
               LENGTH=8,                                               X00413   
               PICOUT='ZZZZZZZ9',                                      X00414   
               POS=(10,5)                                               00415   
ARLS6    DFHMDF ATTRB=(ASKIP),                                         X00416   
               JUSTIFY=(LEFT,BLANK),                                   X00417   
               COLOR=BLUE,                                             X00418   
               PICOUT='-999',                                          X00419   
               LENGTH=4,                                               X00420   
               POS=(10,14)                                              00421   
ARLDT6   DFHMDF ATTRB=(ASKIP),                                         X00422   
               COLOR=BLUE,                                             X00423   
               LENGTH=6,                                               X00424   
               POS=(10,19)                                              00425   
ADPT6    DFHMDF ATTRB=(ASKIP),                                         X00426   
               COLOR=BLUE,                                             X00427   
               LENGTH=3,                                               X00428   
               POS=(10,26)                                              00429   
AMCL6    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(10,30)                                                      
ASCL6    DFHMDF ATTRB=(ASKIP),                                         X00430   
               COLOR=BLUE,                                             X00431   
               LENGTH=2,                                               X00432   
               POS=(10,34)                                              00433   
AVEND6   DFHMDF ATTRB=(ASKIP),                                         X00434   
               COLOR=BLUE,                                             X00435   
               LENGTH=10,                                              X00436   
               POS=(10,37)                                              00437   
ASHDT6   DFHMDF ATTRB=(ASKIP),                                         X00438   
               COLOR=BLUE,                                             X00439   
               LENGTH=6,                                               X00440   
               POS=(10,48)                                              00441   
ACADT6   DFHMDF ATTRB=(ASKIP),                                         X00442   
               COLOR=BLUE,                                             X00443   
               LENGTH=6,                                               X00444   
               POS=(10,55)                                              00445   
ASTS6    DFHMDF ATTRB=(ASKIP),                                         X00446   
               COLOR=BLUE,                                             X00447   
               LENGTH=18,                                              X00448   
               POS=(10,62)                                              00449   
ASEL7    DFHMDF ATTRB=(UNPROT),                                        X00456**2
               COLOR=GREEN,                                            X00457   
               HILIGHT=UNDERLINE,                                      X00458   
               LENGTH=1,                                               X00459   
               POS=(11,1)                                               00460   
AREL7    DFHMDF ATTRB=(ASKIP),                                         X00461   
               COLOR=NEUTRAL,                                          X00462   
               LENGTH=1,                                               X00463   
               POS=(11,3)                                               00464   
APO7     DFHMDF ATTRB=(ASKIP),                                         X00465   
               COLOR=BLUE,                                             X00466   
               LENGTH=8,                                               X00467   
               PICOUT='ZZZZZZZ9',                                      X00468   
               POS=(11,5)                                               00469   
ARLS7    DFHMDF ATTRB=(ASKIP),                                         X00470   
               JUSTIFY=(LEFT,BLANK),                                   X00471   
               COLOR=BLUE,                                             X00472   
               PICOUT='-999',                                          X00473   
               LENGTH=4,                                               X00474   
               POS=(11,14)                                              00475   
ARLDT7   DFHMDF ATTRB=(ASKIP),                                         X00476   
               COLOR=BLUE,                                             X00477   
               LENGTH=6,                                               X00478   
               POS=(11,19)                                              00479   
ADPT7    DFHMDF ATTRB=(ASKIP),                                         X00480   
               COLOR=BLUE,                                             X00481   
               LENGTH=3,                                               X00482   
               POS=(11,26)                                              00483   
AMCL7    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(11,30)                                                      
ASCL7    DFHMDF ATTRB=(ASKIP),                                         X00484   
               COLOR=BLUE,                                             X00485   
               LENGTH=2,                                               X00486   
               POS=(11,34)                                              00487   
AVEND7   DFHMDF ATTRB=(ASKIP),                                         X00488   
               COLOR=BLUE,                                             X00489   
               LENGTH=10,                                              X00490   
               POS=(11,37)                                              00491   
ASHDT7   DFHMDF ATTRB=(ASKIP),                                         X00492   
               COLOR=BLUE,                                             X00493   
               LENGTH=6,                                               X00494   
               POS=(11,48)                                              00495   
ACADT7   DFHMDF ATTRB=(ASKIP),                                         X00496   
               COLOR=BLUE,                                             X00497   
               LENGTH=6,                                               X00498   
               POS=(11,55)                                              00499   
ASTS7    DFHMDF ATTRB=(ASKIP),                                         X00500   
               COLOR=BLUE,                                             X00501   
               LENGTH=18,                                              X00502   
               POS=(11,62)                                              00503   
ASEL8    DFHMDF ATTRB=(UNPROT),                                        X00510**2
               COLOR=GREEN,                                            X00511   
               HILIGHT=UNDERLINE,                                      X00512   
               LENGTH=1,                                               X00513   
               POS=(12,1)                                               00514   
AREL8    DFHMDF ATTRB=(ASKIP),                                         X00515   
               COLOR=NEUTRAL,                                          X00516   
               LENGTH=1,                                               X00517   
               POS=(12,3)                                               00518   
APO8     DFHMDF ATTRB=(ASKIP),                                         X00519   
               COLOR=BLUE,                                             X00520   
               LENGTH=8,                                               X00521   
               PICOUT='ZZZZZZZ9',                                      X00522   
               POS=(12,5)                                               00523   
ARLS8    DFHMDF ATTRB=(ASKIP),                                         X00524   
               JUSTIFY=(LEFT,BLANK),                                   X00525   
               COLOR=BLUE,                                             X00526   
               PICOUT='-999',                                          X00527   
               LENGTH=4,                                               X00528   
               POS=(12,14)                                              00529   
ARLDT8   DFHMDF ATTRB=(ASKIP),                                         X00530   
               COLOR=BLUE,                                             X00531   
               LENGTH=6,                                               X00532   
               POS=(12,19)                                              00533   
ADPT8    DFHMDF ATTRB=(ASKIP),                                         X00534   
               COLOR=BLUE,                                             X00535   
               LENGTH=3,                                               X00536   
               POS=(12,26)                                              00537   
AMCL8    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(12,30)                                                      
ASCL8    DFHMDF ATTRB=(ASKIP),                                         X00538   
               COLOR=BLUE,                                             X00539   
               LENGTH=2,                                               X00540   
               POS=(12,34)                                              00541   
AVEND8   DFHMDF ATTRB=(ASKIP),                                         X00542   
               COLOR=BLUE,                                             X00543   
               LENGTH=10,                                              X00544   
               POS=(12,37)                                              00545   
ASHDT8   DFHMDF ATTRB=(ASKIP),                                         X00546   
               COLOR=BLUE,                                             X00547   
               LENGTH=6,                                               X00548   
               POS=(12,48)                                              00549   
ACADT8   DFHMDF ATTRB=(ASKIP),                                         X00550   
               COLOR=BLUE,                                             X00551   
               LENGTH=6,                                               X00552   
               POS=(12,55)                                              00553   
ASTS8    DFHMDF ATTRB=(ASKIP),                                         X00554   
               COLOR=BLUE,                                             X00555   
               LENGTH=18,                                              X00556   
               POS=(12,62)                                              00557   
ASEL9    DFHMDF ATTRB=(UNPROT),                                        X00564**2
               COLOR=GREEN,                                            X00565   
               HILIGHT=UNDERLINE,                                      X00566   
               LENGTH=1,                                               X00567   
               POS=(13,1)                                               00568   
AREL9    DFHMDF ATTRB=(ASKIP),                                         X00569   
               COLOR=NEUTRAL,                                          X00570   
               LENGTH=1,                                               X00571   
               POS=(13,3)                                               00572   
APO9     DFHMDF ATTRB=(ASKIP),                                         X00573   
               COLOR=BLUE,                                             X00574   
               LENGTH=8,                                               X00575   
               PICOUT='ZZZZZZZ9',                                      X00576   
               POS=(13,5)                                               00577   
ARLS9    DFHMDF ATTRB=(ASKIP),                                         X00578   
               JUSTIFY=(LEFT,BLANK),                                   X00579   
               COLOR=BLUE,                                             X00580   
               PICOUT='-999',                                          X00581   
               LENGTH=4,                                               X00582   
               POS=(13,14)                                              00583   
ARLDT9   DFHMDF ATTRB=(ASKIP),                                         X00584   
               COLOR=BLUE,                                             X00585   
               LENGTH=6,                                               X00586   
               POS=(13,19)                                              00587   
ADPT9    DFHMDF ATTRB=(ASKIP),                                         X00588   
               COLOR=BLUE,                                             X00589   
               LENGTH=3,                                               X00590   
               POS=(13,26)                                              00591   
AMCL9    DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(13,30)                                                      
ASCL9    DFHMDF ATTRB=(ASKIP),                                         X00592   
               COLOR=BLUE,                                             X00593   
               LENGTH=2,                                               X00594   
               POS=(13,34)                                              00595   
AVEND9   DFHMDF ATTRB=(ASKIP),                                         X00596   
               COLOR=BLUE,                                             X00597   
               LENGTH=10,                                              X00598   
               POS=(13,37)                                              00599   
ASHDT9   DFHMDF ATTRB=(ASKIP),                                         X00600   
               COLOR=BLUE,                                             X00601   
               LENGTH=6,                                               X00602   
               POS=(13,48)                                              00603   
ACADT9   DFHMDF ATTRB=(ASKIP),                                         X00604   
               COLOR=BLUE,                                             X00605   
               LENGTH=6,                                               X00606   
               POS=(13,55)                                              00607   
ASTS9    DFHMDF ATTRB=(ASKIP),                                         X00608   
               COLOR=BLUE,                                             X00609   
               LENGTH=18,                                              X00610   
               POS=(13,62)                                              00611   
ASEL10   DFHMDF ATTRB=(UNPROT),                                        X00618**2
               COLOR=GREEN,                                            X00619   
               HILIGHT=UNDERLINE,                                      X00620   
               LENGTH=1,                                               X00621   
               POS=(14,1)                                               00622   
AREL10   DFHMDF ATTRB=(ASKIP),                                         X00623   
               COLOR=NEUTRAL,                                          X00624   
               LENGTH=1,                                               X00625   
               POS=(14,3)                                               00626   
APO10    DFHMDF ATTRB=(ASKIP),                                         X00627   
               COLOR=BLUE,                                             X00628   
               LENGTH=8,                                               X00629   
               PICOUT='ZZZZZZZ9',                                      X00630   
               POS=(14,5)                                               00631   
ARLS10   DFHMDF ATTRB=(ASKIP),                                         X00632   
               JUSTIFY=(LEFT,BLANK),                                   X00633   
               COLOR=BLUE,                                             X00634   
               PICOUT='-999',                                          X00635   
               LENGTH=4,                                               X00636   
               POS=(14,14)                                              00637   
ARLDT10  DFHMDF ATTRB=(ASKIP),                                         X00638   
               COLOR=BLUE,                                             X00639   
               LENGTH=6,                                               X00640   
               POS=(14,19)                                              00641   
ADPT10   DFHMDF ATTRB=(ASKIP),                                         X00642   
               COLOR=BLUE,                                             X00643   
               LENGTH=3,                                               X00644   
               POS=(14,26)                                              00645   
AMCL10   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(14,30)                                                      
ASCL10   DFHMDF ATTRB=(ASKIP),                                         X00646   
               COLOR=BLUE,                                             X00647   
               LENGTH=2,                                               X00648   
               POS=(14,34)                                              00649   
AVEND10  DFHMDF ATTRB=(ASKIP),                                         X00650   
               COLOR=BLUE,                                             X00651   
               LENGTH=10,                                              X00652   
               POS=(14,37)                                              00653   
ASHDT10  DFHMDF ATTRB=(ASKIP),                                         X00654   
               COLOR=BLUE,                                             X00655   
               LENGTH=6,                                               X00656   
               POS=(14,48)                                              00657   
ACADT10  DFHMDF ATTRB=(ASKIP),                                         X00658   
               COLOR=BLUE,                                             X00659   
               LENGTH=6,                                               X00660   
               POS=(14,55)                                              00661   
ASTS10   DFHMDF ATTRB=(ASKIP),                                         X00662   
               COLOR=BLUE,                                             X00663   
               LENGTH=18,                                              X00664   
               POS=(14,62)                                              00665   
ASEL11   DFHMDF ATTRB=(UNPROT),                                        X00672**2
               COLOR=GREEN,                                            X00673   
               HILIGHT=UNDERLINE,                                      X00674   
               LENGTH=1,                                               X00675   
               POS=(15,1)                                               00676   
AREL11   DFHMDF ATTRB=(ASKIP),                                         X00677   
               COLOR=NEUTRAL,                                          X00678   
               LENGTH=1,                                               X00679   
               POS=(15,3)                                               00680   
APO11    DFHMDF ATTRB=(ASKIP),                                         X00681   
               COLOR=BLUE,                                             X00682   
               LENGTH=8,                                               X00683   
               PICOUT='ZZZZZZZ9',                                      X00684   
               POS=(15,5)                                               00685   
ARLS11   DFHMDF ATTRB=(ASKIP),                                         X00686   
               JUSTIFY=(LEFT,BLANK),                                   X00687   
               COLOR=BLUE,                                             X00688   
               PICOUT='-999',                                          X00689   
               LENGTH=4,                                               X00690   
               POS=(15,14)                                              00691   
ARLDT11  DFHMDF ATTRB=(ASKIP),                                         X00692   
               COLOR=BLUE,                                             X00693   
               LENGTH=6,                                               X00694   
               POS=(15,19)                                              00695   
ADPT11   DFHMDF ATTRB=(ASKIP),                                         X00696   
               COLOR=BLUE,                                             X00697   
               LENGTH=3,                                               X00698   
               POS=(15,26)                                              00699   
AMCL11   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(15,30)                                                      
ASCL11   DFHMDF ATTRB=(ASKIP),                                         X00700   
               COLOR=BLUE,                                             X00701   
               LENGTH=2,                                               X00702   
               POS=(15,34)                                              00703   
AVEND11  DFHMDF ATTRB=(ASKIP),                                         X00704   
               COLOR=BLUE,                                             X00705   
               LENGTH=10,                                              X00706   
               POS=(15,37)                                              00707   
ASHDT11  DFHMDF ATTRB=(ASKIP),                                         X00708   
               COLOR=BLUE,                                             X00709   
               LENGTH=6,                                               X00710   
               POS=(15,48)                                              00711   
ACADT11  DFHMDF ATTRB=(ASKIP),                                         X00712   
               COLOR=BLUE,                                             X00713   
               LENGTH=6,                                               X00714   
               POS=(15,55)                                              00715   
ASTS11   DFHMDF ATTRB=(ASKIP),                                         X00716   
               COLOR=BLUE,                                             X00717   
               LENGTH=18,                                              X00718   
               POS=(15,62)                                              00719   
ASEL12   DFHMDF ATTRB=(UNPROT),                                        X00726**2
               COLOR=GREEN,                                            X00727   
               HILIGHT=UNDERLINE,                                      X00728   
               LENGTH=1,                                               X00729   
               POS=(16,1)                                               00730   
AREL12   DFHMDF ATTRB=(ASKIP),                                         X00731   
               COLOR=NEUTRAL,                                          X00732   
               LENGTH=1,                                               X00733   
               POS=(16,3)                                               00734   
APO12    DFHMDF ATTRB=(ASKIP),                                         X00735   
               COLOR=BLUE,                                             X00736   
               LENGTH=8,                                               X00737   
               PICOUT='ZZZZZZZ9',                                      X00738   
               POS=(16,5)                                               00739   
ARLS12   DFHMDF ATTRB=(ASKIP),                                         X00740   
               JUSTIFY=(LEFT,BLANK),                                   X00741   
               COLOR=BLUE,                                             X00742   
               PICOUT='-999',                                          X00743   
               LENGTH=4,                                               X00744   
               POS=(16,14)                                              00745   
ARLDT12  DFHMDF ATTRB=(ASKIP),                                         X00746   
               COLOR=BLUE,                                             X00747   
               LENGTH=6,                                               X00748   
               POS=(16,19)                                              00749   
ADPT12   DFHMDF ATTRB=(ASKIP),                                         X00750   
               COLOR=BLUE,                                             X00751   
               LENGTH=3,                                               X00752   
               POS=(16,26)                                              00753   
AMCL12   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(16,30)                                                      
ASCL12   DFHMDF ATTRB=(ASKIP),                                         X00754   
               COLOR=BLUE,                                             X00755   
               LENGTH=2,                                               X00756   
               POS=(16,34)                                              00757   
AVEND12  DFHMDF ATTRB=(ASKIP),                                         X00758   
               COLOR=BLUE,                                             X00759   
               LENGTH=10,                                              X00760   
               POS=(16,37)                                              00761   
ASHDT12  DFHMDF ATTRB=(ASKIP),                                         X00762   
               COLOR=BLUE,                                             X00763   
               LENGTH=6,                                               X00764   
               POS=(16,48)                                              00765   
ACADT12  DFHMDF ATTRB=(ASKIP),                                         X00766   
               COLOR=BLUE,                                             X00767   
               LENGTH=6,                                               X00768   
               POS=(16,55)                                              00769   
ASTS12   DFHMDF ATTRB=(ASKIP),                                         X00770   
               COLOR=BLUE,                                             X00771   
               LENGTH=18,                                              X00772   
               POS=(16,62)                                              00773   
         DFHMDF ATTRB=(PROT),                                          X00888   
               INITIAL='NUMBER',                                       X00889   
               COLOR=NEUTRAL,                                          X00890   
               LENGTH=6,                                               X00891   
               POS=(18,45)                                              00892   
         DFHMDF ATTRB=(PROT),                                          X00893   
               INITIAL='OF',                                           X00894   
               COLOR=NEUTRAL,                                          X00895   
               LENGTH=2,                                               X00896   
               POS=(18,52)                                              00897   
         DFHMDF ATTRB=(PROT),                                          X00898   
               INITIAL='SELECTED',                                     X00899   
               COLOR=NEUTRAL,                                          X00900   
               LENGTH=8,                                               X00901   
               POS=(18,55)                                              00902   
         DFHMDF ATTRB=(PROT),                                          X00903   
               INITIAL='ITEMS:',                                       X00904   
               COLOR=NEUTRAL,                                          X00905   
               LENGTH=6,                                               X00906   
               POS=(18,64)                                              00907   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00908   
               JUSTIFY=(LEFT,BLANK),                                   X00909   
               COLOR=BLUE,                                             X00910   
               PICOUT='ZZZ,ZZ9',                                       X00911   
               LENGTH=7,                                               X00912   
               POS=(18,72)                                              00913   
         DFHMSD TYPE=FINAL                                              00914   
         END                                                            00915   
