*          DATA SET POKM065    AT LEVEL 006 AS OF 10/03/94                      
  PRINT  NOGEN                                                          00001   
*********************************************************************** 00002   
*                                                                       00003   
*        MAPSET  : POKM065                                              00004   
*        MAP     : PO065A                                               00005   
*        PROGRAM : POKCS065                                             00006   
*        TRANSID : W065 - PO/RCVR AGING LIST                            00007   
*        SYSTEM  : CICS ARCHITECTURE                                    00008   
*                                                                       00009   
*********************************************************************** 00010   
POKM065  DFHMSD TYPE=MAP,                                              X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
PO065A   DFHMDI LINE=02,                                               X00016   
               COLUMN=01,                                              X00017   
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
         DFHMDF ATTRB=(ASKIP),                                         X00021   
               INITIAL='ITEMS',                                        X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=05,                                              X00024   
               POS=(02,44)                                              00025   
ASTRTIT  DFHMDF ATTRB=(NUM,UNPROT),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00027   
               COLOR=GREEN,                                            X00028   
               PICOUT='ZZZZ9',                                         X00029   
               LENGTH=05,                                              X00030   
               POS=(02,50)                                              00031   
         DFHMDF ATTRB=(ASKIP),                                         X00032   
               INITIAL='TO',                                           X00033   
               COLOR=NEUTRAL,                                          X00034   
               LENGTH=02,                                              X00035   
               POS=(02,56)                                              00036   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00037   
               COLOR=BLUE,                                             X00038   
               PICOUT='ZZZZ9',                                         X00039   
               LENGTH=05,                                              X00040   
               POS=(02,59)                                              00041   
         DFHMDF ATTRB=(ASKIP),                                         X00042   
               INITIAL='OF',                                           X00043   
               COLOR=NEUTRAL,                                          X00044   
               LENGTH=02,                                              X00045   
               POS=(02,65)                                              00046   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00047   
               COLOR=BLUE,                                             X00048   
               PICOUT='ZZZZ9',                                         X00049   
               LENGTH=05,                                              X00050   
               POS=(02,68)                                              00051   
         DFHMDF ATTRB=(PROT),                                          X00052   
               INITIAL='DAYS',                                         X00053   
               COLOR=NEUTRAL,                                          X00054   
               LENGTH=04,                                              X00055   
               POS=(04,01)                                              00056   
         DFHMDF ATTRB=(PROT),                                          X00057   
               INITIAL='RECEIPT',                                      X00058   
               COLOR=NEUTRAL,                                          X00059   
               LENGTH=07,                                              X00060   
               POS=(04,07)                                              00061   
         DFHMDF ATTRB=(PROT),                                          X00062   
               INITIAL='REC',                                          X00063   
               COLOR=NEUTRAL,                                          X00064   
               LENGTH=03,                                              X00065   
               POS=(04,32)                                              00066   
         DFHMDF ATTRB=(PROT),                                          X00067   
               INITIAL='SHIP',                                         X00068   
               COLOR=NEUTRAL,                                          X00069   
               LENGTH=04,                                              X00070   
               POS=(04,48)                                              00071   
         DFHMDF ATTRB=(PROT),                                          X00072   
               INITIAL='CANCEL',                                       X00073   
               COLOR=NEUTRAL,                                          X00074   
               LENGTH=06,                                              X00075   
               POS=(04,54)                                              00076   
         DFHMDF ATTRB=(PROT),                                          X00077   
               INITIAL='IN DC',                                        X00078   
               COLOR=NEUTRAL,                                          X00079   
               LENGTH=5,                                               X00080   
               POS=(05,01)                                              00081   
         DFHMDF ATTRB=(PROT),                                          X00082   
               INITIAL='DATE',                                         X00083   
               COLOR=NEUTRAL,                                          X00084   
               LENGTH=4,                                               X00085   
               POS=(05,08)                                              00086   
         DFHMDF ATTRB=(PROT),                                          X00087   
               INITIAL='DC',                                           X00088   
               COLOR=NEUTRAL,                                          X00089   
               LENGTH=02,                                              X00090   
               POS=(05,15)                                              00091   
         DFHMDF ATTRB=(PROT),                                          X00092   
               INITIAL='DPT',                                          X00093   
               COLOR=NEUTRAL,                                          X00094   
               LENGTH=03,                                              X00095   
               POS=(05,19)                                              00096   
         DFHMDF ATTRB=(PROT),                                          X00097   
               INITIAL='PO NBR',                                       X00098   
               COLOR=NEUTRAL,                                          X00099   
               LENGTH=06,                                              X00100   
               POS=(05,24)                                              00101   
         DFHMDF ATTRB=(PROT),                                          X00102   
               INITIAL='SEQ',                                          X00103   
               COLOR=NEUTRAL,                                          X00104   
               LENGTH=03,                                              X00105   
               POS=(05,32)                                              00106   
         DFHMDF ATTRB=(PROT),                                          X00107   
               INITIAL='VENDOR',                                       X00108   
               COLOR=NEUTRAL,                                          X00109   
               LENGTH=06,                                              X00110   
               POS=(05,37)                                              00111**5
         DFHMDF ATTRB=(PROT),                                          X00112   
               INITIAL='DATE',                                         X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=04,                                              X00115   
               POS=(05,48)                                              00116   
         DFHMDF ATTRB=(PROT),                                          X00117   
               INITIAL='DATE',                                         X00118   
               COLOR=NEUTRAL,                                          X00119   
               LENGTH=04,                                              X00120   
               POS=(05,55)                                              00121   
         DFHMDF ATTRB=(PROT),                                          X00127   
               INITIAL='UNITS',                                        X00128   
               COLOR=NEUTRAL,                                          X00129   
               LENGTH=05,                                              X00130   
               POS=(05,61)                                              00131   
         DFHMDF ATTRB=(PROT),                                          X00132   
               INITIAL='TRB',                                          X00133   
               COLOR=NEUTRAL,                                          X00134   
               LENGTH=03,                                              X00135   
               POS=(05,67)                                              00136   
         DFHMDF ATTRB=(PROT),                                          X00132   
               INITIAL='PCK TY',                                       X00133   
               COLOR=NEUTRAL,                                          X00134   
               LENGTH=06,                                              X00135   
               POS=(05,71)                                              00136   
ADAYS01  DFHMDF ATTRB=(ASKIP),                                         X00137   
               JUSTIFY=(LEFT,BLANK),                                   X00138**4
               COLOR=BLUE,                                             X00139   
               PICOUT='ZZ9',                                           X00140   
               LENGTH=03,                                              X00141   
               POS=(06,02)                                              00142**5
ARDTE01  DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=06,                                              X00145   
               POS=(06,07)                                              00146**2
ADC01    DFHMDF ATTRB=(ASKIP),                                         X00147   
               COLOR=BLUE,                                             X00148   
               LENGTH=3,                                               X00149   
               POS=(06,15)                                              00150**2
ADPT01   DFHMDF ATTRB=(ASKIP),                                         X00151   
               COLOR=BLUE,                                             X00152   
               LENGTH=03,                                              X00153   
               POS=(06,19)                                              00154**2
APO01    DFHMDF ATTRB=(ASKIP),                                         X00155   
               JUSTIFY=(LEFT,BLANK),                                   X00156**4
               COLOR=BLUE,                                             X00157   
               PICOUT='ZZZZZZZZ',                                      X00158   
               LENGTH=08,                                              X00159   
               POS=(06,23)                                              00160**2
AREC01   DFHMDF ATTRB=(ASKIP),                                         X00161   
               JUSTIFY=(LEFT,BLANK),                                   X00162**4
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZ',                                           X00164   
               LENGTH=03,                                              X00165   
               POS=(06,32)                                              00166**2
AVND01   DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               LENGTH=10,                                              X00169   
               POS=(06,36)                                              00170**2
ASDTE01  DFHMDF ATTRB=(ASKIP),                                         X00171   
               COLOR=BLUE,                                             X00172   
               LENGTH=06,                                              X00173   
               POS=(06,47)                                              00174**2
ACDTE01  DFHMDF ATTRB=(ASKIP),                                         X00175   
               COLOR=BLUE,                                             X00176   
               LENGTH=06,                                              X00177   
               POS=(06,54)                                              00178**2
AUNTS01  DFHMDF ATTRB=(ASKIP),                                         X00185   
               JUSTIFY=(LEFT,BLANK),                                   X00186**4
               COLOR=BLUE,                                             X00187   
               PICOUT='ZZZZ9',                                         X00188   
               LENGTH=5,                                               X00189   
               POS=(06,61)                                              00190**2
ATRB01   DFHMDF ATTRB=(ASKIP),                                         X00191   
               COLOR=BLUE,                                             X00192   
               LENGTH=01,                                              X00193   
               POS=(06,68)                                              00194**2
APCKT01  DFHMDF ATTRB=(ASKIP),                                         X00191   
               COLOR=BLUE,                                             X00192   
               LENGTH=01,                                              X00193   
               POS=(06,73)                                              00194**2
ADAYS02  DFHMDF ATTRB=(ASKIP),                                         X00195   
               COLOR=BLUE,                                             X00196   
               PICOUT='ZZ9',                                           X00197   
               LENGTH=03,                                              X00198   
               POS=(07,02)                                              00199**6
ARDTE02  DFHMDF ATTRB=(ASKIP),                                         X00200   
               COLOR=BLUE,                                             X00201   
               LENGTH=06,                                              X00202   
               POS=(07,07)                                              00203**2
ADC02    DFHMDF ATTRB=(ASKIP),                                         X00204   
               COLOR=BLUE,                                             X00205   
               LENGTH=3,                                               X00206   
               POS=(07,15)                                              00207**2
ADPT02   DFHMDF ATTRB=(ASKIP),                                         X00208   
               COLOR=BLUE,                                             X00209   
               LENGTH=03,                                              X00210   
               POS=(07,19)                                              00211**2
APO02    DFHMDF ATTRB=(ASKIP),                                         X00212   
               COLOR=BLUE,                                             X00213   
               PICOUT='ZZZZZZZZ',                                      X00214   
               LENGTH=08,                                              X00215   
               POS=(07,23)                                              00216**2
AREC02   DFHMDF ATTRB=(ASKIP),                                         X00217   
               COLOR=BLUE,                                             X00218   
               PICOUT='ZZZ',                                           X00219   
               LENGTH=03,                                              X00220   
               POS=(07,32)                                              00221**2
AVND02   DFHMDF ATTRB=(ASKIP),                                         X00222   
               COLOR=BLUE,                                             X00223   
               LENGTH=10,                                              X00224   
               POS=(07,36)                                              00225**2
ASDTE02  DFHMDF ATTRB=(ASKIP),                                         X00226   
               COLOR=BLUE,                                             X00227   
               LENGTH=06,                                              X00228   
               POS=(07,47)                                              00229**2
ACDTE02  DFHMDF ATTRB=(ASKIP),                                         X00230   
               COLOR=BLUE,                                             X00231   
               LENGTH=06,                                              X00232   
               POS=(07,54)                                              00233**2
AUNTS02  DFHMDF ATTRB=(ASKIP),                                         X00239   
               COLOR=BLUE,                                             X00240   
               PICOUT='ZZZZ9',                                         X00241   
               LENGTH=5,                                               X00242   
               POS=(07,61)                                              00243**2
ATRB02   DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=01,                                              X00246   
               POS=(07,68)                                              00247**2
APCKT02  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=01,                                              X00246   
               POS=(07,73)                                              00247**2
ADAYS03  DFHMDF ATTRB=(ASKIP),                                         X00248   
               COLOR=BLUE,                                             X00249   
               PICOUT='ZZ9',                                           X00250   
               LENGTH=03,                                              X00251   
               POS=(08,02)                                              00252**6
ARDTE03  DFHMDF ATTRB=(ASKIP),                                         X00253   
               COLOR=BLUE,                                             X00254   
               LENGTH=06,                                              X00255   
               POS=(08,07)                                              00256**2
ADC03    DFHMDF ATTRB=(ASKIP),                                         X00257   
               COLOR=BLUE,                                             X00258   
               LENGTH=3,                                               X00259   
               POS=(08,15)                                              00260**2
ADPT03   DFHMDF ATTRB=(ASKIP),                                         X00261   
               COLOR=BLUE,                                             X00262   
               LENGTH=03,                                              X00263   
               POS=(08,19)                                              00264**2
APO03    DFHMDF ATTRB=(ASKIP),                                         X00265   
               COLOR=BLUE,                                             X00266   
               PICOUT='ZZZZZZZZ',                                      X00267   
               LENGTH=08,                                              X00268   
               POS=(08,23)                                              00269**2
AREC03   DFHMDF ATTRB=(ASKIP),                                         X00270   
               COLOR=BLUE,                                             X00271   
               PICOUT='ZZZ',                                           X00272   
               LENGTH=03,                                              X00273   
               POS=(08,32)                                              00274**2
AVND03   DFHMDF ATTRB=(ASKIP),                                         X00275   
               COLOR=BLUE,                                             X00276   
               LENGTH=10,                                              X00277   
               POS=(08,36)                                              00278**2
ASDTE03  DFHMDF ATTRB=(ASKIP),                                         X00279   
               COLOR=BLUE,                                             X00280   
               LENGTH=06,                                              X00281   
               POS=(08,47)                                              00282**2
ACDTE03  DFHMDF ATTRB=(ASKIP),                                         X00283   
               COLOR=BLUE,                                             X00284   
               LENGTH=06,                                              X00285   
               POS=(08,54)                                              00286**2
AUNTS03  DFHMDF ATTRB=(ASKIP),                                         X00292   
               COLOR=BLUE,                                             X00293   
               PICOUT='ZZZZ9',                                         X00294   
               LENGTH=5,                                               X00295   
               POS=(08,61)                                              00296**2
ATRB03   DFHMDF ATTRB=(ASKIP),                                         X00297   
               COLOR=BLUE,                                             X00298   
               LENGTH=01,                                              X00299   
               POS=(08,68)                                              00300**2
APCKT03  DFHMDF ATTRB=(ASKIP),                                         X00297   
               COLOR=BLUE,                                             X00298   
               LENGTH=01,                                              X00299   
               POS=(08,73)                                              00300**2
ADAYS04  DFHMDF ATTRB=(ASKIP),                                         X00301   
               COLOR=BLUE,                                             X00302   
               PICOUT='ZZ9',                                           X00303   
               LENGTH=03,                                              X00304   
               POS=(09,02)                                              00305**6
ARDTE04  DFHMDF ATTRB=(ASKIP),                                         X00306   
               COLOR=BLUE,                                             X00307   
               LENGTH=06,                                              X00308   
               POS=(09,07)                                              00309**2
ADC04    DFHMDF ATTRB=(ASKIP),                                         X00310   
               COLOR=BLUE,                                             X00311   
               LENGTH=3,                                               X00312   
               POS=(09,15)                                              00313**2
ADPT04   DFHMDF ATTRB=(ASKIP),                                         X00314   
               COLOR=BLUE,                                             X00315   
               LENGTH=03,                                              X00316   
               POS=(09,19)                                              00317**2
APO04    DFHMDF ATTRB=(ASKIP),                                         X00318   
               COLOR=BLUE,                                             X00319   
               PICOUT='ZZZZZZZZ',                                      X00320   
               LENGTH=08,                                              X00321   
               POS=(09,23)                                              00322**2
AREC04   DFHMDF ATTRB=(ASKIP),                                         X00323   
               COLOR=BLUE,                                             X00324   
               PICOUT='ZZZ',                                           X00325   
               LENGTH=03,                                              X00326   
               POS=(09,32)                                              00327**2
AVND04   DFHMDF ATTRB=(ASKIP),                                         X00328   
               COLOR=BLUE,                                             X00329   
               LENGTH=10,                                              X00330   
               POS=(09,36)                                              00331**2
ASDTE04  DFHMDF ATTRB=(ASKIP),                                         X00332   
               COLOR=BLUE,                                             X00333   
               LENGTH=06,                                              X00334   
               POS=(09,47)                                              00335**2
ACDTE04  DFHMDF ATTRB=(ASKIP),                                         X00336   
               COLOR=BLUE,                                             X00337   
               LENGTH=06,                                              X00338   
               POS=(09,54)                                              00339**2
AUNTS04  DFHMDF ATTRB=(ASKIP),                                         X00345   
               COLOR=BLUE,                                             X00346   
               PICOUT='ZZZZ9',                                         X00347   
               LENGTH=5,                                               X00348   
               POS=(09,61)                                              00349**2
ATRB04   DFHMDF ATTRB=(ASKIP),                                         X00350   
               COLOR=BLUE,                                             X00351   
               LENGTH=01,                                              X00352   
               POS=(09,68)                                              00353**2
APCKT04  DFHMDF ATTRB=(ASKIP),                                         X00350   
               COLOR=BLUE,                                             X00351   
               LENGTH=01,                                              X00352   
               POS=(09,73)                                              00353**2
ADAYS05  DFHMDF ATTRB=(ASKIP),                                         X00354   
               COLOR=BLUE,                                             X00355   
               PICOUT='ZZ9',                                           X00356   
               LENGTH=03,                                              X00357   
               POS=(10,02)                                              00358**6
ARDTE05  DFHMDF ATTRB=(ASKIP),                                         X00359   
               COLOR=BLUE,                                             X00360   
               LENGTH=06,                                              X00361   
               POS=(10,07)                                              00362**2
ADC05    DFHMDF ATTRB=(ASKIP),                                         X00363   
               COLOR=BLUE,                                             X00364   
               LENGTH=3,                                               X00365   
               POS=(10,15)                                              00366**2
ADPT05   DFHMDF ATTRB=(ASKIP),                                         X00367   
               COLOR=BLUE,                                             X00368   
               LENGTH=03,                                              X00369   
               POS=(10,19)                                              00370**2
APO05    DFHMDF ATTRB=(ASKIP),                                         X00371   
               COLOR=BLUE,                                             X00372   
               PICOUT='ZZZZZZZZ',                                      X00373   
               LENGTH=08,                                              X00374   
               POS=(10,23)                                              00375**2
AREC05   DFHMDF ATTRB=(ASKIP),                                         X00376   
               COLOR=BLUE,                                             X00377   
               PICOUT='ZZZ',                                           X00378   
               LENGTH=03,                                              X00379   
               POS=(10,32)                                              00380**2
AVND05   DFHMDF ATTRB=(ASKIP),                                         X00381   
               COLOR=BLUE,                                             X00382   
               LENGTH=10,                                              X00383   
               POS=(10,36)                                              00384**2
ASDTE05  DFHMDF ATTRB=(ASKIP),                                         X00385   
               COLOR=BLUE,                                             X00386   
               LENGTH=06,                                              X00387   
               POS=(10,47)                                              00388**2
ACDTE05  DFHMDF ATTRB=(ASKIP),                                         X00389   
               COLOR=BLUE,                                             X00390   
               LENGTH=06,                                              X00391   
               POS=(10,54)                                              00392**2
AUNTS05  DFHMDF ATTRB=(ASKIP),                                         X00398   
               COLOR=BLUE,                                             X00399   
               PICOUT='ZZZZ9',                                         X00400   
               LENGTH=5,                                               X00401   
               POS=(10,61)                                              00402**2
ATRB05   DFHMDF ATTRB=(ASKIP),                                         X00403   
               COLOR=BLUE,                                             X00404   
               LENGTH=01,                                              X00405   
               POS=(10,68)                                              00406**2
APCKT05  DFHMDF ATTRB=(ASKIP),                                         X00403   
               COLOR=BLUE,                                             X00404   
               LENGTH=01,                                              X00405   
               POS=(10,73)                                              00406**2
ADAYS06  DFHMDF ATTRB=(ASKIP),                                         X00407   
               COLOR=BLUE,                                             X00408   
               PICOUT='ZZ9',                                           X00409   
               LENGTH=03,                                              X00410   
               POS=(11,02)                                              00411**6
ARDTE06  DFHMDF ATTRB=(ASKIP),                                         X00412   
               COLOR=BLUE,                                             X00413   
               LENGTH=06,                                              X00414   
               POS=(11,07)                                              00415**2
ADC06    DFHMDF ATTRB=(ASKIP),                                         X00416   
               COLOR=BLUE,                                             X00417   
               LENGTH=3,                                               X00418   
               POS=(11,15)                                              00419**2
ADPT06   DFHMDF ATTRB=(ASKIP),                                         X00420   
               COLOR=BLUE,                                             X00421   
               LENGTH=03,                                              X00422   
               POS=(11,19)                                              00423**2
APO06    DFHMDF ATTRB=(ASKIP),                                         X00424   
               COLOR=BLUE,                                             X00425   
               PICOUT='ZZZZZZZZ',                                      X00426   
               LENGTH=08,                                              X00427   
               POS=(11,23)                                              00428**2
AREC06   DFHMDF ATTRB=(ASKIP),                                         X00429   
               COLOR=BLUE,                                             X00430   
               PICOUT='ZZZ',                                           X00431   
               LENGTH=03,                                              X00432   
               POS=(11,32)                                              00433**2
AVND06   DFHMDF ATTRB=(ASKIP),                                         X00434   
               COLOR=BLUE,                                             X00435   
               LENGTH=10,                                              X00436   
               POS=(11,36)                                              00437**2
ASDTE06  DFHMDF ATTRB=(ASKIP),                                         X00438   
               COLOR=BLUE,                                             X00439   
               LENGTH=06,                                              X00440   
               POS=(11,47)                                              00441**2
ACDTE06  DFHMDF ATTRB=(ASKIP),                                         X00442   
               COLOR=BLUE,                                             X00443   
               LENGTH=06,                                              X00444   
               POS=(11,54)                                              00445**2
AUNTS06  DFHMDF ATTRB=(ASKIP),                                         X00451   
               COLOR=BLUE,                                             X00452   
               PICOUT='ZZZZ9',                                         X00453   
               LENGTH=5,                                               X00454   
               POS=(11,61)                                              00455**2
ATRB06   DFHMDF ATTRB=(ASKIP),                                         X00456   
               COLOR=BLUE,                                             X00457   
               LENGTH=01,                                              X00458   
               POS=(11,68)                                              00459**2
APCKT06  DFHMDF ATTRB=(ASKIP),                                         X00456   
               COLOR=BLUE,                                             X00457   
               LENGTH=01,                                              X00458   
               POS=(11,73)                                              00459**2
ADAYS07  DFHMDF ATTRB=(ASKIP),                                         X00460   
               COLOR=BLUE,                                             X00461   
               PICOUT='ZZ9',                                           X00462   
               LENGTH=03,                                              X00463   
               POS=(12,02)                                              00464**6
ARDTE07  DFHMDF ATTRB=(ASKIP),                                         X00465   
               COLOR=BLUE,                                             X00466   
               LENGTH=06,                                              X00467   
               POS=(12,07)                                              00468**2
ADC07    DFHMDF ATTRB=(ASKIP),                                         X00469   
               COLOR=BLUE,                                             X00470   
               LENGTH=3,                                               X00471   
               POS=(12,15)                                              00472**2
ADPT07   DFHMDF ATTRB=(ASKIP),                                         X00473   
               COLOR=BLUE,                                             X00474   
               LENGTH=03,                                              X00475   
               POS=(12,19)                                              00476**2
APO07    DFHMDF ATTRB=(ASKIP),                                         X00477   
               COLOR=BLUE,                                             X00478   
               PICOUT='ZZZZZZZZ',                                      X00479   
               LENGTH=08,                                              X00480   
               POS=(12,23)                                              00481**2
AREC07   DFHMDF ATTRB=(ASKIP),                                         X00482   
               COLOR=BLUE,                                             X00483   
               PICOUT='ZZZ',                                           X00484   
               LENGTH=03,                                              X00485   
               POS=(12,32)                                              00486**2
AVND07   DFHMDF ATTRB=(ASKIP),                                         X00487   
               COLOR=BLUE,                                             X00488   
               LENGTH=10,                                              X00489   
               POS=(12,36)                                              00490**2
ASDTE07  DFHMDF ATTRB=(ASKIP),                                         X00491   
               COLOR=BLUE,                                             X00492   
               LENGTH=06,                                              X00493   
               POS=(12,47)                                              00494**2
ACDTE07  DFHMDF ATTRB=(ASKIP),                                         X00495   
               COLOR=BLUE,                                             X00496   
               LENGTH=06,                                              X00497   
               POS=(12,54)                                              00498**2
AUNTS07  DFHMDF ATTRB=(ASKIP),                                         X00504   
               COLOR=BLUE,                                             X00505   
               PICOUT='ZZZZ9',                                         X00506   
               LENGTH=5,                                               X00507   
               POS=(12,61)                                              00508**2
ATRB07   DFHMDF ATTRB=(ASKIP),                                         X00509   
               COLOR=BLUE,                                             X00510   
               LENGTH=01,                                              X00511   
               POS=(12,68)                                              00512**2
APCKT07  DFHMDF ATTRB=(ASKIP),                                         X00509   
               COLOR=BLUE,                                             X00510   
               LENGTH=01,                                              X00511   
               POS=(12,73)                                              00512**2
ADAYS08  DFHMDF ATTRB=(ASKIP),                                         X00513   
               COLOR=BLUE,                                             X00514   
               PICOUT='ZZ9',                                           X00515   
               LENGTH=03,                                              X00516   
               POS=(13,02)                                              00517**6
ARDTE08  DFHMDF ATTRB=(ASKIP),                                         X00518   
               COLOR=BLUE,                                             X00519   
               LENGTH=06,                                              X00520   
               POS=(13,07)                                              00521**2
ADC08    DFHMDF ATTRB=(ASKIP),                                         X00522   
               COLOR=BLUE,                                             X00523   
               LENGTH=3,                                               X00524   
               POS=(13,15)                                              00525**2
ADPT08   DFHMDF ATTRB=(ASKIP),                                         X00526   
               COLOR=BLUE,                                             X00527   
               LENGTH=03,                                              X00528   
               POS=(13,19)                                              00529**2
APO08    DFHMDF ATTRB=(ASKIP),                                         X00530   
               COLOR=BLUE,                                             X00531   
               PICOUT='ZZZZZZZZ',                                      X00532   
               LENGTH=08,                                              X00533   
               POS=(13,23)                                              00534**2
AREC08   DFHMDF ATTRB=(ASKIP),                                         X00535   
               COLOR=BLUE,                                             X00536   
               PICOUT='ZZZ',                                           X00537   
               LENGTH=03,                                              X00538   
               POS=(13,32)                                              00539**2
AVND08   DFHMDF ATTRB=(ASKIP),                                         X00540   
               COLOR=BLUE,                                             X00541   
               LENGTH=10,                                              X00542   
               POS=(13,36)                                              00543**2
ASDTE08  DFHMDF ATTRB=(ASKIP),                                         X00544   
               COLOR=BLUE,                                             X00545   
               LENGTH=06,                                              X00546   
               POS=(13,47)                                              00547**2
ACDTE08  DFHMDF ATTRB=(ASKIP),                                         X00548   
               COLOR=BLUE,                                             X00549   
               LENGTH=06,                                              X00550   
               POS=(13,54)                                              00551**2
AUNTS08  DFHMDF ATTRB=(ASKIP),                                         X00557   
               COLOR=BLUE,                                             X00558   
               PICOUT='ZZZZ9',                                         X00559   
               LENGTH=5,                                               X00560   
               POS=(13,61)                                              00561**2
ATRB08   DFHMDF ATTRB=(ASKIP),                                         X00562   
               COLOR=BLUE,                                             X00563   
               LENGTH=01,                                              X00564   
               POS=(13,68)                                              00565**2
APCKT08  DFHMDF ATTRB=(ASKIP),                                         X00562   
               COLOR=BLUE,                                             X00563   
               LENGTH=01,                                              X00564   
               POS=(13,73)                                              00565**2
ADAYS09  DFHMDF ATTRB=(ASKIP),                                         X00566   
               COLOR=BLUE,                                             X00567   
               PICOUT='ZZ9',                                           X00568   
               LENGTH=03,                                              X00569   
               POS=(14,02)                                              00570**6
ARDTE09  DFHMDF ATTRB=(ASKIP),                                         X00571   
               COLOR=BLUE,                                             X00572   
               LENGTH=06,                                              X00573   
               POS=(14,07)                                              00574**2
ADC09    DFHMDF ATTRB=(ASKIP),                                         X00575   
               COLOR=BLUE,                                             X00576   
               LENGTH=3,                                               X00577   
               POS=(14,15)                                              00578**2
ADPT09   DFHMDF ATTRB=(ASKIP),                                         X00579   
               COLOR=BLUE,                                             X00580   
               LENGTH=03,                                              X00581   
               POS=(14,19)                                              00582**2
APO09    DFHMDF ATTRB=(ASKIP),                                         X00583   
               COLOR=BLUE,                                             X00584   
               PICOUT='ZZZZZZZZ',                                      X00585   
               LENGTH=08,                                              X00586   
               POS=(14,23)                                              00587**2
AREC09   DFHMDF ATTRB=(ASKIP),                                         X00588   
               COLOR=BLUE,                                             X00589   
               PICOUT='ZZZ',                                           X00590   
               LENGTH=03,                                              X00591   
               POS=(14,32)                                              00592**2
AVND09   DFHMDF ATTRB=(ASKIP),                                         X00593   
               COLOR=BLUE,                                             X00594   
               LENGTH=10,                                              X00595   
               POS=(14,36)                                              00596**2
ASDTE09  DFHMDF ATTRB=(ASKIP),                                         X00597   
               COLOR=BLUE,                                             X00598   
               LENGTH=06,                                              X00599   
               POS=(14,47)                                              00600**2
ACDTE09  DFHMDF ATTRB=(ASKIP),                                         X00601   
               COLOR=BLUE,                                             X00602   
               LENGTH=06,                                              X00603   
               POS=(14,54)                                              00604**2
AUNTS09  DFHMDF ATTRB=(ASKIP),                                         X00610   
               COLOR=BLUE,                                             X00611   
               PICOUT='ZZZZ9',                                         X00612   
               LENGTH=5,                                               X00613   
               POS=(14,61)                                              00614**2
ATRB09   DFHMDF ATTRB=(ASKIP),                                         X00615   
               COLOR=BLUE,                                             X00616   
               LENGTH=01,                                              X00617   
               POS=(14,68)                                              00618**2
APCKT09  DFHMDF ATTRB=(ASKIP),                                         X00615   
               COLOR=BLUE,                                             X00616   
               LENGTH=01,                                              X00617   
               POS=(14,73)                                              00618**2
ADAYS10  DFHMDF ATTRB=(ASKIP),                                         X00619   
               COLOR=BLUE,                                             X00620   
               PICOUT='ZZ9',                                           X00621   
               LENGTH=03,                                              X00622   
               POS=(15,02)                                              00623**6
ARDTE10  DFHMDF ATTRB=(ASKIP),                                         X00624   
               COLOR=BLUE,                                             X00625   
               LENGTH=06,                                              X00626   
               POS=(15,07)                                              00627**2
ADC10    DFHMDF ATTRB=(ASKIP),                                         X00628   
               COLOR=BLUE,                                             X00629   
               LENGTH=3,                                               X00630   
               POS=(15,15)                                              00631**2
ADPT10   DFHMDF ATTRB=(ASKIP),                                         X00632   
               COLOR=BLUE,                                             X00633   
               LENGTH=03,                                              X00634   
               POS=(15,19)                                              00635**2
APO10    DFHMDF ATTRB=(ASKIP),                                         X00636   
               COLOR=BLUE,                                             X00637   
               PICOUT='ZZZZZZZZ',                                      X00638   
               LENGTH=08,                                              X00639   
               POS=(15,23)                                              00640**2
AREC10   DFHMDF ATTRB=(ASKIP),                                         X00641   
               COLOR=BLUE,                                             X00642   
               PICOUT='ZZZ',                                           X00643   
               LENGTH=03,                                              X00644   
               POS=(15,32)                                              00645**2
AVND10   DFHMDF ATTRB=(ASKIP),                                         X00646   
               COLOR=BLUE,                                             X00647   
               LENGTH=10,                                              X00648   
               POS=(15,36)                                              00649**2
ASDTE10  DFHMDF ATTRB=(ASKIP),                                         X00650   
               COLOR=BLUE,                                             X00651   
               LENGTH=06,                                              X00652   
               POS=(15,47)                                              00653**2
ACDTE10  DFHMDF ATTRB=(ASKIP),                                         X00654   
               COLOR=BLUE,                                             X00655   
               LENGTH=06,                                              X00656   
               POS=(15,54)                                              00657**2
AUNTS10  DFHMDF ATTRB=(ASKIP),                                         X00663   
               COLOR=BLUE,                                             X00664   
               PICOUT='ZZZZ9',                                         X00665   
               LENGTH=5,                                               X00666   
               POS=(15,61)                                              00667**2
ATRB10   DFHMDF ATTRB=(ASKIP),                                         X00668   
               COLOR=BLUE,                                             X00669   
               LENGTH=01,                                              X00670   
               POS=(15,68)                                              00671**2
APCKT10  DFHMDF ATTRB=(ASKIP),                                         X00668   
               COLOR=BLUE,                                             X00669   
               LENGTH=01,                                              X00670   
               POS=(15,73)                                              00671**2
ADAYS11  DFHMDF ATTRB=(ASKIP),                                         X00672   
               COLOR=BLUE,                                             X00673   
               PICOUT='ZZ9',                                           X00674   
               LENGTH=03,                                              X00675   
               POS=(16,02)                                              00676**6
ARDTE11  DFHMDF ATTRB=(ASKIP),                                         X00677   
               COLOR=BLUE,                                             X00678   
               LENGTH=06,                                              X00679   
               POS=(16,07)                                              00680**2
ADC11    DFHMDF ATTRB=(ASKIP),                                         X00681   
               COLOR=BLUE,                                             X00682   
               LENGTH=3,                                               X00683   
               POS=(16,15)                                              00684**2
ADPT11   DFHMDF ATTRB=(ASKIP),                                         X00685   
               COLOR=BLUE,                                             X00686   
               LENGTH=03,                                              X00687   
               POS=(16,19)                                              00688**2
APO11    DFHMDF ATTRB=(ASKIP),                                         X00689   
               COLOR=BLUE,                                             X00690   
               PICOUT='ZZZZZZZZ',                                      X00691   
               LENGTH=08,                                              X00692   
               POS=(16,23)                                              00693**2
AREC11   DFHMDF ATTRB=(ASKIP),                                         X00694   
               COLOR=BLUE,                                             X00695   
               PICOUT='ZZZ',                                           X00696   
               LENGTH=03,                                              X00697   
               POS=(16,32)                                              00698**2
AVND11   DFHMDF ATTRB=(ASKIP),                                         X00699   
               COLOR=BLUE,                                             X00700   
               LENGTH=10,                                              X00701   
               POS=(16,36)                                              00702**2
ASDTE11  DFHMDF ATTRB=(ASKIP),                                         X00703   
               COLOR=BLUE,                                             X00704   
               LENGTH=06,                                              X00705   
               POS=(16,47)                                              00706**2
ACDTE11  DFHMDF ATTRB=(ASKIP),                                         X00707   
               COLOR=BLUE,                                             X00708   
               LENGTH=06,                                              X00709   
               POS=(16,54)                                              00710**2
AUNTS11  DFHMDF ATTRB=(ASKIP),                                         X00716   
               COLOR=BLUE,                                             X00717   
               PICOUT='ZZZZ9',                                         X00718   
               LENGTH=5,                                               X00719   
               POS=(16,61)                                              00720**2
ATRB11   DFHMDF ATTRB=(ASKIP),                                         X00721   
               COLOR=BLUE,                                             X00722   
               LENGTH=01,                                              X00723   
               POS=(16,68)                                              00724**2
APCKT11  DFHMDF ATTRB=(ASKIP),                                         X00721   
               COLOR=BLUE,                                             X00722   
               LENGTH=01,                                              X00723   
               POS=(16,73)                                              00724**2
ADAYS12  DFHMDF ATTRB=(ASKIP),                                         X00725**2
               COLOR=BLUE,                                             X00726**2
               PICOUT='ZZ9',                                           X00727**2
               LENGTH=03,                                              X00728**2
               POS=(17,02)                                              00729**6
ARDTE12  DFHMDF ATTRB=(ASKIP),                                         X00730**2
               COLOR=BLUE,                                             X00731**2
               LENGTH=06,                                              X00732**2
               POS=(17,07)                                              00733**2
ADC12    DFHMDF ATTRB=(ASKIP),                                         X00734**2
               COLOR=BLUE,                                             X00735**2
               LENGTH=3,                                               X00736**2
               POS=(17,15)                                              00737**2
ADPT12   DFHMDF ATTRB=(ASKIP),                                         X00738**2
               COLOR=BLUE,                                             X00739**2
               LENGTH=03,                                              X00740**2
               POS=(17,19)                                              00741**2
APO12    DFHMDF ATTRB=(ASKIP),                                         X00742**2
               COLOR=BLUE,                                             X00743**2
               PICOUT='ZZZZZZZZ',                                      X00744**2
               LENGTH=08,                                              X00745**2
               POS=(17,23)                                              00746**2
AREC12   DFHMDF ATTRB=(ASKIP),                                         X00747**2
               COLOR=BLUE,                                             X00748**2
               PICOUT='ZZZ',                                           X00749**2
               LENGTH=03,                                              X00750**2
               POS=(17,32)                                              00751**2
AVND12   DFHMDF ATTRB=(ASKIP),                                         X00752**2
               COLOR=BLUE,                                             X00753**2
               LENGTH=10,                                              X00754**2
               POS=(17,36)                                              00755**2
ASDTE12  DFHMDF ATTRB=(ASKIP),                                         X00756**2
               COLOR=BLUE,                                             X00757**2
               LENGTH=06,                                              X00758**2
               POS=(17,47)                                              00759**2
ACDTE12  DFHMDF ATTRB=(ASKIP),                                         X00760**2
               COLOR=BLUE,                                             X00761**2
               LENGTH=06,                                              X00762**2
               POS=(17,54)                                              00763**2
AUNTS12  DFHMDF ATTRB=(ASKIP),                                         X00769**2
               COLOR=BLUE,                                             X00770**2
               PICOUT='ZZZZ9',                                         X00771**2
               LENGTH=5,                                               X00772**2
               POS=(17,61)                                              00773**2
ATRB12   DFHMDF ATTRB=(ASKIP),                                         X00774**2
               COLOR=BLUE,                                             X00775**2
               LENGTH=01,                                              X00776**2
               POS=(17,68)                                              00777**2
APCKT12  DFHMDF ATTRB=(ASKIP),                                         X00774**2
               COLOR=BLUE,                                             X00775**2
               LENGTH=01,                                              X00776**2
               POS=(17,73)                                              00777**2
         DFHMSD TYPE=FINAL                                              00778   
         END                                                            00779   
