*          DATA SET POKM043    AT LEVEL 002 AS OF 12/16/93                      
*          DATA SET POKM043    AT LEVEL 004 AS OF 09/24/93              00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*      MAPSET :  POKM043                                                00005   
*      MAP    :  PO043A                                                 00006   
*      PROGRAM:  POKCS043                                               00007   
*                                                                       00008   
************************************************************            00009   
POKM043  DFHMSD TYPE=MAP,                                              X00010   
               CTRL=(FREEKB),                                          X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               TIOAPFX=YES                                              00014   
PO043A   DFHMDI LINE=02,                                               X00015   
               COLUMN=01,                                              X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
         DFHMDF ATTRB=(ASKIP),                                         X00020   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00021   
               COLOR=NEUTRAL,                                          X00022   
               LENGTH=22,                                              X00023   
               POS=(04,11)                                              00024   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00025   
               JUSTIFY=(LEFT,BLANK),                                   X00026   
               COLOR=BLUE,                                             X00027   
               PICOUT='ZZZZZZZZ',                                      X00028   
               LENGTH=8,                                               X00029   
               POS=(04,34)                                              00030   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               INITIAL='VENDOR NAME..........:',                       X00032   
               COLOR=NEUTRAL,                                          X00033   
               LENGTH=22,                                              X00034   
               POS=(06,11)                                              00035   
AVNAME   DFHMDF ATTRB=(ASKIP),                                         X00036   
               COLOR=BLUE,                                             X00037   
               LENGTH=30,                                              X00038   
               POS=(06,34)                                              00039   
         DFHMDF ATTRB=(ASKIP),                                         X00040   
               INITIAL='DEPARTMENT...........:',                       X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=22,                                              X00043   
               POS=(08,11)                                              00044   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=3,                                               X00047   
               POS=(08,34)                                              00048   
         DFHMDF ATTRB=(ASKIP),                                         X00049   
               INITIAL='TOTAL SKUS...........:',                       X00050   
               COLOR=NEUTRAL,                                          X00051   
               LENGTH=22,                                              X00052   
               POS=(10,11)                                              00053   
ATOTSKU  DFHMDF ATTRB=(ASKIP),                                         X00054   
               JUSTIFY=(LEFT,BLANK),                                   X00055   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZ',                                           X00057   
               LENGTH=3,                                               X00058   
               POS=(10,34)                                              00059   
         DFHMDF ATTRB=(ASKIP),                                         X00060   
               INITIAL='BUYER COPY.:',                                 X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=12,                                              X00063   
               POS=(13,11)                                              00064**2
ABUYCOP  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(13,24)                                              00069**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00070   
               INITIAL=' ',                                            X00071   
               LENGTH=1,                                               X00072   
               POS=(13,26)                                              00073**2
         DFHMDF ATTRB=(ASKIP),                                         X00074   
               INITIAL='TICKET COPY:',                                 X00075   
               COLOR=NEUTRAL,                                          X00076   
               LENGTH=12,                                              X00077   
               POS=(14,11)                                              00078**2
ADCCOP   DFHMDF ATTRB=(UNPROT),                                        X00079   
               COLOR=GREEN,                                            X00080   
               HILIGHT=UNDERLINE,                                      X00081   
               LENGTH=1,                                               X00082   
               POS=(14,24)                                              00083**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00084   
               INITIAL=' ',                                            X00085   
               LENGTH=1,                                               X00086   
               POS=(14,26)                                              00087**2
         DFHMDF ATTRB=(ASKIP),                                         X00088   
               INITIAL='VENDOR COPY:',                                 X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=12,                                              X00091   
               POS=(15,11)                                              00092**2
AVENCOP  DFHMDF ATTRB=(UNPROT,IC),                                     X00093   
               COLOR=GREEN,                                            X00094   
               HILIGHT=UNDERLINE,                                      X00095   
               LENGTH=1,                                               X00096   
               POS=(15,24)                                              00097**2
         DFHMDF ATTRB=(ASKIP),                                         X00098   
               POS=(15,26),                                            X00099**2
               INITIAL=' ',                                            X00100   
               LENGTH=1                                                 00101   
         DFHMDF ATTRB=(ASKIP),                                         X00102   
               INITIAL='SUPPRESS RETAIL PRICING:',                     X00103   
               COLOR=NEUTRAL,                                          X00104   
               LENGTH=24,                                              X00105   
               POS=(15,28)                                              00106**2
ASUPRS   DFHMDF ATTRB=(UNPROT),                                        X00107   
               COLOR=GREEN,                                            X00108   
               HILIGHT=UNDERLINE,                                      X00109   
               LENGTH=1,                                               X00110   
               POS=(15,53)                                              00111**2
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00112   
               INITIAL=' ',                                            X00113   
               LENGTH=1,                                               X00114   
               POS=(15,55)                                              00115**2
         DFHMSD TYPE=FINAL                                              00116   
         END                                                            00117   
