  PRINT  NOGEN                                                          00003**1
*-------------------------------------------------------------------*   00004**1
*                                                                   *   00005**1
*        MAPSET  POKM105                                            *   00006**1
*        MAP     PO105A                                             *   00007**1
*        PROGRAM POKCS105                                           *   00008**1
*        TRANSID W105                                               *   00009**1
*        SYSTEM  CICS ARCH - PO SELECTION LIST                      *   00010**1
*                                                                   *   00011**1
*-------------------------------------------------------------------*   00012**1
POKM105 DFHMSD TYPE=DSECT,                                             X00013**1
               LANG=COBOL,                                             X00014**1
               MODE=INOUT,                                             X00015**1
               STORAGE=AUTO,                                           X00016**1
               TIOAPFX=YES,                                            X00017**1
               TERM=3270-2                                              00018**1
PO105A  DFHMDI LINE=2,COLUMN=1,                                        X00019**1
               SIZE=(19,80),                                           X00020**1
               CTRL=(FREEKB),                                          X00021**1
               MAPATTS=(COLOR,HILIGHT),                                X00022**1
               DSATTS=(COLOR,HILIGHT)                                   00023**1
*                                                                       00024**1
         DFHMDF ATTRB=(PROT),                                          X00025**1
               INITIAL='ITEMS:',                                       X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               LENGTH=6,                                               X00028**1
               POS=(01,44)                                              00029**1
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00030**1
               COLOR=GREEN,                                            X00031**1
               HILIGHT=UNDERLINE,                                      X00032**1
               PICOUT='ZZZ,ZZ9',                                       X00033**1
               LENGTH=7,                                               X00034**1
               POS=(01,51)                                              00035**1
         DFHMDF ATTRB=(PROT),                                          X00036**1
               INITIAL='TO',                                           X00037**1
               COLOR=NEUTRAL,                                          X00038**1
               LENGTH=2,                                               X00039**1
               POS=(01,59)                                              00040**1
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00041**1
               COLOR=BLUE,                                             X00042**1
               PICOUT='ZZZ,ZZ9',                                       X00043**1
               LENGTH=7,                                               X00044**1
               POS=(01,62)                                              00045**1
         DFHMDF ATTRB=(PROT),                                          X00046**1
               INITIAL='OF',                                           X00047**1
               COLOR=NEUTRAL,                                          X00048**1
               LENGTH=2,                                               X00049**1
               POS=(01,70)                                              00050**1
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00051**1
               COLOR=BLUE,                                             X00052**1
               PICOUT='ZZZ,ZZ9',                                       X00053**1
               LENGTH=7,                                               X00054**1
               POS=(01,73)                                              00055**1
*                                                                       00056**1
         DFHMDF ATTRB=(ASKIP),                                         X00057**1
               INITIAL='PO',                                           X00058**1
               COLOR=NEUTRAL,                                          X00059**1
               LENGTH=2,                                               X00060**1
               POS=(03,07)                                              00061*10
         DFHMDF ATTRB=(ASKIP),                                         X00062**1
               INITIAL=' SHIP  CANCEL',                                X00063*10
               COLOR=NEUTRAL,                                          X00064**1
               LENGTH=13,                                              X00065**9
               POS=(03,27)                                              00066*15
AHEAD    DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=34,                                              X00069*16
               POS=(03,46)                                              00070*16
*                                                                       00071**1
         DFHMDF ATTRB=(ASKIP),                                         X00072**1
               INITIAL='SEL NUMBER  GRP VENDOR NM',                    X00073*15
               COLOR=NEUTRAL,                                          X00074**1
               LENGTH=25,                                              X00075*15
               POS=(04,1)                                               00076**1
         DFHMDF ATTRB=(ASKIP),                                         X00077**1
               INITIAL='DATE   DATE',                                  X00078*12
               COLOR=NEUTRAL,                                          X00079**1
               LENGTH=11,                                              X00080*12
               POS=(04,28)                                              00081*15
AHEAD2   DFHMDF ATTRB=(ASKIP),                                         X00082**2
               COLOR=NEUTRAL,                                          X00083**2
               LENGTH=38,                                              X00084*15
               POS=(04,41)                                              00085*15
*                                                                       00086**1
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(05,2)                                               00091**1
APONM1   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZZZZZ',                                      X00094**1
               LENGTH=8,                                               X00095**1
               POS=(05,4)                                               00096*11
AGRCD1   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=3,                                               X00099**1
               POS=(05,13)                                              00100*14
AVNME1   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=8,                                               X00103**1
               POS=(05,17)                                              00104*14
ASHDT1   DFHMDF ATTRB=(ASKIP),                                         X00113**1
               COLOR=BLUE,                                             X00114**1
               LENGTH=6,                                               X00115**1
               POS=(05,27)                                              00116*14
ACNDT1   DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=6,                                               X00119**1
               POS=(05,34)                                              00120*17
ALINE1   DFHMDF ATTRB=(ASKIP),                                         X00125**3
               COLOR=BLUE,                                             X00126**1
               LENGTH=34,                                              X00127*14
               POS=(05,41)                                              00128*14
*                                                                       00129**1
ASEL2    DFHMDF ATTRB=(UNPROT,IC),                                     X00130**1
               COLOR=GREEN,                                            X00131**1
               HILIGHT=UNDERLINE,                                      X00132**1
               LENGTH=1,                                               X00133**1
               POS=(06,2)                                               00134**1
APONM2   DFHMDF ATTRB=(ASKIP),                                         X00135**1
               COLOR=BLUE,                                             X00136**1
               PICOUT='ZZZZZZZZ',                                      X00137**1
               LENGTH=8,                                               X00138**1
               POS=(06,4)                                               00139*11
AGRCD2   DFHMDF ATTRB=(ASKIP),                                         X00140**1
               COLOR=BLUE,                                             X00141**1
               LENGTH=3,                                               X00142**1
               POS=(06,13)                                              00143*14
AVNME2   DFHMDF ATTRB=(ASKIP),                                         X00144**1
               COLOR=BLUE,                                             X00145**1
               LENGTH=08,                                              X00146**1
               POS=(06,17)                                              00147*14
ASHDT2   DFHMDF ATTRB=(ASKIP),                                         X00156**1
               COLOR=BLUE,                                             X00157**1
               LENGTH=6,                                               X00158**1
               POS=(06,27)                                              00159*14
ACNDT2   DFHMDF ATTRB=(ASKIP),                                         X00160**1
               COLOR=BLUE,                                             X00161**1
               LENGTH=6,                                               X00162**1
               POS=(06,34)                                              00163*14
ALINE2   DFHMDF ATTRB=(ASKIP),                                         X00168**3
               COLOR=BLUE,                                             X00169**1
               LENGTH=34,                                              X00170*14
               POS=(06,41)                                              00171*14
*                                                                       00172**1
ASEL3    DFHMDF ATTRB=(UNPROT,IC),                                     X00173**1
               COLOR=GREEN,                                            X00174**1
               HILIGHT=UNDERLINE,                                      X00175**1
               LENGTH=1,                                               X00176**1
               POS=(07,2)                                               00177**1
APONM3   DFHMDF ATTRB=(ASKIP),                                         X00178**1
               COLOR=BLUE,                                             X00179**1
               PICOUT='ZZZZZZZZ',                                      X00180**1
               LENGTH=8,                                               X00181**1
               POS=(07,4)                                               00182*11
AGRCD3   DFHMDF ATTRB=(ASKIP),                                         X00183**1
               COLOR=BLUE,                                             X00184**1
               LENGTH=3,                                               X00185**1
               POS=(07,13)                                              00186*14
AVNME3   DFHMDF ATTRB=(ASKIP),                                         X00187**1
               COLOR=BLUE,                                             X00188**1
               LENGTH=08,                                              X00189**1
               POS=(07,17)                                              00190*14
ASHDT3   DFHMDF ATTRB=(ASKIP),                                         X00199**1
               COLOR=BLUE,                                             X00200**1
               LENGTH=6,                                               X00201**1
               POS=(07,27)                                              00202*14
ACNDT3   DFHMDF ATTRB=(ASKIP),                                         X00203**1
               COLOR=BLUE,                                             X00204**1
               LENGTH=6,                                               X00205**1
               POS=(07,34)                                              00206*14
ALINE3   DFHMDF ATTRB=(ASKIP),                                         X00211**3
               COLOR=BLUE,                                             X00212**1
               LENGTH=34,                                              X00213*14
               POS=(07,41)                                              00214*14
*                                                                       00215**1
ASEL4    DFHMDF ATTRB=(UNPROT,IC),                                     X00216**1
               COLOR=GREEN,                                            X00217**1
               HILIGHT=UNDERLINE,                                      X00218**1
               LENGTH=1,                                               X00219**1
               POS=(08,2)                                               00220**1
APONM4   DFHMDF ATTRB=(ASKIP),                                         X00221**1
               COLOR=BLUE,                                             X00222**1
               PICOUT='ZZZZZZZZ',                                      X00223**1
               LENGTH=8,                                               X00224**1
               POS=(08,4)                                               00225*11
AGRCD4   DFHMDF ATTRB=(ASKIP),                                         X00226**1
               COLOR=BLUE,                                             X00227**1
               LENGTH=3,                                               X00228**1
               POS=(08,13)                                              00229*14
AVNME4   DFHMDF ATTRB=(ASKIP),                                         X00230**1
               COLOR=BLUE,                                             X00231**1
               LENGTH=08,                                              X00232**1
               POS=(08,17)                                              00233*14
ASHDT4   DFHMDF ATTRB=(ASKIP),                                         X00242**1
               COLOR=BLUE,                                             X00243**1
               LENGTH=6,                                               X00244**1
               POS=(08,27)                                              00245*14
ACNDT4   DFHMDF ATTRB=(ASKIP),                                         X00246**1
               COLOR=BLUE,                                             X00247**1
               LENGTH=6,                                               X00248**1
               POS=(08,34)                                              00249*14
ALINE4   DFHMDF ATTRB=(ASKIP),                                         X00254**3
               COLOR=BLUE,                                             X00255**1
               LENGTH=34,                                              X00256*14
               POS=(08,41)                                              00257*14
*                                                                       00258**1
ASEL5    DFHMDF ATTRB=(UNPROT,IC),                                     X00259**1
               COLOR=GREEN,                                            X00260**1
               HILIGHT=UNDERLINE,                                      X00261**1
               LENGTH=1,                                               X00262**1
               POS=(09,2)                                               00263**1
APONM5   DFHMDF ATTRB=(ASKIP),                                         X00264**1
               COLOR=BLUE,                                             X00265**1
               PICOUT='ZZZZZZZZ',                                      X00266**1
               LENGTH=8,                                               X00267**1
               POS=(09,4)                                               00268*11
AGRCD5   DFHMDF ATTRB=(ASKIP),                                         X00269**1
               COLOR=BLUE,                                             X00270**1
               LENGTH=3,                                               X00271**1
               POS=(09,13)                                              00272*14
AVNME5   DFHMDF ATTRB=(ASKIP),                                         X00273**1
               COLOR=BLUE,                                             X00274**1
               LENGTH=08,                                              X00275**1
               POS=(09,17)                                              00276*14
ASHDT5   DFHMDF ATTRB=(ASKIP),                                         X00285**1
               COLOR=BLUE,                                             X00286**1
               LENGTH=6,                                               X00287**1
               POS=(09,27)                                              00288*14
ACNDT5   DFHMDF ATTRB=(ASKIP),                                         X00289**1
               COLOR=BLUE,                                             X00290**1
               LENGTH=6,                                               X00291**1
               POS=(09,34)                                              00292*14
ALINE5   DFHMDF ATTRB=(ASKIP),                                         X00297**3
               COLOR=BLUE,                                             X00298**1
               LENGTH=34,                                              X00299*14
               POS=(09,41)                                              00300*14
*                                                                       00301**1
ASEL6    DFHMDF ATTRB=(UNPROT,IC),                                     X00302**1
               COLOR=GREEN,                                            X00303**1
               HILIGHT=UNDERLINE,                                      X00304**1
               LENGTH=1,                                               X00305**1
               POS=(10,2)                                               00306**1
APONM6   DFHMDF ATTRB=(ASKIP),                                         X00307**1
               COLOR=BLUE,                                             X00308**1
               PICOUT='ZZZZZZZZ',                                      X00309**1
               LENGTH=8,                                               X00310**1
               POS=(10,4)                                               00311*11
AGRCD6   DFHMDF ATTRB=(ASKIP),                                         X00312**1
               COLOR=BLUE,                                             X00313**1
               LENGTH=3,                                               X00314**1
               POS=(10,13)                                              00315*14
AVNME6   DFHMDF ATTRB=(ASKIP),                                         X00316**1
               COLOR=BLUE,                                             X00317**1
               LENGTH=08,                                              X00318**1
               POS=(10,17)                                              00319*14
ASHDT6   DFHMDF ATTRB=(ASKIP),                                         X00328**1
               COLOR=BLUE,                                             X00329**1
               LENGTH=6,                                               X00330**1
               POS=(10,27)                                              00331*14
ACNDT6   DFHMDF ATTRB=(ASKIP),                                         X00332**1
               COLOR=BLUE,                                             X00333**1
               LENGTH=6,                                               X00334**1
               POS=(10,34)                                              00335*14
ALINE6   DFHMDF ATTRB=(ASKIP),                                         X00340**3
               COLOR=BLUE,                                             X00341**1
               LENGTH=34,                                              X00342*14
               POS=(10,41)                                              00343*14
*                                                                       00344**1
ASEL7    DFHMDF ATTRB=(UNPROT,IC),                                     X00345**1
               COLOR=GREEN,                                            X00346**1
               HILIGHT=UNDERLINE,                                      X00347**1
               LENGTH=1,                                               X00348**1
               POS=(11,2)                                               00349**1
APONM7   DFHMDF ATTRB=(ASKIP),                                         X00350**1
               COLOR=BLUE,                                             X00351**1
               PICOUT='ZZZZZZZZ',                                      X00352**1
               LENGTH=8,                                               X00353**1
               POS=(11,4)                                               00354*11
AGRCD7   DFHMDF ATTRB=(ASKIP),                                         X00355**1
               COLOR=BLUE,                                             X00356**1
               LENGTH=3,                                               X00357**1
               POS=(11,13)                                              00358*14
AVNME7   DFHMDF ATTRB=(ASKIP),                                         X00359**1
               COLOR=BLUE,                                             X00360**1
               LENGTH=08,                                              X00361**1
               POS=(11,17)                                              00362*14
ASHDT7   DFHMDF ATTRB=(ASKIP),                                         X00371**1
               COLOR=BLUE,                                             X00372**1
               LENGTH=6,                                               X00373**1
               POS=(11,27)                                              00374*14
ACNDT7   DFHMDF ATTRB=(ASKIP),                                         X00375**1
               COLOR=BLUE,                                             X00376**1
               LENGTH=6,                                               X00377**1
               POS=(11,34)                                              00378*14
ALINE7   DFHMDF ATTRB=(ASKIP),                                         X00383**3
               COLOR=BLUE,                                             X00384**1
               LENGTH=34,                                              X00385*14
               POS=(11,41)                                              00386*14
*                                                                       00387**1
ASEL8    DFHMDF ATTRB=(UNPROT,IC),                                     X00388**1
               COLOR=GREEN,                                            X00389**1
               HILIGHT=UNDERLINE,                                      X00390**1
               LENGTH=1,                                               X00391**1
               POS=(12,2)                                               00392**1
APONM8   DFHMDF ATTRB=(ASKIP),                                         X00393**1
               COLOR=BLUE,                                             X00394**1
               PICOUT='ZZZZZZZZ',                                      X00395**1
               LENGTH=8,                                               X00396**1
               POS=(12,4)                                               00397*11
AGRCD8   DFHMDF ATTRB=(ASKIP),                                         X00398**1
               COLOR=BLUE,                                             X00399**1
               LENGTH=3,                                               X00400**1
               POS=(12,13)                                              00401*14
AVNME8   DFHMDF ATTRB=(ASKIP),                                         X00402**1
               COLOR=BLUE,                                             X00403**1
               LENGTH=08,                                              X00404**1
               POS=(12,17)                                              00405*14
ASHDT8   DFHMDF ATTRB=(ASKIP),                                         X00414**1
               COLOR=BLUE,                                             X00415**1
               LENGTH=6,                                               X00416**1
               POS=(12,27)                                              00417*14
ACNDT8   DFHMDF ATTRB=(ASKIP),                                         X00418**1
               COLOR=BLUE,                                             X00419**1
               LENGTH=6,                                               X00420**1
               POS=(12,34)                                              00421*14
ALINE8   DFHMDF ATTRB=(ASKIP),                                         X00426**3
               COLOR=BLUE,                                             X00427**1
               LENGTH=34,                                              X00428*14
               POS=(12,41)                                              00429*14
*                                                                       00430**1
ASEL9    DFHMDF ATTRB=(UNPROT,IC),                                     X00431**1
               COLOR=GREEN,                                            X00432**1
               HILIGHT=UNDERLINE,                                      X00433**1
               LENGTH=1,                                               X00434**1
               POS=(13,2)                                               00435**1
APONM9   DFHMDF ATTRB=(ASKIP),                                         X00436**1
               COLOR=BLUE,                                             X00437**1
               PICOUT='ZZZZZZZZ',                                      X00438**1
               LENGTH=8,                                               X00439**1
               POS=(13,4)                                               00440*11
AGRCD9   DFHMDF ATTRB=(ASKIP),                                         X00441**1
               COLOR=BLUE,                                             X00442**1
               LENGTH=3,                                               X00443**1
               POS=(13,13)                                              00444*14
AVNME9   DFHMDF ATTRB=(ASKIP),                                         X00445**1
               COLOR=BLUE,                                             X00446**1
               LENGTH=08,                                              X00447**1
               POS=(13,17)                                              00448*14
ASHDT9   DFHMDF ATTRB=(ASKIP),                                         X00457**1
               COLOR=BLUE,                                             X00458**1
               LENGTH=6,                                               X00459**1
               POS=(13,27)                                              00460*14
ACNDT9   DFHMDF ATTRB=(ASKIP),                                         X00461**1
               COLOR=BLUE,                                             X00462**1
               LENGTH=6,                                               X00463**1
               POS=(13,34)                                              00464*14
ALINE9   DFHMDF ATTRB=(ASKIP),                                         X00469**3
               COLOR=BLUE,                                             X00470**1
               LENGTH=34,                                              X00471*14
               POS=(13,41)                                              00472*14
*                                                                       00473**1
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00474**1
               COLOR=GREEN,                                            X00475**1
               HILIGHT=UNDERLINE,                                      X00476**1
               LENGTH=1,                                               X00477**1
               POS=(14,2)                                               00478**1
APONM10  DFHMDF ATTRB=(ASKIP),                                         X00479**1
               COLOR=BLUE,                                             X00480**1
               PICOUT='ZZZZZZZZ',                                      X00481**1
               LENGTH=8,                                               X00482**1
               POS=(14,4)                                               00483*11
AGRCD10  DFHMDF ATTRB=(ASKIP),                                         X00484**1
               COLOR=BLUE,                                             X00485**1
               LENGTH=3,                                               X00486**1
               POS=(14,13)                                              00487*14
AVNME10  DFHMDF ATTRB=(ASKIP),                                         X00488**1
               COLOR=BLUE,                                             X00489**1
               LENGTH=08,                                              X00490**1
               POS=(14,17)                                              00491*14
ASHDT10  DFHMDF ATTRB=(ASKIP),                                         X00500**1
               COLOR=BLUE,                                             X00501**1
               LENGTH=6,                                               X00502**1
               POS=(14,27)                                              00503*14
ACNDT10  DFHMDF ATTRB=(ASKIP),                                         X00504**1
               COLOR=BLUE,                                             X00505**1
               LENGTH=6,                                               X00506**1
               POS=(14,34)                                              00507*14
ALINE10  DFHMDF ATTRB=(ASKIP),                                         X00512**3
               COLOR=BLUE,                                             X00513**1
               LENGTH=34,                                              X00514*14
               POS=(14,41)                                              00515*14
*                                                                       00516**1
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00517**1
               COLOR=GREEN,                                            X00518**1
               HILIGHT=UNDERLINE,                                      X00519**1
               LENGTH=1,                                               X00520**1
               POS=(15,2)                                               00521**1
APONM11  DFHMDF ATTRB=(ASKIP),                                         X00522**1
               COLOR=BLUE,                                             X00523**1
               PICOUT='ZZZZZZZZ',                                      X00524**1
               LENGTH=8,                                               X00525**1
               POS=(15,4)                                               00526*11
AGRCD11  DFHMDF ATTRB=(ASKIP),                                         X00527**1
               COLOR=BLUE,                                             X00528**1
               LENGTH=3,                                               X00529**1
               POS=(15,13)                                              00530*14
AVNME11  DFHMDF ATTRB=(ASKIP),                                         X00531**1
               COLOR=BLUE,                                             X00532**1
               LENGTH=08,                                              X00533**1
               POS=(15,17)                                              00534*14
ASHDT11  DFHMDF ATTRB=(ASKIP),                                         X00543**1
               COLOR=BLUE,                                             X00544**1
               LENGTH=6,                                               X00545**1
               POS=(15,27)                                              00546*14
ACNDT11  DFHMDF ATTRB=(ASKIP),                                         X00547**1
               COLOR=BLUE,                                             X00548**1
               LENGTH=6,                                               X00549**1
               POS=(15,34)                                              00550*14
ALINE11  DFHMDF ATTRB=(ASKIP),                                         X00555**3
               COLOR=BLUE,                                             X00556**1
               LENGTH=34,                                              X00557*14
               POS=(15,41)                                              00558*14
*                                                                       00559**1
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00560**1
               COLOR=GREEN,                                            X00561**1
               HILIGHT=UNDERLINE,                                      X00562**1
               LENGTH=1,                                               X00563**1
               POS=(16,2)                                               00564**1
APONM12  DFHMDF ATTRB=(ASKIP),                                         X00565**1
               COLOR=BLUE,                                             X00566**1
               PICOUT='ZZZZZZZZ',                                      X00567**1
               LENGTH=8,                                               X00568**1
               POS=(16,4)                                               00569*11
AGRCD12  DFHMDF ATTRB=(ASKIP),                                         X00570**1
               COLOR=BLUE,                                             X00571**1
               LENGTH=3,                                               X00572**1
               POS=(16,13)                                              00573*14
AVNME12  DFHMDF ATTRB=(ASKIP),                                         X00574**1
               COLOR=BLUE,                                             X00575**1
               LENGTH=08,                                              X00576**1
               POS=(16,17)                                              00577*14
ASHDT12  DFHMDF ATTRB=(ASKIP),                                         X00586**1
               COLOR=BLUE,                                             X00587**1
               LENGTH=6,                                               X00588**1
               POS=(16,27)                                              00589*14
ACNDT12  DFHMDF ATTRB=(ASKIP),                                         X00590**1
               COLOR=BLUE,                                             X00591**1
               LENGTH=6,                                               X00592**1
               POS=(16,34)                                              00593*14
ALINE12  DFHMDF ATTRB=(ASKIP),                                         X00598**3
               COLOR=BLUE,                                             X00599**1
               LENGTH=34,                                              X00600*14
               POS=(16,41)                                              00601*14
*                                                                       00602**1
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00603**1
               COLOR=GREEN,                                            X00604**1
               HILIGHT=UNDERLINE,                                      X00605**1
               LENGTH=1,                                               X00606**1
               POS=(17,2)                                               00607**1
APONM13  DFHMDF ATTRB=(ASKIP),                                         X00608**1
               COLOR=BLUE,                                             X00609**1
               PICOUT='ZZZZZZZZ',                                      X00610**1
               LENGTH=8,                                               X00611**1
               POS=(17,4)                                               00612*11
AGRCD13  DFHMDF ATTRB=(ASKIP),                                         X00613**1
               COLOR=BLUE,                                             X00614**1
               LENGTH=3,                                               X00615**1
               POS=(17,13)                                              00616*14
AVNME13  DFHMDF ATTRB=(ASKIP),                                         X00617**1
               COLOR=BLUE,                                             X00618**1
               LENGTH=08,                                              X00619**1
               POS=(17,17)                                              00620*14
ASHDT13  DFHMDF ATTRB=(ASKIP),                                         X00629**1
               COLOR=BLUE,                                             X00630**1
               LENGTH=6,                                               X00631**1
               POS=(17,27)                                              00632*14
ACNDT13  DFHMDF ATTRB=(ASKIP),                                         X00633**1
               COLOR=BLUE,                                             X00634**1
               LENGTH=6,                                               X00635**1
               POS=(17,34)                                              00636*14
ALINE13  DFHMDF ATTRB=(ASKIP),                                         X00641**3
               COLOR=BLUE,                                             X00642**1
               LENGTH=34,                                              X00643*14
               POS=(17,41)                                              00644*14
         DFHMDF ATTRB=(PROT),                                          X00645**1
               INITIAL='TOTALS FOR SELECTION LIST ---->',              X00646**1
               COLOR=NEUTRAL,                                          X00647**1
               LENGTH=31,                                              X00648**1
               POS=(18,8)                                               00649**1
ATLINE   DFHMDF ATTRB=(ASKIP),                                         X00650**5
               COLOR=YELLOW,                                           X00651**1
               LENGTH=31,                                              X00652*14
               POS=(18,43)                                              00653*14
*                                                                       00654**1
         DFHMDF ATTRB=(PROT),                                          X00655**1
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00656**1
               COLOR=NEUTRAL,                                          X00657**1
               LENGTH=25,                                              X00658**1
               POS=(19,45)                                              00659**1
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00660**1
               COLOR=BLUE,                                             X00661**1
               PICOUT='ZZZ,ZZ9',                                       X00662**1
               LENGTH=7,                                               X00663**1
               POS=(19,72)                                              00664**1
*                                                                       00665**1
         DFHMSD TYPE=FINAL                                              00666**1
         END                                                            00667**1
