*          DATA SET POKM070    AT LEVEL 008 AS OF 04/07/95                      
  PRINT  NOGEN                                                          00001**1
*********************************************************************** 00002**1
*                                                                       00003**1
*        MAPSET  : POKM070                                              00004**1
*        MAP     : PO070A                                               00005**1
*        PROGRAM : POKCS070                                             00006**3
*        TRANSID : W070 - EDI PO TRANSPORTATION TRACKING INQUIRY        00007**5
*        SYSTEM  : CICS ARCHITECTURE                                    00008**1
*                                                                       00009**1
*********************************************************************** 00010**1
POKM070  DFHMSD TYPE=DSECT,                                            X00011**4
               MODE=INOUT,                                             X00012**1
               LANG=COBOL,                                             X00013**1
               TIOAPFX=YES,                                            X00014**1
               CTRL=(FREEKB)                                            00015**1
PO070A   DFHMDI LINE=02,                                               X00016**1
               COLUMN=01,                                              X00017**1
               SIZE=(19,80),                                           X00018**1
               MAPATTS=(COLOR,HILIGHT),                                X00019**1
               DSATTS=(COLOR,HILIGHT)                                   00020**1
         DFHMDF ATTRB=(PROT),                                          X00021**1
               INITIAL='ITEMS:',                                       X00022**1
               COLOR=NEUTRAL,                                          X00023**1
               LENGTH=6,                                               X00024**1
               POS=(01,44)                                              00025**1
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00026**1
               COLOR=GREEN,                                            X00027**1
               HILIGHT=UNDERLINE,                                      X00028**1
               PICOUT='ZZZ,ZZ9',                                       X00029**1
               LENGTH=7,                                               X00030**1
               POS=(01,51)                                              00031**1
         DFHMDF ATTRB=(PROT),                                          X00032**1
               INITIAL='TO',                                           X00033**1
               COLOR=NEUTRAL,                                          X00034**1
               LENGTH=2,                                               X00035**1
               POS=(01,59)                                              00036**1
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00037**1
               COLOR=BLUE,                                             X00038**1
               PICOUT='ZZZ,ZZ9',                                       X00039**1
               LENGTH=7,                                               X00040**1
               POS=(01,62)                                              00041**1
         DFHMDF ATTRB=(PROT),                                          X00042**1
               INITIAL='OF',                                           X00043**1
               COLOR=NEUTRAL,                                          X00044**1
               LENGTH=2,                                               X00045**1
               POS=(01,70)                                              00046**1
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00047**1
               COLOR=BLUE,                                             X00048**1
               PICOUT='ZZZ,ZZ9',                                       X00049**1
               LENGTH=7,                                               X00050**1
               POS=(01,73)                                              00051**1
         DFHMDF ATTRB=(ASKIP),                                         X00052**1
               INITIAL='PO NUMBER:',                                   X00053**1
               COLOR=NEUTRAL,                                          X00054**1
               LENGTH=10,                                              X00055**1
               POS=(02,02)                                              00056**3
APONMBR  DFHMDF ATTRB=(ASKIP),                                         X00057**1
               COLOR=BLUE,                                             X00058**1
               PICOUT='ZZZZZZZZ',                                      X00029**1
               LENGTH=08,                                              X00059**1
               POS=(02,13)                                              00060**1
         DFHMDF ATTRB=(ASKIP),                                         X00061**1
               INITIAL='VENDOR:',                                      X00062**1
               COLOR=NEUTRAL,                                          X00063**1
               LENGTH=07,                                              X00064**1
               POS=(02,22)                                              00065**1
AVDRNAM  DFHMDF ATTRB=(ASKIP),                                         X00066**1
               COLOR=BLUE,                                             X00067**1
               LENGTH=30,                                              X00068**1
               POS=(02,30)                                              00069**1
         DFHMDF ATTRB=(ASKIP),                                         X00061**1
               INITIAL='TRBL:',                                        X00062**1
               COLOR=NEUTRAL,                                          X00063**1
               LENGTH=05,                                              X00064**1
               POS=(02,61)                                              00065**1
ATRBRSN  DFHMDF ATTRB=(ASKIP),                                         X00066**1
               COLOR=BLUE,                                             X00067**1
               LENGTH=10,                                              X00068**1
               POS=(02,67)                                              00069**1
AMULTRB  DFHMDF ATTRB=(ASKIP),                                         X00066**1
               COLOR=BLUE,                                             X00067**1
               LENGTH=01,                                              X00068**1
               POS=(02,78)                                              00069**1
********* START OF LINES ****************                                       
ABOLHDR1 DFHMDF ATTRB=(ASKIP),                                         X00075**1
               COLOR=NEUTRAL,                                          X00077**1
               LENGTH=04,                                              X00078**1
               POS=(04,02)                                              00079**1
AVNBOL1  DFHMDF ATTRB=(ASKIP),                                         X00100**1
               COLOR=BLUE,                                             X00101**1
               LENGTH=30,                                              X00102**1
               POS=(04,07)                                              00103**1
ACARHDR1 DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=NEUTRAL,                                          X00082**1
               LENGTH=10,                                              X00083**1
               POS=(04,38)                                              00084**1
ACARNM1  DFHMDF ATTRB=(ASKIP),                                         X00104**1
               COLOR=BLUE,                                             X00105**1
               LENGTH=10,                                              X00106**1
               POS=(04,49)                                              00107**1
ATRLHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=08,                                              X00088**5
               POS=(04,60)                                              00089**1
ACARTR1  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(04,69)                                              00111**1
AVTPHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(05,09)                                              00089**1
AVHTYP1  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(05,22)                                              00111**1
AQTYHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(05,33)                                              00089**1
AVNQTY1  DFHMDF ATTRB=(ASKIP),                                         X00112**1
               COLOR=BLUE,                                             X00113**1
               PICOUT='ZZZZZZ9',                                       X00114**3
               LENGTH=07,                                              X00115**1
               POS=(05,38)                                              00116**1
AVNUOM1  DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=03,                                              X00119**1
               POS=(05,46)                                              00120**1
APOEHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=05,                                              X00088**5
               POS=(05,50)                                              00089**1
ASCITY1  DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=19,                                              X00083**1
               POS=(05,56)                                              00084**1
ASTATE1  DFHMDF ATTRB=(ASKIP),                                         X00125**1
               COLOR=BLUE,                                             X00126**1
               LENGTH=02,                                              X00127**1
               POS=(05,76)                                              00128**1
AETAHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(06,09)                                              00089**1
ASETA1   DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=08,                                              X00083**1
               POS=(06,14)                                              00084**1
ASDTHDR1 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(06,24)                                              00089**1
ASDATE1  DFHMDF ATTRB=(ASKIP),                                         X00129**1
               COLOR=BLUE,                                             X00130**1
               LENGTH=08,                                              X00131**1
               POS=(06,38)                                              00132**1
ASTIME1  DFHMDF ATTRB=(ASKIP),                                         X00133**1
               COLOR=BLUE,                                             X00134**1
               LENGTH=05,                                              X00135**1
               POS=(06,47)                                              00136**1
ASZONE1  DFHMDF ATTRB=(ASKIP),                                         X00137**1
               COLOR=BLUE,                                             X00138**1
               LENGTH=02,                                              X00139**1
               POS=(06,53)                                              00140**1
ASTATS1  DFHMDF ATTRB=(ASKIP),                                         X00141**1
               COLOR=BLUE,                                             X00142**8
               LENGTH=22,                                              X00143**6
               POS=(06,57)                                              00144**1
ABOLHDR2 DFHMDF ATTRB=(ASKIP),                                         X00075**1
               COLOR=NEUTRAL,                                          X00077**1
               LENGTH=04,                                              X00078**1
               POS=(07,02)                                              00079**1
AVNBOL2  DFHMDF ATTRB=(ASKIP),                                         X00100**1
               COLOR=BLUE,                                             X00101**1
               LENGTH=30,                                              X00102**1
               POS=(07,07)                                              00103**1
ACARHDR2 DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=NEUTRAL,                                          X00082**1
               LENGTH=10,                                              X00083**1
               POS=(07,38)                                              00084**1
ACARNM2  DFHMDF ATTRB=(ASKIP),                                         X00104**1
               COLOR=BLUE,                                             X00105**1
               LENGTH=10,                                              X00106**1
               POS=(07,49)                                              00107**1
ATRLHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=08,                                              X00088**5
               POS=(07,60)                                              00089**1
ACARTR2  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(07,69)                                              00111**1
AVTPHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(08,09)                                              00089**1
AVHTYP2  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(08,22)                                              00111**1
AQTYHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(08,33)                                              00089**1
AVNQTY2  DFHMDF ATTRB=(ASKIP),                                         X00112**1
               COLOR=BLUE,                                             X00113**1
               PICOUT='ZZZZZZ9',                                       X00114**3
               LENGTH=07,                                              X00115**1
               POS=(08,38)                                              00116**1
AVNUOM2  DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=03,                                              X00119**1
               POS=(08,46)                                              00120**1
APOEHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=05,                                              X00088**5
               POS=(08,50)                                              00089**1
ASCITY2  DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=19,                                              X00083**1
               POS=(08,56)                                              00084**1
ASTATE2  DFHMDF ATTRB=(ASKIP),                                         X00125**1
               COLOR=BLUE,                                             X00126**1
               LENGTH=02,                                              X00127**1
               POS=(08,76)                                              00128**1
AETAHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(09,09)                                              00089**1
ASETA2   DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=08,                                              X00083**1
               POS=(09,14)                                              00084**1
ASDTHDR2 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(09,24)                                              00089**1
ASDATE2  DFHMDF ATTRB=(ASKIP),                                         X00129**1
               COLOR=BLUE,                                             X00130**1
               LENGTH=08,                                              X00131**1
               POS=(09,38)                                              00132**1
ASTIME2  DFHMDF ATTRB=(ASKIP),                                         X00133**1
               COLOR=BLUE,                                             X00134**1
               LENGTH=05,                                              X00135**1
               POS=(09,47)                                              00136**1
ASZONE2  DFHMDF ATTRB=(ASKIP),                                         X00137**1
               COLOR=BLUE,                                             X00138**1
               LENGTH=02,                                              X00139**1
               POS=(09,53)                                              00140**1
ASTATS2  DFHMDF ATTRB=(ASKIP),                                         X00141**1
               COLOR=BLUE,                                             X00142**8
               LENGTH=22,                                              X00143**6
               POS=(09,57)                                              00144**1
ABOLHDR3 DFHMDF ATTRB=(ASKIP),                                         X00075**1
               COLOR=NEUTRAL,                                          X00077**1
               LENGTH=04,                                              X00078**1
               POS=(10,02)                                              00079**1
AVNBOL3  DFHMDF ATTRB=(ASKIP),                                         X00100**1
               COLOR=BLUE,                                             X00101**1
               LENGTH=30,                                              X00102**1
               POS=(10,07)                                              00103**1
ACARHDR3 DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=NEUTRAL,                                          X00082**1
               LENGTH=10,                                              X00083**1
               POS=(10,38)                                              00084**1
ACARNM3  DFHMDF ATTRB=(ASKIP),                                         X00104**1
               COLOR=BLUE,                                             X00105**1
               LENGTH=10,                                              X00106**1
               POS=(10,49)                                              00107**1
ATRLHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=08,                                              X00088**5
               POS=(10,60)                                              00089**1
ACARTR3  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(10,69)                                              00111**1
AVTPHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(11,09)                                              00089**1
AVHTYP3  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(11,22)                                              00111**1
AQTYHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(11,33)                                              00089**1
AVNQTY3  DFHMDF ATTRB=(ASKIP),                                         X00112**1
               COLOR=BLUE,                                             X00113**1
               PICOUT='ZZZZZZ9',                                       X00114**3
               LENGTH=07,                                              X00115**1
               POS=(11,38)                                              00116**1
AVNUOM3  DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=03,                                              X00119**1
               POS=(11,46)                                              00120**1
APOEHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=05,                                              X00088**5
               POS=(11,50)                                              00089**1
ASCITY3  DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=19,                                              X00083**1
               POS=(11,56)                                              00084**1
ASTATE3  DFHMDF ATTRB=(ASKIP),                                         X00125**1
               COLOR=BLUE,                                             X00126**1
               LENGTH=02,                                              X00127**1
               POS=(11,76)                                              00128**1
AETAHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(12,09)                                              00089**1
ASETA3   DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=08,                                              X00083**1
               POS=(12,14)                                              00084**1
ASDTHDR3 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(12,24)                                              00089**1
ASDATE3  DFHMDF ATTRB=(ASKIP),                                         X00129**1
               COLOR=BLUE,                                             X00130**1
               LENGTH=08,                                              X00131**1
               POS=(12,38)                                              00132**1
ASTIME3  DFHMDF ATTRB=(ASKIP),                                         X00133**1
               COLOR=BLUE,                                             X00134**1
               LENGTH=05,                                              X00135**1
               POS=(12,47)                                              00136**1
ASZONE3  DFHMDF ATTRB=(ASKIP),                                         X00137**1
               COLOR=BLUE,                                             X00138**1
               LENGTH=02,                                              X00139**1
               POS=(12,53)                                              00140**1
ASTATS3  DFHMDF ATTRB=(ASKIP),                                         X00141**1
               COLOR=BLUE,                                             X00142**8
               LENGTH=22,                                              X00143**6
               POS=(12,57)                                              00144**1
ABOLHDR4 DFHMDF ATTRB=(ASKIP),                                         X00075**1
               COLOR=NEUTRAL,                                          X00077**1
               LENGTH=04,                                              X00078**1
               POS=(13,02)                                              00079**1
AVNBOL4  DFHMDF ATTRB=(ASKIP),                                         X00100**1
               COLOR=BLUE,                                             X00101**1
               LENGTH=30,                                              X00102**1
               POS=(13,07)                                              00103**1
ACARHDR4 DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=NEUTRAL,                                          X00082**1
               LENGTH=10,                                              X00083**1
               POS=(13,38)                                              00084**1
ACARNM4  DFHMDF ATTRB=(ASKIP),                                         X00104**1
               COLOR=BLUE,                                             X00105**1
               LENGTH=10,                                              X00106**1
               POS=(13,49)                                              00107**1
ATRLHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=08,                                              X00088**5
               POS=(13,60)                                              00089**1
ACARTR4  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(13,69)                                              00111**1
AVTPHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(14,09)                                              00089**1
AVHTYP4  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(14,22)                                              00111**1
AQTYHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(14,33)                                              00089**1
AVNQTY4  DFHMDF ATTRB=(ASKIP),                                         X00112**1
               COLOR=BLUE,                                             X00113**1
               PICOUT='ZZZZZZ9',                                       X00114**3
               LENGTH=07,                                              X00115**1
               POS=(14,38)                                              00116**1
AVNUOM4  DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=03,                                              X00119**1
               POS=(14,46)                                              00120**1
APOEHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=05,                                              X00088**5
               POS=(14,50)                                              00089**1
ASCITY4  DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=19,                                              X00083**1
               POS=(14,56)                                              00084**1
ASTATE4  DFHMDF ATTRB=(ASKIP),                                         X00125**1
               COLOR=BLUE,                                             X00126**1
               LENGTH=02,                                              X00127**1
               POS=(14,76)                                              00128**1
AETAHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(15,09)                                              00089**1
ASETA4   DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=08,                                              X00083**1
               POS=(15,14)                                              00084**1
ASDTHDR4 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(15,24)                                              00089**1
ASDATE4  DFHMDF ATTRB=(ASKIP),                                         X00129**1
               COLOR=BLUE,                                             X00130**1
               LENGTH=08,                                              X00131**1
               POS=(15,38)                                              00132**1
ASTIME4  DFHMDF ATTRB=(ASKIP),                                         X00133**1
               COLOR=BLUE,                                             X00134**1
               LENGTH=05,                                              X00135**1
               POS=(15,47)                                              00136**1
ASZONE4  DFHMDF ATTRB=(ASKIP),                                         X00137**1
               COLOR=BLUE,                                             X00138**1
               LENGTH=02,                                              X00139**1
               POS=(15,53)                                              00140**1
ASTATS4  DFHMDF ATTRB=(ASKIP),                                         X00141**1
               COLOR=BLUE,                                             X00142**8
               LENGTH=22,                                              X00143**6
               POS=(15,57)                                              00144**1
ABOLHDR5 DFHMDF ATTRB=(ASKIP),                                         X00075**1
               COLOR=NEUTRAL,                                          X00077**1
               LENGTH=04,                                              X00078**1
               POS=(16,02)                                              00079**1
AVNBOL5  DFHMDF ATTRB=(ASKIP),                                         X00100**1
               COLOR=BLUE,                                             X00101**1
               LENGTH=30,                                              X00102**1
               POS=(16,07)                                              00103**1
ACARHDR5 DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=NEUTRAL,                                          X00082**1
               LENGTH=10,                                              X00083**1
               POS=(16,38)                                              00084**1
ACARNM5  DFHMDF ATTRB=(ASKIP),                                         X00104**1
               COLOR=BLUE,                                             X00105**1
               LENGTH=10,                                              X00106**1
               POS=(16,49)                                              00107**1
ATRLHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=08,                                              X00088**5
               POS=(16,60)                                              00089**1
ACARTR5  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(16,69)                                              00111**1
AVTPHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(17,09)                                              00089**1
AVHTYP5  DFHMDF ATTRB=(ASKIP),                                         X00108**1
               COLOR=BLUE,                                             X00109**1
               LENGTH=10,                                              X00110**1
               POS=(17,22)                                              00111**1
AQTYHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(17,33)                                              00089**1
AVNQTY5  DFHMDF ATTRB=(ASKIP),                                         X00112**1
               COLOR=BLUE,                                             X00113**1
               PICOUT='ZZZZZZ9',                                       X00114**3
               LENGTH=07,                                              X00115**1
               POS=(17,38)                                              00116**1
AVNUOM5  DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=03,                                              X00119**1
               POS=(17,46)                                              00120**1
APOEHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=05,                                              X00088**5
               POS=(17,50)                                              00089**1
ASCITY5  DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=19,                                              X00083**1
               POS=(17,56)                                              00084**1
ASTATE5  DFHMDF ATTRB=(ASKIP),                                         X00125**1
               COLOR=BLUE,                                             X00126**1
               LENGTH=02,                                              X00127**1
               POS=(17,76)                                              00128**1
AETAHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=04,                                              X00088**5
               POS=(18,09)                                              00089**1
ASETA5   DFHMDF ATTRB=(ASKIP),                                         X00080**1
               COLOR=BLUE,                                             X00082**1
               LENGTH=08,                                              X00083**1
               POS=(18,14)                                              00084**1
ASDTHDR5 DFHMDF ATTRB=(ASKIP),                                         X00085**1
               COLOR=NEUTRAL,                                          X00087**1
               LENGTH=12,                                              X00088**5
               POS=(18,24)                                              00089**1
ASDATE5  DFHMDF ATTRB=(ASKIP),                                         X00129**1
               COLOR=BLUE,                                             X00130**1
               LENGTH=08,                                              X00131**1
               POS=(18,38)                                              00132**1
ASTIME5  DFHMDF ATTRB=(ASKIP),                                         X00133**1
               COLOR=BLUE,                                             X00134**1
               LENGTH=05,                                              X00135**1
               POS=(18,47)                                              00136**1
ASZONE5  DFHMDF ATTRB=(ASKIP),                                         X00137**1
               COLOR=BLUE,                                             X00138**1
               LENGTH=02,                                              X00139**1
               POS=(18,53)                                              00140**1
ASTATS5  DFHMDF ATTRB=(ASKIP),                                         X00141**1
               COLOR=BLUE,                                             X00142**8
               LENGTH=22,                                              X00143**6
               POS=(18,57)                                              00144**1
         DFHMSD TYPE=FINAL                                              00415**1
         END                                                            00416**1
