*          DATA SET POKM071    AT LEVEL 036 AS OF 05/23/95                      
*          DATA SET POKM071    AT LEVEL 008 AS OF 04/21/95              00001*10
*          DATA SET POKM071    AT LEVEL 010 AS OF 03/21/95              00002*10
*          DATA SET POKM071    AT LEVEL 016 AS OF 02/20/95              00003*10
  PRINT  NOGEN                                                          00004*10
*********************************************************************** 00005*10
*                                                                       00006*10
*        MAPSET  : POKM071                                              00007*10
*        MAP     : PO071A                                               00008*10
*        PROGRAM : POKCS071                                             00009*10
*        TRANSID : W071 - INVOICE EDI INQUIRY                           00010*10
*        SYSTEM  : CICS ARCHITECTURE                                    00011*10
*                                                                       00012*10
*********************************************************************** 00013*10
POKM071  DFHMSD TYPE=MAP,                                              X00014*10
               MODE=INOUT,                                             X00015*10
               LANG=COBOL,                                             X00016*10
               TIOAPFX=YES,                                            X00017*10
               CTRL=(FREEKB)                                            00018*10
PO071A   DFHMDI LINE=02,                                               X00019*10
               COLUMN=01,                                              X00020*10
               SIZE=(19,80),                                           X00021*10
               MAPATTS=(COLOR,HILIGHT),                                X00022*10
               DSATTS=(COLOR,HILIGHT)                                   00023*10
         DFHMDF ATTRB=(PROT),                                          X00024*10
               INITIAL='ITEMS:',                                       X00025*10
               COLOR=NEUTRAL,                                          X00026*10
               LENGTH=6,                                               X00027*10
               POS=(01,44)                                              00028*10
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029*10
               COLOR=GREEN,                                            X00030*10
               HILIGHT=UNDERLINE,                                      X00031*10
               PICOUT='ZZZ,ZZ9',                                       X00032*10
               LENGTH=7,                                               X00033*10
               POS=(01,51)                                              00034*10
         DFHMDF ATTRB=(PROT),                                          X00035*10
               INITIAL='TO',                                           X00036*10
               COLOR=NEUTRAL,                                          X00037*10
               LENGTH=2,                                               X00038*10
               POS=(01,59)                                              00039*10
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00040*10
               COLOR=BLUE,                                             X00041*10
               PICOUT='ZZZ,ZZ9',                                       X00042*10
               LENGTH=7,                                               X00043*10
               POS=(01,62)                                              00044*10
         DFHMDF ATTRB=(PROT),                                          X00045*10
               INITIAL='OF',                                           X00046*10
               COLOR=NEUTRAL,                                          X00047*10
               LENGTH=2,                                               X00048*10
               POS=(01,70)                                              00049*10
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00050*10
               COLOR=BLUE,                                             X00051*10
               PICOUT='ZZZ,ZZ9',                                       X00052*10
               LENGTH=7,                                               X00053*10
               POS=(01,73)                                              00054*10
         DFHMDF ATTRB=(ASKIP),                                         X00055*10
               INITIAL='PO NUMBER..:',                                 X00056*10
               COLOR=NEUTRAL,                                          X00057*10
               LENGTH=12,                                              X00058*10
               POS=(02,03)                                              00059*10
APONMBR  DFHMDF ATTRB=(ASKIP),                                         X00060*10
               COLOR=BLUE,                                             X00061*10
               PICOUT='ZZZZZZZZ',                                      X00063   
               LENGTH=08,                                              X00062*10
               POS=(02,16)                                              00063*10
         DFHMDF ATTRB=(ASKIP),                                         X00064*10
               INITIAL='NETWORK:',                                     X00065*10
               COLOR=NEUTRAL,                                          X00066*10
               LENGTH=08,                                              X00067*10
               POS=(02,32)                                              00068*10
ANETWRK  DFHMDF ATTRB=(ASKIP),                                         X00069*10
               COLOR=BLUE,                                             X00070*10
               LENGTH=5,                                               X00071*10
               POS=(02,41)                                              00072*10
         DFHMDF ATTRB=(ASKIP),                                         X00073*10
               INITIAL='ORDERED UNITS:',                               X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               LENGTH=14,                                              X00076*10
               POS=(02,54)                                              00077*10
AORDUNT  DFHMDF ATTRB=(ASKIP),                                         X00078*10
               COLOR=YELLOW,                                           X00079*10
               LENGTH=05,                                              X00080*10
               POS=(02,75)                                              00081*10
         DFHMDF ATTRB=(ASKIP),                                         X00082*10
               INITIAL='VENDOR NAME:',                                 X00083*10
               COLOR=NEUTRAL,                                          X00084*10
               LENGTH=12,                                              X00085*10
               POS=(03,03)                                              00086*10
AVDRNAM  DFHMDF ATTRB=(ASKIP),                                         X00087*10
               COLOR=BLUE,                                             X00088*10
               LENGTH=30,                                              X00089*10
               POS=(03,16)                                              00090*10
         DFHMDF ATTRB=(ASKIP),                                         X00091*10
               INITIAL='ORDERED COST.:',                               X00092*10
               COLOR=NEUTRAL,                                          X00093*10
               LENGTH=14,                                              X00094*10
               POS=(03,54)                                              00095*10
AORDCST  DFHMDF ATTRB=(ASKIP),                                         X00096*10
               COLOR=YELLOW,                                           X00097*10
               LENGTH=11,                                              X00098*10
               POS=(03,69)                                              00099*10
         DFHMDF ATTRB=(ASKIP),                                         X00100*10
               INITIAL='DATE',                                         X00101*10
               COLOR=NEUTRAL,                                          X00102*10
               LENGTH=4,                                               X00103*10
               POS=(05,03)                                              00104*11
         DFHMDF ATTRB=(ASKIP),                                         X00105*10
               INITIAL='TIME',                                         X00106*10
               COLOR=NEUTRAL,                                          X00107*10
               LENGTH=4,                                               X00108*10
               POS=(05,11)                                              00109*11
         DFHMDF ATTRB=(ASKIP),                                         X00110*10
               INITIAL='INVOICE NO.',                                  X00111*36
               COLOR=NEUTRAL,                                          X00112*10
               LENGTH=11,                                              X00113*36
               POS=(05,17)                                              00114*11
         DFHMDF ATTRB=(ASKIP),                                         X00115*10
               INITIAL='UNITS',                                        X00116*10
               COLOR=NEUTRAL,                                          X00117*10
               LENGTH=5,                                               X00118*10
               POS=(05,32)                                              00119*34
         DFHMDF ATTRB=(ASKIP),                                         X00120*10
               INITIAL='COST $',                                       X00121*10
               COLOR=NEUTRAL,                                          X00122*10
               LENGTH=6,                                               X00123*10
               POS=(05,44)                                              00124*25
         DFHMDF ATTRB=(ASKIP),                                         X00125*10
               INITIAL='DISC $',                                       X00126*10
               COLOR=NEUTRAL,                                          X00127*10
               LENGTH=6,                                               X00128*10
               POS=(05,55)                                              00129*26
         DFHMDF ATTRB=(ASKIP),                                         X00130*11
               INITIAL='NET COST $',                                   X00131*11
               COLOR=NEUTRAL,                                          X00132*11
               LENGTH=10,                                              X00133*11
               POS=(05,64)                                              00134*25
         DFHMDF ATTRB=(ASKIP),                                         X00135*10
               INITIAL='FCLTY',                                        X00136*10
               COLOR=NEUTRAL,                                          X00137*10
               LENGTH=5,                                               X00138*10
               POS=(05,75)                                              00139*10
ADATE01  DFHMDF ATTRB=(ASKIP),                                         X00140*10
               COLOR=BLUE,                                             X00141*19
               LENGTH=08,                                              X00142*10
               POS=(06,01)                                              00143*31
ATIME01  DFHMDF ATTRB=(ASKIP),                                         X00144*10
               COLOR=BLUE,                                             X00145*10
               LENGTH=05,                                              X00146*10
               POS=(06,10)                                              00147*31
AINV01   DFHMDF ATTRB=(ASKIP),                                         X00148*10
               COLOR=BLUE,                                             X00149*10
               LENGTH=15,                                              X00150*13
               POS=(06,16)                                              00151*31
AUNIT01  DFHMDF ATTRB=(ASKIP),                                         X00152*10
               COLOR=BLUE,                                             X00153*10
               LENGTH=05,                                              X00154*10
               POS=(06,32)                                              00155*31
ACOST01  DFHMDF ATTRB=(ASKIP),                                         X00156*10
               COLOR=BLUE,                                             X00157*10
               LENGTH=11,                                              X00158*33
               POS=(06,39)                                              00159*35
ADISC01  DFHMDF ATTRB=(ASKIP),                                         X00160*10
               COLOR=BLUE,                                             X00161*10
               LENGTH=9,                                               X00162*10
               POS=(06,52)                                              00163*35
ANDIS01  DFHMDF ATTRB=(ASKIP),                                         X00164*12
               COLOR=BLUE,                                             X00165*12
               LENGTH=11,                                              X00166*33
               POS=(06,63)                                              00167*35
AFCTY01  DFHMDF ATTRB=(ASKIP),                                         X00168*10
               COLOR=BLUE,                                             X00169*10
               LENGTH=5,                                               X00170*10
               POS=(06,75)                                              00171*10
ADATE02  DFHMDF ATTRB=(ASKIP),                                         X00172*10
               COLOR=BLUE,                                             X00173*10
               LENGTH=08,                                              X00174*10
               POS=(07,01)                                              00175*31
ATIME02  DFHMDF ATTRB=(ASKIP),                                         X00176*10
               COLOR=BLUE,                                             X00177*10
               LENGTH=05,                                              X00178*10
               POS=(07,10)                                              00179*31
AINV02   DFHMDF ATTRB=(ASKIP),                                         X00180*10
               COLOR=BLUE,                                             X00181*10
               LENGTH=15,                                              X00182*13
               POS=(07,16)                                              00183*31
AUNIT02  DFHMDF ATTRB=(ASKIP),                                         X00184*10
               COLOR=BLUE,                                             X00185*10
               LENGTH=05,                                              X00186*10
               POS=(07,32)                                              00187*31
ACOST02  DFHMDF ATTRB=(ASKIP),                                         X00188*10
               COLOR=BLUE,                                             X00189*10
               LENGTH=11,                                              X00190*33
               POS=(07,39)                                              00191*35
ADISC02  DFHMDF ATTRB=(ASKIP),                                         X00192*10
               COLOR=BLUE,                                             X00193*10
               LENGTH=9,                                               X00194*10
               POS=(07,52)                                              00195*35
ANDIS02  DFHMDF ATTRB=(ASKIP),                                         X00196*13
               COLOR=BLUE,                                             X00197*13
               LENGTH=11,                                              X00198*33
               POS=(07,63)                                              00199*35
AFCTY02  DFHMDF ATTRB=(ASKIP),                                         X00200*10
               COLOR=BLUE,                                             X00201*10
               LENGTH=5,                                               X00202*10
               POS=(07,75)                                              00203*10
ADATE03  DFHMDF ATTRB=(ASKIP),                                         X00204*10
               COLOR=BLUE,                                             X00205*10
               LENGTH=08,                                              X00206*10
               POS=(08,01)                                              00207*32
ATIME03  DFHMDF ATTRB=(ASKIP),                                         X00208*10
               COLOR=BLUE,                                             X00209*10
               LENGTH=05,                                              X00210*10
               POS=(08,10)                                              00211*32
AINV03   DFHMDF ATTRB=(ASKIP),                                         X00212*10
               COLOR=BLUE,                                             X00213*10
               LENGTH=15,                                              X00214*14
               POS=(08,16)                                              00215*32
AUNIT03  DFHMDF ATTRB=(ASKIP),                                         X00216*10
               COLOR=BLUE,                                             X00217*10
               LENGTH=05,                                              X00218*10
               POS=(08,32)                                              00219*32
ACOST03  DFHMDF ATTRB=(ASKIP),                                         X00220*10
               COLOR=BLUE,                                             X00221*10
               LENGTH=11,                                              X00222*33
               POS=(08,39)                                              00223*35
ADISC03  DFHMDF ATTRB=(ASKIP),                                         X00224*10
               COLOR=BLUE,                                             X00225*10
               LENGTH=9,                                               X00226*10
               POS=(08,52)                                              00227*35
ANDIS03  DFHMDF ATTRB=(ASKIP),                                         X00228*14
               COLOR=BLUE,                                             X00229*14
               LENGTH=11,                                              X00230*33
               POS=(08,63)                                              00231*35
AFCTY03  DFHMDF ATTRB=(ASKIP),                                         X00232*10
               COLOR=BLUE,                                             X00233*10
               LENGTH=5,                                               X00234*10
               POS=(08,75)                                              00235*10
ADATE04  DFHMDF ATTRB=(ASKIP),                                         X00236*10
               COLOR=BLUE,                                             X00237*10
               LENGTH=08,                                              X00238*10
               POS=(09,01)                                              00239*32
ATIME04  DFHMDF ATTRB=(ASKIP),                                         X00240*10
               COLOR=BLUE,                                             X00241*10
               LENGTH=05,                                              X00242*10
               POS=(09,10)                                              00243*32
AINV04   DFHMDF ATTRB=(ASKIP),                                         X00244*10
               COLOR=BLUE,                                             X00245*10
               LENGTH=15,                                              X00246*15
               POS=(09,16)                                              00247*32
AUNIT04  DFHMDF ATTRB=(ASKIP),                                         X00248*10
               COLOR=BLUE,                                             X00249*10
               LENGTH=05,                                              X00250*10
               POS=(09,32)                                              00251*32
ACOST04  DFHMDF ATTRB=(ASKIP),                                         X00252*10
               COLOR=BLUE,                                             X00253*10
               LENGTH=11,                                              X00254*33
               POS=(09,39)                                              00255*35
ADISC04  DFHMDF ATTRB=(ASKIP),                                         X00256*10
               COLOR=BLUE,                                             X00257*10
               LENGTH=9,                                               X00258*10
               POS=(09,52)                                              00259*35
ANDIS04  DFHMDF ATTRB=(ASKIP),                                         X00260*15
               COLOR=BLUE,                                             X00261*15
               LENGTH=11,                                              X00262*33
               POS=(09,63)                                              00263*35
AFCTY04  DFHMDF ATTRB=(ASKIP),                                         X00264*10
               COLOR=BLUE,                                             X00265*10
               LENGTH=5,                                               X00266*10
               POS=(09,75)                                              00267*10
ADATE05  DFHMDF ATTRB=(ASKIP),                                         X00268*10
               COLOR=BLUE,                                             X00269*10
               LENGTH=08,                                              X00270*10
               POS=(10,01)                                              00271*32
ATIME05  DFHMDF ATTRB=(ASKIP),                                         X00272*10
               COLOR=BLUE,                                             X00273*10
               LENGTH=05,                                              X00274*10
               POS=(10,10)                                              00275*32
AINV05   DFHMDF ATTRB=(ASKIP),                                         X00276*10
               COLOR=BLUE,                                             X00277*10
               LENGTH=15,                                              X00278*15
               POS=(10,16)                                              00279*32
AUNIT05  DFHMDF ATTRB=(ASKIP),                                         X00280*10
               COLOR=BLUE,                                             X00281*10
               LENGTH=05,                                              X00282*10
               POS=(10,32)                                              00283*32
ACOST05  DFHMDF ATTRB=(ASKIP),                                         X00284*10
               COLOR=BLUE,                                             X00285*10
               LENGTH=11,                                              X00286*33
               POS=(10,39)                                              00287*35
ADISC05  DFHMDF ATTRB=(ASKIP),                                         X00288*10
               COLOR=BLUE,                                             X00289*10
               LENGTH=9,                                               X00290*10
               POS=(10,52)                                              00291*35
ANDIS05  DFHMDF ATTRB=(ASKIP),                                         X00292*14
               COLOR=BLUE,                                             X00293*14
               LENGTH=11,                                              X00294*33
               POS=(10,63)                                              00295*35
AFCTY05  DFHMDF ATTRB=(ASKIP),                                         X00296*10
               COLOR=BLUE,                                             X00297*10
               LENGTH=5,                                               X00298*10
               POS=(10,75)                                              00299*10
ADATE06  DFHMDF ATTRB=(ASKIP),                                         X00300*10
               COLOR=BLUE,                                             X00301*10
               LENGTH=08,                                              X00302*10
               POS=(11,01)                                              00303*32
ATIME06  DFHMDF ATTRB=(ASKIP),                                         X00304*10
               COLOR=BLUE,                                             X00305*10
               LENGTH=05,                                              X00306*10
               POS=(11,10)                                              00307*32
AINV06   DFHMDF ATTRB=(ASKIP),                                         X00308*10
               COLOR=BLUE,                                             X00309*10
               LENGTH=15,                                              X00310*16
               POS=(11,16)                                              00311*32
AUNIT06  DFHMDF ATTRB=(ASKIP),                                         X00312*10
               COLOR=BLUE,                                             X00313*10
               LENGTH=05,                                              X00314*10
               POS=(11,32)                                              00315*32
ACOST06  DFHMDF ATTRB=(ASKIP),                                         X00316*10
               COLOR=BLUE,                                             X00317*10
               LENGTH=11,                                              X00318*33
               POS=(11,39)                                              00319*35
ADISC06  DFHMDF ATTRB=(ASKIP),                                         X00320*10
               COLOR=BLUE,                                             X00321*10
               LENGTH=9,                                               X00322*10
               POS=(11,52)                                              00323*35
ANDIS06  DFHMDF ATTRB=(ASKIP),                                         X00324*16
               COLOR=BLUE,                                             X00325*16
               LENGTH=11,                                              X00326*33
               POS=(11,63)                                              00327*35
AFCTY06  DFHMDF ATTRB=(ASKIP),                                         X00328*10
               COLOR=BLUE,                                             X00329*10
               LENGTH=5,                                               X00330*10
               POS=(11,75)                                              00331*10
ADATE07  DFHMDF ATTRB=(ASKIP),                                         X00332*10
               COLOR=BLUE,                                             X00333*10
               LENGTH=08,                                              X00334*10
               POS=(12,01)                                              00335*32
ATIME07  DFHMDF ATTRB=(ASKIP),                                         X00336*10
               COLOR=BLUE,                                             X00337*10
               LENGTH=05,                                              X00338*10
               POS=(12,10)                                              00339*32
AINV07   DFHMDF ATTRB=(ASKIP),                                         X00340*10
               COLOR=BLUE,                                             X00341*10
               LENGTH=15,                                              X00342*16
               POS=(12,16)                                              00343*32
AUNIT07  DFHMDF ATTRB=(ASKIP),                                         X00344*10
               COLOR=BLUE,                                             X00345*10
               LENGTH=05,                                              X00346*10
               POS=(12,32)                                              00347*32
ACOST07  DFHMDF ATTRB=(ASKIP),                                         X00348*10
               COLOR=BLUE,                                             X00349*10
               LENGTH=11,                                              X00350*33
               POS=(12,39)                                              00351*35
ADISC07  DFHMDF ATTRB=(ASKIP),                                         X00352*10
               COLOR=BLUE,                                             X00353*10
               LENGTH=9,                                               X00354*10
               POS=(12,52)                                              00355*35
ANDIS07  DFHMDF ATTRB=(ASKIP),                                         X00356*16
               COLOR=BLUE,                                             X00357*16
               LENGTH=11,                                              X00358*33
               POS=(12,63)                                              00359*35
AFCTY07  DFHMDF ATTRB=(ASKIP),                                         X00360*10
               COLOR=BLUE,                                             X00361*10
               LENGTH=5,                                               X00362*10
               POS=(12,75)                                              00363*10
ADATE08  DFHMDF ATTRB=(ASKIP),                                         X00364*10
               COLOR=BLUE,                                             X00365*10
               LENGTH=08,                                              X00366*10
               POS=(13,01)                                              00367*32
ATIME08  DFHMDF ATTRB=(ASKIP),                                         X00368*10
               COLOR=BLUE,                                             X00369*10
               LENGTH=05,                                              X00370*10
               POS=(13,10)                                              00371*32
AINV08   DFHMDF ATTRB=(ASKIP),                                         X00372*10
               COLOR=BLUE,                                             X00373*10
               LENGTH=15,                                              X00374*16
               POS=(13,16)                                              00375*32
AUNIT08  DFHMDF ATTRB=(ASKIP),                                         X00376*10
               COLOR=BLUE,                                             X00377*10
               LENGTH=05,                                              X00378*10
               POS=(13,32)                                              00379*32
ACOST08  DFHMDF ATTRB=(ASKIP),                                         X00380*10
               COLOR=BLUE,                                             X00381*10
               LENGTH=11,                                              X00382*33
               POS=(13,39)                                              00383*35
ADISC08  DFHMDF ATTRB=(ASKIP),                                         X00384*10
               COLOR=BLUE,                                             X00385*10
               LENGTH=9,                                               X00386*10
               POS=(13,52)                                              00387*35
ANDIS08  DFHMDF ATTRB=(ASKIP),                                         X00388*16
               COLOR=BLUE,                                             X00389*16
               LENGTH=11,                                              X00390*33
               POS=(13,63)                                              00391*35
AFCTY08  DFHMDF ATTRB=(ASKIP),                                         X00392*10
               COLOR=BLUE,                                             X00393*10
               LENGTH=5,                                               X00394*10
               POS=(13,75)                                              00395*10
ADATE09  DFHMDF ATTRB=(ASKIP),                                         X00396*10
               COLOR=BLUE,                                             X00397*10
               LENGTH=08,                                              X00398*10
               POS=(14,01)                                              00399*32
ATIME09  DFHMDF ATTRB=(ASKIP),                                         X00400*10
               COLOR=BLUE,                                             X00401*10
               LENGTH=05,                                              X00402*10
               POS=(14,10)                                              00403*32
AINV09   DFHMDF ATTRB=(ASKIP),                                         X00404*10
               COLOR=BLUE,                                             X00405*10
               LENGTH=15,                                              X00406*16
               POS=(14,16)                                              00407*32
AUNIT09  DFHMDF ATTRB=(ASKIP),                                         X00408*10
               COLOR=BLUE,                                             X00409*10
               LENGTH=05,                                              X00410*10
               POS=(14,32)                                              00411*32
ACOST09  DFHMDF ATTRB=(ASKIP),                                         X00412*10
               COLOR=BLUE,                                             X00413*10
               LENGTH=11,                                              X00414*33
               POS=(14,39)                                              00415*35
ADISC09  DFHMDF ATTRB=(ASKIP),                                         X00416*10
               COLOR=BLUE,                                             X00417*10
               LENGTH=9,                                               X00418*10
               POS=(14,52)                                              00419*35
ANDIS09  DFHMDF ATTRB=(ASKIP),                                         X00420*16
               COLOR=BLUE,                                             X00421*16
               LENGTH=11,                                              X00422*33
               POS=(14,63)                                              00423*35
AFCTY09  DFHMDF ATTRB=(ASKIP),                                         X00424*10
               COLOR=BLUE,                                             X00425*10
               LENGTH=5,                                               X00426*10
               POS=(14,75)                                              00427*10
ADATE10  DFHMDF ATTRB=(ASKIP),                                         X00428*10
               COLOR=BLUE,                                             X00429*10
               LENGTH=08,                                              X00430*10
               POS=(15,01)                                              00431*32
ATIME10  DFHMDF ATTRB=(ASKIP),                                         X00432*10
               COLOR=BLUE,                                             X00433*10
               LENGTH=05,                                              X00434*10
               POS=(15,10)                                              00435*32
AINV10   DFHMDF ATTRB=(ASKIP),                                         X00436*10
               COLOR=BLUE,                                             X00437*10
               LENGTH=15,                                              X00438*16
               POS=(15,16)                                              00439*32
AUNIT10  DFHMDF ATTRB=(ASKIP),                                         X00440*10
               COLOR=BLUE,                                             X00441*10
               LENGTH=05,                                              X00442*10
               POS=(15,32)                                              00443*32
ACOST10  DFHMDF ATTRB=(ASKIP),                                         X00444*10
               COLOR=BLUE,                                             X00445*10
               LENGTH=11,                                              X00446*33
               POS=(15,39)                                              00447*35
ADISC10  DFHMDF ATTRB=(ASKIP),                                         X00448*10
               COLOR=BLUE,                                             X00449*10
               LENGTH=9,                                               X00450*10
               POS=(15,52)                                              00451*35
ANDIS10  DFHMDF ATTRB=(ASKIP),                                         X00452*16
               COLOR=BLUE,                                             X00453*16
               LENGTH=11,                                              X00454*33
               POS=(15,63)                                              00455*35
AFCTY10  DFHMDF ATTRB=(ASKIP),                                         X00456*10
               COLOR=BLUE,                                             X00457*10
               LENGTH=5,                                               X00458*10
               POS=(15,75)                                              00459*10
ADATE11  DFHMDF ATTRB=(ASKIP),                                         X00460*10
               COLOR=BLUE,                                             X00461*10
               LENGTH=08,                                              X00462*10
               POS=(16,01)                                              00463*32
ATIME11  DFHMDF ATTRB=(ASKIP),                                         X00464*10
               COLOR=BLUE,                                             X00465*10
               LENGTH=05,                                              X00466*10
               POS=(16,10)                                              00467*32
AINV11   DFHMDF ATTRB=(ASKIP),                                         X00468*10
               COLOR=BLUE,                                             X00469*10
               LENGTH=15,                                              X00470*23
               POS=(16,16)                                              00471*32
AUNIT11  DFHMDF ATTRB=(ASKIP),                                         X00472*10
               COLOR=BLUE,                                             X00473*10
               LENGTH=05,                                              X00474*10
               POS=(16,32)                                              00475*32
ACOST11  DFHMDF ATTRB=(ASKIP),                                         X00476*10
               COLOR=BLUE,                                             X00477*10
               LENGTH=11,                                              X00478*33
               POS=(16,39)                                              00479*35
ADISC11  DFHMDF ATTRB=(ASKIP),                                         X00480*10
               COLOR=BLUE,                                             X00481*10
               LENGTH=9,                                               X00482*10
               POS=(16,52)                                              00483*35
ANDIS11  DFHMDF ATTRB=(ASKIP),                                         X00484*21
               COLOR=BLUE,                                             X00485*21
               LENGTH=11,                                              X00486*33
               POS=(16,63)                                              00487*35
AFCTY11  DFHMDF ATTRB=(ASKIP),                                         X00488*10
               COLOR=BLUE,                                             X00489*10
               LENGTH=5,                                               X00490*10
               POS=(16,75)                                              00491*10
ADATE12  DFHMDF ATTRB=(ASKIP),                                         X00492*10
               COLOR=BLUE,                                             X00493*10
               LENGTH=08,                                              X00494*10
               POS=(17,01)                                              00495*32
ATIME12  DFHMDF ATTRB=(ASKIP),                                         X00496*10
               COLOR=BLUE,                                             X00497*10
               LENGTH=05,                                              X00498*10
               POS=(17,10)                                              00499*32
AINV12   DFHMDF ATTRB=(ASKIP),                                         X00500*10
               COLOR=BLUE,                                             X00501*10
               LENGTH=15,                                              X00502*27
               POS=(17,16)                                              00503*32
AUNIT12  DFHMDF ATTRB=(ASKIP),                                         X00504*10
               COLOR=BLUE,                                             X00505*10
               LENGTH=05,                                              X00506*10
               POS=(17,32)                                              00507*32
ACOST12  DFHMDF ATTRB=(ASKIP),                                         X00508*10
               COLOR=BLUE,                                             X00509*10
               LENGTH=11,                                              X00510*33
               POS=(17,39)                                              00511*35
ADISC12  DFHMDF ATTRB=(ASKIP),                                         X00512*10
               COLOR=BLUE,                                             X00513*10
               LENGTH=9,                                               X00514*10
               POS=(17,52)                                              00515*35
ANDIS12  DFHMDF ATTRB=(ASKIP),                                         X00516*27
               COLOR=BLUE,                                             X00517*27
               LENGTH=11,                                              X00518*33
               POS=(17,63)                                              00519*35
AFCTY12  DFHMDF ATTRB=(ASKIP),                                         X00520*10
               COLOR=BLUE,                                             X00521*10
               LENGTH=5,                                               X00522*10
               POS=(17,75)                                              00523*10
         DFHMDF ATTRB=(ASKIP),                                         X00524*10
               INITIAL='TOTALS FOR SELECTION LIST ->',                 X00525*24
               COLOR=NEUTRAL,                                          X00526*10
               LENGTH=28,                                              X00527*24
               POS=(18,02)                                              00528*24
AUNITTO  DFHMDF ATTRB=(ASKIP),                                         X00529*10
               COLOR=YELLOW,                                           X00530*10
               LENGTH=06,                                              X00531*10
               POS=(18,31)                                              00532*24
ACOSTTO  DFHMDF ATTRB=(ASKIP),                                         X00533*10
               COLOR=YELLOW,                                           X00534*10
               LENGTH=12,                                              X00535*10
               POS=(18,38)                                              00536*24
ADISCTO  DFHMDF ATTRB=(ASKIP),                                         X00537*10
               COLOR=YELLOW,                                           X00538*10
               LENGTH=10,                                              X00539*10
               POS=(18,51)                                              00540*24
ANCOSTO  DFHMDF ATTRB=(ASKIP),                                         X00541*24
               COLOR=YELLOW,                                           X00542*24
               LENGTH=12,                                              X00543*24
               POS=(18,62)                                              00544*24
         DFHMSD TYPE=FINAL                                              00545*10
         END                                                            00546*10
