*          DATA SET POKM104                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM104                                            *           
*        MAP     PO104A                                             *           
*        PROGRAM POKCS104                                           *           
*        TRANSID W104                                               *           
*        SYSTEM  CICS ARCH - PO LIST WITH SET SHORT NAME            *           
*-------------------------------------------------------------------*           
POKM104 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
*                                                                               
PO104A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
ASETNME DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(01,23)                                                      
ASETYR  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(01,29)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SET',                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(01,34)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='ITEMS:',                                       X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=06,                                              X        
               POS=(01,43)                                                      
ASTRTIT DFHMDF ATTRB=(NUM,UNPROT),                                     X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=07,                                              X        
               POS=(01,50),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,58)                                                      
AENDIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,61),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='OF',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,69)                                                      
ATOTIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,72),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='PO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(02,08)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='AD       SHIP     CANCEL    UNITS',            X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=33,                                              X        
               POS=(02,38)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SEL',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(03,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NUMBER  DPT  VENDOR NM  STS',                  X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=27,                                              X        
               POS=(03,06)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='  DATE      DATE      DATE    ORDERED  SET',   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=42,                                              X        
               POS=(03,35)                                                      
*                                                                               
ASEL01  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(04,02)                                                      
APONM01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(04,04)                                                      
ADEPT01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(04,14)                                                      
AVND01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(04,19)                                                      
ASTS01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(04,30)                                                      
AADT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(04,35)                                                      
ASDT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(04,45)                                                      
ACDT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(04,55)                                                      
AUNT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(04,65)                                                      
ASNME01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(04,73)                                                      
*                                                                               
ASEL02  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(05,02)                                                      
APONM02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(05,04)                                                      
ADEPT02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(05,14)                                                      
AVND02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(05,19)                                                      
ASTS02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(05,30)                                                      
AADT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,35)                                                      
ASDT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,45)                                                      
ACDT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,55)                                                      
AUNT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(05,65)                                                      
ASNME02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(05,73)                                                      
*                                                                               
ASEL03  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(06,02)                                                      
APONM03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(06,04)                                                      
ADEPT03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(06,14)                                                      
AVND03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(06,19)                                                      
ASTS03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(06,30)                                                      
AADT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,35)                                                      
ASDT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,45)                                                      
ACDT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,55)                                                      
AUNT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(06,65)                                                      
ASNME03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(06,73)                                                      
*                                                                               
ASEL04  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(07,02)                                                      
APONM04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(07,04)                                                      
ADEPT04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(07,14)                                                      
AVND04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(07,19)                                                      
ASTS04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(07,30)                                                      
AADT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,35)                                                      
ASDT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,45)                                                      
ACDT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,55)                                                      
AUNT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(07,65)                                                      
ASNME04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(07,73)                                                      
*                                                                               
ASEL05  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(08,02)                                                      
APONM05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(08,04)                                                      
ADEPT05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(08,14)                                                      
AVND05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(08,19)                                                      
ASTS05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(08,30)                                                      
AADT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,35)                                                      
ASDT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,45)                                                      
ACDT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,55)                                                      
AUNT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(08,65)                                                      
ASNME05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(08,73)                                                      
*                                                                               
ASEL06  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(09,02)                                                      
APONM06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(09,04)                                                      
ADEPT06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(09,14)                                                      
AVND06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(09,19)                                                      
ASTS06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(09,30)                                                      
AADT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,35)                                                      
ASDT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,45)                                                      
ACDT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,55)                                                      
AUNT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(09,65)                                                      
ASNME06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(09,73)                                                      
*                                                                               
ASEL07  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(10,02)                                                      
APONM07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(10,04)                                                      
ADEPT07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(10,14)                                                      
AVND07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(10,19)                                                      
ASTS07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(10,30)                                                      
AADT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,35)                                                      
ASDT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,45)                                                      
ACDT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,55)                                                      
AUNT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(10,65)                                                      
ASNME07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(10,73)                                                      
*                                                                               
ASEL08  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(11,02)                                                      
APONM08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(11,04)                                                      
ADEPT08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(11,14)                                                      
AVND08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(11,19)                                                      
ASTS08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(11,30)                                                      
AADT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,35)                                                      
ASDT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,45)                                                      
ACDT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,55)                                                      
AUNT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(11,65)                                                      
ASNME08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(11,73)                                                      
*                                                                               
ASEL09  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(12,02)                                                      
APONM09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(12,04)                                                      
ADEPT09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(12,14)                                                      
AVND09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(12,19)                                                      
ASTS09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(12,30)                                                      
AADT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,35)                                                      
ASDT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,45)                                                      
ACDT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,55)                                                      
AUNT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(12,65)                                                      
ASNME09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(12,73)                                                      
*                                                                               
ASEL10  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(13,02)                                                      
APONM10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(13,04)                                                      
ADEPT10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(13,14)                                                      
AVND10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(13,19)                                                      
ASTS10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(13,30)                                                      
AADT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,35)                                                      
ASDT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,45)                                                      
ACDT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,55)                                                      
AUNT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(13,65)                                                      
ASNME10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(13,73)                                                      
*                                                                               
ASEL11  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(14,02)                                                      
APONM11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(14,04)                                                      
ADEPT11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(14,14)                                                      
AVND11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(14,19)                                                      
ASTS11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(14,30)                                                      
AADT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,35)                                                      
ASDT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,45)                                                      
ACDT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,55)                                                      
AUNT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(14,65)                                                      
ASNME11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(14,73)                                                      
*                                                                               
ASEL12  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(15,02)                                                      
APONM12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(15,04)                                                      
ADEPT12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(15,14)                                                      
AVND12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(15,19)                                                      
ASTS12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(15,30)                                                      
AADT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,35)                                                      
ASDT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,45)                                                      
ACDT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,55)                                                      
AUNT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(15,65)                                                      
ASNME12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(15,73)                                                      
*                                                                               
ASEL13  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(16,02)                                                      
APONM13 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(16,04)                                                      
ADEPT13 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(16,14)                                                      
AVND13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(16,19)                                                      
ASTS13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(16,30)                                                      
AADT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,35)                                                      
ASDT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,45)                                                      
ACDT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,55)                                                      
AUNT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(16,65)                                                      
ASNME13 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=05,                                              X        
               POS=(16,73)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TOTALS FOR SELECTION LIST ---->',              X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=31,                                              X        
               POS=(17,29)                                                      
ATUNIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(17,61)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=25,                                              X        
               POS=(18,47)                                                      
ASELIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(18,73),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
