*          DATA SET POKM032    AT LEVEL 001 AS OF 02/25/94                      
*          DATA SET POKM032    AT LEVEL 008 AS OF 10/06/93              00001   
  PRINT  NOGEN                                                          00002   
************************************************************            00003   
*                                                                       00004   
*      MAPSET :  POKM032                                                00005   
*      MAP    :  PO032A                                                 00006   
*      PROGRAM:  POKCS032                                               00007   
*                                                                       00008   
************************************************************            00009   
POKM032  DFHMSD TYPE=MAP,                                              X00010   
               CTRL=(FREEKB),                                          X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               TIOAPFX=YES                                              00014   
PO032A   DFHMDI LINE=02,                                               X00015   
               COLUMN=01,                                              X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
         DFHMDF ATTRB=(ASKIP),                                         X00020   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00021   
               COLOR=NEUTRAL,                                          X00022   
               LENGTH=22,                                              X00023   
               POS=(02,1)                                               00024   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00025   
               JUSTIFY=(LEFT,BLANK),                                   X00026   
               COLOR=BLUE,                                             X00027   
               PICOUT='ZZZZZZZZ',                                      X00028   
               LENGTH=8,                                               X00029   
               POS=(02,24)                                              00030   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               INITIAL='DEPARTMENT:',                                  X00032   
               COLOR=NEUTRAL,                                          X00033   
               LENGTH=11,                                              X00034   
               POS=(02,35)                                              00035   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00036   
               COLOR=BLUE,                                             X00037   
               LENGTH=3,                                               X00038   
               POS=(02,47)                                              00039   
ASEASET  DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=15,                                              X        
               POS=(02,56)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X00040   
               INITIAL='VENDOR NAME:',                                 X00041   
               COLOR=NEUTRAL,                                          X00042   
               LENGTH=12,                                              X00043   
               POS=(03,1)                                               00044   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00045   
               COLOR=BLUE,                                             X00046   
               LENGTH=30,                                              X00047   
               POS=(03,14)                                              00048   
         DFHMDF ATTRB=(ASKIP),                                         X00049   
               INITIAL='SHIPPING POINT............:',                  X00050   
               COLOR=NEUTRAL,                                          X00051   
               LENGTH=27,                                              X00052   
               POS=(06,4)                                               00053   
ASHPOPT  DFHMDF ATTRB=(ASKIP),                                         X00054   
               COLOR=BLUE,                                             X00055   
               LENGTH=20,                                              X00056   
               POS=(06,32)                                              00057   
         DFHMDF ATTRB=(ASKIP),                                         X00058   
               INITIAL='FOB POINT.................:',                  X00059   
               COLOR=NEUTRAL,                                          X00060   
               LENGTH=27,                                              X00061   
               POS=(07,4)                                               00062   
AFOBPT   DFHMDF ATTRB=(ASKIP),                                         X00063   
               COLOR=BLUE,                                             X00064   
               LENGTH=20,                                              X00065   
               POS=(07,32)                                              00066   
         DFHMDF ATTRB=(ASKIP),                                         X00094   
               INITIAL='BACKORDERS PERMITTED..........:',              X00095   
               COLOR=NEUTRAL,                                          X00096   
               LENGTH=31,                                              X00097   
               POS=(10,4)                                               00098   
ABACKPR  DFHMDF ATTRB=(ASKIP),                                         X00099   
               COLOR=BLUE,                                             X00100   
               LENGTH=3,                                               X00101   
               POS=(10,37)                                              00102   
         DFHMDF ATTRB=(ASKIP),                                         X00103   
               INITIAL='FREIGHT PAYMENT RESPONSIBILITY:',              X00104   
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=31,                                              X00106   
               POS=(11,4)                                               00107   
AFRTPAY  DFHMDF ATTRB=(ASKIP),                                         X00108   
               COLOR=BLUE,                                             X00109   
               LENGTH=6,                                               X00110   
               POS=(11,37)                                              00111   
         DFHMDF ATTRB=(ASKIP),                                         X00112   
               INITIAL='VENDOR FREIGHT PERCENT........:',              X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=31,                                              X00115   
               POS=(12,4)                                               00116   
AVNDFPT  DFHMDF ATTRB=(ASKIP),                                         X00117   
               COLOR=BLUE,                                             X00118   
               LENGTH=5,                                               X00119   
               PICOUT='ZZ.99',                                         X00120   
               POS=(12,37)                                              00121   
         DFHMDF ATTRB=(ASKIP),                                         X00122   
               INITIAL='KOHLS FREIGHT PERCENT.........:',              X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=31,                                              X00125   
               POS=(13,4)                                               00126   
AKHLFPT  DFHMDF ATTRB=(ASKIP),                                         X00127   
               COLOR=BLUE,                                             X00128   
               LENGTH=5,                                               X00129   
               PICOUT='ZZ.99',                                         X00130   
               POS=(13,37)                                              00131   
         DFHMSD TYPE=FINAL                                              00132   
         END                                                            00133   
