*          DATA SET POKM034    AT LEVEL 004 AS OF 10/08/93                      
*          DATA SET POKM034    AT LEVEL 006 AS OF 09/29/93              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  POKM034                                            *   00005   
*        MAP     PO034A                                             *   00006   
*        PROGRAM POKCS034                                           *   00007   
*        TRANSID W034                                               *   00008   
*        SYSTEM  CICS ARCH - PO ITEM SUMMARY LIST                   *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
POKM034 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
PO034A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
         DFHMDF ATTRB=(PROT),                                          X00024   
               INITIAL='ITEMS:',                                       X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=6,                                               X00027   
               POS=(01,44)                                              00028   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029   
               COLOR=GREEN,                                            X00030   
               HILIGHT=UNDERLINE,                                      X00031   
               PICOUT='ZZZ,ZZ9',                                       X00032   
               LENGTH=7,                                               X00033   
               POS=(01,51)                                              00034   
         DFHMDF ATTRB=(PROT),                                          X00035   
               INITIAL='TO',                                           X00036   
               COLOR=NEUTRAL,                                          X00037   
               LENGTH=2,                                               X00038   
               POS=(01,59)                                              00039   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZ,ZZ9',                                       X00042   
               LENGTH=7,                                               X00043   
               POS=(01,62)                                              00044   
         DFHMDF ATTRB=(PROT),                                          X00045   
               INITIAL='OF',                                           X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=2,                                               X00048   
               POS=(01,70)                                              00049   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZZ,ZZ9',                                       X00052   
               LENGTH=7,                                               X00053   
               POS=(01,73)                                              00054   
*                                                                       00055   
         DFHMDF ATTRB=(ASKIP),                                         X00056   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00057   
               COLOR=NEUTRAL,                                          X00058   
               LENGTH=22,                                              X00059   
               POS=(02,1)                                               00060   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00061   
               COLOR=BLUE,                                             X00062   
               PICOUT='ZZZZZZZZ',                                      X00063   
               LENGTH=8,                                               X00064   
               POS=(02,24)                                              00065   
         DFHMDF ATTRB=(ASKIP),                                         X00066   
               INITIAL='DEPARTMENT:',                                  X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=11,                                              X00069   
               POS=(02,37)                                              00070   
AHDEPT   DFHMDF ATTRB=(ASKIP),                                         X00071   
               COLOR=BLUE,                                             X00072   
               LENGTH=3,                                               X00073   
               POS=(02,49)                                              00074   
*                                                                       00075   
         DFHMDF ATTRB=(ASKIP),                                         X00076   
               INITIAL='VENDOR NAME:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(03,1)                                               00080   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00081   
               COLOR=BLUE,                                             X00082   
               LENGTH=30,                                              X00083   
               POS=(03,14)                                              00084   
*                                                                       00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL='TOTAL UNITS:',                                 X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=12,                                              X00089   
               POS=(05,2)                                               00090   
ATOTU    DFHMDF ATTRB=(ASKIP),                                         X00091   
               COLOR=BLUE,                                             X00092   
               PICOUT='ZZZZZZZ',                                       X00093   
               LENGTH=7,                                               X00094   
               POS=(05,15)                                              00095   
         DFHMDF ATTRB=(ASKIP),                                         X00096   
               INITIAL='SKUS ORDERED:',                                X00097   
               COLOR=NEUTRAL,                                          X00098   
               LENGTH=13,                                              X00099   
               POS=(05,26)                                              00100   
ATOTSKU  DFHMDF ATTRB=(ASKIP),                                         X00101   
               COLOR=BLUE,                                             X00102   
               PICOUT='ZZZ',                                           X00103   
               LENGTH=3,                                               X00104   
               POS=(05,40)                                              00105   
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='MJ SU',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(06,10)                                                      
*                                                                       00106   
         DFHMDF ATTRB=(ASKIP),                                         X00107   
               INITIAL='ALLOC/',                                       X00108   
               COLOR=NEUTRAL,                                          X00109   
               LENGTH=6,                                               X00110   
               POS=(06,74)                                              00111   
*                                                                       00112   
         DFHMDF ATTRB=(ASKIP),                                         X00113   
               INITIAL='SEL LINE CL CL SKU / UPC',                     X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=24,                                              X00116   
               POS=(07,1)                                               00117   
         DFHMDF ATTRB=(ASKIP),                                         X00118   
               INITIAL='VENDOR STYLE / DESC  ST',                      X00119**3
               COLOR=NEUTRAL,                                          X00120   
               LENGTH=23,                                              X00121**3
               POS=(07,28)                                              00122   
         DFHMDF ATTRB=(ASKIP),                                         X00123   
               INITIAL='QTY IN RTE  RECVD AD DATE',                    X00124**4
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=25,                                              X00126**4
               POS=(07,55)                                              00127**4
*                                                                       00128   
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00129   
               COLOR=GREEN,                                            X00130   
               HILIGHT=UNDERLINE,                                      X00131   
               LENGTH=1,                                               X00132   
               POS=(08,2)                                               00133   
         DFHMDF ATTRB=(ASKIP),                                         X00134   
               POS=(08,4),                                             X00135   
               LENGTH=1                                                 00136   
ALNE1    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(08,06)                                              00141   
AMCL1    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(08,10)                                              00145**3
ACL1     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(08,13)                                              00149**3
ASKU1    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(08,16)                                              00153**3
ASTYL1   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(08,28)                                              00157   
ASTAT1   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(08,49)                                              00161**3
AQTY1    DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(08,52)                                              00166**3
ARTE1    DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(08,59)                                              00171**3
AREC1    DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(08,66)                                              00176**3
AALC1    DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=4,                                               X00179   
               POS=(08,75)                                              00180   
*                                                                       00181   
APKIN1   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=YELLOW,                                           X        
               LENGTH=1,                                               X        
               POS=(09,06)                                                      
AUPC1    DFHMDF ATTRB=(ASKIP),                                         X00182   
               COLOR=BLUE,                                             X00183   
               LENGTH=16,                                              X00184   
               POS=(09,10)                                              00185**3
ADESC1   DFHMDF ATTRB=(ASKIP),                                         X00186   
               COLOR=BLUE,                                             X00187   
               LENGTH=30,                                              X00188   
               POS=(09,28)                                              00189   
AADTE1   DFHMDF ATTRB=(ASKIP),                                         X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(09,72)                                              00193   
*                                                                       00194   
ASEL2    DFHMDF ATTRB=(UNPROT),                                        X00195   
               COLOR=GREEN,                                            X00196   
               HILIGHT=UNDERLINE,                                      X00197   
               LENGTH=1,                                               X00198   
               POS=(10,2)                                               00199   
         DFHMDF ATTRB=(ASKIP),                                         X00200   
               POS=(10,4),                                             X00201   
               LENGTH=1                                                 00202   
ALNE2    DFHMDF ATTRB=(ASKIP),                                         X00203   
               COLOR=BLUE,                                             X00204   
               PICOUT='ZZZ',                                           X00205   
               LENGTH=3,                                               X00206   
               POS=(10,06)                                              00207   
AMCL2    DFHMDF ATTRB=(ASKIP),                                         X00208   
               COLOR=BLUE,                                             X00209   
               LENGTH=2,                                               X00210   
               POS=(10,10)                                              00211**3
ACL2     DFHMDF ATTRB=(ASKIP),                                         X00212   
               COLOR=BLUE,                                             X00213   
               LENGTH=2,                                               X00214   
               POS=(10,13)                                              00215**3
ASKU2    DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=BLUE,                                             X00217   
               LENGTH=8,                                               X00218   
               POS=(10,16)                                              00219**3
ASTYL2   DFHMDF ATTRB=(ASKIP),                                         X00220   
               COLOR=BLUE,                                             X00221   
               LENGTH=20,                                              X00222   
               POS=(10,28)                                              00223   
ASTAT2   DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=BLUE,                                             X00225   
               LENGTH=2,                                               X00226   
               POS=(10,49)                                              00227**3
AQTY2    DFHMDF ATTRB=(ASKIP),                                         X00228   
               COLOR=BLUE,                                             X00229   
               PICOUT='ZZZZZZ',                                        X00230   
               LENGTH=6,                                               X00231   
               POS=(10,52)                                              00232**3
ARTE2    DFHMDF ATTRB=(ASKIP),                                         X00233   
               COLOR=BLUE,                                             X00234   
               PICOUT='ZZZZZZ',                                        X00235   
               LENGTH=6,                                               X00236   
               POS=(10,59)                                              00237**3
AREC2    DFHMDF ATTRB=(ASKIP),                                         X00238   
               COLOR=BLUE,                                             X00239   
               PICOUT='ZZZZZZ',                                        X00240   
               LENGTH=6,                                               X00241   
               POS=(10,66)                                              00242**3
AALC2    DFHMDF ATTRB=(ASKIP),                                         X00243   
               COLOR=BLUE,                                             X00244   
               LENGTH=4,                                               X00245   
               POS=(10,75)                                              00246   
*                                                                       00247   
APKIN2   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=YELLOW,                                           X        
               LENGTH=1,                                               X        
               POS=(11,06)                                                      
AUPC2    DFHMDF ATTRB=(ASKIP),                                         X00248   
               COLOR=BLUE,                                             X00249   
               LENGTH=16,                                              X00250   
               POS=(11,10)                                              00251**3
ADESC2   DFHMDF ATTRB=(ASKIP),                                         X00252   
               COLOR=BLUE,                                             X00253   
               LENGTH=30,                                              X00254   
               POS=(11,28)                                              00255   
AADTE2   DFHMDF ATTRB=(ASKIP),                                         X00256   
               COLOR=BLUE,                                             X00257   
               LENGTH=8,                                               X00258   
               POS=(11,72)                                              00259   
*                                                                       00260   
ASEL3    DFHMDF ATTRB=(UNPROT),                                        X00261   
               COLOR=GREEN,                                            X00262   
               HILIGHT=UNDERLINE,                                      X00263   
               LENGTH=1,                                               X00264   
               POS=(12,2)                                               00265   
         DFHMDF ATTRB=(ASKIP),                                         X00266   
               POS=(12,4),                                             X00267   
               LENGTH=1                                                 00268   
ALNE3    DFHMDF ATTRB=(ASKIP),                                         X00269   
               COLOR=BLUE,                                             X00270   
               PICOUT='ZZZ',                                           X00271   
               LENGTH=3,                                               X00272   
               POS=(12,06)                                              00273   
AMCL3    DFHMDF ATTRB=(ASKIP),                                         X00274   
               COLOR=BLUE,                                             X00275   
               LENGTH=2,                                               X00276   
               POS=(12,10)                                              00277**3
ACL3     DFHMDF ATTRB=(ASKIP),                                         X00278   
               COLOR=BLUE,                                             X00279   
               LENGTH=2,                                               X00280   
               POS=(12,13)                                              00281**3
ASKU3    DFHMDF ATTRB=(ASKIP),                                         X00282   
               COLOR=BLUE,                                             X00283   
               LENGTH=8,                                               X00284   
               POS=(12,16)                                              00285**3
ASTYL3   DFHMDF ATTRB=(ASKIP),                                         X00286   
               COLOR=BLUE,                                             X00287   
               LENGTH=20,                                              X00288   
               POS=(12,28)                                              00289   
ASTAT3   DFHMDF ATTRB=(ASKIP),                                         X00290   
               COLOR=BLUE,                                             X00291   
               LENGTH=2,                                               X00292   
               POS=(12,49)                                              00293**3
AQTY3    DFHMDF ATTRB=(ASKIP),                                         X00294   
               COLOR=BLUE,                                             X00295   
               PICOUT='ZZZZZZ',                                        X00296   
               LENGTH=6,                                               X00297   
               POS=(12,52)                                              00298**3
ARTE3    DFHMDF ATTRB=(ASKIP),                                         X00299   
               COLOR=BLUE,                                             X00300   
               PICOUT='ZZZZZZ',                                        X00301   
               LENGTH=6,                                               X00302   
               POS=(12,59)                                              00303**3
AREC3    DFHMDF ATTRB=(ASKIP),                                         X00304   
               COLOR=BLUE,                                             X00305   
               PICOUT='ZZZZZZ',                                        X00306   
               LENGTH=6,                                               X00307   
               POS=(12,66)                                              00308**3
AALC3    DFHMDF ATTRB=(ASKIP),                                         X00309   
               COLOR=BLUE,                                             X00310   
               LENGTH=4,                                               X00311   
               POS=(12,75)                                              00312   
*                                                                       00313   
APKIN3   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=YELLOW,                                           X        
               LENGTH=1,                                               X        
               POS=(13,06)                                                      
AUPC3    DFHMDF ATTRB=(ASKIP),                                         X00314   
               COLOR=BLUE,                                             X00315   
               LENGTH=16,                                              X00316   
               POS=(13,10)                                              00317**3
ADESC3   DFHMDF ATTRB=(ASKIP),                                         X00318   
               COLOR=BLUE,                                             X00319   
               LENGTH=30,                                              X00320   
               POS=(13,28)                                              00321   
AADTE3   DFHMDF ATTRB=(ASKIP),                                         X00322   
               COLOR=BLUE,                                             X00323   
               LENGTH=8,                                               X00324   
               POS=(13,72)                                              00325   
*                                                                       00326   
ASEL4    DFHMDF ATTRB=(UNPROT),                                        X00327   
               COLOR=GREEN,                                            X00328   
               HILIGHT=UNDERLINE,                                      X00329   
               LENGTH=1,                                               X00330   
               POS=(14,2)                                               00331   
         DFHMDF ATTRB=(ASKIP),                                         X00332   
               POS=(14,4),                                             X00333   
               LENGTH=1                                                 00334   
ALNE4    DFHMDF ATTRB=(ASKIP),                                         X00335   
               COLOR=BLUE,                                             X00336   
               PICOUT='ZZZ',                                           X00337   
               LENGTH=3,                                               X00338   
               POS=(14,06)                                              00339   
AMCL4    DFHMDF ATTRB=(ASKIP),                                         X00340   
               COLOR=BLUE,                                             X00341   
               LENGTH=2,                                               X00342   
               POS=(14,10)                                              00343**3
ACL4     DFHMDF ATTRB=(ASKIP),                                         X00344   
               COLOR=BLUE,                                             X00345   
               LENGTH=2,                                               X00346   
               POS=(14,13)                                              00347**3
ASKU4    DFHMDF ATTRB=(ASKIP),                                         X00348   
               COLOR=BLUE,                                             X00349   
               LENGTH=8,                                               X00350   
               POS=(14,16)                                              00351**3
ASTYL4   DFHMDF ATTRB=(ASKIP),                                         X00352   
               COLOR=BLUE,                                             X00353   
               LENGTH=20,                                              X00354   
               POS=(14,28)                                              00355   
ASTAT4   DFHMDF ATTRB=(ASKIP),                                         X00356   
               COLOR=BLUE,                                             X00357   
               LENGTH=2,                                               X00358   
               POS=(14,49)                                              00359**3
AQTY4    DFHMDF ATTRB=(ASKIP),                                         X00360   
               COLOR=BLUE,                                             X00361   
               PICOUT='ZZZZZZ',                                        X00362   
               LENGTH=6,                                               X00363   
               POS=(14,52)                                              00364**3
ARTE4    DFHMDF ATTRB=(ASKIP),                                         X00365   
               COLOR=BLUE,                                             X00366   
               PICOUT='ZZZZZZ',                                        X00367   
               LENGTH=6,                                               X00368   
               POS=(14,59)                                              00369**3
AREC4    DFHMDF ATTRB=(ASKIP),                                         X00370   
               COLOR=BLUE,                                             X00371   
               PICOUT='ZZZZZZ',                                        X00372   
               LENGTH=6,                                               X00373   
               POS=(14,66)                                              00374**3
AALC4    DFHMDF ATTRB=(ASKIP),                                         X00375   
               COLOR=BLUE,                                             X00376   
               LENGTH=4,                                               X00377   
               POS=(14,75)                                              00378   
*                                                                       00379   
APKIN4   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=YELLOW,                                           X        
               LENGTH=1,                                               X        
               POS=(15,06)                                                      
AUPC4    DFHMDF ATTRB=(ASKIP),                                         X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=16,                                              X00382   
               POS=(15,10)                                              00383**3
ADESC4   DFHMDF ATTRB=(ASKIP),                                         X00384   
               COLOR=BLUE,                                             X00385   
               LENGTH=30,                                              X00386   
               POS=(15,28)                                              00387   
AADTE4   DFHMDF ATTRB=(ASKIP),                                         X00388   
               COLOR=BLUE,                                             X00389   
               LENGTH=8,                                               X00390   
               POS=(15,72)                                              00391   
*                                                                       00392   
ASEL5    DFHMDF ATTRB=(UNPROT),                                        X00393   
               COLOR=GREEN,                                            X00394   
               HILIGHT=UNDERLINE,                                      X00395   
               LENGTH=1,                                               X00396   
               POS=(16,2)                                               00397   
         DFHMDF ATTRB=(ASKIP),                                         X00398   
               POS=(16,4),                                             X00399   
               LENGTH=1                                                 00400   
ALNE5    DFHMDF ATTRB=(ASKIP),                                         X00401   
               COLOR=BLUE,                                             X00402   
               PICOUT='ZZZ',                                           X00403   
               LENGTH=3,                                               X00404   
               POS=(16,06)                                              00405   
AMCL5    DFHMDF ATTRB=(ASKIP),                                         X00406   
               COLOR=BLUE,                                             X00407   
               LENGTH=2,                                               X00408   
               POS=(16,10)                                              00409**3
ACL5     DFHMDF ATTRB=(ASKIP),                                         X00410   
               COLOR=BLUE,                                             X00411   
               LENGTH=2,                                               X00412   
               POS=(16,13)                                              00413**3
ASKU5    DFHMDF ATTRB=(ASKIP),                                         X00414   
               COLOR=BLUE,                                             X00415   
               LENGTH=8,                                               X00416   
               POS=(16,16)                                              00417**3
ASTYL5   DFHMDF ATTRB=(ASKIP),                                         X00418   
               COLOR=BLUE,                                             X00419   
               LENGTH=20,                                              X00420   
               POS=(16,28)                                              00421   
ASTAT5   DFHMDF ATTRB=(ASKIP),                                         X00422   
               COLOR=BLUE,                                             X00423   
               LENGTH=2,                                               X00424   
               POS=(16,49)                                              00425**3
AQTY5    DFHMDF ATTRB=(ASKIP),                                         X00426   
               COLOR=BLUE,                                             X00427   
               PICOUT='ZZZZZZ',                                        X00428   
               LENGTH=6,                                               X00429   
               POS=(16,52)                                              00430**3
ARTE5    DFHMDF ATTRB=(ASKIP),                                         X00431   
               COLOR=BLUE,                                             X00432   
               PICOUT='ZZZZZZ',                                        X00433   
               LENGTH=6,                                               X00434   
               POS=(16,59)                                              00435**3
AREC5    DFHMDF ATTRB=(ASKIP),                                         X00436   
               COLOR=BLUE,                                             X00437   
               PICOUT='ZZZZZZ',                                        X00438   
               LENGTH=6,                                               X00439   
               POS=(16,66)                                              00440**3
AALC5    DFHMDF ATTRB=(ASKIP),                                         X00441   
               COLOR=BLUE,                                             X00442   
               LENGTH=4,                                               X00443   
               POS=(16,75)                                              00444   
*                                                                       00445   
APKIN5   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=YELLOW,                                           X        
               LENGTH=1,                                               X        
               POS=(17,06)                                                      
AUPC5    DFHMDF ATTRB=(ASKIP),                                         X00446**3
               COLOR=BLUE,                                             X00447   
               LENGTH=16,                                              X00448   
               POS=(17,10)                                              00449**3
ADESC5   DFHMDF ATTRB=(ASKIP),                                         X00450**3
               COLOR=BLUE,                                             X00451   
               LENGTH=30,                                              X00452   
               POS=(17,28)                                              00453   
AADTE5   DFHMDF ATTRB=(ASKIP),                                         X00454**3
               COLOR=BLUE,                                             X00455   
               LENGTH=8,                                               X00456   
               POS=(17,72)                                              00457   
*                                                                       00458   
         DFHMDF ATTRB=(PROT),                                          X00459   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00460   
               COLOR=NEUTRAL,                                          X00461   
               LENGTH=25,                                              X00462   
               POS=(19,45)                                              00463   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00464   
               COLOR=BLUE,                                             X00465   
               PICOUT='ZZZ,ZZ9',                                       X00466   
               LENGTH=7,                                               X00467   
               POS=(19,72)                                              00468   
*                                                                       00469   
         DFHMSD TYPE=FINAL                                              00470   
         END                                                            00471   
