*          DATA SET POKM062    AT LEVEL 008 AS OF 04/11/94                      
  PRINT  NOGEN                                                          00001   
************************************************************            00002**6
*                                                                       00003   
*  BMS MAPSET :  POKM062                                                00004   
*      MAP    :  PO062A                                                 00005   
************************************************************            00006   
POKM062 DFHMSD TYPE=DSECT,                                             X00007**2
               LANG=COBOL,                                             X00008**2
               MODE=INOUT,                                             X00009**2
               STORAGE=AUTO,                                           X00010**2
               TIOAPFX=YES,                                            X00011**2
               TERM=3270-2                                              00012**2
PO062A  DFHMDI LINE=2,COLUMN=1,                                        X00013**4
               SIZE=(19,80),                                           X00014**4
               CTRL=(FREEKB),                                          X00015**4
               MAPATTS=(COLOR,HILIGHT),                                X00016**4
               DSATTS=(COLOR,HILIGHT)                                   00017**4
*                                                                       00018**4
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00019   
*                                                                       00020   
*  SCREEN LINE 01                                                       00021   
*                                                                       00022   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00023   
         DFHMDF ATTRB=(ASKIP),                                         X00024   
               POS=(01,1),                                             X00025   
               INITIAL=' ',                                            X00026   
               LENGTH=1                                                 00027   
         DFHMDF ATTRB=(PROT),                                          X00028   
               INITIAL='ITEMS:',                                       X00029   
               COLOR=NEUTRAL,                                          X00030   
               LENGTH=6,                                               X00031   
               POS=(01,44)                                              00032   
****************************************                                00033   
*  VARIABLE = ASTRTIT      N006                                         00034   
****************************************                                00035   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00036   
               JUSTIFY=(LEFT,BLANK),                                   X00037   
               COLOR=GREEN,                                            X00038   
               HILIGHT=UNDERLINE,                                      X00039   
               PICOUT='ZZZ,ZZ9',                                       X00040   
               LENGTH=7,                                               X00041   
               POS=(01,51)                                              00042   
         DFHMDF ATTRB=(PROT),                                          X00043   
               INITIAL='TO',                                           X00044   
               COLOR=NEUTRAL,                                          X00045   
               LENGTH=2,                                               X00046   
               POS=(01,59)                                              00047   
****************************************                                00048   
*  VARIABLE = AENDIT      N006                                          00049   
****************************************                                00050   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00051   
               JUSTIFY=(LEFT,BLANK),                                   X00052   
               COLOR=BLUE,                                             X00053   
               PICOUT='ZZZ,ZZ9',                                       X00054   
               LENGTH=7,                                               X00055   
               POS=(01,62)                                              00056   
         DFHMDF ATTRB=(PROT),                                          X00057   
               INITIAL='OF',                                           X00058   
               COLOR=NEUTRAL,                                          X00059   
               LENGTH=2,                                               X00060   
               POS=(01,70)                                              00061   
****************************************                                00062   
*  VARIABLE = ATOTIT      N006                                          00063   
****************************************                                00064   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00065   
               JUSTIFY=(LEFT,BLANK),                                   X00066   
               COLOR=BLUE,                                             X00067   
               PICOUT='ZZZ,ZZ9',                                       X00068   
               LENGTH=7,                                               X00069   
               POS=(01,73)                                              00070   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00071   
*                                                                       00072   
*  SCREEN LINE 02                                                       00073   
*                                                                       00074   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00075   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00076   
               POS=(02,1),                                             X00077   
               INITIAL=' ',                                            X00078   
               LENGTH=1                                                 00079   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00080   
*                                                                       00081   
*  SCREEN LINE 03                                                       00082   
*                                                                       00083   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00084   
         DFHMDF ATTRB=(ASKIP),                                         X00085   
               INITIAL='PURCHASE',                                     X00086   
               COLOR=NEUTRAL,                                          X00087   
               LENGTH=8,                                               X00088   
               POS=(03,1)                                               00089   
         DFHMDF ATTRB=(ASKIP),                                         X00090   
               INITIAL='ORDER',                                        X00091   
               COLOR=NEUTRAL,                                          X00092   
               LENGTH=5,                                               X00093   
               POS=(03,10)                                              00094   
         DFHMDF ATTRB=(ASKIP),                                         X00095   
               INITIAL='NUMBER:',                                      X00096   
               COLOR=NEUTRAL,                                          X00097   
               LENGTH=7,                                               X00098   
               POS=(03,16)                                              00099   
****************************************                                00100   
*  VARIABLE = PURCHASE-ORDER-NUMB      N007                             00101   
****************************************                                00102   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00103   
               JUSTIFY=(LEFT,BLANK),                                   X00104   
               COLOR=BLUE,                                             X00105   
               PICOUT='ZZZZZZZZ',                                      X00106   
               LENGTH=8,                                               X00107   
               POS=(03,24)                                              00108   
         DFHMDF ATTRB=(ASKIP),                                         X00109   
               POS=(03,33),                                            X00110   
               INITIAL=' ',                                            X00111   
               LENGTH=1                                                 00112   
         DFHMDF ATTRB=(ASKIP),                                         X00113   
               INITIAL='DEPARTMENT:',                                  X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=11,                                              X00116   
               POS=(03,38)                                              00117   
****************************************                                00118   
*  VARIABLE = HEADER-DEPARTMENT      X003                               00119   
****************************************                                00120   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00121   
               COLOR=BLUE,                                             X00122   
               LENGTH=3,                                               X00123   
               POS=(03,50)                                              00124   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00125   
               INITIAL=' ',                                            X00126   
               LENGTH=1,                                               X00127   
               POS=(03,54)                                              00128   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00129   
*                                                                       00130   
*  SCREEN LINE 04                                                       00131   
*                                                                       00132   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00133   
         DFHMDF ATTRB=(ASKIP),                                         X00134   
               INITIAL='VENDOR',                                       X00135   
               COLOR=NEUTRAL,                                          X00136   
               LENGTH=6,                                               X00137   
               POS=(04,1)                                               00138   
         DFHMDF ATTRB=(ASKIP),                                         X00139   
               INITIAL='NAME:',                                        X00140   
               COLOR=NEUTRAL,                                          X00141   
               LENGTH=5,                                               X00142   
               POS=(04,8)                                               00143   
****************************************                                00144   
*  VARIABLE = VENDOR-NAME      X030                                     00145   
****************************************                                00146   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00147   
               COLOR=BLUE,                                             X00148   
               LENGTH=30,                                              X00149   
               POS=(04,14)                                              00150   
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00151   
               INITIAL=' ',                                            X00152   
               LENGTH=1,                                               X00153   
               POS=(04,45)                                              00154   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00155   
*                                                                       00156   
*  SCREEN LINE 05                                                       00157   
*                                                                       00158   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00159   
         DFHMDF ATTRB=(ASKIP),                                         X00160   
               POS=(05,1),                                             X00161   
               INITIAL=' ',                                            X00162   
               LENGTH=1                                                 00163   
         DFHMDF ATTRB=(ASKIP),                                         X00164   
               INITIAL='CURRENT',                                      X00165   
               COLOR=NEUTRAL,                                          X00166   
               LENGTH=7,                                               X00167   
               POS=(05,59)                                              00168**8
         DFHMDF ATTRB=(ASKIP),                                         X00169   
               POS=(05,51),                                            X00170**8
               INITIAL=' ',                                            X00171   
               LENGTH=1                                                 00172   
         DFHMDF ATTRB=(ASKIP),                                         X00173   
               INITIAL='TOTAL',                                        X00174   
               COLOR=NEUTRAL,                                          X00175   
               LENGTH=5,                                               X00176   
               POS=(05,72)                                              00177**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00178   
*                                                                       00179   
*  SCREEN LINE 06                                                       00180   
*                                                                       00181   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00182   
         DFHMDF ATTRB=(PROT),                                          X00183   
               INITIAL='STR',                                          X00184   
               COLOR=NEUTRAL,                                          X00185   
               LENGTH=3,                                               X00186   
               POS=(06,3)                                               00187   
         DFHMDF ATTRB=(ASKIP),                                         X00188   
               POS=(06,7),                                             X00189   
               INITIAL=' ',                                            X00190   
               LENGTH=1                                                 00191   
         DFHMDF ATTRB=(ASKIP),                                         X00192   
               INITIAL='STORE',                                        X00193   
               COLOR=NEUTRAL,                                          X00194   
               LENGTH=5,                                               X00195   
               POS=(06,9)                                               00196   
         DFHMDF ATTRB=(ASKIP),                                         X00197   
               INITIAL='NAME',                                         X00198   
               COLOR=NEUTRAL,                                          X00199   
               LENGTH=4,                                               X00200   
               POS=(06,15)                                              00201**6
         DFHMDF ATTRB=(ASKIP),                                         X00202   
               POS=(06,33),                                            X00203   
               INITIAL=' ',                                            X00204   
               LENGTH=1                                                 00205   
         DFHMDF ATTRB=(PROT),                                          X00206   
               INITIAL='DC',                                           X00207   
               COLOR=NEUTRAL,                                          X00208   
               LENGTH=2,                                               X00209   
               POS=(06,52)                                              00210**8
         DFHMDF ATTRB=(ASKIP),                                         X00211   
               INITIAL='ALLOCATION',                                   X00212   
               COLOR=NEUTRAL,                                          X00213   
               LENGTH=10,                                              X00214   
               POS=(06,58)                                              00215**8
         DFHMDF ATTRB=(ASKIP),                                         X00216   
               INITIAL='RECEIVED',                                     X00217   
               COLOR=NEUTRAL,                                          X00218   
               LENGTH=8,                                               X00219   
               POS=(06,71)                                              00220**8
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00221   
*                                                                       00222   
*  SCREEN LINE 07                                                       00223   
*                                                                       00224   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00225   
****************************************                                00226   
*  VARIABLE = STORE      N003                                           00227   
****************************************                                00228   
ASTR     DFHMDF ATTRB=(ASKIP),                                         X00229   
               JUSTIFY=(LEFT,BLANK),                                   X00230   
               COLOR=BLUE,                                             X00231   
               PICOUT='9999',                                          X00232   
               LENGTH=4,                                               X00233   
               POS=(07,2)                                               00234   
         DFHMDF ATTRB=(ASKIP),                                         X00235   
               POS=(07,7),                                             X00236   
               INITIAL=' ',                                            X00237   
               LENGTH=1                                                 00238   
****************************************                                00239   
*  VARIABLE = -DESCRIPTION      X025                                    00240   
****************************************                                00241   
ASTNM    DFHMDF ATTRB=(ASKIP),                                         X00242   
               COLOR=BLUE,                                             X00243   
               LENGTH=40,                                              X00244   
               POS=(07,09)                                              00245**5
****************************************                                00246   
*  VARIABLE = DC      X002                                              00247   
****************************************                                00248   
ADC      DFHMDF ATTRB=(ASKIP),                                         X00249   
               COLOR=BLUE,                                             X00250   
               LENGTH=2,                                               X00251   
               POS=(07,52)                                              00252**7
****************************************                                00253   
*  VARIABLE = IN-ROUTE      N009                                        00254   
****************************************                                00255   
AQTY     DFHMDF ATTRB=(ASKIP),                                         X00256   
               JUSTIFY=(LEFT,BLANK),                                   X00257   
               COLOR=BLUE,                                             X00258   
               PICOUT='ZZZZZZZZZ',                                     X00259   
               LENGTH=9,                                               X00260   
               POS=(07,58)                                              00261**7
****************************************                                00262   
*  VARIABLE = ALLOCO      N009                                          00263   
****************************************                                00264   
AREC     DFHMDF ATTRB=(ASKIP),                                         X00265   
               JUSTIFY=(LEFT,BLANK),                                   X00266   
               COLOR=BLUE,                                             X00267   
               PICOUT='ZZZZZZZZZ',                                     X00268   
               LENGTH=9,                                               X00269   
               POS=(07,70)                                              00270**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00271   
*                                                                       00272   
*  SCREEN LINE 08                                                       00273   
*                                                                       00274   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00275   
****************************************                                00276   
*  VARIABLE = STORE      N003                                           00277   
****************************************                                00278   
ASTR1    DFHMDF ATTRB=(ASKIP),                                         X00279   
               JUSTIFY=(LEFT,BLANK),                                   X00280   
               COLOR=BLUE,                                             X00281   
               PICOUT='9999',                                          X00282   
               LENGTH=4,                                               X00283   
               POS=(08,2)                                               00284   
         DFHMDF ATTRB=(ASKIP),                                         X00285   
               POS=(08,7),                                             X00286   
               INITIAL=' ',                                            X00287   
               LENGTH=1                                                 00288   
****************************************                                00289   
*  VARIABLE = -DESCRIPTION      X025                                    00290   
****************************************                                00291   
ASTNM1   DFHMDF ATTRB=(ASKIP),                                         X00292   
               COLOR=BLUE,                                             X00293   
               LENGTH=40,                                              X00294   
               POS=(08,09)                                              00295**5
****************************************                                00296   
*  VARIABLE = DC      X002                                              00297   
****************************************                                00298   
ADC1     DFHMDF ATTRB=(ASKIP),                                         X00299   
               COLOR=BLUE,                                             X00300   
               LENGTH=2,                                               X00301   
               POS=(08,52)                                              00302**7
****************************************                                00303   
*  VARIABLE = IN-ROUTE      N009                                        00304   
****************************************                                00305   
AQTY1    DFHMDF ATTRB=(ASKIP),                                         X00306   
               JUSTIFY=(LEFT,BLANK),                                   X00307   
               COLOR=BLUE,                                             X00308   
               PICOUT='ZZZZZZZZZ',                                     X00309   
               LENGTH=9,                                               X00310   
               POS=(08,58)                                              00311**7
****************************************                                00312   
*  VARIABLE = ALLOCO      N009                                          00313   
****************************************                                00314   
AREC1    DFHMDF ATTRB=(ASKIP),                                         X00315   
               JUSTIFY=(LEFT,BLANK),                                   X00316   
               COLOR=BLUE,                                             X00317   
               PICOUT='ZZZZZZZZZ',                                     X00318   
               LENGTH=9,                                               X00319   
               POS=(08,70)                                              00320**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00321   
*                                                                       00322   
*  SCREEN LINE 09                                                       00323   
*                                                                       00324   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00325   
****************************************                                00326   
*  VARIABLE = STORE      N003                                           00327   
****************************************                                00328   
ASTR2    DFHMDF ATTRB=(ASKIP),                                         X00329   
               JUSTIFY=(LEFT,BLANK),                                   X00330   
               COLOR=BLUE,                                             X00331   
               PICOUT='9999',                                          X00332   
               LENGTH=4,                                               X00333   
               POS=(09,2)                                               00334   
         DFHMDF ATTRB=(ASKIP),                                         X00335   
               POS=(09,7),                                             X00336   
               INITIAL=' ',                                            X00337   
               LENGTH=1                                                 00338   
****************************************                                00339   
*  VARIABLE = -DESCRIPTION      X025                                    00340   
****************************************                                00341   
ASTNM2   DFHMDF ATTRB=(ASKIP),                                         X00342   
               COLOR=BLUE,                                             X00343   
               LENGTH=40,                                              X00344   
               POS=(09,09)                                              00345**5
****************************************                                00346   
*  VARIABLE = DC      X002                                              00347   
****************************************                                00348   
ADC2     DFHMDF ATTRB=(ASKIP),                                         X00349   
               COLOR=BLUE,                                             X00350   
               LENGTH=2,                                               X00351   
               POS=(09,52)                                              00352**7
****************************************                                00353   
*  VARIABLE = IN-ROUTE      N009                                        00354   
****************************************                                00355   
AQTY2    DFHMDF ATTRB=(ASKIP),                                         X00356   
               JUSTIFY=(LEFT,BLANK),                                   X00357   
               COLOR=BLUE,                                             X00358   
               PICOUT='ZZZZZZZZZ',                                     X00359   
               LENGTH=9,                                               X00360   
               POS=(09,58)                                              00361**7
AREC2    DFHMDF ATTRB=(ASKIP),                                         X00362   
               JUSTIFY=(LEFT,BLANK),                                   X00363   
               COLOR=BLUE,                                             X00364   
               PICOUT='ZZZZZZZZZ',                                     X00365   
               LENGTH=9,                                               X00366   
               POS=(09,70)                                              00367**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00368   
*                                                                       00369   
*  SCREEN LINE 10                                                       00370   
*                                                                       00371   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00372   
****************************************                                00373   
*  VARIABLE = STORE      N003                                           00374   
****************************************                                00375   
ASTR3    DFHMDF ATTRB=(ASKIP),                                         X00376   
               JUSTIFY=(LEFT,BLANK),                                   X00377   
               COLOR=BLUE,                                             X00378   
               PICOUT='9999',                                          X00379   
               LENGTH=4,                                               X00380   
               POS=(10,2)                                               00381   
         DFHMDF ATTRB=(ASKIP),                                         X00382   
               POS=(10,7),                                             X00383   
               INITIAL=' ',                                            X00384   
               LENGTH=1                                                 00385   
****************************************                                00386   
*  VARIABLE = -DESCRIPTION      X025                                    00387   
****************************************                                00388   
ASTNM3   DFHMDF ATTRB=(ASKIP),                                         X00389   
               COLOR=BLUE,                                             X00390   
               LENGTH=40,                                              X00391   
               POS=(10,09)                                              00392**5
****************************************                                00393   
*  VARIABLE = DC      X002                                              00394   
****************************************                                00395   
ADC3     DFHMDF ATTRB=(ASKIP),                                         X00396   
               COLOR=BLUE,                                             X00397   
               LENGTH=2,                                               X00398   
               POS=(10,52)                                              00399**7
****************************************                                00400   
*  VARIABLE = IN-ROUTE      N009                                        00401   
****************************************                                00402   
AQTY3    DFHMDF ATTRB=(ASKIP),                                         X00403   
               JUSTIFY=(LEFT,BLANK),                                   X00404   
               COLOR=BLUE,                                             X00405   
               PICOUT='ZZZZZZZZZ',                                     X00406   
               LENGTH=9,                                               X00407   
               POS=(10,58)                                              00408**7
****************************************                                00409   
*  VARIABLE = ALLOCO      N009                                          00410   
****************************************                                00411   
AREC3    DFHMDF ATTRB=(ASKIP),                                         X00412   
               JUSTIFY=(LEFT,BLANK),                                   X00413   
               COLOR=BLUE,                                             X00414   
               PICOUT='ZZZZZZZZZ',                                     X00415   
               LENGTH=9,                                               X00416   
               POS=(10,70)                                              00417**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00418   
*                                                                       00419   
*  SCREEN LINE 11                                                       00420   
*                                                                       00421   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00422   
****************************************                                00423   
*  VARIABLE = STORE      N003                                           00424   
****************************************                                00425   
ASTR4    DFHMDF ATTRB=(ASKIP),                                         X00426   
               JUSTIFY=(LEFT,BLANK),                                   X00427   
               COLOR=BLUE,                                             X00428   
               PICOUT='9999',                                          X00429   
               LENGTH=4,                                               X00430   
               POS=(11,2)                                               00431   
         DFHMDF ATTRB=(ASKIP),                                         X00432   
               POS=(11,7),                                             X00433   
               INITIAL=' ',                                            X00434   
               LENGTH=1                                                 00435   
****************************************                                00436   
*  VARIABLE = -DESCRIPTION      X025                                    00437   
****************************************                                00438   
ASTNM4   DFHMDF ATTRB=(ASKIP),                                         X00439   
               COLOR=BLUE,                                             X00440   
               LENGTH=40,                                              X00441   
               POS=(11,09)                                              00442**5
****************************************                                00443   
*  VARIABLE = DC      X002                                              00444   
****************************************                                00445   
ADC4     DFHMDF ATTRB=(ASKIP),                                         X00446   
               COLOR=BLUE,                                             X00447   
               LENGTH=2,                                               X00448   
               POS=(11,52)                                              00449**7
****************************************                                00450   
*  VARIABLE = IN-ROUTE      N009                                        00451   
****************************************                                00452   
AQTY4    DFHMDF ATTRB=(ASKIP),                                         X00453   
               JUSTIFY=(LEFT,BLANK),                                   X00454   
               COLOR=BLUE,                                             X00455   
               PICOUT='ZZZZZZZZZ',                                     X00456   
               LENGTH=9,                                               X00457   
               POS=(11,58)                                              00458**7
****************************************                                00459   
*  VARIABLE = ALLOCO      N009                                          00460   
****************************************                                00461   
AREC4    DFHMDF ATTRB=(ASKIP),                                         X00462   
               JUSTIFY=(LEFT,BLANK),                                   X00463   
               COLOR=BLUE,                                             X00464   
               PICOUT='ZZZZZZZZZ',                                     X00465   
               LENGTH=9,                                               X00466   
               POS=(11,70)                                              00467**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00468   
*                                                                       00469   
*  SCREEN LINE 12                                                       00470   
*                                                                       00471   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00472   
****************************************                                00473   
*  VARIABLE = STORE      N003                                           00474   
****************************************                                00475   
ASTR5    DFHMDF ATTRB=(ASKIP),                                         X00476   
               JUSTIFY=(LEFT,BLANK),                                   X00477   
               COLOR=BLUE,                                             X00478   
               PICOUT='9999',                                          X00479   
               LENGTH=4,                                               X00480   
               POS=(12,2)                                               00481   
         DFHMDF ATTRB=(ASKIP),                                         X00482   
               POS=(12,7),                                             X00483   
               INITIAL=' ',                                            X00484   
               LENGTH=1                                                 00485   
****************************************                                00486   
*  VARIABLE = -DESCRIPTION      X025                                    00487   
****************************************                                00488   
ASTNM5   DFHMDF ATTRB=(ASKIP),                                         X00489   
               COLOR=BLUE,                                             X00490   
               LENGTH=40,                                              X00491   
               POS=(12,09)                                              00492**5
****************************************                                00493   
*  VARIABLE = DC      X002                                              00494   
****************************************                                00495   
ADC5     DFHMDF ATTRB=(ASKIP),                                         X00496   
               COLOR=BLUE,                                             X00497   
               LENGTH=2,                                               X00498   
               POS=(12,52)                                              00499**7
****************************************                                00500   
*  VARIABLE = IN-ROUTE      N009                                        00501   
****************************************                                00502   
AQTY5    DFHMDF ATTRB=(ASKIP),                                         X00503   
               JUSTIFY=(LEFT,BLANK),                                   X00504   
               COLOR=BLUE,                                             X00505   
               PICOUT='ZZZZZZZZZ',                                     X00506   
               LENGTH=9,                                               X00507   
               POS=(12,58)                                              00508**7
****************************************                                00509   
*  VARIABLE = ALLOCO      N009                                          00510   
****************************************                                00511   
AREC5    DFHMDF ATTRB=(ASKIP),                                         X00512   
               JUSTIFY=(LEFT,BLANK),                                   X00513   
               COLOR=BLUE,                                             X00514   
               PICOUT='ZZZZZZZZZ',                                     X00515   
               LENGTH=9,                                               X00516   
               POS=(12,70)                                              00517**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00518   
*                                                                       00519   
*  SCREEN LINE 13                                                       00520   
*                                                                       00521   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00522   
****************************************                                00523   
*  VARIABLE = STORE      N003                                           00524   
****************************************                                00525   
ASTR6    DFHMDF ATTRB=(ASKIP),                                         X00526   
               JUSTIFY=(LEFT,BLANK),                                   X00527   
               COLOR=BLUE,                                             X00528   
               PICOUT='9999',                                          X00529   
               LENGTH=4,                                               X00530   
               POS=(13,2)                                               00531   
         DFHMDF ATTRB=(ASKIP),                                         X00532   
               POS=(13,7),                                             X00533   
               INITIAL=' ',                                            X00534   
               LENGTH=1                                                 00535   
****************************************                                00536   
*  VARIABLE = -DESCRIPTION      X025                                    00537   
****************************************                                00538   
ASTNM6   DFHMDF ATTRB=(ASKIP),                                         X00539   
               COLOR=BLUE,                                             X00540   
               LENGTH=40,                                              X00541   
               POS=(13,09)                                              00542**5
****************************************                                00543   
*  VARIABLE = DC      X002                                              00544   
****************************************                                00545   
ADC6     DFHMDF ATTRB=(ASKIP),                                         X00546   
               COLOR=BLUE,                                             X00547   
               LENGTH=2,                                               X00548   
               POS=(13,52)                                              00549**7
****************************************                                00550   
*  VARIABLE = IN-ROUTE      N009                                        00551   
****************************************                                00552   
AQTY6    DFHMDF ATTRB=(ASKIP),                                         X00553   
               JUSTIFY=(LEFT,BLANK),                                   X00554   
               COLOR=BLUE,                                             X00555   
               PICOUT='ZZZZZZZZZ',                                     X00556   
               LENGTH=9,                                               X00557   
               POS=(13,58)                                              00558**7
****************************************                                00559   
*  VARIABLE = ALLOCO      N009                                          00560   
****************************************                                00561   
AREC6    DFHMDF ATTRB=(ASKIP),                                         X00562   
               JUSTIFY=(LEFT,BLANK),                                   X00563   
               COLOR=BLUE,                                             X00564   
               PICOUT='ZZZZZZZZZ',                                     X00565   
               LENGTH=9,                                               X00566   
               POS=(13,70)                                              00567**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00568   
*                                                                       00569   
*  SCREEN LINE 14                                                       00570   
*                                                                       00571   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00572   
****************************************                                00573   
*  VARIABLE = STORE      N003                                           00574   
****************************************                                00575   
ASTR7    DFHMDF ATTRB=(ASKIP),                                         X00576   
               JUSTIFY=(LEFT,BLANK),                                   X00577   
               COLOR=BLUE,                                             X00578   
               PICOUT='9999',                                          X00579   
               LENGTH=4,                                               X00580   
               POS=(14,2)                                               00581   
         DFHMDF ATTRB=(ASKIP),                                         X00582   
               POS=(14,7),                                             X00583   
               INITIAL=' ',                                            X00584   
               LENGTH=1                                                 00585   
****************************************                                00586   
*  VARIABLE = -DESCRIPTION      X025                                    00587   
****************************************                                00588   
ASTNM7   DFHMDF ATTRB=(ASKIP),                                         X00589   
               COLOR=BLUE,                                             X00590   
               LENGTH=40,                                              X00591   
               POS=(14,09)                                              00592**5
****************************************                                00593   
*  VARIABLE = DC      X002                                              00594   
****************************************                                00595   
ADC7     DFHMDF ATTRB=(ASKIP),                                         X00596   
               COLOR=BLUE,                                             X00597   
               LENGTH=2,                                               X00598   
               POS=(14,52)                                              00599**7
****************************************                                00600   
*  VARIABLE = IN-ROUTE      N009                                        00601   
****************************************                                00602   
AQTY7    DFHMDF ATTRB=(ASKIP),                                         X00603   
               JUSTIFY=(LEFT,BLANK),                                   X00604   
               COLOR=BLUE,                                             X00605   
               PICOUT='ZZZZZZZZZ',                                     X00606   
               LENGTH=9,                                               X00607   
               POS=(14,58)                                              00608**7
****************************************                                00609   
*  VARIABLE = ALLOCO      N009                                          00610   
****************************************                                00611   
AREC7    DFHMDF ATTRB=(ASKIP),                                         X00612   
               JUSTIFY=(LEFT,BLANK),                                   X00613   
               COLOR=BLUE,                                             X00614   
               PICOUT='ZZZZZZZZZ',                                     X00615   
               LENGTH=9,                                               X00616   
               POS=(14,70)                                              00617**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00618   
*                                                                       00619   
*  SCREEN LINE 15                                                       00620   
*                                                                       00621   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00622   
****************************************                                00623   
*  VARIABLE = STORE      N003                                           00624   
****************************************                                00625   
ASTR8    DFHMDF ATTRB=(ASKIP),                                         X00626   
               JUSTIFY=(LEFT,BLANK),                                   X00627   
               COLOR=BLUE,                                             X00628   
               PICOUT='9999',                                          X00629   
               LENGTH=4,                                               X00630   
               POS=(15,2)                                               00631   
         DFHMDF ATTRB=(ASKIP),                                         X00632   
               POS=(15,7),                                             X00633   
               INITIAL=' ',                                            X00634   
               LENGTH=1                                                 00635   
****************************************                                00636   
*  VARIABLE = -DESCRIPTION      X025                                    00637   
****************************************                                00638   
ASTNM8   DFHMDF ATTRB=(ASKIP),                                         X00639   
               COLOR=BLUE,                                             X00640   
               LENGTH=40,                                              X00641   
               POS=(15,09)                                              00642**5
****************************************                                00643   
*  VARIABLE = DC      X002                                              00644   
****************************************                                00645   
ADC8     DFHMDF ATTRB=(ASKIP),                                         X00646   
               COLOR=BLUE,                                             X00647   
               LENGTH=2,                                               X00648   
               POS=(15,52)                                              00649**7
****************************************                                00650   
*  VARIABLE = IN-ROUTE      N009                                        00651   
****************************************                                00652   
AQTY8    DFHMDF ATTRB=(ASKIP),                                         X00653   
               JUSTIFY=(LEFT,BLANK),                                   X00654   
               COLOR=BLUE,                                             X00655   
               PICOUT='ZZZZZZZZZ',                                     X00656   
               LENGTH=9,                                               X00657   
               POS=(15,58)                                              00658**7
****************************************                                00659   
*  VARIABLE = ALLOCO      N009                                          00660   
****************************************                                00661   
AREC8    DFHMDF ATTRB=(ASKIP),                                         X00662   
               JUSTIFY=(LEFT,BLANK),                                   X00663   
               COLOR=BLUE,                                             X00664   
               PICOUT='ZZZZZZZZZ',                                     X00665   
               LENGTH=9,                                               X00666   
               POS=(15,70)                                              00667**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00668   
*                                                                       00669   
*  SCREEN LINE 16                                                       00670   
*                                                                       00671   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00672   
****************************************                                00673   
*  VARIABLE = STORE      N003                                           00674   
****************************************                                00675   
ASTR9    DFHMDF ATTRB=(ASKIP),                                         X00676   
               JUSTIFY=(LEFT,BLANK),                                   X00677   
               COLOR=BLUE,                                             X00678   
               PICOUT='9999',                                          X00679   
               LENGTH=4,                                               X00680   
               POS=(16,2)                                               00681   
         DFHMDF ATTRB=(ASKIP),                                         X00682   
               POS=(16,7),                                             X00683   
               INITIAL=' ',                                            X00684   
               LENGTH=1                                                 00685   
****************************************                                00686   
*  VARIABLE = -DESCRIPTION      X025                                    00687   
****************************************                                00688   
ASTNM9   DFHMDF ATTRB=(ASKIP),                                         X00689   
               COLOR=BLUE,                                             X00690   
               LENGTH=40,                                              X00691   
               POS=(16,09)                                              00692**5
****************************************                                00693   
*  VARIABLE = DC      X002                                              00694   
****************************************                                00695   
ADC9     DFHMDF ATTRB=(ASKIP),                                         X00696   
               COLOR=BLUE,                                             X00697   
               LENGTH=2,                                               X00698   
               POS=(16,52)                                              00699**7
****************************************                                00700   
*  VARIABLE = IN-ROUTE      N009                                        00701   
****************************************                                00702   
AQTY9    DFHMDF ATTRB=(ASKIP),                                         X00703   
               JUSTIFY=(LEFT,BLANK),                                   X00704   
               COLOR=BLUE,                                             X00705   
               PICOUT='ZZZZZZZZZ',                                     X00706   
               LENGTH=9,                                               X00707   
               POS=(16,58)                                              00708**7
****************************************                                00709   
*  VARIABLE = ALLOCO      N009                                          00710   
****************************************                                00711   
AREC9    DFHMDF ATTRB=(ASKIP),                                         X00712   
               JUSTIFY=(LEFT,BLANK),                                   X00713   
               COLOR=BLUE,                                             X00714   
               PICOUT='ZZZZZZZZZ',                                     X00715   
               LENGTH=9,                                               X00716   
               POS=(16,70)                                              00717**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00718   
*                                                                       00719   
*  SCREEN LINE 17                                                       00720   
*                                                                       00721   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00722   
****************************************                                00723   
*  VARIABLE = STORE      N003                                           00724   
****************************************                                00725   
ASTR10   DFHMDF ATTRB=(ASKIP),                                         X00726   
               JUSTIFY=(LEFT,BLANK),                                   X00727   
               COLOR=BLUE,                                             X00728   
               PICOUT='9999',                                          X00729   
               LENGTH=4,                                               X00730   
               POS=(17,2)                                               00731   
         DFHMDF ATTRB=(ASKIP),                                         X00732   
               POS=(17,7),                                             X00733   
               INITIAL=' ',                                            X00734   
               LENGTH=1                                                 00735   
****************************************                                00736   
*  VARIABLE = -DESCRIPTION      X025                                    00737   
****************************************                                00738   
ASTNM10  DFHMDF ATTRB=(ASKIP),                                         X00739   
               COLOR=BLUE,                                             X00740   
               LENGTH=40,                                              X00741   
               POS=(17,09)                                              00742**5
****************************************                                00743   
*  VARIABLE = DC      X002                                              00744   
****************************************                                00745   
ADC10    DFHMDF ATTRB=(ASKIP),                                         X00746   
               COLOR=BLUE,                                             X00747   
               LENGTH=2,                                               X00748   
               POS=(17,52)                                              00749**7
****************************************                                00750   
*  VARIABLE = IN-ROUTE      N009                                        00751   
****************************************                                00752   
AQTY10   DFHMDF ATTRB=(ASKIP),                                         X00753   
               JUSTIFY=(LEFT,BLANK),                                   X00754   
               COLOR=BLUE,                                             X00755   
               PICOUT='ZZZZZZZZZ',                                     X00756   
               LENGTH=9,                                               X00757   
               POS=(17,58)                                              00758**7
****************************************                                00759   
*  VARIABLE = ALLOCO      N009                                          00760   
****************************************                                00761   
AREC10   DFHMDF ATTRB=(ASKIP),                                         X00762   
               JUSTIFY=(LEFT,BLANK),                                   X00763   
               COLOR=BLUE,                                             X00764   
               PICOUT='ZZZZZZZZZ',                                     X00765   
               LENGTH=9,                                               X00766   
               POS=(17,70)                                              00767**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00768   
*                                                                       00769   
*  SCREEN LINE 18                                                       00770   
*                                                                       00771   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00772   
****************************************                                00773   
*  VARIABLE = STORE      N003                                           00774   
****************************************                                00775   
ASTR11   DFHMDF ATTRB=(ASKIP),                                         X00776   
               JUSTIFY=(LEFT,BLANK),                                   X00777   
               COLOR=BLUE,                                             X00778   
               PICOUT='9999',                                          X00779   
               LENGTH=4,                                               X00780   
               POS=(18,2)                                               00781   
         DFHMDF ATTRB=(ASKIP),                                         X00782   
               POS=(18,7),                                             X00783   
               INITIAL=' ',                                            X00784   
               LENGTH=1                                                 00785   
****************************************                                00786   
*  VARIABLE = -DESCRIPTION      X025                                    00787   
****************************************                                00788   
ASTNM11  DFHMDF ATTRB=(ASKIP),                                         X00789   
               COLOR=BLUE,                                             X00790   
               LENGTH=40,                                              X00791   
               POS=(18,09)                                              00792**5
****************************************                                00793   
*  VARIABLE = DC      X002                                              00794   
****************************************                                00795   
ADC11    DFHMDF ATTRB=(ASKIP),                                         X00796   
               COLOR=BLUE,                                             X00797   
               LENGTH=2,                                               X00798   
               POS=(18,52)                                              00799**7
****************************************                                00800   
*  VARIABLE = IN-ROUTE      N009                                        00801   
****************************************                                00802   
AQTY11   DFHMDF ATTRB=(ASKIP),                                         X00803   
               JUSTIFY=(LEFT,BLANK),                                   X00804   
               COLOR=BLUE,                                             X00805   
               PICOUT='ZZZZZZZZZ',                                     X00806   
               LENGTH=9,                                               X00807   
               POS=(18,58)                                              00808**7
****************************************                                00809   
*  VARIABLE = ALLOCO      N009                                          00810   
****************************************                                00811   
AREC11   DFHMDF ATTRB=(ASKIP),                                         X00812   
               JUSTIFY=(LEFT,BLANK),                                   X00813   
               COLOR=BLUE,                                             X00814   
               PICOUT='ZZZZZZZZZ',                                     X00815   
               LENGTH=9,                                               X00816   
               POS=(18,70)                                              00817**7
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00818   
*                                                                       00819   
*  SCREEN LINE 19                                                       00820   
*                                                                       00821   
*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*.*                                 00822   
****************************************                                00823   
*  VARIABLE = STORE      N003                                           00824   
****************************************                                00825   
ASTR12   DFHMDF ATTRB=(ASKIP),                                         X00826   
               JUSTIFY=(LEFT,BLANK),                                   X00827   
               COLOR=BLUE,                                             X00828   
               PICOUT='9999',                                          X00829   
               LENGTH=4,                                               X00830   
               POS=(19,2)                                               00831   
         DFHMDF ATTRB=(ASKIP),                                         X00832   
               POS=(19,7),                                             X00833   
               INITIAL=' ',                                            X00834   
               LENGTH=1                                                 00835   
****************************************                                00836   
*  VARIABLE = -DESCRIPTION      X025                                    00837   
****************************************                                00838   
ASTNM12  DFHMDF ATTRB=(ASKIP),                                         X00839   
               COLOR=BLUE,                                             X00840   
               LENGTH=40,                                              X00841   
               POS=(19,09)                                              00842**5
****************************************                                00843   
*  VARIABLE = DC      X002                                              00844   
****************************************                                00845   
ADC12    DFHMDF ATTRB=(ASKIP),                                         X00846   
               COLOR=BLUE,                                             X00847   
               LENGTH=2,                                               X00848   
               POS=(19,52)                                              00849**7
****************************************                                00850   
*  VARIABLE = IN-ROUTE      N009                                        00851   
****************************************                                00852   
AQTY12   DFHMDF ATTRB=(ASKIP),                                         X00853   
               JUSTIFY=(LEFT,BLANK),                                   X00854   
               COLOR=BLUE,                                             X00855   
               PICOUT='ZZZZZZZZZ',                                     X00856   
               LENGTH=9,                                               X00857   
               POS=(19,58)                                              00858**7
****************************************                                00859   
*  VARIABLE = ALLOCO      N009                                          00860   
****************************************                                00861   
AREC12   DFHMDF ATTRB=(ASKIP),                                         X00862   
               JUSTIFY=(LEFT,BLANK),                                   X00863   
               COLOR=BLUE,                                             X00864   
               PICOUT='ZZZZZZZZZ',                                     X00865   
               LENGTH=9,                                               X00866   
               POS=(19,70)                                              00867**7
         DFHMSD TYPE=FINAL                                              00868   
         END                                                            00869   
