*          DATA SET POKM080    AT LEVEL 020 AS OF 04/10/95                      
*****************************************************************       00006**5
*       MAPSET  - POKM080                                               00007**5
*       MAP     - PO080A                                                00008**5
*       PROGRAM - POKCS080                                              00009**5
*       TRANSID - W080                                                  00010**5
*****************************************************************       00011**5
  PRINT  NOGEN                                                          00012**5
*                                                                       00013**5
POKM080  DFHMSD TYPE=&&SYSPARM,                                        X00014**5
               LANG=COBOL,                                             X00015**5
               MODE=INOUT,                                             X00016**5
               STORAGE=AUTO,                                           X00017**5
               TERM=3270-2,                                            X00018**5
               TIOAPFX=YES                                              00019**5
PO080A   DFHMDI SIZE=(19,080),                                         X00020**5
               MAPATTS=(COLOR,HILIGHT),                                X00021**5
               DSATTS=(COLOR,HILIGHT),                                 X00022**5
               LINE=02,                                                X00023**5
               COLUMN=01,                                              X00024**5
               CTRL=(FREEKB)                                            00025**5
*                                                                       00052*13
         DFHMDF ATTRB=(ASKIP),                                         X00053*13
               INITIAL='DPT MCL SCL:',                                 X00054*13
               COLOR=NEUTRAL,                                          X00055*13
               LENGTH=12,                                              X00056*13
               POS=(01,2)                                               00057*13
ADECL    DFHMDF POS=(01,15),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP),                                          X00126*15
               LENGTH=9                                                 00127*15
         DFHMDF ATTRB=(ASKIP),                                         X00117   
               INITIAL='STYLE:',                                       X00118   
               COLOR=NEUTRAL,                                          X00119   
               LENGTH=6,                                               X00120   
               POS=(01,48)                                              00121   
ASTYLE   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=20,                                              X00212   
               POS=(01,55)                                              00213   
         DFHMDF ATTRB=(ASKIP),                                         X00126   
               INITIAL='SKU........:',                                 X00127   
               COLOR=NEUTRAL,                                          X00128   
               LENGTH=12,                                              X00129   
               POS=(02,02)                                              00130   
ASKU     DFHMDF ATTRB=(ASKIP),                                         X00194   
               COLOR=BLUE,                                             X00195   
               LENGTH=8,                                               X00196   
               POS=(02,15)                                              00197   
         DFHMDF ATTRB=(ASKIP),                                         X00136   
               INITIAL='COLOR:',                                       X00137   
               COLOR=NEUTRAL,                                          X00138   
               LENGTH=6,                                               X00139   
               POS=(02,48)                                              00140   
ACOLOR   DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=25,                                              X00216   
               POS=(02,55)                                              00217   
         DFHMDF ATTRB=(ASKIP),                                         X00218*13
               INITIAL='DESCRIPTION:',                                 X00219*13
               COLOR=NEUTRAL,                                          X00220*13
               LENGTH=12,                                              X00221*13
               POS=(03,2)                                               00222*13
ADESC    DFHMDF ATTRB=(ASKIP),                                         X00223*13
               COLOR=BLUE,                                             X00224*13
               LENGTH=30,                                              X00226*13
               POS=(03,15)                                              00227*13
         DFHMDF ATTRB=(ASKIP),                                         X00145   
               INITIAL='SIZE.:',                                       X00146   
               COLOR=NEUTRAL,                                          X00147   
               LENGTH=6,                                               X00148   
               POS=(03,48)                                              00149   
ASIZE    DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=25,                                              X00220   
               POS=(03,55)                                              00221   
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='ON ORDER...:',                                 X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=12,                                              X        
               POS=(04,2)                                                       
AONORD   DFHMDF ATTRB=(ASKIP),                                         X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='Z,ZZZ,ZZ9',                                     X        
               POS=(04,15)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X00218*13
               INITIAL='VENDOR:',                                      X00219*13
               COLOR=NEUTRAL,                                          X00220*13
               LENGTH=07,                                              X00221*13
               POS=(04,47)                                              00222*13
AVENDN   DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=25,                                              X00220   
               POS=(04,55)                                              00221   
         DFHMDF POS=(05,042),                                          X00026**5
               COLOR=NEUTRAL,                                          X00027**5
               ATTRB=(ASKIP,NORM),                                     X00028**5
               LENGTH=005,                                             X00029**5
               INITIAL='ITEMS'                                          00030**5
ASTRTIT  DFHMDF POS=(05,049),                                          X00031**5
               COLOR=GREEN,                                            X00032**5
               ATTRB=(UNPROT,NUM,NORM),                                X00033**5
               HILIGHT=UNDERLINE,                                      X00034**5
               LENGTH=007,                                             X00035**5
               PICOUT='ZZZ,ZZ9'                                         00036**5
         DFHMDF POS=(05,057),                                          X00037**5
               COLOR=NEUTRAL,                                          X00038**5
               ATTRB=(ASKIP,NORM),                                     X00039**5
               LENGTH=002,                                             X00040**5
               INITIAL='TO'                                             00041**5
AENDIT   DFHMDF POS=(05,061),                                          X00042**5
               COLOR=BLUE,                                             X00043**5
               ATTRB=(ASKIP,PROT),                                     X00044*10
               LENGTH=007,                                             X00045**5
               PICOUT='ZZZ,ZZ9'                                         00046**5
         DFHMDF POS=(05,069),                                          X00047**5
               COLOR=NEUTRAL,                                          X00048**5
               ATTRB=(ASKIP,NORM),                                     X00049**5
               LENGTH=002,                                             X00050**5
               INITIAL='OF'                                             00051**5
ATOTIT   DFHMDF POS=(05,072),                                          X00052**5
               COLOR=BLUE,                                             X00053**5
               ATTRB=(ASKIP,PROT),                                     X00054*10
               LENGTH=007,                                             X00055**5
               PICOUT='ZZZ,ZZ9'                                         00056**5
*                                                                       00169*12
         DFHMDF POS=(06,09),                                           X00170*12
               COLOR=NEUTRAL,                                          X00171**5
               ATTRB=(ASKIP,NORM),                                     X00172**5
               LENGTH=002,                                             X00173**5
               INITIAL='PO'                                             00174**5
         DFHMDF POS=(06,16),                                           X00170*12
               COLOR=NEUTRAL,                                          X00171**5
               ATTRB=(ASKIP,NORM),                                     X00172**5
               LENGTH=002,                                             X00173**5
               INITIAL='PO'                                             00174**5
         DFHMDF POS=(06,22),                                           X00170*12
               COLOR=NEUTRAL,                                          X00171**5
               ATTRB=(ASKIP,NORM),                                     X00172**5
               LENGTH=003,                                             X00173**5
               INITIAL='REC'                                            00174**5
         DFHMDF POS=(06,31),                                           X00175*12
               COLOR=NEUTRAL,                                          X00176**5
               ATTRB=(ASKIP,NORM),                                     X00177**5
               LENGTH=004,                                             X00178**5
               INITIAL='SHIP'                                           00179**5
         DFHMDF POS=(06,39),                                           X00180*12
               COLOR=NEUTRAL,                                          X00181**5
               ATTRB=(ASKIP,NORM),                                     X00182**5
               LENGTH=008,                                             X00183**5
               INITIAL='RECEIVED'                                       00184**5
         DFHMDF POS=(06,52),                                           X00185*12
               COLOR=NEUTRAL,                                          X00186**5
               ATTRB=(ASKIP,NORM),                                     X00187**5
               LENGTH=005,                                             X00188**5
               INITIAL='ORDER'                                          00189**5
         DFHMDF POS=(06,61),                                           X00190*12
               COLOR=NEUTRAL,                                          X00191**5
               ATTRB=(ASKIP,NORM),                                     X00192**5
               LENGTH=008,                                             X00193**5
               INITIAL='RECEIVED'                                       00194**5
         DFHMDF POS=(06,72),                                           X00195*12
               COLOR=NEUTRAL,                                          X00196**5
               ATTRB=(ASKIP,NORM),                                     X00197**5
               LENGTH=007,                                             X00198**5
               INITIAL='PERCENT'                                        00199**5
         DFHMDF POS=(07,02),                                           X00200*12
               COLOR=NEUTRAL,                                          X00201**5
               ATTRB=(ASKIP,NORM),                                     X00202**5
               LENGTH=003,                                             X00203**5
               INITIAL='SEL'                                            00204**5
         DFHMDF POS=(07,07),                                           X00205*12
               COLOR=NEUTRAL,                                          X00206**5
               ATTRB=(ASKIP,NORM),                                     X00207**5
               LENGTH=007,                                             X00208**5
               INITIAL='NUMBER'                                         00209**5
         DFHMDF POS=(07,15),                                           X00210*12
               COLOR=NEUTRAL,                                          X00211**5
               ATTRB=(ASKIP,NORM),                                     X00212**5
               LENGTH=004,                                             X00213**5
               INITIAL='LINE'                                           00214**5
         DFHMDF POS=(07,22),                                           X00210*12
               COLOR=NEUTRAL,                                          X00211**5
               ATTRB=(ASKIP,NORM),                                     X00212**5
               LENGTH=003,                                             X00213**5
               INITIAL='LOC'                                            00214**5
         DFHMDF POS=(07,31),                                           X00210*12
               COLOR=NEUTRAL,                                          X00211**5
               ATTRB=(ASKIP,NORM),                                     X00212**5
               LENGTH=004,                                             X00213**5
               INITIAL='DATE'                                           00214**5
         DFHMDF POS=(07,41),                                           X00215*12
               COLOR=NEUTRAL,                                          X00216**5
               ATTRB=(ASKIP,NORM),                                     X00217**5
               LENGTH=004,                                             X00218**5
               INITIAL='DATE'                                           00219**5
         DFHMDF POS=(07,53),                                           X00220*12
               COLOR=NEUTRAL,                                          X00221**5
               ATTRB=(ASKIP,NORM),                                     X00222**5
               LENGTH=003,                                             X00223**5
               INITIAL='QTY'                                            00224**5
         DFHMDF POS=(07,64),                                           X00220*12
               COLOR=NEUTRAL,                                          X00221**5
               ATTRB=(ASKIP,NORM),                                     X00222**5
               LENGTH=003,                                             X00223**5
               INITIAL='QTY'                                            00224**5
         DFHMDF POS=(07,72),                                           X00220*12
               COLOR=NEUTRAL,                                          X00221**5
               ATTRB=(ASKIP,NORM),                                     X00222**5
               LENGTH=008,                                             X00223**5
               INITIAL='RECEIVED'                                       00224**5
*                                                                       00225**5
ASEL01   DFHMDF POS=(08,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO01  DFHMDF POS=(08,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN01  DFHMDF POS=(08,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC01  DFHMDF POS=(08,21),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=005                                               00066**5
ASHDA01  DFHMDF POS=(08,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA01  DFHMDF POS=(08,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT01  DFHMDF POS=(08,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT01  DFHMDF POS=(08,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT01  DFHMDF POS=(08,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL02   DFHMDF POS=(09,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO02  DFHMDF POS=(09,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN02  DFHMDF POS=(09,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC02  DFHMDF POS=(09,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA02  DFHMDF POS=(09,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA02  DFHMDF POS=(09,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT02  DFHMDF POS=(09,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT02  DFHMDF POS=(09,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT02  DFHMDF POS=(09,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL03   DFHMDF POS=(10,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO03  DFHMDF POS=(10,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN03  DFHMDF POS=(10,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC03  DFHMDF POS=(10,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA03  DFHMDF POS=(10,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA03  DFHMDF POS=(10,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT03  DFHMDF POS=(10,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT03  DFHMDF POS=(10,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT03  DFHMDF POS=(10,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL04   DFHMDF POS=(11,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO04  DFHMDF POS=(11,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN04  DFHMDF POS=(11,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC04  DFHMDF POS=(11,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA04  DFHMDF POS=(11,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA04  DFHMDF POS=(11,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT04  DFHMDF POS=(11,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT04  DFHMDF POS=(11,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT04  DFHMDF POS=(11,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL05   DFHMDF POS=(12,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO05  DFHMDF POS=(12,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN05  DFHMDF POS=(12,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC05  DFHMDF POS=(12,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA05  DFHMDF POS=(12,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA05  DFHMDF POS=(12,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT05  DFHMDF POS=(12,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT05  DFHMDF POS=(12,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT05  DFHMDF POS=(12,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL06   DFHMDF POS=(13,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO06  DFHMDF POS=(13,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN06  DFHMDF POS=(13,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC06  DFHMDF POS=(13,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA06  DFHMDF POS=(13,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA06  DFHMDF POS=(13,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT06  DFHMDF POS=(13,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT06  DFHMDF POS=(13,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT06  DFHMDF POS=(13,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL07   DFHMDF POS=(14,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO07  DFHMDF POS=(14,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN07  DFHMDF POS=(14,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC07  DFHMDF POS=(14,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA07  DFHMDF POS=(14,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA07  DFHMDF POS=(14,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT07  DFHMDF POS=(14,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT07  DFHMDF POS=(14,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT07  DFHMDF POS=(14,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL08   DFHMDF POS=(15,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO08  DFHMDF POS=(15,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN08  DFHMDF POS=(15,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC08  DFHMDF POS=(15,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA08  DFHMDF POS=(15,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA08  DFHMDF POS=(15,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT08  DFHMDF POS=(15,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT08  DFHMDF POS=(15,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT08  DFHMDF POS=(15,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL09   DFHMDF POS=(16,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO09  DFHMDF POS=(16,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN09  DFHMDF POS=(16,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC09  DFHMDF POS=(16,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA09  DFHMDF POS=(16,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA09  DFHMDF POS=(16,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT09  DFHMDF POS=(16,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT09  DFHMDF POS=(16,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT09  DFHMDF POS=(16,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00225**5
ASEL10   DFHMDF POS=(17,003),                                          X00226*12
               COLOR=GREEN,                                            X00227**5
               ATTRB=(UNPROT,NORM),                                    X00228**5
               HILIGHT=UNDERLINE,                                      X00229**5
               LENGTH=001                                               00230**5
APONO10  DFHMDF POS=(17,05),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=009,                                             X00066**5
               PICOUT='ZZZZZZZZZ'                                       00067**5
APOLN10  DFHMDF POS=(17,16),                                           X00063**5
               COLOR=BLUE,                                             X00064**5
               ATTRB=(ASKIP,PROT),                                     X00065*10
               LENGTH=003,                                             X00066**5
               PICOUT='ZZZ'                                             00067**5
ADCLC10  DFHMDF POS=(17,21),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=005                                               00107*14
ASHDA10  DFHMDF POS=(17,29),                                           X00104*17
               COLOR=BLUE,                                             X00105*14
               ATTRB=(ASKIP,PROT),                                     X00106*14
               LENGTH=008                                               00107*14
AREDA10  DFHMDF POS=(17,39),                                           X00114*20
               COLOR=BLUE,                                             X00115*15
               ATTRB=(ASKIP,PROT),                                     X00116*15
               LENGTH=008                                               00117*15
AORQT10  DFHMDF POS=(17,50),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREQT10  DFHMDF POS=(17,62),                                           X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=007,                                             X00127*15
               PICOUT='ZZZ,ZZZ'                                         00097**6
AREPT10  DFHMDF POS=(17,074),                                          X00124*19
               COLOR=BLUE,                                             X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                       00745*10
         DFHMDF POS=(18,15),                                           X00746**5
               COLOR=NEUTRAL,                                          X00747**5
               ATTRB=(ASKIP,NORM),                                     X00748**5
               LENGTH=030,                                             X00749**5
               INITIAL='TOTALS FOR SELECTION LIST---->'                 00750**5
AORDTOT  DFHMDF POS=(18,47),                                           X00752**5
               COLOR=YELLOW,                                           X00753**5
               ATTRB=(ASKIP,PROT),                                     X00754**5
               LENGTH=010,                                             X00755**5
               PICOUT='ZZ,ZZZ,ZZZ'                                      00756**5
ARECTOT  DFHMDF POS=(18,59),                                           X00758**5
               COLOR=YELLOW,                                           X00759**5
               ATTRB=(ASKIP,PROT),                                     X00760**5
               LENGTH=010,                                             X00761**5
               PICOUT='ZZ,ZZZ,ZZZ'                                      00756**5
APCTTOT  DFHMDF POS=(18,074),                                          X00124*19
               COLOR=YELLOW,                                           X00125*15
               ATTRB=(ASKIP,PROT),                                     X00126*15
               LENGTH=004                                               00127*15
*                                                                               
         DFHMDF POS=(19,044),                                          X00764**5
               COLOR=NEUTRAL,                                          X00765**5
               ATTRB=(ASKIP,NORM),                                     X00766**5
               LENGTH=025,                                             X00767**5
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00768**5
ASELIT   DFHMDF POS=(19,070),                                          X00769**5
               COLOR=BLUE,                                             X00770**5
               ATTRB=(ASKIP,PROT),                                     X00771**5
               LENGTH=007,                                             X00772**5
               PICOUT='ZZZ,ZZ9'                                         00773**5
         DFHMSD TYPE=FINAL                                              00774**5
         END                                                            00775**5
