*          DATA SET POKM088                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  POKM088                                            *   00004   
*        MAP     PO088A                                             *   00005   
*        PROGRAM POKCS088                                           *   00006   
*        TRANSID W088                                               *   00007   
*        SYSTEM  CICS ARCH - PO TRACKING FOR IMPORTS                *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
POK088 DFHMSD TYPE=DSECT,                                              X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
PO088A  DFHMDI LINE=2,COLUMN=1,                                        X00017   
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
         DFHMDF ATTRB=(ASKIP),                                         X00055   
               INITIAL='PO NUMBER:',                                   X00056   
               COLOR=NEUTRAL,                                          X00057   
               LENGTH=10,                                              X00058   
               POS=(02,03)                                              00059   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00060   
               PICOUT='ZZZZZZZZ',                                      X        
               COLOR=BLUE,                                             X00061   
               LENGTH=08,                                              X00063  0
               POS=(02,14)                                              00064   
         DFHMDF ATTRB=(ASKIP),                                         X00065   
               INITIAL='VENDOR.........:',                             X00066   
               COLOR=NEUTRAL,                                          X00067   
               LENGTH=16,                                              X00068   
               POS=(02,23)                                              00069   
AVDRNAM  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=30,                                              X00082   
               POS=(02,40)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00065   
               INITIAL='DEPT.....:',                                   X00066   
               COLOR=NEUTRAL,                                          X00067   
               LENGTH=10,                                              X00068   
               POS=(03,03)                                              00069   
ADEPTNO  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=3,                                               X00082   
               POS=(03,14)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00060   
               INITIAL='START EX-FACTORY:',                            X00056   
               COLOR=NEUTRAL,                                          X00061   
               LENGTH=17,                                              X00063  0
               POS=(03,22)                                              00064   
ASTEXT   DFHMDF ATTRB=(ASKIP),                                         X00060   
               COLOR=BLUE,                                             X00061   
               LENGTH=08,                                              X00063  0
               POS=(03,40)                                              00064   
         DFHMDF ATTRB=(ASKIP),                                         X00055   
               INITIAL='SHIP DATE..:',                                 X00056   
               COLOR=NEUTRAL,                                          X00057   
               LENGTH=12,                                              X00058   
               POS=(03,50)                                              00059   
ASHIPDT  DFHMDF ATTRB=(ASKIP),                                         X00060   
               COLOR=BLUE,                                             X00061   
               LENGTH=08,                                              X00063  0
               POS=(03,63)                                              00064   
         DFHMDF ATTRB=(ASKIP),                                         X00055   
               INITIAL='OTB......:',                                   X00056   
               COLOR=NEUTRAL,                                          X00057   
               LENGTH=10,                                              X00058   
               POS=(04,3)                                               00059   
AOTBPER  DFHMDF ATTRB=(ASKIP),                                         X00060   
               COLOR=BLUE,                                             X00061   
               LENGTH=4,                                               X00063  0
               POS=(04,14)                                              00064   
         DFHMDF ATTRB=(ASKIP),                                         X00075   
               INITIAL='LAST EX-FACTORY:',                             X00076   
               COLOR=NEUTRAL,                                          X00077   
               LENGTH=16,                                              X00078   
               POS=(04,23)                                              00079   
ALASEXT  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=8,                                               X00082   
               POS=(04,40)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00065   
               INITIAL='CANCEL DATE:',                                 X00066   
               COLOR=NEUTRAL,                                          X00067   
               LENGTH=12,                                              X00068   
               POS=(04,50)                                              00069   
ACNCLDT  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=8,                                               X00082   
               POS=(04,63)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00065   
               INITIAL='FOB POINT:',                                   X00066   
               COLOR=NEUTRAL,                                          X00067   
               LENGTH=10,                                              X00068   
               POS=(05,03)                                              00069   
AFOBNME  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=30,                                              X00082   
               POS=(05,14)                                              00083   
*                                                                               
ADCNBR1  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=10,                                              X00082   
               POS=(08,33)                                              00083   
ADCNBR2  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=10,                                              X00082   
               POS=(08,45)                                              00083   
ADCNBR3  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=10,                                              X00082   
               POS=(08,57)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='FRGHT DECONSOLIDATED/LOADED.:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(09,03)                                              00083   
ADECDT1  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(09,34)                                              00083   
ADECDT2  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(09,46)                                              00083   
ADECDT3  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(09,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='ESTIMATED DC DELIVERY DATE..:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(10,03)                                              00083   
ADCDEL1  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(10,34)                                              00083   
ADCDEL2  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(10,46)                                              00083   
ADCDEL3  DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(10,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='FIRST RECEIPT DATE..........:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(11,03)                                              00083   
AFSTRCP1 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(11,34)                                              00083   
AFSTRCP2 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(11,46)                                              00083   
AFSTRCP3 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(11,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='LAST RECEIPT DATE...........:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(12,03)                                              00083   
ALSTRCP1 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(12,34)                                              00083   
ALSTRCP2 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(12,46)                                              00083   
ALSTRCP3 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(12,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='FIRST VERIFIED DATE.........:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(13,03)                                              00083   
AFSTVFD1 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(13,34)                                              00083   
AFSTVFD2 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(13,46)                                              00083   
AFSTVFD3 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(13,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='LAST VERIFIED DATE..........:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(14,03)                                              00083   
ALSTVFD1 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(14,34)                                              00083   
ALSTVFD2 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(14,46)                                              00083   
ALSTVFD3 DFHMDF ATTRB=(ASKIP),                                         X00080   
               COLOR=BLUE,                                             X00081   
               LENGTH=08,                                              X00082   
               POS=(14,58)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='UNITS ORDERED...............:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(16,03)                                              00083   
AUNORD1  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(16,34)                                              00083   
AUNORD2  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(16,46)                                              00083   
AUNORD3  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(16,58)                                              00083   
ATOTORD  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(16,70)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='UNITS VERIFIED..............:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(17,03)                                              00083   
AUNVFD1  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(17,34)                                              00083   
AUNVFD2  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(17,46)                                              00083   
AUNVFD3  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(17,58)                                              00083   
ATOTVFD  DFHMDF ATTRB=(ASKIP),                                         X00080   
               PICOUT='ZZZZZ9',                                        X00022*18
               COLOR=BLUE,                                             X00081   
               LENGTH=06,                                              X00082   
               POS=(17,70)                                              00083   
         DFHMDF ATTRB=(ASKIP),                                         X00080   
               INITIAL='% RECEIVED..................:',                X00066   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=29,                                              X00082   
               POS=(18,03)                                              00083   
ATLINE   DFHMDF ATTRB=(ASKIP),                                         X00087*18
               COLOR=BLUE,                                             X00081   
               LENGTH=40,                                              X00089*18
               POS=(18,37)                                              00090*18
*                                                                       00074   
         DFHMSD TYPE=FINAL                                              00429   
         END                                                            00430   
