  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  POKM089                                            *   00005   
*        MAP     PO089A                                             *   00006   
*        PROGRAM POKCS089                                           *   00007   
*        TRANSID W089                                               *   00008   
*        SYSTEM  CICS ARCH - PO LINE ITEM QTY SUMMARY LIST          *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
POKM089 DFHMSD TYPE=DSECT,                                             X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
PO089A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               CTRL=(FREEKB),                                          X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
*                                                                       00055   
         DFHMDF ATTRB=(ASKIP),                                         X00056   
               INITIAL='PURCHASE ORDER NUMBER:',                       X00057   
               COLOR=NEUTRAL,                                          X00058   
               LENGTH=22,                                              X00059   
               POS=(02,1)                                               00060   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00061   
               COLOR=BLUE,                                             X00062   
               PICOUT='ZZZZZZZZ',                                      X00063   
               LENGTH=8,                                               X00064   
               POS=(02,24)                                              00065   
         DFHMDF ATTRB=(ASKIP),                                         X00066   
               INITIAL='DEPARTMENT:',                                  X00067   
               COLOR=NEUTRAL,                                          X00068   
               LENGTH=11,                                              X00069   
               POS=(02,37)                                              00070   
AHDEPT   DFHMDF ATTRB=(ASKIP),                                         X00071   
               COLOR=BLUE,                                             X00072   
               LENGTH=3,                                               X00073   
               POS=(02,49)                                              00074   
*                                                                       00075   
         DFHMDF ATTRB=(ASKIP),                                         X00076   
               INITIAL='VENDOR NAME:',                                 X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=12,                                              X00079   
               POS=(03,1)                                               00080   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00081   
               COLOR=BLUE,                                             X00082   
               LENGTH=30,                                              X00083   
               POS=(03,14)                                              00084   
         DFHMDF ATTRB=(PROT),                                          X00024   
               INITIAL='ITEMS:',                                       X00025   
               COLOR=NEUTRAL,                                          X00026   
               LENGTH=6,                                               X00027   
               POS=(04,44)                                              00028   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00029   
               COLOR=GREEN,                                            X00030   
               HILIGHT=UNDERLINE,                                      X00031   
               PICOUT='ZZZ,ZZ9',                                       X00032   
               LENGTH=7,                                               X00033   
               POS=(04,51)                                              00034   
         DFHMDF ATTRB=(PROT),                                          X00035   
               INITIAL='TO',                                           X00036   
               COLOR=NEUTRAL,                                          X00037   
               LENGTH=2,                                               X00038   
               POS=(04,59)                                              00039   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZ,ZZ9',                                       X00042   
               LENGTH=7,                                               X00043   
               POS=(04,62)                                              00044   
         DFHMDF ATTRB=(PROT),                                          X00045   
               INITIAL='OF',                                           X00046   
               COLOR=NEUTRAL,                                          X00047   
               LENGTH=2,                                               X00048   
               POS=(04,70)                                              00049   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00050   
               COLOR=BLUE,                                             X00051   
               PICOUT='ZZZ,ZZ9',                                       X00052   
               LENGTH=7,                                               X00053   
               POS=(04,73)                                              00054   
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='MJ SU',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(06,08)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL='ORDER     ASN     INV   RECVD',                X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=29,                                              X00089   
               POS=(06,50)                                              00090   
         DFHMDF ATTRB=(ASKIP),                                         X00113   
               INITIAL='LINE   CL CL SKU ',                            X00114   
               COLOR=NEUTRAL,                                          X00115   
               LENGTH=17,                                              X00116   
               POS=(07,1)                                               00117   
         DFHMDF ATTRB=(ASKIP),                                         X00118   
               INITIAL='VENDOR STYLE',                                 X00119**3
               COLOR=NEUTRAL,                                          X00120   
               LENGTH=12,                                              X00121**3
               POS=(07,23)                                              00122   
         DFHMDF ATTRB=(ASKIP),                                         X00123   
               INITIAL='ST',                                           X00124**4
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=02,                                              X00126**4
               POS=(07,45)                                              00127**4
         DFHMDF ATTRB=(ASKIP),                                         X00123   
               INITIAL='QTY     QTY     QTY     QTY',                  X00124**4
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=27,                                              X00126**4
               POS=(07,52)                                              00127**4
*                                                                       00128   
ALNE1    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(08,02)                                              00141   
AMCL1    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(08,08)                                              00145**3
ACL1     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(08,11)                                              00149**3
ASKU1    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(08,14)                                              00153**3
ASTYL1   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(08,23)                                              00157   
ASTAT1   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(08,45)                                              00161**3
AORQT1   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(08,49)                                              00166**3
AASNQT1  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(08,57)                                              00171**3
AINVQT1  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(08,65)                                              00176**3
ARECQT1  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(08,73)                                              00180   
*                                                                       00469   
ALNE2    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(09,02)                                              00141   
AMCL2    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(09,08)                                              00145**3
ACL2     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(09,11)                                              00149**3
ASKU2    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(09,14)                                              00153**3
ASTYL2   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(09,23)                                              00157   
ASTAT2   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(09,45)                                              00161**3
AORQT2   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(09,49)                                              00166**3
AASNQT2  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(09,57)                                              00171**3
AINVQT2  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(09,65)                                              00176**3
ARECQT2  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(09,73)                                              00180   
*                                                                       00469   
ALNE3    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(10,02)                                              00141   
AMCL3    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(10,08)                                              00145**3
ACL3     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(10,11)                                              00149**3
ASKU3    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(10,14)                                              00153**3
ASTYL3   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(10,23)                                              00157   
ASTAT3   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(10,45)                                              00161**3
AORQT3   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(10,49)                                              00166**3
AASNQT3  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(10,57)                                              00171**3
AINVQT3  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(10,65)                                              00176**3
ARECQT3  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(10,73)                                              00180   
*                                                                       00469   
ALNE4    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(11,02)                                              00141   
AMCL4    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(11,08)                                              00145**3
ACL4     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(11,11)                                              00149**3
ASKU4    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(11,14)                                              00153**3
ASTYL4   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(11,23)                                              00157   
ASTAT4   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(11,45)                                              00161**3
AORQT4   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(11,49)                                              00166**3
AASNQT4  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(11,57)                                              00171**3
AINVQT4  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(11,65)                                              00176**3
ARECQT4  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(11,73)                                              00180   
*                                                                       00469   
ALNE5    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(12,02)                                              00141   
AMCL5    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(12,08)                                              00145**3
ACL5     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(12,11)                                              00149**3
ASKU5    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(12,14)                                              00153**3
ASTYL5   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(12,23)                                              00157   
ASTAT5   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(12,45)                                              00161**3
AORQT5   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(12,49)                                              00166**3
AASNQT5  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(12,57)                                              00171**3
AINVQT5  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(12,65)                                              00176**3
ARECQT5  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(12,73)                                              00180   
*                                                                       00469   
ALNE6    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(13,02)                                              00141   
AMCL6    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(13,08)                                              00145**3
ACL6     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(13,11)                                              00149**3
ASKU6    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(13,14)                                              00153**3
ASTYL6   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(13,23)                                              00157   
ASTAT6   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(13,45)                                              00161**3
AORQT6   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(13,49)                                              00166**3
AASNQT6  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(13,57)                                              00171**3
AINVQT6  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(13,65)                                              00176**3
ARECQT6  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(13,73)                                              00180   
*                                                                       00469   
ALNE7    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(14,02)                                              00141   
AMCL7    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(14,08)                                              00145**3
ACL7     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(14,11)                                              00149**3
ASKU7    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(14,14)                                              00153**3
ASTYL7   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(14,23)                                              00157   
ASTAT7   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(14,45)                                              00161**3
AORQT7   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(14,49)                                              00166**3
AASNQT7  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(14,57)                                              00171**3
AINVQT7  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(14,65)                                              00176**3
ARECQT7  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(14,73)                                              00180   
*                                                                       00469   
ALNE8    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(15,02)                                              00141   
AMCL8    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(15,08)                                              00145**3
ACL8     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(15,11)                                              00149**3
ASKU8    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(15,14)                                              00153**3
ASTYL8   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(15,23)                                              00157   
ASTAT8   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(15,45)                                              00161**3
AORQT8   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(15,49)                                              00166**3
AASNQT8  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(15,57)                                              00171**3
AINVQT8  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(15,65)                                              00176**3
ARECQT8  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(15,73)                                              00180   
*                                                                       00469   
ALNE9    DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(16,02)                                              00141   
AMCL9    DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(16,08)                                              00145**3
ACL9     DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(16,11)                                              00149**3
ASKU9    DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(16,14)                                              00153**3
ASTYL9   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(16,23)                                              00157   
ASTAT9   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(16,45)                                              00161**3
AORQT9   DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(16,49)                                              00166**3
AASNQT9  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(16,57)                                              00171**3
AINVQT9  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(16,65)                                              00176**3
ARECQT9  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(16,73)                                              00180   
*                                                                       00469   
ALNE10   DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(17,02)                                              00141   
AMCL10   DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(17,08)                                              00145**3
ACL10    DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(17,11)                                              00149**3
ASKU10   DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(17,14)                                              00153**3
ASTYL10  DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(17,23)                                              00157   
ASTAT10  DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(17,45)                                              00161**3
AORQT10  DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(17,49)                                              00166**3
AASNQT10 DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(17,57)                                              00171**3
AINVQT10 DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(17,65)                                              00176**3
ARECQT10 DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(17,73)                                              00180   
*                                                                       00469   
ALNE11   DFHMDF ATTRB=(ASKIP),                                         X00137   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ',                                           X00139   
               LENGTH=3,                                               X00140   
               POS=(18,02)                                              00141   
AMCL11   DFHMDF ATTRB=(ASKIP),                                         X00142   
               COLOR=BLUE,                                             X00143   
               LENGTH=2,                                               X00144   
               POS=(18,08)                                              00145**3
ACL11    DFHMDF ATTRB=(ASKIP),                                         X00146   
               COLOR=BLUE,                                             X00147   
               LENGTH=2,                                               X00148   
               POS=(18,11)                                              00149**3
ASKU11   DFHMDF ATTRB=(ASKIP),                                         X00150   
               COLOR=BLUE,                                             X00151   
               LENGTH=8,                                               X00152   
               POS=(18,14)                                              00153**3
ASTYL11  DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=20,                                              X00156   
               POS=(18,23)                                              00157   
ASTAT11  DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=2,                                               X00160   
               POS=(18,45)                                              00161**3
AORQT11  DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZZZZ',                                        X00164   
               LENGTH=6,                                               X00165   
               POS=(18,49)                                              00166**3
AASNQT11 DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZZZZ',                                        X00169   
               LENGTH=6,                                               X00170   
               POS=(18,57)                                              00171**3
AINVQT11 DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZZZ',                                        X00174   
               LENGTH=6,                                               X00175   
               POS=(18,65)                                              00176**3
ARECQT11 DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=BLUE,                                             X00178   
               LENGTH=6,                                               X00179   
               POS=(18,73)                                              00180   
         DFHMDF ATTRB=(ASKIP),                                         X00076   
               INITIAL='TOTALS:',                                      X00077   
               COLOR=NEUTRAL,                                          X00078   
               LENGTH=7,                                               X00079   
               POS=(19,39)                                              00080   
AORQTOT  DFHMDF ATTRB=(ASKIP),                                         X00162   
               COLOR=YELLOW,                                           X00163   
               PICOUT='ZZZZZZZ',                                       X00164   
               LENGTH=7,                                               X00165   
               POS=(19,48)                                              00166**3
AASNTOT  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=YELLOW,                                           X00168   
               PICOUT='ZZZZZZZ',                                       X00169   
               LENGTH=7,                                               X00170   
               POS=(19,56)                                              00171**3
AINVTOT  DFHMDF ATTRB=(ASKIP),                                         X00172   
               COLOR=YELLOW,                                           X00173   
               PICOUT='ZZZZZZZ',                                       X00174   
               LENGTH=7,                                               X00175   
               POS=(19,64)                                              00176**3
ARECTOT  DFHMDF ATTRB=(ASKIP),                                         X00177   
               COLOR=YELLOW,                                           X00178   
               PICOUT='ZZZZZZZ',                                       X00174   
               LENGTH=7,                                               X00179   
               POS=(19,72)                                              00180   
*                                                                               
         DFHMSD TYPE=FINAL                                              00470   
         END                                                            00471   
