  PRINT  NOGEN                                                          00001   
************************************************************            00002   
*                                                                       00003   
*      MAPSET :  POKM115                                                00004**2
*      MAP    :  PO115A                                                 00005   
*      PROGRAM:  POKCS115                                               00006   
*                                                                       00007   
************************************************************            00008   
POKM115  DFHMSD TYPE=MAP,                                              X00009   
               CTRL=(FREEKB),                                          X00010   
               LANG=COBOL,                                             X00011   
               MODE=INOUT,                                             X00012   
               TIOAPFX=YES                                              00013   
PO115A   DFHMDI LINE=02,                                               X00014   
               COLUMN=01,                                              X00015   
               SIZE=(19,80),                                           X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT)                                   00018   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00019   
               INITIAL='PURCHASE ORDER NUMBER....:',                   X00020   
               COLOR=NEUTRAL,                                          X00021   
               LENGTH=26,                                              X00022**2
               POS=(03,1)                                               00023   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00024   
               JUSTIFY=(LEFT,BLANK),                                   X00025   
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZZZZZ',                                      X00027**7
               LENGTH=8,                                               X00028**7
               POS=(03,28)                                              00029   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00039   
               INITIAL='VENDOR NAME..............:',                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=26,                                              X00042   
               POS=(04,1)                                               00043   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(04,28)                                              00047   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00030   
               INITIAL='DEPARTMENT...............:',                   X00031   
               COLOR=NEUTRAL,                                          X00032   
               LENGTH=26,                                              X00033   
               POS=(05,01)                                              00034   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00035   
               COLOR=BLUE,                                             X00036   
               LENGTH=3,                                               X00037   
               POS=(05,28)                                              00038   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='PAYMENT TERM ID..........:',                   X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=26,                                              X00051   
               POS=(07,1)                                               00052   
ATERMID  DFHMDF ATTRB=(PROT),                                          X00053   
               COLOR=BLUE,                                             X00054   
               PICOUT='ZZZZ',                                          X00312   
               LENGTH=04,                                              X00056   
               POS=(07,28)                                              00057   
ATERMDE  DFHMDF ATTRB=(ASKIP),                                         X00337   
               COLOR=BLUE,                                             X00338   
               LENGTH=28,                                              X00339   
               POS=(07,34)                                              00340   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='MARK OUT OF STOCK PERCENT:',                   X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=26,                                              X00051   
               POS=(10,1)                                               00052   
AMOSPCT  DFHMDF ATTRB=(ASKIP),                                         X00337   
               COLOR=BLUE,                                             X00338   
               PICOUT='Z9.99',                                         X00377   
               LENGTH=5,                                               X00379   
               POS=(10,30)                                              00340   
         DFHMDF ATTRB=(ASKIP),                                         X00381   
               INITIAL='%',                                            X00382   
               COLOR=NEUTRAL,                                          X00383   
               LENGTH=1,                                               X00384   
               POS=(10,36)                                              00385   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='TRADE DISC PERCENT.......:',                   X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=26,                                              X00051   
               POS=(11,1)                                               00052   
ATRDPCT  DFHMDF ATTRB=(PROT),                                          X00053   
               COLOR=BLUE,                                             X00054   
               PICOUT='Z9.99',                                         X00377   
               LENGTH=5,                                               X00379   
               POS=(11,30)                                              00057   
         DFHMDF ATTRB=(ASKIP),                                         X00381   
               INITIAL='%',                                            X00382   
               COLOR=NEUTRAL,                                          X00383   
               LENGTH=1,                                               X00384   
               POS=(11,36)                                              00385   
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='NEW STORE VENDOR DISCOUNTS:',                  X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=27,                                              X00051   
               POS=(14,1)                                               00052   
         DFHMDF ATTRB=(ASKIP),                                         X00048   
               INITIAL='ADDITIONAL VENDOR DISCOUNTS:',                 X00049   
               COLOR=NEUTRAL,                                          X00050   
               LENGTH=28,                                              X00051   
               POS=(14,42)                                              00052   
*                                                                               
         DFHMDF ATTRB=(PROT),                                          X00370   
               INITIAL='PERCENT..................:',                   X00371   
               COLOR=NEUTRAL,                                          X00372   
               LENGTH=26,                                              X00373   
               POS=(16,2)                                               00374   
AVDSCPE  DFHMDF ATTRB=(PROT),                                          X00375   
               COLOR=BLUE,                                             X00376   
               PICOUT='Z9.99',                                         X00377   
               LENGTH=5,                                               X00379   
               POS=(16,29)                                              00380   
         DFHMDF ATTRB=(ASKIP),                                         X00381   
               INITIAL='%',                                            X00382   
               COLOR=NEUTRAL,                                          X00383   
               LENGTH=1,                                               X00384   
               POS=(16,37)                                              00385   
         DFHMDF ATTRB=(PROT),                                          X00341   
               INITIAL='DOLLAR AMOUNT........:',                       X00342   
               COLOR=NEUTRAL,                                          X00343   
               LENGTH=22,                                              X00344   
               POS=(16,43)                                              00345   
AADSCDO  DFHMDF ATTRB=(PROT),                                          X00346   
               COLOR=BLUE,                                             X00347   
               PICOUT='ZZZZZZ.99',                                     X00348   
               LENGTH=9,                                               X00350   
               POS=(16,66)                                              00351   
*                                                                               
         DFHMDF ATTRB=(PROT),                                          X00356   
               INITIAL='EXTENDED PAY DAYS QTY....:',                   X00357   
               COLOR=NEUTRAL,                                          X00358   
               LENGTH=26,                                              X00359   
               POS=(17,2)                                               00360   
AVEXDAY  DFHMDF ATTRB=(PROT),                                          X00361   
               COLOR=BLUE,                                             X00362   
               PICOUT='ZZZ',                                           X00363   
               LENGTH=3,                                               X00365   
               POS=(17,29)                                              00366   
         DFHMDF ATTRB=(PROT),                                          X00370   
               INITIAL='PERCENT..............:',                       X00371   
               COLOR=NEUTRAL,                                          X00372   
               LENGTH=22,                                              X00373   
               POS=(17,43)                                              00374   
AADSCPE  DFHMDF ATTRB=(PROT),                                          X00375   
               COLOR=BLUE,                                             X00376   
               PICOUT='Z9.99',                                         X00377   
               LENGTH=5,                                               X00379   
               POS=(17,66)                                              00380   
         DFHMDF ATTRB=(ASKIP),                                         X00381   
               INITIAL='%',                                            X00382   
               COLOR=NEUTRAL,                                          X00383   
               LENGTH=1,                                               X00384   
               POS=(17,74)                                              00385   
*                                                                               
         DFHMDF ATTRB=(PROT),                                          X00356   
               INITIAL='EXTENDED PAY DAYS QTY:',                       X00357   
               COLOR=NEUTRAL,                                          X00358   
               LENGTH=22,                                              X00359   
               POS=(18,43)                                              00360   
AAEXDAY  DFHMDF ATTRB=(PROT),                                          X00361   
               COLOR=BLUE,                                             X00362   
               PICOUT='ZZZ',                                           X00363   
               LENGTH=3,                                               X00365   
               POS=(18,66)                                              00366   
*                                                                               
AMSG     DFHMDF ATTRB=(ASKIP),                                         X00438   
               COLOR=YELLOW,                                           X00439   
               LENGTH=79,                                              X00440   
               POS=(19,1)                                               00441   
*                                                                       00442   
         DFHMSD TYPE=FINAL                                              00190   
         END                                                            00191   
