*          DATA SET POKM068    AT LEVEL 001 AS OF 12/05/95                      
*          DATA SET POKM068    AT LEVEL 010 AS OF 03/21/95              00001   
*          DATA SET POKM068    AT LEVEL 016 AS OF 02/20/95              00002   
  PRINT  NOGEN                                                          00003   
*********************************************************************** 00004   
*                                                                       00005   
*        MAPSET  : POKM068                                              00006   
*        MAP     : PO068A                                               00007   
*        PROGRAM : POKCS068                                             00008   
*        TRANSID : W068 - ASN DATA TRANSMISSION INQUIRY                 00009   
*        SYSTEM  : CICS ARCHITECTURE                                    00010   
*                                                                       00011   
*********************************************************************** 00012   
POKM068  DFHMSD TYPE=MAP,                                              X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               TIOAPFX=YES,                                            X00016   
               CTRL=(FREEKB)                                            00017   
PO068A   DFHMDI LINE=02,                                               X00018   
               COLUMN=01,                                              X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
         DFHMDF ATTRB=(PROT),                                          X00023   
               INITIAL='ITEMS:',                                       X00024   
               COLOR=NEUTRAL,                                          X00025   
               LENGTH=6,                                               X00026   
               POS=(01,44)                                              00027   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00028   
               COLOR=GREEN,                                            X00029   
               HILIGHT=UNDERLINE,                                      X00030   
               PICOUT='ZZZ,ZZ9',                                       X00031   
               LENGTH=7,                                               X00032   
               POS=(01,51)                                              00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='TO',                                           X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=2,                                               X00037   
               POS=(01,59)                                              00038   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00039   
               COLOR=BLUE,                                             X00040   
               PICOUT='ZZZ,ZZ9',                                       X00041   
               LENGTH=7,                                               X00042   
               POS=(01,62)                                              00043   
         DFHMDF ATTRB=(PROT),                                          X00044   
               INITIAL='OF',                                           X00045   
               COLOR=NEUTRAL,                                          X00046   
               LENGTH=2,                                               X00047   
               POS=(01,70)                                              00048   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00049   
               COLOR=BLUE,                                             X00050   
               PICOUT='ZZZ,ZZ9',                                       X00051   
               LENGTH=7,                                               X00052   
               POS=(01,73)                                              00053   
         DFHMDF ATTRB=(ASKIP),                                         X00054   
               INITIAL='PO NO:',                                       X00055   
               COLOR=NEUTRAL,                                          X00056   
               LENGTH=6,                                               X00057   
               POS=(02,02)                                              00058   
APONMBR  DFHMDF ATTRB=(ASKIP),                                         X00059   
               COLOR=BLUE,                                             X00060   
               PICOUT='ZZZZZZZZ',                                      X00039   
               LENGTH=08,                                              X00061   
               POS=(02,09)                                              00062   
         DFHMDF ATTRB=(ASKIP),                                         X00063   
               INITIAL='VENDOR NAME:',                                 X00064   
               COLOR=NEUTRAL,                                          X00065   
               LENGTH=12,                                              X00066   
               POS=(02,20)                                              00067   
AVDRNAM  DFHMDF ATTRB=(ASKIP),                                         X00068   
               COLOR=BLUE,                                             X00069   
               LENGTH=30,                                              X00070   
               POS=(02,33)                                              00071   
         DFHMDF ATTRB=(ASKIP),                                         X00072   
               INITIAL='NETWORK:',                                     X00073   
               COLOR=NEUTRAL,                                          X00074   
               LENGTH=08,                                              X00075   
               POS=(02,66)                                              00076   
ANETWRK  DFHMDF ATTRB=(ASKIP),                                         X00077   
               COLOR=BLUE,                                             X00078   
               LENGTH=5,                                               X00079   
               POS=(02,75)                                              00080   
         DFHMDF ATTRB=(ASKIP),                                         X00081   
               INITIAL='   VAN RCPT   ',                               X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=14,                                              X00084   
               POS=(03,02)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00081   
               INITIAL='     PICK UP  ',                               X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=14,                                              X00084   
               POS=(03,17)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00081   
               INITIAL='  DATE  ',                                     X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=8,                                               X00084   
               POS=(04,02)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00081   
               INITIAL='TIME ',                                        X00082   
               COLOR=NEUTRAL,                                          X00083   
               LENGTH=5,                                               X00084   
               POS=(04,11)                                              00085   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL='  DATE  ',                                     X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=8,                                               X00089   
               POS=(04,17)                                              00090   
         DFHMDF ATTRB=(ASKIP),                                         X00086   
               INITIAL='TIME ',                                        X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=5,                                               X00089   
               POS=(04,26)                                              00090   
         DFHMDF ATTRB=(ASKIP),                                         X00091   
               INITIAL='BILL OF LADING',                               X00092   
               COLOR=NEUTRAL,                                          X00093   
               LENGTH=14,                                              X00094   
               POS=(04,32)                                              00095   
         DFHMDF ATTRB=(ASKIP),                                         X00096   
               INITIAL='UNITS',                                        X00097   
               COLOR=NEUTRAL,                                          X00098   
               LENGTH=5,                                               X00099   
               POS=(04,62)                                              00100   
         DFHMDF ATTRB=(ASKIP),                                         X00101   
               INITIAL='CRTNS',                                        X00102   
               COLOR=NEUTRAL,                                          X00103   
               LENGTH=05,                                              X00104   
               POS=(04,69)                                              00105   
         DFHMDF ATTRB=(ASKIP),                                         X00106   
               INITIAL='FCLTY',                                        X00107   
               COLOR=NEUTRAL,                                          X00108   
               LENGTH=05,                                              X00109   
               POS=(04,75)                                              00110   
ADATE01  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(05,02)                                              00114   
ATMRC01  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=05,                                              X00113   
               POS=(05,11)                                              00114   
APUDT01  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(05,17)                                              00114   
ATIME01  DFHMDF ATTRB=(ASKIP),                                         X00115   
               COLOR=BLUE,                                             X00116   
               LENGTH=05,                                              X00117   
               POS=(05,26)                                              00118   
ABOL01   DFHMDF ATTRB=(ASKIP),                                         X00119   
               COLOR=BLUE,                                             X00120   
               LENGTH=27,                                              X00121   
               POS=(05,32)                                              00122   
AUNIT01  DFHMDF ATTRB=(ASKIP),                                         X00123   
               COLOR=BLUE,                                             X00124   
               LENGTH=07,                                              X00125   
               POS=(05,60)                                              00126   
ACRTN01  DFHMDF ATTRB=(ASKIP),                                         X00127   
               COLOR=BLUE,                                             X00128   
               LENGTH=06,                                              X00129   
               POS=(05,68)                                              00130   
AFCTY01  DFHMDF ATTRB=(ASKIP),                                         X00131   
               COLOR=BLUE,                                             X00132   
               LENGTH=05,                                              X00133   
               POS=(05,75)                                              00134   
APROT01  DFHMDF ATTRB=(ASKIP),                                         X00135   
               COLOR=NEUTRAL,                                          X00136   
               LENGTH=04,                                              X00137   
               POS=(06,07)                                              00138   
APRON01  DFHMDF ATTRB=(ASKIP),                                         X00139   
               COLOR=BLUE,                                             X00140   
               LENGTH=30,                                              X00141   
               POS=(06,12)                                              00142   
AASNT01  DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=NEUTRAL,                                          X00144   
               LENGTH=04,                                              X00145   
               POS=(06,45)                                              00146   
AASN01   DFHMDF ATTRB=(ASKIP),                                         X00147   
               COLOR=BLUE,                                             X00148   
               LENGTH=30,                                              X00149   
               POS=(06,50)                                              00150   
ADATE02  DFHMDF ATTRB=(ASKIP),                                         X00151   
               COLOR=BLUE,                                             X00152   
               LENGTH=08,                                              X00153   
               POS=(07,02)                                              00154   
ATMRC02  DFHMDF ATTRB=(ASKIP),                                         X00151   
               COLOR=BLUE,                                             X00152   
               LENGTH=05,                                              X00153   
               POS=(07,11)                                              00154   
APUDT02  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(07,17)                                              00114   
ATIME02  DFHMDF ATTRB=(ASKIP),                                         X00155   
               COLOR=BLUE,                                             X00156   
               LENGTH=05,                                              X00157   
               POS=(07,26)                                              00158   
ABOL02   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=27,                                              X00161   
               POS=(07,32)                                              00162   
AUNIT02  DFHMDF ATTRB=(ASKIP),                                         X00163   
               COLOR=BLUE,                                             X00164   
               LENGTH=07,                                              X00165   
               POS=(07,60)                                              00166   
ACRTN02  DFHMDF ATTRB=(ASKIP),                                         X00167   
               COLOR=BLUE,                                             X00168   
               LENGTH=06,                                              X00169   
               POS=(07,68)                                              00170   
AFCTY02  DFHMDF ATTRB=(ASKIP),                                         X00171   
               COLOR=BLUE,                                             X00172   
               LENGTH=05,                                              X00173   
               POS=(07,75)                                              00174   
APROT02  DFHMDF ATTRB=(ASKIP),                                         X00175   
               COLOR=NEUTRAL,                                          X00176   
               LENGTH=04,                                              X00177   
               POS=(08,07)                                              00178   
APRON02  DFHMDF ATTRB=(ASKIP),                                         X00179   
               COLOR=BLUE,                                             X00180   
               LENGTH=30,                                              X00181   
               POS=(08,12)                                              00182   
AASNT02  DFHMDF ATTRB=(ASKIP),                                         X00183   
               INITIAL='ASN:',                                         X00184   
               COLOR=NEUTRAL,                                          X00185   
               LENGTH=04,                                              X00186   
               POS=(08,45)                                              00187   
AASN02   DFHMDF ATTRB=(ASKIP),                                         X00188   
               COLOR=BLUE,                                             X00189   
               LENGTH=30,                                              X00190   
               POS=(08,50)                                              00191   
ADATE03  DFHMDF ATTRB=(ASKIP),                                         X00192   
               COLOR=BLUE,                                             X00193   
               LENGTH=08,                                              X00194   
               POS=(09,02)                                              00195   
ATMRC03  DFHMDF ATTRB=(ASKIP),                                         X00192   
               COLOR=BLUE,                                             X00193   
               LENGTH=05,                                              X00194   
               POS=(09,11)                                              00195   
APUDT03  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(09,17)                                              00114   
ATIME03  DFHMDF ATTRB=(ASKIP),                                         X00196   
               COLOR=BLUE,                                             X00197   
               LENGTH=05,                                              X00198   
               POS=(09,26)                                              00199   
ABOL03   DFHMDF ATTRB=(ASKIP),                                         X00200   
               COLOR=BLUE,                                             X00201   
               LENGTH=27,                                              X00202   
               POS=(09,32)                                              00203   
AUNIT03  DFHMDF ATTRB=(ASKIP),                                         X00204   
               COLOR=BLUE,                                             X00205   
               LENGTH=07,                                              X00206   
               POS=(09,60)                                              00207   
ACRTN03  DFHMDF ATTRB=(ASKIP),                                         X00208   
               COLOR=BLUE,                                             X00209   
               LENGTH=06,                                              X00210   
               POS=(09,68)                                              00211   
AFCTY03  DFHMDF ATTRB=(ASKIP),                                         X00212   
               COLOR=BLUE,                                             X00213   
               LENGTH=05,                                              X00214   
               POS=(09,75)                                              00215   
APROT03  DFHMDF ATTRB=(ASKIP),                                         X00216   
               COLOR=NEUTRAL,                                          X00217   
               LENGTH=04,                                              X00218   
               POS=(10,07)                                              00219   
APRON03  DFHMDF ATTRB=(ASKIP),                                         X00220   
               COLOR=BLUE,                                             X00221   
               LENGTH=30,                                              X00222   
               POS=(10,12)                                              00223   
AASNT03  DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=NEUTRAL,                                          X00225   
               LENGTH=04,                                              X00226   
               POS=(10,45)                                              00227   
AASN03   DFHMDF ATTRB=(ASKIP),                                         X00228   
               COLOR=BLUE,                                             X00229   
               LENGTH=30,                                              X00230   
               POS=(10,50)                                              00231   
ADATE04  DFHMDF ATTRB=(ASKIP),                                         X00232   
               COLOR=BLUE,                                             X00233   
               LENGTH=08,                                              X00234   
               POS=(11,02)                                              00235   
ATMRC04  DFHMDF ATTRB=(ASKIP),                                         X00232   
               COLOR=BLUE,                                             X00233   
               LENGTH=05,                                              X00234   
               POS=(11,11)                                              00235   
APUDT04  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(11,17)                                              00114   
ATIME04  DFHMDF ATTRB=(ASKIP),                                         X00236   
               COLOR=BLUE,                                             X00237   
               LENGTH=05,                                              X00238   
               POS=(11,26)                                              00239   
ABOL04   DFHMDF ATTRB=(ASKIP),                                         X00240   
               COLOR=BLUE,                                             X00241   
               LENGTH=27,                                              X00242   
               POS=(11,32)                                              00243   
AUNIT04  DFHMDF ATTRB=(ASKIP),                                         X00244   
               COLOR=BLUE,                                             X00245   
               LENGTH=07,                                              X00246   
               POS=(11,60)                                              00247   
ACRTN04  DFHMDF ATTRB=(ASKIP),                                         X00248   
               COLOR=BLUE,                                             X00249   
               LENGTH=06,                                              X00250   
               POS=(11,68)                                              00251   
AFCTY04  DFHMDF ATTRB=(ASKIP),                                         X00252   
               COLOR=BLUE,                                             X00253   
               LENGTH=05,                                              X00254   
               POS=(11,75)                                              00255   
APROT04  DFHMDF ATTRB=(ASKIP),                                         X00256   
               COLOR=NEUTRAL,                                          X00257   
               LENGTH=04,                                              X00258   
               POS=(12,07)                                              00259   
APRON04  DFHMDF ATTRB=(ASKIP),                                         X00260   
               COLOR=BLUE,                                             X00261   
               LENGTH=30,                                              X00262   
               POS=(12,12)                                              00263   
AASNT04  DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=NEUTRAL,                                          X00265   
               LENGTH=04,                                              X00266   
               POS=(12,45)                                              00267   
AASN04   DFHMDF ATTRB=(ASKIP),                                         X00268   
               COLOR=BLUE,                                             X00269   
               LENGTH=30,                                              X00270   
               POS=(12,50)                                              00271   
ADATE05  DFHMDF ATTRB=(ASKIP),                                         X00272   
               COLOR=BLUE,                                             X00273   
               LENGTH=08,                                              X00274   
               POS=(13,02)                                              00275   
ATMRC05  DFHMDF ATTRB=(ASKIP),                                         X00272   
               COLOR=BLUE,                                             X00273   
               LENGTH=05,                                              X00274   
               POS=(13,11)                                              00275   
APUDT05  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(13,17)                                              00114   
ATIME05  DFHMDF ATTRB=(ASKIP),                                         X00276   
               COLOR=BLUE,                                             X00277   
               LENGTH=05,                                              X00278   
               POS=(13,26)                                              00279   
ABOL05   DFHMDF ATTRB=(ASKIP),                                         X00280   
               COLOR=BLUE,                                             X00281   
               LENGTH=27,                                              X00282   
               POS=(13,32)                                              00283   
AUNIT05  DFHMDF ATTRB=(ASKIP),                                         X00284   
               COLOR=BLUE,                                             X00285   
               LENGTH=07,                                              X00286   
               POS=(13,60)                                              00287   
ACRTN05  DFHMDF ATTRB=(ASKIP),                                         X00288   
               COLOR=BLUE,                                             X00289   
               LENGTH=06,                                              X00290   
               POS=(13,68)                                              00291   
AFCTY05  DFHMDF ATTRB=(ASKIP),                                         X00292   
               COLOR=BLUE,                                             X00293   
               LENGTH=05,                                              X00294   
               POS=(13,75)                                              00295   
APROT05  DFHMDF ATTRB=(ASKIP),                                         X00296   
               COLOR=NEUTRAL,                                          X00297   
               LENGTH=04,                                              X00298   
               POS=(14,07)                                              00299   
APRON05  DFHMDF ATTRB=(ASKIP),                                         X00300   
               COLOR=BLUE,                                             X00301   
               LENGTH=30,                                              X00302   
               POS=(14,12)                                              00303   
AASNT05  DFHMDF ATTRB=(ASKIP),                                         X00304   
               COLOR=NEUTRAL,                                          X00305   
               LENGTH=04,                                              X00306   
               POS=(14,45)                                              00307   
AASN05   DFHMDF ATTRB=(ASKIP),                                         X00308   
               COLOR=BLUE,                                             X00309   
               LENGTH=30,                                              X00310   
               POS=(14,50)                                              00311   
ADATE06  DFHMDF ATTRB=(ASKIP),                                         X00312   
               COLOR=BLUE,                                             X00313   
               LENGTH=08,                                              X00314   
               POS=(15,02)                                              00315   
ATMRC06  DFHMDF ATTRB=(ASKIP),                                         X00312   
               COLOR=BLUE,                                             X00313   
               LENGTH=05,                                              X00314   
               POS=(15,11)                                              00315   
APUDT06  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(15,17)                                              00114   
ATIME06  DFHMDF ATTRB=(ASKIP),                                         X00316   
               COLOR=BLUE,                                             X00317   
               LENGTH=05,                                              X00318   
               POS=(15,26)                                              00319   
ABOL06   DFHMDF ATTRB=(ASKIP),                                         X00320   
               COLOR=BLUE,                                             X00321   
               LENGTH=27,                                              X00322   
               POS=(15,32)                                              00323   
AUNIT06  DFHMDF ATTRB=(ASKIP),                                         X00324   
               COLOR=BLUE,                                             X00325   
               LENGTH=07,                                              X00326   
               POS=(15,60)                                              00327   
ACRTN06  DFHMDF ATTRB=(ASKIP),                                         X00328   
               COLOR=BLUE,                                             X00329   
               LENGTH=06,                                              X00330   
               POS=(15,68)                                              00331   
AFCTY06  DFHMDF ATTRB=(ASKIP),                                         X00332   
               COLOR=BLUE,                                             X00333   
               LENGTH=05,                                              X00334   
               POS=(15,75)                                              00335   
APROT06  DFHMDF ATTRB=(ASKIP),                                         X00336   
               COLOR=NEUTRAL,                                          X00337   
               LENGTH=04,                                              X00338   
               POS=(16,07)                                              00339   
APRON06  DFHMDF ATTRB=(ASKIP),                                         X00340   
               COLOR=BLUE,                                             X00341   
               LENGTH=30,                                              X00342   
               POS=(16,12)                                              00343   
AASNT06  DFHMDF ATTRB=(ASKIP),                                         X00344   
               COLOR=NEUTRAL,                                          X00345   
               LENGTH=04,                                              X00346   
               POS=(16,45)                                              00347   
AASN06   DFHMDF ATTRB=(ASKIP),                                         X00348   
               COLOR=BLUE,                                             X00349   
               LENGTH=30,                                              X00350   
               POS=(16,50)                                              00351   
ADATE07  DFHMDF ATTRB=(ASKIP),                                         X00352   
               COLOR=BLUE,                                             X00353   
               LENGTH=08,                                              X00354   
               POS=(17,02)                                              00355   
ATMRC07  DFHMDF ATTRB=(ASKIP),                                         X00352   
               COLOR=BLUE,                                             X00353   
               LENGTH=05,                                              X00354   
               POS=(17,11)                                              00355   
APUDT07  DFHMDF ATTRB=(ASKIP),                                         X00111   
               COLOR=BLUE,                                             X00112   
               LENGTH=08,                                              X00113   
               POS=(17,17)                                              00114   
ATIME07  DFHMDF ATTRB=(ASKIP),                                         X00356   
               COLOR=BLUE,                                             X00357   
               LENGTH=05,                                              X00358   
               POS=(17,26)                                              00359   
ABOL07   DFHMDF ATTRB=(ASKIP),                                         X00360   
               COLOR=BLUE,                                             X00361   
               LENGTH=27,                                              X00362   
               POS=(17,32)                                              00363   
AUNIT07  DFHMDF ATTRB=(ASKIP),                                         X00364   
               COLOR=BLUE,                                             X00365   
               LENGTH=07,                                              X00366   
               POS=(17,60)                                              00367   
ACRTN07  DFHMDF ATTRB=(ASKIP),                                         X00368   
               COLOR=BLUE,                                             X00369   
               LENGTH=06,                                              X00370   
               POS=(17,68)                                              00371   
AFCTY07  DFHMDF ATTRB=(ASKIP),                                         X00372   
               COLOR=BLUE,                                             X00373   
               LENGTH=05,                                              X00374   
               POS=(17,75)                                              00375   
APROT07  DFHMDF ATTRB=(ASKIP),                                         X00376   
               COLOR=NEUTRAL,                                          X00377   
               LENGTH=04,                                              X00378   
               POS=(18,07)                                              00379   
APRON07  DFHMDF ATTRB=(ASKIP),                                         X00380   
               COLOR=BLUE,                                             X00381   
               LENGTH=30,                                              X00382   
               POS=(18,12)                                              00383   
AASNT07  DFHMDF ATTRB=(ASKIP),                                         X00384   
               COLOR=NEUTRAL,                                          X00385   
               LENGTH=04,                                              X00386   
               POS=(18,45)                                              00387   
AASN07   DFHMDF ATTRB=(ASKIP),                                         X00388   
               COLOR=BLUE,                                             X00389   
               LENGTH=30,                                              X00390   
               POS=(18,50)                                              00391   
         DFHMSD TYPE=FINAL                                              00392   
         END                                                            00393   
