*          DATA SET POKM036    AT LEVEL 007 AS OF 05/26/94                      
*          DATA SET POKM036    AT LEVEL 001 AS OF 04/27/94              00001   
*          DATA SET POKM036    AT LEVEL 006 AS OF 02/11/94              00002   
  PRINT  NOGEN                                                          00003   
************************************************************            00004   
*  BMS MAPSET :  POKM036                                                00005   
*      MAP    :  PO036A                                                 00006   
************************************************************            00007   
POKM036  DFHMSD TYPE=&SYSPARM,                                         X00008   
               CTRL=(FREEKB),                                          X00009   
               TERM=3270-2,                                            X00010   
               EXTATT=YES,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               STORAGE=AUTO                                             00015   
PO036A   DFHMDI LINE=02,                                               X00016   
               COLUMN=01,                                              X00017   
               SIZE=(19,80),                                           X00018   
               JUSTIFY=FIRST                                            00019   
         DFHMDF ATTRB=(ASKIP),                                         X00020   
               INITIAL='ITEMS:',                                       X00021   
               COLOR=NEUTRAL,                                          X00022   
               LENGTH=6,                                               X00023   
               POS=(01,41)                                              00024   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM,IC),                                 X00025   
               JUSTIFY=(LEFT,BLANK),                                   X00026   
               COLOR=GREEN,                                            X00027   
               HILIGHT=UNDERLINE,                                      X00028   
               PICOUT='ZZZ,ZZ9',                                       X00029   
               LENGTH=7,                                               X00030   
               POS=(01,48)                                              00031   
         DFHMDF ATTRB=(ASKIP),                                         X00032   
               INITIAL='TO:',                                          X00033   
               COLOR=NEUTRAL,                                          X00034   
               LENGTH=3,                                               X00035   
               POS=(01,56)                                              00036   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00037   
               JUSTIFY=(LEFT,BLANK),                                   X00038   
               COLOR=BLUE,                                             X00039   
               PICOUT='ZZZ,ZZ9',                                       X00040   
               LENGTH=7,                                               X00041   
               POS=(01,60)                                              00042   
         DFHMDF ATTRB=(ASKIP),                                         X00043   
               INITIAL='OF:',                                          X00044   
               COLOR=NEUTRAL,                                          X00045   
               LENGTH=3,                                               X00046   
               POS=(01,68)                                              00047   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00048   
               JUSTIFY=(LEFT,BLANK),                                   X00049   
               COLOR=BLUE,                                             X00050   
               PICOUT='ZZZ,ZZ9',                                       X00051   
               LENGTH=7,                                               X00052   
               POS=(01,72)                                              00053   
         DFHMDF ATTRB=(ASKIP),                                         X00054   
               INITIAL='PURCHASE',                                     X00055   
               COLOR=NEUTRAL,                                          X00056   
               LENGTH=8,                                               X00057   
               POS=(02,1)                                               00058   
         DFHMDF ATTRB=(ASKIP),                                         X00059   
               INITIAL='ORDER',                                        X00060   
               COLOR=NEUTRAL,                                          X00061   
               LENGTH=5,                                               X00062   
               POS=(02,10)                                              00063   
         DFHMDF ATTRB=(ASKIP),                                         X00064   
               INITIAL='NUMBER:',                                      X00065   
               COLOR=NEUTRAL,                                          X00066   
               LENGTH=7,                                               X00067   
               POS=(02,16)                                              00068   
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00069   
               JUSTIFY=(LEFT,BLANK),                                   X00070   
               COLOR=BLUE,                                             X00071   
               PICOUT='ZZZZZZZZ',                                      X00072   
               LENGTH=8,                                               X00073   
               POS=(02,24)                                              00074   
         DFHMDF ATTRB=(ASKIP),                                         X00075   
               POS=(02,33),                                            X00076   
               INITIAL=' ',                                            X00077   
               LENGTH=1                                                 00078   
         DFHMDF ATTRB=(ASKIP),                                         X00079   
               INITIAL='DEPARTMENT:',                                  X00080   
               COLOR=NEUTRAL,                                          X00081   
               LENGTH=11,                                              X00082   
               POS=(02,41)                                              00083   
ADEPT    DFHMDF ATTRB=(ASKIP),                                         X00084   
               COLOR=BLUE,                                             X00085   
               LENGTH=3,                                               X00086   
               POS=(02,53)                                              00087   
         DFHMDF ATTRB=(ASKIP),                                         X00088   
               INITIAL='VENDOR',                                       X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=6,                                               X00091   
               POS=(03,1)                                               00092   
         DFHMDF ATTRB=(ASKIP),                                         X00093   
               INITIAL='NAME:',                                        X00094   
               COLOR=NEUTRAL,                                          X00095   
               LENGTH=5,                                               X00096   
               POS=(03,8)                                               00097   
AVENDNM  DFHMDF ATTRB=(ASKIP),                                         X00098   
               COLOR=BLUE,                                             X00099   
               LENGTH=30,                                              X00100   
               POS=(03,14)                                              00101   
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='MJ SU',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(04,07)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X00102   
               INITIAL='LINE',                                         X00103   
               COLOR=NEUTRAL,                                          X00104   
               LENGTH=4,                                               X00105   
               POS=(05,1)                                               00106   
         DFHMDF ATTRB=(ASKIP),                                         X00107   
               INITIAL='CL CL SKU',                                    X00108   
               COLOR=NEUTRAL,                                          X00109   
               LENGTH=9,                                               X00110   
               POS=(05,7)                                               00111   
         DFHMDF ATTRB=(ASKIP),                                         X00112   
               INITIAL='/',                                            X00113   
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=1,                                               X00115   
               POS=(05,17)                                              00116   
         DFHMDF ATTRB=(ASKIP),                                         X00117   
               INITIAL='STYLE',                                        X00118   
               COLOR=NEUTRAL,                                          X00119   
               LENGTH=5,                                               X00120   
               POS=(05,19)                                              00121   
         DFHMDF ATTRB=(ASKIP),                                         X00122   
               POS=(05,25),                                            X00123   
               INITIAL=' ',                                            X00124   
               LENGTH=1                                                 00125   
         DFHMDF ATTRB=(ASKIP),                                         X00126   
               INITIAL='DESCRIPTION',                                  X00127   
               COLOR=NEUTRAL,                                          X00128   
               LENGTH=11,                                              X00129   
               POS=(05,28)                                              00130   
         DFHMDF ATTRB=(ASKIP),                                         X00131   
               INITIAL='/',                                            X00132   
               COLOR=NEUTRAL,                                          X00133   
               LENGTH=1,                                               X00134   
               POS=(05,40)                                              00135   
         DFHMDF ATTRB=(ASKIP),                                         X00136   
               INITIAL='COLOR',                                        X00137   
               COLOR=NEUTRAL,                                          X00138   
               LENGTH=5,                                               X00139   
               POS=(05,42)                                              00140   
         DFHMDF ATTRB=(ASKIP),                                         X00141   
               POS=(05,48),                                            X00142   
               INITIAL=' ',                                            X00143   
               LENGTH=1                                                 00144   
         DFHMDF ATTRB=(ASKIP),                                         X00145   
               INITIAL='SIZE',                                         X00146   
               COLOR=NEUTRAL,                                          X00147   
               LENGTH=4,                                               X00148   
               POS=(05,54)                                              00149   
         DFHMDF ATTRB=(ASKIP),                                         X00150   
               POS=(05,59),                                            X00151   
               INITIAL=' ',                                            X00152   
               LENGTH=1                                                 00153   
         DFHMDF ATTRB=(ASKIP),                                         X00154   
               INITIAL='ITEM',                                         X00155   
               COLOR=NEUTRAL,                                          X00156   
               LENGTH=4,                                               X00157   
               POS=(05,61)                                              00158   
         DFHMDF ATTRB=(ASKIP),                                         X00159   
               INITIAL='QTY',                                          X00160   
               COLOR=NEUTRAL,                                          X00161   
               LENGTH=3,                                               X00162   
               POS=(05,66)                                              00163   
         DFHMDF ATTRB=(ASKIP),                                         X00164   
               INITIAL='RCVD',                                         X00165**3
               COLOR=NEUTRAL,                                          X00166   
               LENGTH=4,                                               X00167   
               POS=(05,71)                                              00168   
         DFHMDF ATTRB=(ASKIP),                                         X00169   
               INITIAL='QTY',                                          X00170   
               COLOR=NEUTRAL,                                          X00171   
               LENGTH=3,                                               X00172   
               POS=(05,76)                                              00173   
ALINE    DFHMDF ATTRB=(ASKIP),                                         X00174   
               JUSTIFY=(LEFT,BLANK),                                   X00175   
               COLOR=BLUE,                                             X00176   
               PICOUT='ZZ9',                                           X00177   
               LENGTH=3,                                               X00178   
               POS=(06,1)                                               00179   
AMJCL   DFHMDF ATTRB=(ASKIP),                                          X00180   
               COLOR=BLUE,                                             X00181   
               LENGTH=2,                                               X00182   
               POS=(06,7)                                               00183   
ASUCL    DFHMDF ATTRB=(ASKIP),                                         X00184   
               JUSTIFY=(LEFT,BLANK),                                   X00185   
               COLOR=BLUE,                                             X00186   
               LENGTH=2,                                               X00187   
               POS=(06,10)                                              00188   
ASKU     DFHMDF ATTRB=(ASKIP),                                         X00189   
               JUSTIFY=(LEFT,BLANK),                                   X00190   
               COLOR=BLUE,                                             X00191   
               LENGTH=8,                                               X00192   
               POS=(06,13)                                              00193   
ADESC    DFHMDF ATTRB=(ASKIP),                                         X00194   
               COLOR=BLUE,                                             X00195   
               LENGTH=20,                                              X00196   
               POS=(06,28)                                              00197   
AQUAN    DFHMDF ATTRB=(ASKIP),                                         X00198   
               JUSTIFY=(LEFT,BLANK),                                   X00199   
               COLOR=BLUE,                                             X00200   
               PICOUT='ZZZ,ZZZ',                                       X00201   
               LENGTH=7,                                               X00202   
               POS=(06,62)                                              00203   
ASHPQTY  DFHMDF ATTRB=(ASKIP),                                         X00204   
               JUSTIFY=(LEFT,BLANK),                                   X00205   
               COLOR=BLUE,                                             X00206   
               PICOUT='ZZZ,ZZZ',                                       X00207   
               LENGTH=7,                                               X00208   
               POS=(06,72)                                              00209   
ASTYLE   DFHMDF ATTRB=(ASKIP),                                         X00210   
               COLOR=BLUE,                                             X00211   
               LENGTH=20,                                              X00212   
               POS=(07,7)                                               00213   
ACOL     DFHMDF ATTRB=(ASKIP),                                         X00214   
               COLOR=BLUE,                                             X00215   
               LENGTH=25,                                              X00216   
               POS=(07,28)                                              00217   
ASIZE    DFHMDF ATTRB=(ASKIP),                                         X00218   
               COLOR=BLUE,                                             X00219   
               LENGTH=25,                                              X00220   
               POS=(07,54)                                              00221   
         DFHMDF ATTRB=(PROT),                                          X00222   
               INITIAL='CURRENT TOTAL',                                X00223   
               COLOR=NEUTRAL,                                          X00224   
               LENGTH=13,                                              X00225**2
               POS=(08,15)                                              00226**3
AYEAR1   DFHMDF ATTRB=(ASKIP),                                         X00227**4
               COLOR=NEUTRAL,                                          X00228**4
               LENGTH=4,                                               X00229**4
               POS=(08,31)                                              00230**5
AYEAR2   DFHMDF ATTRB=(ASKIP),                                         X00231**4
               COLOR=NEUTRAL,                                          X00232**4
               LENGTH=4,                                               X00233**4
               POS=(08,38)                                              00234**5
AYEAR3   DFHMDF ATTRB=(ASKIP),                                         X00235**4
               COLOR=NEUTRAL,                                          X00236**4
               LENGTH=4,                                               X00237**4
               POS=(08,45)                                              00238**5
AYEAR4   DFHMDF ATTRB=(ASKIP),                                         X00239**4
               COLOR=NEUTRAL,                                          X00240**4
               LENGTH=4,                                               X00241**4
               POS=(08,52)                                              00242**5
AYEAR5   DFHMDF ATTRB=(ASKIP),                                         X00243**4
               COLOR=NEUTRAL,                                          X00244**4
               LENGTH=4,                                               X00245**4
               POS=(08,59)                                              00246**5
AYEAR6   DFHMDF ATTRB=(ASKIP),                                         X00247**4
               COLOR=NEUTRAL,                                          X00248**4
               LENGTH=4,                                               X00249**4
               POS=(08,66)                                              00250**5
         DFHMDF ATTRB=(ASKIP),                                         X00251   
               INITIAL=' STR NAME  DC  ALLOC  RECVD',                  X00252**3
               COLOR=NEUTRAL,                                          X00253   
               LENGTH=27,                                              X00254**3
               POS=(09,1)                                               00255   
ADAT1    DFHMDF ATTRB=(ASKIP),                                         X00256   
               COLOR=NEUTRAL,                                          X00257   
               LENGTH=5,                                               X00258   
               POS=(09,31)                                              00259   
ADAT2    DFHMDF ATTRB=(ASKIP),                                         X00260   
               COLOR=NEUTRAL,                                          X00261   
               LENGTH=5,                                               X00262   
               POS=(09,38)                                              00263   
ADAT3    DFHMDF ATTRB=(ASKIP),                                         X00264   
               COLOR=NEUTRAL,                                          X00265   
               LENGTH=5,                                               X00266   
               POS=(09,45)                                              00267   
ADAT4    DFHMDF ATTRB=(ASKIP),                                         X00268   
               COLOR=NEUTRAL,                                          X00269   
               LENGTH=5,                                               X00270   
               POS=(09,52)                                              00271   
ADAT5    DFHMDF ATTRB=(ASKIP),                                         X00272   
               COLOR=NEUTRAL,                                          X00273   
               LENGTH=5,                                               X00274   
               POS=(09,59)                                              00275   
ADAT6    DFHMDF ATTRB=(ASKIP),                                         X00276   
               COLOR=NEUTRAL,                                          X00277   
               LENGTH=5,                                               X00278   
               POS=(09,66)                                              00279   
ADAT7    DFHMDF ATTRB=(ASKIP),                                         X00280**6
               COLOR=NEUTRAL,                                          X00281**6
               LENGTH=5,                                               X00282**6
               POS=(09,73)                                              00283**7
ASTR1    DFHMDF ATTRB=(ASKIP),                                         X00284   
               JUSTIFY=(LEFT,BLANK),                                   X00285   
               COLOR=BLUE,                                             X00286   
               PICOUT='ZZZZ',                                          X00287   
               LENGTH=4,                                               X00288   
               POS=(10,1)                                               00289   
ASTRNM1  DFHMDF ATTRB=(ASKIP),                                         X00290   
               COLOR=BLUE,                                             X00291   
               LENGTH=5,                                               X00292   
               POS=(10,6)                                               00293   
ADC1     DFHMDF ATTRB=(ASKIP),                                         X00294   
               COLOR=BLUE,                                             X00295   
               LENGTH=2,                                               X00296   
               POS=(10,12)                                              00297   
ACRAL1   DFHMDF ATTRB=(ASKIP),                                         X00298   
               JUSTIFY=(LEFT,BLANK),                                   X00299   
               COLOR=BLUE,                                             X00300   
               PICOUT='999999',                                        X00301   
               LENGTH=6,                                               X00302   
               POS=(10,15)                                              00303   
ARECVD1  DFHMDF ATTRB=(ASKIP),                                         X00304   
               JUSTIFY=(LEFT,BLANK),                                   X00305   
               COLOR=BLUE,                                             X00306   
               PICOUT='999999',                                        X00307   
               LENGTH=6,                                               X00308   
               POS=(10,22)                                              00309   
AREC11   DFHMDF ATTRB=(ASKIP),                                         X00310   
               JUSTIFY=(LEFT,BLANK),                                   X00311   
               COLOR=BLUE,                                             X00312   
               PICOUT='999999',                                        X00313   
               LENGTH=6,                                               X00314   
               POS=(10,30)                                              00315   
AREC12   DFHMDF ATTRB=(ASKIP),                                         X00316   
               JUSTIFY=(LEFT,BLANK),                                   X00317   
               COLOR=BLUE,                                             X00318   
               PICOUT='ZZZZZZ',                                        X00319   
               LENGTH=6,                                               X00320   
               POS=(10,37)                                              00321   
AREC13   DFHMDF ATTRB=(ASKIP),                                         X00322   
               JUSTIFY=(LEFT,BLANK),                                   X00323   
               COLOR=BLUE,                                             X00324   
               PICOUT='ZZZZZZ',                                        X00325   
               LENGTH=6,                                               X00326   
               POS=(10,44)                                              00327   
AREC14   DFHMDF ATTRB=(ASKIP),                                         X00328   
               JUSTIFY=(LEFT,BLANK),                                   X00329   
               COLOR=BLUE,                                             X00330   
               PICOUT='ZZZZZZ',                                        X00331   
               LENGTH=6,                                               X00332   
               POS=(10,51)                                              00333   
AREC15   DFHMDF ATTRB=(ASKIP),                                         X00334   
               JUSTIFY=(LEFT,BLANK),                                   X00335   
               COLOR=BLUE,                                             X00336   
               PICOUT='ZZZZZZ',                                        X00337   
               LENGTH=6,                                               X00338   
               POS=(10,58)                                              00339   
AREC16   DFHMDF ATTRB=(ASKIP),                                         X00340   
               JUSTIFY=(LEFT,BLANK),                                   X00341   
               COLOR=BLUE,                                             X00342   
               PICOUT='ZZZZZZ',                                        X00343   
               LENGTH=6,                                               X00344   
               POS=(10,65)                                              00345   
AREC1O   DFHMDF ATTRB=(ASKIP),                                         X00346   
               JUSTIFY=(LEFT,BLANK),                                   X00347   
               COLOR=BLUE,                                             X00348   
               PICOUT='ZZZZZZ',                                        X00349   
               LENGTH=6,                                               X00350   
               POS=(10,72)                                              00351   
ASTR2    DFHMDF ATTRB=(ASKIP),                                         X00352   
               JUSTIFY=(LEFT,BLANK),                                   X00353   
               COLOR=BLUE,                                             X00354   
               PICOUT='ZZZZ',                                          X00355   
               LENGTH=4,                                               X00356   
               POS=(11,1)                                               00357   
ASTRNM2  DFHMDF ATTRB=(ASKIP),                                         X00358   
               COLOR=BLUE,                                             X00359   
               LENGTH=5,                                               X00360   
               POS=(11,6)                                               00361   
ADC2     DFHMDF ATTRB=(ASKIP),                                         X00362   
               COLOR=BLUE,                                             X00363   
               LENGTH=2,                                               X00364   
               POS=(11,12)                                              00365   
ACRAL2   DFHMDF ATTRB=(ASKIP),                                         X00366   
               JUSTIFY=(LEFT,BLANK),                                   X00367   
               COLOR=BLUE,                                             X00368   
               PICOUT='999999',                                        X00369   
               LENGTH=6,                                               X00370   
               POS=(11,15)                                              00371   
ARECVD2  DFHMDF ATTRB=(ASKIP),                                         X00372   
               JUSTIFY=(LEFT,BLANK),                                   X00373   
               COLOR=BLUE,                                             X00374   
               PICOUT='999999',                                        X00375   
               LENGTH=6,                                               X00376   
               POS=(11,22)                                              00377   
AREC21   DFHMDF ATTRB=(ASKIP),                                         X00378   
               JUSTIFY=(LEFT,BLANK),                                   X00379   
               COLOR=BLUE,                                             X00380   
               PICOUT='999999',                                        X00381   
               LENGTH=6,                                               X00382   
               POS=(11,30)                                              00383   
AREC22   DFHMDF ATTRB=(ASKIP),                                         X00384   
               JUSTIFY=(LEFT,BLANK),                                   X00385   
               COLOR=BLUE,                                             X00386   
               PICOUT='ZZZZZZ',                                        X00387   
               LENGTH=6,                                               X00388   
               POS=(11,37)                                              00389   
AREC23   DFHMDF ATTRB=(ASKIP),                                         X00390   
               JUSTIFY=(LEFT,BLANK),                                   X00391   
               COLOR=BLUE,                                             X00392   
               PICOUT='ZZZZZZ',                                        X00393   
               LENGTH=6,                                               X00394   
               POS=(11,44)                                              00395   
AREC24   DFHMDF ATTRB=(ASKIP),                                         X00396   
               JUSTIFY=(LEFT,BLANK),                                   X00397   
               COLOR=BLUE,                                             X00398   
               PICOUT='ZZZZZZ',                                        X00399   
               LENGTH=6,                                               X00400   
               POS=(11,51)                                              00401   
AREC25   DFHMDF ATTRB=(ASKIP),                                         X00402   
               JUSTIFY=(LEFT,BLANK),                                   X00403   
               COLOR=BLUE,                                             X00404   
               PICOUT='ZZZZZZ',                                        X00405   
               LENGTH=6,                                               X00406   
               POS=(11,58)                                              00407   
AREC26   DFHMDF ATTRB=(ASKIP),                                         X00408   
               JUSTIFY=(LEFT,BLANK),                                   X00409   
               COLOR=BLUE,                                             X00410   
               PICOUT='ZZZZZZ',                                        X00411   
               LENGTH=6,                                               X00412   
               POS=(11,65)                                              00413   
AREC2O   DFHMDF ATTRB=(ASKIP),                                         X00414   
               JUSTIFY=(LEFT,BLANK),                                   X00415   
               COLOR=BLUE,                                             X00416   
               PICOUT='ZZZZZZ',                                        X00417   
               LENGTH=6,                                               X00418   
               POS=(11,72)                                              00419   
ASTR3    DFHMDF ATTRB=(ASKIP),                                         X00420   
               JUSTIFY=(LEFT,BLANK),                                   X00421   
               COLOR=BLUE,                                             X00422   
               PICOUT='ZZZZ',                                          X00423   
               LENGTH=4,                                               X00424   
               POS=(12,1)                                               00425   
ASTRNM3  DFHMDF ATTRB=(ASKIP),                                         X00426   
               COLOR=BLUE,                                             X00427   
               LENGTH=5,                                               X00428   
               POS=(12,6)                                               00429   
ADC3     DFHMDF ATTRB=(ASKIP),                                         X00430   
               COLOR=BLUE,                                             X00431   
               LENGTH=2,                                               X00432   
               POS=(12,12)                                              00433   
ACRAL3   DFHMDF ATTRB=(ASKIP),                                         X00434   
               JUSTIFY=(LEFT,BLANK),                                   X00435   
               COLOR=BLUE,                                             X00436   
               PICOUT='999999',                                        X00437   
               LENGTH=6,                                               X00438   
               POS=(12,15)                                              00439   
ARECVD3  DFHMDF ATTRB=(ASKIP),                                         X00440   
               JUSTIFY=(LEFT,BLANK),                                   X00441   
               COLOR=BLUE,                                             X00442   
               PICOUT='999999',                                        X00443   
               LENGTH=6,                                               X00444   
               POS=(12,22)                                              00445   
AREC31   DFHMDF ATTRB=(ASKIP),                                         X00446   
               JUSTIFY=(LEFT,BLANK),                                   X00447   
               COLOR=BLUE,                                             X00448   
               PICOUT='999999',                                        X00449   
               LENGTH=6,                                               X00450   
               POS=(12,30)                                              00451   
AREC32   DFHMDF ATTRB=(ASKIP),                                         X00452   
               JUSTIFY=(LEFT,BLANK),                                   X00453   
               COLOR=BLUE,                                             X00454   
               PICOUT='ZZZZZZ',                                        X00455   
               LENGTH=6,                                               X00456   
               POS=(12,37)                                              00457   
AREC33   DFHMDF ATTRB=(ASKIP),                                         X00458   
               JUSTIFY=(LEFT,BLANK),                                   X00459   
               COLOR=BLUE,                                             X00460   
               PICOUT='ZZZZZZ',                                        X00461   
               LENGTH=6,                                               X00462   
               POS=(12,44)                                              00463   
AREC34   DFHMDF ATTRB=(ASKIP),                                         X00464   
               JUSTIFY=(LEFT,BLANK),                                   X00465   
               COLOR=BLUE,                                             X00466   
               PICOUT='ZZZZZZ',                                        X00467   
               LENGTH=6,                                               X00468   
               POS=(12,51)                                              00469   
AREC35   DFHMDF ATTRB=(ASKIP),                                         X00470   
               JUSTIFY=(LEFT,BLANK),                                   X00471   
               COLOR=BLUE,                                             X00472   
               PICOUT='ZZZZZZ',                                        X00473   
               LENGTH=6,                                               X00474   
               POS=(12,58)                                              00475   
AREC36   DFHMDF ATTRB=(ASKIP),                                         X00476   
               JUSTIFY=(LEFT,BLANK),                                   X00477   
               COLOR=BLUE,                                             X00478   
               PICOUT='ZZZZZZ',                                        X00479   
               LENGTH=6,                                               X00480   
               POS=(12,65)                                              00481   
AREC3O   DFHMDF ATTRB=(ASKIP),                                         X00482   
               JUSTIFY=(LEFT,BLANK),                                   X00483   
               COLOR=BLUE,                                             X00484   
               PICOUT='ZZZZZZ',                                        X00485   
               LENGTH=6,                                               X00486   
               POS=(12,72)                                              00487   
ASTR4    DFHMDF ATTRB=(ASKIP),                                         X00488   
               JUSTIFY=(LEFT,BLANK),                                   X00489   
               COLOR=BLUE,                                             X00490   
               PICOUT='ZZZZ',                                          X00491   
               LENGTH=4,                                               X00492   
               POS=(13,1)                                               00493   
ASTRNM4  DFHMDF ATTRB=(ASKIP),                                         X00494   
               COLOR=BLUE,                                             X00495   
               LENGTH=5,                                               X00496   
               POS=(13,6)                                               00497   
ADC4     DFHMDF ATTRB=(ASKIP),                                         X00498   
               COLOR=BLUE,                                             X00499   
               LENGTH=2,                                               X00500   
               POS=(13,12)                                              00501   
ACRAL4   DFHMDF ATTRB=(ASKIP),                                         X00502   
               JUSTIFY=(LEFT,BLANK),                                   X00503   
               COLOR=BLUE,                                             X00504   
               PICOUT='999999',                                        X00505   
               LENGTH=6,                                               X00506   
               POS=(13,15)                                              00507   
ARECVD4  DFHMDF ATTRB=(ASKIP),                                         X00508   
               JUSTIFY=(LEFT,BLANK),                                   X00509   
               COLOR=BLUE,                                             X00510   
               PICOUT='999999',                                        X00511   
               LENGTH=6,                                               X00512   
               POS=(13,22)                                              00513   
AREC41   DFHMDF ATTRB=(ASKIP),                                         X00514   
               JUSTIFY=(LEFT,BLANK),                                   X00515   
               COLOR=BLUE,                                             X00516   
               PICOUT='999999',                                        X00517   
               LENGTH=6,                                               X00518   
               POS=(13,30)                                              00519   
AREC42   DFHMDF ATTRB=(ASKIP),                                         X00520   
               JUSTIFY=(LEFT,BLANK),                                   X00521   
               COLOR=BLUE,                                             X00522   
               PICOUT='ZZZZZZ',                                        X00523   
               LENGTH=6,                                               X00524   
               POS=(13,37)                                              00525   
AREC43   DFHMDF ATTRB=(ASKIP),                                         X00526   
               JUSTIFY=(LEFT,BLANK),                                   X00527   
               COLOR=BLUE,                                             X00528   
               PICOUT='ZZZZZZ',                                        X00529   
               LENGTH=6,                                               X00530   
               POS=(13,44)                                              00531   
AREC44   DFHMDF ATTRB=(ASKIP),                                         X00532   
               JUSTIFY=(LEFT,BLANK),                                   X00533   
               COLOR=BLUE,                                             X00534   
               PICOUT='ZZZZZZ',                                        X00535   
               LENGTH=6,                                               X00536   
               POS=(13,51)                                              00537   
AREC45   DFHMDF ATTRB=(ASKIP),                                         X00538   
               JUSTIFY=(LEFT,BLANK),                                   X00539   
               COLOR=BLUE,                                             X00540   
               PICOUT='ZZZZZZ',                                        X00541   
               LENGTH=6,                                               X00542   
               POS=(13,58)                                              00543   
AREC46   DFHMDF ATTRB=(ASKIP),                                         X00544   
               JUSTIFY=(LEFT,BLANK),                                   X00545   
               COLOR=BLUE,                                             X00546   
               PICOUT='ZZZZZZ',                                        X00547   
               LENGTH=6,                                               X00548   
               POS=(13,65)                                              00549   
AREC4O   DFHMDF ATTRB=(ASKIP),                                         X00550   
               JUSTIFY=(LEFT,BLANK),                                   X00551   
               COLOR=BLUE,                                             X00552   
               PICOUT='ZZZZZZ',                                        X00553   
               LENGTH=6,                                               X00554   
               POS=(13,72)                                              00555   
ASTR5    DFHMDF ATTRB=(ASKIP),                                         X00556   
               JUSTIFY=(LEFT,BLANK),                                   X00557   
               COLOR=BLUE,                                             X00558   
               PICOUT='ZZZZ',                                          X00559   
               LENGTH=4,                                               X00560   
               POS=(14,1)                                               00561   
ASTRNM5  DFHMDF ATTRB=(ASKIP),                                         X00562   
               COLOR=BLUE,                                             X00563   
               LENGTH=5,                                               X00564   
               POS=(14,6)                                               00565   
ADC5     DFHMDF ATTRB=(ASKIP),                                         X00566   
               COLOR=BLUE,                                             X00567   
               LENGTH=2,                                               X00568   
               POS=(14,12)                                              00569   
ACRAL5   DFHMDF ATTRB=(ASKIP),                                         X00570   
               JUSTIFY=(LEFT,BLANK),                                   X00571   
               COLOR=BLUE,                                             X00572   
               PICOUT='999999',                                        X00573   
               LENGTH=6,                                               X00574   
               POS=(14,15)                                              00575   
ARECVD5  DFHMDF ATTRB=(ASKIP),                                         X00576   
               JUSTIFY=(LEFT,BLANK),                                   X00577   
               COLOR=BLUE,                                             X00578   
               PICOUT='999999',                                        X00579   
               LENGTH=6,                                               X00580   
               POS=(14,22)                                              00581   
AREC51   DFHMDF ATTRB=(ASKIP),                                         X00582   
               JUSTIFY=(LEFT,BLANK),                                   X00583   
               COLOR=BLUE,                                             X00584   
               PICOUT='999999',                                        X00585   
               LENGTH=6,                                               X00586   
               POS=(14,30)                                              00587   
AREC52   DFHMDF ATTRB=(ASKIP),                                         X00588   
               JUSTIFY=(LEFT,BLANK),                                   X00589   
               COLOR=BLUE,                                             X00590   
               PICOUT='ZZZZZZ',                                        X00591   
               LENGTH=6,                                               X00592   
               POS=(14,37)                                              00593   
AREC53   DFHMDF ATTRB=(ASKIP),                                         X00594   
               JUSTIFY=(LEFT,BLANK),                                   X00595   
               COLOR=BLUE,                                             X00596   
               PICOUT='ZZZZZZ',                                        X00597   
               LENGTH=6,                                               X00598   
               POS=(14,44)                                              00599   
AREC54   DFHMDF ATTRB=(ASKIP),                                         X00600   
               JUSTIFY=(LEFT,BLANK),                                   X00601   
               COLOR=BLUE,                                             X00602   
               PICOUT='ZZZZZZ',                                        X00603   
               LENGTH=6,                                               X00604   
               POS=(14,51)                                              00605   
AREC55   DFHMDF ATTRB=(ASKIP),                                         X00606   
               JUSTIFY=(LEFT,BLANK),                                   X00607   
               COLOR=BLUE,                                             X00608   
               PICOUT='ZZZZZZ',                                        X00609   
               LENGTH=6,                                               X00610   
               POS=(14,58)                                              00611   
AREC56   DFHMDF ATTRB=(ASKIP),                                         X00612   
               JUSTIFY=(LEFT,BLANK),                                   X00613   
               COLOR=BLUE,                                             X00614   
               PICOUT='ZZZZZZ',                                        X00615   
               LENGTH=6,                                               X00616   
               POS=(14,65)                                              00617   
AREC5O   DFHMDF ATTRB=(ASKIP),                                         X00618   
               JUSTIFY=(LEFT,BLANK),                                   X00619   
               COLOR=BLUE,                                             X00620   
               PICOUT='ZZZZZZ',                                        X00621   
               LENGTH=6,                                               X00622   
               POS=(14,72)                                              00623   
ASTR6    DFHMDF ATTRB=(ASKIP),                                         X00624   
               JUSTIFY=(LEFT,BLANK),                                   X00625   
               COLOR=BLUE,                                             X00626   
               PICOUT='ZZZZ',                                          X00627   
               LENGTH=4,                                               X00628   
               POS=(15,1)                                               00629   
ASTRNM6  DFHMDF ATTRB=(ASKIP),                                         X00630   
               COLOR=BLUE,                                             X00631   
               LENGTH=5,                                               X00632   
               POS=(15,6)                                               00633   
ADC6     DFHMDF ATTRB=(ASKIP),                                         X00634   
               COLOR=BLUE,                                             X00635   
               LENGTH=2,                                               X00636   
               POS=(15,12)                                              00637   
ACRAL6   DFHMDF ATTRB=(ASKIP),                                         X00638   
               JUSTIFY=(LEFT,BLANK),                                   X00639   
               COLOR=BLUE,                                             X00640   
               PICOUT='999999',                                        X00641   
               LENGTH=6,                                               X00642   
               POS=(15,15)                                              00643   
ARECVD6  DFHMDF ATTRB=(ASKIP),                                         X00644   
               JUSTIFY=(LEFT,BLANK),                                   X00645   
               COLOR=BLUE,                                             X00646   
               PICOUT='999999',                                        X00647   
               LENGTH=6,                                               X00648   
               POS=(15,22)                                              00649   
AREC61   DFHMDF ATTRB=(ASKIP),                                         X00650   
               JUSTIFY=(LEFT,BLANK),                                   X00651   
               COLOR=BLUE,                                             X00652   
               PICOUT='999999',                                        X00653   
               LENGTH=6,                                               X00654   
               POS=(15,30)                                              00655   
AREC62   DFHMDF ATTRB=(ASKIP),                                         X00656   
               JUSTIFY=(LEFT,BLANK),                                   X00657   
               COLOR=BLUE,                                             X00658   
               PICOUT='ZZZZZZ',                                        X00659   
               LENGTH=6,                                               X00660   
               POS=(15,37)                                              00661   
AREC63   DFHMDF ATTRB=(ASKIP),                                         X00662   
               JUSTIFY=(LEFT,BLANK),                                   X00663   
               COLOR=BLUE,                                             X00664   
               PICOUT='ZZZZZZ',                                        X00665   
               LENGTH=6,                                               X00666   
               POS=(15,44)                                              00667   
AREC64   DFHMDF ATTRB=(ASKIP),                                         X00668   
               JUSTIFY=(LEFT,BLANK),                                   X00669   
               COLOR=BLUE,                                             X00670   
               PICOUT='ZZZZZZ',                                        X00671   
               LENGTH=6,                                               X00672   
               POS=(15,51)                                              00673   
AREC65   DFHMDF ATTRB=(ASKIP),                                         X00674   
               JUSTIFY=(LEFT,BLANK),                                   X00675   
               COLOR=BLUE,                                             X00676   
               PICOUT='ZZZZZZ',                                        X00677   
               LENGTH=6,                                               X00678   
               POS=(15,58)                                              00679   
AREC66   DFHMDF ATTRB=(ASKIP),                                         X00680   
               JUSTIFY=(LEFT,BLANK),                                   X00681   
               COLOR=BLUE,                                             X00682   
               PICOUT='ZZZZZZ',                                        X00683   
               LENGTH=6,                                               X00684   
               POS=(15,65)                                              00685   
AREC6O   DFHMDF ATTRB=(ASKIP),                                         X00686   
               JUSTIFY=(LEFT,BLANK),                                   X00687   
               COLOR=BLUE,                                             X00688   
               PICOUT='ZZZZZZ',                                        X00689   
               LENGTH=6,                                               X00690   
               POS=(15,72)                                              00691   
ASTR7    DFHMDF ATTRB=(ASKIP),                                         X00692   
               JUSTIFY=(LEFT,BLANK),                                   X00693   
               COLOR=BLUE,                                             X00694   
               PICOUT='ZZZZ',                                          X00695   
               LENGTH=4,                                               X00696   
               POS=(16,1)                                               00697   
ASTRNM7  DFHMDF ATTRB=(ASKIP),                                         X00698   
               COLOR=BLUE,                                             X00699   
               LENGTH=5,                                               X00700   
               POS=(16,6)                                               00701   
ADC7     DFHMDF ATTRB=(ASKIP),                                         X00702   
               COLOR=BLUE,                                             X00703   
               LENGTH=2,                                               X00704   
               POS=(16,12)                                              00705   
ACRAL7   DFHMDF ATTRB=(ASKIP),                                         X00706   
               JUSTIFY=(LEFT,BLANK),                                   X00707   
               COLOR=BLUE,                                             X00708   
               PICOUT='999999',                                        X00709   
               LENGTH=6,                                               X00710   
               POS=(16,15)                                              00711   
ARECVD7  DFHMDF ATTRB=(ASKIP),                                         X00712   
               JUSTIFY=(LEFT,BLANK),                                   X00713   
               COLOR=BLUE,                                             X00714   
               PICOUT='999999',                                        X00715   
               LENGTH=6,                                               X00716   
               POS=(16,22)                                              00717   
AREC71   DFHMDF ATTRB=(ASKIP),                                         X00718   
               JUSTIFY=(LEFT,BLANK),                                   X00719   
               COLOR=BLUE,                                             X00720   
               PICOUT='999999',                                        X00721   
               LENGTH=6,                                               X00722   
               POS=(16,30)                                              00723   
AREC72   DFHMDF ATTRB=(ASKIP),                                         X00724   
               JUSTIFY=(LEFT,BLANK),                                   X00725   
               COLOR=BLUE,                                             X00726   
               PICOUT='ZZZZZZ',                                        X00727   
               LENGTH=6,                                               X00728   
               POS=(16,37)                                              00729   
AREC73   DFHMDF ATTRB=(ASKIP),                                         X00730   
               JUSTIFY=(LEFT,BLANK),                                   X00731   
               COLOR=BLUE,                                             X00732   
               PICOUT='ZZZZZZ',                                        X00733   
               LENGTH=6,                                               X00734   
               POS=(16,44)                                              00735   
AREC74   DFHMDF ATTRB=(ASKIP),                                         X00736   
               JUSTIFY=(LEFT,BLANK),                                   X00737   
               COLOR=BLUE,                                             X00738   
               PICOUT='ZZZZZZ',                                        X00739   
               LENGTH=6,                                               X00740   
               POS=(16,51)                                              00741   
AREC75   DFHMDF ATTRB=(ASKIP),                                         X00742   
               JUSTIFY=(LEFT,BLANK),                                   X00743   
               COLOR=BLUE,                                             X00744   
               PICOUT='ZZZZZZ',                                        X00745   
               LENGTH=6,                                               X00746   
               POS=(16,58)                                              00747   
AREC76   DFHMDF ATTRB=(ASKIP),                                         X00748   
               JUSTIFY=(LEFT,BLANK),                                   X00749   
               COLOR=BLUE,                                             X00750   
               PICOUT='ZZZZZZ',                                        X00751   
               LENGTH=6,                                               X00752   
               POS=(16,65)                                              00753   
AREC7O   DFHMDF ATTRB=(ASKIP),                                         X00754   
               JUSTIFY=(LEFT,BLANK),                                   X00755   
               COLOR=BLUE,                                             X00756   
               PICOUT='ZZZZZZ',                                        X00757   
               LENGTH=6,                                               X00758   
               POS=(16,72)                                              00759   
ASTR8    DFHMDF ATTRB=(ASKIP),                                         X00760   
               JUSTIFY=(LEFT,BLANK),                                   X00761   
               COLOR=BLUE,                                             X00762   
               PICOUT='ZZZZ',                                          X00763   
               LENGTH=4,                                               X00764   
               POS=(17,1)                                               00765   
ASTRNM8  DFHMDF ATTRB=(ASKIP),                                         X00766   
               COLOR=BLUE,                                             X00767   
               LENGTH=5,                                               X00768   
               POS=(17,6)                                               00769   
ADC8     DFHMDF ATTRB=(ASKIP),                                         X00770   
               COLOR=BLUE,                                             X00771   
               LENGTH=2,                                               X00772   
               POS=(17,12)                                              00773   
ACRAL8   DFHMDF ATTRB=(ASKIP),                                         X00774   
               JUSTIFY=(LEFT,BLANK),                                   X00775   
               COLOR=BLUE,                                             X00776   
               PICOUT='999999',                                        X00777   
               LENGTH=6,                                               X00778   
               POS=(17,15)                                              00779   
ARECVD8  DFHMDF ATTRB=(ASKIP),                                         X00780   
               JUSTIFY=(LEFT,BLANK),                                   X00781   
               COLOR=BLUE,                                             X00782   
               PICOUT='999999',                                        X00783   
               LENGTH=6,                                               X00784   
               POS=(17,22)                                              00785   
AREC81   DFHMDF ATTRB=(ASKIP),                                         X00786   
               JUSTIFY=(LEFT,BLANK),                                   X00787   
               COLOR=BLUE,                                             X00788   
               PICOUT='999999',                                        X00789   
               LENGTH=6,                                               X00790   
               POS=(17,30)                                              00791   
AREC82   DFHMDF ATTRB=(ASKIP),                                         X00792   
               JUSTIFY=(LEFT,BLANK),                                   X00793   
               COLOR=BLUE,                                             X00794   
               PICOUT='ZZZZZZ',                                        X00795   
               LENGTH=6,                                               X00796   
               POS=(17,37)                                              00797   
AREC83   DFHMDF ATTRB=(ASKIP),                                         X00798   
               JUSTIFY=(LEFT,BLANK),                                   X00799   
               COLOR=BLUE,                                             X00800   
               PICOUT='ZZZZZZ',                                        X00801   
               LENGTH=6,                                               X00802   
               POS=(17,44)                                              00803   
AREC84   DFHMDF ATTRB=(ASKIP),                                         X00804   
               JUSTIFY=(LEFT,BLANK),                                   X00805   
               COLOR=BLUE,                                             X00806   
               PICOUT='ZZZZZZ',                                        X00807   
               LENGTH=6,                                               X00808   
               POS=(17,51)                                              00809   
AREC85   DFHMDF ATTRB=(ASKIP),                                         X00810   
               JUSTIFY=(LEFT,BLANK),                                   X00811   
               COLOR=BLUE,                                             X00812   
               PICOUT='ZZZZZZ',                                        X00813   
               LENGTH=6,                                               X00814   
               POS=(17,58)                                              00815   
AREC86   DFHMDF ATTRB=(ASKIP),                                         X00816   
               JUSTIFY=(LEFT,BLANK),                                   X00817   
               COLOR=BLUE,                                             X00818   
               PICOUT='ZZZZZZ',                                        X00819   
               LENGTH=6,                                               X00820   
               POS=(17,65)                                              00821   
AREC8O   DFHMDF ATTRB=(ASKIP),                                         X00822   
               JUSTIFY=(LEFT,BLANK),                                   X00823   
               COLOR=BLUE,                                             X00824   
               PICOUT='ZZZZZZ',                                        X00825   
               LENGTH=6,                                               X00826   
               POS=(17,72)                                              00827   
ASTR9    DFHMDF ATTRB=(ASKIP),                                         X00828   
               JUSTIFY=(LEFT,BLANK),                                   X00829   
               COLOR=BLUE,                                             X00830   
               PICOUT='ZZZZ',                                          X00831   
               LENGTH=4,                                               X00832   
               POS=(18,1)                                               00833   
ASTRNM9  DFHMDF ATTRB=(ASKIP),                                         X00834   
               COLOR=BLUE,                                             X00835   
               LENGTH=5,                                               X00836   
               POS=(18,6)                                               00837   
ADC9     DFHMDF ATTRB=(ASKIP),                                         X00838   
               COLOR=BLUE,                                             X00839   
               LENGTH=2,                                               X00840   
               POS=(18,12)                                              00841   
ACRAL9   DFHMDF ATTRB=(ASKIP),                                         X00842   
               JUSTIFY=(LEFT,BLANK),                                   X00843   
               COLOR=BLUE,                                             X00844   
               PICOUT='999999',                                        X00845   
               LENGTH=6,                                               X00846   
               POS=(18,15)                                              00847   
ARECVD9  DFHMDF ATTRB=(ASKIP),                                         X00848   
               JUSTIFY=(LEFT,BLANK),                                   X00849   
               COLOR=BLUE,                                             X00850   
               PICOUT='999999',                                        X00851   
               LENGTH=6,                                               X00852   
               POS=(18,22)                                              00853   
AREC91   DFHMDF ATTRB=(ASKIP),                                         X00854   
               JUSTIFY=(LEFT,BLANK),                                   X00855   
               COLOR=BLUE,                                             X00856   
               PICOUT='999999',                                        X00857   
               LENGTH=6,                                               X00858   
               POS=(18,30)                                              00859   
AREC92   DFHMDF ATTRB=(ASKIP),                                         X00860   
               JUSTIFY=(LEFT,BLANK),                                   X00861   
               COLOR=BLUE,                                             X00862   
               PICOUT='ZZZZZZ',                                        X00863   
               LENGTH=6,                                               X00864   
               POS=(18,37)                                              00865   
AREC93   DFHMDF ATTRB=(ASKIP),                                         X00866   
               JUSTIFY=(LEFT,BLANK),                                   X00867   
               COLOR=BLUE,                                             X00868   
               PICOUT='ZZZZZZ',                                        X00869   
               LENGTH=6,                                               X00870   
               POS=(18,44)                                              00871   
AREC94   DFHMDF ATTRB=(ASKIP),                                         X00872   
               JUSTIFY=(LEFT,BLANK),                                   X00873   
               COLOR=BLUE,                                             X00874   
               PICOUT='ZZZZZZ',                                        X00875   
               LENGTH=6,                                               X00876   
               POS=(18,51)                                              00877   
AREC95   DFHMDF ATTRB=(ASKIP),                                         X00878   
               JUSTIFY=(LEFT,BLANK),                                   X00879   
               COLOR=BLUE,                                             X00880   
               PICOUT='ZZZZZZ',                                        X00881   
               LENGTH=6,                                               X00882   
               POS=(18,58)                                              00883   
AREC96   DFHMDF ATTRB=(ASKIP),                                         X00884   
               JUSTIFY=(LEFT,BLANK),                                   X00885   
               COLOR=BLUE,                                             X00886   
               PICOUT='ZZZZZZ',                                        X00887   
               LENGTH=6,                                               X00888   
               POS=(18,65)                                              00889   
AREC9O   DFHMDF ATTRB=(ASKIP),                                         X00890   
               JUSTIFY=(LEFT,BLANK),                                   X00891   
               COLOR=BLUE,                                             X00892   
               PICOUT='ZZZZZZ',                                        X00893   
               LENGTH=6,                                               X00894   
               POS=(18,72)                                              00895   
ASTRA    DFHMDF ATTRB=(ASKIP),                                         X00896   
               JUSTIFY=(LEFT,BLANK),                                   X00897   
               COLOR=BLUE,                                             X00898   
               PICOUT='ZZZZ',                                          X00899   
               LENGTH=4,                                               X00900   
               POS=(19,1)                                               00901   
ASTRNMA  DFHMDF ATTRB=(ASKIP),                                         X00902   
               COLOR=BLUE,                                             X00903   
               LENGTH=5,                                               X00904   
               POS=(19,6)                                               00905   
ADCA     DFHMDF ATTRB=(ASKIP),                                         X00906   
               COLOR=BLUE,                                             X00907   
               LENGTH=2,                                               X00908   
               POS=(19,12)                                              00909   
ACRALA   DFHMDF ATTRB=(ASKIP),                                         X00910   
               JUSTIFY=(LEFT,BLANK),                                   X00911   
               COLOR=BLUE,                                             X00912   
               PICOUT='999999',                                        X00913   
               LENGTH=6,                                               X00914   
               POS=(19,15)                                              00915   
ARECVDA  DFHMDF ATTRB=(ASKIP),                                         X00916   
               JUSTIFY=(LEFT,BLANK),                                   X00917   
               COLOR=BLUE,                                             X00918   
               PICOUT='999999',                                        X00919   
               LENGTH=6,                                               X00920   
               POS=(19,22)                                              00921   
ARECA1   DFHMDF ATTRB=(ASKIP),                                         X00922   
               JUSTIFY=(LEFT,BLANK),                                   X00923   
               COLOR=BLUE,                                             X00924   
               PICOUT='999999',                                        X00925   
               LENGTH=6,                                               X00926   
               POS=(19,30)                                              00927   
ARECA2   DFHMDF ATTRB=(ASKIP),                                         X00928   
               JUSTIFY=(LEFT,BLANK),                                   X00929   
               COLOR=BLUE,                                             X00930   
               PICOUT='ZZZZZZ',                                        X00931   
               LENGTH=6,                                               X00932   
               POS=(19,37)                                              00933   
ARECA3   DFHMDF ATTRB=(ASKIP),                                         X00934   
               JUSTIFY=(LEFT,BLANK),                                   X00935   
               COLOR=BLUE,                                             X00936   
               PICOUT='ZZZZZZ',                                        X00937   
               LENGTH=6,                                               X00938   
               POS=(19,44)                                              00939   
ARECA4   DFHMDF ATTRB=(ASKIP),                                         X00940   
               JUSTIFY=(LEFT,BLANK),                                   X00941   
               COLOR=BLUE,                                             X00942   
               PICOUT='ZZZZZZ',                                        X00943   
               LENGTH=6,                                               X00944   
               POS=(19,51)                                              00945   
ARECA5   DFHMDF ATTRB=(ASKIP),                                         X00946   
               JUSTIFY=(LEFT,BLANK),                                   X00947   
               COLOR=BLUE,                                             X00948   
               PICOUT='ZZZZZZ',                                        X00949   
               LENGTH=6,                                               X00950   
               POS=(19,58)                                              00951   
ARECA6   DFHMDF ATTRB=(ASKIP),                                         X00952   
               JUSTIFY=(LEFT,BLANK),                                   X00953   
               COLOR=BLUE,                                             X00954   
               PICOUT='ZZZZZZ',                                        X00955   
               LENGTH=6,                                               X00956   
               POS=(19,65)                                              00957   
ARECAO   DFHMDF ATTRB=(ASKIP),                                         X00958   
               JUSTIFY=(LEFT,BLANK),                                   X00959   
               COLOR=BLUE,                                             X00960   
               PICOUT='ZZZZZZ',                                        X00961   
               LENGTH=6,                                               X00962   
               POS=(19,72)                                              00963   
         DFHMSD TYPE=FINAL                                              00964   
         END                                                            00965   
