*          DATA SET POKM100                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM100                                            *           
*        MAP     PO100A                                             *           
*        PROGRAM POKCS100                                           *           
*        TRANSID W100                                               *           
*        SYSTEM  CICS ARCH - PO SET MAINTENANCE                     *           
*-------------------------------------------------------------------*           
POKM100 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TIOAPFX=YES,                                            X        
               TERM=3270-2                                                      
PO100A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='SHORT NAME.:',                                 X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=12,                                              X        
               POS=(03,2)                                                       
ASHRTNM  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=5,                                               X        
               POS=(03,15)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(03,21)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='YEAR:',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(03,29)                                                      
AYEAR    DFHMDF ATTRB=(UNPROT,NUM),                                    X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=4,                                               X        
               POS=(03,35)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(03,40)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TYPE.....:',                                   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=10,                                              X        
               POS=(03,44)                                                      
ASETTYP  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=3,                                               X        
               POS=(03,55)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(03,59)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='LONG NAME..:',                                 X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=12,                                              X        
               POS=(05,2)                                                       
ALONGNM  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=25,                                              X        
               POS=(05,15)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(05,41)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TYPE DESC:',                                   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=10,                                              X        
               POS=(05,44)                                                      
ATYPDSC  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=25,                                              X        
               POS=(05,55)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(06,01)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STORE SETUP COMPLETE BEGIN DATE:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(07,2)                                                       
ASBEGDT  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(07,35)                                                      
*        DFHMDF ATTRB=(ASKIP),                                                  
*              LENGTH=1,                                                        
*              POS=(07,44)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='LOGISTICS RPT:',                               X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=14,                                              X        
               POS=(07,44)                                                      
ARPTIND  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=1,                                               X        
               POS=(07,59)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(07,61)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STORE SETUP COMPLETE END DATE..:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(09,2)                                                       
ASENDDT  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(09,35)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(09,44)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='RELEASE TO STORE BEGIN DATE....:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(11,2)                                                       
ARBEGDT  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(11,35)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(11,44)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='RELEASE TO STORE END DATE......:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(13,2)                                                       
ARENDDT  DFHMDF ATTRB=(UNPROT),                                        X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=8,                                               X        
               POS=(13,35)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(13,44)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
