  PRINT  NOGEN                                                          00004*10
*-------------------------------------------------------------------*   00005*10
*                                                                   *   00006*10
*        MAPSET  POKM081                                            *   00007*11
*        MAP     PO081A                                             *   00008*11
*        PROGRAM POKCS081                                           *   00009*11
*        TRANSID W081 - SHIPPING WINDOW INQUIRY                     *   00010*11
*        SYSTEM  PO SSYTEM                                          *   00011*10
*                                                                   *   00012*10
*-------------------------------------------------------------------*   00013*10
POKM081 DFHMSD TYPE=DSECT,                                             X00014*11
               MODE=INOUT,                                             X00015*10
               LANG=COBOL,                                             X00016*10
               STORAGE=AUTO,                                           X00017*10
               TIOAPFX=YES,                                            X00018*10
               TERM=3270-2                                              00019*10
PO081A  DFHMDI LINE=2,COLUMN=1,                                        X00020*11
               SIZE=(19,80),                                           X00021*10
               MAPATTS=(COLOR,HILIGHT),                                X00022*10
               DSATTS=(COLOR,HILIGHT),                                 X00023*10
               CTRL=(FREEKB)                                            00024*10
*                                                                       00025*10
*      LINE 2                                                           00025*10
*                                                                       00025*10
        DFHMDF POS=(02,01),                                            X00026*10
               LENGTH=12,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='PO NUMBER..:'                                   00030*10
APO     DFHMDF POS=(02,14),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               PICOUT='ZZZZZZZ9',                                      X        
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(02,51),                                            X00026*10
               LENGTH=17,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='ORDER DATE......:'                              00030*10
APODTE  DFHMDF POS=(02,69),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00025*10
*      LINE 3                                                           00025*10
*                                                                       00025*10
        DFHMDF POS=(03,01),                                            X00026*10
               LENGTH=12,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='DEPT.......:'                                   00030*10
ADEPT   DFHMDF POS=(03,14),                                            X00031*10
               LENGTH=03,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ADEPTNM DFHMDF POS=(03,18),                                            X00031*10
               LENGTH=20,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(03,51),                                            X00026*10
               LENGTH=17,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='RELEASE DATE....:'                              00030*10
ARELDTE DFHMDF POS=(03,69),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00025*10
*      LINE 4                                                           00025*10
*                                                                       00025*10
        DFHMDF POS=(04,01),                                            X00026*10
               LENGTH=12,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='BUYER NAME.:'                                   00030*10
ABUYER  DFHMDF POS=(04,14),                                            X00031*10
               LENGTH=20,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(04,51),                                            X00026*10
               LENGTH=17,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='EARLIEST AD DATE:'                              00030*10
AADDATE DFHMDF POS=(04,69),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00025*10
*      LINE 5                                                           00025*10
*                                                                       00025*10
        DFHMDF POS=(05,01),                                            X00026*10
               LENGTH=12,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='VENDOR NAME:'                                   00030*10
AVENDOR DFHMDF POS=(05,14),                                            X00031*10
               LENGTH=27,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(05,51),                                            X00026*10
               LENGTH=07,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='STATUS:'                                        00030*10
ASTAT   DFHMDF POS=(05,59),                                            X00031*10
               LENGTH=20,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                               
*      LINE 7                                                                   
*                                                                               
        DFHMDF POS=(07,45),                                            X00072*10
               LENGTH=05,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='ITEMS'                                          00076*10
ASTRTIT DFHMDF POS=(07,51),                                            X00077*10
               LENGTH=05,                                              X00078*10
               ATTRB=(NUM,UNPROT,NORM,IC),                             X00079*10
               COLOR=GREEN,                                            X00080*10
               HILIGHT=UNDERLINE,                                      X00081*10
               PICOUT='ZZZZ9'                                           00082*10
        DFHMDF POS=(07,57),                                            X00083*10
               LENGTH=02,                                              X00084*10
               ATTRB=(ASKIP,NORM),                                     X00085*10
               COLOR=NEUTRAL,                                          X00086*10
               INITIAL='TO'                                             00087*10
AENDIT  DFHMDF POS=(07,60),                                            X00088*10
               LENGTH=05,                                              X00089*10
               ATTRB=(ASKIP,NORM),                                     X00090*10
               COLOR=BLUE,                                             X00091*10
               PICOUT='ZZZZ9'                                           00092*10
        DFHMDF POS=(07,66),                                            X00093*10
               LENGTH=02,                                              X00094*10
               ATTRB=(ASKIP,NORM),                                     X00095*10
               COLOR=NEUTRAL,                                          X00096*10
               INITIAL='OF'                                             00097*10
ATOTIT  DFHMDF POS=(07,69),                                            X00098*10
               LENGTH=05,                                              X00099*10
               ATTRB=(ASKIP,NORM),                                     X00100*10
               COLOR=BLUE,                                             X00101*10
               PICOUT='ZZZZ9'                                           00102*10
*                                                                       00025*10
*      LINE 8 IS BLANK                                                  00025*10
*                                                                       00025*10
*      LINE 9                                                           00103*10
*                                                                       00103*10
        DFHMDF POS=(09,06),                                            X00072*10
               LENGTH=07,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='CHANGED'                                        00076*10
        DFHMDF POS=(09,37),                                            X00072*10
               LENGTH=05,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='START'                                          00076*10
        DFHMDF POS=(09,47),                                            X00072*10
               LENGTH=04,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='LAST'                                           00076*10
        DFHMDF POS=(09,53),                                            X00072*10
               LENGTH=27,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='DO NOT SHIP        EXTENDED'                    00076*10
*                                                                       00025*10
*      LINE 10                                                          00103*10
*                                                                       00103*10
        DFHMDF POS=(10,03),                                            X00072*10
               LENGTH=32,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL=' DATE   TIME      CHANGED BY    '               00076*10
        DFHMDF POS=(10,37),                                            X00072*10
               LENGTH=15,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='X-FACT   X-FACT'                                00076*10
        DFHMDF POS=(10,55),                                            X00072*10
               LENGTH=25,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='BEFORE   CANCEL   CANCEL '                      00076*10
*                                                                       00025*10
*      LINE 11 TO LINE 18                                               00103*10
*                                                                       00103*10
ADTE01  DFHMDF POS=(11,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME01  DFHMDF POS=(11,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO01  DFHMDF POS=(11,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF01  DFHMDF POS=(11,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF01  DFHMDF POS=(11,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP01  DFHMDF POS=(11,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN01  DFHMDF POS=(11,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT01  DFHMDF POS=(11,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE02  DFHMDF POS=(12,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME02  DFHMDF POS=(12,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO02  DFHMDF POS=(12,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF02  DFHMDF POS=(12,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF02  DFHMDF POS=(12,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP02  DFHMDF POS=(12,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN02  DFHMDF POS=(12,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT02  DFHMDF POS=(12,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                               
ADTE03  DFHMDF POS=(13,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME03  DFHMDF POS=(13,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO03  DFHMDF POS=(13,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF03  DFHMDF POS=(13,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF03  DFHMDF POS=(13,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP03  DFHMDF POS=(13,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN03  DFHMDF POS=(13,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT03  DFHMDF POS=(13,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE04  DFHMDF POS=(14,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME04  DFHMDF POS=(14,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO04  DFHMDF POS=(14,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF04  DFHMDF POS=(14,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF04  DFHMDF POS=(14,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP04  DFHMDF POS=(14,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN04  DFHMDF POS=(14,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT04  DFHMDF POS=(14,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE05  DFHMDF POS=(15,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME05  DFHMDF POS=(15,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO05  DFHMDF POS=(15,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF05  DFHMDF POS=(15,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF05  DFHMDF POS=(15,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP05  DFHMDF POS=(15,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN05  DFHMDF POS=(15,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT05  DFHMDF POS=(15,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE06  DFHMDF POS=(16,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME06  DFHMDF POS=(16,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO06  DFHMDF POS=(16,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF06  DFHMDF POS=(16,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF06  DFHMDF POS=(16,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP06  DFHMDF POS=(16,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN06  DFHMDF POS=(16,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT06  DFHMDF POS=(16,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE07  DFHMDF POS=(17,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME07  DFHMDF POS=(17,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO07  DFHMDF POS=(17,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF07  DFHMDF POS=(17,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF07  DFHMDF POS=(17,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP07  DFHMDF POS=(17,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN07  DFHMDF POS=(17,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT07  DFHMDF POS=(17,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
ADTE08  DFHMDF POS=(18,02),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ATME08  DFHMDF POS=(18,11),                                            X00031*10
               LENGTH=05,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AWHO08  DFHMDF POS=(18,17),                                            X00031*10
               LENGTH=18,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASXF08  DFHMDF POS=(18,36),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ALXF08  DFHMDF POS=(18,45),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ASHP08  DFHMDF POS=(18,54),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
ACAN08  DFHMDF POS=(18,63),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
AEXT08  DFHMDF POS=(18,72),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
*                                                                       00103*10
*                                                                       00445*10
*      LINE 19                                                          00445*10
*                                                                       00445*10
**************                                                          00450*10
        DFHMSD TYPE=FINAL                                               00451*10
**************                                                          00452*10
        END                                                             00453*10
