*          DATA SET POKM102                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM102                                            *           
*        MAP     PO102A                                             *           
*        PROGRAM POKCS102                                           *           
*        TRANSID W102                                               *           
*        SYSTEM  CICS ARCH - PO LIST OF A SPECIFIC SET ID           *           
*-------------------------------------------------------------------*           
POKM102 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
*                                                                               
PO102A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='ITEMS:',                                       X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=06,                                              X        
               POS=(01,43)                                                      
ASTRTIT DFHMDF ATTRB=(NUM,UNPROT),                                     X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=07,                                              X        
               POS=(01,50),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,58)                                                      
AENDIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,61),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='OF',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(01,69)                                                      
ATOTIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(01,72),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='PO',                                           X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=02,                                              X        
               POS=(02,08)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SHIP     CANCEL    UNITS',                     X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=24,                                              X        
               POS=(02,43)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='SEL',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(03,01)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NUMBER  DPT  VENDOR NM  STS',                  X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=27,                                              X        
               POS=(03,06)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='OTB     DATE      DATE   ORDERED',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(03,35)                                                      
*                                                                               
ASEL01  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(04,02)                                                      
APONM01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(04,04)                                                      
ADEPT01 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(04,14)                                                      
AVND01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(04,19)                                                      
ASTS01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(04,30)                                                      
AOTB01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(04,35)                                                      
ASDT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(04,41)                                                      
ACDT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(04,51)                                                      
AUNT01  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(04,61)                                                      
*                                                                               
ASEL02  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(05,02)                                                      
APONM02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(05,04)                                                      
ADEPT02 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(05,14)                                                      
AVND02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(05,19)                                                      
ASTS02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(05,30)                                                      
AOTB02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(05,35)                                                      
ASDT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,41)                                                      
ACDT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(05,51)                                                      
AUNT02  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(05,61)                                                      
*                                                                               
ASEL03  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(06,02)                                                      
APONM03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(06,04)                                                      
ADEPT03 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(06,14)                                                      
AVND03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(06,19)                                                      
ASTS03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(06,30)                                                      
AOTB03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(06,35)                                                      
ASDT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,41)                                                      
ACDT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(06,51)                                                      
AUNT03  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(06,61)                                                      
*                                                                               
ASEL04  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(07,02)                                                      
APONM04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(07,04)                                                      
ADEPT04 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(07,14)                                                      
AVND04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(07,19)                                                      
ASTS04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(07,30)                                                      
AOTB04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(07,35)                                                      
ASDT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,41)                                                      
ACDT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,51)                                                      
AUNT04  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(07,61)                                                      
*                                                                               
ASEL05  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(08,02)                                                      
APONM05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(08,04)                                                      
ADEPT05 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(08,14)                                                      
AVND05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(08,19)                                                      
ASTS05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(08,30)                                                      
AOTB05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(08,35)                                                      
ASDT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,41)                                                      
ACDT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(08,51)                                                      
AUNT05  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(08,61)                                                      
*                                                                               
ASEL06  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(09,02)                                                      
APONM06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(09,04)                                                      
ADEPT06 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(09,14)                                                      
AVND06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(09,19)                                                      
ASTS06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(09,30)                                                      
AOTB06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(09,35)                                                      
ASDT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,41)                                                      
ACDT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(09,51)                                                      
AUNT06  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(09,61)                                                      
*                                                                               
ASEL07  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(10,02)                                                      
APONM07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(10,04)                                                      
ADEPT07 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(10,14)                                                      
AVND07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(10,19)                                                      
ASTS07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(10,30)                                                      
AOTB07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(10,35)                                                      
ASDT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,41)                                                      
ACDT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(10,51)                                                      
AUNT07  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(10,61)                                                      
*                                                                               
ASEL08  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(11,02)                                                      
APONM08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(11,04)                                                      
ADEPT08 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(11,14)                                                      
AVND08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(11,19)                                                      
ASTS08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(11,30)                                                      
AOTB08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(11,35)                                                      
ASDT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,41)                                                      
ACDT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(11,51)                                                      
AUNT08  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(11,61)                                                      
*                                                                               
ASEL09  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(12,02)                                                      
APONM09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(12,04)                                                      
ADEPT09 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(12,14)                                                      
AVND09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(12,19)                                                      
ASTS09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(12,30)                                                      
AOTB09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(12,35)                                                      
ASDT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,41)                                                      
ACDT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(12,51)                                                      
AUNT09  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(12,61)                                                      
*                                                                               
ASEL10  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(13,02)                                                      
APONM10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(13,04)                                                      
ADEPT10 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(13,14)                                                      
AVND10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(13,19)                                                      
ASTS10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(13,30)                                                      
AOTB10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(13,35)                                                      
ASDT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,41)                                                      
ACDT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(13,51)                                                      
AUNT10  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(13,61)                                                      
*                                                                               
ASEL11  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(14,02)                                                      
APONM11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(14,04)                                                      
ADEPT11 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(14,14)                                                      
AVND11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(14,19)                                                      
ASTS11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(14,30)                                                      
AOTB11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(14,35)                                                      
ASDT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,41)                                                      
ACDT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(14,51)                                                      
AUNT11  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(14,61)                                                      
*                                                                               
ASEL12  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(15,02)                                                      
APONM12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(15,04)                                                      
ADEPT12 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(15,14)                                                      
AVND12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(15,19)                                                      
ASTS12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(15,30)                                                      
AOTB12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(15,35)                                                      
ASDT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,41)                                                      
ACDT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(15,51)                                                      
AUNT12  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(15,61)                                                      
*                                                                               
ASEL13  DFHMDF ATTRB=(UNPROT),                                         X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN,                                            X        
               LENGTH=01,                                              X        
               POS=(16,02)                                                      
APONM13 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=09,                                              X        
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(16,04)                                                      
ADEPT13 DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=03,                                              X        
               POS=(16,14)                                                      
AVND13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=10,                                              X        
               POS=(16,19)                                                      
ASTS13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=02,                                              X        
               POS=(16,30)                                                      
AOTB13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=04,                                              X        
               POS=(16,35)                                                      
ASDT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,41)                                                      
ACDT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(16,51)                                                      
AUNT13  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               PICOUT='ZZZZZZ9',                                       X        
               POS=(16,61)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='TOTALS FOR SELECTION LIST --->',               X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=30,                                              X        
               POS=(17,29)                                                      
ATUNIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               PICOUT='ZZZZZZZ9',                                      X        
               POS=(17,60)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=25,                                              X        
               POS=(18,47)                                                      
ASELIT  DFHMDF ATTRB=(ASKIP),                                          X        
               COLOR=BLUE,                                             X        
               LENGTH=07,                                              X        
               POS=(18,73),                                            X        
               PICOUT='ZZZ,ZZ9'                                                 
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
