*          DATA SET POKM030    AT LEVEL 017 AS OF 08/31/95                      
*          DATA SET POKM030    AT LEVEL 010 AS OF 01/31/95              00001**1
*          DATA SET POKM030    AT LEVEL 004 AS OF 09/23/93              00002**1
  PRINT  NOGEN                                                          00003**1
*-------------------------------------------------------------------*   00004**1
*                                                                   *   00005**1
*        MAPSET  POKM030                                            *   00006**1
*        MAP     PO030A                                             *   00007**1
*        PROGRAM POKCS030                                           *   00008**1
*        TRANSID W030                                               *   00009**1
*        SYSTEM  CICS ARCH - PO SELECTION LIST                      *   00010**1
*                                                                   *   00011**1
*-------------------------------------------------------------------*   00012**1
POKM030 DFHMSD TYPE=DSECT,                                             X00013**1
               LANG=COBOL,                                             X00014**1
               MODE=INOUT,                                             X00015**1
               STORAGE=AUTO,                                           X00016**1
               TIOAPFX=YES,                                            X00017**1
               TERM=3270-2                                              00018**1
PO030A  DFHMDI LINE=2,COLUMN=1,                                        X00019**1
               SIZE=(19,80),                                           X00020**1
               CTRL=(FREEKB),                                          X00021**1
               MAPATTS=(COLOR,HILIGHT),                                X00022**1
               DSATTS=(COLOR,HILIGHT)                                   00023**1
*                                                                       00024**1
         DFHMDF ATTRB=(PROT),                                          X00025**1
               INITIAL='ITEMS:',                                       X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               LENGTH=6,                                               X00028**1
               POS=(01,44)                                              00029**1
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00030**1
               COLOR=GREEN,                                            X00031**1
               HILIGHT=UNDERLINE,                                      X00032**1
               PICOUT='ZZZ,ZZ9',                                       X00033**1
               LENGTH=7,                                               X00034**1
               POS=(01,51)                                              00035**1
         DFHMDF ATTRB=(PROT),                                          X00036**1
               INITIAL='TO',                                           X00037**1
               COLOR=NEUTRAL,                                          X00038**1
               LENGTH=2,                                               X00039**1
               POS=(01,59)                                              00040**1
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00041**1
               COLOR=BLUE,                                             X00042**1
               PICOUT='ZZZ,ZZ9',                                       X00043**1
               LENGTH=7,                                               X00044**1
               POS=(01,62)                                              00045**1
         DFHMDF ATTRB=(PROT),                                          X00046**1
               INITIAL='OF',                                           X00047**1
               COLOR=NEUTRAL,                                          X00048**1
               LENGTH=2,                                               X00049**1
               POS=(01,70)                                              00050**1
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00051**1
               COLOR=BLUE,                                             X00052**1
               PICOUT='ZZZ,ZZ9',                                       X00053**1
               LENGTH=7,                                               X00054**1
               POS=(01,73)                                              00055**1
*                                                                       00056**1
         DFHMDF ATTRB=(ASKIP),                                         X00057**1
               INITIAL='PO',                                           X00058**1
               COLOR=NEUTRAL,                                          X00059**1
               LENGTH=2,                                               X00060**1
               POS=(03,08)                                              00061*10
         DFHMDF ATTRB=(ASKIP),                                         X00062**1
               INITIAL='SHIP  CANCEL',                                 X00063*10
               COLOR=NEUTRAL,                                          X00064**1
               LENGTH=12,                                              X00065**9
               POS=(03,37)                                              00066*15
AHEAD    DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=27,                                              X00069*16
               POS=(03,53)                                              00070*16
*                                                                       00071**1
         DFHMDF ATTRB=(ASKIP),                                         X00072**1
               INITIAL='SEL  NUMBER DPT VENDOR NM STS  OTB',           X00073*15
               COLOR=NEUTRAL,                                          X00074**1
               LENGTH=34,                                              X00075*15
               POS=(04,1)                                               00076**1
         DFHMDF ATTRB=(ASKIP),                                         X00077**1
               INITIAL='DATE   DATE EDI',                              X00078*12
               COLOR=NEUTRAL,                                          X00079**1
               LENGTH=15,                                              X00080*12
               POS=(04,37)                                              00081*15
AHEAD2   DFHMDF ATTRB=(ASKIP),                                         X00082**2
               COLOR=NEUTRAL,                                          X00083**2
               LENGTH=27,                                              X00084*15
               POS=(04,53)                                              00085*15
*                                                                       00086**1
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(05,2)                                               00091**1
APONM1   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZZZZZ',                                      X00094**1
               LENGTH=8,                                               X00095**1
               POS=(05,4)                                               00096*11
ADEPT1   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=3,                                               X00099**1
               POS=(05,13)                                              00100*14
AVNME1   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=10,                                              X00103**1
               POS=(05,17)                                              00104*14
ASTAT1   DFHMDF ATTRB=(ASKIP),                                         X00105**1
               COLOR=BLUE,                                             X00106**1
               LENGTH=2,                                               X00107**1
               POS=(05,28)                                              00108*14
AOTB1    DFHMDF ATTRB=(ASKIP),                                         X00109**1
               COLOR=BLUE,                                             X00110**1
               LENGTH=4,                                               X00111**1
               POS=(05,31)                                              00112*14
ASHDT1   DFHMDF ATTRB=(ASKIP),                                         X00113**1
               COLOR=BLUE,                                             X00114**1
               LENGTH=6,                                               X00115**1
               POS=(05,36)                                              00116*14
ACNDT1   DFHMDF ATTRB=(ASKIP),                                         X00117**1
               COLOR=BLUE,                                             X00118**1
               LENGTH=6,                                               X00119**1
               POS=(05,43)                                              00120*17
AEDI1    DFHMDF ATTRB=(ASKIP),                                         X00121**3
               COLOR=BLUE,                                             X00122**1
               LENGTH=1,                                               X00123**4
               POS=(05,50)                                              00124*14
ALINE1   DFHMDF ATTRB=(ASKIP),                                         X00125**3
               COLOR=BLUE,                                             X00126**1
               LENGTH=28,                                              X00127*14
               POS=(05,52)                                              00128*14
*                                                                       00129**1
ASEL2    DFHMDF ATTRB=(UNPROT,IC),                                     X00130**1
               COLOR=GREEN,                                            X00131**1
               HILIGHT=UNDERLINE,                                      X00132**1
               LENGTH=1,                                               X00133**1
               POS=(06,2)                                               00134**1
APONM2   DFHMDF ATTRB=(ASKIP),                                         X00135**1
               COLOR=BLUE,                                             X00136**1
               PICOUT='ZZZZZZZZ',                                      X00137**1
               LENGTH=8,                                               X00138**1
               POS=(06,4)                                               00139*11
ADEPT2   DFHMDF ATTRB=(ASKIP),                                         X00140**1
               COLOR=BLUE,                                             X00141**1
               LENGTH=3,                                               X00142**1
               POS=(06,13)                                              00143*14
AVNME2   DFHMDF ATTRB=(ASKIP),                                         X00144**1
               COLOR=BLUE,                                             X00145**1
               LENGTH=10,                                              X00146**1
               POS=(06,17)                                              00147*14
ASTAT2   DFHMDF ATTRB=(ASKIP),                                         X00148**1
               COLOR=BLUE,                                             X00149**1
               LENGTH=2,                                               X00150**1
               POS=(06,28)                                              00151*14
AOTB2    DFHMDF ATTRB=(ASKIP),                                         X00152**1
               COLOR=BLUE,                                             X00153**1
               LENGTH=4,                                               X00154**1
               POS=(06,31)                                              00155*14
ASHDT2   DFHMDF ATTRB=(ASKIP),                                         X00156**1
               COLOR=BLUE,                                             X00157**1
               LENGTH=6,                                               X00158**1
               POS=(06,36)                                              00159*14
ACNDT2   DFHMDF ATTRB=(ASKIP),                                         X00160**1
               COLOR=BLUE,                                             X00161**1
               LENGTH=6,                                               X00162**1
               POS=(06,43)                                              00163*14
AEDI2    DFHMDF ATTRB=(ASKIP),                                         X00164**3
               COLOR=BLUE,                                             X00165**1
               LENGTH=1,                                               X00166**6
               POS=(06,50)                                              00167*14
ALINE2   DFHMDF ATTRB=(ASKIP),                                         X00168**3
               COLOR=BLUE,                                             X00169**1
               LENGTH=28,                                              X00170*14
               POS=(06,52)                                              00171*14
*                                                                       00172**1
ASEL3    DFHMDF ATTRB=(UNPROT,IC),                                     X00173**1
               COLOR=GREEN,                                            X00174**1
               HILIGHT=UNDERLINE,                                      X00175**1
               LENGTH=1,                                               X00176**1
               POS=(07,2)                                               00177**1
APONM3   DFHMDF ATTRB=(ASKIP),                                         X00178**1
               COLOR=BLUE,                                             X00179**1
               PICOUT='ZZZZZZZZ',                                      X00180**1
               LENGTH=8,                                               X00181**1
               POS=(07,4)                                               00182*11
ADEPT3   DFHMDF ATTRB=(ASKIP),                                         X00183**1
               COLOR=BLUE,                                             X00184**1
               LENGTH=3,                                               X00185**1
               POS=(07,13)                                              00186*14
AVNME3   DFHMDF ATTRB=(ASKIP),                                         X00187**1
               COLOR=BLUE,                                             X00188**1
               LENGTH=10,                                              X00189**1
               POS=(07,17)                                              00190*14
ASTAT3   DFHMDF ATTRB=(ASKIP),                                         X00191**1
               COLOR=BLUE,                                             X00192**1
               LENGTH=2,                                               X00193**1
               POS=(07,28)                                              00194*14
AOTB3    DFHMDF ATTRB=(ASKIP),                                         X00195**1
               COLOR=BLUE,                                             X00196**1
               LENGTH=4,                                               X00197**1
               POS=(07,31)                                              00198*14
ASHDT3   DFHMDF ATTRB=(ASKIP),                                         X00199**1
               COLOR=BLUE,                                             X00200**1
               LENGTH=6,                                               X00201**1
               POS=(07,36)                                              00202*14
ACNDT3   DFHMDF ATTRB=(ASKIP),                                         X00203**1
               COLOR=BLUE,                                             X00204**1
               LENGTH=6,                                               X00205**1
               POS=(07,43)                                              00206*14
AEDI3    DFHMDF ATTRB=(ASKIP),                                         X00207**3
               COLOR=BLUE,                                             X00208**1
               LENGTH=1,                                               X00209**4
               POS=(07,50)                                              00210*14
ALINE3   DFHMDF ATTRB=(ASKIP),                                         X00211**3
               COLOR=BLUE,                                             X00212**1
               LENGTH=28,                                              X00213*14
               POS=(07,52)                                              00214*14
*                                                                       00215**1
ASEL4    DFHMDF ATTRB=(UNPROT,IC),                                     X00216**1
               COLOR=GREEN,                                            X00217**1
               HILIGHT=UNDERLINE,                                      X00218**1
               LENGTH=1,                                               X00219**1
               POS=(08,2)                                               00220**1
APONM4   DFHMDF ATTRB=(ASKIP),                                         X00221**1
               COLOR=BLUE,                                             X00222**1
               PICOUT='ZZZZZZZZ',                                      X00223**1
               LENGTH=8,                                               X00224**1
               POS=(08,4)                                               00225*11
ADEPT4   DFHMDF ATTRB=(ASKIP),                                         X00226**1
               COLOR=BLUE,                                             X00227**1
               LENGTH=3,                                               X00228**1
               POS=(08,13)                                              00229*14
AVNME4   DFHMDF ATTRB=(ASKIP),                                         X00230**1
               COLOR=BLUE,                                             X00231**1
               LENGTH=10,                                              X00232**1
               POS=(08,17)                                              00233*14
ASTAT4   DFHMDF ATTRB=(ASKIP),                                         X00234**1
               COLOR=BLUE,                                             X00235**1
               LENGTH=2,                                               X00236**1
               POS=(08,28)                                              00237*14
AOTB4    DFHMDF ATTRB=(ASKIP),                                         X00238**1
               COLOR=BLUE,                                             X00239**1
               LENGTH=4,                                               X00240**1
               POS=(08,31)                                              00241*14
ASHDT4   DFHMDF ATTRB=(ASKIP),                                         X00242**1
               COLOR=BLUE,                                             X00243**1
               LENGTH=6,                                               X00244**1
               POS=(08,36)                                              00245*14
ACNDT4   DFHMDF ATTRB=(ASKIP),                                         X00246**1
               COLOR=BLUE,                                             X00247**1
               LENGTH=6,                                               X00248**1
               POS=(08,43)                                              00249*14
AEDI4    DFHMDF ATTRB=(ASKIP),                                         X00250**3
               COLOR=BLUE,                                             X00251**1
               LENGTH=1,                                               X00252**4
               POS=(08,50)                                              00253*14
ALINE4   DFHMDF ATTRB=(ASKIP),                                         X00254**3
               COLOR=BLUE,                                             X00255**1
               LENGTH=28,                                              X00256*14
               POS=(08,52)                                              00257*14
*                                                                       00258**1
ASEL5    DFHMDF ATTRB=(UNPROT,IC),                                     X00259**1
               COLOR=GREEN,                                            X00260**1
               HILIGHT=UNDERLINE,                                      X00261**1
               LENGTH=1,                                               X00262**1
               POS=(09,2)                                               00263**1
APONM5   DFHMDF ATTRB=(ASKIP),                                         X00264**1
               COLOR=BLUE,                                             X00265**1
               PICOUT='ZZZZZZZZ',                                      X00266**1
               LENGTH=8,                                               X00267**1
               POS=(09,4)                                               00268*11
ADEPT5   DFHMDF ATTRB=(ASKIP),                                         X00269**1
               COLOR=BLUE,                                             X00270**1
               LENGTH=3,                                               X00271**1
               POS=(09,13)                                              00272*14
AVNME5   DFHMDF ATTRB=(ASKIP),                                         X00273**1
               COLOR=BLUE,                                             X00274**1
               LENGTH=10,                                              X00275**1
               POS=(09,17)                                              00276*14
ASTAT5   DFHMDF ATTRB=(ASKIP),                                         X00277**1
               COLOR=BLUE,                                             X00278**1
               LENGTH=2,                                               X00279**1
               POS=(09,28)                                              00280*14
AOTB5    DFHMDF ATTRB=(ASKIP),                                         X00281**1
               COLOR=BLUE,                                             X00282**1
               LENGTH=4,                                               X00283**1
               POS=(09,31)                                              00284*14
ASHDT5   DFHMDF ATTRB=(ASKIP),                                         X00285**1
               COLOR=BLUE,                                             X00286**1
               LENGTH=6,                                               X00287**1
               POS=(09,36)                                              00288*14
ACNDT5   DFHMDF ATTRB=(ASKIP),                                         X00289**1
               COLOR=BLUE,                                             X00290**1
               LENGTH=6,                                               X00291**1
               POS=(09,43)                                              00292*14
AEDI5    DFHMDF ATTRB=(ASKIP),                                         X00293**3
               COLOR=BLUE,                                             X00294**1
               LENGTH=1,                                               X00295**4
               POS=(09,50)                                              00296*14
ALINE5   DFHMDF ATTRB=(ASKIP),                                         X00297**3
               COLOR=BLUE,                                             X00298**1
               LENGTH=28,                                              X00299*14
               POS=(09,52)                                              00300*14
*                                                                       00301**1
ASEL6    DFHMDF ATTRB=(UNPROT,IC),                                     X00302**1
               COLOR=GREEN,                                            X00303**1
               HILIGHT=UNDERLINE,                                      X00304**1
               LENGTH=1,                                               X00305**1
               POS=(10,2)                                               00306**1
APONM6   DFHMDF ATTRB=(ASKIP),                                         X00307**1
               COLOR=BLUE,                                             X00308**1
               PICOUT='ZZZZZZZZ',                                      X00309**1
               LENGTH=8,                                               X00310**1
               POS=(10,4)                                               00311*11
ADEPT6   DFHMDF ATTRB=(ASKIP),                                         X00312**1
               COLOR=BLUE,                                             X00313**1
               LENGTH=3,                                               X00314**1
               POS=(10,13)                                              00315*14
AVNME6   DFHMDF ATTRB=(ASKIP),                                         X00316**1
               COLOR=BLUE,                                             X00317**1
               LENGTH=10,                                              X00318**1
               POS=(10,17)                                              00319*14
ASTAT6   DFHMDF ATTRB=(ASKIP),                                         X00320**1
               COLOR=BLUE,                                             X00321**1
               LENGTH=2,                                               X00322**1
               POS=(10,28)                                              00323*14
AOTB6    DFHMDF ATTRB=(ASKIP),                                         X00324**1
               COLOR=BLUE,                                             X00325**1
               LENGTH=4,                                               X00326**1
               POS=(10,31)                                              00327*14
ASHDT6   DFHMDF ATTRB=(ASKIP),                                         X00328**1
               COLOR=BLUE,                                             X00329**1
               LENGTH=6,                                               X00330**1
               POS=(10,36)                                              00331*14
ACNDT6   DFHMDF ATTRB=(ASKIP),                                         X00332**1
               COLOR=BLUE,                                             X00333**1
               LENGTH=6,                                               X00334**1
               POS=(10,43)                                              00335*14
AEDI6    DFHMDF ATTRB=(ASKIP),                                         X00336**3
               COLOR=BLUE,                                             X00337**1
               LENGTH=1,                                               X00338**4
               POS=(10,50)                                              00339*14
ALINE6   DFHMDF ATTRB=(ASKIP),                                         X00340**3
               COLOR=BLUE,                                             X00341**1
               LENGTH=28,                                              X00342*14
               POS=(10,52)                                              00343*14
*                                                                       00344**1
ASEL7    DFHMDF ATTRB=(UNPROT,IC),                                     X00345**1
               COLOR=GREEN,                                            X00346**1
               HILIGHT=UNDERLINE,                                      X00347**1
               LENGTH=1,                                               X00348**1
               POS=(11,2)                                               00349**1
APONM7   DFHMDF ATTRB=(ASKIP),                                         X00350**1
               COLOR=BLUE,                                             X00351**1
               PICOUT='ZZZZZZZZ',                                      X00352**1
               LENGTH=8,                                               X00353**1
               POS=(11,4)                                               00354*11
ADEPT7   DFHMDF ATTRB=(ASKIP),                                         X00355**1
               COLOR=BLUE,                                             X00356**1
               LENGTH=3,                                               X00357**1
               POS=(11,13)                                              00358*14
AVNME7   DFHMDF ATTRB=(ASKIP),                                         X00359**1
               COLOR=BLUE,                                             X00360**1
               LENGTH=10,                                              X00361**1
               POS=(11,17)                                              00362*14
ASTAT7   DFHMDF ATTRB=(ASKIP),                                         X00363**1
               COLOR=BLUE,                                             X00364**1
               LENGTH=2,                                               X00365**1
               POS=(11,28)                                              00366*14
AOTB7    DFHMDF ATTRB=(ASKIP),                                         X00367**1
               COLOR=BLUE,                                             X00368**1
               LENGTH=4,                                               X00369**1
               POS=(11,31)                                              00370*14
ASHDT7   DFHMDF ATTRB=(ASKIP),                                         X00371**1
               COLOR=BLUE,                                             X00372**1
               LENGTH=6,                                               X00373**1
               POS=(11,36)                                              00374*14
ACNDT7   DFHMDF ATTRB=(ASKIP),                                         X00375**1
               COLOR=BLUE,                                             X00376**1
               LENGTH=6,                                               X00377**1
               POS=(11,43)                                              00378*14
AEDI7    DFHMDF ATTRB=(ASKIP),                                         X00379**3
               COLOR=BLUE,                                             X00380**1
               LENGTH=1,                                               X00381**4
               POS=(11,50)                                              00382*14
ALINE7   DFHMDF ATTRB=(ASKIP),                                         X00383**3
               COLOR=BLUE,                                             X00384**1
               LENGTH=28,                                              X00385*14
               POS=(11,52)                                              00386*14
*                                                                       00387**1
ASEL8    DFHMDF ATTRB=(UNPROT,IC),                                     X00388**1
               COLOR=GREEN,                                            X00389**1
               HILIGHT=UNDERLINE,                                      X00390**1
               LENGTH=1,                                               X00391**1
               POS=(12,2)                                               00392**1
APONM8   DFHMDF ATTRB=(ASKIP),                                         X00393**1
               COLOR=BLUE,                                             X00394**1
               PICOUT='ZZZZZZZZ',                                      X00395**1
               LENGTH=8,                                               X00396**1
               POS=(12,4)                                               00397*11
ADEPT8   DFHMDF ATTRB=(ASKIP),                                         X00398**1
               COLOR=BLUE,                                             X00399**1
               LENGTH=3,                                               X00400**1
               POS=(12,13)                                              00401*14
AVNME8   DFHMDF ATTRB=(ASKIP),                                         X00402**1
               COLOR=BLUE,                                             X00403**1
               LENGTH=10,                                              X00404**1
               POS=(12,17)                                              00405*14
ASTAT8   DFHMDF ATTRB=(ASKIP),                                         X00406**1
               COLOR=BLUE,                                             X00407**1
               LENGTH=2,                                               X00408**1
               POS=(12,28)                                              00409*14
AOTB8    DFHMDF ATTRB=(ASKIP),                                         X00410**1
               COLOR=BLUE,                                             X00411**1
               LENGTH=4,                                               X00412**1
               POS=(12,31)                                              00413*14
ASHDT8   DFHMDF ATTRB=(ASKIP),                                         X00414**1
               COLOR=BLUE,                                             X00415**1
               LENGTH=6,                                               X00416**1
               POS=(12,36)                                              00417*14
ACNDT8   DFHMDF ATTRB=(ASKIP),                                         X00418**1
               COLOR=BLUE,                                             X00419**1
               LENGTH=6,                                               X00420**1
               POS=(12,43)                                              00421*14
AEDI8    DFHMDF ATTRB=(ASKIP),                                         X00422**3
               COLOR=BLUE,                                             X00423**1
               LENGTH=1,                                               X00424**4
               POS=(12,50)                                              00425*14
ALINE8   DFHMDF ATTRB=(ASKIP),                                         X00426**3
               COLOR=BLUE,                                             X00427**1
               LENGTH=28,                                              X00428*14
               POS=(12,52)                                              00429*14
*                                                                       00430**1
ASEL9    DFHMDF ATTRB=(UNPROT,IC),                                     X00431**1
               COLOR=GREEN,                                            X00432**1
               HILIGHT=UNDERLINE,                                      X00433**1
               LENGTH=1,                                               X00434**1
               POS=(13,2)                                               00435**1
APONM9   DFHMDF ATTRB=(ASKIP),                                         X00436**1
               COLOR=BLUE,                                             X00437**1
               PICOUT='ZZZZZZZZ',                                      X00438**1
               LENGTH=8,                                               X00439**1
               POS=(13,4)                                               00440*11
ADEPT9   DFHMDF ATTRB=(ASKIP),                                         X00441**1
               COLOR=BLUE,                                             X00442**1
               LENGTH=3,                                               X00443**1
               POS=(13,13)                                              00444*14
AVNME9   DFHMDF ATTRB=(ASKIP),                                         X00445**1
               COLOR=BLUE,                                             X00446**1
               LENGTH=10,                                              X00447**1
               POS=(13,17)                                              00448*14
ASTAT9   DFHMDF ATTRB=(ASKIP),                                         X00449**1
               COLOR=BLUE,                                             X00450**1
               LENGTH=2,                                               X00451**1
               POS=(13,28)                                              00452*14
AOTB9    DFHMDF ATTRB=(ASKIP),                                         X00453**1
               COLOR=BLUE,                                             X00454**1
               LENGTH=4,                                               X00455**1
               POS=(13,31)                                              00456*14
ASHDT9   DFHMDF ATTRB=(ASKIP),                                         X00457**1
               COLOR=BLUE,                                             X00458**1
               LENGTH=6,                                               X00459**1
               POS=(13,36)                                              00460*14
ACNDT9   DFHMDF ATTRB=(ASKIP),                                         X00461**1
               COLOR=BLUE,                                             X00462**1
               LENGTH=6,                                               X00463**1
               POS=(13,43)                                              00464*14
AEDI9    DFHMDF ATTRB=(ASKIP),                                         X00465**3
               COLOR=BLUE,                                             X00466**1
               LENGTH=1,                                               X00467**4
               POS=(13,50)                                              00468*14
ALINE9   DFHMDF ATTRB=(ASKIP),                                         X00469**3
               COLOR=BLUE,                                             X00470**1
               LENGTH=28,                                              X00471*14
               POS=(13,52)                                              00472*14
*                                                                       00473**1
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00474**1
               COLOR=GREEN,                                            X00475**1
               HILIGHT=UNDERLINE,                                      X00476**1
               LENGTH=1,                                               X00477**1
               POS=(14,2)                                               00478**1
APONM10  DFHMDF ATTRB=(ASKIP),                                         X00479**1
               COLOR=BLUE,                                             X00480**1
               PICOUT='ZZZZZZZZ',                                      X00481**1
               LENGTH=8,                                               X00482**1
               POS=(14,4)                                               00483*11
ADEPT10  DFHMDF ATTRB=(ASKIP),                                         X00484**1
               COLOR=BLUE,                                             X00485**1
               LENGTH=3,                                               X00486**1
               POS=(14,13)                                              00487*14
AVNME10  DFHMDF ATTRB=(ASKIP),                                         X00488**1
               COLOR=BLUE,                                             X00489**1
               LENGTH=10,                                              X00490**1
               POS=(14,17)                                              00491*14
ASTAT10  DFHMDF ATTRB=(ASKIP),                                         X00492**1
               COLOR=BLUE,                                             X00493**1
               LENGTH=2,                                               X00494**1
               POS=(14,28)                                              00495*14
AOTB10   DFHMDF ATTRB=(ASKIP),                                         X00496**1
               COLOR=BLUE,                                             X00497**1
               LENGTH=4,                                               X00498**1
               POS=(14,31)                                              00499*14
ASHDT10  DFHMDF ATTRB=(ASKIP),                                         X00500**1
               COLOR=BLUE,                                             X00501**1
               LENGTH=6,                                               X00502**1
               POS=(14,36)                                              00503*14
ACNDT10  DFHMDF ATTRB=(ASKIP),                                         X00504**1
               COLOR=BLUE,                                             X00505**1
               LENGTH=6,                                               X00506**1
               POS=(14,43)                                              00507*14
AEDI10   DFHMDF ATTRB=(ASKIP),                                         X00508**3
               COLOR=BLUE,                                             X00509**1
               LENGTH=1,                                               X00510**4
               POS=(14,50)                                              00511*14
ALINE10  DFHMDF ATTRB=(ASKIP),                                         X00512**3
               COLOR=BLUE,                                             X00513**1
               LENGTH=28,                                              X00514*14
               POS=(14,52)                                              00515*14
*                                                                       00516**1
ASEL11   DFHMDF ATTRB=(UNPROT,IC),                                     X00517**1
               COLOR=GREEN,                                            X00518**1
               HILIGHT=UNDERLINE,                                      X00519**1
               LENGTH=1,                                               X00520**1
               POS=(15,2)                                               00521**1
APONM11  DFHMDF ATTRB=(ASKIP),                                         X00522**1
               COLOR=BLUE,                                             X00523**1
               PICOUT='ZZZZZZZZ',                                      X00524**1
               LENGTH=8,                                               X00525**1
               POS=(15,4)                                               00526*11
ADEPT11  DFHMDF ATTRB=(ASKIP),                                         X00527**1
               COLOR=BLUE,                                             X00528**1
               LENGTH=3,                                               X00529**1
               POS=(15,13)                                              00530*14
AVNME11  DFHMDF ATTRB=(ASKIP),                                         X00531**1
               COLOR=BLUE,                                             X00532**1
               LENGTH=10,                                              X00533**1
               POS=(15,17)                                              00534*14
ASTAT11  DFHMDF ATTRB=(ASKIP),                                         X00535**1
               COLOR=BLUE,                                             X00536**1
               LENGTH=2,                                               X00537**1
               POS=(15,28)                                              00538*14
AOTB11   DFHMDF ATTRB=(ASKIP),                                         X00539**1
               COLOR=BLUE,                                             X00540**1
               LENGTH=4,                                               X00541**1
               POS=(15,31)                                              00542*14
ASHDT11  DFHMDF ATTRB=(ASKIP),                                         X00543**1
               COLOR=BLUE,                                             X00544**1
               LENGTH=6,                                               X00545**1
               POS=(15,36)                                              00546*14
ACNDT11  DFHMDF ATTRB=(ASKIP),                                         X00547**1
               COLOR=BLUE,                                             X00548**1
               LENGTH=6,                                               X00549**1
               POS=(15,43)                                              00550*14
AEDI11   DFHMDF ATTRB=(ASKIP),                                         X00551**3
               COLOR=BLUE,                                             X00552**1
               LENGTH=1,                                               X00553**4
               POS=(15,50)                                              00554*14
ALINE11  DFHMDF ATTRB=(ASKIP),                                         X00555**3
               COLOR=BLUE,                                             X00556**1
               LENGTH=28,                                              X00557*14
               POS=(15,52)                                              00558*14
*                                                                       00559**1
ASEL12   DFHMDF ATTRB=(UNPROT,IC),                                     X00560**1
               COLOR=GREEN,                                            X00561**1
               HILIGHT=UNDERLINE,                                      X00562**1
               LENGTH=1,                                               X00563**1
               POS=(16,2)                                               00564**1
APONM12  DFHMDF ATTRB=(ASKIP),                                         X00565**1
               COLOR=BLUE,                                             X00566**1
               PICOUT='ZZZZZZZZ',                                      X00567**1
               LENGTH=8,                                               X00568**1
               POS=(16,4)                                               00569*11
ADEPT12  DFHMDF ATTRB=(ASKIP),                                         X00570**1
               COLOR=BLUE,                                             X00571**1
               LENGTH=3,                                               X00572**1
               POS=(16,13)                                              00573*14
AVNME12  DFHMDF ATTRB=(ASKIP),                                         X00574**1
               COLOR=BLUE,                                             X00575**1
               LENGTH=10,                                              X00576**1
               POS=(16,17)                                              00577*14
ASTAT12  DFHMDF ATTRB=(ASKIP),                                         X00578**1
               COLOR=BLUE,                                             X00579**1
               LENGTH=2,                                               X00580**1
               POS=(16,28)                                              00581*14
AOTB12   DFHMDF ATTRB=(ASKIP),                                         X00582**1
               COLOR=BLUE,                                             X00583**1
               LENGTH=4,                                               X00584**1
               POS=(16,31)                                              00585*14
ASHDT12  DFHMDF ATTRB=(ASKIP),                                         X00586**1
               COLOR=BLUE,                                             X00587**1
               LENGTH=6,                                               X00588**1
               POS=(16,36)                                              00589*14
ACNDT12  DFHMDF ATTRB=(ASKIP),                                         X00590**1
               COLOR=BLUE,                                             X00591**1
               LENGTH=6,                                               X00592**1
               POS=(16,43)                                              00593*14
AEDI12   DFHMDF ATTRB=(ASKIP),                                         X00594**3
               COLOR=BLUE,                                             X00595**1
               LENGTH=1,                                               X00596**4
               POS=(16,50)                                              00597*14
ALINE12  DFHMDF ATTRB=(ASKIP),                                         X00598**3
               COLOR=BLUE,                                             X00599**1
               LENGTH=28,                                              X00600*14
               POS=(16,52)                                              00601*14
*                                                                       00602**1
ASEL13   DFHMDF ATTRB=(UNPROT,IC),                                     X00603**1
               COLOR=GREEN,                                            X00604**1
               HILIGHT=UNDERLINE,                                      X00605**1
               LENGTH=1,                                               X00606**1
               POS=(17,2)                                               00607**1
APONM13  DFHMDF ATTRB=(ASKIP),                                         X00608**1
               COLOR=BLUE,                                             X00609**1
               PICOUT='ZZZZZZZZ',                                      X00610**1
               LENGTH=8,                                               X00611**1
               POS=(17,4)                                               00612*11
ADEPT13  DFHMDF ATTRB=(ASKIP),                                         X00613**1
               COLOR=BLUE,                                             X00614**1
               LENGTH=3,                                               X00615**1
               POS=(17,13)                                              00616*14
AVNME13  DFHMDF ATTRB=(ASKIP),                                         X00617**1
               COLOR=BLUE,                                             X00618**1
               LENGTH=10,                                              X00619**1
               POS=(17,17)                                              00620*14
ASTAT13  DFHMDF ATTRB=(ASKIP),                                         X00621**1
               COLOR=BLUE,                                             X00622**1
               LENGTH=2,                                               X00623**1
               POS=(17,28)                                              00624*14
AOTB13   DFHMDF ATTRB=(ASKIP),                                         X00625**1
               COLOR=BLUE,                                             X00626**1
               LENGTH=4,                                               X00627**1
               POS=(17,31)                                              00628*14
ASHDT13  DFHMDF ATTRB=(ASKIP),                                         X00629**1
               COLOR=BLUE,                                             X00630**1
               LENGTH=6,                                               X00631**1
               POS=(17,36)                                              00632*14
ACNDT13  DFHMDF ATTRB=(ASKIP),                                         X00633**1
               COLOR=BLUE,                                             X00634**1
               LENGTH=6,                                               X00635**1
               POS=(17,43)                                              00636*14
AEDI13   DFHMDF ATTRB=(ASKIP),                                         X00637**3
               COLOR=BLUE,                                             X00638**1
               LENGTH=1,                                               X00639**4
               POS=(17,50)                                              00640*14
ALINE13  DFHMDF ATTRB=(ASKIP),                                         X00641**3
               COLOR=BLUE,                                             X00642**1
               LENGTH=28,                                              X00643*14
               POS=(17,52)                                              00644*14
         DFHMDF ATTRB=(PROT),                                          X00645**1
               INITIAL='TOTALS FOR SELECTION LIST ---->',              X00646**1
               COLOR=NEUTRAL,                                          X00647**1
               LENGTH=31,                                              X00648**1
               POS=(18,18)                                              00649**1
ATLINE   DFHMDF ATTRB=(ASKIP),                                         X00650**5
               COLOR=YELLOW,                                           X00651**1
               LENGTH=29,                                              X00652*14
               POS=(18,51)                                              00653*14
*                                                                       00654**1
         DFHMDF ATTRB=(PROT),                                          X00655**1
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00656**1
               COLOR=NEUTRAL,                                          X00657**1
               LENGTH=25,                                              X00658**1
               POS=(19,45)                                              00659**1
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00660**1
               COLOR=BLUE,                                             X00661**1
               PICOUT='ZZZ,ZZ9',                                       X00662**1
               LENGTH=7,                                               X00663**1
               POS=(19,72)                                              00664**1
*                                                                       00665**1
         DFHMSD TYPE=FINAL                                              00666**1
         END                                                            00667**1
