*          DATA SET POKM101                                                     
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*        MAPSET  POKM101                                            *           
*        MAP     PO101A                                             *           
*        PROGRAM POKCS101                                           *           
*        TRANSID W101                                               *           
*        SYSTEM  CICS ARCH - PO SET INQUIRY                         *           
*-------------------------------------------------------------------*           
POKM101 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TIOAPFX=YES,                                            X        
               TERM=3270-2                                                      
PO101A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='SHORT NAME..:',                                X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=13,                                              X        
               POS=(03,2)                                                       
ASHRTNM  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=5,                                               X        
               POS=(03,16)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='YEAR:',                                        X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=5,                                               X        
               POS=(03,24)                                                      
AYEAR    DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=4,                                               X        
               POS=(03,30)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TYPE.....:',                                   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=10,                                              X        
               POS=(03,43)                                                      
ASETTYP  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=3,                                               X        
               POS=(03,54)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='DIVERT PREFIX:',                               X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=14,                                              X        
               POS=(03,61)                                                      
ADIVERT  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=2,                                               X        
               POS=(03,76)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='LONG NAME...:',                                X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=13,                                              X        
               POS=(05,2)                                                       
ALONGNM  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=25,                                              X        
               POS=(05,16)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='TYPE DESC:',                                   X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=10,                                              X        
               POS=(05,43)                                                      
ATYPDSC  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=25,                                              X        
               POS=(05,54)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='LAST UPDATE.:',                                X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=14,                                              X        
               POS=(07,2)                                                       
AUPDT    DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,17)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='BY:',                                          X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=03,                                              X        
               POS=(07,26)                                                      
AUPDTBY  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=08,                                              X        
               POS=(07,30)                                                      
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='LOGISTICS RPT:',                               X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=14,                                              X        
               POS=(07,43)                                                      
ARPTIND  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=1,                                               X        
               POS=(07,58)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STORE SETUP COMPLETE BEGIN DATE:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(09,2)                                                       
ASBEGDT  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=8,                                               X        
               POS=(09,35)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='STORE SETUP COMPLETE END DATE..:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(11,2)                                                       
ASENDDT  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=8,                                               X        
               POS=(11,35)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='RELEASE TO STORE BEGIN DATE....:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(13,2)                                                       
ARBEGDT  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=8,                                               X        
               POS=(13,35)                                                      
*                                                                               
         DFHMDF ATTRB=(ASKIP),                                         X        
               INITIAL='RELEASE TO STORE END DATE......:',             X        
               COLOR=NEUTRAL,                                          X        
               LENGTH=32,                                              X        
               POS=(15,2)                                                       
ARENDDT  DFHMDF ATTRB=(ASKIP,NORM),                                    X        
               COLOR=BLUE,                                             X        
               LENGTH=8,                                               X        
               POS=(15,35)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
