*          DATA SET POKM109    AT LEVEL 017 AS OF 08/31/95                      
*          DATA SET POKM109    AT LEVEL 010 AS OF 01/31/95              00001**1
*          DATA SET POKM109    AT LEVEL 004 AS OF 09/23/93              00002**1
  PRINT  NOGEN                                                          00003**1
*-------------------------------------------------------------------*   00004**1
*                                                                   *   00005**1
*        MAPSET  POKM109                                            *   00006**1
*        MAP     PO109A                                             *   00007**1
*        PROGRAM POKCS109                                           *   00008**1
*        TRANSID W109                                               *   00009**1
*        SYSTEM  CICS ARCH - PO SELECTION LIST                      *   00010**1
*                                                                   *   00011**1
*-------------------------------------------------------------------*   00012**1
POKM109 DFHMSD TYPE=DSECT,                                             X00013**1
               LANG=COBOL,                                             X00014**1
               MODE=INOUT,                                             X00015**1
               STORAGE=AUTO,                                           X00016**1
               TIOAPFX=YES,                                            X00017**1
               TERM=3270-2                                              00018**1
PO109A  DFHMDI LINE=2,COLUMN=1,                                        X00019**1
               SIZE=(19,80),                                           X00020**1
               CTRL=(FREEKB),                                          X00021**1
               MAPATTS=(COLOR,HILIGHT),                                X00022**1
               DSATTS=(COLOR,HILIGHT)                                   00023**1
*                                                                       00024**1
         DFHMDF ATTRB=(PROT),                                          X00025**1
               INITIAL='ITEMS:',                                       X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               LENGTH=6,                                               X00028**1
               POS=(01,44)                                              00029**1
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00030**1
               COLOR=GREEN,                                            X00031**1
               HILIGHT=UNDERLINE,                                      X00032**1
               PICOUT='ZZZ,ZZ9',                                       X00033**1
               LENGTH=7,                                               X00034**1
               POS=(01,51)                                              00035**1
         DFHMDF ATTRB=(PROT),                                          X00036**1
               INITIAL='TO',                                           X00037**1
               COLOR=NEUTRAL,                                          X00038**1
               LENGTH=2,                                               X00039**1
               POS=(01,59)                                              00040**1
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00041**1
               COLOR=BLUE,                                             X00042**1
               PICOUT='ZZZ,ZZ9',                                       X00043**1
               LENGTH=7,                                               X00044**1
               POS=(01,62)                                              00045**1
         DFHMDF ATTRB=(PROT),                                          X00046**1
               INITIAL='OF',                                           X00047**1
               COLOR=NEUTRAL,                                          X00048**1
               LENGTH=2,                                               X00049**1
               POS=(01,70)                                              00050**1
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00051**1
               COLOR=BLUE,                                             X00052**1
               PICOUT='ZZZ,ZZ9',                                       X00053**1
               LENGTH=7,                                               X00054**1
               POS=(01,73)                                              00055**1
*                                                                       00056**1
         DFHMDF ATTRB=(ASKIP),                                         X00057**1
               INITIAL='PO NBR:',                                      X00058**1
               COLOR=NEUTRAL,                                          X00059**1
               LENGTH=7,                                               X00060**1
               POS=(02,01)                                              00061*10
APONUM   DFHMDF ATTRB=(ASKIP),                                         X00062**1
               COLOR=BLUE,                                             X00064**1
               PICOUT='ZZZZZZZZ',                                      X00053**1
               LENGTH=8,                                               X00065**9
               POS=(02,9)                                               00066*15
ADC1     DFHMDF ATTRB=(ASKIP),                                         X00057**1
               COLOR=BLUE,                                             X00058**1
               LENGTH=9,                                               X00060**1
               POS=(02,27)                                              00061*10
ADC2     DFHMDF ATTRB=(ASKIP),                                         X00057**1
               COLOR=BLUE,                                             X00058**1
               LENGTH=9,                                               X00060**1
               POS=(02,58)                                              00061*10
         DFHMDF ATTRB=(ASKIP),                                         X00057**1
               INITIAL='PACK',                                         X00058**1
               COLOR=NEUTRAL,                                          X00059**1
               LENGTH=4,                                               X00060**1
               POS=(03,06)                                              00061*10
AH1CO1   DFHMDF ATTRB=(ASKIP),                                         X00062**1
               INITIAL='ONORD       /     RECD',                       X        
               COLOR=NEUTRAL,                                          X00064**1
               LENGTH=22,                                              X00065**9
               POS=(03,15)                                              00066*15
AH1CO2   DFHMDF ATTRB=(ASKIP),                                         X00062**1
               INITIAL='ONORD       /     RECD',                       X        
               COLOR=NEUTRAL,                                          X00064**1
               LENGTH=22,                                              X00065**9
               POS=(03,49)                                              00066*15
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=4,                                               X00069*16
               POS=(03,76)                                              00070*16
*                                                                       00071**1
         DFHMDF ATTRB=(ASKIP),                                         X00072**1
               INITIAL='SEL   ID',                                     X00073*15
               COLOR=NEUTRAL,                                          X00074**1
               LENGTH=8,                                               X00075*15
               POS=(04,1)                                               00076**1
AH2CO1   DFHMDF ATTRB=(ASKIP),                                         X00077**1
               INITIAL='CRTNS /   UNITS  CRTNS /   UNITS',             X        
               COLOR=NEUTRAL,                                          X00079**1
               LENGTH=32,                                              X00080*12
               POS=(04,11)                                              00081*15
AH2CO2   DFHMDF ATTRB=(ASKIP),                                         X00077**1
               INITIAL='CRTNS /   UNITS  CRTNS /   UNITS',             X        
               COLOR=NEUTRAL,                                          X00079**1
               LENGTH=32,                                              X00080*12
               POS=(04,45)                                              00081*15
         DFHMDF ATTRB=(ASKIP),                                         X00082**2
               COLOR=NEUTRAL,                                          X00083**2
               LENGTH=2,                                               X00084*15
               POS=(04,78)                                              00085*15
*                                                                       00086**1
ASEL1    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(05,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(05,4)                                                       
APKID1   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(05,6)                                               00096*11
AD1LN1   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(05,11)                                              00100*14
AD2LN1   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(05,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(05,78)                                              00070*16
*                                                                               
ASEL2    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(06,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(06,4)                                                       
APKID2   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(06,6)                                               00096*11
AD1LN2   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(06,11)                                              00100*14
AD2LN2   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(06,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(06,78)                                              00070*16
*                                                                               
ASEL3    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(07,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(07,4)                                                       
APKID3   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(07,6)                                               00096*11
AD1LN3   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(07,11)                                              00100*14
AD2LN3   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(07,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(07,78)                                              00070*16
*                                                                               
ASEL4    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(08,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(08,4)                                                       
APKID4   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(08,6)                                               00096*11
AD1LN4   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(08,11)                                              00100*14
AD2LN4   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(08,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(08,78)                                              00070*16
*                                                                               
ASEL5    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(09,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(09,4)                                                       
APKID5   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(09,6)                                               00096*11
AD1LN5   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(09,11)                                              00100*14
AD2LN5   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(09,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(09,78)                                              00070*16
*                                                                               
ASEL6    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(10,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(10,4)                                                       
APKID6   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(10,6)                                               00096*11
AD1LN6   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(10,11)                                              00100*14
AD2LN6   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(10,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(10,78)                                              00070*16
*                                                                               
ASEL7    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(11,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(11,4)                                                       
APKID7   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(11,6)                                               00096*11
AD1LN7   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(11,11)                                              00100*14
AD2LN7   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(11,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(11,78)                                              00070*16
*                                                                               
ASEL8    DFHMDF ATTRB=(UNPROT,IC),                                     X00087**1
               COLOR=GREEN,                                            X00088**1
               HILIGHT=UNDERLINE,                                      X00089**1
               LENGTH=1,                                               X00090**1
               POS=(12,2)                                               00091**1
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=1,                                               X        
               POS=(12,4)                                                       
APKID8   DFHMDF ATTRB=(ASKIP),                                         X00092**1
               COLOR=BLUE,                                             X00093**1
               PICOUT='ZZZZ',                                          X00094**1
               LENGTH=4,                                               X00095**1
               POS=(12,6)                                               00096*11
AD1LN8   DFHMDF ATTRB=(ASKIP),                                         X00097**1
               COLOR=BLUE,                                             X00098**1
               LENGTH=32,                                              X00099**1
               POS=(12,11)                                              00100*14
AD2LN8   DFHMDF ATTRB=(ASKIP),                                         X00101**1
               COLOR=BLUE,                                             X00102**1
               LENGTH=32,                                              X00103**1
               POS=(12,45)                                              00104*14
         DFHMDF ATTRB=(ASKIP),                                         X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               LENGTH=2,                                               X00069*16
               POS=(12,78)                                              00070*16
*                                                                               
*SEL9    DFHMDF ATTRB=(UNPROT,IC),                                      00087**1
*              COLOR=GREEN,                                             00088**1
*              HILIGHT=UNDERLINE,                                       00089**1
*              LENGTH=1,                                                00090**1
*              POS=(13,2)                                               00091**1
*PKID9   DFHMDF ATTRB=(ASKIP),                                          00092**1
*              COLOR=BLUE,                                              00093**1
*              PICOUT='ZZZZ',                                           00094**1
*              LENGTH=4,                                                00095**1
*              POS=(13,5)                                               00096*11
*D1LN9   DFHMDF ATTRB=(ASKIP),                                          00097**1
*              COLOR=BLUE,                                              00098**1
*              LENGTH=32,                                               00099**1
*              POS=(13,11)                                              00100*14
*D2LN9   DFHMDF ATTRB=(ASKIP),                                          00101**1
*              COLOR=BLUE,                                              00102**1
*              LENGTH=32,                                               00103**1
*              POS=(13,45)                                              00104*14
*        DFHMDF ATTRB=(ASKIP),                                          00067**2
*              COLOR=NEUTRAL,                                           00068**2
*              LENGTH=2,                                                00069*16
*              POS=(13,78)                                              00070*16
*                                                                               
*SEL10   DFHMDF ATTRB=(UNPROT,IC),                                      00087**1
*              COLOR=GREEN,                                             00088**1
*              HILIGHT=UNDERLINE,                                       00089**1
*              LENGTH=1,                                                00090**1
*              POS=(14,2)                                               00091**1
*PKID10  DFHMDF ATTRB=(ASKIP),                                          00092**1
*              COLOR=BLUE,                                              00093**1
*              PICOUT='ZZZZ',                                           00094**1
*              LENGTH=4,                                                00095**1
*              POS=(14,5)                                               00096*11
*D1LN10  DFHMDF ATTRB=(ASKIP),                                          00097**1
*              COLOR=BLUE,                                              00098**1
*              LENGTH=32,                                               00099**1
*              POS=(14,11)                                              00100*14
*D2LN10  DFHMDF ATTRB=(ASKIP),                                          00101**1
*              COLOR=BLUE,                                              00102**1
*              LENGTH=32,                                               00103**1
*              POS=(14,45)                                              00104*14
*        DFHMDF ATTRB=(ASKIP),                                          00067**2
*              COLOR=NEUTRAL,                                           00068**2
*              LENGTH=2,                                                00069*16
*              POS=(14,78)                                              00070*16
*                                                                               
*SEL11   DFHMDF ATTRB=(UNPROT,IC),                                      00087**1
*              COLOR=GREEN,                                             00088**1
*              HILIGHT=UNDERLINE,                                       00089**1
*              LENGTH=1,                                                00090**1
*              POS=(15,2)                                               00091**1
*PKID11  DFHMDF ATTRB=(ASKIP),                                          00092**1
*              COLOR=BLUE,                                              00093**1
*              PICOUT='ZZZZ',                                           00094**1
*              LENGTH=4,                                                00095**1
*              POS=(15,5)                                               00096*11
*D1LN11  DFHMDF ATTRB=(ASKIP),                                          00097**1
*              COLOR=BLUE,                                              00098**1
*              LENGTH=32,                                               00099**1
*              POS=(15,11)                                              00100*14
*D2LN11  DFHMDF ATTRB=(ASKIP),                                          00101**1
*              COLOR=BLUE,                                              00102**1
*              LENGTH=32,                                               00103**1
*              POS=(15,45)                                              00104*14
*        DFHMDF ATTRB=(ASKIP),                                          00067**2
*              COLOR=NEUTRAL,                                           00068**2
*              LENGTH=2,                                                00069*16
*              POS=(15,78)                                              00070*16
*                                                                               
*SEL12   DFHMDF ATTRB=(UNPROT,IC),                                      00087**1
*              COLOR=GREEN,                                             00088**1
*              HILIGHT=UNDERLINE,                                       00089**1
*              LENGTH=1,                                                00090**1
*              POS=(16,2)                                               00091**1
*PKID12  DFHMDF ATTRB=(ASKIP),                                          00092**1
*              COLOR=BLUE,                                              00093**1
*              PICOUT='ZZZZ',                                           00094**1
*              LENGTH=4,                                                00095**1
*              POS=(16,5)                                               00096*11
*D1LN12  DFHMDF ATTRB=(ASKIP),                                          00097**1
*              COLOR=BLUE,                                              00098**1
*              LENGTH=32,                                               00099**1
*              POS=(16,11)                                              00100*14
*D2LN12  DFHMDF ATTRB=(ASKIP),                                          00101**1
*              COLOR=BLUE,                                              00102**1
*              LENGTH=32,                                               00103**1
*              POS=(16,45)                                              00104*14
*        DFHMDF ATTRB=(ASKIP),                                          00067**2
*              COLOR=NEUTRAL,                                           00068**2
*              LENGTH=2,                                                00069*16
*              POS=(16,78)                                              00070*16
*                                                                               
*SEL13   DFHMDF ATTRB=(UNPROT,IC),                                      00087**1
*              COLOR=GREEN,                                             00088**1
*              HILIGHT=UNDERLINE,                                       00089**1
*              LENGTH=1,                                                00090**1
*              POS=(17,2)                                               00091**1
*PKID13  DFHMDF ATTRB=(ASKIP),                                          00092**1
*              COLOR=BLUE,                                              00093**1
*              PICOUT='ZZZZ',                                           00094**1
*              LENGTH=4,                                                00095**1
*              POS=(17,5)                                               00096*11
*D1LN13  DFHMDF ATTRB=(ASKIP),                                          00097**1
*              COLOR=BLUE,                                              00098**1
*              LENGTH=32,                                               00099**1
*              POS=(17,11)                                              00100*14
*D2LN13  DFHMDF ATTRB=(ASKIP),                                          00101**1
*              COLOR=BLUE,                                              00102**1
*              LENGTH=32,                                               00103**1
*              POS=(17,45)                                              00104*14
*        DFHMDF ATTRB=(ASKIP),                                          00067**2
*              COLOR=NEUTRAL,                                           00068**2
*              LENGTH=2,                                                00069*16
*              POS=(17,78)                                              00070*16
*                                                                       00654**1
         DFHMDF ATTRB=(PROT),                                          X00655**1
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00656**1
               COLOR=NEUTRAL,                                          X00657**1
               LENGTH=25,                                              X00658**1
               POS=(19,45)                                              00659**1
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00660**1
               COLOR=BLUE,                                             X00661**1
               PICOUT='ZZZ,ZZ9',                                       X00662**1
               LENGTH=7,                                               X00663**1
               POS=(19,72)                                              00664**1
*                                                                       00665**1
         DFHMSD TYPE=FINAL                                              00666**1
         END                                                            00667**1
