000100*************************                                         00010064
000200 IDENTIFICATION DIVISION.                                         00020064
000300*************************                                         00030064
000400 PROGRAM-ID.      POKUT063.                                       00040064
000500 AUTHOR.          KAREN SCHOLEY.                                  00050064
000600 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00060064
000700 DATE-WRITTEN.    06/02/00.                                       00070064
000800 DATE-COMPILED.                                                   00080064
000900****************************************************************  00090064
001000* ELIMINATE NON QUALIFIED PO RECORDS FROM DB2 UNLOAD FILES.    *  00100064
001300****************************************************************  00110064
001210*---------------------------------------------------------------* 00111064
001220* DATE  01/09/2001, B. TYRIVER                                  * 00112064
001230*   WR21702 ADD UNION STATEMENT FOR SELECT STATEMENT IN         * 00113064
082500*   B020-QUALIFY-PO SO THAT WE ONLY PULL CANCELED PO'S THAT     * 00113164
001240*   HAVE RECEIPTS.                                              * 00113264
C88759* DATE  01/31/2018, COGNIZANT                                   * 00113376
C88759*   CHG0188759  ADD START DATE FOR DONT_SHIP_BEF_DTE FIELD IN   * 00113476
C88759*   DATE FILE.START DATE SHOULD BE '0001-01-01' FOR NEW         * 00113576
C88759*   GRAND OPENING.FOR RE-GRAND OPENINGS,START DATE WILL         * 00113676
C88759*   BE SHARED BY USER.                                          * 00113776
001250*---------------------------------------------------------------* 00113876
001400*                                                                 00113976
001500 ENVIRONMENT DIVISION.                                            00114076
001600*                                                                 00114176
001700*                                                                 00114276
001800 CONFIGURATION SECTION.                                           00114376
001900 SOURCE-COMPUTER. IBM-3090.                                       00114476
002000 OBJECT-COMPUTER. IBM-3090.                                       00114576
002100*                                                                 00115064
002200*                                                                 00116064
002300 INPUT-OUTPUT SECTION.                                            00117064
002400 FILE-CONTROL.                                                    00118064
002500                                                                  00119064
           SELECT DATE-FILE                                             00120064
               ASSIGN                       TO INP01.                   00130064
                                                                        00140064
002600     SELECT PO-FILE                                               00150064
002700         ASSIGN                       TO INP02.                   00160064
002800                                                                  00170064
002600     SELECT NEW-STORE-PO-FILE                                     00180064
002700         ASSIGN                       TO OUT01.                   00190064
002800                                                                  00200064
003200     EJECT                                                        00210064
003400*                                                                 00220064
003500*                                                                 00230064
003600***************                                                   00240064
003700 DATA DIVISION.                                                   00250064
003800***************                                                   00260064
004000*                                                                 00270064
004000*                                                                 00280064
004100 FILE SECTION.                                                    00290064
004200                                                                  00300064
004300 FD  DATE-FILE                                                    00310064
004400     RECORDING MODE F                                             00320064
004500     LABEL RECORDS ARE STANDARD                                   00330064
004600     RECORD CONTAINS 80 CHARACTERS                                00340064
004700     BLOCK CONTAINS 0 RECORDS                                     00350064
004800     DATA RECORD IS DATE-REC.                                     00360064
004900 01  DATE-REC                         PIC X(80).                  00370064
005000                                                                  00380064
004300 FD  PO-FILE                                                      00390064
004400     RECORDING MODE F                                             00400064
004500     LABEL RECORDS ARE STANDARD                                   00410064
004600     RECORD CONTAINS 19 CHARACTERS                                00420064
004700     BLOCK CONTAINS 0 RECORDS                                     00430064
004800     DATA RECORD IS PO-REC.                                       00440064
004900 01  PO-REC                           PIC X(19).                  00450064
005000                                                                  00460064
004300 FD  NEW-STORE-PO-FILE                                            00470064
004400     RECORDING MODE F                                             00480064
004500     LABEL RECORDS ARE STANDARD                                   00490064
004600     RECORD CONTAINS 49 CHARACTERS                                00500072
004700     BLOCK CONTAINS 0 RECORDS                                     00510064
004800     DATA RECORD IS NEW-STORE-PO-REC.                             00520064
004900 01  NEW-STORE-PO-REC                 PIC X(49).                  00530072
005000                                                                  00540064
006000     EJECT                                                        00550064
006100*                                                                 00560064
006200 WORKING-STORAGE SECTION.                                         00570064
006300*                                                                 00580064
       01  DATE-RECORD.                                                 00590064
          05  DATE-RECORD-DATE.                                         00600064
C88759      10 WS-START-DATE               PIC X(10)      VALUE SPACES. 00601076
C88759      10 FILLER                      PIC X(01)      VALUE SPACES. 00630076
C88759      10 WS-END-DATE                 PIC X(10)      VALUE SPACES. 00640076
C88759    05  FILLER                       PIC X(59)      VALUE SPACES. 00670076
                                                                        00680064
                                                                        00700064
       01  TEMP-CT                         PIC S9(5)      VALUE +0      00710064
                                                          COMP-3.       00720064
                                                                        00730064
007000 01 WS-PO-REC.                                                    00740064
007100     05  WS-PO-NBR                    PIC S9(9) COMP.             00750064
007400     05  WS-STR-NBR                   PIC S9(4) COMP.             00760064
007100     05  WS-PO-LNE-NBR                PIC S9(9) COMP.             00770064
007400     05  WS-STR-DISTRO-QTY            PIC S9(9) COMP.             00780064
007100     05  WS-CHAR5-ABBR-NAME           PIC X(5).                   00790064
                                                                        00800064
007000 01 WS-OUTPUT-REC.                                                00810064
007100     05  WS-OUT-PO-NBR                PIC S9(9) COMP.             00820064
007400     05  WS-OUT-STR-NBR               PIC S9(4) COMP.             00830064
007100     05  WS-OUT-PO-LNE-NBR            PIC S9(9) COMP.             00840064
007400     05  WS-OUT-STR-DISTRO-QTY        PIC S9(9) COMP.             00850064
007100     05  WS-OUT-CHAR5-ABBR-NAME       PIC X(5).                   00860064
           05  WS-OUT-SHIP-DATE             PIC X(10).                  00870064
           05  WS-OUT-CANCEL-DATE           PIC X(10).                  00880064
           05  WS-OUT-EXTEND-DATE           PIC X(10).                  00881070
                                                                        00890064
007700*                                                                 00900064
007700*                                                                 00910064
007800 01 PV-PROGRAM-VARIABLES.                                         00920064
007900     05  PV-PO-NUMBER                           PIC X(07).        00930064
008000     05  PV-PO-NUMBER-N REDEFINES PV-PO-NUMBER                    00940064
008100                                                PIC 9(07).        00950064
007100     05  PV-LAST-PO-NBR               PIC S9(9) COMP.             00960064
007100     05  PV-LAST-PO-LNE-NBR           PIC S9(9) COMP.             00970064
013200*                                                                 00980064
013300*                                                                 00990064
014000 01  PV-ABEND-CODE                    PIC S9(04)     VALUE +0     01000064
014100                                                     COMP SYNC.   01010064
014200     88  ABEND-4001-WRITE-ERROR                      VALUE +4001. 01020064
014300     88  ABEND-4002-READ-ERROR                       VALUE +4002. 01030064
014400     88  ABEND-4003-CTRL-CARD-ERROR                  VALUE +4003. 01040064
014500     88  ABEND-4004-TABLE-ERROR                      VALUE +4004. 01050064
014600     88  ABEND-4005-OPEN-ERROR                       VALUE +4005. 01060064
014700     88  ABEND-4006-CLOSE-ERROR                      VALUE +4006. 01070064
014800     88  ABEND-4007-SEQUENCE-ERROR                   VALUE +4007. 01080064
014900     88  ABEND-4008-DATA-ERROR                       VALUE +4008. 01090064
015000     88  ABEND-4009-KEY-DATA-ERROR                   VALUE +4009. 01100064
015300     88  ABEND-4013-DB2-ERROR                        VALUE +4013. 01110064
015400*                                                                 01120064
042900 01  PC-PROGRAM-CONSTANTS.                                        01130064
043100     05  PC-Y                         PIC X(01)      VALUE 'Y'.   01140064
043200     05  PC-N                         PIC X(01)      VALUE 'N'.   01150064
043800     05  PO-OK                        PIC X(01)      VALUE 'N'.   01160064
044300     05  PC-ROW-NOT-FOUND             PIC S9(04)     VALUE +100   01170064
044400                                                     COMP SYNC.   01180064
044500     05  PC-DUPLICATE-ROW             PIC S9(04)     VALUE -811   01190064
044600                                                     COMP SYNC.   01200064
044500     05  TPLNSHP-HIT                  PIC 9(09)     VALUE 0       01210064
044600                                                     COMP SYNC.   01220064
044500     05  TPLNSHP-NOHIT                PIC 9(09)     VALUE 0       01230064
044600                                                     COMP SYNC.   01240064
044500     05  TPURCHS-HIT                  PIC 9(09)     VALUE 0       01250064
044600                                                     COMP SYNC.   01260064
044500     05  TPURCHS-NOHIT                PIC 9(09)     VALUE 0       01270064
044600                                                     COMP SYNC.   01280064
044700*                                                                 01290064
044800 01  PS-PROGRAM-SWITCHES.                                         01300064
043800     05  PS-NEW-STORE-PO-SW           PIC X(01)      VALUE 'N'.   01310064
045600         88  NEW-STORE-PO                            VALUE 'Y'.   01320064
045600         88  NOT-NEW-STORE-PO                        VALUE 'N'.   01330064
043800     05  PS-LINE-ACTIVE-SW            PIC X(01)      VALUE 'N'.   01340064
045600         88  ACTIVE-PO-LNE                           VALUE 'Y'.   01350064
045600         88  NOT-ACTIVE-PO-LNE                       VALUE 'N'.   01360064
045700     05  PS-END-OF-PO-REC             PIC X(01)      VALUE 'N'.   01370064
045800         88  END-OF-PO-REC                           VALUE 'Y'.   01380064
           05  PS-END-OF-DATE-REC           PIC X(01)      VALUE 'N'.   01390064
               88  END-OF-DATE-REC                         VALUE 'Y'.   01400064
046210                                                                  01410064
047100*                                                                 01420064
047200 01  PV-PROGRAM-VARIABLES.                                        01430064
050400     05  PV-ABEND-PARAGRAPH           PIC X(30)      VALUE SPACES.01440064
050500*                                                                 01450064
052100*                                                                 01460064
052700* PLAN SHIP TABLE                                                 01470064
052800     EXEC SQL                                                     01480064
052900         INCLUDE TPLNSHP                                          01490064
053000     END-EXEC.                                                    01500064
054600*                                                                 01510064
054700* PURCHASE NUMBER TABLE.                                          01520064
054800     EXEC SQL                                                     01530064
054900         INCLUDE TPURCHS                                          01540064
055000     END-EXEC.                                                    01550064
054600*                                                                 01560064
054700* PO LINE ITEM TABLE.                                             01570064
054800     EXEC SQL                                                     01580064
054900         INCLUDE TPURITM                                          01590064
055000     END-EXEC.                                                    01600064
                                                                        01600164
054700* RECEIPT LINE ITEM TABLE.                                        01601064
054800     EXEC SQL                                                     01602064
054900         INCLUDE TRECITM                                          01603064
055000     END-EXEC.                                                    01604064
058700* DB2 COMMUNICATION AREA                                          01610064
058800*                                                                 01620064
058900     EXEC SQL                                                     01630064
059000         INCLUDE SQLCA                                            01640064
059100     END-EXEC.                                                    01650064
059200 EJECT                                                            01660064
059300* DB2 COMMUNICATION AREA2                                         01670064
059400*                                                                 01680064
059500     COPY SQLCA2.                                                 01690064
059600 EJECT                                                            01700064
059700*                                                                 01710064
067400*                                                                 01720064
071500****************************************************************  01730064
071600 PROCEDURE DIVISION.                                              01740064
071700****************************************************************  01750064
071800                                                                  01760064
071900****************************************************************  01770064
072000* A100-PROGRAM-MAINLINE - CONTROLS THE MAIN PROCESSING OF THE  *  01780064
072100* PROGRAM.                                                     *  01790064
072200****************************************************************  01800064
072300*                                                                 01810064
072400 A000-PROGRAM-MAINLINE.                                           01820064
072500                                                                  01830064
072600     PERFORM A100-INITIALIZATION.                                 01840064
072700                                                                  01850064
073800     PERFORM B000-PROCESS-INPUT                                   01860064
            UNTIL END-OF-PO-REC.                                        01870064
074400                                                                  01880064
074500     PERFORM Z100-END-ROUTINE.                                    01890064
074600                                                                  01900064
074700     GOBACK.                                                      01910064
074800                                                                  01920064
074900     EJECT                                                        01930064
075000*                                                                 01940064
075100****************************************************************  01950064
075200* A100-INITIALIZATION OPENS ALL FILES                          *  01960064
075400****************************************************************  01970064
075500 A100-INITIALIZATION.                                             01980064
075600                                                                  01990064
           OPEN INPUT  DATE-FILE                                        02000064
                       PO-FILE                                          02010064
                OUTPUT NEW-STORE-PO-FILE.                               02020064
                                                                        02030064
077400     READ DATE-FILE           INTO DATE-RECORD                    02040064
077500          AT END                                                  02050064
077600             MOVE PC-Y          TO  PS-END-OF-DATE-REC.           02060064
077700                                                                  02070064
077700                                                                  02090064
075400****************************************************************  02100064
       B000-PROCESS-INPUT.                                              02110064
                                                                        02120064
           READ PO-FILE                                                 02130064
             AT END                                                     02140064
              MOVE PC-Y          TO  PS-END-OF-PO-REC.                  02150064
                                                                        02160064
           IF END-OF-PO-REC                                             02170064
               CONTINUE                                                 02180064
           ELSE                                                         02190064
               MOVE PO-REC TO WS-PO-REC                                 02200064
               IF WS-PO-NBR = PV-LAST-PO-NBR                            02210064
                  IF NEW-STORE-PO                                       02220064
                    IF WS-PO-LNE-NBR = PV-LAST-PO-LNE-NBR               02230064
                       IF ACTIVE-PO-LNE                                 02240064
                           PERFORM B100-WRITE-OUTPUT                    02250064
                       END-IF                                           02260064
                    ELSE                                                02270064
                       MOVE WS-PO-LNE-NBR TO PV-LAST-PO-LNE-NBR         02280064
                       PERFORM B030-VERIFY-LINE-STATUS                  02290064
                       IF ACTIVE-PO-LNE                                 02300064
                          PERFORM B100-WRITE-OUTPUT                     02310064
                       END-IF                                           02320064
                    END-IF                                              02330064
                  END-IF                                                02340064
               ELSE                                                     02350064
                 MOVE WS-PO-NBR TO PV-LAST-PO-NBR                       02360064
                 MOVE WS-PO-LNE-NBR TO PV-LAST-PO-LNE-NBR               02370064
                 PERFORM B020-QUALIFY-PO                                02380064
                 IF (NEW-STORE-PO AND                                   02381064
                     ACTIVE-PO-LNE)                                     02382064
                   PERFORM B100-WRITE-OUTPUT                            02383064
                 ELSE                                                   02384064
                   DISPLAY WS-PO-NBR ' '                                02385064
                           WS-STR-NBR ' '                               02386064
                           WS-PO-LNE-NBR ' '                            02387064
                           WS-STR-DISTRO-QTY ' '                        02388064
                           WS-CHAR5-ABBR-NAME ' '                       02389064
                           'BYPASSED'                                   02390064
                 END-IF                                                 02400064
           END-IF.                                                      02410064
074400                                                                  02420064
081900***************************************************************** 02430064
082000* B020-QUALIFY-PO                                               * 02440064
082300***************************************************************** 02450064
082400*                                                                 02460064
082500 B020-QUALIFY-PO.                                                 02470064
                                                                        02480064
082700     MOVE 'B020-QUALIFY-PO'                                       02490064
082800                                 TO PV-ABEND-PARAGRAPH.           02500064
105200     EXEC SQL                                                     02510064
               SELECT B.PO_NBR                                          02520064
                     ,B.DONT_SHIP_BEF_DTE                               02530064
                     ,B.CAN_IFNOT_SHIP_DTE                              02540064
                     ,B.EXT_CAN_DTE                                     02541070
                  INTO :PLNSHP-PO-NBR                                   02550064
                      ,:PLNSHP-DONT-SHIP-BEF-DTE                        02560064
                      ,:PLNSHP-CAN-IFNOT-SHIP-DTE                       02570064
                      ,:PLNSHP-EXT-CAN-DTE                              02571070
                  FROM TPURCHS A                                        02580064
                      ,TPLNSHP B                                        02590064
105700           WHERE A.PO_NBR       = :WS-PO-NBR                      02600064
105700             AND A.PO_NBR       = B.PO_NBR                        02610064
                   AND A.STATUS_CDE IN ('AC', 'AP', 'CM')               02620064
105800             AND A.VER_STATUS_CDE = 'A'                           02630064
105800             AND B.VER_STATUS_CDE = 'A'                           02640064
C88759             AND DONT_SHIP_BEF_DTE BETWEEN :WS-START-DATE         02650076
C88759                      AND :WS-END-DATE                            02660076
               UNION                                                    02670064
               SELECT B.PO_NBR                                          02680064
                     ,B.DONT_SHIP_BEF_DTE                               02690064
                     ,B.CAN_IFNOT_SHIP_DTE                              02700064
                     ,B.EXT_CAN_DTE                                     02701070
                  INTO :PLNSHP-PO-NBR                                   02710064
                      ,:PLNSHP-DONT-SHIP-BEF-DTE                        02720064
                      ,:PLNSHP-CAN-IFNOT-SHIP-DTE                       02730064
                      ,:PLNSHP-EXT-CAN-DTE                              02730170
                  FROM TPURCHS A                                        02731064
                      ,TPLNSHP B                                        02732064
                      ,TRECITM C                                        02733064
105700           WHERE A.PO_NBR       = :WS-PO-NBR                      02734064
105700             AND A.PO_NBR       = B.PO_NBR                        02735064
105700             AND A.PO_NBR       = C.ORD_NBR                       02736064
                   AND A.STATUS_CDE IN ('CA')                           02737064
105800             AND A.VER_STATUS_CDE = 'A'                           02738064
105800             AND B.VER_STATUS_CDE = 'A'                           02739064
105800             AND C.VER_STATUS_CDE = 'A'                           02739164
C88759             AND DONT_SHIP_BEF_DTE BETWEEN :WS-START-DATE         02739276
C88759                      AND :WS-END-DATE                            02739376
106100     END-EXEC.                                                    02739564
106200*                                                                 02739664
085100     EVALUATE TRUE                                                02739764
085200       WHEN SQLCODE = ZEROS                                       02739864
085800         MOVE PC-Y TO  PS-NEW-STORE-PO-SW                         02739964
               PERFORM B030-VERIFY-LINE-STATUS                          02740064
085600       WHEN SQLCODE = PC-ROW-NOT-FOUND                            02741064
085800         MOVE PC-N TO  PS-NEW-STORE-PO-SW                         02750064
085900       WHEN OTHER                                                 02760064
086000         DISPLAY PV-ABEND-PARAGRAPH                               02770064
086100         PERFORM Z999-SQL-ERROR                                   02780064
086200     END-EVALUATE.                                                02790064
086300                                                                  02800064
088400     EJECT                                                        02810064
088500*                                                                 02820064
178300*                                                                 02830064
074400                                                                  02840064
164100*                                                                 02850064
081900***************************************************************** 02860064
082000* B030-VERIFY-LINE-STATUS                                       * 02870064
082300***************************************************************** 02880064
082400*                                                                 02890064
082500 B030-VERIFY-LINE-STATUS.                                         02900064
                                                                        02910064
082700     MOVE 'B030-VERIFY-LINE-STATUS'                               02920064
082800                                 TO PV-ABEND-PARAGRAPH.           02930064
105200     EXEC SQL                                                     02940064
               SELECT PO_NBR                                            02950064
                  INTO :PURITM-PO-NBR                                   02960064
                  FROM TPURITM                                          02970064
105700           WHERE PO_NBR       = :WS-PO-NBR                        02980064
105700             AND PO_LNE_NBR   = :WS-PO-LNE-NBR                    02990064
                   AND STATUS_CDE IN ('AC', 'AP', 'CM', 'CB', 'RV')     03000064
105800             AND VER_STATUS_CDE = 'A'                             03010064
             UNION                                                      03011064
               SELECT PO_NBR                                            03012064
                  INTO :PURITM-PO-NBR                                   03013064
                  FROM TPURITM A                                        03014064
                      ,TRECITM B                                        03014164
                 WHERE PO_NBR           = :WS-PO-NBR                    03015064
                   AND PO_LNE_NBR       = :WS-PO-LNE-NBR                03016064
                   AND PO_NBR           = ORD_NBR                       03016164
                   AND PO_LNE_NBR       = ORD_LNE_NBR                   03016264
                   AND A.STATUS_CDE       = 'CA'                        03017064
                   AND A.VER_STATUS_CDE = 'A'                           03018064
                   AND B.VER_STATUS_CDE = 'A'                           03019064
106100     END-EXEC.                                                    03021064
106200*                                                                 03030064
085100     EVALUATE TRUE                                                03040064
085200       WHEN SQLCODE = ZEROS                                       03050064
085300         MOVE PC-Y   TO PS-LINE-ACTIVE-SW                         03060064
085600       WHEN SQLCODE = PC-ROW-NOT-FOUND                            03070064
085800         MOVE PC-N TO  PS-LINE-ACTIVE-SW                          03080064
085900       WHEN OTHER                                                 03090064
086000         DISPLAY PV-ABEND-PARAGRAPH                               03100064
086100         PERFORM Z999-SQL-ERROR                                   03110064
086200     END-EVALUATE.                                                03120064
086300                                                                  03130064
088400     EJECT                                                        03140064
088500*                                                                 03150064
178300*                                                                 03160064
074400                                                                  03170064
197500***************************************************************** 03180064
197600* B100-WRITE-OUTPUT                                             * 03190064
197700*                                                               * 03200064
197800*                                                               * 03210064
197900***************************************************************** 03220064
198000                                                                  03230064
198100 B100-WRITE-OUTPUT.                                               03240064
           MOVE WS-PO-NBR         TO WS-OUT-PO-NBR.                     03250064
           MOVE WS-STR-NBR        TO WS-OUT-STR-NBR.                    03260064
           MOVE WS-PO-LNE-NBR     TO WS-OUT-PO-LNE-NBR.                 03270064
           MOVE WS-STR-DISTRO-QTY TO WS-OUT-STR-DISTRO-QTY.             03280064
           MOVE WS-CHAR5-ABBR-NAME TO WS-OUT-CHAR5-ABBR-NAME.           03290064
           MOVE PLNSHP-DONT-SHIP-BEF-DTE TO WS-OUT-SHIP-DATE.           03300064
           MOVE PLNSHP-CAN-IFNOT-SHIP-DTE TO WS-OUT-CANCEL-DATE.        03310064
           MOVE PLNSHP-EXT-CAN-DTE        TO WS-OUT-EXTEND-DATE.        03311070
           WRITE NEW-STORE-PO-REC FROM WS-OUTPUT-REC.                   03320064
197500***************************************************************** 03330064
197600* Z100-END-ROUTINE                                              * 03340064
197700*                                                               * 03350064
197800*                                                               * 03351064
197900***************************************************************** 03352064
198000                                                                  03353064
198100 Z100-END-ROUTINE.                                                03354064
199100     CLOSE DATE-FILE                                              03355064
                 PO-FILE                                                03356064
                 NEW-STORE-PO-FILE.                                     03357064
199500*                                                                 03358064
199600******************************************************************03359064
199700*     SQL WARNING OR ERROR PROCESSING                            *03360064
199800*                                                                *03370064
199900******************************************************************03380064
200000                                                                  03390064
200100 Z999-SQL-ERROR.                                                  03400064
200200*---------------                                                  03410064
200300                                                                  03420064
200400     MOVE SQLCODE    TO SQLCODE2.                                 03430064
200500     MOVE SQLERRD(3) TO SQLERRD3.                                 03440064
200600     DISPLAY '** ABEND **       ** = SQLERROR'.                   03450064
200700     DISPLAY '** PROGRAM        ** = POKUT063'.                   03460064
200800     DISPLAY '** SQLCODE        ** = ' SQLCODE2.                  03470064
200900     DISPLAY '** ROWS PROCESSED ** = ' SQLERRD3.                  03480064
201000     DISPLAY '** SQLERRM        ** = ' SQLERRM.                   03490064
201100     DISPLAY '** SQLERRMC       ** = ' SQLERRMC.                  03500064
201200     MOVE +4013 TO PV-ABEND-CODE.                                 03510064
201300     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         03520064
201400*                                                                 03530064
201500******************************************************************03540064
