00001 ***************************************************************** 09/29/94
00002 *    PO NEW STORE PURCHASE ORDER DATA                             PORD014 
00003 *                                                                    LV001
00004 *    LENGTH - 280 BYTES                                           PORD014 
00005 ******************************************************************PORD014 
047101 01  PO004-RECORD.                                                00000105
047102     05  PO004-GMM-NO                 PIC X(03).                  00000205
047103     05  PO004-GMM-NAME               PIC X(25).                  00000305
047104     05  PO004-DMM-NO                 PIC X(03).                  00000405
047105     05  PO004-DMM-NAME               PIC X(25).                  00000505
047106     05  PO004-BUYER-NO               PIC X(03).                  00000605
047107     05  PO004-BUYER-NAME             PIC X(25).                  00000705
047108     05  PO004-DEPT-NO                PIC X(03).                  00000805
047109     05  PO004-DEPT-DES               PIC X(25).                  00000905
           05  PO004-MAJOR-CLASS-NO         PIC X(02).                  00001005
           05  PO004-MAJOR-CLASS-DES        PIC X(25).                  00001005
047110     05  PO004-VENDOR-NAME            PIC X(31).                  00001105
047111     05  PO004-PO-NUMBER              PIC X(08).                  00001205
           05  PO004-PO-NUMBER-N REDEFINES PO004-PO-NUMBER                      
                                            PIC ZZZZZZZ9.                       
           05  PO004-PO-STATUS-CDE          PIC X(2).                           
047115     05  PO004-STORE-NBR              PIC S9(04) COMP.            00001505
           05  FILLER                       PIC X(01).                          
047116     05  PO004-STORE-NAME             PIC X(05).                  00001605
047117     05  PO004-ORDERED-RETAIL         PIC S9(9)V99 COMP-3.        00001705
047116     05  PO004-ORDERED-UNITS          PIC S9(07)   COMP-3.        00001805
047118     05  PO004-INPROCESS-RETAIL       PIC S9(9)V99 COMP-3.        00001905
047116     05  PO004-INPROCESS-UNITS        PIC S9(07)   COMP-3.        00002005
047119     05  PO004-INPROCESS-PCT          PIC 9(7).                   00002105
047118     05  PO004-VERIFIED-RETAIL        PIC S9(9)V99 COMP-3.        00002205
047116     05  PO004-VERIFIED-UNITS         PIC S9(07)   COMP-3.        00002305
047119     05  PO004-VERIFIED-PCT           PIC 9(7).                   00002405
047120     05  PO004-SHIP-DATE.                                         00002505
047126        10  PO004-SHIP-MO                PIC 9(02).               00002605
047127        10  PO004-SHIP-DY                PIC 9(02).               00002705
047128        10  PO004-SHIP-CCYY              PIC 9(04).               00002805
047129     05  PO004-CANCEL-DATE.                                       00002905
047130        10  PO004-CANCEL-MO              PIC 9(02).               00003005
047131        10  PO004-CANCEL-DY              PIC 9(02).               00004005
047132        10  PO004-CANCEL-CCYY            PIC 9(04).               00010005
047129     05  PO004-EXTEND-DATE.                                       00002905
047130        10  PO004-EXTEND-MO              PIC 9(02).               00003005
047131        10  PO004-EXTEND-DY              PIC 9(02).               00004005
047132        10  PO004-EXTEND-CCYY            PIC 9(04).               00010005
047116     05  PO004-INPROCESS-UNITS2       PIC S9(07)   COMP-3.        00002305
047116     05  PO004-ENROUTE-UNITS          PIC S9(07)   COMP-3.        00002305
           05  FILLER                          PIC X(16).                       
