00001 ******************************************************************05/22/95
00002 *                                                                 PORD003 
00003 *   EDI 855 PURCHASE ORDER ACKNOWLEDGEMENT RECORD                    LV007
00004 * NOTE: IF THIS COPYBOOK IS CHANGED, CORRESPONDING CHANGES        PORD003 
00005 *       MUST BE MADE IN PORD002.                                     CL**2
00006 ******************************************************************PORD003 
00007  01  PO003-EDI855-RECORD.                                         PORD003 
00008      05  PO003-EDI855-384-REC.                                    PORD003 
00009          10  PO003-DB-KEY.                                        PORD003 
00010              15  PO003-TP-DKEY                PIC S9(09) COMP.       CL**4
00011              15  PO003-TP-DKEY-TMST           PIC  X(26).            CL**4
00012              15  PO003-TRN-SET-SEQ-NBR        PIC S9(09) COMP.       CL**4
00013          10  PO003-EDI855-DATA                PIC  X(350).           CL**4
00014                                                                   PORD003 
00015          10  PO003-EDI855-HEADER-RECORD                              CL**4
00016              REDEFINES  PO003-EDI855-DATA.                           CL**4
00017              15  PO003-H-PO-NBR               PIC 9(09).             CL**4
00018              15  PO003-H-SORT-SEQ-NBR         PIC X(06).             CL**4
00019              15  PO003-H-PO-STATUS            PIC X(01).             CL**4
00020                  88  PO003-NEW-PO-GOOD              VALUE 'G'.       CL**4
00021                  88  PO003-NEW-PO-BAD               VALUE 'B'.       CL**4
00022                  88  PO003-DUPLICATE-PO             VALUE 'D'.       CL**4
00023              15  PO003-H-DEPT-NBR             PIC X(03).             CL**4
00024              15  PO003-H-DEPT-STATUS          PIC X(01).             CL**4
00025                  88  PO003-ONE-DEPT                 VALUE 'O'.       CL**4
00026                  88  PO003-MULTIPLE-DEPTS           VALUE 'M'.       CL**4
00027                  88  PO003-NO-DEPT                  VALUE 'N'.       CL**4
00028              15  PO003-H-LINE-STATUS          PIC X(01).             CL**4
00029                  88  PO003-GOOD-UPCS                VALUE 'G'.       CL**4
00030                  88  PO003-BAD-UPCS                 VALUE 'B'.       CL**4
00031              15  FILLER                       PIC X(17).             CL**4
00032              15  FILLER                       PIC X(01).             CL**4
00033                  88  PO003-HEADER-RECORD            VALUE '1'.       CL**4
JF0304             15  FILLER                       PIC X(02).             CL**4
JF0304             15  PO003-CANCEL-DATE            PIC X(06).             CL**4
00035              15  PO003-SHIP-DATE              PIC X(06).             CL**4
00036              15  PO003-H-INTERCHANGE.                                CL**4
00037                  20  PO003-H-INTERCHANGE-ID-QUAL  PIC X(02).         CL**4
00038                  20  PO003-H-INTERCHANGE-ID       PIC X(15).         CL**4
00039              15  FILLER                       PIC X(01).             CL**4
00040                  88  PO003-H-DTS                    VALUE 'Y'.       CL**4
00040              15  PO003-H-ISA-CNTL-NBR         PIC 9(09).             CL**4
00040              15  PO003-H-GS-CNTL-NBR          PIC 9(09).             CL**4
00040              15  PO003-H-ST-CNTL-NBR          PIC X(09).             CL**4
00040              15  PO003-H-TIMESTAMP            PIC X(26).             CL**4
00040              15  PO003-H-SESSION-NBR          PIC 9(06).             CL**4
00040              15  PO003-H-LC-IND               PIC X(02).             CL**4
                   15  PO003-H-PARENT-ENT-ID        PIC 9(10).                  
                   15  PO003-H-FACTORY-ENT-ID       PIC 9(10).                  
00041              15  FILLER                       PIC X(198).            CL**4
00042                                                                      CL**4
00043          10  PO003-EDI855-ITEM-RECORD                                CL**4
00044              REDEFINES  PO003-EDI855-DATA.                           CL**4
00045              15  PO003-I-PO-NBR               PIC 9(09).             CL**4
00046              15  PO003-I-SORT-SEQ-NBR         PIC X(06).             CL**4
00047              15  PO003-I-UPC                  PIC X(15).             CL**4
00048              15  PO003-I-SKU                  PIC X(08).             CL**4
00052              15  FILLER                       PIC X(01).             CL**4
00053                  88  PO003-ITEM-RECORD              VALUE '2'.       CL**4
00054              15  PO003-I-TOTAL-QTY            PIC S9(07).            CL**4
00055              15  PO003-I-UNIT-PRICE           PIC S9(12)V9(6).       CL**4
00056              15  FILLER                       PIC X(286).            CL**4
00057                                                                      CL**4
00058          10  PO003-EDI855-ALLOC-RECORD                               CL**4
00059              REDEFINES  PO003-EDI855-DATA.                           CL**4
00060              15  PO003-A-PO-NBR               PIC 9(09).             CL**4
00061              15  PO003-A-SORT-SEQ-NBR         PIC X(06).             CL**4
00062              15  FILLER                       PIC X(23).             CL**4
00063              15  FILLER                       PIC X(01).             CL**4
00064                  88  PO003-ALLOC-RECORD             VALUE '3'.       CL**4
00065              15  PO003-ITEM-ALLOC  OCCURS 10 TIMES.                  CL**4
00066                  20  PO003-A-STORE-NBR        PIC X(05).             CL**4
00067                  20  PO003-A-ALLOC-QTY        PIC S9(07).            CL**4
00068              15  FILLER                       PIC X(191).            CL**4
00069                                                                      CL**4
00070      05  PO003-UPD-DEL-DB-FLAG            PIC  X   VALUE 'N'.        CL**6
00071          88  UPDATE-DB-RECORD                      VALUE 'Y'.        CL**7
00072          88  NO-DB-ACTION                          VALUE 'N'.        CL**7
