      ******************************************************************        
      *  PORD018 - PO ON ORDER EXTRACT FILE.                                    
      *            THIS FILE WILL FEED THE DATA WAREHOUSE ON-ORDER PGMS         
      *            AND WILL ALSO FEED THE MAINFRAME ON-ORDER DB2 TABLES.        
      *                                                                         
      *  RECORD LENGTH - 104 BYTES.                                             
      *  CREATED: 08/12/98 - PATI GREEN                                         
      ******************************************************************        
                                                                                
       01  PO018-ONORD-EXTRACT-RECORD.                                          
           05  PO018-ONORD-ITEM-NBR           PIC   S9(15)V     COMP-3.         
           05  PO018-ONORD-WEEK-DATE          PIC   X(10).                      
           05  PO018-ONORD-IN-DC-DATE         PIC   X(10).                      
           05  PO018-ONORD-STORE-NBR          PIC  S9(04)       COMP.           
           05  FILLER                         PIC   X(01).                      
           05  PO018-ONORD-STATUS-CODE        PIC   X(02).                      
           05  PO018-ONORD-UNIT-QTY           PIC   S9(09)V     COMP-3.         
           05  PO018-ONORD-COST-AMT           PIC   S9(09)V9(2) COMP-3.         
           05  PO018-ONORD-RTL-AMT            PIC   S9(09)V9(2) COMP-3.         
           05  PO018-ONORD-PO-NBR             PIC   S9(09)V     COMP-3.         
           05  PO018-ONORD-BOUGHT-DATE        PIC   X(06).                      
           05  PO018-ONORD-PROMO-IND          PIC   X(01).                      
           05  PO018-ONORD-PROMO-QTY          PIC   S9(09)V     COMP-3.         
W24803     05  PO018-ONORD-SKU                PIC   S9(08)V     COMP-3.         
           05  PO018-ONORD-ENT-ID             PIC   S9(09)      COMP.           
           05  PO018-ONORD-GROUP-CODE         PIC   X(03).                      
           05  PO018-ONORD-LONG-VENDOR-STYLE  PIC   X(20).                      
           05  PO018-ONORD-PO-TYP-CDE         PIC   X(02).                      
W24803     05  PO018-ONORD-DEPT-NBR           PIC   X(03).                      
                                                                                
