00001 ******************************************************************        
00002 *                                                                         
00003 *   EDI 855 PURCHASE ORDER ACKNOWLEDGEMENT RECORD                         
00004 * NOTE: IF THIS COPYBOOK IS CHANGE, CORRESPONDING CHANGES MUST            
00005 *       BE MADE IN PORD003.                                               
00006 ******************************************************************        
00007  01  PO002-EDI855-RECORD              PIC X(350).                         
00008                                                                           
00009  01  PO002-EDI855-HEADER-RECORD  REDEFINES                                
                                       PO002-EDI855-RECORD.                     
00010      05  PO002-H-PO-NBR               PIC 9(09).                          
00011      05  PO002-H-SORT-SEQ-NBR         PIC X(06).                          
00012      05  PO002-H-PO-STATUS            PIC X(01).                          
00013          88  PO002-NEW-PO-GOOD                  VALUE 'G'.                
00014          88  PO002-NEW-PO-BAD                   VALUE 'B'.                
00015          88  PO002-DUPLICATE-PO                 VALUE 'D'.                
00016      05  PO002-H-DEPT-NBR             PIC X(03).                          
00017      05  PO002-H-DEPT-STATUS          PIC X(01).                          
00018          88  PO002-ONE-DEPT                     VALUE 'O'.                
00019          88  PO002-MULTIPLE-DEPTS               VALUE 'M'.                
00020          88  PO002-NO-DEPT                      VALUE 'N'.                
00021      05  PO002-H-LINE-STATUS          PIC X(01).                          
00022          88  PO002-GOOD-UPCS                    VALUE 'G'.                
00023          88  PO002-BAD-UPCS                     VALUE 'B'.                
00024      05  FILLER                       PIC X(17).                          
00025      05  FILLER                       PIC X(01).                          
00026          88  PO002-HEADER-RECORD                VALUE '1'.                
JF0304     05  FILLER                       PIC X(02).                          
JF0304     05  PO002-CANCEL-DATE            PIC X(06).                          
00028      05  PO002-SHIP-DATE              PIC X(06).                          
00029      05  PO002-H-INTERCHANGE.                                             
00030          10  PO002-H-INTERCHANGE-ID-QUAL  PIC X(02).                      
00031          10  PO002-H-INTERCHANGE-ID       PIC X(15).                      
00032      05  FILLER                       PIC X(01).                          
00033          88  PO002-H-DTS                        VALUE 'Y'.                
00033      05  PO002-H-ISA-CNTL-NBR         PIC 9(09).                          
00033      05  PO002-H-GS-CNTL-NBR          PIC 9(09).                          
00033      05  PO002-H-ST-CNTL-NBR          PIC X(09).                          
00033      05  PO002-H-TIMESTAMP            PIC X(26).                          
00033      05  PO002-H-SESSION-NBR          PIC 9(06).                          
00033      05  PO002-H-LC-IND               PIC X(02).                          
           05  PO002-H-PARENT-ENT-ID        PIC 9(10).                          
           05  PO002-H-FACTORY-ENT-ID       PIC 9(10).                          
00034      05  FILLER                       PIC X(198).                         
00035                                                                           
00036  01  PO002-EDI855-ITEM-RECORD  REDEFINES                                  
                                     PO002-EDI855-HEADER-RECORD.                
00037      05  PO002-I-PO-NBR               PIC 9(09).                          
00038      05  PO002-I-SORT-SEQ-NBR         PIC X(06).                          
00039      05  PO002-I-UPC                  PIC X(15).                          
00040      05  PO002-I-SKU.                                                     
00041          10  PO002-I-DEPT             PIC X(03).                          
00042          10  PO002-I-CLASS            PIC X(02).                          
00043          10  PO002-I-SEQ              PIC X(03).                          
00044      05  FILLER                       PIC X(01).                          
00045          88  PO002-ITEM-RECORD                  VALUE '2'.                
00046      05  PO002-I-TOTAL-QTY            PIC S9(07).                         
00047      05  PO002-I-UNIT-PRICE           PIC S9(12)V9(6).                    
00048      05  FILLER                       PIC X(286).                         
00049                                                                           
00050  01  PO002-EDI855-ALLOC-RECORD  REDEFINES                                 
                                      PO002-EDI855-ITEM-RECORD.                 
00051      05  PO002-A-PO-NBR               PIC 9(09).                          
00052      05  PO002-A-SORT-SEQ-NBR         PIC X(06).                          
           05  PO002-A-UPC                  PIC X(15).                          
           05  PO002-A-SKU                  PIC X(08).                          
00054      05  FILLER                       PIC X(01).                          
00055          88  PO002-ALLOC-RECORD                 VALUE '3'.                
00056      05  PO002-ITEM-ALLOC  OCCURS 10 TIMES.                               
00057          10  PO002-A-STORE-NBR        PIC X(05).                          
00058          10  PO002-A-ALLOC-QTY        PIC S9(07).                         
00059      05  FILLER                       PIC X(191).                         
