      ************************************************************              
      *    PORD023 - RESERVED FOR PO TO RMS BRIDGE PROCESS                      
      *                                                                         
      *    RECORD LENGTH -  80                                                  
      ************************************************************              
       01  PO023-RECORD.                                                        
           05  PO023-HCONN                 PIC S9(09) COMP.                     
           05  PO023-PQ-HANDLE             PIC S9(09) COMP.                     
           05  PO023-RQ-HANDLE             PIC S9(09) COMP.                     
           05  PO023-TRIGGER-DATA.                                              
               10  PO023-PO-NBR            PIC S9(09) COMP.                     
               10  PO023-TRIGGER-TYPE      PIC  X(01).                          
                   88  PO023-APPROVED-PO              VALUE 'A'.                
                   88  PO023-UPDATED-PO               VALUE 'U'.                
                   88  PO023-CONVERSION-PO            VALUE 'C'.                
                   88  PO023-PO-NOT-IN-RMS            VALUE 'N'.                
                   88  PO023-REBRIDGE                 VALUE 'R'.                
               10  FILLER                  PIC  X(32).                          
           05  PO023-COMPL-CODE            PIC S9(09) COMP.                     
           05  PO023-REASON                PIC S9(09) COMP.                     
           05  PO023-MESSAGE-CODE.                                              
               10  PO023-CONV-TYPE         PIC  X(01).                          
                   88  PO023-DETAIL-ONLY-CONV         VALUE 'D'.                
           05  PO023-DELETE-CODE.                                               
               10  PO023-DELETE-TYPE       PIC  X(01).                          
                   88  PO023-DELETE-ALL               VALUE 'A'.                
                   88  PO023-DELETE-INACTIVE          VALUE 'I'.                
                   88  PO023-DELETE-PO                VALUE 'O'.                
           05  PO023-ERROR-CODE.                                                
               10  PO023-ERROR-TYPE        PIC  X(01).                          
                   88  PO023-NO-ERROR                 VALUE ' '.                
                   88  PO023-DB2-FMT-ERROR            VALUE 'D'.                
                   88  PO023-MQ-ERROR                 VALUE 'M'.                
                   88  PO023-DB2-UPDT-ERROR           VALUE 'U'.                
                   88  PO023-EDIT-ERROR               VALUE 'E'.                
                   88  PO023-RV-STATUS-ERROR          VALUE 'R'.                
           05  PO023-LAST-UPD-TMST         PIC  X(16).                          
           05  PO023-LAST-UPD-ID           PIC  X(08).                          
