      ****************************************************************          
      * PORD033 - EDI 870 DOCUMENT - ORDER QUANTITY UPDATE FILE      *          
      * RECORD LENGTH - 200 BYTES                                    *          
      ****************************************************************          
                                                                                
       01  PO033-ORDER-QTY-UPDATE-RECORD.                                       
           05  PO033-PO-NUMBER                   PIC  9(08).                    
           05  PO033-DEPT-NUMBER                 PIC  X(03).                    
           05  PO033-PO-DATE.                                                   
               10  PO033-CCYY.                                                  
                   15  PO033-CC                  PIC  X(02).                    
                   15  PO033-YY                  PIC  X(02).                    
               10  PO033-MM                      PIC  X(02).                    
               10  PO033-DD                      PIC  X(02).                    
           05  PO033-SKU                         PIC  9(08).                    
           05  PO033-ITEM-UPC                    PIC  9(15).                    
           05  PO033-DC                          PIC  9(05).                    
           05  PO033-LOCATION                    PIC  9(05).                    
           05  PO033-QTY-ORDERED                 PIC S9(09).                    
           05  PO033-UOM                         PIC  X(02).                    
               88  PO033-EACHES                             VALUE 'EA'.         
           05  PO033-ACTION-CODE                 PIC  X(02).                    
               88  PO033-CANCEL-ITEM                        VALUE 'IC'.         
               88  PO033-REDUCE-QTY                         VALUE 'CP'.         
           05  PO033-QTY-ADJUSTED                PIC S9(09).                    
           05  PO033-VENDOR-OSR-REF              PIC  X(30).                    
           05  PO033-VENDOR-OSR-DATE             PIC  X(08).                    
           05  PO033-VENDOR-INTERNAL-NUMBER      PIC  X(30).                    
           05  PO033-ISA-CONTROL-NUMBER          PIC 9(9).                      
           05  PO033-870-REJECTION-REASONS.                                     
               10  PO033-PO-DOES-NOT-EXIST-SW    PIC  X(01).                    
                   88  PO033-PO-DOES-NOT-EXIST              VALUE 'Y'.          
               10  PO033-PO-NOT-ACTIVE-SW        PIC  X(01).                    
                   88  PO033-PO-NOT-ACTIVE                  VALUE 'Y'.          
               10  PO033-UNMATCHED-DEPT-SW       PIC  X(01).                    
                   88  PO033-UNMATCHED-DEPT                 VALUE 'Y'.          
               10  PO033-NON-VMI-PO-SW           PIC  X(01).                    
                   88  PO033-NON-VMI-PO                     VALUE 'Y'.          
               10  PO033-DTL-REJECTION-REASONS   PIC  X(02).                    
                   88  PO033-DTL-REJECTION                  VALUE               
                                                       '01' '02' '03'           
                                                       '04' '05' '06'           
                                                       '07' '08' '09'           
                                                       '99'.                    
                   88  PO033-INVALID-UPC                    VALUE '01'.         
                   88  PO033-INVALID-UPC-DEPT               VALUE '02'.         
                   88  PO033-SKU-NOT-ON-ORDER               VALUE '03'.         
                   88  PO033-DC-NOT-ON-ORDER-FOR-SKU        VALUE '04'.         
                   88  PO033-STORE-NOT-ON-ORDER             VALUE '05'.         
                   88  PO033-ADJUSTED-QTY-NEGATIVE          VALUE '06'.         
                   88  PO033-QTY-BEING-INCREASED            VALUE '07'.         
                   88  PO033-ADJUSTED-UNDER-RECEIPTS        VALUE '08'.         
                   88  PO033-SKU-CANCELLED                  VALUE '09'.         
                   88  PO033-TECHNICAL-ERROR                VALUE '99'.         
           05  FILLER                            PIC  X(43).                    
