00001 ******************************************************************10/26/93
00002 *    WORKING STORAGE USED TO FORMAT PAYMENT TERMS.                POWS020 
00003 *    LENGTH = 200 BYTES                                              LV007
00004 ******************************************************************POWS020 
00005  01 PO020-PAYMENT-TERMS.                                             CL**5
00006      10  PO020-EDIT-PAY-TERM-ID         PIC ZZ9     VALUE ZERO.      CL**6
00007      10  PO020-NUM-DISCOUNT-PCT         PIC 99V99   VALUE ZERO.      CL**2
00008      10  PO020-EDIT-DISCOUNT-PCT        PIC ZZ.99   VALUE SPACES.    CL**4
00009      10  PO020-EDIT-DISCOUNT-DAYS       PIC ZZZ     VALUE SPACES.    CL**4
00010      10  PO020-EDIT-DUE-DAYS            PIC ZZZ     VALUE SPACES.    CL**4
00011      10  PO020-PAYT-TERM-ID-DESC        PIC X(28)   VALUE SPACES.    CL**2
00012      10  PO020-PAYT-TERM-ID-DESC2       PIC X(35)   VALUE SPACES.    CL**7
00013      10  PO020-OTHER-TEXT               PIC X(28)   VALUE SPACES.    CL**3
00014                                                                   POWS020 
