00001 ******************************************************************10/08/93
00002 *    INTER-APPLICATION COMMUNICATION AREA FOR POKCS002 :          POWS013 
00003 *    PURCHASE ORDER SELECTION LIST PROGRAM                           LV002
00004 *    LENGTH = 200 BYTES                                              CL**2
00005 ******************************************************************   CL**2
00006          10  PO013-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00007                                         INTER-APPL-COMM-AREA.        CL**2
00008              15  FILLER                     PIC X.                   CL**2
00009              15  PO013-NUMBER-OF-SELECTED-ITEMS                      CL**2
00010                                             PIC S9(9) COMP-3.        CL**2
00011              15  PO013-NUMBER-OF-TS-ITEMS   PIC S9(5) COMP-3.        CL**2
00012              15  PO013-SEL-QUEUE-NAME       PIC X(8).                CL**2
00013              15  PO013-PO-NBR               PIC S9(9) COMP.          CL**2
00014              15  PO013-VENDOR-NAME          PIC X(30).               CL**2
00015              15  PO013-DEPT-NBR             PIC X(3).                CL**2
00016              15  PO013-PO-OTB               PIC X(4).                CL**2
00017              15  PO013-ENT-ID               PIC S9(9) COMP.          CL**2
00018              15  PO013-PO-LNE-NBR           PIC S9(9) COMP.          CL**2
00019              15  PO013-PO-LNE-VAR-NBR       PIC S9(9) COMP.          CL**2
      *IN POST APPROVAL THE PACKAGING CODE MAY BE FROM TPURCHS OR IT            
      *MAY BE SET BY POKCS140.                                                  
00008              15  PO013-PO-PKGNG-CDE         PIC X.                   CL**2
                   15  PO013-SEASET-DATA          PIC X(15).                    
                   15  PO013-PACKMODE-SW          PIC X(1).                     
                       88 PO013-IN-PACKMODE           VALUE 'Y'.                
                       88 PO013-NOT-IN-PACKMODE       VALUE ' '.                
                   15  PO013-FORMAT-IND-SW       PIC  X(1).                     
                       88  PO013-COME-FROM-PACKLIST  VALUE 'P'.                 
                       88  PO013-COME-FROM-ITEMLIST  VALUE 'I'.                 
