P41820*                                                                 06/01/94
P41820************************************************************      POWS004 
P41820*    POWS054 - RECEIPTS EXTRACT                                      LV001
P41820*                                                                 POWS004 
P41820*    RECORD LENGTH - 108 BYTES                                    POWS004 
P41820************************************************************      POWS004 
P41820 01  PO054-RECORD.                                                POWS004 
P41820     05  PO054-PO-NUMBER             PIC 9(08)     VALUE ZERO.    POWS004 
P41820     05  PO054-CLASS.                                             POWS004 
P41820         10  PO054-MAJ-CL            PIC 9(01)     VALUE ZERO.    POWS004 
P41820         10  PO054-MIN-CL            PIC 9(01)     VALUE ZERO.    POWS004 
P41820     05  PO054-DEPT                  PIC X(03)     VALUE SPACES.  POWS004 
P41820     05  PO054-VERIFIED-COUNT-DATE.                               POWS004 
P41820         10  PO054-MM                PIC X(02)     VALUE SPACES.  POWS004 
P41820         10  PO054-YY                PIC X(02)     VALUE SPACES.  POWS004 
P41820     05  PO054-RETAIL                PIC 9(11)V99  VALUE ZERO.    POWS004 
P41820     05  PO054-COST                  PIC 9(11)V99  VALUE ZERO.    POWS004 
P41820     05  PO054-UNITS                 PIC 9(11)V99  VALUE ZERO.    POWS004 
P41820     05  PO054-GMA                   PIC X(02)     VALUE SPACES.  POWS004 
P41820     05  PO054-DMA                   PIC X(02)     VALUE SPACES.  POWS004 
P41820     05  PO054-BYR                   PIC X(03)     VALUE SPACES.  POWS004 
P41820     05  PO054-VEND-KEY.                                          POWS004 
P41820         10  PO054-VEND-KEY-DEPT     PIC X(03)     VALUE SPACES.  POWS004 
P41820         10  PO054-VEND-KEY-NAME     PIC X(25)     VALUE SPACES.  POWS004 
P41820     05  PO054-PO-SHRT-CYC-IND       PIC X(01)     VALUE SPACES.  POWS004 
P41820     05  PO054-E-BUS-IND             PIC X(01)     VALUE SPACES.  POWS004 
P41820     05  PO054-PO-TYP-CDE            PIC X(02)     VALUE SPACES.  POWS004 
P41820     05  PO054-CRE-BY-UID            PIC X(08)     VALUE SPACES.          
P41820     05  FILLER                      PIC X(05)     VALUE SPACES.  POWS004 
