      ****************************************************************          
      * POWS091 OUTPUT RECORD LAYOUT.                                           
      ****************************************************************          
       01  POWS091-RECORD.                                                      
           05 PO091-TRANS-ID                  PIC 9(09) VALUE ZEROES.           
           05 PO091-SEQ                       PIC 9(09) VALUE ZEROES.           
           05 PO091-PRODUCT-NAME              PIC X(30) VALUE SPACES.           
           05 PO091-ORGANIZATION-NAME         PIC X(30) VALUE SPACES.           
           05 PO091-CALENDAR-NAME             PIC X(30) VALUE SPACES.           
           05 PO091-CURRECREG-DLR             PIC +9(6).99999.                  
           05 PO091-CURRECREG-CST             PIC +9(6).99999.                  
           05 PO091-CURRECFT-DLR              PIC +9(6).99999.                  
           05 PO091-CURRECFT-CST              PIC +9(6).99999.                  
           05 PO091-CURRECRPLN-DLR            PIC +9(6).99999.                  
           05 PO091-CURRECRPLN-CST            PIC +9(6).99999.                  
           05 PO091-EARLYRECREG-DLR           PIC +9(6).99999.                  
           05 PO091-EARLYRECREG-CST           PIC +9(6).99999.                  
           05 PO091-EARLYRECFT-DLR            PIC +9(6).99999.                  
           05 PO091-EARLYRECFT-CST            PIC +9(6).99999.                  
           05 PO091-EARLYRECRPLN-DLR          PIC +9(6).99999.                  
           05 PO091-EARLYRECRPLN-CST          PIC +9(6).99999.                  
           05 PO091-CURRECDS-DLR              PIC +9(6).99999.                  
           05 PO091-CURRECDS-CST              PIC +9(6).99999.                  
           05 FILLER                          PIC X(09).                        
