      ****************************************************************          
      * POWS090 OUTPUT RECORD LAYOUT.                                           
      ****************************************************************          
       01  POWS090-RECORD.                                                      
           05 PO090-TRANS-ID                  PIC 9(09) VALUE ZEROES.           
           05 PO090-SEQ                       PIC 9(09) VALUE ZEROES.           
           05 PO090-PRODUCT-NAME              PIC X(30) VALUE SPACES.           
           05 PO090-ORGANIZATION-NAME         PIC X(30) VALUE SPACES.           
           05 PO090-CALENDAR-NAME             PIC X(30) VALUE SPACES.           
           05 PO090-PASTDUEREG-DLR            PIC +9(6).99999.                  
           05 PO090-PASTDUEREG-CST            PIC +9(6).99999.                  
           05 PO090-PASTDUEFT-DLR             PIC +9(6).99999.                  
           05 PO090-PASTDUEFT-CST             PIC +9(6).99999.                  
           05 PO090-PASTDUERPLN-DLR           PIC +9(6).99999.                  
           05 PO090-PASTDUERPLN-CST           PIC +9(6).99999.                  
           05 PO090-CURWREG-DLR               PIC +9(6).99999.                  
           05 PO090-CURWREG-CST               PIC +9(6).99999.                  
           05 PO090-CURWFT-DLR                PIC +9(6).99999.                  
           05 PO090-CURWFT-CST                PIC +9(6).99999.                  
           05 PO090-CURWRPLN-DLR              PIC +9(6).99999.                  
           05 PO090-CURWRPLN-CST              PIC +9(6).99999.                  
           05 FILLER                          PIC X(35).                        
