00001 ******************************************************************10/08/93
00002 *    INTER-APPLICATION COMMUNICATION AREA FOR :                   POWS014 
00003 *    POKCS005 - VENDOR SELECTION LIST                                LV001
00004 *    LENGTH = 200 BYTES                                           POWS014 
00005 ******************************************************************POWS014 
00006          10  PO014-INTER-APPL-COMMAREA  REDEFINES                 POWS014 
00007                                         INTER-APPL-COMM-AREA.     POWS014 
00008              15  FILLER                    PIC X.                 POWS014 
00009              15  PO014-VENDOR-NAME         PIC X(30).             POWS014 
