000001*----------------------------------------------------------------*00000105
000002*                         POWS077                                *00000205
000003*                                                                *00000305
000004*   THIS IS TEMP STORAGE QUEUE RECORD LAYOUT USED IN THE         *00000405
000005*   PURCHASE ORDER SET MAINTENANCE AND INQUIRY PROGRAMS.         *00000505
000006*   CREATED IN: POKCS099                                         *00000605
000007*      USED IN: POKCS100  POKCS101                               *00000705
000008*   LENGTH = 305 BYTES                                           *00000805
000009*----------------------------------------------------------------*00000905
000010 01  PO077-SET-SEL-REC.                                           00001005
000011       05  PO077-SELECTED-ITEMS         PIC S9(05)  COMP-3        00001105
000012                                                    VALUE ZERO.   00001205
000013       05  PO077-MAX-ITEMS              PIC  9(02)  VALUE 20.     00001305
000014       05  PO077-SELECTED-ITEM-ARRAY.                             00001405
000015           10  FILLER                   OCCURS 20 TIMES           00001505
000016                                        INDEXED BY PO077-IDX.     00001605
000017               15  PO077-ITEM           PIC S9(09)  COMP-3.       00001705
000018               15  PO077-ACTION-SW      PIC  X(01).               00001805
000019                   88  PO077-INQ                    VALUE 'I'.    00001905
000020                   88  PO077-UPD                    VALUE 'U'.    00002005
000021                   88  PO077-DEL                    VALUE 'D'.    00002105
000022                   88  PO077-ERR                    VALUE 'E'.    00002205
000023               15  PO077-KEY-DATA.                                00002305
000024                   20  PO077-SHORT-NME  PIC  X(05).               00002405
000025                   20  PO077-YEAR       PIC  X(04).               00002505
