000100******************************************************************01/12/96
000200**                        POWS069                               **POWS067 
000300**                                                              **   LV002
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR THE       **   CL**2
000500**  SKU RECEIVER SCREEN. POKCS080.                              **   CL**2
000600**  LENGTH:  200 BYTES                                          **   CL**2
000700******************************************************************   CL**2
000800         10  PO069-INTER-APPL-COMMAREA  REDEFINES                    CL**2
000900             INTER-APPL-COMM-AREA.                                   CL**2
001000             15  FILLER                         PIC X(01).           CL**2
001100             15  PO069-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
001200                                                    COMP-3.          CL**2
001300             15  PO069-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**2
001400                                                    COMP-3.          CL**2
001500             15  PO069-SEL-QUEUE-NAME           PIC X(8).            CL**2
001600             15  FILLER                         PIC X(183).          CL**2
