00001 ******************************************************************02/03/94
00002 *    INTER-APPLICATION COMMUNICATION AREA FOR POKCS060 -          POWS060 
00003 *    PURCHASE ORDER DC SPLIT CREITERIA SPEC                          LV003
00004 *    LENGTH =  33 BYTES                                              CL**3
00005 ******************************************************************POWS060 
00006          10  PO060-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00007                                         INTER-APPL-COMM-AREA.     POWS060 
00008              15  FILLER                    PIC X.                 POWS060 
00009              15  PO060-DPT-NUMBER          PIC X(03).                CL**3
00010              15  PO060-DAYS-RELEASE        PIC 9(03).                CL**3
00011              15  PO060-STATUS              PIC X(1).                 CL**3
00012              15  PO060-DMM-NAME            PIC X(20).                CL**3
00013              15  PO060-PO-NUMBER           PIC S9(09) COMP.          CL**3
