      ******************************************************************00010000
      * COPYBOOK POWS056                                               *00020000
      ******************************************************************00030000
                                                                        00040000
      ******************************************************************00050000
      * THIS COPYBOOK MUST BE USED WITH POPD056. THE PURPOSE OF THIS   *00060000
      * COPYBOOK IS TO DEFINE FIELDS USED IN POPD056, BOTH AS INPUT    *00070000
      * AND AS OUTPUT.                                                 *00080000
      ******************************************************************00090000
                                                                        00100000
      ***************************************************************** 00110000
      * DB2 TABLE DCLGENS NEEDED FOR THIS PROGRAM.                      00120000
      ***************************************************************** 00130000
                                                                        00140000
      *---------------------------------------------------------------* 00150000
      * DB2 DCLGEN FOR THE PO ROLLOUT CONTROL TABLE POT_RMS_RLOUT_CTL * 00160000
      *---------------------------------------------------------------* 00170000
                                                                        00180000
           EXEC SQL                                                     00190000
              INCLUDE POT00006                                          00200000
           END-EXEC.                                                    00210000
                                                                        00220000
       01  PO056-PROGRAM-CONSTANTS.                                     00230000
           05  PO056-MAX-RETRIES           PIC S9(03) VALUE +4          00240000
                                                      COMP SYNC.        00250000
                                                                        00260000
       01  PO056-WORK-FIELDS.                                           00270000
           05  PO056-DEPT-NBR              PIC S9(4)V COMP-3 VALUE +0.  00280000
           05  PO056-CURRENT-DATE          PIC  X(10) VALUE SPACES.     00290000
           05  PO056-RETRY-COUNTER         PIC S9(04) VALUE +0          00300000
                                                      COMP SYNC.        00310000
           05  PO056-ERROR-AREA.                                        00320000
               10  PO056-ERROR-TYPE        PIC X(08)  VALUE SPACES.     00330000
                   88  PO056-NO-ERRORS                VALUE 'NO ERROR'. 00340000
                   88  PO056-ERRORS-FOUND             VALUE 'BAD SLCT'. 00350000
               10  PO056-SQLCODE           PIC S9(09) COMP-3.           00360000
               10  PO056-DB2-TABLE-NAME    PIC X(30) VALUE SPACES.      00370000
               10  PO056-PARAGRAPH         PIC X(60) VALUE SPACES.      00380000
               10  PO056-MESSAGE-TEXT      PIC X(79) VALUE SPACES.      00390000
                                                                        00400000
       01  PO056-SWITCHES.                                              00410000
           05 PO056-ENTRY-SYS-SW           PIC X(01) VALUE SPACES.      00420000
              88 PO056-ENTRY-IN-LEGACY               VALUE 'Y'.         00430000
              88 PO056-ENTRY-NOT-IN-LEGACY           VALUE 'N'.         00440000
