000100*----------------------------------------------------------------*02/02/96
000200*                         POWS070                                *POWS068 
000300*                                                                *   LV008
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *POWS068 
000500*   SKU RECEIVER SCREEN TO PASS THE RECEIVING INFORMATION.       *POWS068 
000700*----------------------------------------------------------------*POWS068 
000900 01  PO070-SKU-RECEIVER-REC.                                              
001000       05  PO070-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001100                                                    VALUE ZERO.           
001200       05  PO070-DEPT-NBR               PIC  X(03)  VALUE SPACES.         
W24803       05  PO070-MAJ-CL-NBR             PIC  X(02)  VALUE SPACES.         
001210       05  PO070-CLASS-NBR              PIC  X(02)  VALUE SPACES.         
W24803*      05  PO070-SKU-NBR                PIC  X(03)  VALUE SPACES.         
W24803       05  PO070-SKU-NBR                PIC  X(03)  VALUE SPACES.         
001230       05  PO070-STYLE                  PIC  X(20)  VALUE SPACES.         
001240       05  PO070-DESC                   PIC  X(30)  VALUE SPACES.         
001250       05  PO070-COLOR                  PIC  X(25)  VALUE SPACES.         
001260       05  PO070-VEND-NAME              PIC  X(30)  VALUE SPACES.         
001270       05  PO070-SIZE                   PIC  X(25)  VALUE SPACES.         
001300       05  PO070-MAX-ITEMS              PIC  9(02)  VALUE 10.             
001400       05  PO070-SELECTED-ITEM-ARRAY.                                     
001500           10  FILLER                   OCCURS 10 TIMES                   
001600                                        INDEXED BY PO070-IDX.             
001700               15  PO070-ITEM           PIC S9(09)  COMP-3.               
001800               15  PO070-ACTION-SW      PIC  X(01).                       
001900                   88  PO070-INQ                    VALUE 'I'.            
002000                   88  PO070-UPD                    VALUE 'U'.            
002100                   88  PO070-DEL                    VALUE 'D'.            
002200                   88  PO070-ERR                    VALUE 'E'.            
002300               15  PO070-KEY-DATA.                                        
002400                   20  PO070-PO-NBR       PIC 9(09) COMP-3.               
002500                   20  PO070-LINE         PIC 9(03) COMP-3.               
002600                   20  PO070-DC-LOC       PIC X(05).                      
002610                   20  PO070-SHIP-DTE     PIC X(08).                      
002700                   20  PO070-RECEIVED-DTE PIC X(08).                      
002800                   20  PO070-ORDER-QTY    PIC S9(06) COMP-3.              
002900                   20  PO070-RECEIVED-QTY PIC S9(06) COMP-3.              
003000                   20  PO070-PERCENT-REC  PIC S9(06)V9 COMP-3.            
003100       10  PO070-TOT-ORDER-QTY            PIC S9(09) COMP-3.              
003200       10  PO070-TOT-REC-ORDER-QTY        PIC S9(09) COMP-3.              
003300       10  PO070-TOT-PCT                  PIC S9(03)V9 COMP-3.            
