00001                                                                   05/03/94
00002  01  PO012-PO-SELECT-RECORD.                                      POWS012 
00003      05  PO012-SELECTED-ITEMS         PIC S9(5) VALUE ZERO           LV001
00004                                                 COMP-3.           POWS012 
00005      05  PO012-MAX-ITEMS              PIC 99    VALUE 20.         POWS012 
00006      05  PO012-SELECTED-ITEM-ARRAY.                               POWS012 
00007          10  FILLER                   OCCURS 20 TIMES             POWS012 
00008                                       INDEXED BY PO012-IDX.       POWS012 
00009              15  PO012-ITEM           PIC S9(9) COMP-3.           POWS012 
00010              15  PO012-ACTION-SW      PIC X.                      POWS012 
00011                  88  PO012-INQ                  VALUE 'I'.        POWS012 
00012                  88  PO012-UPD                  VALUE 'U'.        POWS012 
00013                  88  PO012-DEL                  VALUE 'D'.        POWS012 
00014                  88  PO012-ERR                  VALUE 'E'.        POWS012 
00015              15  PO012-KEY-DATA.                                  POWS012 
00016                  20  PO012-PO-NBR          PIC S9(09) COMP.       POWS012 
00017                  20  PO012-VENDOR-NAME     PIC X(30).             POWS012 
00018                  20  PO012-PO-TYPE         PIC XX.                POWS012 
00019                  20  PO012-STATUS          PIC X(20).             POWS012 
00020                  20  PO012-OTB             PIC X(4).              POWS012 
00021                  20  PO012-INSTR-NBR       PIC S9(09) COMP.       POWS012 
00022                  20  PO012-INSTR-RECIP-CDE PIC X(2).              POWS012 
00023                  20  PO012-PO-LNE-NBR      PIC S9(09) COMP.       POWS012 
00024                  20  PO012-DEPT-NBR        PIC XXX.               POWS012 
00025                  20  PO012-APP-PO-LNE-NBR  PIC S9(09) COMP.       POWS012 
00026                  20  PO012-PO-LNE-VAR-NBR  PIC S9(09) COMP.       POWS012 
00027                  20  PO012-PLAN-NBR        PIC S9(04) COMP.       POWS012 
                       20  PO012-PACK-ID         PIC S9(04) COMP.               
