00001 ******************************************************************09/28/94
00002 **                        POWS064                               **POWS064 
00003 **                                                              **   LV004
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **POWS064 
00005 **  RECEIPT AGING  CRITERIA SPECIFICATION.                      **POWS064 
00006 **  LENGTH:  200 BYTES                                          **POWS064 
00007 ******************************************************************POWS064 
00008          10  PO064-INTER-APPL-COMMAREA  REDEFINES                 POWS064 
00009              INTER-APPL-COMM-AREA.                                POWS064 
00010              15  FILLER                         PIC X(01).        POWS064 
00011              15  PO064-DMM-LNAME                PIC X(18).           CL**3
00012              15  PO064-DMM-FNAME                PIC X(12).           CL**3
00013              15  PO064-BUYER-LNAME              PIC X(18).           CL**3
00014              15  PO064-BUYER-FNAME              PIC X(12).           CL**3
00015              15  PO064-DEPT-NBR                 PIC X(03).           CL**3
00016              15  PO064-DAYS1                    PIC 9(03).           CL**4
00017              15  PO064-DAYS2                    PIC 9(03).           CL**4
00018              15  FILLER                         PIC X(130).          CL**4
