000100******************************************************************09/22/93
000200*    INTER-APPLICATION COMMUNICATION AREA FOR POKCS001 -          POWS011 
000300*    PURCHASE ORDER SELECTION CRITERIA PROGRAM AND                   LV013
000400*    POKCS004 - VENDOR SELECTION CRITERIA PROGRAM                    CL**7
000500*    LENGTH = 200 BYTES                                              CL**2
000600******************************************************************POWS011 
000100******************************************************************09/22/93
GH0407*                MODIFICATION                                     POWS011 
GH0407*    USERID     DATE     REASON                                      LV013
GH0407*    TKMAB56  04-07-2006 WK30473 - ADD LAST DC LOCATION NUMBER       CL**7
GH0407*                                  ADD LAST PROGRAM NAME             CL**7
GH0407*                                  ADD LAST PO LNE NBR               CL**7
GH0407******************************************************************POWS011 
000700         10  PO011-INTER-APPL-COMMAREA  REDEFINES                    CL**5
000800                                        INTER-APPL-COMM-AREA.     POWS011 
000900             15  FILLER                    PIC X.                 POWS011 
001000             15  PO011-PO-NBR              PIC S9(9) COMP.           CL**8
001100             15  PO011-VENDOR-NAME         PIC X(30).                CL**5
001200             15  PO011-DEPT-NBR            PIC X(3).                 CL**8
001300             15  PO011-STATUS-CDE          PIC X(2).                 CL**8
001400             15  PO011-PO-TYP-CDE          PIC X(2).                 CL*10
001500             15  PO011-OTB-PER-NBR-BEG     PIC X(4).                 CL*11
001600             15  PO011-OTB-PER-NBR-END     PIC X(4).                 CL*11
001700             15  PO011-INHOUSE-NBR         PIC S9(3) COMP-3.         CL**8
001800             15  PO011-PO-LNE-NBR          PIC S9(9) COMP.           CL*10
001900             15  PO011-PKGNG-CDE           PIC X(1).                      
                   15  PO011-PACKMODE-SW         PIC X(1).                      
                       88 PO011-IN-PACKMODE           VALUE 'Y'.                
                       88 PO011-NOT-IN-PACKMODE       VALUE ' '.                
GH0407             15  PO011-LAST-DC-LOC-NBR     PIC 9(3).                 CL*10
GH0407             15  PO011-LAST-PROGRAM        PIC X(08).                CL**5
GH0407             15  PO011-LAST-PO-LNE-NBR     PIC S9(9) COMP.           CL*10
GH0407             15  PO011-BLK-SUB             PIC S9(04) COMP SYNC.          
GH0407             15  PO011-ITEM-SUB            PIC S9(04) COMP SYNC.          
010000             15  PO011-BLOCK-NUMBER        PIC S9(04) COMP SYNC.          
