00001 ***************************************************************   01/03/89
00002 *    MASTER GIFT CERTIFICATE RECORD LAYOUT - OUTPUT               PSRD002O
00003 *                                                                    LV008
00004 ***************************************************************   PSRD002O
00005  01  PS002O-GIFT-RECORD.                                             CL**3
00006      05  PS002O-GIFT-NO            PIC X(5)      VALUE SPACES.       CL**3
00007      05  PS002O-STORE-NO           PIC X(4)      VALUE SPACES.       CL**3
00008      05  PS002O-OPERATOR           PIC S9(7)     VALUE ZEROES        CL**3
00009                                                  COMP-3.          PSRD002O
00010      05  PS002O-TRANSACTION        PIC S9(5)     VALUE ZEROES        CL**3
00011                                                  COMP-3.          PSRD002O
00012      05  PS002O-GIFT-DATE.                                           CL**3
00013          10  PS002O-MM             PIC X(2)      VALUE SPACES.       CL**3
00014          10  PS002O-DD             PIC X(2)      VALUE SPACES.       CL**3
00015          10  PS002O-YY             PIC X(2)      VALUE SPACES.       CL**3
00016      05  PS002O-GIFT-TIME          PIC S9(3)V99  VALUE ZEROES        CL**3
00017                                                  COMP-3.          PSRD002O
00018      05  PS002O-GIFT-TYPE          PIC X(2)      VALUE SPACES.       CL**6
00019          88  PS002O-REDEEM-TYPE-20               VALUE '20'.         CL**4
00020          88  PS002O-REDEEM-TYPE-21               VALUE '21'.         CL**4
00021          88  PS002O-REDEEM-TYPE-26               VALUE '26'.         CL**8
00022          88  PS002O-REDEEM-TYPE-27               VALUE '27'.         CL**4
00023          88  PS002O-REDEEM-TYPE-29               VALUE '29'.         CL**7
00024          88  PS002O-SALE-TYPE-01                 VALUE '01'.         CL**6
00025          88  PS002O-SALE-TYPE-03                 VALUE '03'.         CL**6
00026          88  PS002O-SALE-TYPE-06                 VALUE '06'.         CL**8
00027          88  PS002O-SALE-TYPE-07                 VALUE '07'.         CL**6
00028          88  PS002O-SALE-TYPE-09                 VALUE '09'.         CL**7
00029      05  PS002O-AMOUNT             PIC S9(5)V99  VALUE ZEROES        CL**3
00030                                                  COMP-3.          PSRD002O
00031      05  FILLER                    PIC X(25)     VALUE SPACES.       CL**2
