00001 ***************************************************************   12/29/88
00002 *    MASTER GIFT CERTIFICATE RECORD LAYOUT - INPUT                PSRD002I
00003 *                                                                    LV007
00004 ***************************************************************   PSRD002I
00005  01  PS002I-GIFT-RECORD.                                          PSRD002I
00006      05  PS002I-GIFT-NO            PIC X(5)      VALUE SPACES.    PSRD002I
00007      05  PS002I-STORE-NO           PIC X(4)      VALUE SPACES.    PSRD002I
00008      05  PS002I-OPERATOR           PIC S9(7)     VALUE ZEROES     PSRD002I
00009                                                  COMP-3.          PSRD002I
00010      05  PS002I-TRANSACTION        PIC S9(5)     VALUE ZEROES     PSRD002I
00011                                                  COMP-3.          PSRD002I
00012      05  PS002I-GIFT-DATE.                                        PSRD002I
00013          10  PS002I-MM             PIC X(2)      VALUE SPACES.    PSRD002I
00014          10  PS002I-DD             PIC X(2)      VALUE SPACES.    PSRD002I
00015          10  PS002I-YY             PIC X(2)      VALUE SPACES.    PSRD002I
00016      05  PS002I-GIFT-TIME          PIC S9(3)V99  VALUE ZEROES     PSRD002I
00017                                                  COMP-3.          PSRD002I
00018      05  PS002I-GIFT-TYPE          PIC X(2)      VALUE SPACES.       CL**5
00019          88  PS002I-REDEEM-TYPE-20               VALUE '20'.         CL**3
00020          88  PS002I-REDEEM-TYPE-21               VALUE '21'.         CL**3
00021          88  PS002I-REDEEM-TYPE-26               VALUE '26'.         CL**7
00022          88  PS002I-REDEEM-TYPE-27               VALUE '27'.         CL**3
00023          88  PS002I-REDEEM-TYPE-29               VALUE '29'.         CL**6
00024          88  PS002I-SALE-TYPE-01                 VALUE '01'.         CL**5
00025          88  PS002I-SALE-TYPE-03                 VALUE '03'.         CL**5
00026          88  PS002I-SALE-TYPE-06                 VALUE '06'.         CL**7
00027          88  PS002I-SALE-TYPE-07                 VALUE '07'.         CL**5
00028          88  PS002I-SALE-TYPE-09                 VALUE '09'.         CL**6
00029      05  PS002I-AMOUNT             PIC S9(5)V99  VALUE ZEROES     PSRD002I
00030                                                  COMP-3.          PSRD002I
00031      05  FILLER                    PIC X(25)     VALUE SPACES.       CL**2
