      ****************************************************************  00010001
      * PSWS010                                                         00020001
      ****************************************************************  00030001
206118* 08/20/18  CHG0206118  RENAMED FROM KDU1806 WHICH DID NOT        00040001
206118*                       MEET STANDARDS FOR MAINFRAME REFACTORING  00050001
      ****************************************************************  00060001
000100 01  D040-RECORD.                                                 00070000
000200     05  D040-CODE           PIC 9(01).                           00080000
000300         88  D040-VALID-CODE VALUE 2.                             00090000
000400     05  D040-STORENO        PIC 9(04).                           00100000
000500     05  D040-TERMINAL       PIC 9(04)        COMP-3.             00110000
000600     05  D040-TRANSNO        PIC 9(04)        COMP-3.             00120000
000700     05  D040-ITEMNO         PIC 9(04)        COMP-3.             00130000
000800     05  D040-OPERATOR       PIC 9(06)        COMP-3.             00140000
000900     05  D040-DATE           PIC 9(06).                           00150000
001000     05  D040-TIME           PIC 9(04)        COMP-3.             00160000
001100     05  D040-KOHLS-WK       PIC 9(02).                           00170000
001200     05  D040-SKU.                                                00180000
               10  FILLER          PIC 9(05).                           00190000
               10  D040-SEQNO      PIC 9(03).                           00200000
001800     05  D040-SALE-TYPE-2    PIC X(01).                           00210000
001900     05  D040-SALE-UNITS     PIC S9(05)       COMP-3.             00220000
002000     05  D040-SALE-AMT       PIC S9(05)V99    COMP-3.             00230000
002100     05  D040-SALE-TYPE      PIC 9(02).                           00240000
002200     05  D040-DIV            PIC 9(01).                           00250000
002300     05  D040-BUYER          PIC 9(02).                           00260000
002400     05  D040-DAY            PIC 9(01).                           00270000
002500     05  D040-SLS-CORR-CDE   PIC X(01).                           00280000
002600         88  D040-NORMAL-TRANS                VALUE ' '.          00290000
002700         88  D040-SALES-AUDIT-CORR            VALUE 'S'.          00300000
002800         88  D040-SYSTEM-LATE-CORR            VALUE 'L'.          00310000
002900     05  D040-REG-AMT        PIC S9(05)V99    COMP-3.             00320000
001300     05  D040-DEPT-CLASS     PIC 9(05).                           00330000
001400     05  D040-DEPT-CLASS-X REDEFINES D040-DEPT-CLASS.             00340000
001500         10  D040-DEPT       PIC 9(03).                           00350000
001600         10  D040-CLASS      PIC 9(02).                           00360000
           05  D040-MAJOR-CLASS    PIC 9(04).                           00370000
