000100******************************************************************00010001
000200*  KOHL'S P.O.S. SALES FILE (PSRD110I/O) CONSTANTS               *00020001
000300******************************************************************00030001
001010******************************************************************00031011
001020* HISTORY LOG:                                                   *00031217
001030* DATE       :09/05                                              *00031317
001040* MADE BY    :Carole McCammon                                    *00031417
001050* REQUEST #  :29309                                              *00031517
001060* CHANGE MADE:Add DEBIT CARD KOHLS to PS110-DEBIT-CARD-DESC.     *00031617
001010******************************************************************00031717
001070******************************************************************00031817
001020* HISTORY LOG:                                                   *00032011
001030* DATE       :12/01                                              *00033011
001040* MADE BY    :Gayle Haupt                                        *00034011
001050* REQUEST #  :23086                                              *00035011
001060* CHANGE MADE:Add debit card changes.                            *00036011
001070******************************************************************00037011
001070******************************************************************00100001
001020* HISTORY LOG:                                                   *00101016
001030* DATE       :03/01                                              *00102016
001040* MADE BY    :Lihua Liang                                        *00103016
001050* REQUEST #  :21208                                              *00104016
001060* CHANGE MADE:REPLACE QUAL CODE WITH TRAN TYPE CODE.             *00105016
001070******************************************************************00106016
001071******************************************************************00110001
001072* HISTORY LOG:                                                   *00120001
001073* DATE       :MAY 1999                                           *00130001
001074* MADE BY    :MATTHEW STIFF                                      *00140001
001075* REQUEST #  :COSA                                               *00150001
001076* CHANGE MADE:ADDED CONSTANTS FOR AMERICAN EXPRESS CREDIT CARD   *00160001
001077*             PREFIXES                                           *00170001
001078******************************************************************00180001
001079******************************************************************00190001
001080* HISTORY LOG:                                                   *00200001
001081* DATE       :01/98                                              *00210001
001082* MADE BY    :Scott Bartelt                                      *00220001
001083* REQUEST #  :IMPACT-PREVENT PARTIALS                            *00230001
001084* CHANGE MADE:The PS110-PARTIAL-TRANS-IND was added.             *00240001
001085******************************************************************00250001
001100                                                                  00260001
001200 01  PS110-RECORD-LENGTH.                                         00270001
001300     05  PS110-RL-TRANS-HEADER-LENGTH                             00280001
001400                                 PIC S9(4)    VALUE +230          00290001
001500                                              COMP SYNC.          00300001
001600     05  PS110-RL-LINE-ITEM-LENGTH                                00310001
001700                                 PIC S9(4)    VALUE +215          00320001
001800                                              COMP SYNC.          00330001
001900     05  PS110-RL-TENDER-ITEM-LENGTH                              00340001
002000                                 PIC S9(4)    VALUE +170          00350001
002100                                              COMP SYNC.          00360001
002200     05  PS110-RL-CLEARING-TOTAL-LENGTH                           00370001
002300                                 PIC S9(4)    VALUE +80           00380001
002400                                              COMP SYNC.          00390001
002500                                                                  00400001
002600 01  PS110-CONVERSION-DATES.                                      00410001
002700*                                                                 00420001
002800*  THE DATE ON WHICH CONVERSION TO HAVING THE AUTOMATED           00430001
002900*  MARKDOWN CANCELLATION PROCESS INCLUDED WITH ALL OTHER          00440001
003000*  OWNERSHIP ADJUSTMENT ACTIVITIES TOOK PLACE.                    00450001
003100*                                                                 00460001
003200     05  PS110-CD-MDC-GENER-SHIFT-DATE                            00470001
003300                                 PIC 9(8)     VALUE 99999999.     00480001
003400*                                                                 00490001
003500*  THE DATE ON WHICH CONVERSION TO HAVING GOLDSTAR MARKDOWNS      00500001
003600*  POSTED TO THE PROMOTIONAL CATEGORY RATHER THAN THE             00510001
003700*  REGISTER CATEGORY TOOK PLACE.                                  00520001
003800*                                                                 00530001
003900     05  PS110-CD-GOLDSTAR-PROMO-DATE                             00540001
004000                                 PIC 9(8)     VALUE 99999999.     00550001
004100                                                                  00560001
004200 01  PS110-DAY-OF-WEEK.                                           00570001
004300     05  PS110-DO-SUNDAY         PIC 9(1)     VALUE 1.            00580001
004400     05  PS110-DO-MONDAY         PIC 9(1)     VALUE 2.            00590001
004500     05  PS110-DO-TUESDAY        PIC 9(1)     VALUE 3.            00600001
004600     05  PS110-DO-WEDNESDAY      PIC 9(1)     VALUE 4.            00610001
004700     05  PS110-DO-THURSDAY       PIC 9(1)     VALUE 5.            00620001
004800     05  PS110-DO-FRIDAY         PIC 9(1)     VALUE 6.            00630001
004900     05  PS110-DO-SATURDAY       PIC 9(1)     VALUE 7.            00640001
005000                                                                  00650001
005100 01  PS110-TRAN-TYPE-CODE.                                        00660001
005200     05  PS110-TT-SALE           PIC X(2)     VALUE '01'.         00670001
005400     05  PS110-TT-ASSOC-SALE     PIC X(2)     VALUE '02'.         00680001
005500     05  PS110-TT-RETURN         PIC X(2)     VALUE '11'.         00690001
005600     05  PS110-TT-ASSOC-RETURN   PIC X(2)     VALUE '12'.         00700001
005800     05  PS110-TT-EVEN-EXCHANGE  PIC X(2)     VALUE '21'.         00710001
005900     05  PS110-TT-ASSOC-MIX-MODE PIC X(2)     VALUE '22'.         00720001
006000     05  PS110-TT-MIX-MODE       PIC X(2)     VALUE '23'.         00730001
006200     05  PS110-TT-PRICE-ADJ      PIC X(2)     VALUE '24'.         00740001
006300     05  PS110-TT-KOHLS-PAYMENT  PIC X(2)     VALUE '30'.         00750001
006500     05  PS110-TT-NSF-PAYMENT    PIC X(2)     VALUE '31'.         00760001
006600     05  PS110-TT-NO-SALE        PIC X(2)     VALUE '32'.         00770001
006700     05  PS110-TT-VOID-AFTER     PIC X(2)     VALUE '33'.         00780001
006800     05  PS110-TT-CHECK-CASHING  PIC X(2)     VALUE '34'.         00790001
006900     05  PS110-TT-CASHIER-OPEN   PIC X(2)     VALUE '42'.         00800003
007000     05  PS110-TT-CLERK-OPEN     PIC X(2)     VALUE '43'.         00810001
007100     05  PS110-TT-CLOSE          PIC X(2)     VALUE '44'.         00820001
007200     05  PS110-TT-TRANSMIT       PIC X(2)     VALUE '45'.         00830001
007300     05  PS110-TT-ITEM-INQUIRY   PIC X(2)     VALUE '46'.         00840001
007400     05  PS110-TT-READ-REPORT    PIC X(2)     VALUE '54'.         00850001
007500     05  PS110-TT-READ-RESET-RPT PIC X(2)     VALUE '64'.         00860001
007600     05  PS110-TT-REGISTER-LOAD  PIC X(2)     VALUE '77'.         00870001
007700     05  PS110-TT-TRNING-MODE-TOGGLE                              00880001
007800                                 PIC X(2)     VALUE '99'.         00890001
007801                                                                  00891005
007802 01  PS110-QUAL-CODE.                                             00892005
007803     05  PS110-QC-UNMATCH-HAND-VOID                               00893005
007804                                 PIC 9(2)     VALUE 00.           00894005
007805     05  PS110-QC-CASH-SALE      PIC 9(2)     VALUE 01.           00895005
007806     05  PS110-QC-EMPL-CASH-SALE PIC 9(2)     VALUE 02.           00896005
007807     05  PS110-QC-KOHLS-CHRG-SALE                                 00897005
007808                                 PIC 9(2)     VALUE 03.           00898005
007809     05  PS110-QC-KOHLS-PAYMENT  PIC 9(2)     VALUE 05.           00899005
007810     05  PS110-QC-BANK-CHRG-SALE PIC 9(2)     VALUE 07.           00899105
007811     05  PS110-QC-DSCVR-CHRG-SALE                                 00899205
007812                                 PIC 9(2)     VALUE 09.           00899305
007813     05  PS110-QC-NO-SALE        PIC 9(2)     VALUE 12.           00899405
007814     05  PS110-QC-HAND-VOID-REQUEST                               00899505
007815                                 PIC 9(2)     VALUE 13.           00899605
007816     05  PS110-QC-CHECK-CASHING  PIC 9(2)     VALUE 14.           00899705
007817     05  PS110-QC-DEBIT-CARD-SALE                                 00899806
007818                                 PIC 9(2)     VALUE 08.           00899906
007819     05  PS110-QC-CASH-RTN       PIC 9(2)     VALUE 20.           00900005
007820     05  PS110-QC-KOHLS-CHRG-RTN PIC 9(2)     VALUE 21.           00900105
007821     05  PS110-QC-EMPL-CASH-RTN  PIC 9(2)     VALUE 22.           00900205
007822     05  PS110-QC-BANK-CHRG-RTN  PIC 9(2)     VALUE 27.           00900305
007823     05  PS110-QC-DEBIT-CARD-RTN PIC 9(2)     VALUE 28.           00900408
007824     05  PS110-QC-DSCVR-CHRG-RTN PIC 9(2)     VALUE 29.           00900505
007825     05  PS110-QC-CASH-ADJ       PIC 9(2)     VALUE 30.           00900605
007826     05  PS110-QC-EVEN-EXCHANGE  PIC 9(2)     VALUE 31.           00900705
007827     05  PS110-QC-EMPL-CASH-ADJ  PIC 9(2)     VALUE 32.           00900805
007828     05  PS110-QC-KOHLS-CHRG-ADJ PIC 9(2)     VALUE 33.           00900905
007829     05  PS110-QC-BANK-CHRG-ADJ  PIC 9(2)     VALUE 37.           00901005
007830     05  PS110-QC-DEBIT-CARD-ADJ PIC 9(2)     VALUE 38.           00901106
007831     05  PS110-QC-DSCVR-CHRG-ADJ PIC 9(2)     VALUE 39.           00901205
007832     05  PS110-QC-REG-OPEN-CASHIER                                00901305
007833                                 PIC 9(2)     VALUE 42.           00901405
007900     05  PS110-QC-REG-OPEN-CLERK PIC 9(2)     VALUE 43.           00901505
008000     05  PS110-QC-REGISTER-CLOSE PIC 9(2)     VALUE 44.           00901605
008100     05  PS110-QC-UPLOAD-OFFLINE PIC 9(2)     VALUE 45.           00901705
008200     05  PS110-QC-REENTRY        PIC 9(2)     VALUE 45.           00901805
008300     05  PS110-QC-INQUIRY        PIC 9(2)     VALUE 46.           00901905
008400     05  PS110-QC-PROGRAMMING    PIC 9(2)     VALUE 47.           00902005
008500     05  PS110-QC-2152-ADDL-PROG PIC 9(2)     VALUE 57.           00902105
008600     05  PS110-QC-READ-REPORT    PIC 9(2)     VALUE 54.           00902205
008700     05  PS110-QC-READ-RESET-REPORT                               00902305
008800                                 PIC 9(2)     VALUE 64.           00902405
008900     05  PS110-QC-DOWNSTREAM-LOAD                                 00902505
009000                                 PIC 9(2)     VALUE 77.           00902605
009100     05  PS110-QC-PING-PONG-TEST PIC 9(2)     VALUE 98.           00902705
009200     05  PS110-QC-TRAINING       PIC 9(2)     VALUE 99.           00902805
009300                                                                  00902905
009310                                                                  00903001
009400 01  PS110-VOID-ABORT-IND.                                        00910001
009500     05  PS110-VA-VALID-TRANSACTION                               00920001
009600                                 PIC X(1)     VALUE SPACES.       00930001
009700     05  PS110-VA-NORMAL-VOID-TRANS                               00940001
009800                                 PIC X(1)     VALUE 'V'.          00950001
009900     05  PS110-VA-NORMAL-ABORT-TRANS                              00960001
010000                                 PIC X(1)     VALUE 'A'.          00970001
010100     05  PS110-VA-ABRTD-HAND-VOID-TRAN                            00980001
010200                                 PIC X(1)     VALUE 'I'.          00990001
010300     05  PS110-VA-ABRTD-THEN-VOID-TRAN                            01000001
010400                                 PIC X(1)     VALUE 'B'.          01010001
010500                                                                  01020001
010600 01  PS110-PARTIAL-TRANS-IND.                                     01030001
010700     05  PS110-PT-NOT-A-PARTIAL-TRANS                             01040001
010800                                 PIC X(1)     VALUE SPACES.       01050001
010900     05  PS110-PT-PART-MISS-60-03                                 01060001
011000                                 PIC X(1)     VALUE 'S'.          01070001
011100     05  PS110-PT-PART-MISS-TENDER                                01080001
011200                                 PIC X(1)     VALUE 'T'.          01090001
011300                                                                  01100001
011400 01  PS110-RECORD-TYPE.                                           01110001
011500     05  PS110-RT-TRANS-HEADER-RCD                                01120001
011600                                 PIC X(1)     VALUE '1'.          01130001
011700     05  PS110-RT-LINE-ITEM-RCD  PIC X(1)     VALUE '2'.          01140001
011800     05  PS110-RT-TENDER-RCD     PIC X(1)     VALUE '5'.          01150001
011900     05  PS110-RT-CLEARING-TOT-RCD                                01160001
012000                                 PIC X(1)     VALUE '9'.          01170001
012100                                                                  01180001
012200 01  PS110-ON-LN-OFF-LN-STATUS.                                   01190001
012300     05  PS110-OL-TRANS-RUNG-ON-LINE                              01200001
012400                                 PIC X(1)     VALUE '+'.          01210001
012500     05  PS110-OL-TRANS-RUNG-ON-OFFLINE                           01220001
012600                                 PIC X(1)     VALUE '-'.          01230001
012700                                                                  01240001
012800 01  PS110-TERMINAL-TYPE-CODE.                                    01250001
012900     05  PS110-TT-2152-TERMINAL  PIC X(2)     VALUE '32'.         01260001
013000     05  PS110-TT-7052-TERMINAL  PIC X(2)     VALUE '33'.         01270001
013100                                                                  01280001
013200 01  PS110-TRANS-STATUS-CODE.                                     01290001
013300     05  PS110-TS-NORMAL-TRANSACTION                              01300001
013400                                 PIC X(2)     VALUE '00'.         01310001
013500     05  PS110-TS-BITS-8-5.                                       01320001
013600         10  PS110-TS-INQUIRY    PIC X(1)     VALUE '1'.          01330001
013700         10  PS110-TS-PRICE-CKR  PIC X(1)     VALUE '2'.          01340001
013800         10  PS110-TS-INQUIRY-PRICE-CKR                           01350001
013900                                 PIC X(1)     VALUE '3'.          01360001
014000         10  PS110-TS-BIT7       PIC X(1)     VALUE '4'.          01370001
014100         10  PS110-TS-INQUIRY-BIT7                                01380001
014200                                 PIC X(1)     VALUE '5'.          01390001
014300         10  PS110-TS-PRICE-CKR-BIT7                              01400001
014400                                 PIC X(1)     VALUE '6'.          01410001
014500         10  PS110-TS-INQUIRY-PCKR-BIT7                           01420001
014600                                 PIC X(1)     VALUE '7'.          01430001
014700         10  PS110-TS-BIT8       PIC X(1)     VALUE '8'.          01440001
014800         10  PS110-TS-INQUIRY-BIT8                                01450001
014900                                 PIC X(1)     VALUE '9'.          01460001
015000         10  PS110-TS-PRICE-CKR-BIT8                              01470001
015100                                 PIC X(1)     VALUE 'A'.          01480001
015200         10  PS110-TS-INQUIRY-PCKR-BIT8                           01490001
015300                                 PIC X(1)     VALUE 'B'.          01500001
015400         10  PS110-TS-BIT7-BIT8  PIC X(1)     VALUE 'C'.          01510001
015500         10  PS110-TS-INQUIRY-BIT7-BIT8                           01520001
015600                                 PIC X(1)     VALUE 'D'.          01530001
015700         10  PS110-TS-PCKR-BIT7-BIT8                              01540001
015800                                 PIC X(1)     VALUE 'E'.          01550001
015900         10  PS110-TS-INQ-PCKR-BIT7-BIT8                          01560001
016000                                 PIC X(1)     VALUE 'F'.          01570001
016100     05  PS110-TS-BITS-4-1.                                       01580001
016200         10  PS110-TS-REENTRY    PIC X(1)     VALUE '1'.          01590001
016300         10  PS110-TS-DIAGNOSTIC PIC X(1)     VALUE '2'.          01600001
016400         10  PS110-TS-REENTRY-DIAGNOSTIC                          01610001
016500                                 PIC X(1)     VALUE '3'.          01620001
016600         10  PS110-TS-BIT3       PIC X(1)     VALUE '4'.          01630001
016700         10  PS110-TS-REENTRY-BIT3                                01640001
016800                                 PIC X(1)     VALUE '5'.          01650001
016900         10  PS110-TS-DIAGNOSTIC-BIT3                             01660001
017000                                 PIC X(1)     VALUE '6'.          01670001
017100         10  PS110-TS-REENTRY-DIAG-BIT3                           01680001
017200                                 PIC X(1)     VALUE '7'.          01690001
017300         10  PS110-TS-TRAINING   PIC X(1)     VALUE '8'.          01700001
017400         10  PS110-TS-REENTRY-TRAINING                            01710001
017500                                 PIC X(1)     VALUE '9'.          01720001
017600         10  PS110-TS-DIAGNOSTIC-TRAINING                         01730001
017700                                 PIC X(1)     VALUE 'A'.          01740001
017800         10  PS110-TS-REENTRY-DIAG-TRAINING                       01750001
017900                                 PIC X(1)     VALUE 'B'.          01760001
018000         10  PS110-TS-BIT3-TRAINING                               01770001
018100                                 PIC X(1)     VALUE 'C'.          01780001
018200         10  PS110-TS-REENTRY-BIT3-TRAINING                       01790001
018300                                 PIC X(1)     VALUE 'D'.          01800001
018400         10  PS110-TS-DIAG-BIT3-TRAINING                          01810001
018500                                 PIC X(1)     VALUE 'E'.          01820001
018600         10  PS110-TS-REENT-DIAG-BIT3-TRAIN                       01830001
018700                                 PIC X(1)     VALUE 'F'.          01840001
018800                                                                  01850001
018900 01  PS110-INVALID-STORE-IND.                                     01860001
019000     05  PS110-IS-INVALID-STORE  PIC X(1)     VALUE 'I'.          01870001
019100     05  PS110-IS-INV-STR-CNV-TO-VALID                            01880001
019200                                 PIC X(1)     VALUE 'C'.          01890001
019300     05  PS110-IS-NO-STORE-ERROR PIC X(1)     VALUE 'V'.          01900001
019400                                                                  01910001
019500 01  PS110-UNKNOWN-STORE-DISTRICT.                                01920001
019600     05  PS110-US-UNKNOWN-STORE-NAME                              01930001
019700                                 PIC X(10)    VALUE 'STR UNKNWN'. 01940001
019800     05  PS110-US-UNKNOWN-DISTRICT                                01950001
019900                                 PIC 9(4)     VALUE 9999.         01960012
020000                                                                  01970001
020100 01  PS110-CHARGE-ACCOUNT-NMBR.                                   01980001
020200     05  PS110-CA-VISA-PREFIX-LONG                                01990001
020300                                 PIC X(1)     VALUE '4'.          02000001
020400     05  PS110-CA-VISA-PREFIX-SHORT                               02010001
020500                                 PIC X(4)     VALUE '0004'.       02020001
020600     05  PS110-CA-MASTER-CARD-PREFIX                              02030001
020700                                 PIC X(1)     VALUE '5'.          02040001
020600     05  PS110-CA-DINERS-CARD-PREFIX                              02041013
020700                                 PIC X(4)     VALUE '0036'.       02042015
020800     05  PS110-CA-DISCOVER-PREFIX                                 02050001
020900                                 PIC X(1)     VALUE '6'.          02060001
021000     05  PS110-CA-OLD-KOHLS-PREFIX                                02070001
021100                                 PIC X(3)     VALUE '000'.        02080001
021200     05  PS110-CA-NEW-KOHLS-PREFIX                                02090001
021300                                 PIC X(3)     VALUE '019'.        02100001
021400     05  PS110-CA-KOHLS-PREFIX-START                              02110001
021500                                 PIC X(3)     VALUE '017'.        02120001
021600     05  PS110-CA-KOHLS-PREFIX-END                                02130001
021700                                 PIC X(3)     VALUE '999'.        02140002
021710     05  PS110-CA-AMEX-PREFIX-1  PIC X(3)     VALUE '034'.        02150001
021720     05  PS110-CA-AMEX-PREFIX-2  PIC X(3)     VALUE '037'.        02160001
021800                                                                  02170001
021900 01  PS110-CREDIT-AUTH-TYPE.                                      02180001
022000     05  PS110-CA-NO-AUTHORIZATION                                02190001
022100                                 PIC X(1)     VALUE SPACES.       02200001
022200     05  PS110-CA-ONLINE-APPROVAL                                 02210001
022300                                 PIC X(1)     VALUE 'A'.          02220001
022400     05  PS110-CA-ONLINE-FLOOR-LIMITS                             02230001
022500                                 PIC X(1)     VALUE 'N'.          02240001
022600     05  PS110-CA-OFFLINE-FLOOR-LIMITS                            02250001
022700                                 PIC X(1)     VALUE 'F'.          02260001
022800     05  PS110-CA-REFERRAL                                        02270001
022900                                 PIC X(1)     VALUE 'R'.          02280001
023000                                                                  02290001
023100 01  PS110-CA-CREDIT-AUTH-CODE-2.                                 02300001
023200     05  PS110-CA-APPROVAL       PIC X(1)     VALUE '0'.          02310001
023300     05  PS110-CA-SOFT-REFERRAL  PIC X(1)     VALUE '1'.          02320001
023400     05  PS110-CA-EDIT-ERROR     PIC X(1)     VALUE '2'.          02330001
023500     05  PS110-CA-HARD-DECLINE   PIC X(1)     VALUE '7'.          02340001
023600     05  PS110-CA-REQUIRE-CALL   PIC X(1)     VALUE '8'.          02350001
023700     05  PS110-CA-OFFLINE-REFERRAL                                02360001
023800                                 PIC X(1)     VALUE '9'.          02370001
023900     05  PS110-CA-DUMMY-ID       PIC X(1)     VALUE '3'.          02380001
024000     05  PS110-CA-DLR-FREQ-REFER PIC X(1)     VALUE '4'.          02390001
024100     05  PS110-CA-STORE-CNT-REFER                                 02400001
024200                                 PIC X(1)     VALUE '5'.          02410001
024300     05  PS110-CA-KOHLS-NEG-REFER                                 02420001
024400                                 PIC X(1)     VALUE '6'.          02430001
024500     05  PS110-CA-SCAN-NEG-REFER PIC X(1)     VALUE '8'.          02440001
024600     05  PS110-CA-NO-RFND-RESTRICT                                02450001
024700                                 PIC X(1)     VALUE '0'.          02460001
024800     05  PS110-CA-NO-MDSE-CARD-RFND                               02470001
024900                                 PIC X(1)     VALUE '3'.          02480001
025000     05  PS110-CA-NO-MAIL-CHECK-RFND                              02490001
025100                                 PIC X(1)     VALUE '8'.          02500001
025200                                                                  02510001
025300 01  PS110-ADJUSTMENT-TYPE.                                       02520001
025400     05  PS110-AT-NO-ADJUSTMENT  PIC X(1)     VALUE SPACE.        02530001
025500     05  PS110-AT-PRICE-ADJUSTMENT                                02540001
025600                                 PIC X(1)     VALUE 'P'.          02550001
025700     05  PS110-AT-EVEN-EXCHANGE  PIC X(1)     VALUE 'E'.          02560001
025800     05  PS110-AT-UNEVEN-EXCHANGE-SALE                            02570001
025900                                 PIC X(1)     VALUE 'S'.          02580001
026000     05  PS110-AT-UNEVEN-EXCHANGE-RETN                            02590001
026100                                 PIC X(1)     VALUE 'R'.          02600001
026200     05  PS110-AT-MERCH-CASH-CREDIT                               02610001
026300                                 PIC X(1)     VALUE 'M'.          02620001
026400                                                                  02630001
026500 01  PS110-ACCT-NMBR-ERROR-IND.                                   02640001
026600     05  PS110-AN-NO-ACCT-NMBR-ERROR                              02650001
026700                                 PIC X(1)     VALUE SPACE.        02660001
026800     05  PS110-AN-NON-NUM-ACCT-NMBR                               02670001
026900                                 PIC X(1)     VALUE '1'.          02680001
027000     05  PS110-AN-ACCT-NMBR-MISSING                               02690001
027100                                 PIC X(1)     VALUE '2'.          02700001
027200     05  PS110-AN-INV-ACCT-PREFIX                                 02710001
027300                                 PIC X(1)     VALUE '3'.          02720001
027400     05  PS110-AN-INV-ACCT-CHK-DIGIT                              02730001
027500                                 PIC X(1)     VALUE '4'.          02740001
027600                                                                  02750001
027700 01  PS110-CREDIT-AUTH-SOURCE.                                    02760001
027800     05  PS110-CA-AUTH-NOT-REQUIRED                               02770001
027900                                 PIC X(2)     VALUE SPACES.       02780001
028000     05  PS110-CA-AUTH-BY-REGISTER                                02790001
028100                                 PIC X(2)     VALUE SPACES.       02800001
028200     05  PS110-CA-AUTH-BY-ISP    PIC S9(4)    VALUE ZEROS         02810001
028300                                 COMP SYNC.                       02820001
028400     05  PS110-CA-AUTH-BY-KOHLS-HOST                              02830001
028500                                 PIC S9(4)    VALUE +1            02840001
028600                                 COMP SYNC.                       02850001
028700     05  PS110-CA-AUTH-BY-INTENDED-AUTH                           02860001
028800                                 PIC S9(4)    VALUE +2            02870001
028900                                 COMP SYNC.                       02880001
029000                                                                  02890001
029100 01  PS110-POS-ENTRY-MODE.                                        02900001
029200     05  PS110-PE-NOT-TIIF-PS2000                                 02910001
029300                                 PIC X(2)     VALUE SPACES.       02920001
029400     05  PS110-PE-NO-TERMINAL    PIC X(2)     VALUE '00'.         02930001
029500     05  PS110-PE-KEY-ENTERED    PIC X(2)     VALUE '01'.         02940001
029600     05  PS110-PE-MAG-STRIPE-READ                                 02950001
029700                                 PIC X(2)     VALUE '02'.         02960001
029800     05  PS110-PE-BAR-CODE-READ  PIC X(2)     VALUE '03'.         02970001
029900     05  PS110-PE-OCR-READ       PIC X(2)     VALUE '04'.         02980001
030000     05  PS110-PE-RESERVED       PIC X(2)     VALUE '05'.         02990001
030100     05  PS110-PE-TRACK-1-READ   PIC X(2)     VALUE '06'.         03000001
030200     05  PS110-PE-CMPL-TRACK-2-CAPT                               03010001
030300                                 PIC X(2)     VALUE '90'.         03020001
030400                                                                  03030001
030500 01  PS110-POS-CAP-LVL.                                           03040001
030600     05  PS110-PC-INITIAL-LVL    PIC S9(4)    VALUE +0            03050001
030700                                              COMP.               03060001
030800     05  PS110-PC-PS2000-PT-1-LVL                                 03070001
030900                                 PIC S9(4)    VALUE +1            03080001
031000                                              COMP.               03090001
031100     05  PS110-PC-PS2000-LVL     PIC S9(4)    VALUE +2            03100001
031200                                              COMP.               03110001
031300     05  PS110-PC-PHASE-1-LVL    PIC S9(4)    VALUE +3            03120001
031400                                              COMP.               03130001
031500                                                                  03140001
031600 01  PS110-LINE-ITEM-TYPE.                                        03150001
031700     05  PS110-LI-NORMAL-MDSE-RCD                                 03160001
031800                                 PIC X(1)     VALUE '1'.          03170001
031900     05  PS110-LI-NORMAL-LID-RCD                                  03180001
032000                                 PIC X(1)     VALUE '2'.          03190001
032100     05  PS110-LI-EMPLOYEE-DISC-RCD                               03200001
032200                                 PIC X(1)     VALUE '3'.          03210001
032300     05  PS110-LI-COUPON-MDSE-RCD                                 03220001
032400                                 PIC X(1)     VALUE '4'.          03230001
032500     05  PS110-LI-GOLDSTAR-LID-RCD                                03240001
032600                                 PIC X(1)     VALUE '5'.          03250001
032700     05  PS110-LI-TLCD-LID-RCD                                    03260001
032800                                 PIC X(1)     VALUE '6'.          03270001
032900     05  PS110-LI-GEN-MKDN-LID-RCD                                03280001
033000                                 PIC X(1)     VALUE '7'.          03290001
033100     05  PS110-LI-ADDL-MKDN-LID-RCD                               03300001
033200                                 PIC X(1)     VALUE '8'.          03310001
033300     05  PS110-LI-S-C-DISC-LID-RCD                                03320001
033400                                 PIC X(1)     VALUE '9'.          03330001
033500     05  PS110-LI-END-OF-DETAIL                                   03340001
033600                                 PIC X(1)     VALUE SPACES.       03350001
033700                                                                  03360001
033800 01  PS110-ITEM-MODIFIER.                                         03370001
033900     05  PS110-IM-BITS-8-5.                                       03380001
034000         10  PS110-IM-NON-EE-PLU-ON                               03390001
034100                                 PIC X(1)     VALUE '0'.          03400001
034200         10  PS110-IM-EVEN-EX-PLU-ON                              03410001
034300                                 PIC X(1)     VALUE '1'.          03420001
034400         10  PS110-IM-NON-EE-PLU-OFF                              03430001
034500                                 PIC X(1)     VALUE '2'.          03440001
034600         10  PS110-IM-EVEN-EX-PLU-OFF                             03450001
034700                                 PIC X(1)     VALUE '3'.          03460001
034800         10  PS110-IM-INQ        PIC X(1)     VALUE '4'.          03470001
034900         10  PS110-IM-EVEN-EX-PLU-ON-INQ                          03480001
035000                                 PIC X(1)     VALUE '5'.          03490001
035100         10  PS110-IM-NON-EE-PLU-OFF-INQ                          03500001
035200                                 PIC X(1)     VALUE '6'.          03510001
035300         10  PS110-IM-EVEN-EX-PLU-OFF-INQ                         03520001
035400                                 PIC X(1)     VALUE '7'.          03530001
035500         10  PS110-IM-BIT8       PIC X(1)     VALUE '8'.          03540001
035600         10  PS110-IM-EVEN-EX-PLU-ON-BIT8                         03550001
035700                                 PIC X(1)     VALUE '9'.          03560001
035800         10  PS110-IM-NON-EE-PLU-OFF-BIT8                         03570001
035900                                 PIC X(1)     VALUE 'A'.          03580001
036000         10  PS110-IM-EVEN-EX-PLU-OFF-BIT8                        03590001
036100                                 PIC X(1)     VALUE 'B'.          03600001
036200         10  PS110-IM-INQ-BIT8   PIC X(1)     VALUE 'C'.          03610001
036300         10  PS110-IM-EE-PLU-ON-INQ-BIT8                          03620001
036400                                 PIC X(1)     VALUE 'D'.          03630001
036500         10  PS110-IM-NON-EE-PLU-OFF-INQ-8                        03640001
036600                                 PIC X(1)     VALUE 'E'.          03650001
036700         10  PS110-IM-EE-PLU-OFF-INQ-BIT8                         03660001
036800                                 PIC X(1)     VALUE 'F'.          03670001
036900     05  PS110-IM-BITS-4-1.                                       03680001
037000         10  PS110-IM-SALE-TAXABLE                                03690001
037100                                 PIC X(1)     VALUE '0'.          03700001
037200         10  PS110-IM-RETN-TAXABLE                                03710001
037300                                 PIC X(1)     VALUE '1'.          03720001
037400         10  PS110-IM-SALE-NON-TAX                                03730001
037500                                 PIC X(1)     VALUE '2'.          03740001
037600         10  PS110-IM-RETN-NON-TAX                                03750001
037700                                 PIC X(1)     VALUE '3'.          03760001
037800         10  PS110-IM-SALE-TAXABLE-LIV                            03770001
037900                                 PIC X(1)     VALUE '4'.          03780001
038000         10  PS110-IM-RETN-TAXABLE-LIV                            03790001
038100                                 PIC X(1)     VALUE '5'.          03800001
038200         10  PS110-IM-SALE-NON-TAX-LIV                            03810001
038300                                 PIC X(1)     VALUE '6'.          03820001
038400         10  PS110-IM-RETN-NON-TAX-LIV                            03830001
038500                                 PIC X(1)     VALUE '7'.          03840001
038600         10  PS110-IM-SALE-TAXABLE-PADJ                           03850001
038700                                 PIC X(1)     VALUE '8'.          03860001
038800         10  PS110-IM-RETN-TAXABLE-PADJ                           03870001
038900                                 PIC X(1)     VALUE '9'.          03880001
039000         10  PS110-IM-SALE-NON-TAX-PADJ                           03890001
039100                                 PIC X(1)     VALUE 'A'.          03900001
039200         10  PS110-IM-RETN-NON-TAX-PADJ                           03910001
039300                                 PIC X(1)     VALUE 'B'.          03920001
039400         10  PS110-IM-SALE-TAXABLE-LIV-PADJ                       03930001
039500                                 PIC X(1)     VALUE 'C'.          03940001
039600         10  PS110-IM-RETN-TAXABLE-LIV-PADJ                       03950001
039700                                 PIC X(1)     VALUE 'D'.          03960001
039800         10  PS110-IM-SALE-NON-TAX-LIV-PADJ                       03970001
039900                                 PIC X(1)     VALUE 'E'.          03980001
040000         10  PS110-IM-RETN-NON-TAX-LIV-PADJ                       03990001
040100                                 PIC X(1)     VALUE 'F'.          04000001
040200                                                                  04010001
040300 01  PS110-MDSE-ID-SRC-TYPE-IND.                                  04020001
040400     05  PS110-MI-UNK-SCANNED-MDSE-ID                             04030001
040500                                 PIC X(1)     VALUE 'S'.          04040001
040600     05  PS110-MI-SCANNED-INTERNAL-UPC                            04050001
040700                                 PIC X(1)     VALUE 'X'.          04060001
040800     05  PS110-MI-SCANNED-VENDOR-UPC                              04070001
040900                                 PIC X(1)     VALUE 'Y'.          04080001
041000     05  PS110-MI-SCANNED-EAN    PIC X(1)     VALUE 'Z'.          04090001
041100     05  PS110-MI-UNK-KEYED-MDSE-ID                               04100001
041200                                 PIC X(1)     VALUE 'K'.          04110001
041300     05  PS110-MI-KEYED-ID-RSLV-BY-ISP                            04120001
041400                                 PIC X(1)     VALUE 'I'.          04130001
041500     05  PS110-MI-K6-UPC-E-NO-SYSN-CD                             04140001
041600                                 PIC X(1)     VALUE '0'.          04150001
041700     05  PS110-MI-K6-SKU         PIC X(1)     VALUE '1'.          04160001
041800     05  PS110-MI-K7-UPC-E-NO-CD PIC X(1)     VALUE '2'.          04170001
041900     05  PS110-MI-K7-UPC-E-NO-SYSN                                04180001
042000                                 PIC X(1)     VALUE '3'.          04190001
042100     05  PS110-MI-K7-SKU         PIC X(1)     VALUE '4'.          04200001
042200     05  PS110-MI-K8-SKU         PIC X(1)     VALUE '5'.          04210001
042300     05  PS110-MI-K8-DEPT-CLASS  PIC X(1)     VALUE '6'.          04220001
042400     05  PS110-MI-K8-UPC-E       PIC X(1)     VALUE '7'.          04230001
042500     05  PS110-MI-K8-EAN-8       PIC X(1)     VALUE '8'.          04240001
042600     05  PS110-MI-K10-UPC-A-NO-SYSN-CD                            04250001
042700                                 PIC X(1)     VALUE '9'.          04260001
042800     05  PS110-MI-K11-INT-UPC-NO-CD                               04270001
042900                                 PIC X(1)     VALUE 'A'.          04280001
043000     05  PS110-MI-K11-UPC-A-NO-SYSN                               04290001
043100                                 PIC X(1)     VALUE 'B'.          04300001
043200     05  PS110-MI-K11-UPC-A-NO-CD                                 04310001
043300                                 PIC X(1)     VALUE 'C'.          04320001
043400     05  PS110-MI-K12-UPC-A      PIC X(1)     VALUE 'D'.          04330001
043500     05  PS110-MI-K12-INT-UPC    PIC X(1)     VALUE 'E'.          04340001
043600     05  PS110-MI-K13-EAN-13     PIC X(1)     VALUE 'F'.          04350001
043700     05  PS110-MI-GENERATED-MDSE-ID                               04360001
043800                                 PIC X(1)     VALUE 'G'.          04370001
043900                                                                  04380001
044000 01  PS110-SKU-NUMBER.                                            04390001
044100     05  PS110-SN-TLCD-SKU-1     PIC 9(8)     VALUE 55555000.     04400001
044200     05  PS110-SN-TLCD-SKU-2     PIC 9(8)     VALUE 55555555.     04410001
044300     05  PS110-SN-TLCD-SKU-PERCENT                                04420001
044400                                 PIC 9(8)     VALUE 55555500.     04430001
044500     05  PS110-SN-TLCD-SKU-DOLLAR                                 04440001
044600                                 PIC 9(8)     VALUE 55555501.     04450001
044700     05  PS110-SN-SENIOR-DISC-SKU                                 04460001
044800                                 PIC 9(8)     VALUE 55555100.     04470001
044900     05  PS110-SN-COUPON-SKU     PIC 9(8)     VALUE 09920000.     04480001
045000     05  PS110-SN-GIFT-CERT-SKU  PIC 9(8)     VALUE 09920001.     04490001
045100     05  PS110-SN-MISC-DEPT-CLASS                                 04500001
045200                                 PIC 9(5)     VALUE 09910.        04510001
045300     05  PS110-SN-COUPON-DEPT-CLASS                               04520001
045400                                 PIC 9(5)     VALUE 09920.        04530001
045500     05  PS110-SN-KEYED-TAX-DEPT-CLASS                            04540001
045600                                 PIC 9(5)     VALUE 09970.        04550001
045700     05  PS110-SN-BS-SERVCS-DEPT-CLASS                            04560001
045800                                 PIC 9(5)     VALUE 14810.        04570001
045900     05  PS110-SN-BS-PRDCTS-DEPT-CLASS                            04580001
046000                                 PIC 9(5)     VALUE 14910.        04590001
046100     05  PS110-SN-TLCD-DEPT-CLASS                                 04600001
046200                                 PIC 9(5)     VALUE 55555.        04610001
046300     05  PS110-SN-SCN-PNLTY-DEPT-CLASS                            04620001
046400                                 PIC 9(5)     VALUE 80011.        04630001
046500     05  PS110-SN-MISC-DEPARTMENT                                 04640001
046600                                 PIC X(3)     VALUE '099'.        04650001
046700     05  PS110-SN-GIFT-CERT-DEPT PIC X(3)     VALUE '981'.        04660001
046800     05  PS110-SN-GIFT-CARD-DEPT PIC X(3)     VALUE '983'.        04670001
046900     05  PS110-SN-MISC-CLASS     PIC X(2)     VALUE '10'.         04680001
047000     05  PS110-SN-OVERRIDE-SEQ-NUMBER-1                           04690001
047100                                 PIC X(3)     VALUE '000'.        04700001
047200     05  PS110-SN-OVERRIDE-SEQ-NUMBER-2                           04710001
047300                                 PIC X(3)     VALUE '999'.        04720001
047400                                                                  04730001
047500 01  PS110-DEPT-CLASS-ERROR-IND.                                  04740001
047600     05  PS110-DC-DEPT-CLASS-VALID                                04750001
047700                                 PIC 9(1)     VALUE 0.            04760001
047800     05  PS110-DC-DEPT-MAX-RTL-WARNING                            04770001
047900                                 PIC 9(1)     VALUE 1.            04780001
048000     05  PS110-DC-DEPT-MIN-RTL-WARNING                            04790001
048100                                 PIC 9(1)     VALUE 2.            04800001
048200     05  PS110-DC-NO-DEPT-MAX-MIN-WARN                            04810001
048300                                 PIC 9(1)     VALUE 3.            04820001
048400     05  PS110-DC-MAX-DEPT-CLASS-WARN                             04830001
048500                                 PIC 9(1)     VALUE 3.            04840001
048600     05  PS110-DC-DEPT-VALID-CLASS-INV                            04850001
048700                                 PIC 9(1)     VALUE 4.            04860001
048800     05  PS110-DC-DEPT-INV-CLASS-INV                              04870001
048900                                 PIC 9(1)     VALUE 5.            04880001
049000     05  PS110-DC-INV-UPC-NO-DPT-CLS                              04890001
049100                                 PIC 9(1)     VALUE 6.            04900001
049200     05  PS110-DC-INV-GIFT-CERT-AMT                               04910001
049300                                 PIC 9(1)     VALUE 7.            04920001
049400     05  PS110-DC-INV-SALON-DPT-CLS                               04930001
049500                                 PIC 9(1)     VALUE 8.            04940001
049600                                                                  04950001
049700 01  PS110-UPC-SKU-ERROR-IND.                                     04960001
049800     05  PS110-US-UPC-SKU-VALID  PIC 9(1)     VALUE 0.            04970001
049900     05  PS110-US-OVERRIDE-UPC-SKU                                04980001
050000                                 PIC 9(1)     VALUE 1.            04990001
050100     05  PS110-US-NON-MDSE-UPC-SKU                                05000001
050200                                 PIC 9(1)     VALUE 2.            05010001
050300     05  PS110-US-UPC-SKU-INVALID                                 05020001
050400                                 PIC 9(1)     VALUE 3.            05030001
050500                                                                  05040001
050600 01  PS110-PRICE-SOURCE-IND.                                      05050001
050700     05  PS110-PS-ISP-PRICE      PIC X(1)     VALUE 'I'.          05060001
050800     05  PS110-PS-KEYED-PRICE    PIC X(1)     VALUE 'K'.          05070001
050900                                                                  05080001
051000 01  PS110-REGULAR-RETAIL-AMT.                                    05090001
051100     05  PS110-RR-NON-PLU-ITEM   PIC S9(7)V99 VALUE ZERO          05100001
051200                                 COMP-3.                          05110001
051300                                                                  05120001
051400 01  PS110-LIV-RESOLUTION-IND.                                    05130001
051500     05  PS110-LR-NORMAL-LINE-ITEM                                05140001
051600                                 PIC X(1)     VALUE '+'.          05150001
051700     05  PS110-LR-LINE-ITEM-VOID PIC X(1)     VALUE '-'.          05160001
051800     05  PS110-LR-RESLVD-LIV-ORIG-ITEM                            05170001
051900                                 PIC X(1)     VALUE 'R'.          05180001
052000     05  PS110-LR-RESLVD-LIV-VOID-ITEM                            05190001
052100                                 PIC X(1)     VALUE 'V'.          05200001
052200                                                                  05210001
052300 01  PS110-MDSE-ITEM-RVWD-4-ADJ.                                  05220001
052400     05  PS110-MI-MDSE-ITEM-FOUND                                 05230001
052500                                 PIC X(1)     VALUE 'Y'.          05240001
052600                                                                  05250001
052700 01  PS110-MDSEIT-STATUS-CODE.                                    05260001
052800     05  PS110-MS-NEW-STATUS     PIC 9(3)     VALUE 10            05270001
052900                                 COMP-3.                          05280001
053000     05  PS110-MS-ACTIVE-STATUS  PIC 9(3)     VALUE 20            05290001
053100                                 COMP-3.                          05300001
053200     05  PS110-MS-CLEARANCE-STATUS                                05310001
053300                                 PIC 9(3)     VALUE 30            05320001
053400                                 COMP-3.                          05330001
053500     05  PS110-MS-PROMOTIONAL-STATUS                              05340001
053600                                 PIC 9(3)     VALUE 40            05350001
053700                                 COMP-3.                          05360001
053800     05  PS110-MS-DISCONTINUED-STATUS                             05370001
053900                                 PIC 9(3)     VALUE 90            05380001
054000                                 COMP-3.                          05390001
054100     05  PS110-MS-RENUMBERED-STATUS                               05400001
054200                                 PIC 9(3)     VALUE 98            05410001
054300                                 COMP-3.                          05420001
054400                                                                  05430001
054500 01  PS110-MULT-PR-PT-IND.                                        05440001
054600     05  PS110-MP-MULT-PRICE-POINTS                               05450001
054700                                 PIC X(1)     VALUE 'Y'.          05460001
054800                                                                  05470001
054900 01  PS110-PRICE-DISCREP-IND.                                     05480001
055000     05  PS110-PD-PRICE-DISCREPANCY                               05490001
055100                                 PIC X(1)     VALUE 'Y'.          05500001
055200     05  PS110-PD-NO-PRICE-DISCREPANCY                            05510001
055300                                 PIC X(1)     VALUE 'N'.          05520001
055400                                                                  05530001
055500 01  PS110-ADDL-MD-MU-SRCE-IND.                                   05540001
055600     05  PS110-AM-NO-ADDL-MD-MU  PIC X(1)     VALUE ' '.          05550001
055700     05  PS110-AM-PROMO-MKDN     PIC X(1)     VALUE '1'.          05560001
055800     05  PS110-AM-PROMO-MKDN-CANCEL                               05570001
055900                                 PIC X(1)     VALUE '2'.          05580001
056000     05  PS110-AM-ADDL-GEN-MKDN  PIC X(1)     VALUE '3'.          05590001
056100     05  PS110-AM-ADDL-GEN-MKDN-CANCEL                            05600001
056200                                 PIC X(1)     VALUE '4'.          05610001
056300     05  PS110-AM-ADDL-GEN-MKUP  PIC X(1)     VALUE '5'.          05620001
056400     05  PS110-AM-ADDL-GEN-MKUP-CANCEL                            05630001
056500                                 PIC X(1)     VALUE '6'.          05640001
056600                                                                  05650001
056700 01  PS110-RETURN-REASON-CODE.                                    05660001
056800     05  PS110-RR-NON-RETURN     PIC X(2)     VALUE '  '.         05670001
056900     05  PS110-RR-DAMAGED-MDSE   PIC X(2)     VALUE '01'.         05680001
057000     05  PS110-RR-WRONG-SIZE     PIC X(2)     VALUE '02'.         05690001
057100     05  PS110-RR-WRONG-COLOR    PIC X(2)     VALUE '03'.         05700001
057200     05  PS110-RR-COMP-PRICE-PROD                                 05710001
057300                                 PIC X(2)     VALUE '04'.         05720001
057400     05  PS110-RR-GIFT-DUP-DNW   PIC X(2)     VALUE '05'.         05730001
057500     05  PS110-RR-PRICE-ADJ      PIC X(2)     VALUE '98'.         05740001
057600     05  PS110-RR-OTHER          PIC X(2)     VALUE '99'.         05750001
057700                                                                  05760001
057800 01  PS110-OWNERSHIP-IND.                                         05770001
057900     05  PS110-OI-KOHLS-OWNED    PIC X(1)     VALUE 'K'.          05780001
058000     05  PS110-OI-NON-OWNED      PIC X(1)     VALUE 'N'.          05790001
058100     05  PS110-OI-NON-OWNED-OR-TRKD                               05800001
058200                                 PIC X(1)     VALUE 'T'.          05810001
058300                                                                  05820001
058400 01  PS110-MARKDOWN-REASON-CODE.                                  05830001
058500     05  PS110-MR-SIGNING-ERROR  PIC S9(3)    VALUE +701          05840001
058600                                              COMP-3.             05850001
058700     05  PS110-MR-PLU-ERROR      PIC S9(3)    VALUE +702          05860001
058800                                              COMP-3.             05870001
058900     05  PS110-MR-DAMAGED-MDSE   PIC S9(3)    VALUE +703          05880001
059000                                              COMP-3.             05890001
059100     05  PS110-MR-GIFT-W-PURCH   PIC S9(3)    VALUE +704          05900001
059200                                              COMP-3.             05910001
059300     05  PS110-MR-INV-UPC-MKDN   PIC S9(3)    VALUE +705          05920001
059400                                              COMP-3.             05930001
059500     05  PS110-MR-RAINCHECK      PIC S9(3)    VALUE +706          05940001
059600                                              COMP-3.             05950001
059700     05  PS110-MR-COMPETITIVE    PIC S9(3)    VALUE +707          05960001
059800                                              COMP-3.             05970001
059900     05  PS110-MR-SPECIAL-PROMO  PIC S9(3)    VALUE +708          05980001
060000                                              COMP-3.             05990001
060100     05  PS110-MR-YES-WE-CAN     PIC S9(3)    VALUE +709          06000001
060200                                              COMP-3.             06010001
060300     05  PS110-MR-SR-CITIZEN-DISC                                 06020001
060400                                 PIC S9(3)    VALUE +728          06030001
060500                                              COMP-3.             06040001
060600     05  PS110-MR-KOHLS-CHRG-DISC                                 06050001
060700                                 PIC S9(3)    VALUE +733          06060001
060800                                              COMP-3.             06070001
060900     05  PS110-MR-TRANS-LVL-DISC PIC S9(3)    VALUE +734          06080001
061000                                              COMP-3.             06090001
061100     05  PS110-MR-PROMOTIONAL    PIC S9(3)    VALUE +746          06100001
061200                                              COMP-3.             06110001
061300     05  PS110-MR-GOLDSTAR       PIC S9(3)    VALUE +753          06120001
061400                                              COMP-3.             06130001
061500     05  PS110-MR-EMPLOYEE-DISC  PIC S9(3)    VALUE +790          06140001
061600                                              COMP-3.             06150001
061700     05  PS110-MR-OWNERSHIP-ADJ  PIC S9(3)    VALUE +796          06160001
061800                                              COMP-3.             06170001
061900     05  PS110-MR-UNKNOWN-MKDN   PIC S9(3)    VALUE +798          06180001
062000                                              COMP-3.             06190001
062100                                                                  06200001
062200 01  PS110-TIERED-GROUP-TYPE.                                     06210001
062300     05  PS110I-LI-TG-DLR-TIER-PCT-OFF                            06220001
062400                                 PIC X(1)     VALUE '0'.          06230001
062500     05  PS110I-LI-TG-DLR-TIER-DLR-OFF                            06240001
062600                                 PIC X(1)     VALUE '1'.          06250001
062700     05  PS110I-LI-TG-UNIT-TIER-PCT-OFF                           06260001
062800                                 PIC X(1)     VALUE '2'.          06270001
062900     05  PS110I-LI-TG-UNIT-TIER-DLR-OFF                           06280001
063000                                 PIC X(1)     VALUE '3'.          06290001
063100                                                                  06300001
063200 01  PS110-TENDER-TYPE.                                           06310001
063300     05  PS110-TT-CASH           PIC X(2)     VALUE '00'.         06320001
063400     05  PS110-TT-CHECK          PIC X(2)     VALUE '01'.         06330001
063500     05  PS110-TT-MDSE-CARD      PIC X(2)     VALUE '02'.         06340001
063600     05  PS110-TT-VENDOR-COUPON  PIC X(2)     VALUE '03'.         06350001
063700     05  PS110-TT-KOHLS-CHARGE   PIC X(2)     VALUE '04'.         06360001
063800     05  PS110-TT-VISA           PIC X(2)     VALUE '05'.         06370001
063900     05  PS110-TT-MASTERCARD     PIC X(2)     VALUE '06'.         06380001
064000     05  PS110-TT-DISCOVER       PIC X(2)     VALUE '07'.         06390001
064100     05  PS110-TT-AMEX           PIC X(2)     VALUE '08'.         06400001
064200     05  PS110-TT-MAIL-CHECK     PIC X(2)     VALUE '09'.         06410001
064300     05  PS110-TT-TRAVELERS-CK   PIC X(2)     VALUE '10'.         06420001
064400     05  PS110-TT-FOREIGN-CURR   PIC X(2)     VALUE '11'.         06430001
064500     05  PS110-TT-VENDOR-CHECK   PIC X(2)     VALUE '12'.         06440001
064600     05  PS110-TT-GIFT-CERT      PIC X(2)     VALUE '13'.         06450001
064700     05  PS110-TT-MALL-GIFT-CERT PIC X(2)     VALUE '14'.         06460001
064800     05  PS110-TT-CASHIER-CHECK  PIC X(2)     VALUE '15'.         06470001
005700     05  PS110-TT-DEBIT-CARD     PIC X(2)     VALUE '19'.         06471010
064900     05  PS110-TT-PURCHASE-ORDER PIC X(2)     VALUE '90'.         06480001
065000     05  PS110-TT-REFUND         PIC X(2)     VALUE '99'.         06490001
065100                                                                  06500001
065200 01  PS110-TENDER-ID-SOURCE.                                      06510001
065300     05  PS110-IS-KEY-ENTERED    PIC X(2)     VALUE '00'.         06520001
065400     05  PS110-IS-MAG-STRIPE-READ                                 06530001
065500                                 PIC X(2)     VALUE '01'.         06540001
065600     05  PS110-IS-BAR-CODE-READ  PIC X(2)     VALUE '02'.         06550001
065700     05  PS110-IS-CHECK-READER   PIC X(2)     VALUE '03'.         06560001
065800                                                                  06570001
065900 01  PS110-TENDER-VOID-IND.                                       06580001
066000     05  PS110-TV-NORMAL-TENDER  PIC X(1)     VALUE ' '.          06590001
066100     05  PS110-TV-VOIDED-TENDER  PIC X(1)     VALUE 'V'.          06600001
066200                                                                  06610001
066300 01  PS110-TENDER-ID-LENGTH.                                      06620001
066400     05  PS110-IL-KOHLS-CHARGE   PIC S9(3)    VALUE +10           06630001
066500                                              COMP-3.             06640001
066600     05  PS110-IL-KOHLS-CHRG-W-LI                                 06650001
066700                                 PIC S9(3)    VALUE +12           06660001
066800                                              COMP-3.             06670001
066900     05  PS110-IL-SHORT-VISA-LENGTH                               06680001
067000                                 PIC S9(3)    VALUE +13           06690001
067100                                              COMP-3.             06700001
067200     05  PS110-IL-AMEX-LENGTH    PIC S9(3)    VALUE +15           06710001
067300                                              COMP-3.             06720001
067400                                                                  06730001
067500 01  PS110-TENDER-ID-ERROR-IND.                                   06740001
067600     05  PS110-TE-NO-ERROR       PIC X(1)     VALUE ' '.          06750001
067700     05  PS110-TE-NON-NUMERIC-ID PIC X(1)     VALUE '1'.          06760001
067800     05  PS110-TE-ID-MISSING     PIC X(1)     VALUE '2'.          06770001
067900     05  PS110-TE-INVALID-PREFIX PIC X(1)     VALUE '3'.          06780001
068000     05  PS110-TE-INVALID-CK-DIGIT                                06790001
068100                                 PIC X(1)     VALUE '4'.          06800001
068200                                                                  06810001
068300 01  PS110-TENDER-REQUEST-TYPE.                                   06820001
068400     05  PS110-TR-NORMAL-REQUEST PIC X(1)     VALUE '0'.          06830001
068500     05  PS110-TR-REVERSAL-REQUEST                                06840001
068600                                 PIC X(1)     VALUE '1'.          06850001
068700     05  PS110-TR-BALANCE-INQUIRY                                 06860001
068800                                 PIC X(1)     VALUE '0'.          06870001
068900     05  PS110-TR-ISSUE-MEDIA-1  PIC X(1)     VALUE '1'.          06880001
069000     05  PS110-TR-ISSUE-MEDIA-2  PIC X(1)     VALUE '2'.          06890001
069100     05  PS110-TR-TENDER         PIC X(1)     VALUE '3'.          06900001
069200     05  PS110-TR-VALUE-ADD-MEDIA-1                               06910001
069300                                 PIC X(1)     VALUE '4'.          06920001
069400     05  PS110-TR-VALUE-ADD-MEDIA-2                               06930001
069500                                 PIC X(1)     VALUE '5'.          06940001
069600                                                                  06950006
069700 01  PS110-DEBIT-CARD-DESC.                                       06960006
069800     05  PS110-DEBIT-CARD-MC     PIC X(10)    VALUE 'DEBIT M/C '. 06970006
069900     05  PS110-DEBIT-CARD-VISA   PIC X(10)    VALUE 'DEBIT VISA'. 06980006
070000     05  PS110-DEBIT-CARD-ATM    PIC X(10)    VALUE 'DEBIT ATM '. 06990006
070001     05  PS110-DEBIT-CARD-KOHLS  PIC X(11)    VALUE 'DEBIT KOHLS'.07000017
