000100 IDENTIFICATION DIVISION.                                         00010004
000200 PROGRAM-ID.      PXKRP003.                                       00020089
000300 AUTHOR.          KOHLS DEPARTMENT STORES.                        00030005
000400 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00040004
000500 DATE-WRITTEN.    05/16/2005.                                     00050089
000600 DATE-COMPILED.                                                   00060004
000700******************************************************************00070021
000800**WHITE TICKET MARKUP/MARKDOWN PRICE CHANGE REPORT                00080089
000900******************************************************************00090007
001000**THIS PROGRAM CREATES THE WHITE TICKET PRICE CHANGE REPORT.      00100089
001100******************************************************************00110007
001200**DATE:05/16/2005   MADE BY:JULIE TEWES INITIAL PROGRAM WRITE     00120089
001300******************************************************************00130034
081005**DATE:08/10/2005   MADE BY:JULIE TEWES FIX TO EXPAND PRICE TO    00140096
081006**                  $9999.99.                                     00150096
081007******************************************************************00160096
081009**DATE:09/03/2008   MADE BY:MARGARET MORRISON ADD INTRANSIT QTY   00140096
081010**                  TO SUMMARY REPORT.                            00150096
081007******************************************************************00160096
041610**DATE:04/16/2010   MADE BY:THOMAS HANSON - CHANGES FOR MDO2010   00140096
041610**                  PROJECT INCLUDED USAGE FOR 5 DAY REPORTING.   00150096
041610**                  CHANGES MARKED BY '041610'.                   00150096
041610******************************************************************00160096
041610**DATE:08/22/2014   MADE BY: LINDA FRIESS - REMOVE PRICE CHANGE   00140096
041610**                  ID FROM REPORT FOR USE AS 2-DAY REPORT.       00150096
041610******************************************************************00160096
081012 ENVIRONMENT DIVISION.                                            00170004
081013 CONFIGURATION SECTION.                                           00180004
081014 SOURCE-COMPUTER.        IBM-3090.                                00190004
081020 OBJECT-COMPUTER.        IBM-3090.                                00200004
081030 INPUT-OUTPUT SECTION.                                            00210004
081040 FILE-CONTROL.                                                    00220004
081050                                                                  00230004
081060     SELECT INPUT-FILE                                            00240044
081070            ASSIGN TO INP01.                                      00250014
081080     SELECT SUMMARY-FILE                                          00260089
081090            ASSIGN TO INP02.                                      00270089
041610     SELECT HEADING-CARD                                                  
041610            ASSIGN TO INP03.                                              
081100     SELECT REPORT-FILE                                           00280089
081200            ASSIGN TO OUT01.                                      00290089
081300                                                                  00300089
081400 DATA DIVISION.                                                   00310089
081500 FILE SECTION.                                                    00320089
081600                                                                  00330089
081700 FD  INPUT-FILE                                                   00340089
081800     RECORDING MODE F                                             00350089
081900     BLOCK CONTAINS 0 RECORDS                                     00360089
082000     LABEL RECORDS ARE OMITTED                                    00370089
082100     DATA RECORD IS INPUT-RECORD.                                 00380089
082200 01  INPUT-RECORD                    PIC X(200).                  00390099
082300                                                                  00400089
082400 FD  SUMMARY-FILE                                                 00410089
082500     RECORDING MODE F                                             00420089
082600     BLOCK CONTAINS 0 RECORDS                                     00430089
082700     LABEL RECORDS ARE OMITTED                                    00440089
082800     DATA RECORD IS SUMMARY-RECORD.                               00450089
082900 01  SUMMARY-RECORD                  PIC X(075).                  00460089
083000                                                                  00470089
041610 FD  HEADING-CARD                                                         
041610     RECORDING MODE F                                                     
041610     BLOCK CONTAINS 0 RECORDS                                             
041610     LABEL RECORDS ARE OMITTED                                            
041610     DATA RECORD IS HEADING-RECORD.                                       
041610 01  HEADING-RECORD                  PIC X(080).                          
041610                                                                          
083100 FD  REPORT-FILE                                                  00480089
083200     RECORDING MODE F                                             00490089
083300     BLOCK CONTAINS 0 RECORDS                                     00500089
083400     LABEL RECORDS ARE OMITTED                                    00510089
083500     DATA RECORD IS REPORT-RECORD.                                00520089
083600 01  REPORT-RECORD                   PIC X(133).                  00530089
083700                                                                  00540089
083800 WORKING-STORAGE SECTION.                                         00550089
083900******************************************************************00560089
084000**SWITCHES                                                        00570089
084100******************************************************************00580089
084200 01  PS-PROGRAM-SWITCHES.                                         00590089
084300     05  PS-END-OF-INPUT-FILE-SW         PIC X(01)   VALUE 'N'.   00600089
084400         88  PS-END-OF-INPUT-FILE                    VALUE 'Y'.   00610089
084500         88  PS-NOT-END-OF-INPUT-FILE                VALUE 'N'.   00620089
084600     05  PS-END-OF-SUMMARY-FILE-SW       PIC X(01)   VALUE 'N'.   00630089
084700         88  PS-END-OF-SUMMARY-FILE                  VALUE 'Y'.   00640089
084800         88  PS-NOT-END-OF-SUMMARY-FILE              VALUE 'N'.   00650089
041610******************************************************************        
041610**HEADING CARD LAYOUTS                                                    
041610******************************************************************        
041610 01  CC-HEADING-CARD-LAYOUT.                                              
041610     05  CC-HEADING                    PIC X(40)  VALUE SPACES.           
041610     05  CC-REPORT-NUMBER              PIC 9(01)  VALUE ZEROS.            
041610******************************************************************00660089
085000**PROGRAM HOLDS                                                   00670089
085100******************************************************************00680089
085200 01  PH-PROGRAM-HOLDS-1.                                          00690089
085300     05  PH-STR-NBR                    PIC S9(04) COMP            00700089
085400                                                  VALUE ZEROS.    00710089
085500     05  PH-BUS-AREA-ID                PIC S9(02) COMP-3          00720089
085600                                                  VALUE ZEROS.    00730089
085700 01  PH-PROGRAM-HOLDS-2.                                          00740089
085800     05  PH-SUB-CL-NBR                 PIC S9(04) COMP-3          00750089
085900                                                  VALUE ZEROS.    00760089
086000     05  PH-DEPT-NBR                   PIC S9(04) COMP-3          00770089
086100                                                  VALUE ZEROS.    00780089
086200 01  PH-PROGRAM-HOLDS-3.                                          00790089
086300     05  PH-SUMMARY-STR                PIC S9(04) COMP            00800089
086400                                                  VALUE ZEROS.    00810089
086500     05  PH-STORE-TOTAL                PIC S9(09) COMP            00820089
086600                                                  VALUE ZEROS.    00830089
086610     05  PH-STORE-TOTAL-INTRNST        PIC S9(09) COMP            00820089
086620                                                  VALUE ZEROS.    00830089
086700******************************************************************00840089
086800**TIMESTAMP VARIABLES                                             00850089
086900******************************************************************00860089
087000 01 DF-DATE-TIME-FIELDS.                                          00870089
087100    05 DF-ACCEPT-DATE.                                            00880089
087200       10  DF-ACCEPT-YR                  PIC 9(02) VALUE ZEROS.   00890089
087300       10  DF-ACCEPT-MO                  PIC 9(02) VALUE ZEROS.   00900089
087400       10  DF-ACCEPT-DY                  PIC 9(02) VALUE ZEROS.   00910089
087500    05 DF-ACCEPT-TIME.                                            00920089
087600       10  DF-ACCEPT-HR                  PIC 9(02) VALUE ZEROS.   00930089
087700       10  DF-ACCEPT-MN                  PIC 9(02) VALUE ZEROS.   00940089
087800       10  DF-ACCEPT-SS                  PIC 9(04) VALUE ZEROS.   00950089
087900    05 DF-FORMAT-DATE.                                            00960089
088000       10  DF-FORMAT-DATE-MM             PIC 9(02) VALUE ZEROS.   00970089
088100       10  FILLER                        PIC X(01) VALUE '/'.     00980089
088200       10  DF-FORMAT-DATE-DD             PIC 9(02) VALUE ZEROS.   00990089
088300       10  FILLER                        PIC X(01) VALUE '/'.     01000089
088400       10  DF-FORMAT-DATE-YY             PIC 9(02) VALUE ZEROS.   01010089
088500******************************************************************01020089
088600**PROGRAM CONSTANTS                                               01030089
088700******************************************************************01040089
088800 01  PC-PROGRAM-CONSTANTS.                                        01050089
088900     05  PC-CURRENT-PROGRAM-NAME         PIC X(08)                01060089
089000         VALUE 'PXKRP003'.                                        01070089
089100******************************************************************01080089
089200**PROGRAM COUNTERS                                                01090089
089300******************************************************************01100089
089400 01  PC-PROGRAM-COUNTER.                                          01110089
089500     05  PC-INPUT-RECORDS-READ           PIC 9(09) VALUE ZEROS.   01120089
089600     05  PC-SUMMARY-RECORDS-READ         PIC 9(09) VALUE ZEROS.   01130089
089700     05  PC-REPORT-RECORDS-WRITTEN       PIC 9(09) VALUE ZEROS.   01140089
089800     05  PC-SUMMARY-RECORDS-WRITTEN      PIC 9(09) VALUE ZEROS.   01150089
089900     05  PC-REPORT-LINE-COUNTER          PIC 9(03) VALUE ZEROS.   01160089
090000     05  PC-PAGE-COUNTER                 PIC 9(03) VALUE ZEROS.   01170089
090100******************************************************************01180089
090200**REPORT HEADINGS                                                 01190089
090300******************************************************************01200089
090400 01  RH-TITLE-1.                                                  01210089
090500     05  FILLER                          PIC X(50)  VALUE SPACES. 01220089
090600     05  FILLER                          PIC X(33)                01230089
090700                       VALUE 'WHITE TICKET PRICE CHANGE REPORT '. 01240089
090800     05  FILLER                          PIC X(50)  VALUE SPACES. 01250089
       01  RH-TITLE-2.                                                          
           05  FILLER                          PIC X(50)  VALUE SPACES.         
           05  RH-TITLE-HEADING-2              PIC X(40)  VALUE SPACES.         
           05  FILLER                          PIC X(43)  VALUE SPACES.         
091400 01  RH-HEADINGS-1.                                               01310089
091500     05  FILLER                          PIC X(02)  VALUE SPACES. 01320089
091600     05  FILLER                          PIC X(14)                01330089
091700                       VALUE ' STORE NUMBER:'.                    01340089
091800     05  RH-HEADINGS-1-STR-NBR           PIC Z9999  VALUE ZEROS.  01350089
091900     05  FILLER                          PIC X(01)  VALUE SPACES. 01360089
092000     05  RH-HEADING-1-STR-NAME           PIC X(20)  VALUE SPACES. 01370089
092100     05  FILLER                          PIC X(90)  VALUE SPACES. 01380089
092200 01  RH-HEADINGS-2.                                               01390089
092300     05  FILLER                          PIC X(17)                01400089
092400                       VALUE ' EFFECTIVE DATE: '.                 01410089
092500     05  RH-HEADINGS-2-EFF-DATE          PIC X(10)  VALUE SPACES. 01420089
092600 01  RH-HEADINGS-3.                                               01430089
092700     05  FILLER                          PIC X(01)  VALUE SPACES. 01440089
092800     05  FILLER                          PIC X(16)                01450089
092900                       VALUE ' BUSINESS AREA: '.                  01460089
093000     05  RH-HEADINGS-3-BUS-ID            PIC 99     VALUE ZEROS.  01470089
093100     05  FILLER                          PIC X(01)  VALUE SPACES. 01480089
093200     05  RH-HEADINGS-3-BUS-DESC          PIC X(25)  VALUE SPACES. 01490089
093300     05  FILLER                          PIC X(01)  VALUE SPACES. 01500089
093400     05  FILLER                          PIC X(45)                01510089
093500         VALUE '* INDICATES NOT ALL ACTIVE SKUS IN STYLE WILL'.   01520089
093600     05  FILLER                          PIC X(35)                01530089
093700         VALUE ' BE MARKED DOWN.  USE RF TO VERIFY.'.             01540089
093800     05  FILLER                          PIC X(11)  VALUE SPACES. 01550089
093900 01  RH-HEADINGS-4.                                               01560089
094000     05  FILLER                          PIC X(06)  VALUE SPACES. 01570089
094100     05  FILLER                          PIC X(05)                01580089
094200         VALUE ' SUB '.                                           01590089
094300     05  FILLER                          PIC X(01)  VALUE SPACES. 01600089
094400     05  FILLER                          PIC X(04)                01610089
094500         VALUE 'BOX '.                                            01620089
094600     05  FILLER                          PIC X(03)  VALUE SPACES. 01630089
094700     05  FILLER                          PIC X(73)  VALUE SPACES. 01640091
094800     05  FILLER                          PIC X(10)                01650089
094900         VALUE '   STR    '.                                      01660091
095000     05  FILLER                          PIC X(11)  VALUE SPACES. 01670092
095100     05  FILLER                          PIC X(08)                01680093
095200         VALUE '  NEW   '.                                        01690089
095300     05  FILLER                          PIC X(12)  VALUE SPACES. 01700089
095700 01  RH-HEADINGS-5.                                               01740089
095800     05  FILLER                          PIC X(05)                01750089
095900         VALUE 'DEPT '.                                           01760089
096000     05  FILLER                          PIC X(01)  VALUE SPACES. 01770089
096100     05  FILLER                          PIC X(05)                01780089
096200         VALUE 'CLASS'.                                           01790089
096300     05  FILLER                          PIC X(01)  VALUE SPACES. 01800089
096400     05  FILLER                          PIC X(04)                01810089
096500         VALUE ' ID '.                                            01820089
096600     05  FILLER                          PIC X(03)  VALUE SPACES. 01830089
096700     05  FILLER                          PIC X(20)                01840089
096800         VALUE 'STYLE               '.                            01850089
096900     05  FILLER                          PIC X(01)  VALUE SPACES. 01860089
097000     05  FILLER                          PIC X(30)                01870089
097100         VALUE 'STYLE DESCRIPTION            '.                   01880093
097200     05  FILLER                          PIC X(01)  VALUE SPACES. 01890089
097300     05  FILLER                          PIC X(20)                01900089
097400         VALUE 'LABEL NAME          '.                            01910089
097500     05  FILLER                          PIC X(03)  VALUE SPACES. 01920089
097600     05  FILLER                          PIC X(06)                01930089
097700         VALUE 'ONHAND'.                                          01940089
097800     05  FILLER                          PIC X(02)  VALUE SPACES. 01950097
097900     05  FILLER                          PIC X(09)                01960089
098000         VALUE 'INTRANSIT'.                                       01970089
098001     05  FILLER                          PIC X(01)  VALUE SPACES. 01980089
098002     05  FILLER                          PIC X(09)                01990098
098003         VALUE '  PRICE  '.                                       02000098
098004     05  FILLER                          PIC X(10)  VALUE SPACES. 02010089
098007 01  RH-HEADINGS-6.                                               02040089
098008     05  FILLER                          PIC X(05)                02050089
098009         VALUE '-----'.                                           02060089
098010     05  FILLER                          PIC X(01)  VALUE SPACES. 02070089
098020     05  FILLER                          PIC X(05)                02080089
098030         VALUE '-----'.                                           02090089
098040     05  FILLER                          PIC X(01)  VALUE SPACES. 02100089
098050     05  FILLER                          PIC X(04)                02110089
098060         VALUE '----'.                                            02120089
098070     05  FILLER                          PIC X(03)  VALUE SPACES. 02130089
098080     05  FILLER                          PIC X(20)                02140089
098090         VALUE '--------------------'.                            02150089
098100     05  FILLER                          PIC X(01)  VALUE SPACES. 02160089
098200     05  FILLER                          PIC X(30)                02170089
098300         VALUE '------------------------------'.                  02180089
098400     05  FILLER                          PIC X(01)  VALUE SPACES. 02190089
098500     05  FILLER                          PIC X(20)                02200089
098600         VALUE '--------------------'.                            02210089
098700     05  FILLER                          PIC X(03)  VALUE SPACES. 02220089
098800     05  FILLER                          PIC X(06)                02230089
098900         VALUE '------'.                                          02240089
098901     05  FILLER                          PIC X(02)  VALUE SPACES. 02250098
098902     05  FILLER                          PIC X(09)                02260098
098903         VALUE '---------'.                                       02270097
098904     05  FILLER                          PIC X(01)  VALUE SPACES. 02280089
098905     05  FILLER                          PIC X(09)                02290096
098906         VALUE '---------'.                                       02300096
098907     05  FILLER                          PIC X(11)  VALUE SPACES. 02310089
098910 01  RH-HEADINGS-7.                                               02340089
098920     05  FILLER                          PIC X(30)                02350089
098930         VALUE 'MERCHANDISE AREA              '.                  02360089
098940     05  FILLER                          PIC X(02)  VALUE SPACES. 02370089
098950     05  FILLER                          PIC X(08)                02380089
098960         VALUE ' ONHAND '.                                        02390089
098962     05  FILLER                          PIC X(02)  VALUE SPACES. 02370089
098963     05  FILLER                          PIC X(09)                02380089
098964         VALUE 'INTRANSIT'.                                               
098970     05  FILLER                          PIC X(39)  VALUE SPACES. 02400089
098980 01  RH-HEADINGS-8.                                               02410089
098990     05  FILLER                          PIC X(30)                02420089
099000         VALUE '------------------------------'.                  02430089
099100     05  FILLER                          PIC X(02)  VALUE SPACES. 02440089
099200     05  FILLER                          PIC X(08)                02450089
099300         VALUE '--------'.                                        02460089
099310     05  FILLER                          PIC X(02)  VALUE SPACES. 02440089
099320     05  FILLER                          PIC X(09)                02450089
099330         VALUE '---------'.                                       02460089
099400     05  FILLER                          PIC X(39)  VALUE SPACES. 02470089
099500 01  RH-DETAIL-LINE.                                              02480089
099600     05  RH-COLUMN-1-DEPT-NBR            PIC ZZZZZ  VALUE ZEROS.  02490089
099700     05  FILLER                          PIC X(01)  VALUE SPACES. 02500089
099800     05  RH-COLUMN-1-SUB-CLASS           PIC ZZZZZ  VALUE ZEROS.  02510089
099900     05  FILLER                          PIC X(01)  VALUE SPACES. 02520089
100000     05  RH-COLUMN-1-STKR-NBR            PIC ZZZZ   VALUE SPACES. 02530089
100100     05  FILLER                          PIC X(01)  VALUE SPACES. 02540089
100200     05  RH-COLUMN-1-CHANGE-IND          PIC X(01)  VALUE SPACES. 02550089
100300     05  RH-COLUMN-1-FULL-STYL-IND       PIC X(01)  VALUE ZEROS.  02560089
100400     05  RH-COLUMN-1-VS-NBR              PIC X(20)  VALUE ZEROS.  02570089
100500     05  FILLER                          PIC X(01)  VALUE SPACES. 02580089
100600     05  RH-COLUMN-1-VS-DESC             PIC X(30)  VALUE SPACES. 02590089
100700     05  FILLER                          PIC X(01)  VALUE SPACES. 02600095
100800     05  RH-COLUMN-1-LBL-NM              PIC X(20)  VALUE SPACES. 02610089
100900     05  FILLER                          PIC X(04)  VALUE SPACES. 02620095
100901     05  RH-COLUMN-1-STR-EXPTD-OH        PIC -ZZZ9  VALUE ZEROS.  02630089
100902     05  FILLER                          PIC X(07)  VALUE SPACES. 02640097
100903     05  RH-COLUMN-1-INTRNST             PIC -ZZ9   VALUE ZEROS.  02650096
100904     05  FILLER                          PIC X(01)  VALUE SPACES. 02660097
100905     05  RH-COLUMN-1-RETAIL              PIC $ZZZZZ.ZZ.           02670096
100906     05  FILLER                          PIC X(12)  VALUE SPACES. 02680089
100909 01  RH-DETAILS-2.                                                02710089
100910     05  RH-SUMMARY-DMA-NM               PIC X(30)  VALUE SPACES. 02720089
100920     05  FILLER                          PIC X(02)  VALUE SPACES. 02730089
100930     05  RH-SUMMARY-ONHANDS              PIC -ZZ,ZZ9.             02740089
100940     05  FILLER                          PIC X(04)  VALUE SPACES. 02750089
100941     05  RH-SUMMARY-INTRANSIT            PIC -ZZ,ZZ9.             02740089
100942     05  FILLER                          PIC X(40)  VALUE SPACES. 02750089
100950 01  RH-FOOTERS-1.                                                02760089
100960     05  FILLER                          PIC X(54)  VALUE SPACES. 02770089
100970     05  FILLER                          PIC X(19)                02780089
100980         VALUE '***END OF REPORT***'.                             02790089
100990******************************************************************02800089
101000**COPYBOOKS                                                       02810089
101100******************************************************************02820089
101200***VARIABLES REQUIRED FOR THE FORMAT SQLCA ROUTINE DPPD004        02830089
101300     COPY DPWS004.                                                02840089
101400***INPUT FILE FORMAT                                              02850089
101500     COPY PXRD001.                                                02860089
101600***SUMMARY FILE FORMAT                                            02870089
101700     COPY PXRD020.                                                02880089
101800***STANDARD KOHLS HEADING FOR 132 BYTE REPORT                     02890089
101900     COPY DPWS132O.                                               02900089
102000******************************************************************02910089
102100**ERROR HANDLING                                                  02920089
102200******************************************************************02930089
102300 01  PV-MISC-ABEND-FIELDS.                                        02940089
102400     05  PV-PARAGRAPH-NAME               PIC X(30) VALUE SPACE.   02950089
102500     05  PV-OPERATION-MSG-1              PIC X(40) VALUE SPACE.   02960089
102600     05  PV-OPERATION-MSG-2              PIC X(40) VALUE SPACE.   02970089
102700                                                                  02980089
102800 PROCEDURE DIVISION.                                              02990089
102900***************************************************************** 03000089
103000                                                                  03010089
103100     PERFORM 1000-INITIALIZATION.                                 03020089
103200     PERFORM 2000-PROCESS-RECORDS                                 03030089
103300             UNTIL PS-END-OF-INPUT-FILE.                          03040089
103400     PERFORM 9999-WRAPUP.                                         03050089
103500     GOBACK.                                                      03060089
103600                                                                  03070089
103700 EJECT.                                                           03080089
103800******************************************************************03090089
103900**INITIALIZATION AREA                                             03100089
104000******************************************************************03110089
104100 1000-INITIALIZATION.                                             03120089
104200                                                                  03130089
104300     MOVE '1000-INITIALIZATION' TO PV-PARAGRAPH-NAME.             03140089
104400                                                                  03150089
104500     OPEN INPUT  INPUT-FILE                                       03160089
104600                 SUMMARY-FILE                                     03170089
041610                 HEADING-CARD                                     03170089
104700          OUTPUT REPORT-FILE.                                     03180089
104800                                                                  03190089
104900**RETRIEVE DATE FROM SYSTEM                                       03200089
105000     ACCEPT DF-ACCEPT-TIME FROM TIME.                             03210089
105100     ACCEPT DF-ACCEPT-DATE FROM DATE.                             03220089
105200                                                                  03230089
105300     MOVE DF-ACCEPT-YR          TO DF-FORMAT-DATE-YY.             03240089
105400     MOVE DF-ACCEPT-MO          TO DF-FORMAT-DATE-MM.             03250089
105500     MOVE DF-ACCEPT-DY          TO DF-FORMAT-DATE-DD.             03260089
105600                                                                  03270089
041610     PERFORM 1999-READ-HEADING-CARD.                                      
105700     PERFORM 2999-READ-INPUT-FILE.                                03280089
105800     PERFORM 3999-READ-SUMMARY-FILE.                              03290089
105900     MOVE PXRD020-STR-NBR       TO PH-SUMMARY-STR.                03300089
106000                                                                  03310089
106100     IF  PS-NOT-END-OF-INPUT-FILE                                 03320089
106200         PERFORM 1100-HEADING-PREP                                03330089
106300         PERFORM 3100-WRITE-SUMMARY-HEADERS                       03340089
106400         PERFORM 3000-WRITE-SUMMARY-PAGE                          03350089
106500                 UNTIL PXRD020-STR-NBR NOT EQUAL PH-SUMMARY-STR   03360089
106600                    OR PS-END-OF-SUMMARY-FILE                     03370089
106700         PERFORM 3300-WRITE-SUMMARY-FOOTERS                       03380089
106800         PERFORM 2300-WRITE-FOOTERS                               03390089
106900         PERFORM 2100-WRITE-HEADINGS                              03400089
107000         MOVE PXRD001-BUS-AREA-ID                                 03410089
107100                                TO PH-BUS-AREA-ID                 03420089
107200         MOVE PXRD001-STR-NBR   TO PH-STR-NBR                     03430089
107300     END-IF.                                                      03440089
107400                                                                  03450089
107500 EJECT.                                                           03460089
107600******************************************************************03470089
107700**MOVE DATA TO FIELDS IN HEADING FOR REPORT                       03480089
107800******************************************************************03490089
107900 1100-HEADING-PREP.                                               03500089
108000                                                                  03510089
108100     MOVE '1100-HEADING-PREP'  TO PV-PARAGRAPH-NAME.              03520089
108200                                                                  03530089
108300***PREPS KOHLS STANDARD HEADING                                   03540089
108400     MOVE PC-CURRENT-PROGRAM-NAME                                 03550089
108500                               TO DP132O-PROGRAM-NAME.            03560089
108600     MOVE DF-FORMAT-DATE       TO DP132O-RUN-DATE.                03570089
108700     MOVE DF-ACCEPT-HR         TO DP132O-RUN-HOUR.                03580089
108800     MOVE DF-ACCEPT-MN         TO DP132O-RUN-MINUTE.              03590089
041610     MOVE CC-REPORT-NUMBER     TO DP132O-REPORT-NUMBER.           03600090
           MOVE CC-HEADING           TO RH-TITLE-HEADING-2.                     
109000                                                                  03610089
109100 EJECT.                                                           03620089
041610*****************************************************************         
041610**READ HEADING CONTROL CARD                                               
041610*****************************************************************         
041610 1999-READ-HEADING-CARD.                                                  
041610                                                                          
041610     READ HEADING-CARD INTO CC-HEADING-CARD-LAYOUT.                       
041610                                                                          
041610 EJECT.                                                           03620089
109200******************************************************************03630089
109300**PROCESSES INPUT FILE                                            03640089
109400******************************************************************03650089
109500 2000-PROCESS-RECORDS.                                            03660089
109600                                                                  03670089
109700     MOVE '2000-PROCESS-RECORDS'  TO PV-PARAGRAPH-NAME.           03680089
109800                                                                  03690089
109900     EVALUATE TRUE                                                03700089
110000        WHEN PXRD001-STR-NBR EQUAL PH-STR-NBR                     03710089
110100             IF  PC-REPORT-LINE-COUNTER > 60                      03720089
110200              OR PXRD001-BUS-AREA-ID NOT EQUAL PH-BUS-AREA-ID     03730089
110300                 PERFORM 2300-WRITE-FOOTERS                       03740089
110400                 PERFORM 2100-WRITE-HEADINGS                      03750089
110500                 INITIALIZE PH-PROGRAM-HOLDS-2                    03760089
110600                 MOVE PXRD001-BUS-AREA-ID                         03770089
110700                                  TO PH-BUS-AREA-ID               03780089
110800             END-IF                                               03790089
110900             PERFORM 2200-WRITE-DETAIL                            03800089
111000        WHEN PXRD001-STR-NBR NOT EQUAL PH-STR-NBR                 03810089
111100             INITIALIZE PC-PAGE-COUNTER                           03820089
111200             PERFORM 2300-WRITE-FOOTERS                           03830089
111300             MOVE PXRD020-STR-NBR TO PH-SUMMARY-STR               03840089
111400             PERFORM 3100-WRITE-SUMMARY-HEADERS                   03850089
111500             PERFORM 3000-WRITE-SUMMARY-PAGE                      03860089
111600                     UNTIL PXRD020-STR-NBR                        03870089
111700                                       NOT EQUAL PH-SUMMARY-STR   03880089
111800                        OR PS-END-OF-SUMMARY-FILE                 03890089
111900             PERFORM 3300-WRITE-SUMMARY-FOOTERS                   03900089
112000             PERFORM 2300-WRITE-FOOTERS                           03910089
112100             PERFORM 2100-WRITE-HEADINGS                          03920089
112200             INITIALIZE PH-PROGRAM-HOLDS-2                        03930089
112300             PERFORM 2200-WRITE-DETAIL                            03940089
112400             MOVE PXRD001-STR-NBR TO PH-STR-NBR                   03950089
112500             MOVE PXRD001-BUS-AREA-ID                             03960089
112600                                  TO PH-BUS-AREA-ID               03970089
112700     END-EVALUATE.                                                03980089
112800                                                                  03990089
112900     PERFORM 2999-READ-INPUT-FILE.                                04000089
113000                                                                  04010089
113100 EJECT.                                                           04020089
113200***************************************************************** 04030089
113300**WRITE REPORT HEADERS                                            04040089
113400***************************************************************** 04050089
113500 2100-WRITE-HEADINGS.                                             04060089
113600                                                                  04070089
113700     MOVE '2100-WRITE-HEADINGS'  TO PV-PARAGRAPH-NAME.            04080089
113800                                                                  04090089
113900     INITIALIZE PC-REPORT-LINE-COUNTER.                           04100089
114000                                                                  04110089
114100     ADD +1                      TO PC-PAGE-COUNTER.              04120089
114200     MOVE PC-PAGE-COUNTER        TO DP132O-PAGE-NUMBER.           04130089
114300                                                                  04140089
114400     MOVE PXRD001-STR-NBR        TO RH-HEADINGS-1-STR-NBR.        04150089
114500     MOVE PXRD001-LOC-NM         TO RH-HEADING-1-STR-NAME.        04160089
114600     MOVE PXRD001-BUS-AREA-ID    TO RH-HEADINGS-3-BUS-ID.         04170089
114700     MOVE PXRD001-BUS-AREA-DESC  TO RH-HEADINGS-3-BUS-DESC.       04180089
114800     MOVE PXRD001-EFF-DATE       TO RH-HEADINGS-2-EFF-DATE.       04190089
114900                                                                  04200089
115000     WRITE REPORT-RECORD FROM DP132O-STANDRD-HEADER-132-COLS      04210089
115100                         AFTER ADVANCING PAGE.                    04220089
115200                                                                  04230089
115300     WRITE REPORT-RECORD FROM RH-TITLE-1 AFTER ADVANCING 1 LINE.  04240089
041610     WRITE REPORT-RECORD FROM RH-TITLE-2 AFTER ADVANCING 1 LINE.  04250094
115500                                                                  04260089
115600     WRITE REPORT-RECORD FROM RH-HEADINGS-1                       04270089
115700                         AFTER ADVANCING 2 LINES.                 04280089
115800     WRITE REPORT-RECORD FROM RH-HEADINGS-2                       04290089
115900                         AFTER ADVANCING 1 LINES.                 04300089
116000     WRITE REPORT-RECORD FROM RH-HEADINGS-3                       04310089
116100                         AFTER ADVANCING 1 LINES.                 04320089
116200     WRITE REPORT-RECORD FROM RH-HEADINGS-4                       04330089
116300                         AFTER ADVANCING 2 LINES.                 04340089
116400     WRITE REPORT-RECORD FROM RH-HEADINGS-5                       04350089
116500                         AFTER ADVANCING 1 LINES.                 04360089
116600     WRITE REPORT-RECORD FROM RH-HEADINGS-6                       04370089
116700                         AFTER ADVANCING 1 LINES.                 04380089
116800                                                                  04390089
116900     ADD +11             TO PC-REPORT-LINE-COUNTER.               04400089
117000                                                                  04410089
117100 EJECT.                                                           04420089
117200***************************************************************** 04430089
117300**WRITE DETAIL LINE                                               04440089
117400***************************************************************** 04450089
117500 2200-WRITE-DETAIL.                                               04460089
117600                                                                  04470089
117700     MOVE '2200-WRITE-DETAIL'    TO PV-PARAGRAPH-NAME.            04480089
117800                                                                  04490089
117900     INITIALIZE RH-DETAIL-LINE.                                   04500089
118000                                                                  04510089
118100     IF  PH-DEPT-NBR NOT EQUAL PXRD001-DEPT-NBR                   04520089
118200         MOVE PXRD001-DEPT-NBR   TO RH-COLUMN-1-DEPT-NBR          04530089
118300     END-IF.                                                      04540089
118400                                                                  04550089
118500     IF  PH-SUB-CL-NBR NOT EQUAL PXRD001-SUB-CL-NBR               04560089
118600         MOVE PXRD001-SUB-CL-NBR TO RH-COLUMN-1-SUB-CLASS         04570089
118700     END-IF.                                                      04580089
118800                                                                  04590089
118900     MOVE PXRD001-VS-NBR         TO RH-COLUMN-1-VS-NBR.           04600089
119000     MOVE PXRD001-VS-DESC        TO RH-COLUMN-1-VS-DESC.          04610089
119100     MOVE PXRD001-LBL-NM         TO RH-COLUMN-1-LBL-NM.           04620089
119200     MOVE PXRD001-STR-EXPTED-QTY TO RH-COLUMN-1-STR-EXPTD-OH.     04630089
119300     MOVE PXRD001-IN-TRNST-QTY   TO RH-COLUMN-1-INTRNST.          04640089
119500     MOVE PXRD001-STKR-NBR       TO RH-COLUMN-1-STKR-NBR.         04660089
119600     MOVE PXRD001-UNT-RTL-AMT    TO RH-COLUMN-1-RETAIL.           04670089
119700                                                                  04680089
119800***MARK STYLE IF NOT ALL INCLUDED IN MARKDOWN                     04690089
119900     IF  PXRD001-FULL-STYLE-MKDWN-NO                              04700089
120000         MOVE '*'                TO RH-COLUMN-1-FULL-STYL-IND     04710089
120100     ELSE                                                         04720089
120200         MOVE SPACES             TO RH-COLUMN-1-FULL-STYL-IND     04730089
120300     END-IF.                                                      04740089
120400                                                                  04750089
120500***MARK STYLE IF ITEM HAS CHANGES FROM LAST RUN                   04760089
120600     IF  PXRD001-RECORD-CHANGE-YES                                04770089
120700         MOVE '+'                TO RH-COLUMN-1-CHANGE-IND        04780089
120800     ELSE                                                         04790089
120900         MOVE SPACES             TO RH-COLUMN-1-CHANGE-IND        04800089
121000     END-IF.                                                      04810089
121100                                                                  04820089
121200     ADD +1                      TO PC-REPORT-LINE-COUNTER.       04830089
121300                                                                  04840089
121400     WRITE REPORT-RECORD FROM RH-DETAIL-LINE.                     04850089
121500                                                                  04860089
121600     MOVE PXRD001-DEPT-NBR       TO PH-DEPT-NBR.                  04870089
121700     MOVE PXRD001-SUB-CL-NBR     TO PH-SUB-CL-NBR.                04880089
121800                                                                  04890089
121900     ADD +1                      TO PC-REPORT-RECORDS-WRITTEN.    04900089
122000                                                                  04910089
122100 EJECT.                                                           04920089
122200***************************************************************** 04930089
122300**WRITE FOOTERS                                                   04940089
122400***************************************************************** 04950089
122500 2300-WRITE-FOOTERS.                                              04960089
122600                                                                  04970089
122700     MOVE '2300-WRITE-FOOTERS' TO PV-PARAGRAPH-NAME.              04980089
122800                                                                  04990089
122900     WRITE REPORT-RECORD FROM RH-FOOTERS-1.                       05000089
123000                                                                  05010089
123100 EJECT.                                                           05020089
123200***************************************************************** 05030089
123300**READ INPUT FILE                                                 05040089
123400***************************************************************** 05050089
123500 2999-READ-INPUT-FILE.                                            05060089
123600                                                                  05070089
123700     READ INPUT-FILE INTO PXRD001-YELLOW-TICKET-REPORT            05080089
123800          AT END SET PS-END-OF-INPUT-FILE TO TRUE                 05090089
123900     END-READ.                                                    05100089
124000                                                                  05110089
124100     IF  PS-NOT-END-OF-INPUT-FILE                                 05120089
124200         ADD +1 TO PC-INPUT-RECORDS-READ                          05130089
124300     END-IF.                                                      05140089
124400                                                                  05150089
124500 EJECT.                                                           05160089
124600***************************************************************** 05170089
124700**WRITE SUMMARY REPORT                                            05180089
124800***************************************************************** 05190089
124900 3000-WRITE-SUMMARY-PAGE.                                         05200089
125000                                                                  05210089
125100     MOVE '3000-WRITE-SUMMARY-PAGE' TO PV-PARAGRAPH-NAME.         05220089
125200                                                                  05230089
125300     MOVE PXRD020-DMA-NM            TO RH-SUMMARY-DMA-NM.         05240089
125400     MOVE PXRD020-STR-EXPTED-QTY    TO RH-SUMMARY-ONHANDS.        05250089
125410     MOVE PXRD020-IN-TRNST-QTY      TO RH-SUMMARY-INTRANSIT.      05250089
125500     PERFORM 3200-WRITE-SUMMARY-DETAILS.                          05260089
125600                                                                  05270089
125700     COMPUTE PH-STORE-TOTAL                                       05280089
125800                   = PH-STORE-TOTAL + PXRD020-STR-EXPTED-QTY.     05290089
125900                                                                  05300089
125910     COMPUTE PH-STORE-TOTAL-INTRNST                               05280089
125920           = PH-STORE-TOTAL-INTRNST + PXRD020-IN-TRNST-QTY.               
125930                                                                  05300089
126000     PERFORM 3999-READ-SUMMARY-FILE.                              05310089
126100                                                                  05320089
126200 EJECT.                                                           05330089
126300***************************************************************** 05340089
126400**WRITE SUMMARY REPORT HEADERS                                    05350089
126500***************************************************************** 05360089
126600 3100-WRITE-SUMMARY-HEADERS.                                      05370089
126700                                                                  05380089
126800     MOVE '3100-WRITE-SUMMARY-HEADERS' TO PV-PARAGRAPH-NAME.      05390089
126900                                                                  05400089
127000     INITIALIZE PC-REPORT-LINE-COUNTER.                           05410089
127100                                                                  05420089
127200     ADD +1                      TO PC-PAGE-COUNTER.              05430089
127300     MOVE PC-PAGE-COUNTER        TO DP132O-PAGE-NUMBER.           05440089
127400                                                                  05450089
127500     MOVE PXRD001-STR-NBR        TO RH-HEADINGS-1-STR-NBR.        05460089
127600     MOVE PXRD001-LOC-NM         TO RH-HEADING-1-STR-NAME.        05470089
127700     MOVE PXRD001-EFF-DATE       TO RH-HEADINGS-2-EFF-DATE.       05480089
127800                                                                  05490089
127900     WRITE REPORT-RECORD FROM DP132O-STANDRD-HEADER-132-COLS      05500089
128000                         AFTER ADVANCING PAGE.                    05510089
128100                                                                  05520089
128200     WRITE REPORT-RECORD FROM RH-TITLE-1 AFTER ADVANCING 1 LINE.  05530089
041610     WRITE REPORT-RECORD FROM RH-TITLE-2 AFTER ADVANCING 1 LINE.  05540094
128400                                                                  05550089
128500     WRITE REPORT-RECORD FROM RH-HEADINGS-1                       05560089
128600                         AFTER ADVANCING 2 LINES.                 05570089
128700     WRITE REPORT-RECORD FROM RH-HEADINGS-2                       05580089
128800                         AFTER ADVANCING 1 LINES.                 05590089
128900     WRITE REPORT-RECORD FROM RH-HEADINGS-7                       05600089
129000                         AFTER ADVANCING 2 LINES.                 05610089
129100     WRITE REPORT-RECORD FROM RH-HEADINGS-8                       05620089
129200                         AFTER ADVANCING 1 LINES.                 05630089
129300                                                                  05640089
129400     ADD +9              TO PC-REPORT-LINE-COUNTER.               05650089
129500                                                                  05660089
129600 EJECT.                                                           05670089
129700***************************************************************** 05680089
129800**WRITE SUMMARY REPORT DETAILS                                    05690089
129900***************************************************************** 05700089
130000 3200-WRITE-SUMMARY-DETAILS.                                      05710089
130100                                                                  05720089
130200     MOVE '3200-WRITE-SUMMARY-DETAILS' TO PV-PARAGRAPH-NAME.      05730089
130300                                                                  05740089
130400     WRITE REPORT-RECORD FROM RH-DETAILS-2.                       05750089
130500                                                                  05760089
130600     ADD +1                      TO PC-SUMMARY-RECORDS-WRITTEN.   05770089
130700                                                                  05780089
130800 EJECT.                                                           05790089
130900***************************************************************** 05800089
131000**WRITE SUMMARY REPORT FOOTERS                                    05810089
131100***************************************************************** 05820089
131200 3300-WRITE-SUMMARY-FOOTERS.                                      05830089
131300                                                                  05840089
131400     MOVE '3300-WRITE-SUMMARY-FOOTERS' TO PV-PARAGRAPH-NAME.      05850089
131500                                                                  05860089
131600     WRITE REPORT-RECORD FROM RH-HEADINGS-8                       05870089
131700                         AFTER ADVANCING 2 LINES.                 05880089
131800     WRITE REPORT-RECORD FROM RH-HEADINGS-8.                      05890089
131900     MOVE PH-STORE-TOTAL         TO RH-SUMMARY-ONHANDS.           05900089
131910     MOVE PH-STORE-TOTAL-INTRNST TO RH-SUMMARY-INTRANSIT.                 
132000     MOVE SPACES                 TO RH-SUMMARY-DMA-NM.            05910089
132100                                                                  05920089
132200     WRITE REPORT-RECORD FROM RH-DETAILS-2.                       05930089
132300                                                                  05940089
132400     ADD +1                      TO PC-SUMMARY-RECORDS-WRITTEN.   05950089
132500                                                                  05960089
132600     INITIALIZE PH-STORE-TOTAL,                                   05970089
132610                PH-STORE-TOTAL-INTRNST.                                   
132700                                                                  05980089
132800 EJECT.                                                           05990089
132900***************************************************************** 06000089
133000**READ SUMMARY FILE                                               06010089
133100***************************************************************** 06020089
133200 3999-READ-SUMMARY-FILE.                                          06030089
133300                                                                  06040089
133400     READ SUMMARY-FILE INTO PXRD020-YELLOW-TICKET-SUM-FILE        06050089
133500          AT END SET PS-END-OF-SUMMARY-FILE TO TRUE               06060089
133600     END-READ.                                                    06070089
133700                                                                  06080089
133800     IF  PS-NOT-END-OF-SUMMARY-FILE                               06090089
133900         ADD +1                       TO PC-SUMMARY-RECORDS-READ  06100089
134000     END-IF.                                                      06110089
134100                                                                  06120089
134200 EJECT.                                                           06130089
134300****************************************************************  06140089
134400*END OF PROGRAM ROUTINE                                           06150089
134500****************************************************************  06160089
134600 9999-WRAPUP.                                                     06170089
134700                                                                  06180089
134800     IF  PC-REPORT-RECORDS-WRITTEN > 0                            06190089
134900         PERFORM 2300-WRITE-FOOTERS                               06200089
135000     END-IF.                                                      06210089
135100                                                                  06220089
135200     CLOSE INPUT-FILE                                             06230089
135300           SUMMARY-FILE                                           06240089
041610           HEADING-CARD                                           06240089
135400           REPORT-FILE.                                           06250089
135500                                                                  06260089
135600     PERFORM 9999-DISPLAY-STATISTICS.                             06270089
135700                                                                  06280089
135800 EJECT.                                                           06290089
135900****************************************************************  06300089
136000*DISPLAY PROGRAM STATISTICS                                       06310089
136100****************************************************************  06320089
136200 9999-DISPLAY-STATISTICS.                                         06330089
136300                                                                  06340089
136400     DISPLAY '*************************************************'. 06350089
136500     DISPLAY '* PROGRAM...............: ' PC-CURRENT-PROGRAM-NAME.06360089
136600     DISPLAY '* DATE..................: ' DF-ACCEPT-DATE.         06370089
136700     DISPLAY '* TIMESTAMP.............: ' DF-ACCEPT-TIME.         06380089
136800     DISPLAY '*************************************************'. 06390089
136900     DISPLAY '* INPUT RECORDS READ.........: '                    06400089
137000                                    PC-INPUT-RECORDS-READ.        06410089
137100     DISPLAY '* SUMMARY RECORDS READ.......: '                    06420089
137200                                    PC-SUMMARY-RECORDS-READ.      06430089
137300     DISPLAY '* REPORT RECORDS WRITTEN.....: '                    06440089
137400                                    PC-REPORT-RECORDS-WRITTEN.    06450089
137500     DISPLAY '* SUMMARY RECORDS WRITTEN....: '                    06460089
137600                                    PC-SUMMARY-RECORDS-WRITTEN.   06470089
137700     DISPLAY '*************************************************'. 06480089
137800                                                                  06490089
137900 EJECT.                                                           06500089
