000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.      PXKUT051.                                       00020001
000300 AUTHOR.          MARGARET MORRISON.                              00030000
000400 DATE-WRITTEN.    JANUARY 2009.                                   00040011
000500                                                                  00050000
000610*--------------------------------------------------------------*  00061006
000700* DESCRIPTION:                                                 *  00070000
000800*      THIS PROGRAM WILL CREATE AN OUTPUT FILE OF STORE        *  00080000
000900*      ONHAND QUANTITY DATA THAT HAS UPCOMING PRICE CHANGES.   *  00090002
001000*--------------------------------------------------------------*  00100000
001100*--------------------------------------------------------------*  00110000
001200* HISTORY LOG:                                                    00120000
001300*--------------------------------------------------------------*  00130000
001400* DATE:        11/2008                                            00140000
001500* WR/IR#:      INC000000595581                                    00150000
001600* PROGRAMMER:  MARGARET MORRISON                                  00160000
001700* DESCRIPTION: INITIAL PROGRAM WRITE.                             00170000
001800*========================== CHANGE LOG ===========================00171012
001900*  AUTH     BY         DATE                 DESCRIPTION           00172012
002000*=================================================================00173012
CL3132* CL3132  COGNIZANT  08-02-10   STORE ENHANCEMENT-MADE CHANGES TO 00174016
CL3132*                               FINE TUNE FUTURE EVENTS PROCESS.  00175016
CL3132*                               INCLUDED FUNCTIONALITY PERFORMED  00176016
CL3132*                               BY ERSTWHILE PXK005 & PXK025 JOBS.00177016
002500******************************************************************00178012
001800*--------------------------------------------------------------*  00180000
001900 ENVIRONMENT DIVISION.                                            00190000
002000*--------------------------------------------------------------*  00200000
002100 CONFIGURATION SECTION.                                           00210000
002200 SOURCE-COMPUTER.        IBM-3090.                                00220000
002300 OBJECT-COMPUTER.        IBM-3090.                                00230000
002400                                                                  00240000
002500 INPUT-OUTPUT SECTION.                                            00250000
002600                                                                  00260000
002700 FILE-CONTROL.                                                    00270000
002800                                                                  00280000
003100                                                                  00310000
003200     SELECT OUTPUT-STR-QTY-FILE                                   00320000
003300         ASSIGN TO OUT01.                                         00330000
003400                                                                  00340000
003500******************************************************************00350000
003600 DATA DIVISION.                                                   00360000
003700******************************************************************00370000
003800                                                                  00380000
003900 FILE SECTION.                                                    00390000
004000                                                                  00400000
004600                                                                  00460000
004700 FD  OUTPUT-STR-QTY-FILE                                          00470000
004800     RECORDING MODE F                                             00480000
004900     BLOCK CONTAINS 0 RECORDS                                     00490000
005000     LABEL RECORDS ARE OMITTED                                    00500000
005100     DATA RECORD IS STR-QTY-RECORD.                               00510000
CL3132 01  OUTPUT-STR-QTY-RECORD           PIC X(080).                  00520016
005300                                                                  00530000
005400 WORKING-STORAGE SECTION.                                         00540000
005500*--------------------------------------------------------------*  00550000
005600* PS - PROGRAM SWITCHES                                           00560000
005700*--------------------------------------------------------------*  00570000
005800 01  PS-PROGRAM-SWITCHES.                                         00580000
005900     05  PS-END-OF-FILE-SW           PIC  X(001).                 00590000
006000         88  PS-END-OF-FILE                       VALUE 'Y'.      00600000
006100         88  PS-END-OF-FILE-NO                    VALUE 'N'.      00610000
006200                                                                  00620000
006300*--------------------------------------------------------------*  00630000
006400* PROGRAM CONSTANTS                                               00640000
006500*--------------------------------------------------------------*  00650000
006600 01  PC-PROGRAM-CONSTANTS.                                        00660000
006700     05  PC-PROGRAM-NAME          PIC X(08) VALUE 'PXKUT051'.     00670002
006800     05  PC-MAX-RETRIES           PIC 9(9)  VALUE 5.              00680000
007300                                                                  00730000
007400*--------------------------------------------------------------*  00740000
007500* PV- PROGRAM VARIABLES                                           00750000
007600*--------------------------------------------------------------*  00760000
007700 01  PV-PROGRAM-VARAIBLES.                                        00770000
007800     05  PV-PARAGRAPH-NAME        PIC X(40)   VALUE SPACES.       00780000
008100     05  PV-SQL-SUB               PIC S9(09)  VALUE 0  COMP.      00810000
008200     05  PV-RETRY                 PIC 9999    VALUE 0  COMP.      00820000
CL3132     05  PV-SUB                   PIC S9(04)  VALUE 0  COMP.      00830016
CL3132     05  PV-ROWS                  PIC S9(04)  VALUE +100 COMP.    00840016
CL3132                                                                  00850016
CL3132*-----------------------------------------------------------      00851018
CL3132* TABLE TO HOLD THE 100 RECORDS FROM THE MULTI-ROW FETCH          00852018
CL3132*-----------------------------------------------------------      00853018
CL3132 01  TL-HOST-VAR-ARRAY.                                           00860018
CL3132     05 TL-LOC-NBR          PIC S9(4) COMP   OCCURS 100 TIMES.    00870018
CL3132     05 TL-INTR-UPC-ID      PIC S9(9) COMP   OCCURS 100 TIMES.    00880018
CL3132     05 TL-STR-EXPTD-QTY    PIC S9(7) COMP-3 OCCURS 100 TIMES.    00890018
CL3132     05 TL-ONHAND           PIC S9(7) COMP-3 OCCURS 100 TIMES.    00900018
CL3132     05 TL-INTRANST-QTY     PIC S9(7) COMP-3 OCCURS 100 TIMES.    00910018
010500                                                                  01050000
CL3132******************************************************************01051016
CL3132**TIMESTAMP VARIABLES                                             01052016
CL3132******************************************************************01053016
CL3132 01 DF-DATE-TIME-FIELDS.                                          01054016
CL3132    05 DF-ACCEPT-DATE.                                            01055016
CL3132       10  DF-ACCEPT-YR                  PIC 9(02) VALUE ZEROS.   01056016
CL3132       10  DF-ACCEPT-MO                  PIC 9(02) VALUE ZEROS.   01057016
CL3132       10  DF-ACCEPT-DY                  PIC 9(02) VALUE ZEROS.   01058016
CL3132    05 DF-ACCEPT-TIME                    PIC X(08) VALUE SPACES.  01059016
CL3132    05 DF-FORMAT-DATE.                                            01059116
CL3132       10  FILLER                        PIC 9(02) VALUE 20.      01059216
CL3132       10  DF-FORMAT-DATE-YY             PIC 9(02) VALUE ZEROS.   01059316
CL3132       10  FILLER                        PIC X(01) VALUE '-'.     01059416
CL3132       10  DF-FORMAT-DATE-MM             PIC 9(02) VALUE ZEROS.   01059516
CL3132       10  FILLER                        PIC X(01) VALUE '-'.     01059616
CL3132       10  DF-FORMAT-DATE-DD             PIC 9(02) VALUE ZEROS.   01059716
010600*--------------------------------------------------------------*  01060000
010700* VARIABLES REQUIRED FOR THE FORMAT SQLCA ROUTINE DPPD004         01070000
010800*--------------------------------------------------------------*  01080000
010900     COPY DPWS004.                                                01090000
011000                                                                  01100000
011600*--------------------------------------------------------------*  01160000
011700* DB2 ABEND COPYBOOK                                              01170000
011800*--------------------------------------------------------------*  01180000
011900     COPY DPWS900.                                                01190000
012000                                                                  01200000
012100*--------------------------------------------------------------*  01210000
012200* DB2 MESSAGE AREA                                                01220000
012300*--------------------------------------------------------------*  01230000
012400     COPY SQLCA2.                                                 01240000
012500                                                                  01250000
012600*--------------------------------------------------------------*  01260000
012700* PROGRAM COUNTERS                                                01270000
012800*--------------------------------------------------------------*  01280000
012900 01  PV-PROGRAM-COUNTERS         COMP-3.                          01290000
013000     05  PV-NUMBER-OF-RETRIES     PIC 9(9) VALUE 0.               01300000
013100     05  PV-INPUT-CNT             PIC 9(9) VALUE 0.               01310000
013300     05  PV-OUTPUT-REC-CNT        PIC 9(9) VALUE 0.               01330000
013400     05  PV-SELECT-QTY-CNT        PIC 9(9) VALUE 0.               01340000
013500                                                                  01350000
013600*--------------------------------------------------------------*  01360000
013700* ERROR HANDLING                                                  01370000
013800*--------------------------------------------------------------*  01380000
013900 01  PV-MISC-ABEND-FIELDS.                                        01390000
014000     05  PV-OPERATION-MSG-1      PIC X(40) VALUE SPACES.          01400000
014100     05  PV-OPERATION-MSG-2      PIC X(40) VALUE SPACES.          01410000
014200     05  PV-DB2-OPERATION        PIC X(30) VALUE SPACES.          01420000
014300                                                                  01430000
014400 01  ABEND-CODE                  PIC S9(4) VALUE 0  COMP SYNC.    01440000
014500     88  ABEND-4003-CTRL-CARD-ERROR        VALUE +4003.           01450000
014600     88  ABEND-4013-DB2-ERROR              VALUE +4013.           01460000
014700     88  ABEND-4019-CAL-SUB-ERROR          VALUE +4019.           01470000
014800     88  ABEND-4020-MQ-ERROR               VALUE +4020.           01480000
014900     88  ABEND-4444-FORCED-ABEND           VALUE +4444.           01490000
015000     88  ABEND-4008                        VALUE +4008.           01500000
015100     88  ABEND-4005                        VALUE +4005.           01510000
015200                                                                  01520000
015300                                                                  01530000
015400******************************************************************01540000
015500* RECORD LAYOUT FOR ITEMS WITH UPCOMING WHITE OR YELLOW TICKET    01550000
015600* PRICE CHANGES.                                                  01560000
015700******************************************************************01570000
015800     COPY PXRD100.                                                01580000
015900                                                                  01590000
CL3132******************************************************************01651016
CL3132* RECORD LAYOUT OF OUTPUT FILE - CHANGED FROM PXRD105 TO PXRD003  01652016
CL3132******************************************************************01653016
CL3132     COPY PXRD003.                                                01654016
016600                                                                  01655013
016600                                                                  01660000
016700******************************************************************01670000
016800* TABLE DECLARATIONS FOR TSKST                                    01680002
016900******************************************************************01690000
017000     EXEC SQL                                                     01700000
017100         INCLUDE TSKST                                            01710002
017200     END-EXEC.                                                    01720000
017300                                                                  01730000
CL3132******************************************************************01738016
CL3132* TABLE DECLARATIONS FOR PCT_TRN_CLSN_BAL                         01739016
CL3132******************************************************************01739116
CL3132     EXEC SQL                                                     01739216
CL3132         INCLUDE PCT00014                                         01739316
CL3132     END-EXEC.                                                    01739416
CL3132                                                                  01739516
CL3132******************************************************************01739619
CL3132* TABLE DECLARATIONS FOR PXTW_SKU_STR                             01739719
CL3132******************************************************************01739819
CL3132     EXEC SQL                                                     01739919
CL3132         INCLUDE PXT00005                                         01740019
CL3132     END-EXEC.                                                    01740119
CL3132                                                                  01740219
017400*--------------------------------------------------------------*  01741019
017500* DB2 COMMUNICATIONS AREA                                         01750000
017600*--------------------------------------------------------------*  01760000
017700     EXEC SQL                                                     01770000
017800       INCLUDE SQLCA                                              01780000
017900     END-EXEC.                                                    01790000
018000                                                                  01800000
CL3132*--------------------------------------------------------------*  01801016
CL3132* CURSOR TO PULL ONHANDS AND INTRANSIT DATA                       01802016
CL3132*--------------------------------------------------------------*  01803016
CL3132     EXEC SQL                                                     01804016
CL3132       DECLARE ONHAND-CSR CURSOR WITH ROWSET POSITIONING FOR      01805016
CL3132          SELECT  A.STR_NBR                                       01806016
CL3132                 ,A.INTR_UPC_ID                                   01807016
CL3132                 ,(COALESCE(B.ONHAND_QTY,0) -                     01808016
CL3132                  COALESCE(C.TRN_CLSN_QTY,0)) AS STR_QTY          01809016
CL3132                 ,COALESCE (B.ONHAND_QTY,0)   AS ONHAND           01809116
CL3132                 ,COALESCE (C.TRN_CLSN_QTY,0) AS TRANSIT_QTY      01809216
CL3132            FROM  PXTW_SKU_STR A                                  01809316
CL3132            LEFT OUTER JOIN TSKST  B                              01809416
CL3132                                                                  01809516
CL3132            ON  A.ITM_NBR =  B.ITEM_NMBR                          01809616
CL3132            AND A.STR_NBR =  B.LOC_NBR                            01809716
CL3132                                                                  01809816
CL3132            LEFT OUTER JOIN PCT_TRN_CLSN_BAL C                    01809916
CL3132            ON  C.INTR_UPC_ID  = A.INTR_UPC_ID                    01810016
CL3132            AND C.LOC_NBR      = A.STR_NBR                        01810116
CL3132            AND C.TRN_CLSN_CDE = 'SE'                             01810216
CL3132            AND C.INTR_UPC_ID  > 1                                01810316
CL3132          FOR READ ONLY                                           01810416
CL3132          WITH UR                                                 01810516
CL3132     END-EXEC.                                                    01810616
CL3132                                                                  01810716
018100                                                                  01811000
018200 LINKAGE SECTION.                                                 01820000
018300                                                                  01830000
018400*--------------------------------------------------------------*  01840000
018500 PROCEDURE DIVISION.                                              01850000
018600*--------------------------------------------------------------*  01860000
018700 0000-MAINLINE.                                                   01870000
018800                                                                  01880000
018900     PERFORM 1000-INITIALIZATION.                                 01890000
019000                                                                  01900000
CL3132     PERFORM 2000-PROCESS-PRCHGS.                                 01910016
019300                                                                  01930000
019600     PERFORM 9999-WRAPUP.                                         01960000
019700                                                                  01970000
019800     GOBACK.                                                      01980000
019900                                                                  01990000
020000*0000-EXIT.                                                       02000000
020100                                                                  02010000
020200*--------------------------------------------------------------*  02020000
020300* 1000-INITIALIZATION.                                            02030000
020400*     INITIALIZATION AREA - INITIALIZES ALL VARIABLES, OPENS      02040000
020500*     FILES, READS CONTROL CARDS, AND PROCESSES ANY INPUT FILE    02050000
020600*     PARAMETERS IT MAY NEED.                                     02060000
020700*--------------------------------------------------------------*  02070000
020800 1000-INITIALIZATION.                                             02080000
021400                                                                  02140000
CL3132     OPEN OUTPUT OUTPUT-STR-QTY-FILE.                             02160016
021700                                                                  02170000
CL3132     INITIALIZE PXRD003-PX-COMMON-FORMAT.                         02181016
021900                                                                  02190000
022400     SET PS-END-OF-FILE-NO TO TRUE.                               02240000
CL3132**RETRIEVE DATE FROM SYSTEM                                       02241016
CL3132     ACCEPT DF-ACCEPT-TIME FROM TIME.                             02242016
CL3132     ACCEPT DF-ACCEPT-DATE FROM DATE.                             02243016
CL3132                                                                  02244016
CL3132     MOVE DF-ACCEPT-YR          TO DF-FORMAT-DATE-YY.             02245016
CL3132     MOVE DF-ACCEPT-MO          TO DF-FORMAT-DATE-MM.             02246016
CL3132     MOVE DF-ACCEPT-DY          TO DF-FORMAT-DATE-DD.             02247016
CL3132                                                                  02248016
022500                                                                  02250000
023500                                                                  02350000
023600*1000-EXIT.                                                       02360000
023700                                                                  02370000
023800*--------------------------------------------------------------*  02380000
023900* 2000-PROCESS-PRCHGS.                                         *  02390000
024000*  PROCESS UPCOMING PRICE CHANGES.                             *  02400000
024100*--------------------------------------------------------------*  02410000
024200 2000-PROCESS-PRCHGS.                                             02420000
024300                                                                  02430000
024900                                                                  02490000
CL3132     PERFORM 2100-OPEN-CURSOR.                                    02491016
CL3132                                                                  02492016
CL3132     PERFORM 2200-FETCH-CURSOR                                    02494016
CL3132       UNTIL SQLCODE = +100.                                      02495016
CL3132                                                                  02495116
CL3132     PERFORM 2300-CLOSE-CURSOR.                                   02496016
CL3132                                                                  02497016
CL3132*--------------------------------------------------------------*  02661016
CL3132* 2100-OPEN-INPUT-CURSOR.                                      *  02662016
CL3132*--------------------------------------------------------------*  02663016
CL3132 2100-OPEN-CURSOR.                                                02664016
CL3132     EXEC SQL                                                     02665016
CL3132          OPEN ONHAND-CSR                                         02666016
CL3132     END-EXEC.                                                    02667016
CL3132                                                                  02668016
CL3132     EVALUATE SQLCODE                                             02669016
CL3132         WHEN 0                                                   02669116
CL3132            CONTINUE                                              02669216
CL3132         WHEN OTHER                                               02669316
CL3132            MOVE '2100-CLOSE-CURSOR    '                          02669416
CL3132                TO PV-PARAGRAPH-NAME                              02669516
CL3132            MOVE 'ERROR ON OPEN OF ONHAND CURSOR '                02669616
CL3132                TO PV-DB2-OPERATION                               02669716
CL3132            DISPLAY 'ERROR IN OPENING CURSOR :' SQLCODE           02669816
CL3132            PERFORM 9900-SQL-ABEND                                02669916
CL3132     END-EVALUATE.                                                02670016
CL3132                                                                  02670116
CL3132*--------------------------------------------------------------*  03301016
CL3132* 2200-FETCH-CURSOR                                            *  03302016
CL3132*  SELECT THE STORE ONHAND QUANTITY AND INTRANSIT QUANTITY     *  03303016
CL3132*--------------------------------------------------------------*  03304016
CL3132 2200-FETCH-CURSOR.                                               03305016
CL3132                                                                  03306016
CL3132     EXEC SQL                                                     03307016
CL3132          FETCH NEXT ROWSET FROM ONHAND-CSR                       03308016
CL3132          FOR :PV-ROWS ROWS                                       03309016
CL3132          INTO :TL-LOC-NBR                                        03309118
CL3132              ,:TL-INTR-UPC-ID                                    03309218
CL3132              ,:TL-STR-EXPTD-QTY                                  03309318
CL3132              ,:TL-ONHAND                                         03309418
CL3132              ,:TL-INTRANST-QTY                                   03309518
CL3132     END-EXEC.                                                    03309616
CL3132                                                                  03309716
CL3132     EVALUATE SQLCODE                                             03309816
CL3132          WHEN 0                                                  03309916
CL3132          WHEN +100                                               03310016
CL3132               CONTINUE                                           03310118
CL3132          WHEN OTHER                                              03310516
CL3132               MOVE '2200-FETCH-ONHAND-CSR'                       03310616
CL3132                   TO PV-PARAGRAPH-NAME                           03310716
CL3132               MOVE 'ERROR ON SELECT OF ONHAND QTY  '             03310816
CL3132                   TO PV-DB2-OPERATION                            03310916
CL3132               PERFORM 9900-SQL-ABEND                             03311016
CL3132     END-EVALUATE.                                                03311116
CL3132                                                                  03311216
CL3132*    SQLERRD (3) - CONTAINS THE COUNT OF RECORDS FETCHED          03311318
CL3132     ADD SQLERRD(3) TO PV-SELECT-QTY-CNT                          03311418
CL3132     PERFORM 2500-BUILD-AND-WRITE-RECORD.                         03311518
CL3132                                                                  03311618
CL3132******************************************************************03311716
CL3132 2300-CLOSE-CURSOR.                                               03311816
CL3132******************************************************************03311916
CL3132     EXEC SQL                                                     03312016
CL3132          CLOSE ONHAND-CSR                                        03312116
CL3132     END-EXEC.                                                    03312216
CL3132                                                                  03312316
CL3132     EVALUATE SQLCODE                                             03312416
CL3132         WHEN 0                                                   03312516
CL3132            CONTINUE                                              03312616
CL3132         WHEN OTHER                                               03312716
CL3132               MOVE '2300-CLOSE-CURSOR    '                       03312816
CL3132                   TO PV-PARAGRAPH-NAME                           03312916
CL3132               MOVE 'ERROR ON CLOSE OF ONHAND CURSOR '            03313016
CL3132                   TO PV-DB2-OPERATION                            03313116
CL3132            DISPLAY 'ERROR IN CLOSING CURSOR :' SQLCODE           03313216
CL3132            PERFORM 9900-SQL-ABEND                                03313316
CL3132     END-EVALUATE.                                                03313416
CL3132                                                                  03313516
CL3132******************************************************************03313616
CL3132*  BUILD RECORD FOR OUTPUT FILE.                                * 03313716
CL3132******************************************************************03313816
CL3132 2500-BUILD-AND-WRITE-RECORD.                                     03313916
CL3132                                                                  03314016
CL3132     PERFORM VARYING PV-SUB FROM 1 BY 1                           03314116
CL3132       UNTIL PV-SUB > SQLERRD(3)                                  03314216
CL3132             MOVE TL-LOC-NBR (PV-SUB)                             03314318
CL3132               TO PXRD003-STR-NBR                                 03314416
CL3132             MOVE TL-INTR-UPC-ID (PV-SUB)                         03314518
CL3132               TO PXRD003-INTR-UPC-ID                             03314616
CL3132             MOVE TL-STR-EXPTD-QTY (PV-SUB)                       03314718
CL3132               TO PXRD003-STR-EXPCTD-QTY                          03314816
CL3132             MOVE TL-ONHAND (PV-SUB)                              03314918
CL3132               TO PXRD003-FSHN-ONHAND-QTY                         03315016
CL3132             MOVE TL-INTRANST-QTY (PV-SUB)                        03315118
CL3132               TO PXRD003-INTRANSIT-QTY                           03315216
CL3132             MOVE DF-FORMAT-DATE                                  03315316
CL3132               TO PXRD003-DATE                                    03315416
CL3132                                                                  03315516
CL3132        WRITE OUTPUT-STR-QTY-RECORD                               03315616
CL3132         FROM PXRD003-PX-COMMON-FORMAT                            03315716
CL3132                                                                  03315816
CL3132        ADD +1         TO PV-OUTPUT-REC-CNT                       03315916
CL3132        INITIALIZE PXRD003-PX-COMMON-FORMAT                       03316016
CL3132     END-PERFORM.                                                 03316116
CL3132                                                                  03317016
035700                                                                  03570000
039500*--------------------------------------------------------------*  03950000
039600* 9900-SQL-ABEND.                                                 03960000
039700*     SQL ABEND ROUTINE.                                          03970000
039800*--------------------------------------------------------------*  03980000
039900 9900-SQL-ABEND.                                                  03990000
040000                                                                  04000000
040100     DISPLAY '** ABEND     **'.                                   04010000
040200     DISPLAY '** PROGRAM   ** = ' PC-PROGRAM-NAME.                04020000
040300     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              04030000
040400     DISPLAY '** OPERATION ** = ' PV-DB2-OPERATION.               04040000
040500                                                                  04050000
040600     COPY DPPD004.                                                04060000
040700     SET ABEND-4013-DB2-ERROR TO TRUE.                            04070000
040800     CALL 'ILBOABN0' USING ABEND-CODE.                            04080000
040900                                                                  04090000
041000*9900-EXIT.                                                       04100000
041100                                                                  04110000
041200*--------------------------------------------------------------*  04120000
041300* 9999-WRAPUP.                                                    04130000
041400*     END OF PROGRAM ROUTINE.  CLOSES ALL FILES AND DISPLAYS      04140000
041500*     DATA COUNTS FROM THE PROGRAM.                               04150000
041600*--------------------------------------------------------------*  04160000
041700 9999-WRAPUP.                                                     04170000
041800                                                                  04180000
CL3132     CLOSE OUTPUT-STR-QTY-FILE.                                   04200016
042100                                                                  04210000
042200     DISPLAY '********************************************'.      04220000
042300     DISPLAY '**** SUMMARY OF PROGRAM PXKUT051         ***'.      04230002
042400     DISPLAY '********************************************'.      04240000
042500     DISPLAY 'TOTAL INPUT RECORDS READ    :' PV-INPUT-CNT.        04250000
042600     DISPLAY 'TOTAL OUTPUT RECORDS WRITTEN:' PV-OUTPUT-REC-CNT.   04260000
042700     DISPLAY 'TOTAL SELECTS FOR ITEM NUMBER:'                     04270003
042800                                            PV-SELECT-QTY-CNT.    04280000
042900     DISPLAY '********************************************'.      04290000
043000     DISPLAY '*********************************************'.     04300000
043100     DISPLAY '       END OF PROGRAM: ' PC-PROGRAM-NAME.           04310000
043200     DISPLAY '*********************************************'.     04320000
043300     DISPLAY ' '.                                                 04330000
043400                                                                  04340000
043500*9999-EXIT.                                                       04350000
043600                                                                  04360000
