      ***************************************************************** 00010000
      ** PXRD125 - FUTURE PRICE CHANGE REPORT LAYOUT                    00020000
      **         - USED AS INPUT FOR YELLOW TICKET 2 DAY REPORTING      00021000
      **         - RECORD LENGTH: 201                                   00022000
      **         - DERIVED FROM PXRD001, ADDED RPT COMP IND FLAG        00023000
      ***************************************************************** 00030000
      * DATE:04/16/2010  CHANGED BY:THOMAS HANSON  INITIAL USE          00040000
      ***************************************************************** 00050000
       01  PXRD125-YELLOW-TICKET-REPORT.                                00060000
           05  PXRD125-PRCHG-ID            PIC S9(09)  COMP             00070000
                                                       VALUE ZEROS.     00080000
           05  PXRD125-EFF-DATE            PIC X(10)   VALUE SPACES.    00090000
           05  PXRD125-STR-NBR             PIC S9(04)  COMP             00100000
                                                       VALUE ZEROS.     00110000
           05  PXRD125-LOC-NM              PIC X(20)   VALUE SPACES.    00120000
           05  PXRD125-BUS-AREA-ID         PIC S9(02)  COMP-3           00130000
                                                       VALUE ZEROS.     00140000
           05  PXRD125-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00150000
           05  PXRD125-DEPT-NBR            PIC S9(04)  COMP-3           00160000
                                                       VALUE ZEROS.     00170000
           05  PXRD125-VS-NBR              PIC X(20)   VALUE SPACES.    00180000
           05  PXRD125-LBL-NM              PIC X(20)   VALUE SPACES.    00190000
           05  PXRD125-VS-DESC             PIC X(30)   VALUE SPACES.    00200000
           05  PXRD125-STKR-NBR            PIC S9(09)  COMP             00210000
                                                       VALUE ZEROS.     00220000
           05  PXRD125-SUB-CL-NBR          PIC S9(04)  COMP-3           00230000
                                                       VALUE ZEROS.     00240000
           05  PXRD125-STR-EXPTED-QTY      PIC S9(09)  COMP             00250000
                                                       VALUE ZEROS.     00260000
           05  PXRD125-IN-TRNST-QTY        PIC S9(09)  COMP             00270000
                                                       VALUE ZEROS.     00280000
           05  PXRD125-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00290000
                                                       VALUE ZEROS.     00300000
           05  PXRD125-FULL-STYLE-MKDWN    PIC X(01)   VALUE SPACES.    00310000
               88  PXRD125-FULL-STYLE-MKDWN-YES        VALUE 'Y'.       00320000
               88  PXRD125-FULL-STYLE-MKDWN-NO         VALUE 'N'.       00330000
           05  PXRD125-RECORD-CHANGE       PIC X(01)   VALUE SPACES.    00340000
               88  PXRD125-RECORD-CHANGE-YES           VALUE 'Y'.       00350000
               88  PXRD125-RECORD-CHANGE-NO            VALUE 'N'.       00360000
           05  PXRD125-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00370000
                                                         VALUE ZEROS.   00380000
           05  PXRD125-RPT-COMP-IND        PIC X(01)   VALUE SPACES.    00390000
               88  PXRD125-ADDED                       VALUE 'A'.       00400000
               88  PXRD125-REMOVED                     VALUE 'D'.       00410000
               88  PXRD125-OH-CHANGES                  VALUE 'O'.       00420000
