      ***************************************************************** 00010010
      **COMMON RECORD LAYOUT FOR PRICE CHANGE SUMMARY QUANTITIES        00020031
      ***************************************************************** 00030010
       01  PXRD003-PX-COMMON-FORMAT.                                    00040031
           05  PXRD003-STR-NBR                PIC S9(04)  COMP          00050031
                                                          VALUE ZEROS.  00060031
           05  PXRD003-INTR-UPC-ID            PIC S9(09)  COMP          00070031
                                                          VALUE ZEROS.  00080031
           05  PXRD003-STR-EXPCTD-QTY         PIC S9(07)  COMP-3        00090032
                                                          VALUE ZEROS.  00100031
           05  PXRD003-FSHN-ONHAND-QTY        PIC S9(07)  COMP-3        00110032
                                                          VALUE ZEROS.  00120031
           05  PXRD003-INTRANSIT-QTY          PIC S9(07)  COMP-3        00130032
                                                          VALUE ZEROS.  00140031
           05  PXRD003-DATE                   PIC X(10)   VALUE SPACES. 00150034
           05  FILLER                         PIC X(50)   VALUE SPACES. 00160033
