      ***************************************************************** 00010007
      **T705 - CLEARANCE PRICE CHANGES FROM CLIENT RECORD               00020033
      ***************************************************************** 00030007
       01  PXRD008-FROM-CLIENT-RECORD.                                  00040033
           05  PXRD008-TOT-REC-LENGTH          PIC 9(04)   VALUE ZEROS. 00050033
           05  PXRD008-MATCHING-NBR            PIC 9(08)   VALUE ZEROS. 00060033
           05  PXRD008-LISTENER-CODE           PIC X(01)   VALUE SPACES.00070033
           05  PXRD008-LOC-NBR                 PIC 9(05)   VALUE ZEROS. 00080033
           05  PXRD008-UPC-NBR                 PIC 9(15)   VALUE ZEROS. 00090033
      **THIS FILLER VARIES BASED ON OTHER DATA IN COPYBOOK MUST EQUAL   00100031
      **     4241                                                       00110031
           05  FILLER                          PIC X(4087) VALUE SPACE. 00120031
           05  PXRD008-MQ-INDICATOR            PIC X(01)   VALUE SPACE. 00130033
               88  PXRD008-MQ-INDICATOR-N                  VALUE 'N'.   00140033
               88  PXRD008-MQ-INDICATOR-Y                  VALUE 'Y'.   00150033
           05  PXRD008-REPLYTOQ                PIC X(48)   VALUE SPACE. 00160033
           05  PXRD008-REPLYTOQMGR             PIC X(48)   VALUE SPACE. 00170033
           05  PXRD008-MSGID                   PIC X(24)   VALUE SPACE. 00180033
