      *    RECORD PURPOSE: MOS EVENTS FIRST MARKDOWN DATE UNLOAD      * 00010001
      *      RECORD FORMAT.: SEQUENTIAL                               * 00020000
091807*      RECORD LENGTH.: 24                                       * 00030013
      *                                                               * 00040000
      ***************************************************************** 00050000
      *    CREATED BY:  JOYCE KNOKE          WR#:                     * 00060000
      *       CREATED:  11/28/2006                                    * 00070001
      ***************************************************************** 00080000
      * 09/18/2007 - DAVID WELLER            WR33389                    00081014
      *     ADD DEPT-NBR                                                00081113
      ***************************************************************** 00082013
       01  PX031-SKU-EXTRACT.                                           00090004
           05  PX031-SKU-NBR                    PIC S9(08)V COMP-3.     00101208
           05  PX031-LOC-NBR                    PIC S9(04)  COMP.       00101309
           05  PX031-INTR-UPC-ID                PIC S9(09)  COMP.       00102006
           05  PX031-MOS-EFF-DATE               PIC X(10).              00110004
091807     05  PX031-DEPT-NBR                   PIC S9(04)V COMP-3.     00120013
