      ***************************************************************** 00010000
      ** SKU/STORE CTA EXCLUSION FILE FORMAT                            00020000
      ***************************************************************** 00030000
       01  PX053-SKU-STR-EXCLSN-REC.                                    00040000
           05  PX053-SKU-NBR               PIC S9(08)    COMP-3         00400000
                                                         VALUE ZEROS.   00410000
           05  PX053-STR-NBR               PIC S9(04)    COMP           00420000
                                                         VALUE ZEROS.   00430000
