      *    RECORD PURPOSE: MOS EVENTS FIRST MARKDOWN DATE UNLOAD      * 00010001
      *      RECORD FORMAT.: SEQUENTIAL                               * 00020000
      *      RECORD LENGTH.: 20                                       * 00030004
      *                                                               * 00040000
      ***************************************************************** 00050000
      *    CREATED BY:  JOYCE KNOKE          WR#:                     * 00060000
      *       CREATED:  11/28/2006                                    * 00070001
      ***************************************************************** 00080000
       01  PX030-MARKDOWN-DATE-EXTRACT.                                 00090001
           05  PX030-FRST-MKDN-DATE             PIC X(10).              00100003
           05  PX030-MOS-EFF-DATE               PIC X(10).              00110003
