      ***************************************************************** 00010000
      **MOS BMC UNLOAD FILE FORMAT                                      00020000
      ***************************************************************** 00030000
       01  PXRD046-EXTRACT-RECORD.                                      00040000
           05  PXRD046-EFF-DATE            PIC X(10)     VALUE SPACES.  00110000
           05  PXRD046-STR-NBR             PIC S9(04)    COMP           00120000
                                                         VALUE ZEROS.   00130000
           05  PXRD046-SKU-NBR             PIC S9(08)    COMP-3         00140000
                                                         VALUE ZEROS.   00150000
           05  PXRD046-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00310000
                                                         VALUE ZEROS.   00320000
           05  PXRD046-GP-RTL-QTY          PIC S9(04)    COMP           00420000
                                                         VALUE ZEROS.   00430000
           05  PXRD046-GP-RTL-QTY-NULL-IND PIC X(01)     VALUE SPACES.  00440000
           05  PXRD046-GP-RTL-AMT          PIC S9(07)V99 COMP-3         00450000
                                                         VALUE ZEROS.   00460000
           05  PXRD046-GP-RTL-AMT-NULL-IND PIC X(01)     VALUE SPACES.  00470000
