      ***************************************************************** 00010000
      **MOS PXT_PRCHG_HIST TABLE UPDATE FILE                            00020001
      ***************************************************************** 00030000
       01  PXRD089-PRCHG-HIST-UPD-FILE.                                 00040001
           05  PXRD089-UNT-OF-WRK-DEV-ID      PIC 9(20).                00041003
           05  PXRD089-ASSOC-ID               PIC X(07).                00042001
           05  PXRD089-UOW-BEG-TMST           PIC X(26).                00043003
           05  PXRD089-STR-NBR                PIC 9(05).                00050003
           05  PXRD089-SKU-NBR                PIC 9(08).                00060003
           05  PXRD089-UOW-TYP-CDE            PIC XX.                   00290001
           05  PXRD089-CRE-TMST               PIC X(26).                00300007
           05  PXRD089-PRCD-UNT-QTY           PIC S9(7)V99.             00310012
           05  PXRD089-OLD-UNT-RTL-AMT        PIC S9(7)V99.             00330012
           05  PXRD089-NEW-UNT-RTL-AMT        PIC S9(7)V99.             00350012
