      ***************************************************************** 00010000
      **MISSING SKU ADD TRANS FILE                                      00020001
      ***************************************************************** 00030000
       01  PXRD121-MSSG-SKU-TRANS-FILE.                                 00040005
           05  PXRD121-CTG-CDE             PIC X(3)    VALUE SPACE.     00041002
           05  PXRD121-EVNT-TYPE-CDE       PIC X(3)    VALUE SPACE.     00041102
           05  PXRD121-EVNT-DTE            PIC X(10)   VALUE SPACE.     00041202
           05  PXRD121-STR-NBR             PIC 9(5)    VALUE ZEROS.     00050001
           05  PXRD121-SKU-NBR             PIC 9(8)    VALUE ZEROS.     00051001
           05  PXRD121-OH-QTY              PIC 9(9)    VALUE ZEROS.     00080004
           05  PXRD121-SCND-UNT-QTY        PIC 9(9)    VALUE ZEROS.     00090004
           05  PXRD121-PRCHG-ID            PIC 9(10)   VALUE ZEROS.     00090106
           05  PXRD121-EXPTED-OH-QTY       PIC 9(7)V99 VALUE ZEROS.     00091004
           05  PXRD121-NW-UNT-RTL-AMT      PIC 9(7)V99 VALUE ZEROS.     00093001
           05  PXRD121-GP-RTL-QTY          PIC 9(4)    VALUE ZEROS.     00094004
           05  PXRD121-GP-RTL-AMT          PIC 9(7)V99 VALUE ZEROS.     00095001
