      ***************************************************************** 00010000
      **MOS CHANGE FILE                                                 00020000
      ** LRECL = 51                                                     00021008
      ***************************************************************** 00022000
       01  PXRD050-DATA-RECORD.                                         00023000
           05  FILLER                      PIC X(02)   VALUE SPACES.    00023102
           05  PXRD050-EVNT-CDE            PIC X(03)   VALUE SPACES.    00024000
           05  PXRD050-EVNT-CTG-CDE        PIC X(03)   VALUE SPACES.    00024101
           05  PXRD050-PRCHG-TYP-CDE       PIC X(03)   VALUE SPACES.    00024201
           05  PXRD050-EVNT-DTE            PIC X(10)   VALUE SPACES.    00025000
           05  PXRD050-STR-NBR             PIC S9(04)  COMP             00026006
                                                       VALUE ZEROS.     00026106
           05  PXRD050-SKU-NBR             PIC S9(08)  COMP-3           00026206
                                                       VALUE ZEROS.     00026306
           05  PXRD050-STR-EXPTED-QTY      PIC S9(09)  COMP             00026406
                                                       VALUE ZEROS.     00026506
           05  PXRD050-PRCHG-ID            PIC S9(09)  COMP             00026606
                                                       VALUE ZEROS.     00026706
           05  PXRD050-NEW-UNT-RTL-AMT     PIC S9(07)V99 COMP-3         00026806
                                                       VALUE ZEROS.     00026906
           05  FILLER                      PIC X(01)   VALUE SPACES.    00027010
           05  PXRD050-NW-GP-RTL-QTY       PIC S9(04)  COMP             00027106
                                                       VALUE ZEROS.     00028006
           05  PXRD050-GP-RTL-QTY-NULL-IND PIC X(01)   VALUE SPACES.    00029006
           05  PXRD050-NW-GP-RTL-AMT       PIC S9(07)V99 COMP-3         00030006
                                                       VALUE ZEROS.     00040006
           05  PXRD050-GP-RTL-AMT-NULL-IND PIC X(01)   VALUE SPACES.    00050006
           05  FILLER                      PIC X(29)   VALUE SPACES.    00060010
