      ***************************************************************** 00010000
      **TRACKING TABLE BEGINNING BALANCE UPDATE RECORD.                 00020002
      ***************************************************************** 00030000
       01  PXRD126-TRKG-UPD-RECORD.                                     00040002
           05  PXRD126-SKU-NBR             PIC 9(08)   VALUE ZEROS.     00050001
           05  PXRD126-STR-NBR             PIC 9(05)   VALUE ZEROS.     00060001
           05  PXRD126-BEG-OH-QTY          PIC S9(07)   VALUE ZEROS.    00070004
           05  PXRD126-END-OH-QTY          PIC S9(07)   VALUE ZEROS.    00071004
           05  PXRD126-END-SCND-QTY        PIC S9(07)   VALUE ZEROS.    00072004
