      *    RECORD PURPOSE: VALID MOS CLEARANCE ITEMS                  * 00010007
      *      RECORD FORMAT.: SEQUENTIAL                               * 00020000
      *      RECORD LENGTH.: 27                                       * 00030009
      *                                                               * 00040000
      ***************************************************************** 00050000
      *    CREATED BY:  JOYCE KNOKE          WR#:                     * 00060000
      *       CREATED:  12/12/2006                                    * 00070007
      ***************************************************************** 00080000
       01  PX032-VALID-MOS-ITEMS.                                       00090007
           05  PX032-SKU-NBR                    PIC S9(08)V COMP-3.     00101007
           05  PX032-LOC-NBR                    PIC S9(04)  COMP.       00101108
           05  PX032-MOS-EFF-DATE               PIC X(10).              00110007
           05  PX032-MOS-END-DATE               PIC X(10).              00120009
