000100*    RECORD PURPOSE: EXTRACT MOS ITEMS                          * 00010013
000200*      RECORD FORMAT.: SEQUENTIAL                               * 00020000
000300*      RECORD LENGTH.: 37                                       * 00030020
000400*                                                               * 00040016
000500***************************************************************** 00050000
000600*    CREATED BY:  TOM PRIMEAU          WR#:                     * 00060009
000700*       CREATED:  04/02/2007                                    * 00070009
000800***************************************************************** 00080000
000900 01  PX036-MOS-EXTRACT-RECORD.                                    00090013
001000     05  PX036-SKU-NBR                    PIC S9(08)V COMP-3.     00101009
001100     05  PX036-STR-NBR                    PIC S9(04)  COMP.       00101113
001200     05  PX036-EFF-BEG-DTE                PIC X(10).              00102013
001220     05  PX036-LAST-UPD-TMST              PIC X(10).                      
001230     05  PX036-EFF-END-DTE                PIC X(10).                      
