      ***************************************************************** 00001002
      **MOS CHANGE FILE                                                 00002002
      ** LRECL = 80                                                     00003002
      ***************************************************************** 00004002
       01  PXRD049-DATA-RECORD.                                         00005002
           05  FILLER                      PIC X(02)   VALUE SPACES.    00006002
           05  PXRD049-EVNT-CDE            PIC X(03)   VALUE SPACES.    00007002
           05  PXRD049-EVNT-CTG-CDE        PIC X(03)   VALUE SPACES.    00008002
           05  PXRD049-PRCHG-TYP-CDE       PIC X(03)   VALUE SPACES.    00009002
           05  PXRD049-EVNT-DTE            PIC X(10)   VALUE SPACES.    00009102
           05  PXRD049-STR-NBR             PIC S9(04)  COMP             00009202
                                                       VALUE ZEROS.     00009302
           05  PXRD049-SKU-NBR             PIC S9(08)  COMP-3           00009402
                                                       VALUE ZEROS.     00009502
           05  PXRD049-STR-EXPTED-QTY      PIC S9(09)  COMP             00009602
                                                       VALUE ZEROS.     00009702
           05  PXRD049-PRCHG-ID            PIC S9(09)  COMP             00009802
                                                       VALUE ZEROS.     00009902
           05  PXRD049-NEW-UNT-RTL-AMT     PIC S9(07)V99 COMP-3         00010002
                                                       VALUE ZEROS.     00010102
           05  PXRD049-NW-GP-RTL-QTY       PIC S9(04)  COMP             00010202
                                                       VALUE ZEROS.     00010302
           05  PXRD049-GP-RTL-QTY-NULL-IND PIC X(01)   VALUE SPACES.    00010402
           05  PXRD049-NW-GP-RTL-AMT       PIC S9(07)V99 COMP-3         00010502
                                                       VALUE ZEROS.     00010602
           05  PXRD049-GP-RTL-AMT-NULL-IND PIC X(01)   VALUE SPACES.    00010702
           05  FILLER                      PIC X(30)   VALUE SPACES.    00010803
