      ***************************************************************** 00010010
      **YELLOW TICKET REPORT FILE LAYOUT                                00020044
      ***************************************************************** 00030010
091305**DATE:09/13/2005 CHANGED BY:JULIE TEWES PRICE OPTIMIZATION       00040046
091305***************************************************************** 00050045
       01  PXRD001-YELLOW-TICKET-REPORT.                                00060044
           05  PXRD001-PRCHG-ID            PIC S9(09)  COMP             00070044
                                                       VALUE ZEROS.     00080034
           05  PXRD001-EFF-DATE            PIC X(10)   VALUE SPACES.    00090044
           05  PXRD001-STR-NBR             PIC S9(04)  COMP             00100044
                                                       VALUE ZEROS.     00110034
           05  PXRD001-LOC-NM              PIC X(20)   VALUE SPACES.    00120044
           05  PXRD001-BUS-AREA-ID         PIC S9(02)  COMP-3           00130044
                                                       VALUE ZEROS.     00140034
           05  PXRD001-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00150044
           05  PXRD001-DEPT-NBR            PIC S9(04)  COMP-3           00160044
                                                       VALUE ZEROS.     00170034
           05  PXRD001-VS-NBR              PIC X(20)   VALUE SPACES.    00180044
           05  PXRD001-LBL-NM              PIC X(20)   VALUE SPACES.    00190044
           05  PXRD001-VS-DESC             PIC X(30)   VALUE SPACES.    00200044
           05  PXRD001-STKR-NBR            PIC S9(09)  COMP             00210044
                                                       VALUE ZEROS.     00220034
           05  PXRD001-SUB-CL-NBR          PIC S9(04)  COMP-3           00230044
                                                       VALUE ZEROS.     00240034
           05  PXRD001-STR-EXPTED-QTY      PIC S9(09)  COMP             00250044
                                                       VALUE ZEROS.     00260034
           05  PXRD001-IN-TRNST-QTY        PIC S9(09)  COMP             00270044
                                                       VALUE ZEROS.     00280036
           05  PXRD001-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00290044
                                                       VALUE ZEROS.     00300034
           05  PXRD001-FULL-STYLE-MKDWN    PIC X(01)   VALUE SPACES.    00310044
               88  PXRD001-FULL-STYLE-MKDWN-YES        VALUE 'Y'.       00320044
               88  PXRD001-FULL-STYLE-MKDWN-NO         VALUE 'N'.       00330044
           05  PXRD001-RECORD-CHANGE       PIC X(01)   VALUE SPACES.    00340044
               88  PXRD001-RECORD-CHANGE-YES           VALUE 'Y'.       00350044
               88  PXRD001-RECORD-CHANGE-NO            VALUE 'N'.       00360044
091305     05  PXRD001-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00370047
091305                                                   VALUE ZEROS.   00380045
