      ***************************************************************** 00010000
      **MOS COMPLIANCE UPDATE DATA FILE FORMAT                          00020001
      ***************************************************************** 00030000
       01  PXRD097-DATA-RECORD.                                         00040000
           05  PXRD097-EVNT-CDE            PIC X(03)   VALUE SPACES.    00061001
           05  PXRD097-EFF-DATE            PIC X(10)   VALUE SPACES.    00070000
           05  PXRD097-STR-NBR             PIC 9(04)   VALUE ZEROS.     00080000
           05  PXRD097-SKU-NBR             PIC 9(08)   VALUE ZEROS.     00090000
           05  PXRD097-SCND-UNT-QTY        PIC 9(09)   VALUE ZEROS.     00101000
