      ***************************************************************** 00010000
      **MOS PXT_PRCHG_EXTR TABLE UPDATE FILE                            00020000
      ***************************************************************** 00030000
       01  PXRD096-PRCHG-EXTR-UPD-FILE.                                 00040001
           05  PXRD096-STR-NBR                PIC 9(05).                00050001
           05  PXRD096-SKU-NBR                PIC 9(08).                00060001
           05  PXRD096-UOW-TYP-CDE            PIC XX.                   00290001
           05  PXRD096-CRE-TMST               PIC X(26).                00300001
           05  PXRD096-PRCD-UNT-QTY           PIC +9(7)V99.             00310002
           05  PXRD096-OLD-UNT-RTL-AMT        PIC +9(7)V99.             00330002
           05  PXRD096-NEW-UNT-RTL-AMT        PIC +9(7)V99.             00350002
