      ***************************************************************** 00010010
      **YELLOW TICKET REPORT SUMMARY FILE                               00020037
      ***************************************************************** 00030010
       01  PXRD022-YELLOW-TICKET-HDR-FILE.                              00040043
           05  PXRD022-EFF-DATE.                                        00050045
               10  PXRD022-EFF-DATE-YEAR   PIC 9(04)   VALUE ZEROS.     00060045
               10  FILLER                  PIC X(01)   VALUE '-'.       00070045
               10  PXRD022-EFF-DATE-MONTH  PIC 9(02)   VALUE ZEROS.     00080045
               10  FILLER                  PIC X(01)   VALUE '-'.       00090045
               10  PXRD022-EFF-DATE-DAY    PIC 9(02)   VALUE ZEROS.     00100045
           05  PXRD022-DMA-1-NM            PIC X(30)   VALUE SPACES.    00110044
           05  PXRD022-DMA-2-NM            PIC X(30)   VALUE SPACES.    00120043
           05  PXRD022-DMA-3-NM            PIC X(30)   VALUE SPACES.    00130043
           05  PXRD022-DMA-4-NM            PIC X(30)   VALUE SPACES.    00140043
           05  PXRD022-DMA-5-NM            PIC X(30)   VALUE SPACES.    00150043
           05  PXRD022-DMA-6-NM            PIC X(30)   VALUE SPACES.    00160043
           05  PXRD022-DMA-7-NM            PIC X(30)   VALUE SPACES.    00170043
           05  PXRD022-DMA-8-NM            PIC X(30)   VALUE SPACES.    00180043
           05  PXRD022-DMA-9-NM            PIC X(30)   VALUE SPACES.    00190043
           05  PXRD022-DMA-10-NM           PIC X(30)   VALUE SPACES.    00200043
           05  PXRD022-DMA-11-NM           PIC X(30)   VALUE SPACES.    00210043
           05  PXRD022-DMA-12-NM           PIC X(30)   VALUE SPACES.    00220043
           05  PXRD022-DMA-13-NM           PIC X(30)   VALUE SPACES.    00230043
           05  PXRD022-DMA-14-NM           PIC X(30)   VALUE SPACES.    00240043
           05  PXRD022-DMA-15-NM           PIC X(30)   VALUE SPACES.    00250046
           05  PXRD022-DMA-16-NM           PIC X(30)   VALUE SPACES.    00260046
           05  PXRD022-DMA-17-NM           PIC X(30)   VALUE SPACES.    00270047
