      ***************************************************************** 00010000
      **MOS UNIT OF WORK FILE                                           00020000
      ***************************************************************** 00030000
       01  PXRD087-UOW-FILE.                                            00040000
           05  FILLER                         PIC X(01).                00050000
           05  PXRD087-STR-NBR                PIC X(05).                00060000
           05  FILLER                         PIC X(02).                00070000
           05  PXRD087-SKU-NBR                PIC X(08).                00080000
           05  FILLER                         PIC X(02).                00090000
           05  PXRD087-UNT-OF-WRK-DEV-ID      PIC X(20).                00100000
           05  FILLER                         PIC X(01).                00110000
           05  PXRD087-ASSOC-ID               PIC X(07).                00120000
           05  FILLER                         PIC X(05).                00121000
           05  PXRD087-UOW-BEG-TMST           PIC X(19).                00121102
           05  FILLER                         PIC X(01).                00121200
           05  PXRD087-UOW-TYP-CDE            PIC XX.                   00121300
           05  FILLER                         PIC X(02).                00121400
           05  PXRD087-SCND-UNT-QTY           PIC 9(8).99.              00121500
           05  FILLER                         PIC X(02).                00121600
           05  PXRD087-OLD-UNT-RTL-AMT        PIC 9(8).99.              00121700
           05  FILLER                         PIC X(02).                00121800
           05  PXRD087-NEW-UNT-RTL-AMT        PIC 9(8).99.              00121900
           05  FILLER                         PIC X(01).                00122000
           05  PXRD087-UOW-STAT-CDE           PIC X(2).                 00123000
           05  FILLER                         PIC X(01).                00124000
           05  PXRD087-ML-TRN-CDE             PIC X(3).                 00125000
           05  FILLER                         PIC X(02).                00126000
           05  PXRD087-MOS-TRN-SCN-SEQ-NBR    PIC 9(6).                 00127000
