      ***************************************************************** 00010000
      **MOS MERGED EVENT/UOW FILE                                       00020000
      ***************************************************************** 00030000
       01  PXRD088-MERGED-EVENT-UOW-FILE.                               00040000
           05  PXRD088-STR-NBR                PIC 9(05).                00050000
           05  PXRD088-SKU-NBR                PIC 9(08).                00060000
           05  PXRD088-MOS-BEG-DATE           PIC X(10).                00070000
           05  PXRD088-DAYS-SINCE-EVENT       PIC S9(7)   COMP-3.       00080000
           05  PXRD088-DAYS-SINCE-INV-STRT    PIC S9(7)   COMP-3.       00090000
           05  PXRD088-DAYS-SINCE-INV-END     PIC S9(7)   COMP-3.       00100000
           05  PXRD088-UNT-OF-WRK-DEV-ID      PIC X(20).                00110000
           05  PXRD088-ASSOC-ID               PIC X(07).                00120000
           05  PXRD088-UOW-BEG-TMST           PIC X(26).                00130000
           05  PXRD088-UOW-TYP-CDE            PIC XX.                   00140000
           05  PXRD088-SCND-UNT-QTY           PIC S9(7)V99 COMP-3.      00150000
           05  PXRD088-OLD-UNT-RTL-AMT        PIC 9(7)V99 COMP-3.       00160000
           05  PXRD088-NEW-UNT-RTL-AMT        PIC 9(7)V99 COMP-3.       00170000
           05  PXRD088-UOW-STAT-CDE           PIC X(2).                 00180000
           05  PXRD088-ML-TRN-CDE             PIC X(3).                 00190000
           05  PXRD088-MOS-TRN-SCN-SEQ-NBR    PIC 9(6).                 00200000
           05  PXRD088-MOS-EVENT-FOUND-IND    PIC X.                    00210000
               88  PXRD088-MOS-EVENT-FOUND     VALUE 'Y'.               00220000
               88  PXRD088-MOS-EVENT-NOT-FOUND VALUE 'N'.               00230000
           05  PXRD088-REPROCESS-IND          PIC X.                    00240000
               88  PXRD088-REPROCESS-YES       VALUE 'Y'.               00250000
               88  PXRD088-REPROCESS-NO        VALUE 'N'.               00260000
