000100***************************************************************** 00010000
000200**YELLOW AND WHITE TICKET PRICE CHANGE REPORT SUMMARY FILE        00020000
000300***************************************************************** 00030000
000400 01  PXRD020-YELLOW-TICKET-SUM-FILE.                              00040000
000500     05  PXRD020-STR-NBR             PIC S9(04)  COMP             00050000
000600                                                 VALUE ZEROS.     00060000
000700     05  PXRD020-LOC-NM              PIC X(20)   VALUE SPACES.    00070000
000800     05  PXRD020-DMA-NBR             PIC S9(04)V COMP-3           00080000
000900                                                 VALUE ZEROS.     00090000
001000     05  PXRD020-DMA-NM              PIC X(30)   VALUE ZEROS.     00100000
001100     05  PXRD020-STR-EXPTED-QTY      PIC S9(09)  COMP             00110000
001200                                                 VALUE ZEROS.     00120000
001500     05  PXRD020-IN-TRNST-QTY        PIC S9(09)  COMP             00330000
001600                                                 VALUE ZEROS.     00340000
