      ***************************************************************** 00010000
      **YELLOW TICKET ONHAND QTY ADJUSTMENT FILE                        00020001
      ***************************************************************** 00030000
       01  PXRD124-OH-ADJ-RECORD.                                       00040005
           05  FILLER                      PIC X     VALUE SPACE.       00050404
           05  PXRD124-SKU-NBR             PIC 9(8)  VALUE ZERO.        00050506
           05  FILLER                      PIC XX    VALUE SPACE.       00050704
           05  PXRD124-STR-NBR             PIC 9(5)  VALUE ZERO.        00050806
           05  FILLER                      PIC X     VALUE SPACE.       00051004
           05  PXRD124-OH-ADJ-QTY          PIC -9(8)  VALUE ZERO.       00051208
