      ***************************************************************** 00010000
      *    PXRD034 - PARAMETER IN CARD                                  00020000
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      ***************************************************************** 00080000
       01  PX034-PARAMETER-IN-RECORD.                                   00090000
           05  PX034-BF-CDE                       PIC  X(03) VALUE      00093000
                                                             SPACES.    00094000
           05  FILLER                             PIC  X(01) VALUE      00094100
                                                             SPACES.    00094200
           05  PX034-EVNT-CDE                     PIC  X(03) VALUE      00094300
                                                             SPACES.    00094400
           05  FILLER                             PIC  X(01) VALUE      00094501
                                                             SPACES.    00094601
           05  PX034-OUTPUT-FORMAT-CDE            PIC  X(01) VALUE      00094701
                                                             SPACES.    00094801
           05  FILLER                             PIC  X(71) VALUE      00098001
                                                             SPACES.    00099000
