      ***************************************************************** 00010000
      **TRUNCATED FILE FORMAT FOR PRICE CHANGE FILE REPORTING           00020000
      ***************************************************************** 00030000
       01  PXRD041-TRUNCATED-RECORD.                                    00080000
           05  PXRD041-PRCHG-ID            PIC S9(09)  COMP             00090000
                                                       VALUE ZEROS.     00100000
           05  PXRD041-STR-GP-TYP-CDE      PIC S9(04)  COMP             00110000
                                                       VALUE ZEROS.     00120000
           05  PXRD041-STR-GP-ID           PIC S9(04)  COMP             00130000
                                                       VALUE ZEROS.     00140000
           05  PXRD041-EFF-DATE            PIC X(10)   VALUE SPACES.    00150000
           05  PXRD041-STR-NBR             PIC S9(04)  COMP             00160000
                                                       VALUE ZEROS.     00170000
           05  PXRD041-LOC-NM              PIC X(20)   VALUE SPACES.    00180000
           05  PXRD041-BUS-AREA-ID         PIC S9(02)  COMP-3           00190000
                                                       VALUE ZEROS.     00200000
           05  PXRD041-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00210000
           05  PXRD041-DEPT-NBR            PIC S9(04)  COMP-3           00220000
                                                       VALUE ZEROS.     00230000
           05  PXRD041-VS-NBR              PIC X(20)   VALUE SPACES.    00240000
           05  PXRD041-LBL-NM              PIC X(20)   VALUE SPACES.    00250000
           05  PXRD041-VS-DESC             PIC X(30)   VALUE SPACES.    00260000
           05  PXRD041-STKR-NBR            PIC S9(09)  COMP             00270000
                                                       VALUE ZEROS.     00280000
           05  PXRD041-SUB-CL-NBR          PIC S9(04)  COMP-3           00290000
                                                       VALUE ZEROS.     00300000
           05  PXRD041-STR-EXPTED-QTY      PIC S9(09)  COMP             00310000
                                                       VALUE ZEROS.     00320000
           05  PXRD041-IN-TRNST-QTY        PIC S9(09)  COMP             00330000
                                                       VALUE ZEROS.     00340000
           05  PXRD041-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00350000
                                                       VALUE ZEROS.     00360000
           05  FILLER                      PIC X(01)   VALUE SPACES.    00370001
           05  PXRD041-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.    00380001
           05  PXRD041-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00390001
                                                         VALUE ZEROS.   00400001
           05  FILLER                      PIC X(01)   VALUE SPACES.    00410001
