      ***************************************************************** 00010000
      **WHITE TICKET REPORT DETAIL FILE LAYOUT FOR NEW STORES           00020000
      ***************************************************************** 00030000
      **DATE:06/13/2012 CREATED BY: D WELLER                            00040000
      ***************************************************************** 00050000
       01  PXRD141-WHITE-TICKET-REC.                                    00060005
           05  PXRD141-STR-NBR             PIC S9(04)  COMP             00060100
                                                       VALUE ZEROS.     00060200
           05  PXRD141-INTR-UPC-ID         PIC S9(09) COMP              00060306
                                                       VALUE ZEROS.     00060400
           05  PXRD141-PRCHG-ID            PIC S9(09)  COMP             00070000
                                                       VALUE ZEROS.     00080000
           05  PXRD141-EFF-DATE            PIC X(10)   VALUE SPACES.    00090000
           05  PXRD141-LOC-NM              PIC X(20)   VALUE SPACES.    00120000
           05  PXRD141-BUS-AREA-ID         PIC S9(02)  COMP-3           00130000
                                                       VALUE ZEROS.     00140000
           05  PXRD141-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00150000
           05  PXRD141-DEPT-NBR            PIC S9(04)  COMP-3           00160000
                                                       VALUE ZEROS.     00170000
           05  PXRD141-DEPT-NM             PIC X(20)   VALUE SPACES.    00171000
           05  PXRD141-VS-NBR              PIC X(20)   VALUE SPACES.    00180000
           05  PXRD141-LBL-NM              PIC X(20)   VALUE SPACES.    00190000
           05  PXRD141-VS-DESC             PIC X(30)   VALUE SPACES.    00200000
           05  PXRD141-STKR-NBR            PIC S9(09)  COMP             00210000
                                                       VALUE ZEROS.     00220000
           05  PXRD141-SUB-CL-NBR          PIC S9(04)  COMP-3           00230000
                                                       VALUE ZEROS.     00240000
           05  PXRD141-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00290000
                                                       VALUE ZEROS.     00300000
           05  FILLER                      PIC X(01)   VALUE SPACES.    00301003
           05  PXRD141-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.    00310000
           05  FILLER                      PIC X(02)   VALUE SPACES.    00320004
           05  PXRD141-STR-OH-QTY          PIC S9(09)  VALUE ZEROS.     00362004
           05  FILLER                      PIC X(40)   VALUE SPACES.    00363002
