      ***************************************************************** 00010000
      **STORE EVENT EFFICIENCY REPORT EXTRACT FILE                      00020001
      ***************************************************************** 00030000
       01  PXRD122-EVNT-EFF-EXTR-FILE.                                  00040001
           05  PXRD122-CTG-CDE             PIC X(3)    VALUE SPACE.     00041001
           05  PXRD122-EVNT-TYPE-CDE       PIC X(3)    VALUE SPACE.     00041101
           05  PXRD122-EVNT-CDE            PIC X(3)    VALUE SPACE.     00041201
           05  PXRD122-EVNT-DTE            PIC X(19)   VALUE SPACE.     00050103
           05  FILLER                      PIC X(1)    VALUE SPACE.     00050201
           05  PXRD122-STR-NBR             PIC 9(4)    VALUE ZEROS.     00050303
           05  FILLER                      PIC X(1)    VALUE SPACE.     00050403
           05  PXRD122-BEG-OH-QTY          PIC 9(6)    VALUE ZEROS.     00051002
           05  FILLER                      PIC X(1)    VALUE SPACE.     00052001
           05  PXRD122-SCND-QTY            PIC 9(6)    VALUE ZEROS.     00080001
           05  FILLER                      PIC X(1)    VALUE SPACE.     00081001
           05  PXRD122-END-OH-QTY          PIC 9(6)    VALUE ZEROS.     00090001
           05  FILLER                      PIC X(1)    VALUE SPACE.     00090101
           05  PXRD122-PCT-OH-FND          PIC 9(3).99 VALUE ZEROS.     00090205
           05  PXRD122-MARK-TYP-CDE        PIC X       VALUE SPACE.     00091001
