      ***************************************************************** 00010000
      **MOS EVENT FILE                                                  00020000
      ***************************************************************** 00030000
       01  PXRD083-EVENT-FILE.                                          00040000
           05  PXRD083-STR-NBR                PIC X(05).                00050000
           05  PXRD083-SKU-NBR                PIC X(08).                00060000
           05  PXRD083-MOS-BEG-DATE           PIC X(10).                00070002
           05  PXRD083-DAYS-SINCE-EVENT       PIC S9(7)   COMP-3.       00090000
           05  PXRD083-DAYS-SINCE-EVENT-NL    PIC X.                    00100000
           05  PXRD083-DAYS-SINCE-INV-STRT    PIC S9(11)  COMP-3.       00110001
           05  PXRD083-DAYS-SINCE-INV-STRT-NL PIC X.                    00120000
           05  PXRD083-DAYS-SINCE-INV-END     PIC S9(11)  COMP-3.       00130004
           05  PXRD083-DAYS-SINCE-INV-END-NL  PIC X.                    00140000
