      ***************************************************************** 00010000
      **STORE EVENT EFFICIENCY CSV FILE                                 00020001
      ***************************************************************** 00030000
       01  PXRD123-PRCHG-CSV-FILE.                                      00040002
           05  PXRD123-EVNT-DTE            PIC X(10)   VALUE SPACE.     00050001
           05  FILLER                      PIC X(1)    VALUE ','.       00050101
           05  PXRD123-STR-NBR             PIC ZZZ9    VALUE ZEROS.     00050301
           05  FILLER                      PIC X(1)    VALUE ','.       00050401
           05  PXRD123-DIST-NBR            PIC ZZZ9    VALUE ZEROS.     00050503
           05  FILLER                      PIC X(1)    VALUE ','.       00050603
           05  PXRD123-REGN-NBR            PIC ZZZ9    VALUE ZEROS.     00050703
           05  FILLER                      PIC X(1)    VALUE ','.       00050803
           05  PXRD123-TERR-NBR            PIC ZZZ9    VALUE ZEROS.     00050903
           05  FILLER                      PIC X(1)    VALUE ','.       00051003
           05  PXRD123-BEG-OH-QTY          PIC ZZZZZ9  VALUE ZEROS.     00051103
           05  FILLER                      PIC X(1)    VALUE ','.       00051203
           05  PXRD123-SCND-QTY            PIC ZZZZZ9  VALUE ZEROS.     00080001
           05  FILLER                      PIC X(1)    VALUE ','.       00080101
           05  PXRD123-END-OH-QTY          PIC ZZZZZ9  VALUE ZEROS.     00090001
           05  FILLER                      PIC X(1)    VALUE ','.       00090101
           05  PXRD123-PCT-OH-FND          PIC ZZZ.99  VALUE ZEROS.     00090301
           05  FILLER                      PIC X(1)    VALUE ','.       00090401
           05  PXRD123-INV-DTE             PIC X(10)   VALUE SPACE.     00090501
           05  FILLER                      PIC X(1)    VALUE ','.       00090601
