      ***************************************************************** 00010000
      *    PXRD033 - BMCUNLOAD CARD                                     00020000
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      * WR30069 04/02/2007 D WELLER    PRODUCE VARIETY OF OUTPUTS       00071000
      * WR30069 04/12/2007 D WELLER    PRODUCE OUTPUT FORMAT 3          00072000
      * WR30069 02/09/2010 COGNIZANT   MODIFIED BMCUNLOAD PARAMETER CARD00073000
      *                                HARD CODE WITH EFFECTIVE DATE    00074000
      ***************************************************************** 00080000
       01  PX033-BMCUNLOAD-REC.                                         00090001
           05  FILLER                             PIC  X(02) VALUE      00091000
                                                             SPACES.    00092000
           05  PX033-BMCLOAD-REC                  PIC  X(22) VALUE      00100005
                                                             SPACES.    00100101
               88 PX033-BMCLOD-COND-1                        VALUE      00100201
                   'AND B.PRCHG_EFF_DTE = '.                            00101000
               88 PX033-BMCLOD-COND-2                        VALUE      00101101
                   '  AND A.EFF_BEG_DTE = '.                            00101203
               88 PX033-BMCLOD-COND-3                        VALUE      00101301
                   ' WHERE (EFF_BEG_DTE < '.                            00101403
           05 FILLER                              PIC  X(01) VALUE      00101501
                   "'".                                                 00101601
           05  PX033-DATE-FR-EVNT-NBR             PIC  X(10) VALUE      00101701
                                                             SPACES.    00101801
           05 FILLER                              PIC  X(01) VALUE      00102200
                   "'".                                                 00102300
           05  FILLER                             PIC  X(44) VALUE      00102400
                                                             SPACES.    00102501
