      ***************************************************************** 00010010
      **YELLOW TICKET BMC UNLOAD FILE FORMAT                            00020034
      ***************************************************************** 00030010
051205**DATE:05/12/2005 CHANGED BY: JULIE TEWES ADDED 2 COLUMNS         00040042
051205***************************************************************** 00050042
091305**DATE:08/13/2005 CHANGED BY: JULIE TEWES PRICE OPTIMIZATION      00060046
091305***************************************************************** 00070046
       01  PXRD005-YELLOW-TICKET-UNLOAD.                                00080035
           05  PXRD005-PRCHG-ID            PIC S9(09)  COMP             00090035
                                                       VALUE ZEROS.     00100034
           05  PXRD005-EFF-DATE            PIC X(10)   VALUE SPACES.    00110035
           05  PXRD005-STR-NBR             PIC S9(04)  COMP             00120035
                                                       VALUE ZEROS.     00130034
           05  PXRD005-LOC-NM              PIC X(20)   VALUE SPACES.    00140035
           05  PXRD005-BUS-AREA-ID         PIC S9(02)  COMP-3           00150035
                                                       VALUE ZEROS.     00160034
           05  PXRD005-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00170035
           05  PXRD005-DEPT-NBR            PIC S9(04)  COMP-3           00180035
                                                       VALUE ZEROS.     00190034
           05  PXRD005-VS-NBR              PIC X(20)   VALUE SPACES.    00200035
           05  PXRD005-LBL-NM              PIC X(20)   VALUE SPACES.    00210035
           05  PXRD005-VS-DESC             PIC X(30)   VALUE SPACES.    00220035
           05  PXRD005-STKR-NBR            PIC S9(09)  COMP             00230035
                                                       VALUE ZEROS.     00240034
           05  PXRD005-SUB-CL-NBR          PIC S9(04)  COMP-3           00250035
                                                       VALUE ZEROS.     00260034
           05  PXRD005-STR-EXPTED-QTY      PIC S9(09)  COMP             00270035
                                                       VALUE ZEROS.     00280034
           05  PXRD005-IN-TRNST-QTY        PIC S9(09)  COMP             00290037
                                                       VALUE ZEROS.     00300036
           05  PXRD005-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00310035
                                                       VALUE ZEROS.     00320034
           05  PXRD005-FULL-STYLE-MKDWN    PIC X(01)   VALUE SPACES.    00330035
               88  PXRD005-FULL-STYLE-MKDWN-YES        VALUE 'Y'.       00340035
               88  PXRD005-FULL-STYLE-MKDWN-NO         VALUE 'N'.       00350035
051205     05  PXRD005-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.    00360045
091305     05  PXRD005-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00370047
091305                                                   VALUE ZEROS.   00380046
