      ***************************************************************** 00010000
      **MISSING SKU UNLOAD FILE                                         00020002
      ***************************************************************** 00030000
       01  PXRD120-MSSG-SKU-FILE.                                       00040003
           05  PXRD120-STR-NBR             PIC X(5)    VALUE SPACES.    00060003
           05  FILLER                      PIC X(1)    VALUE SPACES.    00060105
           05  PXRD120-SKU-NBR             PIC X(8)    VALUE SPACES.    00060205
           05  PXRD120-CRE-TMST            PIC X(26)   VALUE SPACES.    00061008
           05  FILLER                      PIC X(1)    VALUE SPACES.    00061105
           05  PXRD120-SCND-UNT-QTY        PIC 9(6)    VALUE ZEROS.     00062006
