      ***************************************************************** 00010000
      **PRICE CHANGE BMC UNLOAD FILE FORMAT                             00020000
      ***************************************************************** 00030000
       01  PXRD040-EXTRACT-RECORD.                                      00080001
           05  PXRD040-PRCHG-ID            PIC S9(09)  COMP             00090000
                                                       VALUE ZEROS.     00100000
           05  PXRD040-STR-GP-TYP-CDE      PIC S9(04)  COMP             00110000
                                                       VALUE ZEROS.     00120000
           05  PXRD040-STR-GP-ID           PIC S9(04)  COMP             00130000
                                                       VALUE ZEROS.     00140000
           05  PXRD040-EFF-DATE            PIC X(10)   VALUE SPACES.    00150000
           05  PXRD040-STR-NBR             PIC S9(04)  COMP             00160000
                                                       VALUE ZEROS.     00170000
           05  PXRD040-LOC-NM              PIC X(20)   VALUE SPACES.    00180000
           05  PXRD040-BUS-AREA-ID         PIC S9(02)  COMP-3           00190000
                                                       VALUE ZEROS.     00200000
           05  PXRD040-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00210000
           05  PXRD040-DEPT-NBR            PIC S9(04)  COMP-3           00220000
                                                       VALUE ZEROS.     00230000
           05  PXRD040-VS-NBR              PIC X(20)   VALUE SPACES.    00240000
           05  PXRD040-LBL-NM              PIC X(20)   VALUE SPACES.    00250000
           05  PXRD040-VS-DESC             PIC X(30)   VALUE SPACES.    00260000
           05  PXRD040-STKR-NBR            PIC S9(09)  COMP             00270000
                                                       VALUE ZEROS.     00280000
           05  PXRD040-SUB-CL-NBR          PIC S9(04)  COMP-3           00290000
                                                       VALUE ZEROS.     00300000
           05  PXRD040-STR-EXPTED-QTY      PIC S9(09)  COMP             00310000
                                                       VALUE ZEROS.     00320000
           05  PXRD040-IN-TRNST-QTY        PIC S9(09)  COMP             00330000
                                                       VALUE ZEROS.     00340000
           05  PXRD040-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00350000
                                                       VALUE ZEROS.     00360000
           05  FILLER                      PIC X(01)   VALUE SPACES.    00370000
           05  PXRD040-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.    00380000
           05  PXRD040-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00390000
                                                         VALUE ZEROS.   00400000
           05  PXRD040-LAST-NCLR-NULL-IND  PIC X(01)   VALUE SPACES.    00410013
           05  PXRD040-EVNT-CTG-CDE        PIC X(03)   VALUE SPACES.    00420002
           05  PXRD040-PRCHG-TYP-CDE       PIC X(03)   VALUE SPACES.    00430002
           05  PXRD040-SKU-NBR             PIC S9(08)    COMP-3         00440003
                                                         VALUE ZEROS.   00450000
           05  PXRD040-GP-RTL-QTY          PIC S9(04)    COMP           00471009
                                                         VALUE ZEROS.   00471111
           05  PXRD040-GP-RTL-QTY-NULL-IND PIC X(01)     VALUE SPACES.  00471212
           05  PXRD040-GP-RTL-AMT          PIC S9(07)V99 COMP-3         00480008
                                                         VALUE ZEROS.   00490004
           05  PXRD040-GP-RTL-AMT-NULL-IND PIC X(01)     VALUE SPACES.  00500012
