      ***************************************************************** 00010010
      **YELLOW TICKET BMC UNLOAD FILE FORMAT                            00020034
      ***************************************************************** 00030037
051205**DATE:05/12/2005 CHANGED BY: JULIE TEWES ADDED 2 COLUMNS         00040037
051205***************************************************************** 00050037
091305**DATE:09/13/2005 CHANGED BY: JULIE TEWES PRICE OPTIMIZATION      00060043
091305***************************************************************** 00070043
       01  PXRD004-YELLOW-TICKET-UNLOAD.                                00080034
           05  PXRD004-PRCHG-ID            PIC S9(09)  COMP             00090034
                                                       VALUE ZEROS.     00100034
           05  PXRD004-STR-GP-TYP-CDE      PIC S9(04)  COMP             00110036
                                                       VALUE ZEROS.     00120036
           05  PXRD004-STR-GP-ID           PIC S9(04)  COMP             00130036
                                                       VALUE ZEROS.     00140036
           05  PXRD004-EFF-DATE            PIC X(10)   VALUE SPACES.    00150036
           05  PXRD004-STR-NBR             PIC S9(04)  COMP             00160034
                                                       VALUE ZEROS.     00170034
           05  PXRD004-LOC-NM              PIC X(20)   VALUE SPACES.    00180034
           05  PXRD004-BUS-AREA-ID         PIC S9(02)  COMP-3           00190034
                                                       VALUE ZEROS.     00200034
           05  PXRD004-BUS-AREA-DESC       PIC X(25)   VALUE SPACES.    00210034
           05  PXRD004-DEPT-NBR            PIC S9(04)  COMP-3           00220034
                                                       VALUE ZEROS.     00230034
           05  PXRD004-VS-NBR              PIC X(20)   VALUE SPACES.    00240034
           05  PXRD004-LBL-NM              PIC X(20)   VALUE SPACES.    00250034
           05  PXRD004-VS-DESC             PIC X(30)   VALUE SPACES.    00260034
           05  PXRD004-STKR-NBR            PIC S9(09)  COMP             00270034
                                                       VALUE ZEROS.     00280034
           05  PXRD004-SUB-CL-NBR          PIC S9(04)  COMP-3           00290034
                                                       VALUE ZEROS.     00300034
           05  PXRD004-STR-EXPTED-QTY      PIC S9(09)  COMP             00310034
                                                       VALUE ZEROS.     00320034
           05  PXRD004-IN-TRNST-QTY        PIC S9(09)  COMP             00330035
                                                       VALUE ZEROS.     00340035
           05  PXRD004-UNT-RTL-AMT         PIC S9(07)V99 COMP-3         00350034
                                                       VALUE ZEROS.     00360034
051205     05  FILLER                      PIC X(01)   VALUE SPACES.    00370042
051205     05  PXRD004-LAST-UPD-TMST       PIC X(26)   VALUE SPACES.    00380039
091305     05  PXRD004-LAST-NCLR-RTL-AMT   PIC S9(07)V99 COMP-3         00390045
091305                                                   VALUE ZEROS.   00400045
091305     05  FILLER                      PIC X(01)   VALUE SPACES.    00410043
