      ***************************************************************** 00010000
      *    PXRD043 - COMMON FILE FORMAT USED FOR DELETES TO             00020000
      *              ORACLE TABLES:                                     00021000
      *        PXT_EVNT                                                 00022000
      *        PXT_EVNT_STR_MDSE                                        00023000
      *                                                                 00024000
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      ***************************************************************** 00080000
       01  PX043-RECORD.                                                00090011
           05  FILLER                             PIC  X(02) VALUE      00090103
                                                             SPACES.    00090201
           05  PX043-CDE                          PIC  X(01) VALUE      00091011
                                                             SPACES.    00092000
           05  PX043-PRCHG-TYP-CDE                PIC  X(03) VALUE      00093001
                                                             SPACES.    00094000
           05  PX043-EVNT-CTG-CDE                 PIC  X(03) VALUE      00094101
                                                             SPACES.    00094200
           05  PX043-PRCHG-EFF-DTE.                                     00094501
               10  PX043-PRCHG-EFF-YR             PIC  9(04) VALUE      00094601
                                                             ZEROS.     00094701
               10  FILLER                         PIC  X(01) VALUE      00094801
                                                             SPACES.    00094901
               10  PX043-PRCHG-EFF-MTH            PIC  9(02) VALUE      00095001
                                                             ZEROES.    00095101
               10  FILLER                         PIC  X(01) VALUE      00095201
                                                             SPACES.    00095301
               10  PX043-PRCHG-EFF-DAY            PIC  9(02) VALUE      00095401
                                                             ZEROES.    00095501
           05  FILLER                             PIC  X(03) VALUE      00095607
                                                             SPACES.    00095707
           05  PX043-STR-NBR                      PIC  9(05) VALUE      00095807
                                                             ZEROES.    00095901
           05  FILLER                             PIC  X(03) VALUE      00096007
                                                             SPACES.    00096107
           05  PX043-SKU-NBR                      PIC  9(08) VALUE      00096207
                                                             ZEROES.    00096301
           05  FILLER                             PIC  X(42) VALUE      00096510
                                                             SPACES.    00097010
