      ***************************************************************** 00010000
      *    PXRD092 - PARAMETER IN CARD                                  00020000
      *    RECORD LENGTH - 80 BYTES                                     00030000
      *                                                                 00040000
      *CHANGE HISTORY:                                                  00050000
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES           00060000
      * ------- ---------- ----------- -------------------------------- 00070000
      ***************************************************************** 00080000
       01  PX092-PARAMETER-RECORD.                                      00090000
           05  PX092-CTG-CDE                      PIC  X(03) VALUE      00091000
                                                             SPACES.    00092000
           05  FILLER                             PIC  X(01) VALUE      00093000
                                                             SPACES.    00094000
           05  PX092-TYP-CDE                      PIC  X(03) VALUE      00094100
                                                             SPACES.    00094200
           05  FILLER                             PIC  X(73) VALUE      00094300
                                                             SPACES.    00094400
