      ***************************************************************** 00010010
      **YELLOW TICKET REPORT SUMMARY % FILE                             00020043
      ***************************************************************** 00030010
       01  PXRD023-YELLOW-TICKET-FILE.                                  00040044
           05  PXRD023-STR-NBR             PIC S9(04)  COMP             00050043
                                                       VALUE ZEROS.     00060043
           05  PXRD023-LOC-NM              PIC X(20)   VALUE SPACES.    00070043
           05  PXRD023-DMA-NBR             PIC S9(04)V COMP-3           00080044
                                                       VALUE ZEROS.     00090044
           05  PXRD023-DMA-NM              PIC X(30)   VALUE ZEROS.     00100044
           05  PXRD023-STR-EXPTED-QTY      PIC S9(09)  COMP             00110043
                                                       VALUE ZEROS.     00120044
           05  PXRD023-PERCENT-OFF         PIC S9(04)  COMP-3           00130044
                                                       VALUE ZEROS.     00140044
