      ***************************************************************** 00010000
      ** CONSOLIDATION REPORTS PROCESSING                               00020000
      ** WR37816 SUMMER 2010                                            00021000
      ***************************************************************** 00022000
      ** PURPOSE: STR REPORT DATA FILE LAYOUT                           00022100
      ** RECL: 171                                                      00022305
      ***************************************************************** 00022602
       01  PXRD104-STR-CNSLDTN-RPT-DATA.                                00022702
           05  PXRD104-CONSOLIDATE-EFF-DTE PIC X(10) VALUE SPACES.      00022802
           05  PXRD104-STORE-NBR           PIC 9(04) VALUE ZEROS.       00022902
           05  PXRD104-SKU-NBR             PIC 9(08) VALUE ZEROS.       00023104
           05  PXRD104-FLOOR-PAD-CDE       PIC X(02) VALUE SPACES.      00023204
           05  PXRD104-FLOOR-PAD-DESC      PIC X(25) VALUE SPACES.      00023304
           05  PXRD104-DEPT-NBR            PIC 9(04) VALUE ZEROS.       00023404
           05  PXRD104-DEPT-DESC           PIC X(20) VALUE SPACES.      00023504
           05  PXRD104-SUB-CL-NBR          PIC 9(04) VALUE ZEROS.       00023604
           05  PXRD104-SUB-CL-DESC         PIC X(20) VALUE SPACES.      00023704
           05  PXRD104-LABEL-NAME          PIC X(20) VALUE SPACES.      00023804
           05  PXRD104-VS-STYLE-NBR        PIC X(20) VALUE SPACES.      00023904
           05  PXRD104-VS-STYLE-DESC       PIC X(30) VALUE SPACES.      00024004
           05  PXRD104-FS-ON-HANDS-QTY     PIC S9(7)V COMP-3.           00025004
      ***************************************************************** 00061000
