000100*****************************************************************         
000200**RECORD LAYOUT FOR ITEMS WITH UPCOMING WHITE OR YELLOW TICKET            
000210**PRICE CHANGES.                                                          
000300*****************************************************************         
000400 01  PXRD100-STR-PRCHG-FORMAT.                                            
000500     05  PXRD100-STR-PRCHG-STR-NBR       PIC S9(04) COMP                  
000600                                         VALUE ZEROS.                     
000700     05  PXRD100-STR-PRCHG-INTR-UPC-ID   PIC S9(09) COMP                  
000800                                         VALUE ZEROS.                     
001100     05  PXRD100-STR-PRCHG-SKU-NBR       PIC S9(8)V COMP-3                
001200                                         VALUE ZEROS.                     
