      *---------------------------------------------------------------          
      *         C O P Y B O O K   P X W S 0 0 1                                 
      *---------------------------------------------------------------          
      ****************************************************************          
      *                                                              *          
      *     ORACLE SET UP WORKING STORAGE FIELDS FOR SYSTEM ID: PX.  *          
      *     THIS COPYBOOK CONTAINS ALL THE WORKING STORAGE VALUES    *          
      *     USED BY THE PXPD001 COPYBOOK ROUTINES.                   *          
      *                                                              *          
      *     03/20/2007 - DAVID WELLER                                *          
      *       INITIAL CREATION.                                      *          
      ****************************************************************          
      *                                                                         
      *----------------------------------------------------------               
      * PX001- PROGRAM CONSTANTS                                                
      *----------------------------------------------------------               
       01  PX001-PROGRAM-SWITCHES.                                              
           05  PS-ORA-SRC-CTL-DONE-SW  PIC  X(01)      VALUE 'N'.               
               88  PS-ORA-SRC-EMPTY                    VALUE 'Y'.               
                                                                                
       01  PX001-PROGRAM-VARIABLES.                                             
           05  PX001-EDIT-ORA-SOURCE   PIC  X(04)      VALUE SPACES.            
               88  VALID-ORACLE-CONNECT-STRING                                  
                                            VALUES 'PRD ', 'TST ',              
                                                   'LRN ', 'QA  ',              
                                                   'PRDT'.                      
               88  VALID-DEVELOPMENT-REGION VALUES 'TST ',                      
                                                   'LRN ', 'QA  ',              
                                                   'PRDT'.                      
               88  ORA-PROD-REGION          VALUE 'PRD '.                       
                                                                                
       01  PX001-ORACLE-SOURCE-RECORD.                                          
           05  PX001-ORA-SRC-SYSTEM    PIC  X(04).                              
           05  FILLER                  PIC  X(01).                              
           05  PX001-ORA-USER-NAME     PIC  X(08).                              
           05  FILLER                  PIC  X(01).                              
           05  PX001-ORA-USER-LGTH     PIC  9(02).                              
           05  FILLER                  PIC  X(01).                              
           05  PX001-ORA-PASSWORD      PIC  X(08).                              
           05  FILLER                  PIC  X(01).                              
           05  PX001-ORA-PASSWORD-LGTH PIC  9(02).                              
           05  FILLER                  PIC  X(01).                              
           05  PX001-ORA-REST-RECORD   PIC  X(51).                              
                                                                                
