*          DATA SET RCKM263    AT LEVEL 004 AS OF 03/31/95                      
*          DATA SET RCKM263    AT LEVEL 003 AS OF 02/26/93              00001   
        PRINT  NOGEN                                                    00002   
RCKM263 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
RC263A  DFHMDI LINE=2,COLUMN=1,                                        C00010   
               SIZE=(19,80),                                           C00011   
               CTRL=(FREEKB),                                          C00012   
               MAPATTS=(COLOR,HILIGHT),                                C00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015**4
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**4
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**4
               COLOR=GREEN,                                            C00019**4
               HILIGHT=UNDERLINE,                                      C00020**4
               PICOUT='ZZZZ9'                                           00021**4
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**4
               COLOR=NEUTRAL,                                          C00023**4
               INITIAL='TO'                                             00024**4
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**4
               COLOR=BLUE,                                             C00026**4
               PICOUT='ZZZZ9'                                           00027**4
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**4
               COLOR=NEUTRAL,                                          C00029**4
               INITIAL='OF'                                             00030**4
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**4
               COLOR=BLUE,                                             C00032**4
               PICOUT='ZZZZ9'                                           00033**4
**************                                                          00034   
        DFHMDF POS=(03,05),LENGTH=11,ATTRB=(ASKIP,NORM),               C00035**4
               COLOR=NEUTRAL,INITIAL='OWNER SCAC:'                      00036   
AOWSCAC DFHMDF POS=(03,18),LENGTH=04,ATTRB=(ASKIP,NORM),               C00037**4
               COLOR=BLUE                                               00038   
        DFHMDF POS=(03,26),LENGTH=16,ATTRB=(ASKIP,NORM),               C00039**2
               COLOR=NEUTRAL,INITIAL='LAST UPDATED BY:'                 00040   
AUPDUID DFHMDF POS=(03,44),LENGTH=08,ATTRB=(ASKIP,NORM),               C00041**2
               COLOR=BLUE                                               00042**2
AUPDNME DFHMDF POS=(03,54),LENGTH=20,ATTRB=(ASKIP,NORM),               C00043**2
               COLOR=BLUE                                               00044**2
*                                                                       00045   
        DFHMDF POS=(04,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00046**2
               COLOR=NEUTRAL,INITIAL='BOL:'                             00047**2
ABOL    DFHMDF POS=(04,11),LENGTH=22,ATTRB=(ASKIP,NORM),               C00048**2
               COLOR=BLUE                                               00049   
        DFHMDF POS=(04,35),LENGTH=04,ATTRB=(ASKIP,NORM),               C00050**2
               COLOR=NEUTRAL,INITIAL='F/B:'                             00051**2
AFB     DFHMDF POS=(04,41),LENGTH=30,ATTRB=(ASKIP,NORM),               C00052**3
               COLOR=BLUE                                               00053**2
*                                                                       00054   
        DFHMDF POS=(05,09),LENGTH=18,ATTRB=(ASKIP,NORM),               C00055**2
               COLOR=NEUTRAL,INITIAL='---- EDI ASN -----'               00056**2
        DFHMDF POS=(05,29),LENGTH=19,ATTRB=(ASKIP,NORM),               C00057**2
               COLOR=NEUTRAL,INITIAL='--- EDI FORECAST --'              00058**2
        DFHMDF POS=(05,50),LENGTH=18,ATTRB=(ASKIP,NORM),               C00059**2
               COLOR=NEUTRAL,INITIAL='- ASSOC CONFIRMED-'               00060**2
        DFHMDF POS=(05,72),LENGTH=04,ATTRB=(ASKIP,NORM),               C00061**2
               COLOR=NEUTRAL,INITIAL='USER'                             00062**2
*                                                                       00063   
        DFHMDF POS=(06,06),LENGTH=21,ATTRB=(ASKIP,NORM),               C00064**2
               COLOR=NEUTRAL,INITIAL='ST CARTON  DATE  TIME'            00065**2
        DFHMDF POS=(06,29),LENGTH=19,ATTRB=(ASKIP,NORM),               C00066**2
               COLOR=NEUTRAL,INITIAL='CARTON  DATE   TIME'              00067**2
        DFHMDF POS=(06,50),LENGTH=18,ATTRB=(ASKIP,NORM),               C00068**2
               COLOR=NEUTRAL,INITIAL='CARTON  DATE  TIME'               00069**2
        DFHMDF POS=(06,73),LENGTH=02,ATTRB=(ASKIP,NORM),               C00070**2
               COLOR=NEUTRAL,INITIAL='ID'                               00071**2
*                                                                       00072   
ASTATS1 DFHMDF POS=(07,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00073**2
               COLOR=BLUE                                               00074**2
AASNCT1 DFHMDF POS=(07,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00075**2
               COLOR=BLUE                                               00076   
AASNDT1 DFHMDF POS=(07,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00077**2
               COLOR=BLUE                                               00078   
AASNTM1 DFHMDF POS=(07,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00079**2
               COLOR=BLUE                                               00080   
AEDICT1 DFHMDF POS=(07,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00081**2
               COLOR=BLUE                                               00082**2
AEDIDT1 DFHMDF POS=(07,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00083**2
               COLOR=BLUE                                               00084**2
AEDITM1 DFHMDF POS=(07,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00085**2
               COLOR=BLUE                                               00086**2
ACONCT1 DFHMDF POS=(07,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00087**2
               COLOR=BLUE                                               00088**2
ACONDT1 DFHMDF POS=(07,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00089**2
               COLOR=BLUE                                               00090**2
ACONTM1 DFHMDF POS=(07,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00091**2
               COLOR=BLUE                                               00092**2
AUSRID1 DFHMDF POS=(07,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00093**2
               COLOR=BLUE                                               00094**2
*                                                                       00095   
ASTATS2 DFHMDF POS=(08,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00096**2
               COLOR=BLUE                                               00097**2
AASNCT2 DFHMDF POS=(08,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00098**2
               COLOR=BLUE                                               00099**2
AASNDT2 DFHMDF POS=(08,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00100**2
               COLOR=BLUE                                               00101**2
AASNTM2 DFHMDF POS=(08,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00102**2
               COLOR=BLUE                                               00103**2
AEDICT2 DFHMDF POS=(08,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00104**2
               COLOR=BLUE                                               00105**2
AEDIDT2 DFHMDF POS=(08,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00106**2
               COLOR=BLUE                                               00107**2
AEDITM2 DFHMDF POS=(08,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00108**2
               COLOR=BLUE                                               00109**2
ACONCT2 DFHMDF POS=(08,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00110**2
               COLOR=BLUE                                               00111**2
ACONDT2 DFHMDF POS=(08,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00112**2
               COLOR=BLUE                                               00113**2
ACONTM2 DFHMDF POS=(08,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00114**2
               COLOR=BLUE                                               00115**2
AUSRID2 DFHMDF POS=(08,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00116**2
               COLOR=BLUE                                               00117**2
*                                                                       00118**2
ASTATS3 DFHMDF POS=(09,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00119**2
               COLOR=BLUE                                               00120**2
AASNCT3 DFHMDF POS=(09,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00121**2
               COLOR=BLUE                                               00122**2
AASNDT3 DFHMDF POS=(09,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00123**2
               COLOR=BLUE                                               00124**2
AASNTM3 DFHMDF POS=(09,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00125**2
               COLOR=BLUE                                               00126**2
AEDICT3 DFHMDF POS=(09,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00127**2
               COLOR=BLUE                                               00128**2
AEDIDT3 DFHMDF POS=(09,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00129**2
               COLOR=BLUE                                               00130**2
AEDITM3 DFHMDF POS=(09,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00131**2
               COLOR=BLUE                                               00132**2
ACONCT3 DFHMDF POS=(09,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00133**2
               COLOR=BLUE                                               00134**2
ACONDT3 DFHMDF POS=(09,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00135**2
               COLOR=BLUE                                               00136**2
ACONTM3 DFHMDF POS=(09,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00137**2
               COLOR=BLUE                                               00138**2
AUSRID3 DFHMDF POS=(09,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00139**2
               COLOR=BLUE                                               00140**2
*                                                                       00141**2
ASTATS4 DFHMDF POS=(10,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00142**2
               COLOR=BLUE                                               00143**2
AASNCT4 DFHMDF POS=(10,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00144**2
               COLOR=BLUE                                               00145**2
AASNDT4 DFHMDF POS=(10,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00146**2
               COLOR=BLUE                                               00147**2
AASNTM4 DFHMDF POS=(10,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00148**2
               COLOR=BLUE                                               00149**2
AEDICT4 DFHMDF POS=(10,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00150**2
               COLOR=BLUE                                               00151**2
AEDIDT4 DFHMDF POS=(10,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00152**2
               COLOR=BLUE                                               00153**2
AEDITM4 DFHMDF POS=(10,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00154**2
               COLOR=BLUE                                               00155**2
ACONCT4 DFHMDF POS=(10,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00156**2
               COLOR=BLUE                                               00157**2
ACONDT4 DFHMDF POS=(10,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00158**2
               COLOR=BLUE                                               00159**2
ACONTM4 DFHMDF POS=(10,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00160**2
               COLOR=BLUE                                               00161**2
AUSRID4 DFHMDF POS=(10,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00162**2
               COLOR=BLUE                                               00163**2
*                                                                       00164**2
ASTATS5 DFHMDF POS=(11,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00165**2
               COLOR=BLUE                                               00166**2
AASNCT5 DFHMDF POS=(11,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00167**2
               COLOR=BLUE                                               00168**2
AASNDT5 DFHMDF POS=(11,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00169**2
               COLOR=BLUE                                               00170**2
AASNTM5 DFHMDF POS=(11,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00171**2
               COLOR=BLUE                                               00172**2
AEDICT5 DFHMDF POS=(11,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00173**2
               COLOR=BLUE                                               00174**2
AEDIDT5 DFHMDF POS=(11,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00175**2
               COLOR=BLUE                                               00176**2
AEDITM5 DFHMDF POS=(11,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00177**2
               COLOR=BLUE                                               00178**2
ACONCT5 DFHMDF POS=(11,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00179**2
               COLOR=BLUE                                               00180**2
ACONDT5 DFHMDF POS=(11,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00181**2
               COLOR=BLUE                                               00182**2
ACONTM5 DFHMDF POS=(11,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00183**2
               COLOR=BLUE                                               00184**2
AUSRID5 DFHMDF POS=(11,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00185**2
               COLOR=BLUE                                               00186**2
*                                                                       00187**2
ASTATS6 DFHMDF POS=(12,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00188**2
               COLOR=BLUE                                               00189**2
AASNCT6 DFHMDF POS=(12,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00190**2
               COLOR=BLUE                                               00191**2
AASNDT6 DFHMDF POS=(12,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00192**2
               COLOR=BLUE                                               00193**2
AASNTM6 DFHMDF POS=(12,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00194**2
               COLOR=BLUE                                               00195**2
AEDICT6 DFHMDF POS=(12,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00196**2
               COLOR=BLUE                                               00197**2
AEDIDT6 DFHMDF POS=(12,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00198**2
               COLOR=BLUE                                               00199**2
AEDITM6 DFHMDF POS=(12,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00200**2
               COLOR=BLUE                                               00201**2
ACONCT6 DFHMDF POS=(12,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00202**2
               COLOR=BLUE                                               00203**2
ACONDT6 DFHMDF POS=(12,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00204**2
               COLOR=BLUE                                               00205**2
ACONTM6 DFHMDF POS=(12,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00206**2
               COLOR=BLUE                                               00207**2
AUSRID6 DFHMDF POS=(12,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00208**2
               COLOR=BLUE                                               00209**2
*                                                                       00210**2
ASTATS7 DFHMDF POS=(13,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00211**2
               COLOR=BLUE                                               00212**2
AASNCT7 DFHMDF POS=(13,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00213**2
               COLOR=BLUE                                               00214**2
AASNDT7 DFHMDF POS=(13,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00215**2
               COLOR=BLUE                                               00216**2
AASNTM7 DFHMDF POS=(13,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00217**2
               COLOR=BLUE                                               00218**2
AEDICT7 DFHMDF POS=(13,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00219**2
               COLOR=BLUE                                               00220**2
AEDIDT7 DFHMDF POS=(13,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00221**2
               COLOR=BLUE                                               00222**2
AEDITM7 DFHMDF POS=(13,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00223**2
               COLOR=BLUE                                               00224**2
ACONCT7 DFHMDF POS=(13,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00225**2
               COLOR=BLUE                                               00226**2
ACONDT7 DFHMDF POS=(13,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00227**2
               COLOR=BLUE                                               00228**2
ACONTM7 DFHMDF POS=(13,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00229**2
               COLOR=BLUE                                               00230**2
AUSRID7 DFHMDF POS=(13,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00231**2
               COLOR=BLUE                                               00232**2
*                                                                       00233**2
ASTATS8 DFHMDF POS=(14,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00234**2
               COLOR=BLUE                                               00235**2
AASNCT8 DFHMDF POS=(14,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00236**2
               COLOR=BLUE                                               00237**2
AASNDT8 DFHMDF POS=(14,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00238**2
               COLOR=BLUE                                               00239**2
AASNTM8 DFHMDF POS=(14,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00240**2
               COLOR=BLUE                                               00241**2
AEDICT8 DFHMDF POS=(14,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00242**2
               COLOR=BLUE                                               00243**2
AEDIDT8 DFHMDF POS=(14,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00244**2
               COLOR=BLUE                                               00245**2
AEDITM8 DFHMDF POS=(14,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00246**2
               COLOR=BLUE                                               00247**2
ACONCT8 DFHMDF POS=(14,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00248**2
               COLOR=BLUE                                               00249**2
ACONDT8 DFHMDF POS=(14,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00250**2
               COLOR=BLUE                                               00251**2
ACONTM8 DFHMDF POS=(14,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00252**2
               COLOR=BLUE                                               00253**2
AUSRID8 DFHMDF POS=(14,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00254**2
               COLOR=BLUE                                               00255**2
*                                                                       00256**2
ASTATS9 DFHMDF POS=(15,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00257**2
               COLOR=BLUE                                               00258**2
AASNCT9 DFHMDF POS=(15,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00259**2
               COLOR=BLUE                                               00260**2
AASNDT9 DFHMDF POS=(15,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00261**2
               COLOR=BLUE                                               00262**2
AASNTM9 DFHMDF POS=(15,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00263**2
               COLOR=BLUE                                               00264**2
AEDICT9 DFHMDF POS=(15,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00265**2
               COLOR=BLUE                                               00266**2
AEDIDT9 DFHMDF POS=(15,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00267**2
               COLOR=BLUE                                               00268**2
AEDITM9 DFHMDF POS=(15,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00269**2
               COLOR=BLUE                                               00270**2
ACONCT9 DFHMDF POS=(15,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00271**2
               COLOR=BLUE                                               00272**2
ACONDT9 DFHMDF POS=(15,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00273**2
               COLOR=BLUE                                               00274**2
ACONTM9 DFHMDF POS=(15,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00275**2
               COLOR=BLUE                                               00276**2
AUSRID9 DFHMDF POS=(15,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00277**2
               COLOR=BLUE                                               00278**2
*                                                                       00279**2
ASTATSA DFHMDF POS=(16,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00280**2
               COLOR=BLUE                                               00281**2
AASNCTA DFHMDF POS=(16,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00282**2
               COLOR=BLUE                                               00283**2
AASNDTA DFHMDF POS=(16,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00284**2
               COLOR=BLUE                                               00285**2
AASNTMA DFHMDF POS=(16,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00286**2
               COLOR=BLUE                                               00287**2
AEDICTA DFHMDF POS=(16,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00288**2
               COLOR=BLUE                                               00289**2
AEDIDTA DFHMDF POS=(16,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00290**2
               COLOR=BLUE                                               00291**2
AEDITMA DFHMDF POS=(16,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00292**2
               COLOR=BLUE                                               00293**2
ACONCTA DFHMDF POS=(16,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00294**2
               COLOR=BLUE                                               00295**2
ACONDTA DFHMDF POS=(16,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00296**2
               COLOR=BLUE                                               00297**2
ACONTMA DFHMDF POS=(16,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00298**2
               COLOR=BLUE                                               00299**2
AUSRIDA DFHMDF POS=(16,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00300**2
               COLOR=BLUE                                               00301**2
*                                                                       00302**2
ASTATSB DFHMDF POS=(17,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00303**2
               COLOR=BLUE                                               00304**2
AASNCTB DFHMDF POS=(17,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00305**2
               COLOR=BLUE                                               00306**2
AASNDTB DFHMDF POS=(17,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00307**2
               COLOR=BLUE                                               00308**2
AASNTMB DFHMDF POS=(17,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00309**2
               COLOR=BLUE                                               00310**2
AEDICTB DFHMDF POS=(17,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00311**2
               COLOR=BLUE                                               00312**2
AEDIDTB DFHMDF POS=(17,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00313**2
               COLOR=BLUE                                               00314**2
AEDITMB DFHMDF POS=(17,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00315**2
               COLOR=BLUE                                               00316**2
ACONCTB DFHMDF POS=(17,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00317**2
               COLOR=BLUE                                               00318**2
ACONDTB DFHMDF POS=(17,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00319**2
               COLOR=BLUE                                               00320**2
ACONTMB DFHMDF POS=(17,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00321**2
               COLOR=BLUE                                               00322**2
AUSRIDB DFHMDF POS=(17,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00323**2
               COLOR=BLUE                                               00324**2
*                                                                       00325**2
ASTATSC DFHMDF POS=(18,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00326**2
               COLOR=BLUE                                               00327**2
AASNCTC DFHMDF POS=(18,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00328**2
               COLOR=BLUE                                               00329**2
AASNDTC DFHMDF POS=(18,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00330**2
               COLOR=BLUE                                               00331**2
AASNTMC DFHMDF POS=(18,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00332**2
               COLOR=BLUE                                               00333**2
AEDICTC DFHMDF POS=(18,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00334**2
               COLOR=BLUE                                               00335**2
AEDIDTC DFHMDF POS=(18,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00336**2
               COLOR=BLUE                                               00337**2
AEDITMC DFHMDF POS=(18,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00338**2
               COLOR=BLUE                                               00339**2
ACONCTC DFHMDF POS=(18,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00340**2
               COLOR=BLUE                                               00341**2
ACONDTC DFHMDF POS=(18,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00342**2
               COLOR=BLUE                                               00343**2
ACONTMC DFHMDF POS=(18,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00344**2
               COLOR=BLUE                                               00345**2
AUSRIDC DFHMDF POS=(18,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00346**2
               COLOR=BLUE                                               00347**2
*                                                                       00348**2
ASTATSD DFHMDF POS=(19,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00349**2
               COLOR=BLUE                                               00350**2
AASNCTD DFHMDF POS=(19,09),LENGTH=06,ATTRB=(ASKIP,NORM),               C00351**2
               COLOR=BLUE                                               00352**2
AASNDTD DFHMDF POS=(19,16),LENGTH=05,ATTRB=(ASKIP,NORM),               C00353**2
               COLOR=BLUE                                               00354**2
AASNTMD DFHMDF POS=(19,22),LENGTH=05,ATTRB=(ASKIP,NORM),               C00355**2
               COLOR=BLUE                                               00356**2
AEDICTD DFHMDF POS=(19,29),LENGTH=06,ATTRB=(ASKIP,NORM),               C00357**2
               COLOR=BLUE                                               00358**2
AEDIDTD DFHMDF POS=(19,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00359**2
               COLOR=BLUE                                               00360**2
AEDITMD DFHMDF POS=(19,43),LENGTH=05,ATTRB=(ASKIP,NORM),               C00361**2
               COLOR=BLUE                                               00362**2
ACONCTD DFHMDF POS=(19,50),LENGTH=06,ATTRB=(ASKIP,NORM),               C00363**2
               COLOR=BLUE                                               00364**2
ACONDTD DFHMDF POS=(19,57),LENGTH=05,ATTRB=(ASKIP,NORM),               C00365**2
               COLOR=BLUE                                               00366**2
ACONTMD DFHMDF POS=(19,63),LENGTH=05,ATTRB=(ASKIP,NORM),               C00367**2
               COLOR=BLUE                                               00368**2
AUSRIDD DFHMDF POS=(19,70),LENGTH=08,ATTRB=(ASKIP,NORM),               C00369**2
               COLOR=BLUE                                               00370**2
*                                                                       00371**2
**************                                                          00372   
        DFHMSD TYPE=FINAL                                               00373   
**************                                                          00374   
        END                                                             00375   
