*          DATA SET RCKM239    AT LEVEL 007 AS OF 11/15/95                      
*          DATA SET RCKM239    AT LEVEL 018 AS OF 04/21/94              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  RCKM239                                            *   00005   
*        MAP     RC239A                                             *   00006   
*        PROGRAM RCKCS239                                           *   00007   
*        TRANSID E239 - RECEIPT ITEM UPDATE                         *   00008   
*        SYSTEM  RC NEW RECEIVING                                   *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
RCKM239 DFHMSD TYPE=MAP,                                               X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES,                                            X00015   
               CTRL=(FREEKB)                                            00016   
RC239A  DFHMDI LINE=2,COLUMN=1,                                        X00017   
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
*                                                                       00021   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00022   
               INITIAL='OPERATING ID:',                                X00023   
               LENGTH=13,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(03,01)                                              00026   
*                                                                       00027   
AOPER   DFHMDF ATTRB=(ASKIP,NORM),                                     X00028   
               LENGTH=4,                                               X00029   
               COLOR=BLUE,                                             X00030   
               POS=(03,15)                                              00031   
*                                                                       00032   
AFCLTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00033   
               LENGTH=4,                                               X00034   
               COLOR=BLUE,                                             X00035   
               POS=(03,20)                                              00036   
*                                                                       00037   
AFDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00038   
               LENGTH=30,                                              X00039   
               COLOR=BLUE,                                             X00040   
               POS=(03,27)                                              00041   
*                                                                       00042   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00043   
               INITIAL='RECEIVER NO.:',                                X00044   
               LENGTH=13,                                              X00045   
               COLOR=NEUTRAL,                                          X00046   
               POS=(04,01)                                              00047   
*                                                                       00048   
ARCVR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00049   
               LENGTH=13,                                              X00050   
               COLOR=BLUE,                                             X00051   
               POS=(04,15)                                              00052   
*                                                                       00053   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00054   
               INITIAL='CREATED BY....:',                              X00055   
               LENGTH=15,                                              X00056   
               COLOR=NEUTRAL,                                          X00057   
               POS=(04,35)                                              00058   
*                                                                       00059   
ACRTBY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00060   
               LENGTH=07,                                              X00061   
               COLOR=BLUE,                                             X00062   
               POS=(04,51)                                              00063   
*                                                                       00064   
ACRTDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00065   
               LENGTH=10,                                              X00066   
               COLOR=BLUE,                                             X00067   
               POS=(04,59)                                              00068   
*                                                                       00069   
ACRTTME DFHMDF ATTRB=(ASKIP,NORM),                                     X00070   
               LENGTH=05,                                              X00071   
               COLOR=BLUE,                                             X00072   
               POS=(04,70)                                              00073   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00075   
               INITIAL='PO LINE NO..:',                                X00076   
               LENGTH=13,                                              X00077   
               COLOR=NEUTRAL,                                          X00078   
               POS=(05,01)                                              00079   
*                                                                       00080   
ALINE   DFHMDF ATTRB=(ASKIP,NORM),                                     X00081   
               LENGTH=04,                                              X00082   
               COLOR=BLUE,                                             X00083   
               POS=(05,15)                                              00084   
*                                                                       00085   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00086   
               INITIAL='LAST UPDTED BY:',                              X00087   
               LENGTH=15,                                              X00088   
               COLOR=NEUTRAL,                                          X00089   
               POS=(05,35)                                              00090   
*                                                                       00091   
ALSTBY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00092   
               LENGTH=07,                                              X00093   
               COLOR=BLUE,                                             X00094   
               POS=(05,51)                                              00095   
*                                                                       00096   
ALSTDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00097   
               LENGTH=10,                                              X00098   
               COLOR=BLUE,                                             X00099   
               POS=(05,59)                                              00100   
*                                                                       00101   
ALSTTME DFHMDF ATTRB=(ASKIP,NORM),                                     X00102   
               LENGTH=05,                                              X00103   
               COLOR=BLUE,                                             X00104   
               POS=(05,70)                                              00105   
*                                                                       00106   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00107   
               INITIAL='STATUS......:',                                X00108   
               LENGTH=13,                                              X00109   
               COLOR=NEUTRAL,                                          X00110   
               POS=(06,01)                                              00111   
*                                                                       00112   
ASTDESC DFHMDF ATTRB=(ASKIP,NORM),                                     X00113   
               LENGTH=10,                                              X00114**4
               COLOR=BLUE,                                             X00115**6
               POS=(06,15)                                              00116   
*                                                                       00117   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00118**7
               INITIAL='TROUBLE REASON:',                              X00119**7
               LENGTH=15,                                              X00120**7
               COLOR=NEUTRAL,                                          X00121**7
               POS=(06,35)                                              00122**7
*                                                                       00123**7
ATRBL   DFHMDF ATTRB=(ASKIP,NORM),                                     X00124   
               LENGTH=25,                                              X00125   
               COLOR=YELLOW,                                           X00126**6
               POS=(06,51)                                              00127**7
*                                                                       00128   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00129   
               INITIAL='INNER PACK..:',                                X00130   
               LENGTH=13,                                              X00131   
               COLOR=NEUTRAL,                                          X00132   
               POS=(10,01)                                              00133   
*                                                                       00134   
AINNR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00135   
               LENGTH=03,                                              X00136   
               COLOR=GREEN,                                            X00137   
               HILIGHT=UNDERLINE,                                      X00138   
               PICOUT='ZZZ',                                           X00139   
               POS=(10,15)                                              00140   
*                                                                       00141   
        DFHMDF ATTRB=(ASKIP),                                          X00142   
               LENGTH=1,                                               X00143   
               COLOR=NEUTRAL,                                          X00144   
               POS=(10,19)                                              00145   
*                                                                       00146   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00147   
               INITIAL='PACK SLIP ITEM QTY:',                          X00148   
               LENGTH=19,                                              X00149   
               COLOR=NEUTRAL,                                          X00150   
               POS=(10,23)                                              00151   
*                                                                       00152   
APSQTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00153   
               LENGTH=05,                                              X00154   
               COLOR=BLUE,                                             X00155   
               PICOUT='ZZZZ9',                                         X00156   
               POS=(10,43)                                              00157   
*                                                                       00158   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00159   
               INITIAL='GROUP RTL....:',                               X00160   
               LENGTH=14,                                              X00161   
               COLOR=NEUTRAL,                                          X00162   
               POS=(10,49)                                              00163   
*                                                                       00164   
AGRPRTL DFHMDF ATTRB=(ASKIP,NORM),                                     X00165   
               LENGTH=08,                                              X00166   
               COLOR=BLUE,                                             X00167   
               PICOUT='ZZZZZ.99',                                      X00168   
               POS=(10,64)                                              00169   
*                                                                       00170   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00171   
               INITIAL='CASE PACK...:',                                X00172   
               LENGTH=13,                                              X00173   
               COLOR=NEUTRAL,                                          X00174   
               POS=(11,01)                                              00175   
*                                                                       00176   
ACASE   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00177   
               LENGTH=03,                                              X00178   
               COLOR=GREEN,                                            X00179   
               HILIGHT=UNDERLINE,                                      X00180   
               PICOUT='ZZZ',                                           X00181   
               POS=(11,15)                                              00182   
*                                                                       00183   
        DFHMDF ATTRB=(ASKIP),                                          X00184   
               LENGTH=1,                                               X00185   
               COLOR=NEUTRAL,                                          X00186   
               POS=(11,19)                                              00187   
*                                                                       00188   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00189   
               INITIAL='DTL CHECK ITEM QTY:',                          X00190   
               LENGTH=19,                                              X00191   
               COLOR=NEUTRAL,                                          X00192   
               POS=(11,23)                                              00193   
*                                                                       00194   
ADCQTY  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00195   
               LENGTH=05,                                              X00196   
               COLOR=GREEN,                                            X00197   
               HILIGHT=UNDERLINE,                                      X00198   
               PICOUT='ZZZZZ',                                         X00199   
               POS=(11,43)                                              00200   
*                                                                       00201   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00202   
               INITIAL='GROUP QTY....:',                               X00203   
               LENGTH=14,                                              X00204   
               COLOR=NEUTRAL,                                          X00205   
               POS=(11,49)                                              00206   
*                                                                       00207   
AGRPQTY DFHMDF ATTRB=(ASKIP,NORM),                                     X00208   
               LENGTH=03,                                              X00209   
               COLOR=BLUE,                                             X00210   
               PICOUT='ZZ9',                                           X00211   
               POS=(11,64)                                              00212   
*                                                                       00213   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00214   
               INITIAL='PRE-TICKETED:',                                X00215   
               LENGTH=13,                                              X00216   
               COLOR=NEUTRAL,                                          X00217   
               POS=(12,01)                                              00218   
*                                                                       00219   
APRETKT DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00220   
               LENGTH=01,                                              X00221   
               COLOR=GREEN,                                            X00222   
               HILIGHT=UNDERLINE,                                      X00223   
               POS=(12,15)                                              00224   
*                                                                       00225   
        DFHMDF ATTRB=(ASKIP),                                          X00226   
               LENGTH=1,                                               X00227   
               COLOR=NEUTRAL,                                          X00228   
               POS=(12,17)                                              00229   
*                                                                       00230   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00231   
               INITIAL='EXPECTED CTN CNT..:',                          X00232   
               LENGTH=19,                                              X00233   
               COLOR=NEUTRAL,                                          X00234   
               POS=(12,23)                                              00235   
*                                                                       00236   
AEXPCTN DFHMDF ATTRB=(ASKIP,NORM),                                     X00237   
               LENGTH=04,                                              X00238   
               COLOR=BLUE,                                             X00239   
               PICOUT='ZZZ9',                                          X00240   
               POS=(12,44)                                              00241   
*                                                                       00242   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00243   
               INITIAL='UNIT RTL.....:',                               X00244   
               LENGTH=14,                                              X00245   
               COLOR=NEUTRAL,                                          X00246   
               POS=(12,49)                                              00247   
*                                                                       00248   
ARTL    DFHMDF ATTRB=(ASKIP,NORM),                                     X00249   
               LENGTH=08,                                              X00250   
               COLOR=BLUE,                                             X00251   
               PICOUT='ZZZZZ.99',                                      X00252   
               POS=(12,64)                                              00253   
*                                                                       00254   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00255   
               INITIAL='DAMAGED QTY.:',                                X00256   
               LENGTH=13,                                              X00257   
               COLOR=NEUTRAL,                                          X00258   
               POS=(13,01)                                              00259   
*                                                                       00260   
ADMG    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00261   
               LENGTH=04,                                              X00262   
               COLOR=GREEN,                                            X00263   
               HILIGHT=UNDERLINE,                                      X00264   
               PICOUT='ZZZZ',                                          X00265   
               POS=(13,15)                                              00266   
*                                                                       00267   
        DFHMDF ATTRB=(ASKIP),                                          X00268   
               LENGTH=1,                                               X00269   
               COLOR=NEUTRAL,                                          X00270   
               POS=(13,20)                                              00271   
*                                                                       00272   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00273   
               INITIAL='ACTUAL CTN CNT....:',                          X00274   
               LENGTH=19,                                              X00275   
               COLOR=NEUTRAL,                                          X00276   
               POS=(13,23)                                              00277   
*                                                                       00278   
AACTCTN DFHMDF ATTRB=(ASKIP,NORM),                                     X00279   
               LENGTH=04,                                              X00280   
               COLOR=BLUE,                                             X00281   
               PICOUT='ZZZ9',                                          X00282   
               POS=(13,44)                                              00283   
*                                                                       00284   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00285   
               INITIAL='LWST VRFD RTL:',                               X00286   
               LENGTH=14,                                              X00287   
               COLOR=NEUTRAL,                                          X00288   
               POS=(13,49)                                              00289   
*                                                                       00290   
ALVR    DFHMDF ATTRB=(ASKIP,NORM),                                     X00249   
               LENGTH=08,                                              X00250   
               COLOR=BLUE,                                             X00251   
               PICOUT='ZZZZZ.ZZ',                                      X00252   
               POS=(13,64)                                              00253   
*                                                                       00284   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00285   
               INITIAL='TCKT TYPE....:',                               X00286   
               LENGTH=14,                                              X00287   
               COLOR=NEUTRAL,                                          X00288   
               POS=(14,49)                                              00289   
*                                                                       00290   
ATKT    DFHMDF ATTRB=(ASKIP,NORM),                                     X00291   
               LENGTH=16,                                              X00292   
               COLOR=BLUE,                                             X00293   
               POS=(14,64)                                              00294   
*                                                                       00295   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00296   
               INITIAL='RTV IND.....:',                                X00297   
               LENGTH=13,                                              X00298   
               COLOR=NEUTRAL,                                          X00299   
               POS=(16,01)                                              00300   
*                                                                       00301   
ARTVIND DFHMDF ATTRB=(UNPROT,NORM),                                    X00302   
               LENGTH=01,                                              X00303   
               COLOR=GREEN,                                            X00304   
               HILIGHT=UNDERLINE,                                      X00305   
               POS=(16,15)                                              00306   
*                                                                       00307   
        DFHMDF ATTRB=(ASKIP),                                          X00308   
               LENGTH=1,                                               X00309   
               COLOR=NEUTRAL,                                          X00310   
               POS=(16,17)                                              00311   
*                                                                       00312   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00313   
               INITIAL='SKU...............:',                          X00314   
               LENGTH=19,                                              X00315   
               COLOR=NEUTRAL,                                          X00316   
               POS=(16,23)                                              00317   
*                                                                       00318   
ASKU    DFHMDF ATTRB=(ASKIP,NORM),                                     X00319   
               LENGTH=15,                                              X00320   
               COLOR=BLUE,                                             X00321   
               POS=(16,43)                                              00322   
*                                                                       00323   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00324   
               INITIAL='RTV QTY.....:',                                X00325   
               LENGTH=13,                                              X00326   
               COLOR=NEUTRAL,                                          X00327   
               POS=(17,01)                                              00328   
*                                                                       00329   
ARTVQTY DFHMDF ATTRB=(UNPROT,NORM),                                    X00330   
               LENGTH=05,                                              X00331   
               COLOR=GREEN,                                            X00332   
               PICOUT='ZZZZZ',                                         X00333   
               HILIGHT=UNDERLINE,                                      X00334   
               POS=(17,15)                                              00335   
*                                                                       00336   
        DFHMDF ATTRB=(ASKIP),                                          X00337   
               LENGTH=1,                                               X00338   
               COLOR=NEUTRAL,                                          X00339   
               POS=(17,21)                                              00340   
*                                                                       00341   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00342   
               INITIAL='STYLE.............:',                          X00343   
               LENGTH=19,                                              X00344   
               COLOR=NEUTRAL,                                          X00345   
               POS=(17,23)                                              00346   
*                                                                       00347   
ASTYLE  DFHMDF ATTRB=(ASKIP,NORM),                                     X00348   
               LENGTH=20,                                              X00349   
               COLOR=BLUE,                                             X00350   
               POS=(17,43)                                              00351   
*                                                                       00352   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00353   
               INITIAL='UNIT COST...:',                                X00354   
               LENGTH=13,                                              X00355   
               COLOR=NEUTRAL,                                          X00356   
               POS=(18,01)                                              00357   
*                                                                       00358   
ACOST   DFHMDF ATTRB=(UNPROT,NORM),                                    X00359   
               LENGTH=07,                                              X00360   
               COLOR=GREEN,                                            X00361   
               PICOUT='ZZZ.ZZZ',                                       X00362   
               HILIGHT=UNDERLINE,                                      X00363   
               POS=(18,15)                                              00364   
*                                                                       00365   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00366   
               INITIAL='COLOR.............:',                          X00367   
               LENGTH=19,                                              X00368   
               COLOR=NEUTRAL,                                          X00369   
               POS=(18,23)                                              00370   
*                                                                       00371   
ACOLOR  DFHMDF ATTRB=(ASKIP,NORM),                                     X00372   
               LENGTH=25,                                              X00373   
               COLOR=BLUE,                                             X00374   
               POS=(18,43)                                              00375   
*                                                                       00376   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00377   
               INITIAL='MTCH TO LINE:',                                X00378   
               LENGTH=13,                                              X00379   
               COLOR=NEUTRAL,                                          X00380   
               POS=(19,01)                                              00381   
*                                                                       00382   
AMTCH   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00383   
               LENGTH=04,                                              X00384   
               COLOR=GREEN,                                            X00385   
               HILIGHT=UNDERLINE,                                      X00386   
               POS=(19,15)                                              00387   
*                                                                       00388   
        DFHMDF ATTRB=(ASKIP),                                          X00389   
               LENGTH=1,                                               X00390   
               COLOR=NEUTRAL,                                          X00391   
               POS=(19,20)                                              00392   
*                                                                       00393   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00394   
               INITIAL='SIZE..............:',                          X00395   
               LENGTH=19,                                              X00396   
               COLOR=NEUTRAL,                                          X00397   
               POS=(19,23)                                              00398   
*                                                                       00399   
ASIZE   DFHMDF ATTRB=(ASKIP,NORM),                                     X00400   
               LENGTH=25,                                              X00401   
               COLOR=BLUE,                                             X00402   
               POS=(19,43)                                              00403   
*                                                                       00404   
         DFHMSD TYPE=FINAL                                              00405   
         END                                                            00406   
