  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM282                                            *   00006   
*        MAP     RC282A                                             *   00007   
*        PROGRAM RCKCS284                                           *   00008   
*        TRANSID E282 - ADJUSTMENT AUDIT BY LINE                    *   00009   
*        SYSTEM  RC RECEIVING                                       *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM282 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
RC282A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT),                                 X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                       00024   
        DFHMDF POS=(02,01),                                            X00025   
               LENGTH=05,                                              X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               COLOR=NEUTRAL,                                          X00028   
               INITIAL='RCVR:'                                          00029   
ARCVR   DFHMDF POS=(02,07),                                            X00030   
               LENGTH=13,                                              X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               COLOR=BLUE                                               00033   
        DFHMDF POS=(02,21),                                            X00043   
               LENGTH=06,                                              X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               COLOR=NEUTRAL,                                          X00046   
               INITIAL='OP ID:'                                         00047   
AOPER   DFHMDF POS=(02,28),                                            X00048   
               LENGTH=04,                                              X00049   
               ATTRB=(ASKIP,NORM),                                     X00050   
               PICOUT='ZZZ9',                                          X00050   
               COLOR=BLUE                                               00051   
        DFHMDF POS=(02,33),                                            X00052   
               LENGTH=06,                                              X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               COLOR=NEUTRAL,                                          X00055   
               INITIAL='FCLTY:'                                         00056   
AFCLTY  DFHMDF POS=(02,40),                                            X00057   
               LENGTH=04,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               PICOUT='ZZZ9',                                          X00050   
               COLOR=BLUE                                               00060   
AFDESC  DFHMDF POS=(02,45),                                            X00061   
               LENGTH=25,                                              X00062   
               ATTRB=(ASKIP,NORM),                                     X00063   
               COLOR=BLUE                                               00064   
*******************************************************************     00065   
        DFHMDF POS=(03,01),                                            X00066   
               LENGTH=8,                                               X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='ADJ QTY:'                                       00070   
AADJQTY DFHMDF POS=(03,10),                                            X00071   
               LENGTH=10,                                              X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE,                                             X00074   
               PICOUT='Z,ZZZ,ZZ9-'                                      00094   
        DFHMDF POS=(03,23),                                            X00075   
               LENGTH=09,                                              X00076   
               ATTRB=(ASKIP,NORM),                                     X00077   
               COLOR=NEUTRAL,                                          X00078   
               INITIAL='ADJ DATE:'                                      00079   
ADATE   DFHMDF POS=(03,33),                                            X00080   
               LENGTH=10,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
        DFHMDF POS=(03,45),                                            X00084   
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               COLOR=NEUTRAL,                                          X00087   
               INITIAL='ITEMS'                                          00088   
ASTRTIT DFHMDF POS=(03,51),                                            X00089   
               LENGTH=05,                                              X00090   
               ATTRB=(NUM,UNPROT,NORM),                                X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               PICOUT='ZZZZ9'                                           00094   
        DFHMDF POS=(03,57),                                            X00095   
               LENGTH=02,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=NEUTRAL,                                          X00098   
               INITIAL='TO'                                             00099   
AENDIT  DFHMDF POS=(03,60),                                            X00100   
               LENGTH=05,                                              X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               COLOR=BLUE,                                             X00103   
               PICOUT='ZZZZ9'                                           00104   
        DFHMDF POS=(03,66),                                            X00105   
               LENGTH=02,                                              X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='OF'                                             00109   
ATOTIT  DFHMDF POS=(03,69),                                            X00110   
               LENGTH=05,                                              X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               COLOR=BLUE,                                             X00113   
               PICOUT='ZZZZ9'                                           00114   
*-------------------------------------------------------------------*           
* ADDED DEPT : AT THE HEADER.                      WR # 230ZZ       *           
*-------------------------------------------------------------------*           
        DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DEPT:',                                        X        
               LENGTH=05,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(04,01)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=03,                                              X        
               COLOR=BLUE,                                             X        
               POS=(04,07)                                                      
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*****************************************************************       00115   
*                                                                       00190   
*   FIRST COLUMN HEADING LINE                                           00191   
*                                                                       00192   
*****************************************************************       00115   
        DFHMDF POS=(05,01),                                            X00193   
               LENGTH=39,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='             LINE                   ADJ'        00197   
        DFHMDF POS=(05,41),                                            X00193   
               LENGTH=39,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='       ADJ             ADJ             '        00197   
*****************************************************************       00115   
*   SECOND COLUMN HEADING LINE                                          00203   
*****************************************************************       00115   
        DFHMDF POS=(06,01),                                            X00204   
               LENGTH=39,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='SEL   ACT      NO    CL --SKU---    QTY'        00197   
        DFHMDF POS=(06,41),                                            X00204   
               LENGTH=39,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='       RETAIL         COST             '        00197   
*****************************************************************       00115   
*   DETAIL COLUMNS - 12 LINES                                           00216   
*****************************************************************       00115   
ASEL01  DFHMDF POS=(07,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM,IC),                                 X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(07,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT01  DFHMDF POS=(07,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE01  DFHMDF POS=(07,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU01  DFHMDF POS=(07,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY01 DFHMDF POS=(07,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL01 DFHMDF POS=(07,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST01 DFHMDF POS=(07,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL02  DFHMDF POS=(08,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(08,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT02  DFHMDF POS=(08,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE02  DFHMDF POS=(08,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU02  DFHMDF POS=(08,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY02 DFHMDF POS=(08,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL02 DFHMDF POS=(08,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST02 DFHMDF POS=(08,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL03  DFHMDF POS=(09,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(09,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT03  DFHMDF POS=(09,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE03  DFHMDF POS=(09,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU03  DFHMDF POS=(09,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY03 DFHMDF POS=(09,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL03 DFHMDF POS=(09,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST03 DFHMDF POS=(09,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL04  DFHMDF POS=(10,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(10,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT04  DFHMDF POS=(10,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE04  DFHMDF POS=(10,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU04  DFHMDF POS=(10,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY04 DFHMDF POS=(10,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL04 DFHMDF POS=(10,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST04 DFHMDF POS=(10,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL05  DFHMDF POS=(11,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(11,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT05  DFHMDF POS=(11,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE05  DFHMDF POS=(11,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU05  DFHMDF POS=(11,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY05 DFHMDF POS=(11,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL05 DFHMDF POS=(11,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST05 DFHMDF POS=(11,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL06  DFHMDF POS=(12,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(12,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT06  DFHMDF POS=(12,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE06  DFHMDF POS=(12,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU06  DFHMDF POS=(12,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY06 DFHMDF POS=(12,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL06 DFHMDF POS=(12,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST06 DFHMDF POS=(12,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL07  DFHMDF POS=(13,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(13,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT07  DFHMDF POS=(13,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE07  DFHMDF POS=(13,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU07  DFHMDF POS=(13,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY07 DFHMDF POS=(13,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL07 DFHMDF POS=(13,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST07 DFHMDF POS=(13,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL08  DFHMDF POS=(14,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(14,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT08  DFHMDF POS=(14,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE08  DFHMDF POS=(14,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU08  DFHMDF POS=(14,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY08 DFHMDF POS=(14,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL08 DFHMDF POS=(14,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST08 DFHMDF POS=(14,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL09  DFHMDF POS=(15,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(15,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT09  DFHMDF POS=(15,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE09  DFHMDF POS=(15,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU09  DFHMDF POS=(15,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY09 DFHMDF POS=(15,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL09 DFHMDF POS=(15,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST09 DFHMDF POS=(15,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL10  DFHMDF POS=(16,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(16,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT10  DFHMDF POS=(16,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE10  DFHMDF POS=(16,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU10  DFHMDF POS=(16,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY10 DFHMDF POS=(16,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL10 DFHMDF POS=(16,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST10 DFHMDF POS=(16,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL11  DFHMDF POS=(17,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(17,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT11  DFHMDF POS=(17,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE11  DFHMDF POS=(17,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU11  DFHMDF POS=(17,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY11 DFHMDF POS=(17,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL11 DFHMDF POS=(17,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST11 DFHMDF POS=(17,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*****************************************************************       00115   
ASEL12  DFHMDF POS=(18,02),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(18,04),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT12  DFHMDF POS=(18,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ALNE12  DFHMDF POS=(18,16),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00228   
               COLOR=BLUE                                               00230   
ASKU12  DFHMDF POS=(18,22),                                            X00080   
               LENGTH=11,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
AAQTY12 DFHMDF POS=(18,37),                                            X00235   
               LENGTH=07,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARETL12 DFHMDF POS=(18,47),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ACOST12 DFHMDF POS=(18,61),                                            X00235   
               LENGTH=11,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
*                                                                       00217   
*                                                                       00897   
*                                                                       00898   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00899   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00900   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00901   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00902   
**************                                                          00903   
        DFHMSD TYPE=FINAL                                               00904   
**************                                                          00905   
        END                                                             00906   
