*          DATA SET RCKM261    AT LEVEL 001 AS OF 07/14/95                      
*          DATA SET RCKM261    AT LEVEL 004 AS OF 04/03/95              00001   
*          DATA SET RCKM261    AT LEVEL 008 AS OF 02/17/93              00002   
*          DATA SET RCKM261    AT LEVEL 002 AS OF 08/13/92              00003   
        PRINT  NOGEN                                                    00004   
RCKM261 DFHMSD TYPE=DSECT,                                             C00005   
               LANG=COBOL,                                             C00006   
               MODE=INOUT,                                             C00007   
               STORAGE=AUTO,                                           C00008   
               TERM=3270-2,                                            C00009   
               TIOAPFX=YES                                              00010   
**************                                                          00011   
RC261A  DFHMDI LINE=2,COLUMN=1,                                        C00012   
               SIZE=(19,80),                                           C00013   
               CTRL=(FREEKB),                                          C00014   
               MAPATTS=(COLOR,HILIGHT),                                C00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**************                                                          00017   
        DFHMDF POS=(02,03),LENGTH=10,ATTRB=(PROT,NORM),                C00018   
               COLOR=NEUTRAL,                                          C00019   
               INITIAL='OPER UNIT:'                                     00020   
AOPRUNT DFHMDF POS=(02,14),LENGTH=04,ATTRB=(ASKIP,NORM),               C00021   
               COLOR=BLUE                                               00022   
        DFHMDF POS=(02,20),LENGTH=09,ATTRB=(PROT,NORM),                C00023   
               COLOR=NEUTRAL,                                          C00024   
               INITIAL='FACILITY:'                                      00025   
AFCLTY  DFHMDF POS=(02,30),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00028   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00029   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00030   
               COLOR=GREEN,                                            C00031   
               HILIGHT=UNDERLINE,                                      C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='TO'                                             00036   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00037   
               COLOR=BLUE,                                             C00038   
               PICOUT='ZZZZ9'                                           00039   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00040   
               COLOR=NEUTRAL,                                          C00041   
               INITIAL='OF'                                             00042   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00043   
               COLOR=BLUE,                                             C00044   
               PICOUT='ZZZZ9'                                           00045   
*                                                                       00046   
        DFHMDF POS=(03,03),LENGTH=14,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='DELIVERY SCAC:'                                 00049   
ADELSCA DFHMDF POS=(03,18),LENGTH=04,ATTRB=(ASKIP,NORM),               C00050   
               COLOR=BLUE                                               00051   
        DFHMDF POS=(03,26),LENGTH=08,ATTRB=(PROT,NORM),                C00052   
               COLOR=NEUTRAL,                                          C00053   
               INITIAL='TRAILER:'                                       00054   
ATRALER DFHMDF POS=(03,35),LENGTH=10,ATTRB=(ASKIP,NORM),               C00055   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,49),LENGTH=07,ATTRB=(PROT,NORM),                C00057   
               COLOR=NEUTRAL,                                          C00058   
               INITIAL='STATUS:'                                        00059   
ASTATUS DFHMDF POS=(03,57),LENGTH=02,ATTRB=(ASKIP,NORM),               C00060   
               COLOR=BLUE                                               00061   
*                                                                       00062   
        DFHMDF POS=(04,60),LENGTH=04,ATTRB=(PROT,NORM),                C00063   
               COLOR=NEUTRAL,                                          C00064   
               INITIAL='# OF'                                           00065   
        DFHMDF POS=(04,76),LENGTH=04,ATTRB=(PROT,NORM),                C00066   
               COLOR=NEUTRAL,                                          C00067   
               INITIAL='ORIG'                                           00068   
*                                                                       00069   
        DFHMDF POS=(05,01),LENGTH=03,ATTRB=(PROT,NORM),                C00070   
               COLOR=NEUTRAL,                                          C00071   
               INITIAL='SEL'                                            00072   
        DFHMDF POS=(05,06),LENGTH=02,ATTRB=(PROT,NORM),                C00073   
               COLOR=NEUTRAL,                                          C00074   
               INITIAL='ST'                                             00075   
        DFHMDF POS=(05,11),LENGTH=12,ATTRB=(PROT,NORM),                C00076   
               COLOR=NEUTRAL,                                          C00077   
               INITIAL='FREIGHT BILL'                                   00078   
        DFHMDF POS=(05,31),LENGTH=14,ATTRB=(PROT,NORM),                C00079   
               COLOR=NEUTRAL,                                          C00080   
               INITIAL='BILL OF LADING'                                 00081   
        DFHMDF POS=(05,50),LENGTH=07,ATTRB=(PROT,NORM),                C00082   
               COLOR=NEUTRAL,                                          C00083   
               INITIAL='CTN CNT'                                        00084   
        DFHMDF POS=(05,60),LENGTH=04,ATTRB=(PROT,NORM),                C00085   
               COLOR=NEUTRAL,                                          C00086   
               INITIAL='PO''S'                                          00087   
        DFHMDF POS=(05,67),LENGTH=06,ATTRB=(PROT,NORM),                C00088   
               COLOR=NEUTRAL,                                          C00089   
               INITIAL='VENDOR'                                         00090   
        DFHMDF POS=(05,76),LENGTH=04,ATTRB=(PROT,NORM),                C00091   
               COLOR=NEUTRAL,                                          C00092   
               INITIAL='SCAC'                                           00093   
*                                                                       00094   
ASEL01  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00098   
ASTA01  DFHMDF POS=(06,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
AFRBL01 DFHMDF POS=(06,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
ABOL01  DFHMDF POS=(06,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00103   
               COLOR=BLUE                                               00104   
ACTNC01 DFHMDF POS=(06,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00105   
               COLOR=BLUE                                               00106   
ANOPO01 DFHMDF POS=(06,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00107   
               COLOR=BLUE                                               00108   
AVEND01 DFHMDF POS=(06,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00109   
               COLOR=BLUE                                               00110   
AOSCA01 DFHMDF POS=(06,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00111   
               COLOR=BLUE                                               00112   
*                                                                       00113   
ASEL02  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00114   
               HILIGHT=UNDERLINE,                                      C00115   
               COLOR=GREEN                                              00116   
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00117   
ASTA02  DFHMDF POS=(07,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00118   
               COLOR=BLUE                                               00119   
AFRBL02 DFHMDF POS=(07,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00120   
               COLOR=BLUE                                               00121   
ABOL02  DFHMDF POS=(07,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00122   
               COLOR=BLUE                                               00123   
ACTNC02 DFHMDF POS=(07,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00124   
               COLOR=BLUE                                               00125   
ANOPO02 DFHMDF POS=(07,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00126   
               COLOR=BLUE                                               00127   
AVEND02 DFHMDF POS=(07,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00128   
               COLOR=BLUE                                               00129   
AOSCA02 DFHMDF POS=(07,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00130   
               COLOR=BLUE                                               00131   
*                                                                       00132   
ASEL03  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00133   
               HILIGHT=UNDERLINE,                                      C00134   
               COLOR=GREEN                                              00135   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00136   
ASTA03  DFHMDF POS=(08,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00137   
               COLOR=BLUE                                               00138   
AFRBL03 DFHMDF POS=(08,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00139   
               COLOR=BLUE                                               00140   
ABOL03  DFHMDF POS=(08,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00141   
               COLOR=BLUE                                               00142   
ACTNC03 DFHMDF POS=(08,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00143   
               COLOR=BLUE                                               00144   
ANOPO03 DFHMDF POS=(08,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00145   
               COLOR=BLUE                                               00146   
AVEND03 DFHMDF POS=(08,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00147   
               COLOR=BLUE                                               00148   
AOSCA03 DFHMDF POS=(08,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00149   
               COLOR=BLUE                                               00150   
*                                                                       00151   
ASEL04  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00152   
               HILIGHT=UNDERLINE,                                      C00153   
               COLOR=GREEN                                              00154   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00155   
ASTA04  DFHMDF POS=(09,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00156   
               COLOR=BLUE                                               00157   
AFRBL04 DFHMDF POS=(09,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00158   
               COLOR=BLUE                                               00159   
ABOL04  DFHMDF POS=(09,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00160   
               COLOR=BLUE                                               00161   
ACTNC04 DFHMDF POS=(09,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00162   
               COLOR=BLUE                                               00163   
ANOPO04 DFHMDF POS=(09,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00164   
               COLOR=BLUE                                               00165   
AVEND04 DFHMDF POS=(09,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00166   
               COLOR=BLUE                                               00167   
AOSCA04 DFHMDF POS=(09,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00168   
               COLOR=BLUE                                               00169   
*                                                                       00170   
ASEL05  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00171   
               HILIGHT=UNDERLINE,                                      C00172   
               COLOR=GREEN                                              00173   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00174   
ASTA05  DFHMDF POS=(10,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00175   
               COLOR=BLUE                                               00176   
AFRBL05 DFHMDF POS=(10,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00177   
               COLOR=BLUE                                               00178   
ABOL05  DFHMDF POS=(10,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00179   
               COLOR=BLUE                                               00180   
ACTNC05 DFHMDF POS=(10,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00181   
               COLOR=BLUE                                               00182   
ANOPO05 DFHMDF POS=(10,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00183   
               COLOR=BLUE                                               00184   
AVEND05 DFHMDF POS=(10,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00185   
               COLOR=BLUE                                               00186   
AOSCA05 DFHMDF POS=(10,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00187   
               COLOR=BLUE                                               00188   
*                                                                       00189   
ASEL06  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00190   
               HILIGHT=UNDERLINE,                                      C00191   
               COLOR=GREEN                                              00192   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00193   
ASTA06  DFHMDF POS=(11,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00194   
               COLOR=BLUE                                               00195   
AFRBL06 DFHMDF POS=(11,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00196   
               COLOR=BLUE                                               00197   
ABOL06  DFHMDF POS=(11,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00198   
               COLOR=BLUE                                               00199   
ACTNC06 DFHMDF POS=(11,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00200   
               COLOR=BLUE                                               00201   
ANOPO06 DFHMDF POS=(11,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00202   
               COLOR=BLUE                                               00203   
AVEND06 DFHMDF POS=(11,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00204   
               COLOR=BLUE                                               00205   
AOSCA06 DFHMDF POS=(11,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00206   
               COLOR=BLUE                                               00207   
*                                                                       00208   
ASEL07  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00209   
               HILIGHT=UNDERLINE,                                      C00210   
               COLOR=GREEN                                              00211   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00212   
ASTA07  DFHMDF POS=(12,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00213   
               COLOR=BLUE                                               00214   
AFRBL07 DFHMDF POS=(12,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00215   
               COLOR=BLUE                                               00216   
ABOL07  DFHMDF POS=(12,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00217   
               COLOR=BLUE                                               00218   
ACTNC07 DFHMDF POS=(12,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00219   
               COLOR=BLUE                                               00220   
ANOPO07 DFHMDF POS=(12,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00221   
               COLOR=BLUE                                               00222   
AVEND07 DFHMDF POS=(12,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00223   
               COLOR=BLUE                                               00224   
AOSCA07 DFHMDF POS=(12,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00225   
               COLOR=BLUE                                               00226   
*                                                                       00227   
ASEL08  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00228   
               HILIGHT=UNDERLINE,                                      C00229   
               COLOR=GREEN                                              00230   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00231   
ASTA08  DFHMDF POS=(13,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00232   
               COLOR=BLUE                                               00233   
AFRBL08 DFHMDF POS=(13,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00234   
               COLOR=BLUE                                               00235   
ABOL08 DFHMDF  POS=(13,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00236   
               COLOR=BLUE                                               00237   
ACTNC08 DFHMDF POS=(13,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00238   
               COLOR=BLUE                                               00239   
ANOPO08 DFHMDF POS=(13,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00240   
               COLOR=BLUE                                               00241   
AVEND08 DFHMDF POS=(13,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00242   
               COLOR=BLUE                                               00243   
AOSCA08 DFHMDF POS=(13,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00244   
               COLOR=BLUE                                               00245   
*                                                                       00246   
ASEL09  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00247   
               HILIGHT=UNDERLINE,                                      C00248   
               COLOR=GREEN                                              00249   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00250   
ASTA09  DFHMDF POS=(14,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00251   
               COLOR=BLUE                                               00252   
AFRBL09 DFHMDF POS=(14,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00253   
               COLOR=BLUE                                               00254   
ABOL09  DFHMDF POS=(14,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00255   
               COLOR=BLUE                                               00256   
ACTNC09 DFHMDF POS=(14,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00257   
               COLOR=BLUE                                               00258   
ANOPO09 DFHMDF POS=(14,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00259   
               COLOR=BLUE                                               00260   
AVEND09 DFHMDF POS=(14,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00261   
               COLOR=BLUE                                               00262   
AOSCA09 DFHMDF POS=(14,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00263   
               COLOR=BLUE                                               00264   
*                                                                       00265   
ASEL10  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00266   
               HILIGHT=UNDERLINE,                                      C00267   
               COLOR=GREEN                                              00268   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00269   
ASTA10  DFHMDF POS=(15,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00270   
               COLOR=BLUE                                               00271   
AFRBL10 DFHMDF POS=(15,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00272   
               COLOR=BLUE                                               00273   
ABOL10  DFHMDF POS=(15,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00274   
               COLOR=BLUE                                               00275   
ACTNC10 DFHMDF POS=(15,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00276   
               COLOR=BLUE                                               00277   
ANOPO10 DFHMDF POS=(15,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00278   
               COLOR=BLUE                                               00279   
AVEND10 DFHMDF POS=(15,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00280   
               COLOR=BLUE                                               00281   
AOSCA10 DFHMDF POS=(15,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00282   
               COLOR=BLUE                                               00283   
*                                                                       00284   
ASEL11  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00285   
               HILIGHT=UNDERLINE,                                      C00286   
               COLOR=GREEN                                              00287   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00288   
ASTA11  DFHMDF POS=(16,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00289   
               COLOR=BLUE                                               00290   
AFRBL11 DFHMDF POS=(16,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00291   
               COLOR=BLUE                                               00292   
ABOL11  DFHMDF POS=(16,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00293   
               COLOR=BLUE                                               00294   
ACTNC11 DFHMDF POS=(16,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00295   
               COLOR=BLUE                                               00296   
ANOPO11 DFHMDF POS=(16,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00297   
               COLOR=BLUE                                               00298   
AVEND11 DFHMDF POS=(16,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00299   
               COLOR=BLUE                                               00300   
AOSCA11 DFHMDF POS=(16,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00301   
               COLOR=BLUE                                               00302   
*                                                                       00303   
ASEL12  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00304   
               HILIGHT=UNDERLINE,                                      C00305   
               COLOR=GREEN                                              00306   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00307   
ASTA12  DFHMDF POS=(17,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00308   
               COLOR=BLUE                                               00309   
AFRBL12 DFHMDF POS=(17,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00310   
               COLOR=BLUE                                               00311   
ABOL12  DFHMDF POS=(17,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00312   
               COLOR=BLUE                                               00313   
ACTNC12 DFHMDF POS=(17,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00314   
               COLOR=BLUE                                               00315   
ANOPO12 DFHMDF POS=(17,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00316   
               COLOR=BLUE                                               00317   
AVEND12 DFHMDF POS=(17,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00318   
               COLOR=BLUE                                               00319   
AOSCA12 DFHMDF POS=(17,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00320   
               COLOR=BLUE                                               00321   
*                                                                       00322   
ASEL13  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00323   
               HILIGHT=UNDERLINE,                                      C00324   
               COLOR=GREEN                                              00325   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00326   
ASTA13  DFHMDF POS=(18,06),LENGTH=02,ATTRB=(ASKIP,NORM),               C00327   
               COLOR=BLUE                                               00328   
AFRBL13 DFHMDF POS=(18,09),LENGTH=20,ATTRB=(ASKIP,NORM),               C00329   
               COLOR=BLUE                                               00330   
ABOL13  DFHMDF POS=(18,30),LENGTH=20,ATTRB=(ASKIP,NORM),               C00331   
               COLOR=BLUE                                               00332   
ACTNC13 DFHMDF POS=(18,51),LENGTH=06,ATTRB=(ASKIP,NORM),               C00333   
               COLOR=BLUE                                               00334   
ANOPO13 DFHMDF POS=(18,58),LENGTH=06,ATTRB=(ASKIP,NORM),               C00335   
               COLOR=BLUE                                               00336   
AVEND13 DFHMDF POS=(18,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00337   
               COLOR=BLUE                                               00338   
AOSCA13 DFHMDF POS=(18,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00339   
               COLOR=BLUE                                               00340   
*                                                                       00341   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00342   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00343   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00344   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00345   
**************                                                          00346   
        DFHMSD TYPE=FINAL                                               00347   
**************                                                          00348   
        END                                                             00349   
