*          DATA SET RCK00081   AT LEVEL 006 AS OF 02/12/96                      
*          DATA SET RCKM255    AT LEVEL 004 AS OF 11/21/95              00001   
*********************************************************************** 00002   
*                                                                       00003   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00004   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00005   
*********************************************************************** 00006   
        PRINT NOGEN                                                     00007   
RCKM255 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00008   
RC255A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00009   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00010   
**********************************************************************  00011   
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00012   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00013   
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00014   
               COLOR=GREEN,                                            X00015   
               HILIGHT=UNDERLINE,                                      X00016   
               PICOUT='ZZZZ9'                                           00017   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00018   
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='TO'                                             00020   
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00021   
               COLOR=BLUE,                                             X00022   
               PICOUT='ZZZZ9'                                           00023   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='OF'                                             00026   
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00027   
               COLOR=BLUE,                                             X00028   
               PICOUT='ZZZZ9'                                           00029   
**********************************************************************  00030   
        DFHMDF POS=(02,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00031   
               INITIAL='P.O. NUMBER.....:'                              00032   
APONBR  DFHMDF POS=(02,19),LENGTH=08,ATTRB=(ASKIP,NORM),               X00033   
               COLOR=BLUE                                               00034   
        DFHMDF POS=(02,34),LENGTH=10,ATTRB=(ASKIP,BRT),                X00035   
               INITIAL='PACK TYPE:'                                     00036   
APKGTYP DFHMDF POS=(02,45),LENGTH=22,ATTRB=(ASKIP,NORM),               X00033   
               COLOR=BLUE                                               00034   
**********************************************************************  00030   
        DFHMDF POS=(03,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00044   
               INITIAL='SEQUENCE NBR....:'                              00045   
ASEQNBR DFHMDF POS=(03,19),LENGTH=04,ATTRB=(ASKIP,NORM),               X00046   
               COLOR=BLUE                                               00047   
        DFHMDF POS=(03,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00035   
               INITIAL='EXPTED CART QTY:'                               00036   
AEXQTY  DFHMDF POS=(03,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00038   
        DFHMDF POS=(03,60),LENGTH=07,ATTRB=(ASKIP,BRT),                X00039   
               INITIAL='STATUS:'                                        00040   
ASTAT   DFHMDF POS=(03,68),LENGTH=02,ATTRB=(ASKIP,NORM),               X00041   
               COLOR=BLUE                                               00042   
**********************************************************************  00043   
        DFHMDF POS=(04,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00044   
               INITIAL='CRE/CURR OPER...:'                              00045   
ACRECUR DFHMDF POS=(04,19),LENGTH=09,ATTRB=(ASKIP,NORM),               X00046   
               COLOR=BLUE                                               00047   
        DFHMDF POS=(04,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00048   
               INITIAL='ACTUAL CART QTY:'                               00049   
AACQTY  DFHMDF POS=(04,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00050   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00051   
        DFHMDF POS=(04,58),LENGTH=09,ATTRB=(ASKIP,BRT),                X00052   
               INITIAL='TRBL RSN:'                                      00053   
ATRBL   DFHMDF POS=(04,68),LENGTH=11,ATTRB=(ASKIP,NORM),               X00054   
               COLOR=YELLOW                                             00055   
**********************************************************************  00056   
        DFHMDF POS=(05,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00044   
               INITIAL='DEPT............:'                              00045   
ADEPNBR DFHMDF POS=(05,19),LENGTH=03,ATTRB=(ASKIP,NORM),               X00046   
               COLOR=BLUE                                               00047   
        DFHMDF POS=(05,26),LENGTH=02,ATTRB=(ASKIP,BRT),                X00057**5
               INITIAL='RC'                                             00058   
        DFHMDF POS=(05,50),LENGTH=06,ATTRB=(ASKIP,BRT),                X00057**5
               INITIAL='LOWEST'                                         00058   
        DFHMDF POS=(05,57),LENGTH=1,ATTRB=ASKIP                         00059**5
**********************************************************************  00060   
        DFHMDF POS=(06,04),LENGTH=02,ATTRB=(ASKIP,BRT),                X00061   
               INITIAL='PO'                                             00062   
        DFHMDF POS=(06,16),LENGTH=1,ATTRB=ASKIP                         00063   
        DFHMDF POS=(06,21),LENGTH=35,ATTRB=(ASKIP,BRT),                X00064**5
               INITIAL='DTL  IT  OTR   PKSL  VRFY  VERIFIED'            00065**5
        DFHMDF POS=(06,60),LENGTH=17,ATTRB=(ASKIP,BRT),                X00066**5
               INITIAL='TROUBLE    CREATE'                              00067**5
        DFHMDF POS=(06,79),LENGTH=1,ATTRB=ASKIP                         00068   
**********************************************************************  00069   
        DFHMDF POS=(07,01),LENGTH=28,ATTRB=(ASKIP,BRT),                X00070   
               INITIAL='S LINE     SKU     ITEM  ST'                    00071   
        DFHMDF POS=(07,30),LENGTH=36,ATTRB=(ASKIP,BRT),                X00072   
               INITIAL='ITEM  ITEM  ITEM    RETAIL    REASON'           00073**5
        DFHMDF POS=(07,71),LENGTH=07,ATTRB=(ASKIP,BRT),                X00074   
               INITIAL='PK SLIP'                                        00075   
**********************************************************************  00076   
        DFHMDF POS=(08,1),LENGTH=27,ATTRB=(ASKIP,BRT),                 X00077   
               INITIAL='- ---- ----------- ----- --'                    00078   
        DFHMDF POS=(08,29),LENGTH=41,ATTRB=(ASKIP,BRT),                X00079   
               INITIAL='----- ----- ----- --------- -------------'      00080**5
        DFHMDF POS=(08,71),LENGTH=08,ATTRB=(ASKIP,BRT),                X00081   
               INITIAL='--------'                                       00082   
**********************************************************************  00083   
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00084   
               HILIGHT=UNDERLINE,                                      X00085   
               COLOR=GREEN                                              00086   
ALNN01  DFHMDF POS=(09,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00088   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00089   
ASKU01  DFHMDF POS=(09,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00090   
               COLOR=BLUE                                               00091   
ADTI01  DFHMDF POS=(09,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00092**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00093   
ASTA01  DFHMDF POS=(09,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00094**4
               COLOR=BLUE                                               00095   
AOTR01  DFHMDF POS=(09,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00096**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00097   
APKI01  DFHMDF POS=(09,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00098**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00099   
AVFI01  DFHMDF POS=(09,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00100   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00101   
ALVR01  DFHMDF POS=(09,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00102**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00103   
ATRB01  DFHMDF POS=(09,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00104**5
               COLOR=BLUE                                               00105   
AUPS01  DFHMDF POS=(09,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00106**4
               COLOR=BLUE                                               00107   
****    DFHMDF POS=(09,79),LENGTH=01,ATTRB=(ASKIP)                      00108   
*********************************************************************** 00109   
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00110**3
               HILIGHT=UNDERLINE,                                      X00111   
               COLOR=GREEN                                              00112   
ALNN02  DFHMDF POS=(10,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00114**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00115   
ASKU02  DFHMDF POS=(10,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00116**3
               COLOR=BLUE                                               00117   
ADTI02  DFHMDF POS=(10,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00118**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00119   
ASTA02  DFHMDF POS=(10,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00120**4
               COLOR=BLUE                                               00121   
AOTR02  DFHMDF POS=(10,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00122**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00123   
APKI02  DFHMDF POS=(10,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00124**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00125   
AVFI02  DFHMDF POS=(10,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00126**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00127   
ALVR02  DFHMDF POS=(10,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00128**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00129   
ATRB02  DFHMDF POS=(10,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00130**5
               COLOR=BLUE                                               00131   
AUPS02  DFHMDF POS=(10,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00132**4
               COLOR=BLUE                                               00133   
****    DFHMDF POS=(10,79),LENGTH=01,ATTRB=(ASKIP)                      00134   
*********************************************************************** 00135   
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00136**3
               HILIGHT=UNDERLINE,                                      X00137   
               COLOR=GREEN                                              00138   
ALNN03  DFHMDF POS=(11,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00140**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00141   
ASKU03  DFHMDF POS=(11,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00142**3
               COLOR=BLUE                                               00143   
ADTI03  DFHMDF POS=(11,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00144**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00145   
ASTA03  DFHMDF POS=(11,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00146**4
               COLOR=BLUE                                               00147   
AOTR03  DFHMDF POS=(11,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00148**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00149   
APKI03  DFHMDF POS=(11,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00150**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00151   
AVFI03  DFHMDF POS=(11,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00152**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00153   
ALVR03  DFHMDF POS=(11,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00154**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00155   
ATRB03  DFHMDF POS=(11,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00156**5
               COLOR=BLUE                                               00157   
AUPS03  DFHMDF POS=(11,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00158**4
               COLOR=BLUE                                               00159   
****    DFHMDF POS=(11,79),LENGTH=01,ATTRB=(ASKIP)                      00160   
*********************************************************************** 00161   
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00162**3
               HILIGHT=UNDERLINE,                                      X00163   
               COLOR=GREEN                                              00164   
ALNN04  DFHMDF POS=(12,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00166**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00167   
ASKU04  DFHMDF POS=(12,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00168**3
               COLOR=BLUE                                               00169   
ADTI04  DFHMDF POS=(12,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00170**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00171   
ASTA04  DFHMDF POS=(12,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00172**4
               COLOR=BLUE                                               00173   
AOTR04  DFHMDF POS=(12,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00174**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00175   
APKI04  DFHMDF POS=(12,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00176**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00177   
AVFI04  DFHMDF POS=(12,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00178**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00179   
ALVR04  DFHMDF POS=(12,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00180**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00181   
ATRB04  DFHMDF POS=(12,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00182**5
               COLOR=BLUE                                               00183   
AUPS04  DFHMDF POS=(12,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00184**4
               COLOR=BLUE                                               00185   
****    DFHMDF POS=(12,79),LENGTH=01,ATTRB=(ASKIP)                      00186   
*********************************************************************** 00187   
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00188**3
               HILIGHT=UNDERLINE,                                      X00189   
               COLOR=GREEN                                              00190   
ALNN05  DFHMDF POS=(13,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00192**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00193**3
ASKU05  DFHMDF POS=(13,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00194**3
               COLOR=BLUE                                               00195   
ADTI05  DFHMDF POS=(13,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00196**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00197   
ASTA05  DFHMDF POS=(13,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00198**4
               COLOR=BLUE                                               00199   
AOTR05  DFHMDF POS=(13,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00200**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00201   
APKI05  DFHMDF POS=(13,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00202**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00203   
AVFI05  DFHMDF POS=(13,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00204**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00205   
ALVR05  DFHMDF POS=(13,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00206**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00207   
ATRB05  DFHMDF POS=(13,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00208**6
               COLOR=BLUE                                               00209   
AUPS05  DFHMDF POS=(13,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00210**4
               COLOR=BLUE                                               00211   
****    DFHMDF POS=(13,79),LENGTH=01,ATTRB=(ASKIP)                      00212   
*********************************************************************** 00213   
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00214**3
               HILIGHT=UNDERLINE,                                      X00215   
               COLOR=GREEN                                              00216   
ALNN06  DFHMDF POS=(14,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00218**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00219   
ASKU06  DFHMDF POS=(14,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00220**3
               COLOR=BLUE                                               00221   
ADTI06  DFHMDF POS=(14,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00222**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00223   
ASTA06  DFHMDF POS=(14,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00224**4
               COLOR=BLUE                                               00225   
AOTR06  DFHMDF POS=(14,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00226**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00227   
APKI06  DFHMDF POS=(14,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00228**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00229   
AVFI06  DFHMDF POS=(14,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00230**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00231   
ALVR06  DFHMDF POS=(14,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00232**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00233   
ATRB06  DFHMDF POS=(14,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00234**6
               COLOR=BLUE                                               00235   
AUPS06  DFHMDF POS=(14,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00236**4
               COLOR=BLUE                                               00237   
****    DFHMDF POS=(14,79),LENGTH=01,ATTRB=(ASKIP)                      00238   
*********************************************************************** 00239   
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00240**3
               HILIGHT=UNDERLINE,                                      X00241   
               COLOR=GREEN                                              00242   
ALNN07  DFHMDF POS=(15,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00244**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00245   
ASKU07  DFHMDF POS=(15,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00246**3
               COLOR=BLUE                                               00247   
ADTI07  DFHMDF POS=(15,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00248**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00249   
ASTA07  DFHMDF POS=(15,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00250**4
               COLOR=BLUE                                               00251   
AOTR07  DFHMDF POS=(15,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00252**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00253   
APKI07  DFHMDF POS=(15,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00254**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00255   
AVFI07  DFHMDF POS=(15,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00256**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00257   
ALVR07  DFHMDF POS=(15,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00258**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00259   
ATRB07  DFHMDF POS=(15,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00260**6
               COLOR=BLUE                                               00261   
AUPS07  DFHMDF POS=(15,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00262**4
               COLOR=BLUE                                               00263   
****    DFHMDF POS=(15,79),LENGTH=01,ATTRB=(ASKIP)                      00264   
*********************************************************************** 00265   
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00266**3
               HILIGHT=UNDERLINE,                                      X00267   
               COLOR=GREEN                                              00268   
ALNN08  DFHMDF POS=(16,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00270**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00271   
ASKU08  DFHMDF POS=(16,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00272**3
               COLOR=BLUE                                               00273   
ADTI08  DFHMDF POS=(16,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00274**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00275   
ASTA08  DFHMDF POS=(16,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00276**4
               COLOR=BLUE                                               00277   
AOTR08  DFHMDF POS=(16,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00278**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00279   
APKI08  DFHMDF POS=(16,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00280**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00281   
AVFI08  DFHMDF POS=(16,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00282**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00283   
ALVR08  DFHMDF POS=(16,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00284**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00285   
ATRB08  DFHMDF POS=(16,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00286**6
               COLOR=BLUE                                               00287**3
AUPS08  DFHMDF POS=(16,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00288**4
               COLOR=BLUE                                               00289   
****    DFHMDF POS=(16,79),LENGTH=01,ATTRB=(ASKIP)                      00290   
*********************************************************************** 00291   
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00292**3
               HILIGHT=UNDERLINE,                                      X00293   
               COLOR=GREEN                                              00294   
ALNN09  DFHMDF POS=(17,03),LENGTH=04,ATTRB=(ASKIP,NORM),               X00296**3
               COLOR=BLUE,PICOUT='ZZZ9'                                 00297   
ASKU09  DFHMDF POS=(17,08),LENGTH=11,ATTRB=(ASKIP,NORM),               X00298**3
               COLOR=BLUE                                               00299   
ADTI09  DFHMDF POS=(17,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00300**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00301   
ASTA09  DFHMDF POS=(17,26),LENGTH=02,ATTRB=(ASKIP,NORM),               X00302**4
               COLOR=BLUE                                               00303   
AOTR09  DFHMDF POS=(17,29),LENGTH=05,ATTRB=(ASKIP,NORM),               X00304**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00305   
APKI09  DFHMDF POS=(17,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00306**4
               COLOR=BLUE,PICOUT='ZZZZ9'                                00307   
AVFI09  DFHMDF POS=(17,41),LENGTH=05,ATTRB=(ASKIP,NORM),               X00308**3
               COLOR=BLUE,PICOUT='ZZZZ9'                                00309   
ALVR09  DFHMDF POS=(17,47),LENGTH=09,ATTRB=(ASKIP,NORM),               X00310**4
               COLOR=BLUE,PICOUT='ZZZZZZ.ZZ'                            00311   
ATRB09  DFHMDF POS=(17,57),LENGTH=13,ATTRB=(ASKIP,NORM),               X00312**6
               COLOR=BLUE                                               00313   
AUPS09  DFHMDF POS=(17,71),LENGTH=08,ATTRB=(ASKIP,NORM),               X00314**4
               COLOR=BLUE                                               00315   
****    DFHMDF POS=(17,79),LENGTH=01,ATTRB=(ASKIP)                      00316   
*********************************************************************** 00317   
        DFHMDF POS=(18,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00318   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00319   
ASELIT  DFHMDF POS=(18,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00320   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00321   
*********************************************************************** 00322   
        DFHMSD TYPE=FINAL                                               00323   
        PRINT NOGEN                                                     00324   
        END                                                             00325   
