*          DATA SET RCKM252    AT LEVEL 001 AS OF 08/03/94                      
*          DATA SET RCKM252    AT LEVEL 001 AS OF 08/03/94              00001   
*          DATA SET RCKM252    AT LEVEL 001 AS OF 08/03/94              00002   
*          DATA SET RCKM252    AT LEVEL 001 AS OF 07/22/94              00003   
*          DATA SET RCKM252    AT LEVEL 016 AS OF 07/15/94              00004   
  PRINT  NOGEN                                                          00005   
*-------------------------------------------------------------------*   00006   
*                                                                   *   00007   
*        MAPSET  RCKM252                                            *   00008   
*        MAP     RC252A                                             *   00009   
*        PROGRAM RCKCS252                                           *   00010   
*        TRANSID E252 - FREE-FORM PACK SLIP LINE ENTRY              *   00011   
*        SYSTEM  RC NEW RECEIVING                                   *   00012   
*                                                                   *   00013   
*-------------------------------------------------------------------*   00014   
RCKM252 DFHMSD TYPE=DSECT,                                             X00015   
               MODE=INOUT,                                             X00016   
               LANG=COBOL,                                             X00017   
               STORAGE=AUTO,                                           X00018   
               TIOAPFX=YES,                                            X00019   
               TERM=3270-2                                              00020   
RC252A  DFHMDI LINE=2,COLUMN=1,                                        X00021   
               SIZE=(19,80),                                           X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT),                                 X00024   
               CTRL=(FREEKB)                                            00025   
*                                                                       00026   
        DFHMDF POS=(01,01),                                            X00027   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00029   
               COLOR=NEUTRAL,                                          X00030   
               INITIAL='OP ID...:'                                      00031   
AOPER   DFHMDF POS=(01,11),                                            X00032   
               LENGTH=04,                                              X00033   
               ATTRB=(ASKIP,NORM),                                     X00034   
               COLOR=BLUE                                               00035   
AFCLTY  DFHMDF POS=(01,16),                                            X00036   
               LENGTH=04,                                              X00037   
               ATTRB=(ASKIP,NORM),                                     X00038   
               COLOR=BLUE                                               00039   
        DFHMDF POS=(01,35),                                            X00040   
               LENGTH=12,                                              X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               COLOR=NEUTRAL,                                          X00043   
               INITIAL='VENDOR NAME:'                                   00044   
AVEND   DFHMDF POS=(01,48),                                            X00045   
               LENGTH=30,                                              X00046   
               ATTRB=(ASKIP,NORM),                                     X00047   
               COLOR=BLUE                                               00048   
*                                                                       00049   
        DFHMDF POS=(02,01),                                            X00050   
               LENGTH=09,                                              X00051   
               ATTRB=(ASKIP,NORM),                                     X00052   
               COLOR=NEUTRAL,                                          X00053   
               INITIAL='RCVR....:'                                      00054   
ARCVR   DFHMDF POS=(02,11),                                            X00055   
               LENGTH=13,                                              X00056   
               ATTRB=(ASKIP,NORM),                                     X00057   
               COLOR=BLUE                                               00058   
        DFHMDF POS=(02,45),                                            X00059   
               LENGTH=05,                                              X00060   
               ATTRB=(ASKIP,NORM),                                     X00061   
               COLOR=NEUTRAL,                                          X00062   
               INITIAL='ITEMS'                                          00063   
ASTRTIT DFHMDF POS=(02,51),                                            X00064   
               LENGTH=05,                                              X00065   
               ATTRB=(ASKIP,NORM),                                     X00066   
               COLOR=BLUE,                                             X00067   
               PICOUT='ZZZZ9'                                           00068   
        DFHMDF POS=(02,57),                                            X00069   
               LENGTH=02,                                              X00070   
               ATTRB=(ASKIP,NORM),                                     X00071   
               COLOR=NEUTRAL,                                          X00072   
               INITIAL='TO'                                             00073   
AENDIT  DFHMDF POS=(02,60),                                            X00074   
               LENGTH=05,                                              X00075   
               ATTRB=(ASKIP,NORM),                                     X00076   
               COLOR=BLUE,                                             X00077   
               PICOUT='ZZZZ9'                                           00078   
        DFHMDF POS=(02,66),                                            X00079   
               LENGTH=02,                                              X00080   
               ATTRB=(ASKIP,NORM),                                     X00081   
               COLOR=NEUTRAL,                                          X00082   
               INITIAL='OF'                                             00083   
ATOTIT  DFHMDF POS=(02,69),                                            X00084   
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               COLOR=BLUE,                                             X00087   
               PICOUT='ZZZZ9'                                           00088   
*                                                                       00089   
        DFHMDF POS=(03,01),                                            X00090   
               LENGTH=09,                                              X00091   
               ATTRB=(ASKIP,NORM),                                     X00092   
               COLOR=NEUTRAL,                                          X00093   
               INITIAL='STR DEST:'                                      00094   
ASTR    DFHMDF POS=(03,11),                                            X00095   
               LENGTH=04,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=BLUE                                               00098   
*                                                                       00099   
        DFHMDF POS=(04,31),                                            X00100   
               LENGTH=04,                                              X00101   
               ATTRB=(PROT,NORM),                                      X00102   
               COLOR=NEUTRAL,                                          X00103   
               INITIAL='UNIT'                                           00104   
        DFHMDF POS=(04,38),                                            X00105   
               LENGTH=02,                                              X00106   
               ATTRB=(PROT,NORM),                                      X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='PO'                                             00109   
*                                                                       00110   
        DFHMDF POS=(05,01),                                            X00111   
               LENGTH=07,                                              X00112   
               ATTRB=(PROT,NORM),                                      X00113   
               COLOR=NEUTRAL,                                          X00114   
               INITIAL='SEL ACT'                                        00115   
        DFHMDF POS=(05,09),                                            X00116   
               LENGTH=05,                                              X00117   
               ATTRB=(PROT,NORM),                                      X00118   
               COLOR=NEUTRAL,                                          X00119   
               INITIAL='STYLE'                                          00120   
        DFHMDF POS=(05,32),                                            X00121   
               LENGTH=03,                                              X00122   
               ATTRB=(PROT,NORM),                                      X00123   
               COLOR=NEUTRAL,                                          X00124   
               INITIAL='QTY'                                            00125   
        DFHMDF POS=(05,37),                                            X00126   
               LENGTH=04,                                              X00127   
               ATTRB=(PROT,NORM),                                      X00128   
               COLOR=NEUTRAL,                                          X00129   
               INITIAL='LINE'                                           00130   
        DFHMDF POS=(05,46),                                            X00131   
               LENGTH=04,                                              X00132   
               ATTRB=(PROT,NORM),                                      X00133   
               COLOR=NEUTRAL,                                          X00134   
               INITIAL='COST'                                           00135   
        DFHMDF POS=(05,54),                                            X00136   
               LENGTH=11,                                              X00137   
               ATTRB=(PROT,NORM),                                      X00138   
               COLOR=NEUTRAL,                                          X00139   
               INITIAL='DESCRIPTION'                                    00140   
*                                                                       00141   
ASEL01  DFHMDF POS=(06,03),                                            X00142   
               LENGTH=01,                                              X00143   
               ATTRB=(ASKIP,NORM),                                     X00144   
               HILIGHT=UNDERLINE,                                      X00145   
               COLOR=GREEN                                              00146   
AACT01  DFHMDF POS=(06,05),                                            X00147   
               LENGTH=03,                                              X00148   
               ATTRB=(ASKIP,NORM),                                     X00149   
               COLOR=BLUE                                               00150   
ASTYL01 DFHMDF POS=(06,09),                                            X00151   
               LENGTH=20,                                              X00152   
               ATTRB=(UNPROT,NORM),                                    X00153   
               HILIGHT=UNDERLINE,                                      X00154   
               COLOR=GREEN                                              00155   
AQTY01  DFHMDF POS=(06,30),                                            X00156   
               LENGTH=06,                                              X00157   
               ATTRB=(UNPROT,NORM,NUM),                                X00158   
               HILIGHT=UNDERLINE,                                      X00159   
               COLOR=GREEN                                              00160   
ALINE01 DFHMDF POS=(06,37),                                            X00161   
               LENGTH=04,                                              X00162   
               ATTRB=(ASKIP,NORM),                                     X00163   
               COLOR=BLUE                                               00164   
ACOST01 DFHMDF POS=(06,42),                                            X00165   
               LENGTH=10,                                              X00166   
               ATTRB=(ASKIP,NORM),                                     X00167   
               PICOUT='ZZ,ZZZ.999',                                    X00168   
               COLOR=BLUE                                               00169   
ADESC01 DFHMDF POS=(06,54),                                            X00170   
               LENGTH=25,                                              X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               COLOR=BLUE                                               00173   
*                                                                       00174   
ASEL02  DFHMDF POS=(07,03),                                            X00175   
               LENGTH=01,                                              X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               HILIGHT=UNDERLINE,                                      X00178   
               COLOR=GREEN                                              00179   
AACT02  DFHMDF POS=(07,05),                                            X00180   
               LENGTH=03,                                              X00181   
               ATTRB=(ASKIP,NORM),                                     X00182   
               COLOR=BLUE                                               00183   
ASTYL02 DFHMDF POS=(07,09),                                            X00184   
               LENGTH=20,                                              X00185   
               ATTRB=(UNPROT,NORM),                                    X00186   
               HILIGHT=UNDERLINE,                                      X00187   
               COLOR=GREEN                                              00188   
AQTY02  DFHMDF POS=(07,30),                                            X00189   
               LENGTH=06,                                              X00190   
               ATTRB=(UNPROT,NORM,NUM),                                X00191   
               HILIGHT=UNDERLINE,                                      X00192   
               COLOR=GREEN                                              00193   
ALINE02 DFHMDF POS=(07,37),                                            X00194   
               LENGTH=04,                                              X00195   
               ATTRB=(ASKIP,NORM),                                     X00196   
               COLOR=BLUE                                               00197   
ACOST02 DFHMDF POS=(07,42),                                            X00198   
               LENGTH=10,                                              X00199   
               ATTRB=(ASKIP,NORM),                                     X00200   
               PICOUT='ZZ,ZZZ.999',                                    X00201   
               COLOR=BLUE                                               00202   
ADESC02 DFHMDF POS=(07,54),                                            X00203   
               LENGTH=25,                                              X00204   
               ATTRB=(ASKIP,NORM),                                     X00205   
               COLOR=BLUE                                               00206   
*                                                                       00207   
ASEL03  DFHMDF POS=(08,03),                                            X00208   
               LENGTH=01,                                              X00209   
               ATTRB=(ASKIP,NORM),                                     X00210   
               HILIGHT=UNDERLINE,                                      X00211   
               COLOR=GREEN                                              00212   
AACT03  DFHMDF POS=(08,05),                                            X00213   
               LENGTH=03,                                              X00214   
               ATTRB=(ASKIP,NORM),                                     X00215   
               COLOR=BLUE                                               00216   
ASTYL03 DFHMDF POS=(08,09),                                            X00217   
               LENGTH=20,                                              X00218   
               ATTRB=(UNPROT,NORM),                                    X00219   
               HILIGHT=UNDERLINE,                                      X00220   
               COLOR=GREEN                                              00221   
AQTY03  DFHMDF POS=(08,30),                                            X00222   
               LENGTH=06,                                              X00223   
               ATTRB=(UNPROT,NORM,NUM),                                X00224   
               HILIGHT=UNDERLINE,                                      X00225   
               COLOR=GREEN                                              00226   
ALINE03 DFHMDF POS=(08,37),                                            X00227   
               LENGTH=04,                                              X00228   
               ATTRB=(ASKIP,NORM),                                     X00229   
               COLOR=BLUE                                               00230   
ACOST03 DFHMDF POS=(08,42),                                            X00231   
               LENGTH=10,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               PICOUT='ZZ,ZZZ.999',                                    X00234   
               COLOR=BLUE                                               00235   
ADESC03 DFHMDF POS=(08,54),                                            X00236   
               LENGTH=25,                                              X00237   
               ATTRB=(ASKIP,NORM),                                     X00238   
               COLOR=BLUE                                               00239   
*                                                                       00240   
ASEL04  DFHMDF POS=(09,03),                                            X00241   
               LENGTH=01,                                              X00242   
               ATTRB=(ASKIP,NORM),                                     X00243   
               HILIGHT=UNDERLINE,                                      X00244   
               COLOR=GREEN                                              00245   
AACT04  DFHMDF POS=(09,05),                                            X00246   
               LENGTH=03,                                              X00247   
               ATTRB=(ASKIP,NORM),                                     X00248   
               COLOR=BLUE                                               00249   
ASTYL04 DFHMDF POS=(09,09),                                            X00250   
               LENGTH=20,                                              X00251   
               ATTRB=(UNPROT,NORM),                                    X00252   
               HILIGHT=UNDERLINE,                                      X00253   
               COLOR=GREEN                                              00254   
AQTY04  DFHMDF POS=(09,30),                                            X00255   
               LENGTH=06,                                              X00256   
               ATTRB=(UNPROT,NORM,NUM),                                X00257   
               HILIGHT=UNDERLINE,                                      X00258   
               COLOR=GREEN                                              00259   
ALINE04 DFHMDF POS=(09,37),                                            X00260   
               LENGTH=04,                                              X00261   
               ATTRB=(ASKIP,NORM),                                     X00262   
               COLOR=BLUE                                               00263   
ACOST04 DFHMDF POS=(09,42),                                            X00264   
               LENGTH=10,                                              X00265   
               ATTRB=(ASKIP,NORM),                                     X00266   
               PICOUT='ZZ,ZZZ.999',                                    X00267   
               COLOR=BLUE                                               00268   
ADESC04 DFHMDF POS=(09,54),                                            X00269   
               LENGTH=25,                                              X00270   
               ATTRB=(ASKIP,NORM),                                     X00271   
               COLOR=BLUE                                               00272   
*                                                                       00273   
ASEL05  DFHMDF POS=(10,03),                                            X00274   
               LENGTH=01,                                              X00275   
               ATTRB=(ASKIP,NORM),                                     X00276   
               HILIGHT=UNDERLINE,                                      X00277   
               COLOR=GREEN                                              00278   
AACT05  DFHMDF POS=(10,05),                                            X00279   
               LENGTH=03,                                              X00280   
               ATTRB=(ASKIP,NORM),                                     X00281   
               COLOR=BLUE                                               00282   
ASTYL05 DFHMDF POS=(10,09),                                            X00283   
               LENGTH=20,                                              X00284   
               ATTRB=(UNPROT,NORM),                                    X00285   
               HILIGHT=UNDERLINE,                                      X00286   
               COLOR=GREEN                                              00287   
AQTY05  DFHMDF POS=(10,30),                                            X00288   
               LENGTH=06,                                              X00289   
               ATTRB=(UNPROT,NORM,NUM),                                X00290   
               HILIGHT=UNDERLINE,                                      X00291   
               COLOR=GREEN                                              00292   
ALINE05 DFHMDF POS=(10,37),                                            X00293   
               LENGTH=04,                                              X00294   
               ATTRB=(ASKIP,NORM),                                     X00295   
               COLOR=BLUE                                               00296   
ACOST05 DFHMDF POS=(10,42),                                            X00297   
               LENGTH=10,                                              X00298   
               ATTRB=(ASKIP,NORM),                                     X00299   
               PICOUT='ZZ,ZZZ.999',                                    X00300   
               COLOR=BLUE                                               00301   
ADESC05 DFHMDF POS=(10,54),                                            X00302   
               LENGTH=25,                                              X00303   
               ATTRB=(ASKIP,NORM),                                     X00304   
               COLOR=BLUE                                               00305   
*                                                                       00306   
ASEL06  DFHMDF POS=(11,03),                                            X00307   
               LENGTH=01,                                              X00308   
               ATTRB=(ASKIP,NORM),                                     X00309   
               HILIGHT=UNDERLINE,                                      X00310   
               COLOR=GREEN                                              00311   
AACT06  DFHMDF POS=(11,05),                                            X00312   
               LENGTH=03,                                              X00313   
               ATTRB=(ASKIP,NORM),                                     X00314   
               COLOR=BLUE                                               00315   
ASTYL06 DFHMDF POS=(11,09),                                            X00316   
               LENGTH=20,                                              X00317   
               ATTRB=(UNPROT,NORM),                                    X00318   
               HILIGHT=UNDERLINE,                                      X00319   
               COLOR=GREEN                                              00320   
AQTY06  DFHMDF POS=(11,30),                                            X00321   
               LENGTH=06,                                              X00322   
               ATTRB=(UNPROT,NORM,NUM),                                X00323   
               HILIGHT=UNDERLINE,                                      X00324   
               COLOR=GREEN                                              00325   
ALINE06 DFHMDF POS=(11,37),                                            X00326   
               LENGTH=04,                                              X00327   
               ATTRB=(ASKIP,NORM),                                     X00328   
               COLOR=BLUE                                               00329   
ACOST06 DFHMDF POS=(11,42),                                            X00330   
               LENGTH=10,                                              X00331   
               ATTRB=(ASKIP,NORM),                                     X00332   
               PICOUT='ZZ,ZZZ.999',                                    X00333   
               COLOR=BLUE                                               00334   
ADESC06 DFHMDF POS=(11,54),                                            X00335   
               LENGTH=25,                                              X00336   
               ATTRB=(ASKIP,NORM),                                     X00337   
               COLOR=BLUE                                               00338   
*                                                                       00339   
ASEL07  DFHMDF POS=(12,03),                                            X00340   
               LENGTH=01,                                              X00341   
               ATTRB=(ASKIP,NORM),                                     X00342   
               HILIGHT=UNDERLINE,                                      X00343   
               COLOR=GREEN                                              00344   
AACT07  DFHMDF POS=(12,05),                                            X00345   
               LENGTH=03,                                              X00346   
               ATTRB=(ASKIP,NORM),                                     X00347   
               COLOR=BLUE                                               00348   
ASTYL07 DFHMDF POS=(12,09),                                            X00349   
               LENGTH=20,                                              X00350   
               ATTRB=(UNPROT,NORM),                                    X00351   
               HILIGHT=UNDERLINE,                                      X00352   
               COLOR=GREEN                                              00353   
AQTY07  DFHMDF POS=(12,30),                                            X00354   
               LENGTH=06,                                              X00355   
               ATTRB=(UNPROT,NORM,NUM),                                X00356   
               HILIGHT=UNDERLINE,                                      X00357   
               COLOR=GREEN                                              00358   
ALINE07 DFHMDF POS=(12,37),                                            X00359   
               LENGTH=04,                                              X00360   
               ATTRB=(ASKIP,NORM),                                     X00361   
               COLOR=BLUE                                               00362   
ACOST07 DFHMDF POS=(12,42),                                            X00363   
               LENGTH=10,                                              X00364   
               ATTRB=(ASKIP,NORM),                                     X00365   
               PICOUT='ZZ,ZZZ.999',                                    X00366   
               COLOR=BLUE                                               00367   
ADESC07 DFHMDF POS=(12,54),                                            X00368   
               LENGTH=25,                                              X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               COLOR=BLUE                                               00371   
*                                                                       00372   
ASEL08  DFHMDF POS=(13,03),                                            X00373   
               LENGTH=01,                                              X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               HILIGHT=UNDERLINE,                                      X00376   
               COLOR=GREEN                                              00377   
AACT08  DFHMDF POS=(13,05),                                            X00378   
               LENGTH=03,                                              X00379   
               ATTRB=(ASKIP,NORM),                                     X00380   
               COLOR=BLUE                                               00381   
ASTYL08 DFHMDF POS=(13,09),                                            X00382   
               LENGTH=20,                                              X00383   
               ATTRB=(UNPROT,NORM),                                    X00384   
               HILIGHT=UNDERLINE,                                      X00385   
               COLOR=GREEN                                              00386   
AQTY08  DFHMDF POS=(13,30),                                            X00387   
               LENGTH=06,                                              X00388   
               ATTRB=(UNPROT,NORM,NUM),                                X00389   
               HILIGHT=UNDERLINE,                                      X00390   
               COLOR=GREEN                                              00391   
ALINE08 DFHMDF POS=(13,37),                                            X00392   
               LENGTH=04,                                              X00393   
               ATTRB=(ASKIP,NORM),                                     X00394   
               COLOR=BLUE                                               00395   
ACOST08 DFHMDF POS=(13,42),                                            X00396   
               LENGTH=10,                                              X00397   
               ATTRB=(ASKIP,NORM),                                     X00398   
               PICOUT='ZZ,ZZZ.999',                                    X00399   
               COLOR=BLUE                                               00400   
ADESC08 DFHMDF POS=(13,54),                                            X00401   
               LENGTH=25,                                              X00402   
               ATTRB=(ASKIP,NORM),                                     X00403   
               COLOR=BLUE                                               00404   
*                                                                       00405   
ASEL09  DFHMDF POS=(14,03),                                            X00406   
               LENGTH=01,                                              X00407   
               ATTRB=(ASKIP,NORM),                                     X00408   
               HILIGHT=UNDERLINE,                                      X00409   
               COLOR=GREEN                                              00410   
AACT09  DFHMDF POS=(14,05),                                            X00411   
               LENGTH=03,                                              X00412   
               ATTRB=(ASKIP,NORM),                                     X00413   
               COLOR=BLUE                                               00414   
ASTYL09 DFHMDF POS=(14,09),                                            X00415   
               LENGTH=20,                                              X00416   
               ATTRB=(UNPROT,NORM),                                    X00417   
               HILIGHT=UNDERLINE,                                      X00418   
               COLOR=GREEN                                              00419   
AQTY09  DFHMDF POS=(14,30),                                            X00420   
               LENGTH=06,                                              X00421   
               ATTRB=(UNPROT,NORM,NUM),                                X00422   
               HILIGHT=UNDERLINE,                                      X00423   
               COLOR=GREEN                                              00424   
ALINE09 DFHMDF POS=(14,37),                                            X00425   
               LENGTH=04,                                              X00426   
               ATTRB=(ASKIP,NORM),                                     X00427   
               COLOR=BLUE                                               00428   
ACOST09 DFHMDF POS=(14,42),                                            X00429   
               LENGTH=10,                                              X00430   
               ATTRB=(ASKIP,NORM),                                     X00431   
               PICOUT='ZZ,ZZZ.999',                                    X00432   
               COLOR=BLUE                                               00433   
ADESC09 DFHMDF POS=(14,54),                                            X00434   
               LENGTH=25,                                              X00435   
               ATTRB=(ASKIP,NORM),                                     X00436   
               COLOR=BLUE                                               00437   
*                                                                       00438   
ASEL10  DFHMDF POS=(15,03),                                            X00439   
               LENGTH=01,                                              X00440   
               ATTRB=(ASKIP,NORM),                                     X00441   
               HILIGHT=UNDERLINE,                                      X00442   
               COLOR=GREEN                                              00443   
AACT10  DFHMDF POS=(15,05),                                            X00444   
               LENGTH=03,                                              X00445   
               ATTRB=(ASKIP,NORM),                                     X00446   
               COLOR=BLUE                                               00447   
ASTYL10 DFHMDF POS=(15,09),                                            X00448   
               LENGTH=20,                                              X00449   
               ATTRB=(UNPROT,NORM),                                    X00450   
               HILIGHT=UNDERLINE,                                      X00451   
               COLOR=GREEN                                              00452   
AQTY10  DFHMDF POS=(15,30),                                            X00453   
               LENGTH=06,                                              X00454   
               ATTRB=(UNPROT,NORM,NUM),                                X00455   
               HILIGHT=UNDERLINE,                                      X00456   
               COLOR=GREEN                                              00457   
ALINE10 DFHMDF POS=(15,37),                                            X00458   
               LENGTH=04,                                              X00459   
               ATTRB=(ASKIP,NORM),                                     X00460   
               COLOR=BLUE                                               00461   
ACOST10 DFHMDF POS=(15,42),                                            X00462   
               LENGTH=10,                                              X00463   
               ATTRB=(ASKIP,NORM),                                     X00464   
               PICOUT='ZZ,ZZZ.999',                                    X00465   
               COLOR=BLUE                                               00466   
ADESC10 DFHMDF POS=(15,54),                                            X00467   
               LENGTH=25,                                              X00468   
               ATTRB=(ASKIP,NORM),                                     X00469   
               COLOR=BLUE                                               00470   
*                                                                       00471   
ASEL11  DFHMDF POS=(16,03),                                            X00472   
               LENGTH=01,                                              X00473   
               ATTRB=(ASKIP,NORM),                                     X00474   
               HILIGHT=UNDERLINE,                                      X00475   
               COLOR=GREEN                                              00476   
AACT11  DFHMDF POS=(16,05),                                            X00477   
               LENGTH=03,                                              X00478   
               ATTRB=(ASKIP,NORM),                                     X00479   
               COLOR=BLUE                                               00480   
ASTYL11 DFHMDF POS=(16,09),                                            X00481   
               LENGTH=20,                                              X00482   
               ATTRB=(UNPROT,NORM),                                    X00483   
               HILIGHT=UNDERLINE,                                      X00484   
               COLOR=GREEN                                              00485   
AQTY11  DFHMDF POS=(16,30),                                            X00486   
               LENGTH=06,                                              X00487   
               ATTRB=(UNPROT,NORM,NUM),                                X00488   
               HILIGHT=UNDERLINE,                                      X00489   
               COLOR=GREEN                                              00490   
ALINE11 DFHMDF POS=(16,37),                                            X00491   
               LENGTH=04,                                              X00492   
               ATTRB=(ASKIP,NORM),                                     X00493   
               COLOR=BLUE                                               00494   
ACOST11 DFHMDF POS=(16,42),                                            X00495   
               LENGTH=10,                                              X00496   
               ATTRB=(ASKIP,NORM),                                     X00497   
               PICOUT='ZZ,ZZZ.999',                                    X00498   
               COLOR=BLUE                                               00499   
ADESC11 DFHMDF POS=(16,54),                                            X00500   
               LENGTH=25,                                              X00501   
               ATTRB=(ASKIP,NORM),                                     X00502   
               COLOR=BLUE                                               00503   
*                                                                       00504   
ASEL12  DFHMDF POS=(17,03),                                            X00505   
               LENGTH=01,                                              X00506   
               ATTRB=(ASKIP,NORM),                                     X00507   
               HILIGHT=UNDERLINE,                                      X00508   
               COLOR=GREEN                                              00509   
AACT12  DFHMDF POS=(17,05),                                            X00510   
               LENGTH=03,                                              X00511   
               ATTRB=(ASKIP,NORM),                                     X00512   
               COLOR=BLUE                                               00513   
ASTYL12 DFHMDF POS=(17,09),                                            X00514   
               LENGTH=20,                                              X00515   
               ATTRB=(UNPROT,NORM),                                    X00516   
               HILIGHT=UNDERLINE,                                      X00517   
               COLOR=GREEN                                              00518   
AQTY12  DFHMDF POS=(17,30),                                            X00519   
               LENGTH=06,                                              X00520   
               ATTRB=(UNPROT,NORM,NUM),                                X00521   
               HILIGHT=UNDERLINE,                                      X00522   
               COLOR=GREEN                                              00523   
ALINE12 DFHMDF POS=(17,37),                                            X00524   
               LENGTH=04,                                              X00525   
               ATTRB=(ASKIP,NORM),                                     X00526   
               COLOR=BLUE                                               00527   
ACOST12 DFHMDF POS=(17,42),                                            X00528   
               LENGTH=10,                                              X00529   
               ATTRB=(ASKIP,NORM),                                     X00530   
               PICOUT='ZZ,ZZZ.999',                                    X00531   
               COLOR=BLUE                                               00532   
ADESC12 DFHMDF POS=(17,54),                                            X00533   
               LENGTH=25,                                              X00534   
               ATTRB=(ASKIP,NORM),                                     X00535   
               COLOR=BLUE                                               00536   
*                                                                       00537   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00538   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00539   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00540   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00541   
**************                                                          00542   
        DFHMSD TYPE=FINAL                                               00543   
**************                                                          00544   
        END                                                             00545   
