*          DATA SET RCKM213    AT LEVEL 014 AS OF 06/09/95                      
*          DATA SET RCKM213    AT LEVEL 005 AS OF 10/17/94              00001*11
*          DATA SET RCKM213    AT LEVEL 012 AS OF 02/19/94              00002*11
  PRINT  NOGEN                                                          00003*11
*-------------------------------------------------------------------*   00004*11
*                                                                   *   00005*11
*        MAPSET  RCKM213                                            *   00006*11
*        MAP     RC213A                                             *   00007*11
*        PROGRAM RCKCS213                                           *   00008*11
*        TRANSID E213 - PACK SLIP LIST                              *   00009*11
*        SYSTEM  RC NEW RECEIVING                                   *   00010*11
*                                                                   *   00011*11
*-------------------------------------------------------------------*   00012*11
RCKM213 DFHMSD TYPE=DSECT,                                             X00013*11
               MODE=INOUT,                                             X00014*11
               LANG=COBOL,                                             X00015*11
               STORAGE=AUTO,                                           X00016*11
               TIOAPFX=YES,                                            X00017*11
               TERM=3270-2                                              00018*11
RC213A  DFHMDI LINE=2,COLUMN=1,                                        X00019*11
               SIZE=(19,80),                                           X00020*11
               MAPATTS=(COLOR,HILIGHT),                                X00021*11
               DSATTS=(COLOR,HILIGHT),                                 X00022*11
               CTRL=(FREEKB)                                            00023*11
*                                                                       00024*11
        DFHMDF POS=(02,01),                                            X00025*11
               LENGTH=06,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='PO NO:'                                         00029*11
APO     DFHMDF POS=(02,08),                                            X00030*11
               LENGTH=08,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
*                                                                       00024*11
        DFHMDF POS=(02,19),                                            X00025*11
               LENGTH=10,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='PACK TYPE:'                                     00029*11
*                                                                               
APKGTYP DFHMDF POS=(02,30),                                            X        
               LENGTH=22,                                              X        
               ATTRB=(ASKIP),                                          X        
               COLOR=BLUE                                                       
*                                                                               
ASPINST DFHMDF POS=(02,54),                                            X        
               LENGTH=26,                                              X        
               ATTRB=(ASKIP),                                          X        
               COLOR=RED,                                              X        
               INITIAL='SPECIAL INSTRUCTIONS EXIST'                             
*                                                                       00034*11
        DFHMDF POS=(03,01),                                            X00035*11
               LENGTH=12,                                              X00036*11
               ATTRB=(ASKIP,NORM),                                     X00037*11
               COLOR=NEUTRAL,                                          X00038*11
               INITIAL='VENDOR NAME:'                                   00039*11
AVEND   DFHMDF POS=(03,14),                                            X00040*11
               LENGTH=30,                                              X00041*11
               ATTRB=(ASKIP,NORM),                                     X00042*11
               COLOR=BLUE                                               00043*11
        DFHMDF POS=(03,45),                                            X00044*11
               LENGTH=05,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='ITEMS'                                          00048*11
ASTRTIT DFHMDF POS=(03,51),                                            X00049*11
               LENGTH=05,                                              X00050*11
               ATTRB=(NUM,UNPROT,NORM),                                X00051*11
               COLOR=GREEN,                                            X00052*11
               HILIGHT=UNDERLINE,                                      X00053*11
               PICOUT='ZZZZ9'                                           00054*11
        DFHMDF POS=(03,57),                                            X00055*11
               LENGTH=02,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               COLOR=NEUTRAL,                                          X00058*11
               INITIAL='TO'                                             00059*11
AENDIT  DFHMDF POS=(03,60),                                            X00060*11
               LENGTH=05,                                              X00061*11
               ATTRB=(ASKIP,NORM),                                     X00062*11
               COLOR=BLUE,                                             X00063*11
               PICOUT='ZZZZ9'                                           00064*11
        DFHMDF POS=(03,66),                                            X00065*11
               LENGTH=02,                                              X00066*11
               ATTRB=(ASKIP,NORM),                                     X00067*11
               COLOR=NEUTRAL,                                          X00068*11
               INITIAL='OF'                                             00069*11
ATOTIT  DFHMDF POS=(03,69),                                            X00070*11
               LENGTH=05,                                              X00071*11
               ATTRB=(ASKIP,NORM),                                     X00072*11
               COLOR=BLUE,                                             X00073*11
               PICOUT='ZZZZ9'                                           00074*11
*                                                                       00075*11
        DFHMDF POS=(04,05),                                            X00076*12
               LENGTH=04,                                              X00077*11
               ATTRB=(PROT,NORM),                                      X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='RCVR'                                           00080*11
        DFHMDF POS=(04,19),                                            X00081*12
               LENGTH=03,                                              X00082*11
               ATTRB=(PROT,NORM),                                      X00083*11
               COLOR=NEUTRAL,                                          X00084*11
               INITIAL='STR'                                            00085*11
        DFHMDF POS=(04,26),                                            X00081*12
               LENGTH=07,                                              X00082*11
               ATTRB=(PROT,NORM),                                      X00083*11
               COLOR=NEUTRAL,                                          X00084*11
               INITIAL='FREIGHT'                                        00085*11
        DFHMDF POS=(04,51),                                            X00086*12
               LENGTH=06,                                              X00087*12
               ATTRB=(PROT,NORM),                                      X00088*12
               COLOR=NEUTRAL,                                          X00089*12
               INITIAL='CARTON'                                         00090*12
        DFHMDF POS=(04,58),                                            X00086*12
               LENGTH=04,                                              X00087*12
               ATTRB=(PROT,NORM),                                      X00088*12
               COLOR=NEUTRAL,                                          X00089*12
               INITIAL='# OF'                                           00090*12
AUPCMSG DFHMDF POS=(04,70),                                            X00122*11
               LENGTH=10,                                              X00123*11
               ATTRB=(ASKIP),                                          X        
               COLOR=YELLOW                                                     
*                                                                       00091*11
        DFHMDF POS=(05,01),                                            X00092*11
               LENGTH=03,                                              X00093*11
               ATTRB=(PROT,NORM),                                      X00094*11
               COLOR=NEUTRAL,                                          X00095*11
               INITIAL='SEL'                                            00096*11
        DFHMDF POS=(05,05),                                            X00097*12
               LENGTH=16,                                              X00098*11
               ATTRB=(PROT,NORM),                                      X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='SEQ  OPER ST  NO'                               00101*11
        DFHMDF POS=(05,27),                                            X00102*12
               LENGTH=4,                                               X00103*11
               ATTRB=(PROT,NORM),                                      X00104*11
               COLOR=NEUTRAL,                                          X00105*11
               INITIAL='BILL'                                           00106*11
        DFHMDF POS=(05,36),                                            X00107*12
               LENGTH=14,                                              X00108*11
               ATTRB=(PROT,NORM),                                      X00109*11
               COLOR=NEUTRAL,                                          X00110*11
               INITIAL='BILL OF LADING'                                 00111*11
        DFHMDF POS=(05,52),                                            X00112*12
               LENGTH=3,                                               X00113*12
               ATTRB=(PROT,NORM),                                      X00114*12
               COLOR=NEUTRAL,                                          X00115*12
               INITIAL='CNT'                                            00116*12
        DFHMDF POS=(05,58),                                            X00112*12
               LENGTH=4,                                               X00113*12
               ATTRB=(PROT,NORM),                                      X00114*12
               COLOR=NEUTRAL,                                          X00115*12
               INITIAL='SSCC'                                           00116*12
        DFHMDF POS=(05,64),                                            X00117*12
               LENGTH=05,                                              X00118*11
               ATTRB=(PROT,NORM),                                      X00119*11
               COLOR=NEUTRAL,                                          X00120*11
               INITIAL='UNITS'                                          00121*11
        DFHMDF POS=(05,70),                                            X00122*11
               LENGTH=09,                                              X00123*11
               ATTRB=(PROT,NORM),                                      X00124*11
               COLOR=NEUTRAL,                                          X00125*11
               INITIAL='PACK SLIP'                                      00126*11
*                                                                       00127*11
ASEL01  DFHMDF POS=(06,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(06,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEQ01  DFHMDF POS=(06,05),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AOP01   DFHMDF POS=(06,10),                                            X00140*12
               LENGTH=04,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
AST01   DFHMDF POS=(06,15),                                            X00144*12
               LENGTH=02,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASTR01  DFHMDF POS=(06,18),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APRO01  DFHMDF POS=(06,23),                                            X00152*12
               LENGTH=10,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ABOL01  DFHMDF POS=(06,34),                                            X00156*12
               LENGTH=16,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
ACNT01  DFHMDF POS=(06,51),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
ASSCC01 DFHMDF POS=(06,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT01 DFHMDF POS=(06,63),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE,                                             X00168*11
               PICOUT='ZZZZZ9'                                          00169*11
APKSL01 DFHMDF POS=(06,70),                                            X00170*11
               LENGTH=10,                                              X00171*11
               ATTRB=(ASKIP,NORM),                                     X00172*11
               COLOR=BLUE                                               00173*11
*                                                                       00174*11
        DFHMDF POS=(07,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL02  DFHMDF POS=(07,02),                                            X00175*11
               LENGTH=01,                                              X00176*11
               ATTRB=(UNPROT,NORM),                                    X00177*11
               HILIGHT=UNDERLINE,                                      X00178*11
               COLOR=GREEN                                              00179*11
        DFHMDF POS=(07,04),                                            X00180*11
               LENGTH=00,                                              X00181*11
               ATTRB=(ASKIP)                                            00182*11
ASEQ02  DFHMDF POS=(07,05),                                            X00183*12
               LENGTH=04,                                              X00184*11
               ATTRB=(ASKIP,NORM),                                     X00185*11
               COLOR=BLUE                                               00186*11
AOP02   DFHMDF POS=(07,10),                                            X00187*12
               LENGTH=04,                                              X00188*11
               ATTRB=(ASKIP,NORM),                                     X00189*11
               COLOR=BLUE                                               00190*11
AST02   DFHMDF POS=(07,15),                                            X00191*12
               LENGTH=02,                                              X00192*11
               ATTRB=(ASKIP,NORM),                                     X00193*11
               COLOR=BLUE                                               00194*11
ASTR02  DFHMDF POS=(07,18),                                            X00195*12
               LENGTH=04,                                              X00196*11
               ATTRB=(ASKIP,NORM),                                     X00197*11
               COLOR=BLUE                                               00198*11
APRO02  DFHMDF POS=(07,23),                                            X00199*12
               LENGTH=10,                                              X00200*11
               ATTRB=(ASKIP,NORM),                                     X00201*11
               COLOR=BLUE                                               00202*11
ABOL02  DFHMDF POS=(07,34),                                            X00203*12
               LENGTH=16,                                              X00204*11
               ATTRB=(ASKIP,NORM),                                     X00205*11
               COLOR=BLUE                                               00206*11
ACNT02  DFHMDF POS=(07,51),                                            X00207*12
               LENGTH=5,                                               X00208*12
               ATTRB=(ASKIP,NORM),                                     X00209*12
               COLOR=BLUE,                                             X00210*12
               PICOUT='ZZZZ9'                                           00211*12
ASSCC02 DFHMDF POS=(07,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT02 DFHMDF POS=(07,63),                                            X00212*13
               LENGTH=06,                                              X00213*11
               ATTRB=(ASKIP,NORM),                                     X00214*11
               COLOR=BLUE,                                             X00215*11
               PICOUT='ZZZZZ9'                                          00216*11
APKSL02 DFHMDF POS=(07,70),                                            X00217*11
               LENGTH=10,                                              X00218*11
               ATTRB=(ASKIP,NORM),                                     X00219*11
               COLOR=BLUE                                               00220*11
*                                                                       00221*11
        DFHMDF POS=(08,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL03  DFHMDF POS=(08,02),                                            X00222*11
               LENGTH=01,                                              X00223*11
               ATTRB=(UNPROT,NORM),                                    X00224*11
               HILIGHT=UNDERLINE,                                      X00225*11
               COLOR=GREEN                                              00226*11
        DFHMDF POS=(08,04),                                            X00227*11
               LENGTH=00,                                              X00228*11
               ATTRB=(ASKIP)                                            00229*11
ASEQ03  DFHMDF POS=(08,05),                                            X00230*12
               LENGTH=04,                                              X00231*11
               ATTRB=(ASKIP,NORM),                                     X00232*11
               COLOR=BLUE                                               00233*11
AOP03   DFHMDF POS=(08,10),                                            X00234*12
               LENGTH=04,                                              X00235*11
               ATTRB=(ASKIP,NORM),                                     X00236*11
               COLOR=BLUE                                               00237*11
AST03   DFHMDF POS=(08,15),                                            X00238*12
               LENGTH=02,                                              X00239*11
               ATTRB=(ASKIP,NORM),                                     X00240*11
               COLOR=BLUE                                               00241*11
ASTR03  DFHMDF POS=(08,18),                                            X00242*12
               LENGTH=04,                                              X00243*11
               ATTRB=(ASKIP,NORM),                                     X00244*11
               COLOR=BLUE                                               00245*11
APRO03  DFHMDF POS=(08,23),                                            X00246*12
               LENGTH=10,                                              X00247*11
               ATTRB=(ASKIP,NORM),                                     X00248*11
               COLOR=BLUE                                               00249*11
ABOL03  DFHMDF POS=(08,34),                                            X00250*12
               LENGTH=16,                                              X00251*11
               ATTRB=(ASKIP,NORM),                                     X00252*11
               COLOR=BLUE                                               00253*11
ACNT03  DFHMDF POS=(08,51),                                            X00254*12
               LENGTH=5,                                               X00255*12
               ATTRB=(ASKIP,NORM),                                     X00256*12
               COLOR=BLUE,                                             X00257*12
               PICOUT='ZZZZ9'                                           00258*12
ASSCC03 DFHMDF POS=(08,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT03 DFHMDF POS=(08,63),                                            X00259*12
               LENGTH=06,                                              X00260*11
               ATTRB=(ASKIP,NORM),                                     X00261*11
               COLOR=BLUE,                                             X00262*11
               PICOUT='ZZZZZ9'                                          00263*11
APKSL03 DFHMDF POS=(08,70),                                            X00264*11
               LENGTH=10,                                              X00265*11
               ATTRB=(ASKIP,NORM),                                     X00266*11
               COLOR=BLUE                                               00267*11
*                                                                       00268*11
        DFHMDF POS=(09,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL04  DFHMDF POS=(09,02),                                            X00269*11
               LENGTH=01,                                              X00270*11
               ATTRB=(UNPROT,NORM),                                    X00271*11
               HILIGHT=UNDERLINE,                                      X00272*11
               COLOR=GREEN                                              00273*11
        DFHMDF POS=(09,04),                                            X00274*11
               LENGTH=00,                                              X00275*11
               ATTRB=(ASKIP)                                            00276*11
ASEQ04  DFHMDF POS=(09,05),                                            X00277*12
               LENGTH=04,                                              X00278*11
               ATTRB=(ASKIP,NORM),                                     X00279*11
               COLOR=BLUE                                               00280*11
AOP04   DFHMDF POS=(09,10),                                            X00281*12
               LENGTH=04,                                              X00282*11
               ATTRB=(ASKIP,NORM),                                     X00283*11
               COLOR=BLUE                                               00284*11
AST04   DFHMDF POS=(09,15),                                            X00285*12
               LENGTH=02,                                              X00286*11
               ATTRB=(ASKIP,NORM),                                     X00287*11
               COLOR=BLUE                                               00288*11
ASTR04  DFHMDF POS=(09,18),                                            X00289*12
               LENGTH=04,                                              X00290*11
               ATTRB=(ASKIP,NORM),                                     X00291*11
               COLOR=BLUE                                               00292*11
APRO04  DFHMDF POS=(09,23),                                            X00293*12
               LENGTH=10,                                              X00294*11
               ATTRB=(ASKIP,NORM),                                     X00295*11
               COLOR=BLUE                                               00296*11
ABOL04  DFHMDF POS=(09,34),                                            X00297*12
               LENGTH=16,                                              X00298*11
               ATTRB=(ASKIP,NORM),                                     X00299*11
               COLOR=BLUE                                               00300*11
ACNT04  DFHMDF POS=(09,51),                                            X00301*12
               LENGTH=5,                                               X00302*12
               ATTRB=(ASKIP,NORM),                                     X00303*12
               COLOR=BLUE,                                             X00304*12
               PICOUT='ZZZZ9'                                           00305*12
ASSCC04 DFHMDF POS=(09,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT04 DFHMDF POS=(09,63),                                            X00306*12
               LENGTH=06,                                              X00307*11
               ATTRB=(ASKIP,NORM),                                     X00308*11
               COLOR=BLUE,                                             X00309*11
               PICOUT='ZZZZZ9'                                          00310*11
APKSL04 DFHMDF POS=(09,70),                                            X00311*11
               LENGTH=10,                                              X00312*11
               ATTRB=(ASKIP,NORM),                                     X00313*11
               COLOR=BLUE                                               00314*11
*                                                                       00315*11
        DFHMDF POS=(10,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL05  DFHMDF POS=(10,02),                                            X00316*11
               LENGTH=01,                                              X00317*11
               ATTRB=(UNPROT,NORM),                                    X00318*11
               HILIGHT=UNDERLINE,                                      X00319*11
               COLOR=GREEN                                              00320*11
        DFHMDF POS=(10,04),                                            X00321*11
               LENGTH=00,                                              X00322*11
               ATTRB=(ASKIP)                                            00323*11
ASEQ05  DFHMDF POS=(10,05),                                            X00324*12
               LENGTH=04,                                              X00325*11
               ATTRB=(ASKIP,NORM),                                     X00326*11
               COLOR=BLUE                                               00327*11
AOP05   DFHMDF POS=(10,10),                                            X00328*12
               LENGTH=04,                                              X00329*11
               ATTRB=(ASKIP,NORM),                                     X00330*11
               COLOR=BLUE                                               00331*11
AST05   DFHMDF POS=(10,15),                                            X00332*12
               LENGTH=02,                                              X00333*11
               ATTRB=(ASKIP,NORM),                                     X00334*11
               COLOR=BLUE                                               00335*11
ASTR05  DFHMDF POS=(10,18),                                            X00336*12
               LENGTH=04,                                              X00337*11
               ATTRB=(ASKIP,NORM),                                     X00338*11
               COLOR=BLUE                                               00339*11
APRO05  DFHMDF POS=(10,23),                                            X00340*12
               LENGTH=10,                                              X00341*11
               ATTRB=(ASKIP,NORM),                                     X00342*11
               COLOR=BLUE                                               00343*11
ABOL05  DFHMDF POS=(10,34),                                            X00344*12
               LENGTH=16,                                              X00345*11
               ATTRB=(ASKIP,NORM),                                     X00346*11
               COLOR=BLUE                                               00347*11
ACNT05  DFHMDF POS=(10,51),                                            X00348*12
               LENGTH=5,                                               X00349*12
               ATTRB=(ASKIP,NORM),                                     X00350*12
               COLOR=BLUE,                                             X00351*12
               PICOUT='ZZZZ9'                                           00352*12
ASSCC05 DFHMDF POS=(10,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT05 DFHMDF POS=(10,63),                                            X00353*12
               LENGTH=06,                                              X00354*11
               ATTRB=(ASKIP,NORM),                                     X00355*11
               COLOR=BLUE,                                             X00356*11
               PICOUT='ZZZZZ9'                                          00357*11
APKSL05 DFHMDF POS=(10,70),                                            X00358*11
               LENGTH=10,                                              X00359*11
               ATTRB=(ASKIP,NORM),                                     X00360*11
               COLOR=BLUE                                               00361*11
*                                                                       00362*11
        DFHMDF POS=(11,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL06  DFHMDF POS=(11,02),                                            X00363*11
               LENGTH=01,                                              X00364*11
               ATTRB=(UNPROT,NORM),                                    X00365*11
               HILIGHT=UNDERLINE,                                      X00366*11
               COLOR=GREEN                                              00367*11
        DFHMDF POS=(11,04),                                            X00368*11
               LENGTH=00,                                              X00369*11
               ATTRB=(ASKIP)                                            00370*11
ASEQ06  DFHMDF POS=(11,05),                                            X00371*12
               LENGTH=04,                                              X00372*11
               ATTRB=(ASKIP,NORM),                                     X00373*11
               COLOR=BLUE                                               00374*11
AOP06   DFHMDF POS=(11,10),                                            X00375*12
               LENGTH=04,                                              X00376*11
               ATTRB=(ASKIP,NORM),                                     X00377*11
               COLOR=BLUE                                               00378*11
AST06   DFHMDF POS=(11,15),                                            X00379*12
               LENGTH=02,                                              X00380*11
               ATTRB=(ASKIP,NORM),                                     X00381*11
               COLOR=BLUE                                               00382*11
ASTR06  DFHMDF POS=(11,18),                                            X00383*12
               LENGTH=04,                                              X00384*11
               ATTRB=(ASKIP,NORM),                                     X00385*11
               COLOR=BLUE                                               00386*11
APRO06  DFHMDF POS=(11,23),                                            X00387*12
               LENGTH=10,                                              X00388*11
               ATTRB=(ASKIP,NORM),                                     X00389*11
               COLOR=BLUE                                               00390*11
ABOL06  DFHMDF POS=(11,34),                                            X00391*12
               LENGTH=16,                                              X00392*11
               ATTRB=(ASKIP,NORM),                                     X00393*11
               COLOR=BLUE                                               00394*11
ACNT06  DFHMDF POS=(11,51),                                            X00395*12
               LENGTH=5,                                               X00396*12
               ATTRB=(ASKIP,NORM),                                     X00397*12
               COLOR=BLUE,                                             X00398*12
               PICOUT='ZZZZ9'                                           00399*12
ASSCC06 DFHMDF POS=(11,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT06 DFHMDF POS=(11,63),                                            X00400*12
               LENGTH=06,                                              X00401*11
               ATTRB=(ASKIP,NORM),                                     X00402*11
               COLOR=BLUE,                                             X00403*11
               PICOUT='ZZZZZ9'                                          00404*11
APKSL06 DFHMDF POS=(11,70),                                            X00405*11
               LENGTH=10,                                              X00406*11
               ATTRB=(ASKIP,NORM),                                     X00407*11
               COLOR=BLUE                                               00408*11
*                                                                       00409*11
        DFHMDF POS=(12,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL07  DFHMDF POS=(12,02),                                            X00410*11
               LENGTH=01,                                              X00411*11
               ATTRB=(UNPROT,NORM),                                    X00412*11
               HILIGHT=UNDERLINE,                                      X00413*11
               COLOR=GREEN                                              00414*11
        DFHMDF POS=(12,04),                                            X00415*11
               LENGTH=00,                                              X00416*11
               ATTRB=(ASKIP)                                            00417*11
ASEQ07  DFHMDF POS=(12,05),                                            X00418*12
               LENGTH=04,                                              X00419*11
               ATTRB=(ASKIP,NORM),                                     X00420*11
               COLOR=BLUE                                               00421*11
AOP07   DFHMDF POS=(12,10),                                            X00422*12
               LENGTH=04,                                              X00423*11
               ATTRB=(ASKIP,NORM),                                     X00424*11
               COLOR=BLUE                                               00425*11
AST07   DFHMDF POS=(12,15),                                            X00426*12
               LENGTH=02,                                              X00427*11
               ATTRB=(ASKIP,NORM),                                     X00428*11
               COLOR=BLUE                                               00429*11
ASTR07  DFHMDF POS=(12,18),                                            X00430*12
               LENGTH=04,                                              X00431*11
               ATTRB=(ASKIP,NORM),                                     X00432*11
               COLOR=BLUE                                               00433*11
APRO07  DFHMDF POS=(12,23),                                            X00434*12
               LENGTH=10,                                              X00435*11
               ATTRB=(ASKIP,NORM),                                     X00436*11
               COLOR=BLUE                                               00437*11
ABOL07  DFHMDF POS=(12,34),                                            X00438*12
               LENGTH=16,                                              X00439*11
               ATTRB=(ASKIP,NORM),                                     X00440*11
               COLOR=BLUE                                               00441*11
ACNT07  DFHMDF POS=(12,51),                                            X00442*12
               LENGTH=5,                                               X00443*12
               ATTRB=(ASKIP,NORM),                                     X00444*12
               COLOR=BLUE,                                             X00445*12
               PICOUT='ZZZZ9'                                           00446*12
ASSCC07 DFHMDF POS=(12,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT07 DFHMDF POS=(12,63),                                            X00447*12
               LENGTH=06,                                              X00448*11
               ATTRB=(ASKIP,NORM),                                     X00449*11
               COLOR=BLUE,                                             X00450*11
               PICOUT='ZZZZZ9'                                          00451*11
APKSL07 DFHMDF POS=(12,70),                                            X00452*11
               LENGTH=10,                                              X00453*11
               ATTRB=(ASKIP,NORM),                                     X00454*11
               COLOR=BLUE                                               00455*11
*                                                                       00456*11
        DFHMDF POS=(13,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL08  DFHMDF POS=(13,02),                                            X00457*11
               LENGTH=01,                                              X00458*11
               ATTRB=(UNPROT,NORM),                                    X00459*11
               HILIGHT=UNDERLINE,                                      X00460*11
               COLOR=GREEN                                              00461*11
        DFHMDF POS=(13,04),                                            X00462*11
               LENGTH=00,                                              X00463*11
               ATTRB=(ASKIP)                                            00464*11
ASEQ08  DFHMDF POS=(13,05),                                            X00465*12
               LENGTH=04,                                              X00466*11
               ATTRB=(ASKIP,NORM),                                     X00467*11
               COLOR=BLUE                                               00468*11
AOP08   DFHMDF POS=(13,10),                                            X00469*12
               LENGTH=04,                                              X00470*11
               ATTRB=(ASKIP,NORM),                                     X00471*11
               COLOR=BLUE                                               00472*11
AST08   DFHMDF POS=(13,15),                                            X00473*12
               LENGTH=02,                                              X00474*11
               ATTRB=(ASKIP,NORM),                                     X00475*11
               COLOR=BLUE                                               00476*11
ASTR08  DFHMDF POS=(13,18),                                            X00477*12
               LENGTH=04,                                              X00478*11
               ATTRB=(ASKIP,NORM),                                     X00479*11
               COLOR=BLUE                                               00480*11
APRO08  DFHMDF POS=(13,23),                                            X00481*12
               LENGTH=10,                                              X00482*11
               ATTRB=(ASKIP,NORM),                                     X00483*11
               COLOR=BLUE                                               00484*11
ABOL08  DFHMDF POS=(13,34),                                            X00485*12
               LENGTH=16,                                              X00486*11
               ATTRB=(ASKIP,NORM),                                     X00487*11
               COLOR=BLUE                                               00488*11
ACNT08  DFHMDF POS=(13,51),                                            X00489*12
               LENGTH=5,                                               X00490*12
               ATTRB=(ASKIP,NORM),                                     X00491*12
               COLOR=BLUE,                                             X00492*12
               PICOUT='ZZZZ9'                                           00493*12
ASSCC08 DFHMDF POS=(13,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT08 DFHMDF POS=(13,63),                                            X00494*12
               LENGTH=06,                                              X00495*11
               ATTRB=(ASKIP,NORM),                                     X00496*11
               COLOR=BLUE,                                             X00497*11
               PICOUT='ZZZZZ9'                                          00498*11
APKSL08 DFHMDF POS=(13,70),                                            X00499*11
               LENGTH=10,                                              X00500*11
               ATTRB=(ASKIP,NORM),                                     X00501*11
               COLOR=BLUE                                               00502*11
*                                                                       00503*11
        DFHMDF POS=(14,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL09  DFHMDF POS=(14,02),                                            X00504*11
               LENGTH=01,                                              X00505*11
               ATTRB=(UNPROT,NORM),                                    X00506*11
               HILIGHT=UNDERLINE,                                      X00507*11
               COLOR=GREEN                                              00508*11
        DFHMDF POS=(14,04),                                            X00509*11
               LENGTH=00,                                              X00510*11
               ATTRB=(ASKIP)                                            00511*11
ASEQ09  DFHMDF POS=(14,05),                                            X00512*12
               LENGTH=04,                                              X00513*11
               ATTRB=(ASKIP,NORM),                                     X00514*11
               COLOR=BLUE                                               00515*11
AOP09   DFHMDF POS=(14,10),                                            X00516*12
               LENGTH=04,                                              X00517*11
               ATTRB=(ASKIP,NORM),                                     X00518*11
               COLOR=BLUE                                               00519*11
AST09   DFHMDF POS=(14,15),                                            X00520*12
               LENGTH=02,                                              X00521*11
               ATTRB=(ASKIP,NORM),                                     X00522*11
               COLOR=BLUE                                               00523*11
ASTR09  DFHMDF POS=(14,18),                                            X00524*12
               LENGTH=04,                                              X00525*11
               ATTRB=(ASKIP,NORM),                                     X00526*11
               COLOR=BLUE                                               00527*11
APRO09  DFHMDF POS=(14,23),                                            X00528*12
               LENGTH=10,                                              X00529*11
               ATTRB=(ASKIP,NORM),                                     X00530*11
               COLOR=BLUE                                               00531*11
ABOL09  DFHMDF POS=(14,34),                                            X00532*12
               LENGTH=16,                                              X00533*11
               ATTRB=(ASKIP,NORM),                                     X00534*11
               COLOR=BLUE                                               00535*11
ACNT09  DFHMDF POS=(14,51),                                            X00536*12
               LENGTH=5,                                               X00537*12
               ATTRB=(ASKIP,NORM),                                     X00538*12
               COLOR=BLUE,                                             X00539*12
               PICOUT='ZZZZ9'                                           00540*12
ASSCC09 DFHMDF POS=(14,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT09 DFHMDF POS=(14,63),                                            X00541*12
               LENGTH=06,                                              X00542*11
               ATTRB=(ASKIP,NORM),                                     X00543*11
               COLOR=BLUE,                                             X00544*11
               PICOUT='ZZZZZ9'                                          00545*11
APKSL09 DFHMDF POS=(14,70),                                            X00546*11
               LENGTH=10,                                              X00547*11
               ATTRB=(ASKIP,NORM),                                     X00548*11
               COLOR=BLUE                                               00549*11
*                                                                       00550*11
        DFHMDF POS=(15,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL10  DFHMDF POS=(15,02),                                            X00551*11
               LENGTH=01,                                              X00552*11
               ATTRB=(UNPROT,NORM),                                    X00553*11
               HILIGHT=UNDERLINE,                                      X00554*11
               COLOR=GREEN                                              00555*11
        DFHMDF POS=(15,04),                                            X00556*11
               LENGTH=00,                                              X00557*11
               ATTRB=(ASKIP)                                            00558*11
ASEQ10  DFHMDF POS=(15,05),                                            X00559*12
               LENGTH=04,                                              X00560*11
               ATTRB=(ASKIP,NORM),                                     X00561*11
               COLOR=BLUE                                               00562*11
AOP10   DFHMDF POS=(15,10),                                            X00563*12
               LENGTH=04,                                              X00564*11
               ATTRB=(ASKIP,NORM),                                     X00565*11
               COLOR=BLUE                                               00566*11
AST10   DFHMDF POS=(15,15),                                            X00567*12
               LENGTH=02,                                              X00568*11
               ATTRB=(ASKIP,NORM),                                     X00569*11
               COLOR=BLUE                                               00570*11
ASTR10  DFHMDF POS=(15,18),                                            X00571*12
               LENGTH=04,                                              X00572*11
               ATTRB=(ASKIP,NORM),                                     X00573*11
               COLOR=BLUE                                               00574*11
APRO10  DFHMDF POS=(15,23),                                            X00575*12
               LENGTH=10,                                              X00576*11
               ATTRB=(ASKIP,NORM),                                     X00577*11
               COLOR=BLUE                                               00578*11
ABOL10  DFHMDF POS=(15,34),                                            X00579*12
               LENGTH=16,                                              X00580*11
               ATTRB=(ASKIP,NORM),                                     X00581*11
               COLOR=BLUE                                               00582*11
ACNT10  DFHMDF POS=(15,51),                                            X00583*12
               LENGTH=5,                                               X00584*12
               ATTRB=(ASKIP,NORM),                                     X00585*12
               COLOR=BLUE,                                             X00586*12
               PICOUT='ZZZZ9'                                           00587*12
ASSCC10 DFHMDF POS=(15,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT10 DFHMDF POS=(15,63),                                            X00588*12
               LENGTH=06,                                              X00589*11
               ATTRB=(ASKIP,NORM),                                     X00590*11
               COLOR=BLUE,                                             X00591*11
               PICOUT='ZZZZZ9'                                          00592*11
APKSL10 DFHMDF POS=(15,70),                                            X00593*11
               LENGTH=10,                                              X00594*11
               ATTRB=(ASKIP,NORM),                                     X00595*11
               COLOR=BLUE                                               00596*11
*                                                                       00597*11
        DFHMDF POS=(16,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL11  DFHMDF POS=(16,02),                                            X00598*11
               LENGTH=01,                                              X00599*11
               ATTRB=(UNPROT,NORM),                                    X00600*11
               HILIGHT=UNDERLINE,                                      X00601*11
               COLOR=GREEN                                              00602*11
        DFHMDF POS=(16,04),                                            X00603*11
               LENGTH=00,                                              X00604*11
               ATTRB=(ASKIP)                                            00605*11
ASEQ11  DFHMDF POS=(16,05),                                            X00606*12
               LENGTH=04,                                              X00607*11
               ATTRB=(ASKIP,NORM),                                     X00608*11
               COLOR=BLUE                                               00609*11
AOP11   DFHMDF POS=(16,10),                                            X00610*12
               LENGTH=04,                                              X00611*11
               ATTRB=(ASKIP,NORM),                                     X00612*11
               COLOR=BLUE                                               00613*11
AST11   DFHMDF POS=(16,15),                                            X00614*12
               LENGTH=02,                                              X00615*11
               ATTRB=(ASKIP,NORM),                                     X00616*11
               COLOR=BLUE                                               00617*11
ASTR11  DFHMDF POS=(16,18),                                            X00618*12
               LENGTH=04,                                              X00619*11
               ATTRB=(ASKIP,NORM),                                     X00620*11
               COLOR=BLUE                                               00621*11
APRO11  DFHMDF POS=(16,23),                                            X00622*12
               LENGTH=10,                                              X00623*11
               ATTRB=(ASKIP,NORM),                                     X00624*11
               COLOR=BLUE                                               00625*11
ABOL11  DFHMDF POS=(16,34),                                            X00626*12
               LENGTH=16,                                              X00627*11
               ATTRB=(ASKIP,NORM),                                     X00628*11
               COLOR=BLUE                                               00629*11
ACNT11  DFHMDF POS=(16,51),                                            X00630*12
               LENGTH=5,                                               X00631*12
               ATTRB=(ASKIP,NORM),                                     X00632*12
               COLOR=BLUE,                                             X00633*12
               PICOUT='ZZZZ9'                                           00634*12
ASSCC11 DFHMDF POS=(16,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT11 DFHMDF POS=(16,63),                                            X00635*12
               LENGTH=06,                                              X00636*11
               ATTRB=(ASKIP,NORM),                                     X00637*11
               COLOR=BLUE,                                             X00638*11
               PICOUT='ZZZZZ9'                                          00639*11
APKSL11 DFHMDF POS=(16,70),                                            X00640*11
               LENGTH=10,                                              X00641*11
               ATTRB=(ASKIP,NORM),                                     X00642*11
               COLOR=BLUE                                               00643*11
*                                                                       00644*11
        DFHMDF POS=(17,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
ASEL12  DFHMDF POS=(17,02),                                            X00645*11
               LENGTH=01,                                              X00646*11
               ATTRB=(UNPROT,NORM),                                    X00647*11
               HILIGHT=UNDERLINE,                                      X00648*11
               COLOR=GREEN                                              00649*11
        DFHMDF POS=(17,04),                                            X00650*11
               LENGTH=00,                                              X00651*11
               ATTRB=(ASKIP)                                            00652*11
ASEQ12  DFHMDF POS=(17,05),                                            X00653*12
               LENGTH=04,                                              X00654*11
               ATTRB=(ASKIP,NORM),                                     X00655*11
               COLOR=BLUE                                               00656*11
AOP12   DFHMDF POS=(17,10),                                            X00657*12
               LENGTH=04,                                              X00658*11
               ATTRB=(ASKIP,NORM),                                     X00659*11
               COLOR=BLUE                                               00660*11
AST12   DFHMDF POS=(17,15),                                            X00661*12
               LENGTH=02,                                              X00662*11
               ATTRB=(ASKIP,NORM),                                     X00663*11
               COLOR=BLUE                                               00664*11
ASTR12  DFHMDF POS=(17,18),                                            X00665*12
               LENGTH=04,                                              X00666*11
               ATTRB=(ASKIP,NORM),                                     X00667*11
               COLOR=BLUE                                               00668*11
APRO12  DFHMDF POS=(17,23),                                            X00669*12
               LENGTH=10,                                              X00670*11
               ATTRB=(ASKIP,NORM),                                     X00671*11
               COLOR=BLUE                                               00672*11
ABOL12  DFHMDF POS=(17,34),                                            X00673*12
               LENGTH=16,                                              X00674*11
               ATTRB=(ASKIP,NORM),                                     X00675*11
               COLOR=BLUE                                               00676*11
ACNT12  DFHMDF POS=(17,51),                                            X00677*12
               LENGTH=5,                                               X00678*12
               ATTRB=(ASKIP,NORM),                                     X00679*12
               COLOR=BLUE,                                             X00680*12
               PICOUT='ZZZZ9'                                           00681*12
ASSCC12 DFHMDF POS=(17,57),                                            X00160*12
               LENGTH=5,                                               X00161*12
               ATTRB=(ASKIP,NORM),                                     X00162*12
               COLOR=BLUE,                                             X00163*12
               PICOUT='ZZZZ9'                                           00164*12
AUNIT12 DFHMDF POS=(17,63),                                            X00682*12
               LENGTH=06,                                              X00683*11
               ATTRB=(ASKIP,NORM),                                     X00684*11
               COLOR=BLUE,                                             X00685*11
               PICOUT='ZZZZZ9'                                          00686*11
APKSL12 DFHMDF POS=(17,70),                                            X00687*11
               LENGTH=10,                                              X00688*11
               ATTRB=(ASKIP,NORM),                                     X00689*11
               COLOR=BLUE                                               00690*11
*                                                                       00174*11
        DFHMDF POS=(18,01),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
*                                                                       00691*11
        DFHMDF POS=(19,15),LENGTH=15,ATTRB=(ASKIP,NORM),               C00739*12
               COLOR=NEUTRAL,INITIAL='SELECTED ITEMS:'                  00740*12
ASELIT  DFHMDF POS=(19,31),LENGTH=07,ATTRB=(ASKIP,NORM),               C00741*12
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00742*11
        DFHMDF POS=(19,40),LENGTH=15,ATTRB=(ASKIP,NORM),               C00743*14
               COLOR=NEUTRAL,INITIAL='TOT CART/UNITS:'                  00744*12
ATCART  DFHMDF POS=(19,56),LENGTH=06,ATTRB=(ASKIP,NORM),               C00745*14
               COLOR=BLUE,PICOUT='ZZZZZ9'                               00746*14
ATUNIT  DFHMDF POS=(19,63),LENGTH=08,ATTRB=(ASKIP,NORM),               C00745*14
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00746*14
**************                                                          00747*11
        DFHMSD TYPE=FINAL                                               00748*11
**************                                                          00749*11
        END                                                             00750*11
