*       MAPSET  - RCKM813                                               00003   
*       MAP     - RC813A                                                00004   
*       PROGRAM - RCKCS813                                              00005   
*       TRANSID - E813                                                  00006   
*       SYSTEM  - CICS ARCHTECTURE (NEW) - RECEIVER                     00007   
*                                                                       00010   
  PRINT  NOGEN                                                          00009   
*                                                                       00010   
RCKM813  DFHMSD TYPE=&&SYSPARM,                                        X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TERM=3270-2,                                            X00015   
               TIOAPFX=YES                                              00016   
RC813A   DFHMDI SIZE=(19,080),                                         X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT),                                 X00019   
               LINE=02,                                                X00020   
               COLUMN=01,                                              X00021   
               CTRL=(FREEKB)                                            00022   
*                                                                       00024*11
        DFHMDF POS=(02,01),                                            X00025*11
               LENGTH=12,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='OPER/FCLTY.:'                                   00029*11
AOPER   DFHMDF POS=(02,14),                                            X00030*11
               LENGTH=04,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
        DFHMDF POS=(02,19),                                            X00035*11
               LENGTH=01,                                              X00036*11
               ATTRB=(ASKIP,NORM),                                     X00037*11
               COLOR=NEUTRAL,                                          X00038*11
               INITIAL='-'                                              00039*11
AFCLTY  DFHMDF POS=(02,21),                                            X00040*11
               LENGTH=04,                                              X00041*11
               ATTRB=(ASKIP,NORM),                                     X00042*11
               COLOR=BLUE                                               00043*11
        DFHMDF POS=(02,41),                                            X00025*11
               LENGTH=08,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='PO/RCVR:'                                       00029*11
APO     DFHMDF POS=(02,51),                                            X00030*11
               LENGTH=08,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
        DFHMDF POS=(02,60),                                            X00025*11
               LENGTH=01,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='-'                                              00029*11
ARCVR   DFHMDF POS=(02,62),                                            X00030*11
               LENGTH=04,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
APKCD   DFHMDF POS=(02,67),                                            X00030*11
               LENGTH=06,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
*                                                                               
****************************************************************        00075*11
*                                                                               
        DFHMDF POS=(03,01),                                            X00025*11
               LENGTH=12,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='STORE......:'                                   00029*11
ASTR    DFHMDF POS=(03,14),                                            X00144*12
               LENGTH=05,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASTRN   DFHMDF POS=(03,20),                                            X00144*12
               LENGTH=20,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
        DFHMDF POS=(03,41),                                            X00025*11
               LENGTH=08,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='DEPT...:'                                       00029*11
ADEPT   DFHMDF POS=(03,51),                                            X00030*11
               LENGTH=03,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
*                                                                       00091*11
****************************************************************        00075*11
*                                                                               
        DFHMDF POS=(04,11),                                            X00097*12
               LENGTH=06,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='UPDATE'                                         00101*11
        DFHMDF POS=(04,45),                                            X00044*11
               LENGTH=05,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='ITEMS'                                          00048*11
ASTRTIT DFHMDF POS=(04,51),                                            X00049*11
               LENGTH=05,                                              X00050*11
               ATTRB=(NUM,UNPROT,NORM),                                X00051*11
               COLOR=GREEN,                                            X00052*11
               HILIGHT=UNDERLINE,                                      X00053*11
               PICOUT='ZZZZ9'                                           00054*11
        DFHMDF POS=(04,57),                                            X00055*11
               LENGTH=02,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               COLOR=NEUTRAL,                                          X00058*11
               INITIAL='TO'                                             00059*11
AENDIT  DFHMDF POS=(04,60),                                            X00060*11
               LENGTH=05,                                              X00061*11
               ATTRB=(ASKIP,NORM),                                     X00062*11
               COLOR=BLUE,                                             X00063*11
               PICOUT='ZZZZ9'                                           00064*11
        DFHMDF POS=(04,66),                                            X00065*11
               LENGTH=02,                                              X00066*11
               ATTRB=(ASKIP,NORM),                                     X00067*11
               COLOR=NEUTRAL,                                          X00068*11
               INITIAL='OF'                                             00069*11
ATOTIT  DFHMDF POS=(04,69),                                            X00070*11
               LENGTH=05,                                              X00071*11
               ATTRB=(ASKIP,NORM),                                     X00072*11
               COLOR=BLUE,                                             X00073*11
               PICOUT='ZZZZ9'                                           00074*11
*                                                                       00091*11
****************************************************************        00075*11
*                                                                       00127*11
APKHD1  DFHMDF POS=(05,11),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL                                            00100*11
        DFHMDF POS=(05,19),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='LINE'                                           00101*11
        DFHMDF POS=(05,43),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='PACK'                                           00101*11
        DFHMDF POS=(05,50),                                            X00097*12
               LENGTH=05,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='EXPCT'                                          00101*11
        DFHMDF POS=(05,59),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='FCSE'                                           00101*11
        DFHMDF POS=(05,67),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='ODD'                                            00101*11
        DFHMDF POS=(05,74),                                            X00097*12
               LENGTH=05,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='TOTAL'                                          00101*11
*                                                                       00091*11
****************************************************************        00075*11
*                                                                       00127*11
        DFHMDF POS=(06,01),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='SEL'                                            00101*11
        DFHMDF POS=(06,06),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='ACT'                                            00101*11
APKHD2  DFHMDF POS=(06,11),                                            X00097*12
               LENGTH=05,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL                                            00100*11
        DFHMDF POS=(06,19),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL=' NO '                                           00101*11
        DFHMDF POS=(06,26),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='CLS'                                            00101*11
        DFHMDF POS=(06,34),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='SKU'                                            00101*11
        DFHMDF POS=(06,43),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL=' ID '                                           00101*11
        DFHMDF POS=(06,51),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='QTY '                                           00101*11
        DFHMDF POS=(06,59),                                            X00097*12
               LENGTH=04,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='QTY '                                           00101*11
        DFHMDF POS=(06,67),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='QTY'                                            00101*11
        DFHMDF POS=(06,75),                                            X00097*12
               LENGTH=03,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='QTY'                                            00101*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL01  DFHMDF POS=(07,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(07,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT01  DFHMDF POS=(07,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD01  DFHMDF POS=(07,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(07,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE01  DFHMDF POS=(07,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS01  DFHMDF POS=(07,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU01  DFHMDF POS=(07,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK01   DFHMDF POS=(07,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP01  DFHMDF POS=(07,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS01  DFHMDF POS=(07,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD01  DFHMDF POS=(07,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT01  DFHMDF POS=(07,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL02  DFHMDF POS=(08,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(08,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT02  DFHMDF POS=(08,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD02  DFHMDF POS=(08,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(08,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE02  DFHMDF POS=(08,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS02  DFHMDF POS=(08,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU02  DFHMDF POS=(08,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK02   DFHMDF POS=(08,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP02  DFHMDF POS=(08,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS02  DFHMDF POS=(08,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD02  DFHMDF POS=(08,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT02  DFHMDF POS=(08,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL03  DFHMDF POS=(09,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(09,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT03  DFHMDF POS=(09,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD03  DFHMDF POS=(09,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(09,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE03  DFHMDF POS=(09,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS03  DFHMDF POS=(09,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU03  DFHMDF POS=(09,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK03   DFHMDF POS=(09,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP03  DFHMDF POS=(09,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS03  DFHMDF POS=(09,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD03  DFHMDF POS=(09,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT03  DFHMDF POS=(09,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL04  DFHMDF POS=(10,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(10,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT04  DFHMDF POS=(10,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD04  DFHMDF POS=(10,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(10,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE04  DFHMDF POS=(10,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS04  DFHMDF POS=(10,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU04  DFHMDF POS=(10,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK04   DFHMDF POS=(10,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP04  DFHMDF POS=(10,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS04  DFHMDF POS=(10,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD04  DFHMDF POS=(10,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT04  DFHMDF POS=(10,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL05  DFHMDF POS=(11,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(11,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT05  DFHMDF POS=(11,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD05  DFHMDF POS=(11,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(11,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE05  DFHMDF POS=(11,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS05  DFHMDF POS=(11,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU05  DFHMDF POS=(11,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK05   DFHMDF POS=(11,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP05  DFHMDF POS=(11,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS05  DFHMDF POS=(11,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD05  DFHMDF POS=(11,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT05  DFHMDF POS=(11,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL06  DFHMDF POS=(12,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(12,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT06  DFHMDF POS=(12,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD06  DFHMDF POS=(12,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(12,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE06  DFHMDF POS=(12,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS06  DFHMDF POS=(12,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU06  DFHMDF POS=(12,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK06   DFHMDF POS=(12,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP06  DFHMDF POS=(12,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS06  DFHMDF POS=(12,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD06  DFHMDF POS=(12,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT06  DFHMDF POS=(12,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL07  DFHMDF POS=(13,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(13,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT07  DFHMDF POS=(13,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD07  DFHMDF POS=(13,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(13,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE07  DFHMDF POS=(13,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS07  DFHMDF POS=(13,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU07  DFHMDF POS=(13,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK07   DFHMDF POS=(13,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP07  DFHMDF POS=(13,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS07  DFHMDF POS=(13,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD07  DFHMDF POS=(13,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT07  DFHMDF POS=(13,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL08  DFHMDF POS=(14,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(14,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT08  DFHMDF POS=(14,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD08  DFHMDF POS=(14,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(14,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE08  DFHMDF POS=(14,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS08  DFHMDF POS=(14,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU08  DFHMDF POS=(14,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK08   DFHMDF POS=(14,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP08  DFHMDF POS=(14,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS08  DFHMDF POS=(14,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD08  DFHMDF POS=(14,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT08  DFHMDF POS=(14,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL09  DFHMDF POS=(15,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(15,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT09  DFHMDF POS=(15,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD09  DFHMDF POS=(15,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(15,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE09  DFHMDF POS=(15,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS09  DFHMDF POS=(15,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU09  DFHMDF POS=(15,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK09   DFHMDF POS=(15,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP09  DFHMDF POS=(15,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS09  DFHMDF POS=(15,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD09  DFHMDF POS=(15,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT09  DFHMDF POS=(15,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL10  DFHMDF POS=(16,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(16,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT10  DFHMDF POS=(16,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD10  DFHMDF POS=(16,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(16,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE10  DFHMDF POS=(16,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS10  DFHMDF POS=(16,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU10  DFHMDF POS=(16,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK10   DFHMDF POS=(16,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP10  DFHMDF POS=(16,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS10  DFHMDF POS=(16,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD10  DFHMDF POS=(16,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT10  DFHMDF POS=(16,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL11  DFHMDF POS=(17,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(17,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT11  DFHMDF POS=(17,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD11  DFHMDF POS=(17,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(17,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE11  DFHMDF POS=(17,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS11  DFHMDF POS=(17,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU11  DFHMDF POS=(17,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK11   DFHMDF POS=(17,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP11  DFHMDF POS=(17,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS11  DFHMDF POS=(17,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD11  DFHMDF POS=(17,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT11  DFHMDF POS=(17,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                               
****************************************************************        00075*11
*                                                                               
ASEL12  DFHMDF POS=(18,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(18,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT12  DFHMDF POS=(18,06),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUPD12  DFHMDF POS=(18,11),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(UNPROT,NORM,NUM),                                X00138*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00139*11
        DFHMDF POS=(18,17),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,DRK)                                        00138*11
ALNE12  DFHMDF POS=(18,19),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACLS12  DFHMDF POS=(18,27),                                            X00136*12
               LENGTH=02,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKU12  DFHMDF POS=(18,32),                                            X00136*12
               LENGTH=08,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
APK12   DFHMDF POS=(18,43),                                            X00136*12
               LENGTH=04,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AEXP12  DFHMDF POS=(18,50),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AFCS12  DFHMDF POS=(18,58),                                            X00136*12
               LENGTH=05,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
AODD12  DFHMDF POS=(18,66),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
ATOT12  DFHMDF POS=(18,74),                                            X00055*11
               LENGTH=05,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               PICOUT='ZZZZ9',                                         X00146*11
               COLOR=BLUE                                               00139*11
*                                                                       00174*11
****************************************************************        00075*11
*                                                                       00738*11
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               C00739*12
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00740*12
ASELIT  DFHMDF POS=(19,71),LENGTH=07,ATTRB=(ASKIP,NORM),               C00741*12
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00742*11
**************                                                          00747*11
        DFHMSD TYPE=FINAL                                               00748*11
**************                                                          00749*11
        END                                                             00750*11
