*          DATA SET RCKM257    AT LEVEL 018 AS OF 04/21/94              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM257                                            *   00006   
*        MAP     RC257A                                             *   00007   
*        PROGRAM RCKCS257                                           *   00008   
*        TRANSID E257 - RECEIPT ITEM ADD                            *   00009   
*        SYSTEM  RC RECEIVING                                       *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM257 DFHMSD TYPE=MAP,                                               X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               TIOAPFX=YES,                                            X00016   
               CTRL=(FREEKB)                                            00017   
RC257A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00023   
               INITIAL='OPERATING ID:',                                X00024   
               LENGTH=13,                                              X00025   
               COLOR=NEUTRAL,                                          X00026   
               POS=(03,01)                                              00027   
*                                                                       00028   
AOPER   DFHMDF ATTRB=(ASKIP,NORM),                                     X00029   
               LENGTH=4,                                               X00030   
               COLOR=BLUE,                                             X00031   
               POS=(03,15)                                              00032   
*                                                                       00033   
AFCLTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00034   
               LENGTH=4,                                               X00035   
               COLOR=BLUE,                                             X00036   
               POS=(03,20)                                              00037   
*                                                                       00038   
AFDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               LENGTH=30,                                              X00040   
               COLOR=BLUE,                                             X00041   
               POS=(03,27)                                              00042   
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='RECEIVER NO.:',                                X00045   
               LENGTH=13,                                              X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(04,01)                                              00048   
*                                                                       00049   
ARCVR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00050   
               LENGTH=13,                                              X00051   
               COLOR=BLUE,                                             X00052   
               POS=(04,15)                                              00053   
*                                                                       00054   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00055   
               INITIAL='PO LINE NO..:',                                X00056   
               LENGTH=13,                                              X00057   
               COLOR=NEUTRAL,                                          X00058   
               POS=(05,01)                                              00059   
*                                                                       00060   
ALINE   DFHMDF ATTRB=(ASKIP,NORM),                                     X00061   
               LENGTH=04,                                              X00062   
               COLOR=BLUE,                                             X00063   
               POS=(05,15)                                              00064   
*                                                                       00065   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00066   
               INITIAL='STATUS......:',                                X00067   
               LENGTH=13,                                              X00068   
               COLOR=NEUTRAL,                                          X00069   
               POS=(06,01)                                              00070   
*                                                                       00071   
ASTDESC DFHMDF ATTRB=(ASKIP,NORM),                                     X00072   
               LENGTH=10,                                              X00073   
               COLOR=BLUE,                                             X00074   
               POS=(06,15)                                              00075   
*                                                                       00076   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00077   
               INITIAL='TROUBLE REASON:',                              X00078   
               LENGTH=15,                                              X00079   
               COLOR=NEUTRAL,                                          X00080   
               POS=(06,35)                                              00081   
*                                                                       00082   
ATRBL   DFHMDF ATTRB=(ASKIP,NORM),                                     X00083   
               LENGTH=25,                                              X00084   
               COLOR=YELLOW,                                           X00085   
               POS=(06,51)                                              00086   
*                                                                       00087   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00088   
               INITIAL='INNER PACK..:',                                X00089   
               LENGTH=13,                                              X00090   
               COLOR=NEUTRAL,                                          X00091   
               POS=(10,01)                                              00092   
*                                                                       00093   
AINNR   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00094   
               LENGTH=03,                                              X00095   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               PICOUT='ZZZ',                                           X00098   
               POS=(10,15)                                              00099   
*                                                                       00100   
        DFHMDF ATTRB=(ASKIP),                                          X00101   
               LENGTH=1,                                               X00102   
               COLOR=NEUTRAL,                                          X00103   
               POS=(10,19)                                              00104   
*                                                                       00105   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00106   
               INITIAL='PACK SLIP ITEM QTY:',                          X00107   
               LENGTH=19,                                              X00108   
               COLOR=NEUTRAL,                                          X00109   
               POS=(10,23)                                              00110   
*                                                                       00111   
APSQTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00112   
               LENGTH=05,                                              X00113   
               COLOR=BLUE,                                             X00114   
               PICOUT='ZZZZ9',                                         X00115   
               POS=(10,43)                                              00116   
*                                                                       00117   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00118   
               INITIAL='GROUP RTL..:',                                 X00119   
               LENGTH=12,                                              X00120   
               COLOR=NEUTRAL,                                          X00121   
               POS=(10,49)                                              00122   
*                                                                       00123   
AGRPRTL DFHMDF ATTRB=(ASKIP,NORM),                                     X00124   
               LENGTH=08,                                              X00125   
               COLOR=BLUE,                                             X00126   
               PICOUT='ZZZZZ.99',                                      X00127   
               POS=(10,62)                                              00128   
*                                                                       00129   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00130   
               INITIAL='CASE PACK...:',                                X00131   
               LENGTH=13,                                              X00132   
               COLOR=NEUTRAL,                                          X00133   
               POS=(11,01)                                              00134   
*                                                                       00135   
ACASE   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00136   
               LENGTH=03,                                              X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X00139   
               PICOUT='ZZZ',                                           X00140   
               POS=(11,15)                                              00141   
*                                                                       00142   
        DFHMDF ATTRB=(ASKIP),                                          X00143   
               LENGTH=1,                                               X00144   
               COLOR=NEUTRAL,                                          X00145   
               POS=(11,19)                                              00146   
*                                                                       00147   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00148   
               INITIAL='DTL CHECK ITEM QTY:',                          X00149   
               LENGTH=19,                                              X00150   
               COLOR=NEUTRAL,                                          X00151   
               POS=(11,23)                                              00152   
*                                                                       00153   
ADCQTY  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00154   
               LENGTH=05,                                              X00155   
               COLOR=GREEN,                                            X00156   
               HILIGHT=UNDERLINE,                                      X00157   
               PICOUT='ZZZZZ',                                         X00158   
               POS=(11,43)                                              00159   
*                                                                       00160   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00161   
               INITIAL='GROUP QTY..:',                                 X00162   
               LENGTH=12,                                              X00163   
               COLOR=NEUTRAL,                                          X00164   
               POS=(11,49)                                              00165   
*                                                                       00166   
AGRPQTY DFHMDF ATTRB=(ASKIP,NORM),                                     X00167   
               LENGTH=03,                                              X00168   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZ9',                                           X00170   
               POS=(11,62)                                              00171   
*                                                                       00172   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00173   
               INITIAL='PRE-TICKETED:',                                X00174   
               LENGTH=13,                                              X00175   
               COLOR=NEUTRAL,                                          X00176   
               POS=(12,01)                                              00177   
*                                                                       00178   
APRETKT DFHMDF ATTRB=(ASKIP,NORM),                                     X00179   
               LENGTH=01,                                              X00180   
               COLOR=BLUE,                                             X00181   
               POS=(12,15)                                              00183   
*                                                                       00184   
        DFHMDF ATTRB=(ASKIP),                                          X00185   
               LENGTH=1,                                               X00186   
               COLOR=NEUTRAL,                                          X00187   
               POS=(12,17)                                              00188   
*                                                                       00189   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00190   
               INITIAL='EXPECTED CTN CNT..:',                          X00191   
               LENGTH=19,                                              X00192   
               COLOR=NEUTRAL,                                          X00193   
               POS=(12,23)                                              00194   
*                                                                       00195   
AEXPCTN DFHMDF ATTRB=(ASKIP,NORM),                                     X00196   
               LENGTH=04,                                              X00197   
               COLOR=BLUE,                                             X00198   
               PICOUT='ZZZ9',                                          X00199   
               POS=(12,44)                                              00200   
*                                                                       00201   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00202   
               INITIAL='UNIT RTL...:',                                 X00203   
               LENGTH=12,                                              X00204   
               COLOR=NEUTRAL,                                          X00205   
               POS=(12,49)                                              00206   
*                                                                       00207   
ARTL    DFHMDF ATTRB=(ASKIP,NORM),                                     X00208   
               LENGTH=08,                                              X00209   
               COLOR=BLUE,                                             X00210   
               PICOUT='ZZZZZ.99',                                      X00211   
               POS=(12,62)                                              00212   
*                                                                       00213   
*                                                                       00231   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00232   
               INITIAL='ACTUAL CTN CNT....:',                          X00233   
               LENGTH=19,                                              X00234   
               COLOR=NEUTRAL,                                          X00235   
               POS=(13,23)                                              00236   
*                                                                       00237   
AACTCTN DFHMDF ATTRB=(ASKIP,NORM),                                     X00238   
               LENGTH=04,                                              X00239   
               COLOR=BLUE,                                             X00240   
               PICOUT='ZZZ9',                                          X00241   
               POS=(13,44)                                              00242   
*                                                                       00243   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00244   
               INITIAL='TCKT TYPE..:',                                 X00245   
               LENGTH=12,                                              X00246   
               COLOR=NEUTRAL,                                          X00247   
               POS=(13,49)                                              00248   
*                                                                       00249   
ATKT    DFHMDF ATTRB=(ASKIP,NORM),                                     X00250   
               LENGTH=16,                                              X00251   
               COLOR=BLUE,                                             X00252   
               POS=(13,62)                                              00253   
*                                                                       00254   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00272   
               INITIAL='SKU...............:',                          X00273   
               LENGTH=19,                                              X00274   
               COLOR=NEUTRAL,                                          X00275   
               POS=(15,23)                                              00276   
*                                                                       00277   
ASKU    DFHMDF ATTRB=(ASKIP,NORM),                                     X00278   
               LENGTH=15,                                              X00279   
               COLOR=BLUE,                                             X00280   
               POS=(15,43)                                              00281   
*                                                                       00282   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00301   
               INITIAL='STYLE.............:',                          X00302   
               LENGTH=19,                                              X00303   
               COLOR=NEUTRAL,                                          X00304   
               POS=(16,23)                                              00305   
*                                                                       00306   
ASTYLE  DFHMDF ATTRB=(ASKIP,NORM),                                     X00307   
               LENGTH=20,                                              X00308   
               COLOR=BLUE,                                             X00309   
               POS=(16,43)                                              00310   
*                                                                       00311   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00325   
               INITIAL='COLOR.............:',                          X00326   
               LENGTH=19,                                              X00327   
               COLOR=NEUTRAL,                                          X00328   
               POS=(17,23)                                              00329   
*                                                                       00330   
ACOLOR  DFHMDF ATTRB=(ASKIP,NORM),                                     X00331   
               LENGTH=25,                                              X00332   
               COLOR=BLUE,                                             X00333   
               POS=(17,43)                                              00334   
*                                                                       00335   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00353   
               INITIAL='SIZE..............:',                          X00354   
               LENGTH=19,                                              X00355   
               COLOR=NEUTRAL,                                          X00356   
               POS=(18,23)                                              00357   
*                                                                       00358   
ASIZE   DFHMDF ATTRB=(ASKIP,NORM),                                     X00359   
               LENGTH=25,                                              X00360   
               COLOR=BLUE,                                             X00361   
               POS=(18,43)                                              00362   
*                                                                       00363   
         DFHMSD TYPE=FINAL                                              00364   
         END                                                            00365   
