*          DATA SET RCKM264    AT LEVEL 005 AS OF 05/10/95                      
*          DATA SET RCKM264A1  AT LEVEL 004 AS OF 03/31/95              00001   
*          DATA SET RCKM264    AT LEVEL 003 AS OF 02/26/93              00002   
        PRINT  NOGEN                                                    00003   
RCKM264 DFHMSD TYPE=DSECT,                                             C00004   
               LANG=COBOL,                                             C00005   
               MODE=INOUT,                                             C00006   
               STORAGE=AUTO,                                           C00007   
               TERM=3270-2,                                            C00008   
               TIOAPFX=YES                                              00009   
**************                                                          00010   
RC264A  DFHMDI LINE=2,COLUMN=1,                                        C00011   
               SIZE=(19,80),                                           C00012   
               CTRL=(FREEKB),                                          C00013   
               MAPATTS=(COLOR,HILIGHT),                                C00014   
               DSATTS=(COLOR,HILIGHT)                                   00015   
**************                                                          00016   
        DFHMDF POS=(02,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=NEUTRAL,INITIAL='PO NUMBER:'                       00018   
APO     DFHMDF POS=(02,15),LENGTH=08,ATTRB=(ASKIP,NORM),               C00019   
               COLOR=BLUE,                                             C00020**5
               PICOUT='ZZZZZZZ9'                                        00021   
APODSC  DFHMDF POS=(02,25),LENGTH=10,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=BLUE                                               00023**5
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00025   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00026   
               COLOR=GREEN,                                            C00027   
               HILIGHT=UNDERLINE,                                      C00028   
               PICOUT='ZZZZ9'                                           00029   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00030   
               COLOR=NEUTRAL,                                          C00031   
               INITIAL='TO'                                             00032   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00033   
               COLOR=BLUE,                                             C00034   
               PICOUT='ZZZZ9'                                           00035   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00036   
               COLOR=NEUTRAL,                                          C00037   
               INITIAL='OF'                                             00038   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00039   
               COLOR=BLUE,                                             C00040   
               PICOUT='ZZZZ9'                                           00041   
**************                                                          00042   
        DFHMDF POS=(03,05),LENGTH=11,ATTRB=(ASKIP,NORM),               C00043   
               COLOR=NEUTRAL,INITIAL='OWNER SCAC:'                      00044   
AOWSCAC DFHMDF POS=(03,18),LENGTH=04,ATTRB=(ASKIP,NORM),               C00045   
               COLOR=BLUE                                               00046   
        DFHMDF POS=(03,26),LENGTH=16,ATTRB=(ASKIP,NORM),               C00047   
               COLOR=NEUTRAL,INITIAL='LAST UPDATED BY:'                 00048   
AUPDUID DFHMDF POS=(03,44),LENGTH=08,ATTRB=(ASKIP,NORM),               C00049   
               COLOR=BLUE                                               00050   
AUPDNME DFHMDF POS=(03,54),LENGTH=20,ATTRB=(ASKIP,NORM),               C00051   
               COLOR=BLUE                                               00052   
*                                                                       00053   
        DFHMDF POS=(04,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00054   
               COLOR=NEUTRAL,INITIAL='BOL:'                             00055   
ABOL    DFHMDF POS=(04,11),LENGTH=22,ATTRB=(ASKIP,NORM),               C00056   
               COLOR=BLUE                                               00057   
        DFHMDF POS=(04,35),LENGTH=04,ATTRB=(ASKIP,NORM),               C00058   
               COLOR=NEUTRAL,INITIAL='F/B:'                             00059   
AFB     DFHMDF POS=(04,41),LENGTH=30,ATTRB=(ASKIP,NORM),               C00060   
               COLOR=BLUE                                               00061   
*                                                                       00062   
        DFHMDF POS=(05,07),LENGTH=17,ATTRB=(ASKIP,NORM),               C00063   
               COLOR=NEUTRAL,INITIAL='---- EDI ASN ----'                00064   
        DFHMDF POS=(05,25),LENGTH=18,ATTRB=(ASKIP,NORM),               C00065**3
               COLOR=NEUTRAL,INITIAL='-- EDI FORECAST --'               00066   
        DFHMDF POS=(05,44),LENGTH=29,ATTRB=(ASKIP,NORM),               C00067   
               COLOR=NEUTRAL,INITIAL='----- ASSOC CONFIRMED -------'    00068   
*                                                                       00069   
        DFHMDF POS=(06,04),LENGTH=19,ATTRB=(ASKIP,NORM),               C00070**4
               COLOR=NEUTRAL,INITIAL='PS  CTN  DATE  TIME'              00071   
        DFHMDF POS=(06,26),LENGTH=15,ATTRB=(ASKIP,NORM),               C00072**4
               COLOR=NEUTRAL,INITIAL='CTN  DATE  TIME'                  00073   
        DFHMDF POS=(06,44),LENGTH=27,ATTRB=(ASKIP,NORM),               C00074**4
               COLOR=NEUTRAL,INITIAL='EXP   ADJ   DMG  DATE  TIME'      00075   
        DFHMDF POS=(06,72),LENGTH=07,ATTRB=(ASKIP,NORM),               C00076**4
               COLOR=NEUTRAL,INITIAL='USER ID'                          00077   
*                                                                       00078   
APS1    DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080   
AASNCT1 DFHMDF POS=(07,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00081**3
               COLOR=BLUE                                               00082   
AASNDT1 DFHMDF POS=(07,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00083**3
               COLOR=BLUE                                               00084   
AASNTM1 DFHMDF POS=(07,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00085**3
               COLOR=BLUE                                               00086   
AEDICT1 DFHMDF POS=(07,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00087**3
               COLOR=BLUE                                               00088   
AEDIDT1 DFHMDF POS=(07,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00089**3
               COLOR=BLUE                                               00090   
AEDITM1 DFHMDF POS=(07,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00091**3
               COLOR=BLUE                                               00092   
ACONEX1 DFHMDF POS=(07,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00093**3
               COLOR=BLUE                                               00094   
ACONAD1 DFHMDF POS=(07,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00095**3
               COLOR=BLUE                                               00096   
ACONDM1 DFHMDF POS=(07,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00097**3
               COLOR=BLUE                                               00098   
ACONDT1 DFHMDF POS=(07,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00099**3
               COLOR=BLUE                                               00100   
ACONTM1 DFHMDF POS=(07,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00101**3
               COLOR=BLUE                                               00102   
AUSRID1 DFHMDF POS=(07,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00103**3
               COLOR=BLUE                                               00104   
*                                                                       00105   
APS2    DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00106**3
               COLOR=BLUE                                               00107   
AASNCT2 DFHMDF POS=(08,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00108**3
               COLOR=BLUE                                               00109   
AASNDT2 DFHMDF POS=(08,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00110**3
               COLOR=BLUE                                               00111   
AASNTM2 DFHMDF POS=(08,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00112**3
               COLOR=BLUE                                               00113   
AEDICT2 DFHMDF POS=(08,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00114**3
               COLOR=BLUE                                               00115   
AEDIDT2 DFHMDF POS=(08,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00116**3
               COLOR=BLUE                                               00117   
AEDITM2 DFHMDF POS=(08,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00118**3
               COLOR=BLUE                                               00119   
ACONEX2 DFHMDF POS=(08,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00120**3
               COLOR=BLUE                                               00121   
ACONAD2 DFHMDF POS=(08,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00122**3
               COLOR=BLUE                                               00123   
ACONDM2 DFHMDF POS=(08,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00124**3
               COLOR=BLUE                                               00125   
ACONDT2 DFHMDF POS=(08,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00126**3
               COLOR=BLUE                                               00127   
ACONTM2 DFHMDF POS=(08,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00128**3
               COLOR=BLUE                                               00129   
AUSRID2 DFHMDF POS=(08,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00130**3
               COLOR=BLUE                                               00131   
*                                                                       00132   
APS3    DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00133**3
               COLOR=BLUE                                               00134   
AASNCT3 DFHMDF POS=(09,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00135**3
               COLOR=BLUE                                               00136   
AASNDT3 DFHMDF POS=(09,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00137**3
               COLOR=BLUE                                               00138   
AASNTM3 DFHMDF POS=(09,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00139**3
               COLOR=BLUE                                               00140   
AEDICT3 DFHMDF POS=(09,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00141**3
               COLOR=BLUE                                               00142   
AEDIDT3 DFHMDF POS=(09,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00143**3
               COLOR=BLUE                                               00144   
AEDITM3 DFHMDF POS=(09,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00145**3
               COLOR=BLUE                                               00146   
ACONEX3 DFHMDF POS=(09,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00147**3
               COLOR=BLUE                                               00148   
ACONAD3 DFHMDF POS=(09,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00149**3
               COLOR=BLUE                                               00150   
ACONDM3 DFHMDF POS=(09,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00151**3
               COLOR=BLUE                                               00152   
ACONDT3 DFHMDF POS=(09,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00153**3
               COLOR=BLUE                                               00154   
ACONTM3 DFHMDF POS=(09,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00155**3
               COLOR=BLUE                                               00156   
AUSRID3 DFHMDF POS=(09,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00157**3
               COLOR=BLUE                                               00158   
*                                                                       00159   
APS4    DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00160**3
               COLOR=BLUE                                               00161   
AASNCT4 DFHMDF POS=(10,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00162**3
               COLOR=BLUE                                               00163   
AASNDT4 DFHMDF POS=(10,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00164**3
               COLOR=BLUE                                               00165   
AASNTM4 DFHMDF POS=(10,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00166**3
               COLOR=BLUE                                               00167   
AEDICT4 DFHMDF POS=(10,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00168**3
               COLOR=BLUE                                               00169   
AEDIDT4 DFHMDF POS=(10,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00170**3
               COLOR=BLUE                                               00171   
AEDITM4 DFHMDF POS=(10,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00172**3
               COLOR=BLUE                                               00173   
ACONEX4 DFHMDF POS=(10,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00174**3
               COLOR=BLUE                                               00175   
ACONAD4 DFHMDF POS=(10,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00176**3
               COLOR=BLUE                                               00177   
ACONDM4 DFHMDF POS=(10,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00178**3
               COLOR=BLUE                                               00179   
ACONDT4 DFHMDF POS=(10,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00180**3
               COLOR=BLUE                                               00181   
ACONTM4 DFHMDF POS=(10,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00182**3
               COLOR=BLUE                                               00183   
AUSRID4 DFHMDF POS=(10,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00184**3
               COLOR=BLUE                                               00185   
*                                                                       00186   
APS5    DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00187**3
               COLOR=BLUE                                               00188   
AASNCT5 DFHMDF POS=(11,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00189**3
               COLOR=BLUE                                               00190   
AASNDT5 DFHMDF POS=(11,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00191**3
               COLOR=BLUE                                               00192   
AASNTM5 DFHMDF POS=(11,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00193**3
               COLOR=BLUE                                               00194   
AEDICT5 DFHMDF POS=(11,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00195**3
               COLOR=BLUE                                               00196   
AEDIDT5 DFHMDF POS=(11,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00197**3
               COLOR=BLUE                                               00198   
AEDITM5 DFHMDF POS=(11,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00199**3
               COLOR=BLUE                                               00200   
ACONEX5 DFHMDF POS=(11,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00201**3
               COLOR=BLUE                                               00202   
ACONAD5 DFHMDF POS=(11,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00203**3
               COLOR=BLUE                                               00204   
ACONDM5 DFHMDF POS=(11,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00205**3
               COLOR=BLUE                                               00206   
ACONDT5 DFHMDF POS=(11,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00207**3
               COLOR=BLUE                                               00208   
ACONTM5 DFHMDF POS=(11,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00209**3
               COLOR=BLUE                                               00210   
AUSRID5 DFHMDF POS=(11,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00211**3
               COLOR=BLUE                                               00212   
*                                                                       00213   
APS6    DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00214**3
               COLOR=BLUE                                               00215   
AASNCT6 DFHMDF POS=(12,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00216**3
               COLOR=BLUE                                               00217   
AASNDT6 DFHMDF POS=(12,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00218**3
               COLOR=BLUE                                               00219   
AASNTM6 DFHMDF POS=(12,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00220**3
               COLOR=BLUE                                               00221   
AEDICT6 DFHMDF POS=(12,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00222**3
               COLOR=BLUE                                               00223   
AEDIDT6 DFHMDF POS=(12,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00224**3
               COLOR=BLUE                                               00225   
AEDITM6 DFHMDF POS=(12,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00226**3
               COLOR=BLUE                                               00227   
ACONEX6 DFHMDF POS=(12,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00228**3
               COLOR=BLUE                                               00229   
ACONAD6 DFHMDF POS=(12,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00230**3
               COLOR=BLUE                                               00231   
ACONDM6 DFHMDF POS=(12,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00232**3
               COLOR=BLUE                                               00233   
ACONDT6 DFHMDF POS=(12,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00234**3
               COLOR=BLUE                                               00235   
ACONTM6 DFHMDF POS=(12,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00236**3
               COLOR=BLUE                                               00237   
AUSRID6 DFHMDF POS=(12,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00238**3
               COLOR=BLUE                                               00239   
*                                                                       00240   
APS7    DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00241**3
               COLOR=BLUE                                               00242   
AASNCT7 DFHMDF POS=(13,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00243**3
               COLOR=BLUE                                               00244   
AASNDT7 DFHMDF POS=(13,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00245**3
               COLOR=BLUE                                               00246   
AASNTM7 DFHMDF POS=(13,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00247**3
               COLOR=BLUE                                               00248   
AEDICT7 DFHMDF POS=(13,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00249**3
               COLOR=BLUE                                               00250   
AEDIDT7 DFHMDF POS=(13,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00251**3
               COLOR=BLUE                                               00252   
AEDITM7 DFHMDF POS=(13,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00253**3
               COLOR=BLUE                                               00254   
ACONEX7 DFHMDF POS=(13,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00255**3
               COLOR=BLUE                                               00256   
ACONAD7 DFHMDF POS=(13,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00257**3
               COLOR=BLUE                                               00258   
ACONDM7 DFHMDF POS=(13,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00259**3
               COLOR=BLUE                                               00260   
ACONDT7 DFHMDF POS=(13,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00261**3
               COLOR=BLUE                                               00262   
ACONTM7 DFHMDF POS=(13,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00263**3
               COLOR=BLUE                                               00264   
AUSRID7 DFHMDF POS=(13,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00265**3
               COLOR=BLUE                                               00266   
*                                                                       00267   
APS8    DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00268**3
               COLOR=BLUE                                               00269   
AASNCT8 DFHMDF POS=(14,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00270**3
               COLOR=BLUE                                               00271   
AASNDT8 DFHMDF POS=(14,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00272**3
               COLOR=BLUE                                               00273   
AASNTM8 DFHMDF POS=(14,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00274**3
               COLOR=BLUE                                               00275   
AEDICT8 DFHMDF POS=(14,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00276**3
               COLOR=BLUE                                               00277   
AEDIDT8 DFHMDF POS=(14,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00278**3
               COLOR=BLUE                                               00279   
AEDITM8 DFHMDF POS=(14,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00280**3
               COLOR=BLUE                                               00281   
ACONEX8 DFHMDF POS=(14,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00282**3
               COLOR=BLUE                                               00283   
ACONAD8 DFHMDF POS=(14,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00284**3
               COLOR=BLUE                                               00285   
ACONDM8 DFHMDF POS=(14,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00286**3
               COLOR=BLUE                                               00287   
ACONDT8 DFHMDF POS=(14,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00288**3
               COLOR=BLUE                                               00289   
ACONTM8 DFHMDF POS=(14,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00290**3
               COLOR=BLUE                                               00291   
AUSRID8 DFHMDF POS=(14,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00292**3
               COLOR=BLUE                                               00293   
*                                                                       00294   
APS9    DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00295**3
               COLOR=BLUE                                               00296   
AASNCT9 DFHMDF POS=(15,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00297**3
               COLOR=BLUE                                               00298   
AASNDT9 DFHMDF POS=(15,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00299**3
               COLOR=BLUE                                               00300   
AASNTM9 DFHMDF POS=(15,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00301**3
               COLOR=BLUE                                               00302   
AEDICT9 DFHMDF POS=(15,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00303**3
               COLOR=BLUE                                               00304   
AEDIDT9 DFHMDF POS=(15,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00305**3
               COLOR=BLUE                                               00306   
AEDITM9 DFHMDF POS=(15,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00307**3
               COLOR=BLUE                                               00308   
ACONEX9 DFHMDF POS=(15,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00309**3
               COLOR=BLUE                                               00310   
ACONAD9 DFHMDF POS=(15,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00311**3
               COLOR=BLUE                                               00312   
ACONDM9 DFHMDF POS=(15,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00313**3
               COLOR=BLUE                                               00314   
ACONDT9 DFHMDF POS=(15,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00315**3
               COLOR=BLUE                                               00316   
ACONTM9 DFHMDF POS=(15,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00317**3
               COLOR=BLUE                                               00318   
AUSRID9 DFHMDF POS=(15,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00319**3
               COLOR=BLUE                                               00320   
*                                                                       00321   
APSA    DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00322**3
               COLOR=BLUE                                               00323   
AASNCTA DFHMDF POS=(16,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00324**3
               COLOR=BLUE                                               00325   
AASNDTA DFHMDF POS=(16,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00326**3
               COLOR=BLUE                                               00327   
AASNTMA DFHMDF POS=(16,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00328**3
               COLOR=BLUE                                               00329   
AEDICTA DFHMDF POS=(16,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00330**3
               COLOR=BLUE                                               00331   
AEDIDTA DFHMDF POS=(16,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00332**3
               COLOR=BLUE                                               00333   
AEDITMA DFHMDF POS=(16,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00334**3
               COLOR=BLUE                                               00335   
ACONEXA DFHMDF POS=(16,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00336**3
               COLOR=BLUE                                               00337   
ACONADA DFHMDF POS=(16,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00338**3
               COLOR=BLUE                                               00339   
ACONDMA DFHMDF POS=(16,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00340**3
               COLOR=BLUE                                               00341   
ACONDTA DFHMDF POS=(16,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00342**3
               COLOR=BLUE                                               00343   
ACONTMA DFHMDF POS=(16,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00344**3
               COLOR=BLUE                                               00345   
AUSRIDA DFHMDF POS=(16,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00346**3
               COLOR=BLUE                                               00347   
*                                                                       00348   
APSB    DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00349**3
               COLOR=BLUE                                               00350   
AASNCTB DFHMDF POS=(17,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00351**3
               COLOR=BLUE                                               00352   
AASNDTB DFHMDF POS=(17,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00353**3
               COLOR=BLUE                                               00354   
AASNTMB DFHMDF POS=(17,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00355**3
               COLOR=BLUE                                               00356   
AEDICTB DFHMDF POS=(17,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00357**3
               COLOR=BLUE                                               00358   
AEDIDTB DFHMDF POS=(17,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00359**3
               COLOR=BLUE                                               00360   
AEDITMB DFHMDF POS=(17,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00361**3
               COLOR=BLUE                                               00362   
ACONEXB DFHMDF POS=(17,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00363**3
               COLOR=BLUE                                               00364   
ACONADB DFHMDF POS=(17,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00365**3
               COLOR=BLUE                                               00366   
ACONDMB DFHMDF POS=(17,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00367**3
               COLOR=BLUE                                               00368   
ACONDTB DFHMDF POS=(17,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00369**3
               COLOR=BLUE                                               00370   
ACONTMB DFHMDF POS=(17,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00371**3
               COLOR=BLUE                                               00372   
AUSRIDB DFHMDF POS=(17,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00373**3
               COLOR=BLUE                                               00374   
*                                                                       00375   
APSC    DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00376**3
               COLOR=BLUE                                               00377   
AASNCTC DFHMDF POS=(18,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00378**3
               COLOR=BLUE                                               00379   
AASNDTC DFHMDF POS=(18,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00380**3
               COLOR=BLUE                                               00381   
AASNTMC DFHMDF POS=(18,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00382**3
               COLOR=BLUE                                               00383   
AEDICTC DFHMDF POS=(18,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00384**3
               COLOR=BLUE                                               00385   
AEDIDTC DFHMDF POS=(18,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00386**3
               COLOR=BLUE                                               00387   
AEDITMC DFHMDF POS=(18,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00388**3
               COLOR=BLUE                                               00389   
ACONEXC DFHMDF POS=(18,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00390**3
               COLOR=BLUE                                               00391   
ACONADC DFHMDF POS=(18,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00392**3
               COLOR=BLUE                                               00393   
ACONDMC DFHMDF POS=(18,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00394**3
               COLOR=BLUE                                               00395   
ACONDTC DFHMDF POS=(18,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00396**3
               COLOR=BLUE                                               00397   
ACONTMC DFHMDF POS=(18,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00398**3
               COLOR=BLUE                                               00399   
AUSRIDC DFHMDF POS=(18,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00400**3
               COLOR=BLUE                                               00401   
*                                                                       00402   
APSD    DFHMDF POS=(19,04),LENGTH=01,ATTRB=(ASKIP,NORM),               C00403**3
               COLOR=BLUE                                               00404   
AASNCTD DFHMDF POS=(19,06),LENGTH=05,ATTRB=(ASKIP,NORM),               C00405**3
               COLOR=BLUE                                               00406   
AASNDTD DFHMDF POS=(19,12),LENGTH=05,ATTRB=(ASKIP,NORM),               C00407**3
               COLOR=BLUE                                               00408   
AASNTMD DFHMDF POS=(19,18),LENGTH=05,ATTRB=(ASKIP,NORM),               C00409**3
               COLOR=BLUE                                               00410   
AEDICTD DFHMDF POS=(19,24),LENGTH=05,ATTRB=(ASKIP,NORM),               C00411**3
               COLOR=BLUE                                               00412   
AEDIDTD DFHMDF POS=(19,30),LENGTH=05,ATTRB=(ASKIP,NORM),               C00413**3
               COLOR=BLUE                                               00414   
AEDITMD DFHMDF POS=(19,36),LENGTH=05,ATTRB=(ASKIP,NORM),               C00415**3
               COLOR=BLUE                                               00416   
ACONEXD DFHMDF POS=(19,42),LENGTH=05,ATTRB=(ASKIP,NORM),               C00417**3
               COLOR=BLUE                                               00418   
ACONADD DFHMDF POS=(19,48),LENGTH=05,ATTRB=(ASKIP,NORM),               C00419**3
               COLOR=BLUE                                               00420   
ACONDMD DFHMDF POS=(19,54),LENGTH=05,ATTRB=(ASKIP,NORM),               C00421**3
               COLOR=BLUE                                               00422   
ACONDTD DFHMDF POS=(19,60),LENGTH=05,ATTRB=(ASKIP,NORM),               C00423**3
               COLOR=BLUE                                               00424   
ACONTMD DFHMDF POS=(19,66),LENGTH=05,ATTRB=(ASKIP,NORM),               C00425**3
               COLOR=BLUE                                               00426   
AUSRIDD DFHMDF POS=(19,72),LENGTH=08,ATTRB=(ASKIP,NORM),               C00427**3
               COLOR=BLUE                                               00428   
*                                                                       00429   
**************                                                          00430   
        DFHMSD TYPE=FINAL                                               00431   
**************                                                          00432   
        END                                                             00433   
