*          DATA SET RCK00087   AT LEVEL 028 AS OF 02/21/96                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  RCKM277                                            *   00004**2
*        MAP     RC277A                                             *   00005**2
*        PROGRAM RCKCS277                                           *   00006**2
*        TRANSID E277 - VERIFIED COUNT ADJ COMMENTS                 *   00007**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
RCKM277 DFHMSD TYPE=MAP,                                               X00011**2
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
RC277A  DFHMDI LINE=2,COLUMN=1,                                        X00016**2
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='RCVR: ',                                       X00022**3
               LENGTH=6,                                               X00023**3
               COLOR=NEUTRAL,                                          X00024   
               POS=(03,02)                                              00025   
APOREC  DFHMDF ATTRB=(ASKIP),                                          X00026**4
               LENGTH=13,                                              X00027*22
               COLOR=BLUE,                                             X00028**4
               POS=(03,09)                                              00029**7
*                                                                       00030*18
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00031   
               INITIAL='OP ID: ',                                      X00032**4
               LENGTH=07,                                              X00033**4
               COLOR=NEUTRAL,                                          X00034   
               POS=(03,25)                                              00035**4
AOPID   DFHMDF ATTRB=(ASKIP),                                          X00036**4
               LENGTH=04,                                              X00037**4
               COLOR=BLUE,                                             X00038   
               POS=(03,33)                                              00039*15
*                                                                       00040   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00041   
               INITIAL='FCLTY: ',                                      X00042**4
               LENGTH=07,                                              X00043**4
               COLOR=NEUTRAL,                                          X00044   
               POS=(03,38)                                              00045*14
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00046**4
               LENGTH=04,                                              X00047**4
               COLOR=BLUE,                                             X00048   
               POS=(03,47)                                              00049*14
AFCNAME DFHMDF ATTRB=(ASKIP),                                          X00050*19
               LENGTH=25,                                              X00051**4
               COLOR=BLUE,                                             X00052   
               POS=(03,52)                                              00053*14
*                                                                       00054   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00055   
               INITIAL='REASON CODE: ',                                X00056*10
               LENGTH=13,                                              X00057**4
               COLOR=NEUTRAL,                                          X00058   
               POS=(06,02)                                              00059**4
ATRBRSN DFHMDF ATTRB=(UNPROT,IC),                                      X00072*25
               LENGTH=4,                                               X00061**4
               COLOR=GREEN,                                            X00062   
               HILIGHT=UNDERLINE,                                      X00063   
               POS=(06,18),                                            X00064*27
               PICOUT='ZZZZ'                                            00065*26
        DFHMDF ATTRB=(ASKIP),                                          X00066   
               INITIAL=' - ',                                          X00067*10
               LENGTH=3,                                               X00068**6
               COLOR=NEUTRAL,                                          X00069   
               POS=(06,23)                                              00070*11
*                                                                       00071   
ATRBDES DFHMDF ATTRB=(ASKIP),                                          X00046**4
               LENGTH=20,                                              X00073**6
               COLOR=BLUE,                                             X00074*25
               HILIGHT=UNDERLINE,                                      X00075*25
               POS=(06,28)                                              00076*11
        DFHMDF ATTRB=(ASKIP),                                          X00077*25
               LENGTH=1,                                               X00078*25
               COLOR=NEUTRAL,                                          X00079*25
               POS=(06,49)                                              00080*25
*                                                                       00081*24
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00082   
               INITIAL='AND/OR',                                       X00083**6
               LENGTH=6,                                               X00084**6
               COLOR=NEUTRAL,                                          X00085   
               POS=(08,02)                                              00086**6
        DFHMDF ATTRB=(ASKIP),                                          X00087   
               LENGTH=1,                                               X00088   
               COLOR=NEUTRAL,                                          X00089   
               POS=(08,9)                                               00090*16
*                                                                       00091   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00092   
               INITIAL='COMMENTS:',                                    X00093**6
               LENGTH=9,                                               X00094**6
               COLOR=NEUTRAL,                                          X00095   
               POS=(10,2)                                               00096*11
ATEXT1  DFHMDF ATTRB=(UNPROT),                                         X00097   
               LENGTH=50,                                              X00098   
               COLOR=GREEN,                                            X00099   
               HILIGHT=UNDERLINE,                                      X00100   
               POS=(10,12)                                              00101*15
        DFHMDF ATTRB=(ASKIP),                                          X00102   
               LENGTH=1,                                               X00103   
               COLOR=NEUTRAL,                                          X00104   
               POS=(10,63)                                              00105*12
*                                                                       00106   
ATEXT2  DFHMDF ATTRB=(UNPROT),                                         X00107   
               LENGTH=50,                                              X00108   
               COLOR=GREEN,                                            X00109   
               HILIGHT=UNDERLINE,                                      X00110   
               POS=(11,12)                                              00111*15
        DFHMDF ATTRB=(ASKIP),                                          X00112   
               LENGTH=1,                                               X00113   
               COLOR=NEUTRAL,                                          X00114   
               POS=(11,63)                                              00115*12
*                                                                       00116   
ATEXT3  DFHMDF ATTRB=(UNPROT),                                         X00117   
               LENGTH=50,                                              X00118   
               COLOR=GREEN,                                            X00119   
               HILIGHT=UNDERLINE,                                      X00120   
               POS=(12,12)                                              00121*15
        DFHMDF ATTRB=(ASKIP),                                          X00122   
               LENGTH=1,                                               X00123   
               COLOR=NEUTRAL,                                          X00124   
               POS=(12,63)                                              00125*12
*                                                                       00126   
ATEXT4  DFHMDF ATTRB=(UNPROT),                                         X00127   
               LENGTH=50,                                              X00128   
               COLOR=GREEN,                                            X00129   
               HILIGHT=UNDERLINE,                                      X00130   
               POS=(13,12)                                              00131*13
        DFHMDF ATTRB=(ASKIP),                                          X00132   
               LENGTH=1,                                               X00133   
               COLOR=NEUTRAL,                                          X00134   
               POS=(13,63)                                              00135*12
*                                                                       00136   
ATEXT5  DFHMDF ATTRB=(UNPROT),                                         X00137   
               LENGTH=50,                                              X00138   
               COLOR=GREEN,                                            X00139   
               HILIGHT=UNDERLINE,                                      X00140   
               POS=(14,12)                                              00141*13
        DFHMDF ATTRB=(ASKIP),                                          X00142   
               LENGTH=1,                                               X00143   
               COLOR=NEUTRAL,                                          X00144   
               POS=(14,63)                                              00145*12
*                                                                       00146   
         DFHMSD TYPE=FINAL                                              00147   
         END                                                            00148   
