*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM803                                            *   00006   
*        MAP     RC803A                                             *   00007   
*        PROGRAM RCKCS803                                           *   00008   
*        TRANSID E803 - RECEIPT ITEM ADD                            *   00009   
*        SYSTEM  RC RECEIVING                                       *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
  PRINT  NOGEN                                                          00003   
RCKM803 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES                       
RC803A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00009   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00010   
*********************************************************************   00076   
        DFHMDF POS=(03,01),LENGTH=13, ATTRB=(ASKIP,BRT),               X00023   
               COLOR=NEUTRAL,                                          X        
               INITIAL='OPERATING ID:'                                          
AOPER   DFHMDF POS=(03,15),LENGTH=4, ATTRB=(ASKIP,NORM),               X00029   
               COLOR=BLUE                                                       
AFCLTY  DFHMDF POS=(03,20),LENGTH=4, ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE                                                       
AFDESC  DFHMDF POS=(03,27),LENGTH=30, ATTRB=(ASKIP,NORM),              X00039   
               COLOR=BLUE                                                       
*********************************************************************   00076   
        DFHMDF POS=(04,01),LENGTH=13,ATTRB=(ASKIP,BRT),                X00044   
               COLOR=NEUTRAL,                                          X00047   
               INITIAL='RECEIVER NO.:'                                          
ARCVR   DFHMDF POS=(04,15),LENGTH=12, ATTRB=(ASKIP,NORM),              X00053   
               COLOR=BLUE                                               00052   
*********************************************************************   00076   
        DFHMDF POS=(05,01),LENGTH=13, ATTRB=(ASKIP,BRT),               X00055   
               COLOR=NEUTRAL,                                          X00058   
               INITIAL='PO LINE NO..:'                                  00056   
ALINE   DFHMDF POS=(05,15),LENGTH=04,ATTRB=(ASKIP,NORM),               X00064   
               COLOR=BLUE                                               00063   
*********************************************************************           
        DFHMDF POS=(06,01),LENGTH=13,ATTRB=(ASKIP,BRT),                X00066   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='STATUS......:'                                  00067   
ASTDESC DFHMDF POS=(06,15),LENGTH=10, ATTRB=(ASKIP,NORM),              X00074   
               COLOR=BLUE                                                       
        DFHMDF POS=(06,35),LENGTH=15, ATTRB=(ASKIP,BRT),               X00077   
               COLOR=NEUTRAL,                                          X00080   
               INITIAL='TROUBLE REASON:'                                        
ATRBL   DFHMDF POS=(06,51),LENGTH=25, ATTRB=(ASKIP,NORM),              X00083   
               COLOR=YELLOW                                                     
*********************************************************************           
        DFHMDF POS=(07,01),LENGTH=13,ATTRB=(ASKIP,BRT),                X00053   
               INITIAL='PACK ID.....:'                                  00054   
APACKID DFHMDF POS=(07,15),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(07,25),LENGTH=12,ATTRB=(ASKIP,BRT),                X00057   
               INITIAL='PACK DESC : '                                   00058   
APKDESC DFHMDF POS=(07,38),LENGTH=36,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
*********************************************************************           
        DFHMDF POS=(10,01),LENGTH=15, ATTRB=(ASKIP,BRT),               X00088   
               COLOR=NEUTRAL,                                          X00091   
               INITIAL='DTL PACK RATIO:'                                        
ARCRATO DFHMDF POS=(10,17),LENGTH=03,ATTRB=(UNPROT,NORM,NUM),          X00094   
               COLOR=GREEN,                                            X00096   
               HILIGHT=UNDERLINE,                                      X00097   
               PICOUT='ZZ9'                                                     
        DFHMDF POS=(10,21),LENGTH=1,ATTRB=(ASKIP),                     X00104   
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(10,25),LENGTH=19, ATTRB=(ASKIP,BRT),               X00106   
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO PACK RATIO.....:'                                    
ACASE   DFHMDF POS=(10,46),LENGTH=05, ATTRB=(ASKIP,NORM),              X00112   
               COLOR=BLUE,                                             X00114   
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(10,52),LENGTH=12,ATTRB=(ASKIP,BRT),                X00118   
               COLOR=NEUTRAL,                                          X00121   
               INITIAL='GROUP RTL..:'                                           
AGRPRTL DFHMDF POS=(10,66),LENGTH=07,ATTRB=(ASKIP,NORM),               X00124   
               COLOR=BLUE,                                             X00126   
               PICOUT='ZZZZ.99'                                                 
*********************************************************************           
        DFHMDF POS=(11,01),LENGTH=15,ATTRB=(ASKIP,BRT),                X00130   
               COLOR=NEUTRAL,                                          X00133   
               INITIAL='DTL PACK UNITS:'                                        
ADCQTY  DFHMDF POS=(11,17),LENGTH=05, ATTRB=(UNPROT,NORM,NUM),         X00136   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X00139   
               PICOUT='ZZZZZ'                                                   
        DFHMDF POS=(11,23),LENGTH=01, ATTRB=(ASKIP),                   X00143   
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(11,25),LENGTH=19, ATTRB=(ASKIP,BRT),               X00148   
               COLOR=NEUTRAL,                                          X00151   
               INITIAL='PACK SLIP PACK UNT:'                                    
APSQTY  DFHMDF POS=(11,46),LENGTH=05,ATTRB=(ASKIP,NORM),               X00154   
               COLOR=BLUE,                                             X00156   
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(11,52),LENGTH=12,ATTRB=(ASKIP,BRT),                X00161   
               COLOR=NEUTRAL,                                          X00164   
               INITIAL='GROUP QTY..:'                                           
AGRPQTY DFHMDF POS=(11,66),LENGTH=03,ATTRB=(ASKIP,NORM),               X00167   
               COLOR=BLUE,                                             X00169   
               PICOUT='ZZ9'                                                     
*********************************************************************           
        DFHMDF POS=(12,25),LENGTH=19, ATTRB=(ASKIP,BRT),               X00190   
               COLOR=NEUTRAL,                                          X00193   
               INITIAL='EXPECTED CTN CNT..:'                                    
AEXPCTN DFHMDF POS=(12,46),LENGTH=04,ATTRB=(ASKIP,NORM),               X00196   
               COLOR=BLUE,                                             X00198   
               PICOUT='ZZZ9'                                                    
        DFHMDF POS=(12,52),LENGTH=12,ATTRB=(ASKIP,BRT),                X00202   
               COLOR=NEUTRAL,                                          X        
               INITIAL='UNIT RTL...:'                                           
ARTL    DFHMDF POS=(12,66),LENGTH=07,ATTRB=(ASKIP,NORM),               X00208   
               COLOR=BLUE,                                             X00210   
               PICOUT='ZZZZ.99'                                                 
                                                                                
*********************************************************************           
        DFHMDF POS=(13,01),LENGTH=13,ATTRB=(ASKIP,BRT),                X00173   
               COLOR=NEUTRAL,                                          X        
               INITIAL='PRE-TICKETED:'                                          
APRETKT DFHMDF POS=(13,15),LENGTH=01,ATTRB=(ASKIP,NORM),               X00179   
               COLOR=BLUE                                                       
        DFHMDF POS=(13,17),LENGTH=1,ATTRB=(ASKIP),                     X00185   
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(13,25),LENGTH=19,ATTRB=(ASKIP,BRT),                X00232   
               COLOR=NEUTRAL,                                          X00235   
               INITIAL='ACTUAL CTN CNT....:'                                    
AACTCTN DFHMDF POS=(13,46),LENGTH=04,ATTRB=(ASKIP,NORM),               X00238   
               COLOR=BLUE,                                             X00240   
               PICOUT='ZZZ9'                                                    
        DFHMDF POS=(13,52),LENGTH=12,ATTRB=(ASKIP,BRT),                X00244   
               COLOR=NEUTRAL,                                          X00247   
               INITIAL='TCKT TYPE..:'                                           
ATKT    DFHMDF POS=(13,66),LENGTH=16,ATTRB=(ASKIP,NORM),               X00250   
               COLOR=BLUE                                                       
*********************************************************************           
*-------------------------------------------------------------------*           
* INCREASED LENGTH FROM 10 TO 15                   WR # 230ZZ       *           
*-------------------------------------------------------------------*           
        DFHMDF POS=(15,25),LENGTH=19,ATTRB=(ASKIP,BRT),                X00272   
               COLOR=NEUTRAL,                                          X00275   
               INITIAL='SKU...............:'                                    
ASKU    DFHMDF POS=(15,46),LENGTH=15,ATTRB=(ASKIP,NORM),               X00278   
               COLOR=BLUE                                                       
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*********************************************************************           
        DFHMDF POS=(16,25),LENGTH=19,ATTRB=(ASKIP,BRT),                X00301   
               COLOR=NEUTRAL,                                          X00304   
               INITIAL='STYLE.............:'                                    
ASTYLE  DFHMDF POS=(16,46),LENGTH=20,ATTRB=(ASKIP,NORM),               X00307   
               COLOR=BLUE                                                       
*********************************************************************           
        DFHMDF POS=(17,25),LENGTH=19,ATTRB=(ASKIP,BRT),                X00325   
               COLOR=NEUTRAL,                                          X00328   
               INITIAL='COLOR.............:'                                    
ACOLOR  DFHMDF POS=(17,46),LENGTH=25,ATTRB=(ASKIP,NORM),               X00331   
               COLOR=BLUE                                                       
*********************************************************************           
        DFHMDF POS=(18,25),LENGTH=19,ATTRB=(ASKIP,BRT),                X00353   
               COLOR=NEUTRAL,                                          X00356   
               INITIAL='SIZE..............:'                                    
ASIZE   DFHMDF POS=(18,46),LENGTH=25,ATTRB=(ASKIP,NORM),               X00359   
               COLOR=BLUE                                                       
*********************************************************************           
         DFHMSD TYPE=FINAL                                              00364   
         END                                                            00365   
