*          DATA SET RCKM294    AT LEVEL 012 AS OF 05/26/95                      
*          DATA SET RCKM294    AT LEVEL 001 AS OF 09/06/94              00001*12
*          DATA SET RCKM294    AT LEVEL 016 AS OF 04/13/94              00002*12
*          DATA SET RCKM294A1  AT LEVEL 011 AS OF 02/01/94              00003*12
  PRINT  NOGEN                                                          00004*10
*-------------------------------------------------------------------*   00005*10
*                                                                   *   00006*10
*        MAPSET  RCKM294                                            *   00007*11
*        MAP     RC294A                                             *   00008*11
*        PROGRAM RCKCS294                                           *   00009*11
*        TRANSID E294 - PACK SLIP LINE SUMMARY                      *   00010*11
*        SYSTEM  RC NEW RECEIVING                                   *   00011*10
*                                                                   *   00012*10
*-------------------------------------------------------------------*   00013*10
RCKM294 DFHMSD TYPE=DSECT,                                             X00014*11
               MODE=INOUT,                                             X00015*10
               LANG=COBOL,                                             X00016*10
               STORAGE=AUTO,                                           X00017*10
               TIOAPFX=YES,                                            X00018*10
               TERM=3270-2                                              00019*10
RC294A  DFHMDI LINE=2,COLUMN=1,                                        X00020*11
               SIZE=(19,80),                                           X00021*10
               MAPATTS=(COLOR,HILIGHT),                                X00022*10
               DSATTS=(COLOR,HILIGHT),                                 X00023*10
               CTRL=(FREEKB)                                            00024*10
*                                                                       00025*10
        DFHMDF POS=(02,01),                                            X00026*10
               LENGTH=06,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='PO NO:'                                         00030*10
APO     DFHMDF POS=(02,08),                                            X00031*10
               LENGTH=08,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(02,19),                                            X00035*10
               LENGTH=06,                                              X00036*10
               ATTRB=(ASKIP,NORM),                                     X00037*10
               COLOR=NEUTRAL,                                          X00038*10
               INITIAL='PS NO:'                                         00039*10
APKSLIP DFHMDF POS=(02,26),                                            X00040*10
               LENGTH=10,                                              X00041*10
               ATTRB=(ASKIP,NORM),                                     X00042*10
               COLOR=BLUE                                               00043*10
        DFHMDF POS=(02,37),                                            X00044*10
               LENGTH=12,                                              X00045*10
               ATTRB=(ASKIP,NORM),                                     X00046*10
               COLOR=NEUTRAL,                                          X00047*10
               INITIAL='VENDOR NAME:'                                   00048*10
AVEND   DFHMDF POS=(02,50),                                            X00049*10
               LENGTH=30,                                              X00050*10
               ATTRB=(ASKIP,NORM),                                     X00051*10
               COLOR=BLUE                                               00052*10
*                                                                       00053*10
        DFHMDF POS=(03,01),                                            X00054*10
               LENGTH=12,                                              X00055*10
               ATTRB=(ASKIP,NORM),                                     X00056*10
               COLOR=NEUTRAL,                                          X00057*10
               INITIAL='RCVR SEQ NO:'                                   00058*10
ARECSEQ DFHMDF POS=(03,14),                                            X00059*10
               LENGTH=04,                                              X00060*10
               ATTRB=(ASKIP,NORM),                                     X00061*10
               COLOR=BLUE                                               00062*10
        DFHMDF POS=(03,19),                                            X00063*10
               LENGTH=07,                                              X00064*10
               ATTRB=(ASKIP,NORM),                                     X00065*10
               COLOR=NEUTRAL,                                          X00066*10
               INITIAL='STR NO:'                                        00067*10
ASTR    DFHMDF POS=(03,27),                                            X00068*10
               LENGTH=04,                                              X00069*10
               ATTRB=(ASKIP,NORM),                                     X00070*10
               COLOR=BLUE                                               00071*10
        DFHMDF POS=(03,45),                                            X00072*10
               LENGTH=05,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=NEUTRAL,                                          X00075*10
               INITIAL='ITEMS'                                          00076*10
ASTRTIT DFHMDF POS=(03,51),                                            X00077*10
               LENGTH=05,                                              X00078*10
               ATTRB=(NUM,UNPROT,NORM),                                X00079*10
               COLOR=GREEN,                                            X00080*10
               HILIGHT=UNDERLINE,                                      X00081*10
               PICOUT='ZZZZ9'                                           00082*10
        DFHMDF POS=(03,57),                                            X00083*10
               LENGTH=02,                                              X00084*10
               ATTRB=(ASKIP,NORM),                                     X00085*10
               COLOR=NEUTRAL,                                          X00086*10
               INITIAL='TO'                                             00087*10
AENDIT  DFHMDF POS=(03,60),                                            X00088*10
               LENGTH=05,                                              X00089*10
               ATTRB=(ASKIP,NORM),                                     X00090*10
               COLOR=BLUE,                                             X00091*10
               PICOUT='ZZZZ9'                                           00092*10
        DFHMDF POS=(03,66),                                            X00093*10
               LENGTH=02,                                              X00094*10
               ATTRB=(ASKIP,NORM),                                     X00095*10
               COLOR=NEUTRAL,                                          X00096*10
               INITIAL='OF'                                             00097*10
ATOTIT  DFHMDF POS=(03,69),                                            X00098*10
               LENGTH=05,                                              X00099*10
               ATTRB=(ASKIP,NORM),                                     X00100*10
               COLOR=BLUE,                                             X00101*10
               PICOUT='ZZZZ9'                                           00102*10
*                                                                       00103*10
        DFHMDF POS=(04,01),                                            X00104*10
               LENGTH=17,                                              X00105*10
               ATTRB=(PROT,NORM),                                      X00106*10
               COLOR=NEUTRAL,                                          X00107*10
               INITIAL='SEARCH FOR STYLE:'                              00108*10
ASTYLE  DFHMDF POS=(04,19),                                            X00109*10
               LENGTH=20,                                              X00110*10
               ATTRB=(UNPROT,NORM,IC),                                 X00111*10
               HILIGHT=UNDERLINE,                                      X00112*10
               COLOR=GREEN                                              00113*10
        DFHMDF POS=(04,40),                                            X00114*10
               LENGTH=01,                                              X00115*10
               ATTRB=(ASKIP)                                            00116*10
*                                                                       00117*10
        DFHMDF POS=(05,10),                                            X00118*10
               LENGTH=02,                                              X00119*10
               ATTRB=(PROT,NORM),                                      X00120*10
               COLOR=NEUTRAL,                                          X00121*10
               INITIAL='PO'                                             00122*10
        DFHMDF POS=(05,14),                                            X00123*10
               LENGTH=12,                                              X00124*10
               ATTRB=(PROT,NORM),                                      X00125*10
               COLOR=NEUTRAL,                                          X00126*10
               INITIAL='VENDOR STYLE'                                   00127*10
        DFHMDF POS=(05,41),                                            X00128*10
               LENGTH=03,                                              X00129*10
               ATTRB=(PROT,NORM),                                      X00130*10
               COLOR=NEUTRAL,                                          X00131*10
               INITIAL='QTY'                                            00132*10
        DFHMDF POS=(05,55),                                            X00133*10
               LENGTH=10,                                              X00134*10
               ATTRB=(PROT,NORM),                                      X00135*10
               COLOR=NEUTRAL,                                          X00136*10
               INITIAL='COLOR DESC'                                     00137*10
*                                                                       00138*10
        DFHMDF POS=(06,01),                                            X00139*10
               LENGTH=03,                                              X00140*10
               ATTRB=(PROT,NORM),                                      X00141*10
               COLOR=NEUTRAL,                                          X00142*10
               INITIAL='SEL'                                            00143*10
        DFHMDF POS=(06,05),                                            X00144*10
               LENGTH=03,                                              X00145*10
               ATTRB=(PROT,NORM),                                      X00146*10
               COLOR=NEUTRAL,                                          X00147*10
               INITIAL='ACT'                                            00148*10
        DFHMDF POS=(06,09),                                            X00149*10
               LENGTH=16,                                              X00150*10
               ATTRB=(PROT,NORM),                                      X00151*10
               COLOR=NEUTRAL,                                          X00152*10
               INITIAL='LINE DESCRIPTION'                               00153*10
        DFHMDF POS=(06,40),                                            X00154*10
               LENGTH=04,                                              X00155*10
               ATTRB=(PROT,NORM),                                      X00156*10
               COLOR=NEUTRAL,                                          X00157*10
               INITIAL='TRBL'                                           00158*10
        DFHMDF POS=(06,49),                                            X00159*10
               LENGTH=04,                                              X00160*10
               ATTRB=(PROT,NORM),                                      X00161*10
               COLOR=NEUTRAL,                                          X00162*10
               INITIAL='COST'                                           00163*10
        DFHMDF POS=(06,55),                                            X00164*10
               LENGTH=09,                                              X00165*10
               ATTRB=(PROT,NORM),                                      X00166*10
               COLOR=NEUTRAL,                                          X00167*10
               INITIAL='SIZE DESC'                                      00168*10
*                                                                       00169*10
ASEL01  DFHMDF POS=(07,02),                                            X00170*10
               LENGTH=01,                                              X00171*10
               ATTRB=(UNPROT,NORM),                                    X00172*10
               HILIGHT=UNDERLINE,                                      X00173*10
               COLOR=GREEN                                              00174*10
        DFHMDF POS=(07,04),                                            X00175*10
               LENGTH=00,                                              X00176*10
               ATTRB=(ASKIP)                                            00177*10
AACT01  DFHMDF POS=(07,05),                                            X00178*10
               LENGTH=03,                                              X00179*10
               ATTRB=(ASKIP,NORM),                                     X00180*10
               COLOR=BLUE                                               00181*10
ALINE01 DFHMDF POS=(07,09),                                            X00182*10
               LENGTH=04,                                              X00183*10
               ATTRB=(ASKIP,NORM),                                     X00184*10
               COLOR=BLUE                                               00185*10
ASTYL01 DFHMDF POS=(07,14),                                            X00186*10
               LENGTH=20,                                              X00187*10
               ATTRB=(ASKIP,NORM),                                     X00188*10
               COLOR=BLUE                                               00189*10
AQTY01  DFHMDF POS=(07,37),                                            X00190*10
               LENGTH=07,                                              X00191*10
               ATTRB=(ASKIP,NORM),                                     X00192*10
               COLOR=BLUE                                               00193*10
ACOST01 DFHMDF POS=(07,45),                                            X00194*10
               LENGTH=08,                                              X00195*10
               ATTRB=(ASKIP,NORM),                                     X00196*10
               COLOR=BLUE                                               00197*10
ACLR01  DFHMDF POS=(07,55),                                            X00198*10
               LENGTH=25,                                              X00199*10
               ATTRB=(ASKIP,NORM),                                     X00200*10
               COLOR=BLUE                                               00201*10
*                                                                       00202*10
ADESC01 DFHMDF POS=(08,14),                                            X00203*10
               LENGTH=25,                                              X00204*10
               ATTRB=(ASKIP,NORM),                                     X00205*10
               COLOR=BLUE                                               00206*10
ATRBL01 DFHMDF POS=(08,40),                                            X00207*10
               LENGTH=12,                                              X00208*10
               ATTRB=(ASKIP,NORM),                                     X00209*10
               COLOR=BLUE                                               00210*10
ASIZE01 DFHMDF POS=(08,55),                                            X00211*10
               LENGTH=25,                                              X00212*10
               ATTRB=(ASKIP,NORM),                                     X00213*10
               COLOR=BLUE                                               00214*10
*                                                                       00215*10
ASEL02  DFHMDF POS=(09,02),                                            X00216*10
               LENGTH=01,                                              X00217*10
               ATTRB=(UNPROT,NORM),                                    X00218*10
               HILIGHT=UNDERLINE,                                      X00219*10
               COLOR=GREEN                                              00220*10
        DFHMDF POS=(09,04),                                            X00221*10
               LENGTH=00,                                              X00222*10
               ATTRB=(ASKIP)                                            00223*10
AACT02  DFHMDF POS=(09,05),                                            X00224*10
               LENGTH=03,                                              X00225*10
               ATTRB=(ASKIP,NORM),                                     X00226*10
               COLOR=BLUE                                               00227*10
ALINE02 DFHMDF POS=(09,09),                                            X00228*10
               LENGTH=04,                                              X00229*10
               ATTRB=(ASKIP,NORM),                                     X00230*10
               COLOR=BLUE                                               00231*10
ASTYL02 DFHMDF POS=(09,14),                                            X00232*10
               LENGTH=20,                                              X00233*10
               ATTRB=(ASKIP,NORM),                                     X00234*10
               COLOR=BLUE                                               00235*10
AQTY02  DFHMDF POS=(09,37),                                            X00236*10
               LENGTH=07,                                              X00237*10
               ATTRB=(ASKIP,NORM),                                     X00238*10
               COLOR=BLUE                                               00239*10
ACOST02 DFHMDF POS=(09,45),                                            X00240*10
               LENGTH=08,                                              X00241*10
               ATTRB=(ASKIP,NORM),                                     X00242*10
               COLOR=BLUE                                               00243*10
ACLR02  DFHMDF POS=(09,55),                                            X00244*10
               LENGTH=25,                                              X00245*10
               ATTRB=(ASKIP,NORM),                                     X00246*10
               COLOR=BLUE                                               00247*10
*                                                                       00248*10
ADESC02 DFHMDF POS=(10,14),                                            X00249*10
               LENGTH=25,                                              X00250*10
               ATTRB=(ASKIP,NORM),                                     X00251*10
               COLOR=BLUE                                               00252*10
ATRBL02 DFHMDF POS=(10,40),                                            X00253*10
               LENGTH=12,                                              X00254*10
               ATTRB=(ASKIP,NORM),                                     X00255*10
               COLOR=BLUE                                               00256*10
ASIZE02 DFHMDF POS=(10,55),                                            X00257*10
               LENGTH=25,                                              X00258*10
               ATTRB=(ASKIP,NORM),                                     X00259*10
               COLOR=BLUE                                               00260*10
*                                                                       00261*10
ASEL03  DFHMDF POS=(11,02),                                            X00262*10
               LENGTH=01,                                              X00263*10
               ATTRB=(UNPROT,NORM),                                    X00264*10
               HILIGHT=UNDERLINE,                                      X00265*10
               COLOR=GREEN                                              00266*10
        DFHMDF POS=(11,04),                                            X00267*10
               LENGTH=00,                                              X00268*10
               ATTRB=(ASKIP)                                            00269*10
AACT03  DFHMDF POS=(11,05),                                            X00270*10
               LENGTH=03,                                              X00271*10
               ATTRB=(ASKIP,NORM),                                     X00272*10
               COLOR=BLUE                                               00273*10
ALINE03 DFHMDF POS=(11,09),                                            X00274*10
               LENGTH=04,                                              X00275*10
               ATTRB=(ASKIP,NORM),                                     X00276*10
               COLOR=BLUE                                               00277*10
ASTYL03 DFHMDF POS=(11,14),                                            X00278*10
               LENGTH=20,                                              X00279*10
               ATTRB=(ASKIP,NORM),                                     X00280*10
               COLOR=BLUE                                               00281*10
AQTY03  DFHMDF POS=(11,37),                                            X00282*10
               LENGTH=07,                                              X00283*10
               ATTRB=(ASKIP,NORM),                                     X00284*10
               COLOR=BLUE                                               00285*10
ACOST03 DFHMDF POS=(11,45),                                            X00286*10
               LENGTH=08,                                              X00287*10
               ATTRB=(ASKIP,NORM),                                     X00288*10
               COLOR=BLUE                                               00289*10
ACLR03  DFHMDF POS=(11,55),                                            X00290*10
               LENGTH=25,                                              X00291*10
               ATTRB=(ASKIP,NORM),                                     X00292*10
               COLOR=BLUE                                               00293*10
*                                                                       00294*10
ADESC03 DFHMDF POS=(12,14),                                            X00295*10
               LENGTH=25,                                              X00296*10
               ATTRB=(ASKIP,NORM),                                     X00297*10
               COLOR=BLUE                                               00298*10
ATRBL03 DFHMDF POS=(12,40),                                            X00299*10
               LENGTH=12,                                              X00300*10
               ATTRB=(ASKIP,NORM),                                     X00301*10
               COLOR=BLUE                                               00302*10
ASIZE03 DFHMDF POS=(12,55),                                            X00303*10
               LENGTH=25,                                              X00304*10
               ATTRB=(ASKIP,NORM),                                     X00305*10
               COLOR=BLUE                                               00306*10
*                                                                       00307*10
ASEL04  DFHMDF POS=(13,02),                                            X00308*10
               LENGTH=01,                                              X00309*10
               ATTRB=(UNPROT,NORM),                                    X00310*10
               HILIGHT=UNDERLINE,                                      X00311*10
               COLOR=GREEN                                              00312*10
        DFHMDF POS=(13,04),                                            X00313*10
               LENGTH=00,                                              X00314*10
               ATTRB=(ASKIP)                                            00315*10
AACT04  DFHMDF POS=(13,05),                                            X00316*10
               LENGTH=03,                                              X00317*10
               ATTRB=(ASKIP,NORM),                                     X00318*10
               COLOR=BLUE                                               00319*10
ALINE04 DFHMDF POS=(13,09),                                            X00320*10
               LENGTH=04,                                              X00321*10
               ATTRB=(ASKIP,NORM),                                     X00322*10
               COLOR=BLUE                                               00323*10
ASTYL04 DFHMDF POS=(13,14),                                            X00324*10
               LENGTH=20,                                              X00325*10
               ATTRB=(ASKIP,NORM),                                     X00326*10
               COLOR=BLUE                                               00327*10
AQTY04  DFHMDF POS=(13,37),                                            X00328*10
               LENGTH=07,                                              X00329*10
               ATTRB=(ASKIP,NORM),                                     X00330*10
               COLOR=BLUE                                               00331*10
ACOST04 DFHMDF POS=(13,45),                                            X00332*10
               LENGTH=08,                                              X00333*10
               ATTRB=(ASKIP,NORM),                                     X00334*10
               COLOR=BLUE                                               00335*10
ACLR04  DFHMDF POS=(13,55),                                            X00336*10
               LENGTH=25,                                              X00337*10
               ATTRB=(ASKIP,NORM),                                     X00338*10
               COLOR=BLUE                                               00339*10
*                                                                       00340*10
ADESC04 DFHMDF POS=(14,14),                                            X00341*10
               LENGTH=25,                                              X00342*10
               ATTRB=(ASKIP,NORM),                                     X00343*10
               COLOR=BLUE                                               00344*10
ATRBL04 DFHMDF POS=(14,40),                                            X00345*10
               LENGTH=12,                                              X00346*10
               ATTRB=(ASKIP,NORM),                                     X00347*10
               COLOR=BLUE                                               00348*10
ASIZE04 DFHMDF POS=(14,55),                                            X00349*10
               LENGTH=25,                                              X00350*10
               ATTRB=(ASKIP,NORM),                                     X00351*10
               COLOR=BLUE                                               00352*10
*                                                                       00353*10
ASEL05  DFHMDF POS=(15,02),                                            X00354*10
               LENGTH=01,                                              X00355*10
               ATTRB=(UNPROT,NORM),                                    X00356*10
               HILIGHT=UNDERLINE,                                      X00357*10
               COLOR=GREEN                                              00358*10
        DFHMDF POS=(15,04),                                            X00359*10
               LENGTH=00,                                              X00360*10
               ATTRB=(ASKIP)                                            00361*10
AACT05  DFHMDF POS=(15,05),                                            X00362*10
               LENGTH=03,                                              X00363*10
               ATTRB=(ASKIP,NORM),                                     X00364*10
               COLOR=BLUE                                               00365*10
ALINE05 DFHMDF POS=(15,09),                                            X00366*10
               LENGTH=04,                                              X00367*10
               ATTRB=(ASKIP,NORM),                                     X00368*10
               COLOR=BLUE                                               00369*10
ASTYL05 DFHMDF POS=(15,14),                                            X00370*10
               LENGTH=20,                                              X00371*10
               ATTRB=(ASKIP,NORM),                                     X00372*10
               COLOR=BLUE                                               00373*10
AQTY05  DFHMDF POS=(15,37),                                            X00374*10
               LENGTH=07,                                              X00375*10
               ATTRB=(ASKIP,NORM),                                     X00376*10
               COLOR=BLUE                                               00377*10
ACOST05 DFHMDF POS=(15,45),                                            X00378*10
               LENGTH=08,                                              X00379*10
               ATTRB=(ASKIP,NORM),                                     X00380*10
               COLOR=BLUE                                               00381*10
ACLR05  DFHMDF POS=(15,55),                                            X00382*10
               LENGTH=25,                                              X00383*10
               ATTRB=(ASKIP,NORM),                                     X00384*10
               COLOR=BLUE                                               00385*10
*                                                                       00386*10
ADESC05 DFHMDF POS=(16,14),                                            X00387*10
               LENGTH=25,                                              X00388*10
               ATTRB=(ASKIP,NORM),                                     X00389*10
               COLOR=BLUE                                               00390*10
ATRBL05 DFHMDF POS=(16,40),                                            X00391*10
               LENGTH=12,                                              X00392*10
               ATTRB=(ASKIP,NORM),                                     X00393*10
               COLOR=BLUE                                               00394*10
ASIZE05 DFHMDF POS=(16,55),                                            X00395*10
               LENGTH=25,                                              X00396*10
               ATTRB=(ASKIP,NORM),                                     X00397*10
               COLOR=BLUE                                               00398*10
*                                                                       00399*10
ASEL06  DFHMDF POS=(17,02),                                            X00400*10
               LENGTH=01,                                              X00401*10
               ATTRB=(UNPROT,NORM),                                    X00402*10
               HILIGHT=UNDERLINE,                                      X00403*10
               COLOR=GREEN                                              00404*10
        DFHMDF POS=(17,04),                                            X00405*10
               LENGTH=00,                                              X00406*10
               ATTRB=(ASKIP)                                            00407*10
AACT06  DFHMDF POS=(17,05),                                            X00408*10
               LENGTH=03,                                              X00409*10
               ATTRB=(ASKIP,NORM),                                     X00410*10
               COLOR=BLUE                                               00411*10
ALINE06 DFHMDF POS=(17,09),                                            X00412*10
               LENGTH=04,                                              X00413*10
               ATTRB=(ASKIP,NORM),                                     X00414*10
               COLOR=BLUE                                               00415*10
ASTYL06 DFHMDF POS=(17,14),                                            X00416*10
               LENGTH=20,                                              X00417*10
               ATTRB=(ASKIP,NORM),                                     X00418*10
               COLOR=BLUE                                               00419*10
AQTY06  DFHMDF POS=(17,37),                                            X00420*10
               LENGTH=07,                                              X00421*10
               ATTRB=(ASKIP,NORM),                                     X00422*10
               COLOR=BLUE                                               00423*10
ACOST06 DFHMDF POS=(17,45),                                            X00424*10
               LENGTH=08,                                              X00425*10
               ATTRB=(ASKIP,NORM),                                     X00426*10
               COLOR=BLUE                                               00427*10
ACLR06  DFHMDF POS=(17,55),                                            X00428*10
               LENGTH=25,                                              X00429*10
               ATTRB=(ASKIP,NORM),                                     X00430*10
               COLOR=BLUE                                               00431*10
*                                                                       00432*10
ADESC06 DFHMDF POS=(18,14),                                            X00433*10
               LENGTH=25,                                              X00434*10
               ATTRB=(ASKIP,NORM),                                     X00435*10
               COLOR=BLUE                                               00436*10
ATRBL06 DFHMDF POS=(18,40),                                            X00437*10
               LENGTH=12,                                              X00438*10
               ATTRB=(ASKIP,NORM),                                     X00439*10
               COLOR=BLUE                                               00440*10
ASIZE06 DFHMDF POS=(18,55),                                            X00441*10
               LENGTH=25,                                              X00442*10
               ATTRB=(ASKIP,NORM),                                     X00443*10
               COLOR=BLUE                                               00444*10
*                                                                       00445*10
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00446*10
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00447*10
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00448*10
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00449*10
**************                                                          00450*10
        DFHMSD TYPE=FINAL                                               00451*10
**************                                                          00452*10
        END                                                             00453*10
