*          DATA SET RCKM245    AT LEVEL 001 AS OF 02/20/96                      
*          DATA SET RCKM245                                             00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  RCKM245                                            *   00005   
*        MAP     RC245A                                             *   00006   
*        PROGRAM RCKCS245                                           *   00007   
*        TRANSID E245 - MATCH PURCHASE ORDER LINE - STYLE SEQ       *   00008   
*        SYSTEM  RC NEW RECEIVING                                   *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
RCKM245 DFHMSD TYPE=DSECT,                                             X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
RC245A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT),                                 X00021   
               CTRL=(FREEKB)                                            00022   
*                                                                       00023   
        DFHMDF POS=(01,01),                                            X00024   
               LENGTH=06,                                              X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='OP ID:'                                         00028   
AOPER   DFHMDF POS=(01,08),                                            X00029   
               LENGTH=04,                                              X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               COLOR=BLUE                                               00032   
        DFHMDF POS=(01,16),                                            X00033   
               LENGTH=06,                                              X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='FCLTY:'                                         00037   
AFCLTY  DFHMDF POS=(01,23),                                            X00038   
               LENGTH=04,                                              X00039   
               ATTRB=(ASKIP,NORM),                                     X00040   
               COLOR=BLUE                                               00041   
*                                                                       00042   
        DFHMDF POS=(02,01),                                            X00043   
               LENGTH=06,                                              X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               COLOR=NEUTRAL,                                          X00046   
               INITIAL='PO NO:'                                         00047   
APO     DFHMDF POS=(02,08),                                            X00048   
               LENGTH=08,                                              X00049   
               ATTRB=(ASKIP,NORM),                                     X00050   
               COLOR=BLUE                                               00051   
        DFHMDF POS=(02,17),                                            X00052   
               LENGTH=06,                                              X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               COLOR=NEUTRAL,                                          X00055   
               INITIAL='PS NO:'                                         00056   
APKSLIP DFHMDF POS=(02,24),                                            X00057   
               LENGTH=10,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               COLOR=BLUE                                               00060   
        DFHMDF POS=(02,35),                                            X00061   
               LENGTH=04,                                              X00062   
               ATTRB=(ASKIP,NORM),                                     X00063   
               COLOR=NEUTRAL,                                          X00064   
               INITIAL='STR:'                                           00065   
ASTR    DFHMDF POS=(02,40),                                            X00066   
               LENGTH=04,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=BLUE                                               00069   
        DFHMDF POS=(02,45),                                            X00070   
               LENGTH=05,                                              X00071   
               ATTRB=(ASKIP,NORM),                                     X00072   
               COLOR=NEUTRAL,                                          X00073   
               INITIAL='ITEMS'                                          00074   
ASTRTIT DFHMDF POS=(02,51),                                            X00075   
               LENGTH=05,                                              X00076   
               ATTRB=(NUM,UNPROT,NORM),                                X00077   
               COLOR=GREEN,                                            X00078   
               HILIGHT=UNDERLINE,                                      X00079   
               PICOUT='ZZZZ9'                                           00080   
        DFHMDF POS=(02,57),                                            X00081   
               LENGTH=02,                                              X00082   
               ATTRB=(ASKIP,NORM),                                     X00083   
               COLOR=NEUTRAL,                                          X00084   
               INITIAL='TO'                                             00085   
AENDIT  DFHMDF POS=(02,60),                                            X00086   
               LENGTH=05,                                              X00087   
               ATTRB=(ASKIP,NORM),                                     X00088   
               COLOR=BLUE,                                             X00089   
               PICOUT='ZZZZ9'                                           00090   
        DFHMDF POS=(02,66),                                            X00091   
               LENGTH=02,                                              X00092   
               ATTRB=(ASKIP,NORM),                                     X00093   
               COLOR=NEUTRAL,                                          X00094   
               INITIAL='OF'                                             00095   
ATOTIT  DFHMDF POS=(02,69),                                            X00096   
               LENGTH=05,                                              X00097   
               ATTRB=(ASKIP,NORM),                                     X00098   
               COLOR=BLUE,                                             X00099   
               PICOUT='ZZZZ9'                                           00100   
*                                                                       00101   
        DFHMDF POS=(03,01),                                            X00102   
               LENGTH=10,                                              X00103   
               ATTRB=(PROT,NORM),                                      X00104   
               COLOR=NEUTRAL,                                          X00105   
               INITIAL='SEARCH FOR'                                     00106   
ATYPE   DFHMDF POS=(03,12),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL                                                    
ASRTXT  DFHMDF POS=(03,19),                                            X00107   
               LENGTH=20,                                              X00108   
               ATTRB=(UNPROT,NORM,IC),                                 X00109   
               HILIGHT=UNDERLINE,                                      X00110   
               COLOR=GREEN                                              00111   
        DFHMDF POS=(03,40),                                            X00112   
               LENGTH=12,                                              X00113   
               ATTRB=(ASKIP,NORM),                                     X00114   
               COLOR=NEUTRAL,                                          X00115   
               INITIAL='VENDOR NAME:'                                   00116   
AVEND   DFHMDF POS=(03,53),                                            X00117   
               LENGTH=27,                                              X00118   
               ATTRB=(ASKIP,NORM),                                     X00119   
               COLOR=BLUE                                               00120   
*                                                                       00121   
        DFHMDF POS=(05,12),                                            X00122   
               LENGTH=02,                                              X00123   
               ATTRB=(PROT,NORM),                                      X00124   
               COLOR=NEUTRAL,                                          X00125   
               INITIAL='PO'                                             00126   
        DFHMDF POS=(05,16),                                            X00127   
               LENGTH=12,                                              X00128   
               ATTRB=(PROT,NORM),                                      X00129   
               COLOR=NEUTRAL,                                          X00130   
               INITIAL='VENDOR STYLE'                                   00131   
        DFHMDF POS=(05,37),                                            X00132   
               LENGTH=17,                                              X00133   
               ATTRB=(PROT,NORM),                                      X00134   
               COLOR=NEUTRAL,                                          X00135   
               INITIAL='COLOR DESCRIPTION'                              00136   
        DFHMDF POS=(05,66),                                            X00137   
               LENGTH=03,                                              X00138   
               ATTRB=(PROT,NORM),                                      X00139   
               COLOR=NEUTRAL,                                          X00140   
               INITIAL='OTR'                                            00141   
        DFHMDF POS=(05,75),                                            X00142   
               LENGTH=04,                                              X00143   
               ATTRB=(PROT,NORM),                                      X00144   
               COLOR=NEUTRAL,                                          X00145   
               INITIAL='COST'                                           00146   
*                                                                       00147   
        DFHMDF POS=(06,01),                                            X00148   
               LENGTH=03,                                              X00149   
               ATTRB=(PROT,NORM),                                      X00150   
               COLOR=NEUTRAL,                                          X00151   
               INITIAL='SEL'                                            00152   
        DFHMDF POS=(06,06),                                            X00153   
               LENGTH=03,                                              X00154   
               ATTRB=(PROT,NORM),                                      X00155   
               COLOR=NEUTRAL,                                          X00156   
               INITIAL='QTY'                                            00157   
        DFHMDF POS=(06,11),                                            X00158   
               LENGTH=04,                                              X00159   
               ATTRB=(PROT,NORM),                                      X00160   
               COLOR=NEUTRAL,                                          X00161   
               INITIAL='LINE'                                           00162   
        DFHMDF POS=(06,16),                                            X00163   
               LENGTH=11,                                              X00164   
               ATTRB=(PROT,NORM),                                      X00165   
               COLOR=NEUTRAL,                                          X00166   
               INITIAL='DESCRIPTION'                                    00167   
        DFHMDF POS=(06,37),                                            X00168   
               LENGTH=16,                                              X00169   
               ATTRB=(PROT,NORM),                                      X00170   
               COLOR=NEUTRAL,                                          X00171   
               INITIAL='SIZE DESCRIPTION'                               00172   
        DFHMDF POS=(06,63),                                            X00173   
               LENGTH=06,                                              X00174   
               ATTRB=(PROT,NORM),                                      X00175   
               COLOR=NEUTRAL,                                          X00176   
               INITIAL='CL SKU'                                         00177   
        DFHMDF POS=(06,74),                                            X00178   
               LENGTH=06,                                              X00179   
               ATTRB=(PROT,NORM),                                      X00180   
               COLOR=NEUTRAL,                                          X00181   
               INITIAL='STATUS'                                         00182   
*                                                                       00183   
ASEL01  DFHMDF POS=(07,02),                                            X00184   
               LENGTH=01,                                              X00185   
               ATTRB=(UNPROT,NORM),                                    X00186   
               HILIGHT=UNDERLINE,                                      X00187   
               COLOR=GREEN                                              00188   
AQTY01  DFHMDF POS=(07,04),                                            X00189   
               LENGTH=06,                                              X00190   
               ATTRB=(UNPROT,NORM,NUM),                                X00191   
               HILIGHT=UNDERLINE,                                      X00192   
               COLOR=GREEN                                              00193   
ALINE01 DFHMDF POS=(07,11),                                            X00194   
               LENGTH=04,                                              X00195   
               ATTRB=(ASKIP,NORM),                                     X00196   
               COLOR=BLUE                                               00197   
ASTYL01 DFHMDF POS=(07,16),                                            X00198   
               LENGTH=20,                                              X00199   
               ATTRB=(ASKIP,NORM),                                     X00200   
               COLOR=BLUE                                               00201   
ACLR01  DFHMDF POS=(07,37),                                            X00202   
               LENGTH=25,                                              X00203   
               ATTRB=(ASKIP,NORM),                                     X00204   
               COLOR=BLUE                                               00205   
AOTR01  DFHMDF POS=(07,63),                                            X00206   
               LENGTH=06,                                              X00207   
               ATTRB=(ASKIP,NORM),                                     X00208   
               COLOR=BLUE                                               00209   
ACOST01 DFHMDF POS=(07,70),                                            X00210   
               LENGTH=10,                                              X00211   
               ATTRB=(ASKIP,NORM),                                     X00212   
               COLOR=BLUE                                               00213   
*                                                                       00214   
ADESC01 DFHMDF POS=(08,16),                                            X00215   
               LENGTH=20,                                              X00216   
               ATTRB=(ASKIP,NORM),                                     X00217   
               COLOR=BLUE                                               00218   
ASIZE01 DFHMDF POS=(08,37),                                            X00219   
               LENGTH=25,                                              X00220   
               ATTRB=(ASKIP,NORM),                                     X00221   
               COLOR=BLUE                                               00222   
ACL01   DFHMDF POS=(08,63),                                            X00223   
               LENGTH=02,                                              X00224   
               ATTRB=(ASKIP,NORM),                                     X00225   
               COLOR=BLUE                                               00226   
ASKU01  DFHMDF POS=(08,66),                                            X00227   
               LENGTH=08,                                              X00228   
               ATTRB=(ASKIP,NORM),                                     X00229   
               COLOR=BLUE                                               00230   
ASTAT01 DFHMDF POS=(08,76),                                            X00231   
               LENGTH=2,                                               X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
*                                                                       00235   
ASEL02  DFHMDF POS=(09,02),                                            X00236   
               LENGTH=01,                                              X00237   
               ATTRB=(UNPROT,NORM),                                    X00238   
               HILIGHT=UNDERLINE,                                      X00239   
               COLOR=GREEN                                              00240   
AQTY02  DFHMDF POS=(09,04),                                            X00241   
               LENGTH=06,                                              X00242   
               ATTRB=(UNPROT,NORM,NUM),                                X00243   
               HILIGHT=UNDERLINE,                                      X00244   
               COLOR=GREEN                                              00245   
ALINE02 DFHMDF POS=(09,11),                                            X00246   
               LENGTH=04,                                              X00247   
               ATTRB=(ASKIP,NORM),                                     X00248   
               COLOR=BLUE                                               00249   
ASTYL02 DFHMDF POS=(09,16),                                            X00250   
               LENGTH=20,                                              X00251   
               ATTRB=(ASKIP,NORM),                                     X00252   
               COLOR=BLUE                                               00253   
ACLR02  DFHMDF POS=(09,37),                                            X00254   
               LENGTH=25,                                              X00255   
               ATTRB=(ASKIP,NORM),                                     X00256   
               COLOR=BLUE                                               00257   
AOTR02  DFHMDF POS=(09,63),                                            X00258   
               LENGTH=06,                                              X00259   
               ATTRB=(ASKIP,NORM),                                     X00260   
               COLOR=BLUE                                               00261   
ACOST02 DFHMDF POS=(09,70),                                            X00262   
               LENGTH=10,                                              X00263   
               ATTRB=(ASKIP,NORM),                                     X00264   
               COLOR=BLUE                                               00265   
*                                                                       00266   
ADESC02 DFHMDF POS=(10,16),                                            X00267   
               LENGTH=20,                                              X00268   
               ATTRB=(ASKIP,NORM),                                     X00269   
               COLOR=BLUE                                               00270   
ASIZE02 DFHMDF POS=(10,37),                                            X00271   
               LENGTH=25,                                              X00272   
               ATTRB=(ASKIP,NORM),                                     X00273   
               COLOR=BLUE                                               00274   
ACL02   DFHMDF POS=(10,63),                                            X00275   
               LENGTH=02,                                              X00276   
               ATTRB=(ASKIP,NORM),                                     X00277   
               COLOR=BLUE                                               00278   
ASKU02  DFHMDF POS=(10,66),                                            X00279   
               LENGTH=08,                                              X00280   
               ATTRB=(ASKIP,NORM),                                     X00281   
               COLOR=BLUE                                               00282   
ASTAT02 DFHMDF POS=(10,76),                                            X00283   
               LENGTH=2,                                               X00284   
               ATTRB=(ASKIP,NORM),                                     X00285   
               COLOR=BLUE                                               00286   
*                                                                       00287   
ASEL03  DFHMDF POS=(11,02),                                            X00288   
               LENGTH=01,                                              X00289   
               ATTRB=(UNPROT,NORM),                                    X00290   
               HILIGHT=UNDERLINE,                                      X00291   
               COLOR=GREEN                                              00292   
AQTY03  DFHMDF POS=(11,04),                                            X00293   
               LENGTH=06,                                              X00294   
               ATTRB=(UNPROT,NORM,NUM),                                X00295   
               HILIGHT=UNDERLINE,                                      X00296   
               COLOR=GREEN                                              00297   
ALINE03 DFHMDF POS=(11,11),                                            X00298   
               LENGTH=04,                                              X00299   
               ATTRB=(ASKIP,NORM),                                     X00300   
               COLOR=BLUE                                               00301   
ASTYL03 DFHMDF POS=(11,16),                                            X00302   
               LENGTH=20,                                              X00303   
               ATTRB=(ASKIP,NORM),                                     X00304   
               COLOR=BLUE                                               00305   
ACLR03  DFHMDF POS=(11,37),                                            X00306   
               LENGTH=25,                                              X00307   
               ATTRB=(ASKIP,NORM),                                     X00308   
               COLOR=BLUE                                               00309   
AOTR03  DFHMDF POS=(11,63),                                            X00310   
               LENGTH=06,                                              X00311   
               ATTRB=(ASKIP,NORM),                                     X00312   
               COLOR=BLUE                                               00313   
ACOST03 DFHMDF POS=(11,70),                                            X00314   
               LENGTH=10,                                              X00315   
               ATTRB=(ASKIP,NORM),                                     X00316   
               COLOR=BLUE                                               00317   
*                                                                       00318   
ADESC03 DFHMDF POS=(12,16),                                            X00319   
               LENGTH=20,                                              X00320   
               ATTRB=(ASKIP,NORM),                                     X00321   
               COLOR=BLUE                                               00322   
ASIZE03 DFHMDF POS=(12,37),                                            X00323   
               LENGTH=25,                                              X00324   
               ATTRB=(ASKIP,NORM),                                     X00325   
               COLOR=BLUE                                               00326   
ACL03   DFHMDF POS=(12,63),                                            X00327   
               LENGTH=02,                                              X00328   
               ATTRB=(ASKIP,NORM),                                     X00329   
               COLOR=BLUE                                               00330   
ASKU03  DFHMDF POS=(12,66),                                            X00331   
               LENGTH=08,                                              X00332   
               ATTRB=(ASKIP,NORM),                                     X00333   
               COLOR=BLUE                                               00334   
ASTAT03 DFHMDF POS=(12,76),                                            X00335   
               LENGTH=2,                                               X00336   
               ATTRB=(ASKIP,NORM),                                     X00337   
               COLOR=BLUE                                               00338   
*                                                                       00339   
ASEL04  DFHMDF POS=(13,02),                                            X00340   
               LENGTH=01,                                              X00341   
               ATTRB=(UNPROT,NORM),                                    X00342   
               HILIGHT=UNDERLINE,                                      X00343   
               COLOR=GREEN                                              00344   
AQTY04  DFHMDF POS=(13,04),                                            X00345   
               LENGTH=06,                                              X00346   
               ATTRB=(UNPROT,NORM,NUM),                                X00347   
               HILIGHT=UNDERLINE,                                      X00348   
               COLOR=GREEN                                              00349   
ALINE04 DFHMDF POS=(13,11),                                            X00350   
               LENGTH=04,                                              X00351   
               ATTRB=(ASKIP,NORM),                                     X00352   
               COLOR=BLUE                                               00353   
ASTYL04 DFHMDF POS=(13,16),                                            X00354   
               LENGTH=20,                                              X00355   
               ATTRB=(ASKIP,NORM),                                     X00356   
               COLOR=BLUE                                               00357   
ACLR04  DFHMDF POS=(13,37),                                            X00358   
               LENGTH=25,                                              X00359   
               ATTRB=(ASKIP,NORM),                                     X00360   
               COLOR=BLUE                                               00361   
AOTR04  DFHMDF POS=(13,63),                                            X00362   
               LENGTH=06,                                              X00363   
               ATTRB=(ASKIP,NORM),                                     X00364   
               COLOR=BLUE                                               00365   
ACOST04 DFHMDF POS=(13,70),                                            X00366   
               LENGTH=10,                                              X00367   
               ATTRB=(ASKIP,NORM),                                     X00368   
               COLOR=BLUE                                               00369   
*                                                                       00370   
ADESC04 DFHMDF POS=(14,16),                                            X00371   
               LENGTH=20,                                              X00372   
               ATTRB=(ASKIP,NORM),                                     X00373   
               COLOR=BLUE                                               00374   
ASIZE04 DFHMDF POS=(14,37),                                            X00375   
               LENGTH=25,                                              X00376   
               ATTRB=(ASKIP,NORM),                                     X00377   
               COLOR=BLUE                                               00378   
ACL04   DFHMDF POS=(14,63),                                            X00379   
               LENGTH=02,                                              X00380   
               ATTRB=(ASKIP,NORM),                                     X00381   
               COLOR=BLUE                                               00382   
ASKU04  DFHMDF POS=(14,66),                                            X00383   
               LENGTH=08,                                              X00384   
               ATTRB=(ASKIP,NORM),                                     X00385   
               COLOR=BLUE                                               00386   
ASTAT04 DFHMDF POS=(14,76),                                            X00387   
               LENGTH=2,                                               X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               COLOR=BLUE                                               00390   
*                                                                       00391   
ASEL05  DFHMDF POS=(15,02),                                            X00392   
               LENGTH=01,                                              X00393   
               ATTRB=(UNPROT,NORM),                                    X00394   
               HILIGHT=UNDERLINE,                                      X00395   
               COLOR=GREEN                                              00396   
AQTY05  DFHMDF POS=(15,04),                                            X00397   
               LENGTH=06,                                              X00398   
               ATTRB=(UNPROT,NORM,NUM),                                X00399   
               HILIGHT=UNDERLINE,                                      X00400   
               COLOR=GREEN                                              00401   
ALINE05 DFHMDF POS=(15,11),                                            X00402   
               LENGTH=04,                                              X00403   
               ATTRB=(ASKIP,NORM),                                     X00404   
               COLOR=BLUE                                               00405   
ASTYL05 DFHMDF POS=(15,16),                                            X00406   
               LENGTH=20,                                              X00407   
               ATTRB=(ASKIP,NORM),                                     X00408   
               COLOR=BLUE                                               00409   
ACLR05  DFHMDF POS=(15,37),                                            X00410   
               LENGTH=25,                                              X00411   
               ATTRB=(ASKIP,NORM),                                     X00412   
               COLOR=BLUE                                               00413   
AOTR05  DFHMDF POS=(15,63),                                            X00414   
               LENGTH=06,                                              X00415   
               ATTRB=(ASKIP,NORM),                                     X00416   
               COLOR=BLUE                                               00417   
ACOST05 DFHMDF POS=(15,70),                                            X00418   
               LENGTH=10,                                              X00419   
               ATTRB=(ASKIP,NORM),                                     X00420   
               COLOR=BLUE                                               00421   
*                                                                       00422   
ADESC05 DFHMDF POS=(16,16),                                            X00423   
               LENGTH=20,                                              X00424   
               ATTRB=(ASKIP,NORM),                                     X00425   
               COLOR=BLUE                                               00426   
ASIZE05 DFHMDF POS=(16,37),                                            X00427   
               LENGTH=25,                                              X00428   
               ATTRB=(ASKIP,NORM),                                     X00429   
               COLOR=BLUE                                               00430   
ACL05   DFHMDF POS=(16,63),                                            X00431   
               LENGTH=02,                                              X00432   
               ATTRB=(ASKIP,NORM),                                     X00433   
               COLOR=BLUE                                               00434   
ASKU05  DFHMDF POS=(16,66),                                            X00435   
               LENGTH=08,                                              X00436   
               ATTRB=(ASKIP,NORM),                                     X00437   
               COLOR=BLUE                                               00438   
ASTAT05 DFHMDF POS=(16,76),                                            X00439   
               LENGTH=2,                                               X00440   
               ATTRB=(ASKIP,NORM),                                     X00441   
               COLOR=BLUE                                               00442   
*                                                                       00443   
ASEL06  DFHMDF POS=(17,02),                                            X00444   
               LENGTH=01,                                              X00445   
               ATTRB=(UNPROT,NORM),                                    X00446   
               HILIGHT=UNDERLINE,                                      X00447   
               COLOR=GREEN                                              00448   
AQTY06  DFHMDF POS=(17,04),                                            X00449   
               LENGTH=06,                                              X00450   
               ATTRB=(UNPROT,NORM,NUM),                                X00451   
               HILIGHT=UNDERLINE,                                      X00452   
               COLOR=GREEN                                              00453   
ALINE06 DFHMDF POS=(17,11),                                            X00454   
               LENGTH=04,                                              X00455   
               ATTRB=(ASKIP,NORM),                                     X00456   
               COLOR=BLUE                                               00457   
ASTYL06 DFHMDF POS=(17,16),                                            X00458   
               LENGTH=20,                                              X00459   
               ATTRB=(ASKIP,NORM),                                     X00460   
               COLOR=BLUE                                               00461   
ACLR06  DFHMDF POS=(17,37),                                            X00462   
               LENGTH=25,                                              X00463   
               ATTRB=(ASKIP,NORM),                                     X00464   
               COLOR=BLUE                                               00465   
AOTR06  DFHMDF POS=(17,63),                                            X00466   
               LENGTH=06,                                              X00467   
               ATTRB=(ASKIP,NORM),                                     X00468   
               COLOR=BLUE                                               00469   
ACOST06 DFHMDF POS=(17,70),                                            X00470   
               LENGTH=10,                                              X00471   
               ATTRB=(ASKIP,NORM),                                     X00472   
               COLOR=BLUE                                               00473   
*                                                                       00474   
ADESC06 DFHMDF POS=(18,16),                                            X00475   
               LENGTH=20,                                              X00476   
               ATTRB=(ASKIP,NORM),                                     X00477   
               COLOR=BLUE                                               00478   
ASIZE06 DFHMDF POS=(18,37),                                            X00479   
               LENGTH=25,                                              X00480   
               ATTRB=(ASKIP,NORM),                                     X00481   
               COLOR=BLUE                                               00482   
ACL06   DFHMDF POS=(18,63),                                            X00483   
               LENGTH=02,                                              X00484   
               ATTRB=(ASKIP,NORM),                                     X00485   
               COLOR=BLUE                                               00486   
ASKU06  DFHMDF POS=(18,66),                                            X00487   
               LENGTH=08,                                              X00488   
               ATTRB=(ASKIP,NORM),                                     X00489   
               COLOR=BLUE                                               00490   
ASTAT06 DFHMDF POS=(18,76),                                            X00491   
               LENGTH=2,                                               X00492   
               ATTRB=(ASKIP,NORM),                                     X00493   
               COLOR=BLUE                                               00494   
*                                                                       00495   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00496   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00497   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00498   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00499   
**************                                                          00500   
        DFHMSD TYPE=FINAL                                               00501   
**************                                                          00502   
        END                                                             00503   
