*          DATA SET RCKM214    AT LEVEL 007 AS OF 11/17/95                      
*          DATA SET RCKM214    AT LEVEL 001 AS OF 07/17/95              00001   
*          DATA SET RCKM214    AT LEVEL 001 AS OF 07/11/95              00002   
*          DATA SET RCKM214    AT LEVEL 007 AS OF 07/05/95              00003   
*          DATA SET RCKM214A1  AT LEVEL 006 AS OF 06/15/95              00004   
*          DATA SET RCKM214    AT LEVEL 025 AS OF 02/21/94              00005   
*          DATA SET RCKM214                                             00006   
  PRINT  NOGEN                                                          00007   
*-------------------------------------------------------------------*   00008   
*                                                                   *   00009   
*        MAPSET  RCKM214                                            *   00010   
*        MAP     RC214A                                             *   00011   
*        PROGRAM RCKCS214                                           *   00012   
*        TRANSID E214 - PACK SLIP HEADER ADD/DELETE/UPDATE          *   00013   
*        SYSTEM  RC RECEIVING                                       *   00014   
*                                                                   *   00015   
*-------------------------------------------------------------------*   00016   
RCKM214 DFHMSD TYPE=MAP,                                               X00017   
               MODE=INOUT,                                             X00018   
               LANG=COBOL,                                             X00019   
               TIOAPFX=YES,                                            X00020   
               CTRL=(FREEKB)                                            00021   
RC214A  DFHMDI LINE=2,COLUMN=1,                                        X00022   
               SIZE=(19,80),                                           X00023   
               MAPATTS=(COLOR,HILIGHT),                                X00024   
               DSATTS=(COLOR,HILIGHT)                                   00025   
*                                                                       00026   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00027   
               INITIAL='OPERATING ID.:',                               X00028   
               LENGTH=14,                                              X00029   
               COLOR=NEUTRAL,                                          X00030   
               POS=(03,01)                                              00031   
AOPER   DFHMDF ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=4,                                               X00033   
               COLOR=BLUE,                                             X00034   
               POS=(03,16)                                              00035   
        DFHMDF ATTRB=(ASKIP),                                          X00036   
               LENGTH=1,                                               X00037   
               COLOR=NEUTRAL,                                          X00038   
               POS=(03,21)                                              00039   
AFDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00040   
               LENGTH=30,                                              X00041   
               COLOR=BLUE,                                             X00042   
               POS=(03,28)                                              00043   
*                                                                       00044   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00045   
               INITIAL='FACILITY ID..:',                               X00046   
               LENGTH=14,                                              X00047   
               COLOR=NEUTRAL,                                          X00048   
               POS=(04,01)                                              00049   
AFCLTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00050   
               LENGTH=4,                                               X00051   
               COLOR=BLUE,                                             X00052   
               POS=(04,16)                                              00053   
*                                                                       00054   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00055   
               INITIAL='PO NUMBER....:',                               X00056   
               LENGTH=14,                                              X00057   
               COLOR=NEUTRAL,                                          X00058   
               POS=(05,01)                                              00059   
APO     DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00060   
               LENGTH=8,                                               X00061   
               COLOR=GREEN,                                            X00062   
               HILIGHT=UNDERLINE,                                      X00063   
               POS=(05,16)                                              00064   
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=0,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(05,25)                                              00068   
*                                                                       00069   
ATRBL   DFHMDF ATTRB=(PROT,NORM),                                      X00070   
               LENGTH=30,                                              X00071   
               COLOR=NEUTRAL,                                          X00072   
               POS=(05,26)                                              00073   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00075   
               INITIAL='STORE DEST...:',                               X00076   
               LENGTH=14,                                              X00077   
               COLOR=NEUTRAL,                                          X00078   
               POS=(06,01)                                              00079   
ASTR    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00080   
               LENGTH=04,                                              X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               POS=(06,16)                                              00084   
        DFHMDF ATTRB=(ASKIP),                                          X00085   
               LENGTH=1,                                               X00086   
               COLOR=NEUTRAL,                                          X00087   
               POS=(06,21)                                              00088   
ASDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00089   
               LENGTH=10,                                              X00090   
               COLOR=BLUE,                                             X00091   
               POS=(06,28)                                              00092   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00093   
               INITIAL='SHIPMENT LEVEL INFO',                          X00094   
               LENGTH=19,                                              X00095   
               COLOR=NEUTRAL,                                          X00096   
               POS=(06,57)                                              00097   
*                                                                       00098   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00099   
               INITIAL='PACK SLIP NBR:',                               X00100   
               LENGTH=14,                                              X00101   
               COLOR=NEUTRAL,                                          X00102   
               POS=(07,01)                                              00103   
APKSLIP DFHMDF ATTRB=(UNPROT,NORM),                                    X00104   
               LENGTH=10,                                              X00105   
               COLOR=GREEN,                                            X00106   
               HILIGHT=UNDERLINE,                                      X00107   
               POS=(07,16)                                              00108   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00113**3
               INITIAL=' PAGES:',                                      X00114**3
               LENGTH=07,                                              X00115**3
               COLOR=NEUTRAL,                                          X00116**3
               POS=(07,27)                                              00117**7
APAGES  DFHMDF ATTRB=(UNPROT,NORM),                                    X00118**3
               LENGTH=4,                                               X00119**5
               COLOR=GREEN,                                            X00120**3
               HILIGHT=UNDERLINE,                                      X00121**3
               POS=(07,35)                                              00122**7
        DFHMDF ATTRB=(ASKIP),                                          X00123**3
               LENGTH=1,                                               X00124**3
               COLOR=NEUTRAL,                                          X00125**3
               POS=(07,40)                                              00126**7
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00127   
               INITIAL='********************************',             X00128   
               LENGTH=32,                                              X00129   
               COLOR=NEUTRAL,                                          X00130   
               POS=(07,48)                                              00131   
*                                                                       00132   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00133   
               INITIAL='FREIGHT BILL.:',                               X00134   
               LENGTH=14,                                              X00135   
               COLOR=NEUTRAL,                                          X00136   
               POS=(08,01)                                              00137   
APRO    DFHMDF ATTRB=(UNPROT,NORM),                                    X00138   
               LENGTH=16,                                              X00139   
               COLOR=GREEN,                                            X00140   
               HILIGHT=UNDERLINE,                                      X00141   
               POS=(08,16)                                              00142   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00143   
               INITIAL='*',                                            X00144   
               LENGTH=01,                                              X00145   
               COLOR=NEUTRAL,                                          X00146   
               POS=(08,48)                                              00147   
ASHPPRO DFHMDF ATTRB=(ASKIP,BRT),                                      X00148   
               LENGTH=30,                                              X00149   
               COLOR=BLUE,                                             X00150   
               POS=(08,50)                                              00151   
*                                                                       00152   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00153   
               INITIAL='CARTON COUNT.:',                               X00154   
               LENGTH=14,                                              X00155   
               COLOR=NEUTRAL,                                          X00156   
               POS=(09,01)                                              00157   
ACRTN   DFHMDF ATTRB=(UNPROT,NORM),                                    X00158   
               LENGTH=06,                                              X00159   
               COLOR=GREEN,                                            X00160   
               HILIGHT=UNDERLINE,                                      X00161   
               PICOUT='ZZZZZ9',                                        X00162   
               POS=(09,16)                                              00163   
        DFHMDF ATTRB=(ASKIP),                                          X00164   
               LENGTH=1,                                               X00165   
               COLOR=NEUTRAL,                                          X00166   
               POS=(09,23)                                              00167   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00168   
               INITIAL='*',                                            X00169   
               LENGTH=01,                                              X00170   
               COLOR=NEUTRAL,                                          X00171   
               POS=(09,48)                                              00172   
ASHCRTN DFHMDF ATTRB=(ASKIP,BRT),                                      X00173   
               LENGTH=06,                                              X00174   
               COLOR=BLUE,                                             X00175   
               PICOUT='ZZZZZ9',                                        X00176   
               POS=(09,62)                                              00177   
*                                                                       00178   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00179   
               INITIAL='RCVR SEQ NO..:',                               X00180   
               LENGTH=14,                                              X00181   
               COLOR=NEUTRAL,                                          X00182   
               POS=(10,01)                                              00183   
ARECSEQ DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00184   
               LENGTH=04,                                              X00185   
               COLOR=GREEN,                                            X00186   
               HILIGHT=UNDERLINE,                                      X00187   
               POS=(10,16)                                              00188   
        DFHMDF ATTRB=(ASKIP),                                          X00189   
               LENGTH=1,                                               X00190   
               COLOR=NEUTRAL,                                          X00191   
               POS=(10,21)                                              00192   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00193   
               INITIAL='*',                                            X00194   
               LENGTH=01,                                              X00195   
               COLOR=NEUTRAL,                                          X00196   
               POS=(10,48)                                              00197   
*                                                                       00198   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00199   
               INITIAL='ASN NUMBER...:',                               X00200   
               LENGTH=14,                                              X00201   
               COLOR=NEUTRAL,                                          X00202   
               POS=(11,01)                                              00203   
ASNBR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00204   
               LENGTH=30,                                              X00205   
               COLOR=BLUE,                                             X00206   
               POS=(11,16)                                              00207   
        DFHMDF ATTRB=(ASKIP),                                          X00208   
               LENGTH=0,                                               X00209   
               COLOR=NEUTRAL,                                          X00210   
               POS=(11,47)                                              00211   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00212   
               INITIAL='*',                                            X00213   
               LENGTH=01,                                              X00214   
               COLOR=NEUTRAL,                                          X00215   
               POS=(11,48)                                              00216   
*                                                                       00217   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00218   
               INITIAL='BILL OF LADNG:',                               X00219   
               LENGTH=14,                                              X00220   
               COLOR=NEUTRAL,                                          X00221   
               POS=(12,01)                                              00222   
ABOL    DFHMDF ATTRB=(UNPROT,NORM),                                    X00223   
               LENGTH=16,                                              X00224   
               COLOR=GREEN,                                            X00225   
               HILIGHT=UNDERLINE,                                      X00226   
               POS=(12,16)                                              00227   
        DFHMDF ATTRB=(ASKIP),                                          X00228   
               LENGTH=1,                                               X00229   
               COLOR=NEUTRAL,                                          X00230   
               POS=(12,39)                                              00231   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00232   
               INITIAL='*',                                            X00233   
               LENGTH=01,                                              X00234   
               COLOR=NEUTRAL,                                          X00235   
               POS=(12,48)                                              00236   
ASHPBOL DFHMDF ATTRB=(ASKIP,BRT),                                      X00237   
               LENGTH=22,                                              X00238   
               COLOR=BLUE,                                             X00239   
               POS=(12,54)                                              00240   
*                                                                       00241   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00242   
               INITIAL='PRE-RCPT INFO:',                               X00243   
               LENGTH=14,                                              X00244   
               COLOR=NEUTRAL,                                          X00245   
               POS=(13,01)                                              00246   
ASRC    DFHMDF ATTRB=(UNPROT,NORM),                                    X00247   
               LENGTH=04,                                              X00248   
               COLOR=GREEN,                                            X00249   
               HILIGHT=UNDERLINE,                                      X00250   
               POS=(13,16)                                              00251   
        DFHMDF ATTRB=(ASKIP),                                          X00252   
               LENGTH=1,                                               X00253   
               COLOR=NEUTRAL,                                          X00254   
               POS=(13,21)                                              00255   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00256   
               INITIAL='********************************',             X00257   
               LENGTH=32,                                              X00258   
               COLOR=NEUTRAL,                                          X00259   
               POS=(13,48)                                              00260   
*                                                                       00261   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00262   
               INITIAL='STATUS.......:',                               X00263   
               LENGTH=14,                                              X00264   
               COLOR=NEUTRAL,                                          X00265   
               POS=(14,01)                                              00266   
ASTAT   DFHMDF ATTRB=(ASKIP,NORM),                                     X00267   
               LENGTH=02,                                              X00268   
               COLOR=BLUE,                                             X00269   
               POS=(14,16)                                              00270   
        DFHMDF ATTRB=(ASKIP),                                          X00271   
               LENGTH=1,                                               X00272   
               COLOR=NEUTRAL,                                          X00273   
               POS=(14,19)                                              00274   
ASTDESC DFHMDF ATTRB=(ASKIP,NORM),                                     X00275   
               LENGTH=10,                                              X00276   
               COLOR=BLUE,                                             X00277   
               POS=(14,28)                                              00278   
*                                                                       00279   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00280   
               INITIAL='ORIGIN SCAC..:',                               X00281   
               LENGTH=14,                                              X00282   
               COLOR=NEUTRAL,                                          X00283   
               POS=(15,01)                                              00284   
AOSCAC  DFHMDF ATTRB=(UNPROT,NORM),                                    X00285   
               LENGTH=04,                                              X00286   
               COLOR=GREEN,                                            X00287   
               HILIGHT=UNDERLINE,                                      X00288   
               POS=(15,16)                                              00289   
        DFHMDF ATTRB=(ASKIP),                                          X00290   
               LENGTH=1,                                               X00291   
               COLOR=NEUTRAL,                                          X00292   
               POS=(15,21)                                              00293   
ASCACDS DFHMDF ATTRB=(ASKIP,NORM),                                     X00294   
               LENGTH=20,                                              X00295   
               COLOR=BLUE,                                             X00296   
               POS=(15,28)                                              00297   
*                                                                       00298   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00299   
               INITIAL='VENDR SHP DTE:',                               X00300   
               LENGTH=14,                                              X00301   
               COLOR=NEUTRAL,                                          X00302   
               POS=(16,01)                                              00303   
AVSHPDT DFHMDF ATTRB=(UNPROT,NORM),                                    X00304   
               LENGTH=08,                                              X00305   
               COLOR=GREEN,                                            X00306   
               HILIGHT=UNDERLINE,                                      X00307   
               POS=(16,16)                                              00308   
        DFHMDF ATTRB=(ASKIP),                                          X00309   
               LENGTH=1,                                               X00310   
               COLOR=NEUTRAL,                                          X00311   
               POS=(16,25)                                              00312   
*                                                                       00313   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00299   
               INITIAL='CONTAINER....:',                               X00300   
               LENGTH=14,                                              X00301   
               COLOR=NEUTRAL,                                          X00302   
               POS=(17,01)                                              00303   
ACONTNR DFHMDF ATTRB=(UNPROT,NORM),                                    X00304   
               LENGTH=12,                                              X00305   
               COLOR=GREEN,                                            X00306   
               HILIGHT=UNDERLINE,                                      X00307   
               POS=(17,16)                                              00308   
        DFHMDF ATTRB=(ASKIP),                                          X00309   
               LENGTH=1,                                               X00310   
               COLOR=NEUTRAL,                                          X00311   
               POS=(17,29)                                              00312   
*                                                                       00313   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00314   
               INITIAL='CREATED BY...:',                               X00315   
               LENGTH=14,                                              X00316   
               COLOR=NEUTRAL,                                          X00317   
               POS=(18,01)                                              00318   
ACRTBY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00319   
               LENGTH=08,                                              X00320   
               COLOR=BLUE,                                             X00321   
               POS=(18,16)                                              00322   
ACRTDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=10,                                              X00324   
               COLOR=BLUE,                                             X00325   
               POS=(18,29)                                              00326   
ACRTTME DFHMDF ATTRB=(ASKIP,NORM),                                     X00327   
               LENGTH=05,                                              X00328   
               COLOR=BLUE,                                             X00329   
               POS=(18,40)                                              00330   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00314   
               INITIAL='# OF SSCC:',                                   X00315   
               LENGTH=10,                                              X00316   
               COLOR=NEUTRAL,                                          X00317   
               POS=(18,55)                                              00318   
ASSCC   DFHMDF ATTRB=(ASKIP,NORM),                                     X00160*12
               LENGTH=05,                                              X00161*12
               COLOR=BLUE,                                             X00163*12
               POS=(18,67),                                            X        
               PICOUT='ZZZZ9'                                           00164*12
*                                                                       00331   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00332   
               INITIAL='LAST UPDAT BY:',                               X00333   
               LENGTH=14,                                              X00334   
               COLOR=NEUTRAL,                                          X00335   
               POS=(19,01)                                              00336   
ALSTBY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00337   
               LENGTH=08,                                              X00338   
               COLOR=BLUE,                                             X00339   
               POS=(19,16)                                              00340   
ALSTDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00341   
               LENGTH=10,                                              X00342   
               COLOR=BLUE,                                             X00343   
               POS=(19,29)                                              00344   
ALSTTME DFHMDF ATTRB=(ASKIP,NORM),                                     X00345   
               LENGTH=05,                                              X00346   
               COLOR=BLUE,                                             X00347   
               POS=(19,40)                                              00348   
*                                                                       00349   
         DFHMSD TYPE=FINAL                                              00350   
         END                                                            00351   
