*          DATA SET RCKM220    AT LEVEL 001 AS OF 06/24/94                      
*          DATA SET RCKM220    AT LEVEL 005 AS OF 06/09/94              00001   
*          DATA SET RCKM220    AT LEVEL 008 AS OF 03/30/94              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM220                                            *   00006   
*        MAP     RC220A                                             *   00007   
*        PROGRAM RCKCS220                                           *   00008   
*        TRANSID E220 - VERIFY BY LINE LIST                         *   00009   
*        SYSTEM  CICS ARCHITECTURE                                  *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM220 DFHMSD TYPE=MAP,                                               X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               TIOAPFX=YES,                                            X00016   
               CTRL=(FREEKB)                                            00017   
RC220A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00023   
               INITIAL='RCVR NO:',                                     X00024   
               LENGTH=8,                                               X00025   
               COLOR=NEUTRAL,                                          X00026   
               POS=(02,02)                                              00027   
ARCVNBR DFHMDF ATTRB=(ASKIP),                                          X00028   
               LENGTH=8,                                               X00029   
               PICOUT='99999999',                                      X00030   
               COLOR=BLUE,                                             X00031   
               POS=(02,11)                                              00032   
ARCVSEQ DFHMDF ATTRB=(ASKIP),                                          X00033   
               LENGTH=4,                                               X00034   
               PICOUT='9999',                                          X00035   
               COLOR=BLUE,                                             X00036   
               POS=(02,20)                                              00037   
*                                                                       00038   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00039   
               INITIAL='OP ID:',                                       X00040   
               LENGTH=6,                                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               POS=(02,31)                                              00043   
*                                                                       00044   
AOPER   DFHMDF ATTRB=(ASKIP),                                          X00045   
               LENGTH=4,                                               X00046   
               COLOR=BLUE,                                             X00047   
               PICOUT='ZZZ9',                                          X00048   
               POS=(02,38)                                              00049   
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00050   
               LENGTH=4,                                               X00051   
               COLOR=BLUE,                                             X00052   
               PICOUT='9999',                                          X00053   
               POS=(02,43)                                              00054   
AFCLNAM DFHMDF ATTRB=(ASKIP),                                          X00055   
               LENGTH=25,                                              X00056   
               COLOR=BLUE,                                             X00057   
               POS=(02,49)                                              00058   
*                                                                       00059   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR PCKSLP QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(03,02)                                              00064   
ARCVPCK DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZZ',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(03,20)                                              00069   
*                                                                       00059   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR ACTUAL QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(04,02)                                              00064   
ARCVACT DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZZ',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(04,20)                                              00069   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR STATUS:',                                 X00061   
               LENGTH=12,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(04,31)                                              00064   
ARCVSTA DFHMDF ATTRB=(ASKIP),                                          X00070   
               LENGTH=2,                                               X00071   
               COLOR=BLUE,                                             X00072   
               POS=(04,45)                                              00073   
ARCVFYA DFHMDF ATTRB=(ASKIP),                                          X00070   
               LENGTH=29,                                              X00071   
               COLOR=BLUE,                                             X00072   
               POS=(04,49)                                              00073   
*                                                                       00059   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR VERFYD QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(05,02)                                              00064   
ARCVVER DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZ9',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(05,20)                                              00069   
*-------------------------------------------------------------------*           
* ADDED DEPT : AT THE HEADER.                      WR # 230ZZ       *           
*-------------------------------------------------------------------*           
        DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DEPT:',                                        X        
               LENGTH=05,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(05,31)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=03,                                              X        
               COLOR=BLUE,                                             X        
               POS=(05,37)                                                      
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00074   
               INITIAL='ITEMS',                                        X00075   
               COLOR=NEUTRAL,                                          X00076   
               LENGTH=5,                                               X00077   
               POS=(05,44)                                              00078   
*                                                                       00079   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00080   
               JUSTIFY=(LEFT,BLANK),                                   X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               PICOUT='ZZZZZ',                                         X00084   
               LENGTH=5,                                               X00085   
               POS=(05,51)                                              00086   
*                                                                       00087   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00088   
               INITIAL='TO',                                           X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=2,                                               X00091   
               POS=(05,57)                                              00092   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00093   
               JUSTIFY=(LEFT,BLANK),                                   X00094   
               COLOR=BLUE,                                             X00095   
               PICOUT='ZZZZZ',                                         X00096   
               LENGTH=5,                                               X00097   
               POS=(05,60)                                              00098   
*                                                                       00099   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00100   
               INITIAL='OF',                                           X00101   
               COLOR=NEUTRAL,                                          X00102   
               LENGTH=2,                                               X00103   
               POS=(05,66)                                              00104   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00105   
               JUSTIFY=(LEFT,BLANK),                                   X00106   
               COLOR=BLUE,                                             X00107   
               PICOUT='ZZZZZ',                                         X00108   
               LENGTH=5,                                               X00109   
               POS=(05,69)                                              00110   
*                                                                       00111   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00112   
               INITIAL='STATUS',                                       X00113   
               LENGTH=6,                                               X00114   
               COLOR=NEUTRAL,                                          X00115   
               POS=(07,23)                                              00116   
*                                                                       00111   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00112   
               INITIAL='PCKSLP CURRENT  VERFYD',                       X00113   
               LENGTH=22,                                              X00114   
               COLOR=NEUTRAL,                                          X00115   
               POS=(07,44)                                              00116   
*                                                                       00117   
AVERIT   DFHMDF ATTRB=(ASKIP),                                         X00105   
               JUSTIFY=(LEFT,BLANK),                                   X00106   
               COLOR=NEUTRAL,                                          X00107   
               LENGTH=8,                                               X00109   
               POS=(07,69)                                              00110   
*                                                                       00111   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00118   
               INITIAL='SEL  ACT',                                     X00119   
               COLOR=NEUTRAL,                                          X00120   
               LENGTH=8,                                               X00121   
               POS=(08,2)                                               00122   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00123   
               INITIAL='LNE NO',                                       X00124   
               COLOR=NEUTRAL,                                          X00125   
               LENGTH=6,                                               X00126   
               POS=(08,13)                                              00127   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00128   
               INITIAL=' CODE ',                                       X00129   
               COLOR=NEUTRAL,                                          X00130   
               LENGTH=6,                                               X00131   
               POS=(08,23)                                              00132   
*-------------------------------------------------------------------*           
* LENGTH OF THE SKU IS CHANGED FROM 10 TO 11 THROUGH OUT THE MAP    *           
*                                                     WR # 230ZZ    *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00133   
               INITIAL='CL SKU',                                       X00134   
               COLOR=NEUTRAL,                                          X00135   
               LENGTH=06,                                              X00136   
               POS=(08,30)                                              00137   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*                                                                       00143   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00138   
               INITIAL='  QTY     QTY     QTY',                        X00139   
               COLOR=NEUTRAL,                                          X00140   
               LENGTH=21,                                              X00141   
               POS=(08,43)                                              00142   
*                                                                       00143   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00138   
               INITIAL='VERFYD SRC',                                   X00139   
               COLOR=NEUTRAL,                                          X00140   
               LENGTH=10,                                              X00141   
               POS=(08,67)                                              00142   
*                                                                       00143   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(09,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(09,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(09,8)                                               00157   
*                                                                       00158   
ALNE01   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(09,15)                                              00162   
*                                                                       00163   
ASTAT01  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(09,25)                                              00167   
*                                                                       00173   
ASKU01   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(09,30)                                              00177   
*                                                                       00168   
APCKQ01  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(09,42)                                              00172   
*                                                                       00168   
AACTQ01  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(09,50)                                              00172   
*                                                                       00168   
AVFYQ01  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(09,58)                                              00172   
*                                                                       00168   
AVFYS01  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(09,69)                                              00172   
*                                                                       00143   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(10,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(10,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(10,8)                                               00157   
*                                                                       00158   
ALNE02   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(10,15)                                              00162   
*                                                                       00163   
ASTAT02  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(10,25)                                              00167   
*                                                                       00173   
ASKU02   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(10,30)                                              00177   
*                                                                       00168   
APCKQ02  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(10,42)                                              00172   
*                                                                       00168   
AACTQ02  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(10,50)                                              00172   
*                                                                       00168   
AVFYQ02  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(10,58)                                              00172   
*                                                                       00178   
AVFYS02  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(10,69)                                              00172   
*                                                                       00168   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(11,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(11,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(11,8)                                               00157   
*                                                                       00158   
ALNE03   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(11,15)                                              00162   
*                                                                       00163   
ASTAT03  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(11,25)                                              00167   
*                                                                       00173   
ASKU03   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(11,30)                                              00177   
*                                                                       00168   
APCKQ03  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(11,42)                                              00172   
*                                                                       00168   
AACTQ03  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(11,50)                                              00172   
*                                                                       00168   
AVFYQ03  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(11,58)                                              00172   
*                                                                       00178   
AVFYS03  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(11,69)                                              00172   
*                                                                       00178   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(12,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(12,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(12,8)                                               00157   
*                                                                       00158   
ALNE04   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(12,15)                                              00162   
*                                                                       00163   
ASTAT04  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(12,25)                                              00167   
*                                                                       00173   
ASKU04   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(12,30)                                              00177   
*                                                                       00168   
APCKQ04  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(12,42)                                              00172   
*                                                                       00168   
AACTQ04  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(12,50)                                              00172   
*                                                                       00168   
AVFYQ04  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(12,58)                                              00172   
*                                                                       00168   
AVFYS04  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(12,69)                                              00172   
*                                                                       00178   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(13,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(13,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(13,8)                                               00157   
*                                                                       00158   
ALNE05   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(13,15)                                              00162   
*                                                                       00163   
ASTAT05  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(13,25)                                              00167   
*                                                                       00173   
ASKU05   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(13,30)                                              00177   
*                                                                       00168   
APCKQ05  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(13,42)                                              00172   
*                                                                       00168   
AACTQ05  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(13,50)                                              00172   
*                                                                       00168   
AVFYQ05  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(13,58)                                              00172   
*                                                                       00168   
AVFYS05  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(13,69)                                              00172   
*                                                                       00168   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(14,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(14,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(14,8)                                               00157   
*                                                                       00158   
ALNE06   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(14,15)                                              00162   
*                                                                       00163   
ASTAT06  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(14,25)                                              00167   
*                                                                       00173   
ASKU06   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(14,30)                                              00177   
*                                                                       00168   
APCKQ06  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(14,42)                                              00172   
*                                                                       00168   
AACTQ06  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(14,50)                                              00172   
*                                                                       00168   
AVFYQ06  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(14,58)                                              00172   
*                                                                       00168   
AVFYS06  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(14,69)                                              00172   
*                                                                       00178   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(15,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(15,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(15,8)                                               00157   
*                                                                       00158   
ALNE07   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(15,15)                                              00162   
*                                                                       00163   
ASTAT07  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(15,25)                                              00167   
*                                                                       00173   
ASKU07   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(15,30)                                              00177   
*                                                                       00168   
APCKQ07  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(15,42)                                              00172   
*                                                                       00168   
AACTQ07  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(15,50)                                              00172   
*                                                                       00168   
AVFYQ07  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(15,58)                                              00172   
*                                                                       00168   
AVFYS07  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(15,69)                                              00172   
*                                                                       00178   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(16,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(16,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(16,8)                                               00157   
*                                                                       00158   
ALNE08   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(16,15)                                              00162   
*                                                                       00163   
ASTAT08  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(16,25)                                              00167   
*                                                                       00173   
ASKU08   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(16,30)                                              00177   
*                                                                       00168   
APCKQ08  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(16,42)                                              00172   
*                                                                       00168   
AACTQ08  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(16,50)                                              00172   
*                                                                       00168   
AVFYQ08  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(16,58)                                              00172   
*                                                                       00168   
AVFYS08  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(16,69)                                              00172   
*                                                                       00178   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(17,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(17,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(17,8)                                               00157   
*                                                                       00158   
ALNE09   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(17,15)                                              00162   
*                                                                       00163   
ASTAT09  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(17,25)                                              00167   
*                                                                       00173   
ASKU09   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(17,30)                                              00177   
*                                                                       00168   
APCKQ09  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(17,42)                                              00172   
*                                                                       00168   
AACTQ09  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(17,50)                                              00172   
*                                                                       00168   
AVFYQ09  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(17,58)                                              00172   
*                                                                       00168   
AVFYS09  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(17,69)                                              00172   
*                                                                       00178   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00144   
               COLOR=GREEN,                                            X00145   
               HILIGHT=UNDERLINE,                                      X00146   
               LENGTH=1,                                               X00147   
               POS=(18,3)                                               00148   
         DFHMDF ATTRB=(ASKIP),                                         X00149   
               POS=(18,5),                                             X00150   
               INITIAL=' ',                                            X00151   
               LENGTH=1                                                 00152   
*                                                                       00153   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00154   
               COLOR=BLUE,                                             X00155   
               LENGTH=3,                                               X00156   
               POS=(18,8)                                               00157   
*                                                                       00158   
ALNE10   DFHMDF ATTRB=(ASKIP),                                         X00159   
               COLOR=BLUE,                                             X00160   
               LENGTH=5,                                               X00161   
               POS=(18,15)                                              00162   
*                                                                       00163   
ASTAT10  DFHMDF ATTRB=(ASKIP),                                         X00164   
               COLOR=BLUE,                                             X00165   
               LENGTH=2,                                               X00166   
               POS=(18,25)                                              00167   
*                                                                       00173   
ASKU10   DFHMDF ATTRB=(ASKIP),                                         X00174   
               COLOR=BLUE,                                             X00175   
               LENGTH=11,                                              X00176   
               POS=(18,30)                                              00177   
*                                                                       00168   
APCKQ10  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(18,42)                                              00172   
*                                                                       00168   
AACTQ10  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(18,50)                                              00172   
*                                                                       00168   
AVFYQ10  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=6,                                               X00171   
               POS=(18,58)                                              00172   
*                                                                       00178   
*                                                                       00168   
AVFYS10  DFHMDF ATTRB=(ASKIP),                                         X00169   
               COLOR=BLUE,                                             X00170   
               LENGTH=8,                                               X00171   
               POS=(18,69)                                              00172   
*                                                                       00598   
*        LINE 19                                                        00599   
*                                                                       00600   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00601   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00602   
               COLOR=NEUTRAL,                                          X00603   
               LENGTH=25,                                              X00604   
               POS=(19,39)                                              00605   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00606   
               JUSTIFY=(LEFT,BLANK),                                   X00607   
               COLOR=BLUE,                                             X00608   
               PICOUT='ZZZZZZZ',                                       X00609   
               LENGTH=7,                                               X00610   
               POS=(19,69)                                              00611   
*                                                                       00612   
         DFHMSD TYPE=FINAL                                              00613   
         END                                                            00614   
