  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM284                                            *   00006   
*        MAP     RC284A                                             *   00007   
*        PROGRAM RCKCS284                                           *   00008   
*        TRANSID E284 - STORE VERIFICATION                          *   00009   
*        SYSTEM  RC RECEIVING                                       *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM284 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
RC284A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT),                                 X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                       00024   
        DFHMDF POS=(02,02),                                            X00025   
               LENGTH=05,                                              X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               COLOR=NEUTRAL,                                          X00028   
               INITIAL='RCVR:'                                          00029   
ARCVR   DFHMDF POS=(02,08),                                            X00030   
               LENGTH=13,                                              X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               COLOR=BLUE                                               00033   
        DFHMDF POS=(02,22),                                            X00034   
               LENGTH=04,                                              X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               COLOR=NEUTRAL,                                          X00037   
               INITIAL='LNE:'                                           00038   
ALINE   DFHMDF POS=(02,27),                                            X00039   
               LENGTH=04,                                              X00040   
               ATTRB=(ASKIP,NORM),                                     X00041   
               COLOR=BLUE                                               00042   
        DFHMDF POS=(02,32),                                            X00043   
               LENGTH=06,                                              X00044   
               ATTRB=(ASKIP,NORM),                                     X00045   
               COLOR=NEUTRAL,                                          X00046   
               INITIAL='OP ID:'                                         00047   
AOPER   DFHMDF POS=(02,39),                                            X00048   
               LENGTH=04,                                              X00049   
               ATTRB=(ASKIP,NORM),                                     X00050   
               PICOUT='ZZZ9',                                          X00050   
               COLOR=BLUE                                               00051   
        DFHMDF POS=(02,44),                                            X00052   
               LENGTH=06,                                              X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               COLOR=NEUTRAL,                                          X00055   
               INITIAL='FCLTY:'                                         00056   
AFCLTY  DFHMDF POS=(02,51),                                            X00057   
               LENGTH=04,                                              X00058   
               ATTRB=(ASKIP,NORM),                                     X00059   
               PICOUT='ZZZ9',                                          X00050   
               COLOR=BLUE                                               00060   
AFDESC  DFHMDF POS=(02,56),                                            X00061   
               LENGTH=24,                                              X00062   
               ATTRB=(ASKIP,NORM),                                     X00063   
               COLOR=BLUE                                               00064   
        DFHMDF POS=(03,02),                                            X00066   
               LENGTH=16,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='LINE PCKSLP QTY:'                               00070   
APSLQTY DFHMDF POS=(03,19),                                            X00071   
               LENGTH=6,                                               X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE,                                             X00074   
               PICOUT='ZZZZZ9'                                          00094   
*                                                                       00182*44
        DFHMDF POS=(03,26),                                            X00183*55
               LENGTH=1,                                               X00184*44
               ATTRB=ASKIP                                              00185*44
*                                                                       00182*44
*-------------------------------------------------------------------*           
* ADDED NEW LABELS - DEPT, CL AND SKU AT THE HEADER. ** WR# 230ZZ   *           
*-------------------------------------------------------------------*           
        DFHMDF POS=(03,31),                                            X00075   
               LENGTH=05,                                              X00076   
               ATTRB=(ASKIP,NORM),                                     X00077   
               COLOR=NEUTRAL,                                          X00078   
               INITIAL='DEPT:'                                          00079   
ADEPT   DFHMDF POS=(03,37),                                            X00080   
               LENGTH=03,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
        DFHMDF POS=(03,43),                                            X00075   
               LENGTH=03,                                              X00076   
               ATTRB=(ASKIP,NORM),                                     X00077   
               COLOR=NEUTRAL,                                          X00078   
               INITIAL='CL:'                                            00079   
ACL     DFHMDF POS=(03,47),                                            X00080   
               LENGTH=02,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
        DFHMDF POS=(03,55),                                            X00075   
               LENGTH=04,                                              X00076   
               ATTRB=(ASKIP,NORM),                                     X00077   
               COLOR=NEUTRAL,                                          X00078   
               INITIAL='SKU:'                                           00079   
ASKUNBR DFHMDF POS=(03,60),                                            X00080   
               LENGTH=08,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*******************************************************************     00065   
        DFHMDF POS=(04,02),                                            X00066   
               LENGTH=16,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='LINE ACTUAL QTY:'                               00070   
AACTQTY DFHMDF POS=(04,19),                                            X00071   
               LENGTH=6,                                               X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE,                                             X00074   
               PICOUT='ZZZZZ9'                                          00094   
AVERTYP DFHMDF POS=(04,46),                                            X00080   
               LENGTH=08,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=NEUTRAL                                            00083   
        DFHMDF POS=(04,55),                                            X00066   
               LENGTH=16,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='VERIFIED SOURCE:'                               00070   
AVERSRC DFHMDF POS=(04,72),                                            X00080   
               LENGTH=08,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=BLUE                                               00083   
***************************************************************                 
        DFHMDF POS=(05,02),                                            X00066   
               LENGTH=16,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='LINE VERFYD QTY:'                               00070   
AVERQTY DFHMDF POS=(05,19),                                            X00071   
               LENGTH=6,                                               X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE,                                             X00074   
               PICOUT='ZZZZZ9'                                          00094   
        DFHMDF POS=(05,28),                                            X00066   
               LENGTH=12,                                              X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               COLOR=NEUTRAL,                                          X00069   
               INITIAL='LINE STATUS:'                                   00070   
ASTAT   DFHMDF POS=(05,41),                                            X00071   
               LENGTH=2,                                               X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=BLUE                                               00074   
        DFHMDF POS=(05,46),                                            X00084   
               LENGTH=05,                                              X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               COLOR=NEUTRAL,                                          X00087   
               INITIAL='ITEMS'                                          00088   
ASTRTIT DFHMDF POS=(05,52),                                            X00089   
               LENGTH=05,                                              X00090   
               ATTRB=(NUM,UNPROT,NORM),                                X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               PICOUT='ZZZZ9'                                           00094   
        DFHMDF POS=(05,58),                                            X00095   
               LENGTH=02,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=NEUTRAL,                                          X00098   
               INITIAL='TO'                                             00099   
AENDIT  DFHMDF POS=(05,61),                                            X00100   
               LENGTH=05,                                              X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               COLOR=BLUE,                                             X00103   
               PICOUT='ZZZZ9'                                           00104   
        DFHMDF POS=(05,67),                                            X00105   
               LENGTH=02,                                              X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='OF'                                             00109   
ATOTIT  DFHMDF POS=(05,70),                                            X00110   
               LENGTH=05,                                              X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               COLOR=BLUE,                                             X00113   
               PICOUT='ZZZZ9'                                           00114   
        DFHMDF POS=(06,47),                                            X00095   
               LENGTH=33,                                              X00096   
               ATTRB=(ASKIP,NORM),                                     X00097   
               COLOR=NEUTRAL,                                          X00098   
               INITIAL='********* QTY BY SOURCE *********'              00099   
*****************************************************************       00115   
*                                                                       00190   
*   FIRST COLUMN HEADING LINE                                           00191   
*                                                                       00192   
        DFHMDF POS=(07,12),                                            X00193   
               LENGTH=32,                                              X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='UPDATE  STR  PKSLP   ACTL  VRFYD'               00197   
AVERTY2 DFHMDF POS=(07,47),                                            X00080   
               LENGTH=08,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=NEUTRAL                                            00083   
        DFHMDF POS=(07,56),                                            X00193   
               LENGTH=1,                                               X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='-'                                              00197   
AVERSR2 DFHMDF POS=(07,58),                                            X00080   
               LENGTH=06,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=NEUTRAL                                            00083   
        DFHMDF POS=(07,65),                                            X00193   
               LENGTH=5,                                               X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='--  -'                                          00197   
AVERSR3 DFHMDF POS=(07,71),                                            X00080   
               LENGTH=06,                                              X00081   
               ATTRB=(ASKIP,NORM),                                     X00082   
               COLOR=NEUTRAL                                            00083   
        DFHMDF POS=(07,78),                                            X00193   
               LENGTH=2,                                               X00194   
               ATTRB=(PROT,NORM),                                      X00195   
               COLOR=NEUTRAL,                                          X00196   
               INITIAL='--'                                             00197   
*   SECOND DETAIL HEADING LINE                                          00203   
        DFHMDF POS=(08,02),                                            X00204   
               LENGTH=41,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='SEL  ACT   QTY    NO    QTY    QTY    QTY'      00208   
        DFHMDF POS=(08,48),                                            X00204   
               LENGTH=32,                                              X00205   
               ATTRB=(PROT,NORM),                                      X00206   
               COLOR=NEUTRAL,                                          X00207   
               INITIAL='SOURCE  PKSLP  ACTL  PKSLP  ACTL'               00208   
*                                                                       00215   
*   DETAIL COLUMNS                                                      00216   
*                                                                       00217   
ASEL01  DFHMDF POS=(09,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(09,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT01  DFHMDF POS=(09,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY01  DFHMDF POS=(09,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR01  DFHMDF POS=(09,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ01 DFHMDF POS=(09,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ01 DFHMDF POS=(09,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ01 DFHMDF POS=(09,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ01 DFHMDF POS=(09,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL01 DFHMDF POS=(09,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL01 DFHMDF POS=(09,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV01 DFHMDF POS=(09,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV01 DFHMDF POS=(09,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL02  DFHMDF POS=(10,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(10,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT02  DFHMDF POS=(10,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY02  DFHMDF POS=(10,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR02  DFHMDF POS=(10,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ02 DFHMDF POS=(10,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ02 DFHMDF POS=(10,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ02 DFHMDF POS=(10,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ02 DFHMDF POS=(10,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL02 DFHMDF POS=(10,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL02 DFHMDF POS=(10,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV02 DFHMDF POS=(10,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV02 DFHMDF POS=(10,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL03  DFHMDF POS=(11,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(11,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT03  DFHMDF POS=(11,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY03  DFHMDF POS=(11,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR03  DFHMDF POS=(11,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ03 DFHMDF POS=(11,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ03 DFHMDF POS=(11,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ03 DFHMDF POS=(11,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ03 DFHMDF POS=(11,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL03 DFHMDF POS=(11,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL03 DFHMDF POS=(11,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV03 DFHMDF POS=(11,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV03 DFHMDF POS=(11,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL04  DFHMDF POS=(12,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(12,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT04  DFHMDF POS=(12,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY04  DFHMDF POS=(12,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR04  DFHMDF POS=(12,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ04 DFHMDF POS=(12,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ04 DFHMDF POS=(12,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ04 DFHMDF POS=(12,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ04 DFHMDF POS=(12,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL04 DFHMDF POS=(12,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL04 DFHMDF POS=(12,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV04 DFHMDF POS=(12,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV04 DFHMDF POS=(12,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL05  DFHMDF POS=(13,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(13,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT05  DFHMDF POS=(13,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY05  DFHMDF POS=(13,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR05  DFHMDF POS=(13,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ05 DFHMDF POS=(13,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ05 DFHMDF POS=(13,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ05 DFHMDF POS=(13,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ05 DFHMDF POS=(13,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL05 DFHMDF POS=(13,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL05 DFHMDF POS=(13,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV05 DFHMDF POS=(13,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV05 DFHMDF POS=(13,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL06  DFHMDF POS=(14,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(14,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT06  DFHMDF POS=(14,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY06  DFHMDF POS=(14,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR06  DFHMDF POS=(14,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ06 DFHMDF POS=(14,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ06 DFHMDF POS=(14,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ06 DFHMDF POS=(14,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ06 DFHMDF POS=(14,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL06 DFHMDF POS=(14,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL06 DFHMDF POS=(14,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV06 DFHMDF POS=(14,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV06 DFHMDF POS=(14,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL07  DFHMDF POS=(15,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(15,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT07  DFHMDF POS=(15,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY07  DFHMDF POS=(15,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR07  DFHMDF POS=(15,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ07 DFHMDF POS=(15,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ07 DFHMDF POS=(15,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ07 DFHMDF POS=(15,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ07 DFHMDF POS=(15,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL07 DFHMDF POS=(15,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL07 DFHMDF POS=(15,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV07 DFHMDF POS=(15,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV07 DFHMDF POS=(15,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL08  DFHMDF POS=(16,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(16,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT08  DFHMDF POS=(16,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY08  DFHMDF POS=(16,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR08  DFHMDF POS=(16,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ08 DFHMDF POS=(16,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ08 DFHMDF POS=(16,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ08 DFHMDF POS=(16,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ08 DFHMDF POS=(16,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL08 DFHMDF POS=(16,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL08 DFHMDF POS=(16,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV08 DFHMDF POS=(16,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV08 DFHMDF POS=(16,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL09  DFHMDF POS=(17,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(17,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT09  DFHMDF POS=(17,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY09  DFHMDF POS=(17,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR09  DFHMDF POS=(17,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ09 DFHMDF POS=(17,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ09 DFHMDF POS=(17,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ09 DFHMDF POS=(17,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ09 DFHMDF POS=(17,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL09 DFHMDF POS=(17,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL09 DFHMDF POS=(17,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV09 DFHMDF POS=(17,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV09 DFHMDF POS=(17,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASEL10  DFHMDF POS=(18,03),                                            X00218   
               LENGTH=01,                                              X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               COLOR=GREEN                                              00222   
        DFHMDF POS=(18,05),                                            X00223   
               LENGTH=00,                                              X00224   
               ATTRB=ASKIP                                              00225   
AACT10  DFHMDF POS=(18,07),                                            X00226   
               LENGTH=03,                                              X00227   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AQTY10  DFHMDF POS=(18,13),                                            X00231   
               LENGTH=05,                                              X00232   
               ATTRB=(UNPROT,NORM,NUM),                                X00228   
               HILIGHT=UNDERLINE,                                      X00229   
               COLOR=GREEN                                              00230   
ASTR10  DFHMDF POS=(18,19),                                            X00231   
               LENGTH=04,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AEXPQ10 DFHMDF POS=(18,25),                                            X00235   
               LENGTH=05,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
AACTQ10 DFHMDF POS=(18,32),                                            X00239   
               LENGTH=05,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
AVERQ10 DFHMDF POS=(18,39),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
ASRCQ10 DFHMDF POS=(18,47),                                            X00243   
               LENGTH=08,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSL10 DFHMDF POS=(18,56),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTL10 DFHMDF POS=(18,62),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
APKSV10 DFHMDF POS=(18,69),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
AACTV10 DFHMDF POS=(18,75),                                            X00243   
               LENGTH=05,                                              X00244   
               ATTRB=(ASKIP,NORM),                                     X00245   
               COLOR=BLUE                                               00246   
*                                                                       00898   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00899   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00900   
ASELIT  DFHMDF POS=(19,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00901   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00902   
**************                                                          00903   
        DFHMSD TYPE=FINAL                                               00904   
**************                                                          00905   
        END                                                             00906   
