*          DATA SET RCKM215    AT LEVEL 006 AS OF 11/16/95                      
*          DATA SET RCKM215    AT LEVEL 001 AS OF 09/06/94              00001**4
*          DATA SET RCKM215    AT LEVEL 016 AS OF 04/13/94              00002**4
*          DATA SET RCKM215A1  AT LEVEL 011 AS OF 02/01/94              00003**4
  PRINT  NOGEN                                                          00004**4
*-------------------------------------------------------------------*   00005**4
*                                                                   *   00006**4
*        MAPSET  RCKM215                                            *   00007**4
*        MAP     RC215A                                             *   00008**4
*        PROGRAM RCKCS215                                           *   00009**4
*        TRANSID E215 - PACK SLIP LINE SUMMARY                      *   00010**4
*        SYSTEM  RC NEW RECEIVING                                   *   00011**4
*                                                                   *   00012**4
*-------------------------------------------------------------------*   00013**4
RCKM215 DFHMSD TYPE=DSECT,                                             X00014**4
               MODE=INOUT,                                             X00015**4
               LANG=COBOL,                                             X00016**4
               STORAGE=AUTO,                                           X00017**4
               TIOAPFX=YES,                                            X00018**4
               TERM=3270-2                                              00019**4
RC215A  DFHMDI LINE=2,COLUMN=1,                                        X00020**4
               SIZE=(19,80),                                           X00021**4
               MAPATTS=(COLOR,HILIGHT),                                X00022**4
               DSATTS=(COLOR,HILIGHT),                                 X00023**4
               CTRL=(FREEKB)                                            00024**4
*                                                                       00025**4
        DFHMDF POS=(02,01),                                            X00026**4
               LENGTH=06,                                              X00027**4
               ATTRB=(ASKIP,NORM),                                     X00028**4
               COLOR=NEUTRAL,                                          X00029**4
               INITIAL='PO NO:'                                         00030**4
APO     DFHMDF POS=(02,08),                                            X00031**4
               LENGTH=08,                                              X00032**4
               ATTRB=(ASKIP,NORM),                                     X00033**4
               COLOR=BLUE                                               00034**4
        DFHMDF POS=(02,19),                                            X00035**4
               LENGTH=06,                                              X00036**4
               ATTRB=(ASKIP,NORM),                                     X00037**4
               COLOR=NEUTRAL,                                          X00038**4
               INITIAL='PS NO:'                                         00039**4
APKSLIP DFHMDF POS=(02,26),                                            X00040**4
               LENGTH=10,                                              X00041**4
               ATTRB=(ASKIP,NORM),                                     X00042**4
               COLOR=BLUE                                               00043**4
        DFHMDF POS=(02,37),                                            X00044**4
               LENGTH=12,                                              X00045**4
               ATTRB=(ASKIP,NORM),                                     X00046**4
               COLOR=NEUTRAL,                                          X00047**4
               INITIAL='VENDOR NAME:'                                   00048**4
AVEND   DFHMDF POS=(02,50),                                            X00049**4
               LENGTH=30,                                              X00050**4
               ATTRB=(ASKIP,NORM),                                     X00051**4
               COLOR=BLUE                                               00052**4
*                                                                       00053**4
        DFHMDF POS=(03,01),                                            X00054**4
               LENGTH=12,                                              X00055**4
               ATTRB=(ASKIP,NORM),                                     X00056**4
               COLOR=NEUTRAL,                                          X00057**4
               INITIAL='RCVR SEQ NO:'                                   00058**4
ARECSEQ DFHMDF POS=(03,14),                                            X00059**4
               LENGTH=04,                                              X00060**4
               ATTRB=(ASKIP,NORM),                                     X00061**4
               COLOR=BLUE                                               00062**4
        DFHMDF POS=(03,19),                                            X00063**4
               LENGTH=07,                                              X00064**4
               ATTRB=(ASKIP,NORM),                                     X00065**4
               COLOR=NEUTRAL,                                          X00066**4
               INITIAL='STR NO:'                                        00067**4
ASTR    DFHMDF POS=(03,27),                                            X00068**4
               LENGTH=04,                                              X00069**4
               ATTRB=(ASKIP,NORM),                                     X00070**4
               COLOR=BLUE                                               00071**4
        DFHMDF POS=(03,45),                                            X00072**4
               LENGTH=05,                                              X00073**4
               ATTRB=(ASKIP,NORM),                                     X00074**4
               COLOR=NEUTRAL,                                          X00075**4
               INITIAL='ITEMS'                                          00076**4
ASTRTIT DFHMDF POS=(03,51),                                            X00077**4
               LENGTH=05,                                              X00078**4
               ATTRB=(NUM,UNPROT,NORM),                                X00079**4
               COLOR=GREEN,                                            X00080**4
               HILIGHT=UNDERLINE,                                      X00081**4
               PICOUT='ZZZZ9'                                           00082**4
        DFHMDF POS=(03,57),                                            X00083**4
               LENGTH=02,                                              X00084**4
               ATTRB=(ASKIP,NORM),                                     X00085**4
               COLOR=NEUTRAL,                                          X00086**4
               INITIAL='TO'                                             00087**4
AENDIT  DFHMDF POS=(03,60),                                            X00088**4
               LENGTH=05,                                              X00089**4
               ATTRB=(ASKIP,NORM),                                     X00090**4
               COLOR=BLUE,                                             X00091**4
               PICOUT='ZZZZ9'                                           00092**4
        DFHMDF POS=(03,66),                                            X00093**4
               LENGTH=02,                                              X00094**4
               ATTRB=(ASKIP,NORM),                                     X00095**4
               COLOR=NEUTRAL,                                          X00096**4
               INITIAL='OF'                                             00097**4
ATOTIT  DFHMDF POS=(03,69),                                            X00098**4
               LENGTH=05,                                              X00099**4
               ATTRB=(ASKIP,NORM),                                     X00100**4
               COLOR=BLUE,                                             X00101**4
               PICOUT='ZZZZ9'                                           00102**4
*                                                                       00103**4
        DFHMDF POS=(04,01),                                            X00104**4
               LENGTH=17,                                              X00105**4
               ATTRB=(PROT,NORM),                                      X00106**4
               COLOR=NEUTRAL,                                          X00107**4
               INITIAL='SEARCH FOR STYLE:'                              00108**4
ASTYLE  DFHMDF POS=(04,19),                                            X00109**4
               LENGTH=20,                                              X00110**4
               ATTRB=(UNPROT,NORM,IC),                                 X00111**4
               HILIGHT=UNDERLINE,                                      X00112**4
               COLOR=GREEN                                              00113**4
        DFHMDF POS=(04,40),                                            X00114**4
               LENGTH=01,                                              X00115**4
               ATTRB=(ASKIP)                                            00116**4
*                                                                       00117**4
        DFHMDF POS=(05,10),                                            X00118**4
               LENGTH=02,                                              X00119**4
               ATTRB=(PROT,NORM),                                      X00120**4
               COLOR=NEUTRAL,                                          X00121**4
               INITIAL='PO'                                             00122**4
        DFHMDF POS=(05,14),                                            X00123**4
               LENGTH=12,                                              X00124**4
               ATTRB=(PROT,NORM),                                      X00125**4
               COLOR=NEUTRAL,                                          X00126**4
               INITIAL='VENDOR STYLE'                                   00127**4
        DFHMDF POS=(05,41),                                            X00128**4
               LENGTH=03,                                              X00129**4
               ATTRB=(PROT,NORM),                                      X00130**4
               COLOR=NEUTRAL,                                          X00131**4
               INITIAL='   '                                            00132**5
        DFHMDF POS=(05,55),                                            X00133**4
               LENGTH=10,                                              X00134**4
               ATTRB=(PROT,NORM),                                      X00135**4
               COLOR=NEUTRAL,                                          X00136**4
               INITIAL='COLOR DESC'                                     00137**4
*                                                                       00138**4
        DFHMDF POS=(06,01),                                            X00139**4
               LENGTH=03,                                              X00140**4
               ATTRB=(PROT,NORM),                                      X00141**4
               COLOR=NEUTRAL,                                          X00142**4
               INITIAL='SEL'                                            00143**4
        DFHMDF POS=(06,05),                                            X00144**4
               LENGTH=03,                                              X00145**4
               ATTRB=(PROT,NORM),                                      X00146**4
               COLOR=NEUTRAL,                                          X00147**4
               INITIAL='ACT'                                            00148**4
        DFHMDF POS=(06,09),                                            X00149**4
               LENGTH=16,                                              X00150**4
               ATTRB=(PROT,NORM),                                      X00151**4
               COLOR=NEUTRAL,                                          X00152**4
               INITIAL='LINE DESCRIPTION'                               00153**4
        DFHMDF POS=(06,40),                                            X00154**4
               LENGTH=04,                                              X00155**4
               ATTRB=(PROT,NORM),                                      X00156**4
               COLOR=NEUTRAL,                                          X00157**4
               INITIAL=' QTY'                                           00158**6
        DFHMDF POS=(06,49),                                            X00159**4
               LENGTH=04,                                              X00160**4
               ATTRB=(PROT,NORM),                                      X00161**4
               COLOR=NEUTRAL,                                          X00162**4
               INITIAL='COST'                                           00163**4
        DFHMDF POS=(06,55),                                            X00164**4
               LENGTH=09,                                              X00165**4
               ATTRB=(PROT,NORM),                                      X00166**4
               COLOR=NEUTRAL,                                          X00167**4
               INITIAL='SIZE DESC'                                      00168**4
*                                                                       00169**4
ASEL01  DFHMDF POS=(07,02),                                            X00170**4
               LENGTH=01,                                              X00171**4
               ATTRB=(UNPROT,NORM),                                    X00172**4
               HILIGHT=UNDERLINE,                                      X00173**4
               COLOR=GREEN                                              00174**4
        DFHMDF POS=(07,04),                                            X00175**4
               LENGTH=00,                                              X00176**4
               ATTRB=(ASKIP)                                            00177**4
AACT01  DFHMDF POS=(07,05),                                            X00178**4
               LENGTH=03,                                              X00179**4
               ATTRB=(ASKIP,NORM),                                     X00180**4
               COLOR=BLUE                                               00181**4
ALINE01 DFHMDF POS=(07,09),                                            X00182**4
               LENGTH=04,                                              X00183**4
               ATTRB=(ASKIP,NORM),                                     X00184**4
               COLOR=BLUE                                               00185**4
ASTYL01 DFHMDF POS=(07,14),                                            X00186**4
               LENGTH=20,                                              X00187**4
               ATTRB=(ASKIP,NORM),                                     X00188**4
               COLOR=BLUE                                               00189**4
AQTY01  DFHMDF POS=(07,37),                                            X00190**4
               LENGTH=07,                                              X00191**4
               ATTRB=(ASKIP,NORM),                                     X00192**4
               COLOR=BLUE                                               00193**4
ACOST01 DFHMDF POS=(07,45),                                            X00194**4
               LENGTH=08,                                              X00195**4
               ATTRB=(ASKIP,NORM),                                     X00196**4
               COLOR=BLUE                                               00197**4
ACLR01  DFHMDF POS=(07,55),                                            X00198**4
               LENGTH=25,                                              X00199**4
               ATTRB=(ASKIP,NORM),                                     X00200**4
               COLOR=BLUE                                               00201**4
*                                                                       00202**4
ADESC01 DFHMDF POS=(08,14),                                            X00203**4
               LENGTH=25,                                              X00204**4
               ATTRB=(ASKIP,NORM),                                     X00205**4
               COLOR=BLUE                                               00206**4
ASIZE01 DFHMDF POS=(08,55),                                            X00207**4
               LENGTH=25,                                              X00208**4
               ATTRB=(ASKIP,NORM),                                     X00209**4
               COLOR=BLUE                                               00210**4
*                                                                       00211**4
ASEL02  DFHMDF POS=(09,02),                                            X00212**4
               LENGTH=01,                                              X00213**4
               ATTRB=(UNPROT,NORM),                                    X00214**4
               HILIGHT=UNDERLINE,                                      X00215**4
               COLOR=GREEN                                              00216**4
        DFHMDF POS=(09,04),                                            X00217**4
               LENGTH=00,                                              X00218**4
               ATTRB=(ASKIP)                                            00219**4
AACT02  DFHMDF POS=(09,05),                                            X00220**4
               LENGTH=03,                                              X00221**4
               ATTRB=(ASKIP,NORM),                                     X00222**4
               COLOR=BLUE                                               00223**4
ALINE02 DFHMDF POS=(09,09),                                            X00224**4
               LENGTH=04,                                              X00225**4
               ATTRB=(ASKIP,NORM),                                     X00226**4
               COLOR=BLUE                                               00227**4
ASTYL02 DFHMDF POS=(09,14),                                            X00228**4
               LENGTH=20,                                              X00229**4
               ATTRB=(ASKIP,NORM),                                     X00230**4
               COLOR=BLUE                                               00231**4
AQTY02  DFHMDF POS=(09,37),                                            X00232**4
               LENGTH=07,                                              X00233**4
               ATTRB=(ASKIP,NORM),                                     X00234**4
               COLOR=BLUE                                               00235**4
ACOST02 DFHMDF POS=(09,45),                                            X00236**4
               LENGTH=08,                                              X00237**4
               ATTRB=(ASKIP,NORM),                                     X00238**4
               COLOR=BLUE                                               00239**4
ACLR02  DFHMDF POS=(09,55),                                            X00240**4
               LENGTH=25,                                              X00241**4
               ATTRB=(ASKIP,NORM),                                     X00242**4
               COLOR=BLUE                                               00243**4
*                                                                       00244**4
ADESC02 DFHMDF POS=(10,14),                                            X00245**4
               LENGTH=25,                                              X00246**4
               ATTRB=(ASKIP,NORM),                                     X00247**4
               COLOR=BLUE                                               00248**4
ASIZE02 DFHMDF POS=(10,55),                                            X00249**4
               LENGTH=25,                                              X00250**4
               ATTRB=(ASKIP,NORM),                                     X00251**4
               COLOR=BLUE                                               00252**4
*                                                                       00253**4
ASEL03  DFHMDF POS=(11,02),                                            X00254**4
               LENGTH=01,                                              X00255**4
               ATTRB=(UNPROT,NORM),                                    X00256**4
               HILIGHT=UNDERLINE,                                      X00257**4
               COLOR=GREEN                                              00258**4
        DFHMDF POS=(11,04),                                            X00259**4
               LENGTH=00,                                              X00260**4
               ATTRB=(ASKIP)                                            00261**4
AACT03  DFHMDF POS=(11,05),                                            X00262**4
               LENGTH=03,                                              X00263**4
               ATTRB=(ASKIP,NORM),                                     X00264**4
               COLOR=BLUE                                               00265**4
ALINE03 DFHMDF POS=(11,09),                                            X00266**4
               LENGTH=04,                                              X00267**4
               ATTRB=(ASKIP,NORM),                                     X00268**4
               COLOR=BLUE                                               00269**4
ASTYL03 DFHMDF POS=(11,14),                                            X00270**4
               LENGTH=20,                                              X00271**4
               ATTRB=(ASKIP,NORM),                                     X00272**4
               COLOR=BLUE                                               00273**4
AQTY03  DFHMDF POS=(11,37),                                            X00274**4
               LENGTH=07,                                              X00275**4
               ATTRB=(ASKIP,NORM),                                     X00276**4
               COLOR=BLUE                                               00277**4
ACOST03 DFHMDF POS=(11,45),                                            X00278**4
               LENGTH=08,                                              X00279**4
               ATTRB=(ASKIP,NORM),                                     X00280**4
               COLOR=BLUE                                               00281**4
ACLR03  DFHMDF POS=(11,55),                                            X00282**4
               LENGTH=25,                                              X00283**4
               ATTRB=(ASKIP,NORM),                                     X00284**4
               COLOR=BLUE                                               00285**4
*                                                                       00286**4
ADESC03 DFHMDF POS=(12,14),                                            X00287**4
               LENGTH=25,                                              X00288**4
               ATTRB=(ASKIP,NORM),                                     X00289**4
               COLOR=BLUE                                               00290**4
ASIZE03 DFHMDF POS=(12,55),                                            X00291**4
               LENGTH=25,                                              X00292**4
               ATTRB=(ASKIP,NORM),                                     X00293**4
               COLOR=BLUE                                               00294**4
*                                                                       00295**4
ASEL04  DFHMDF POS=(13,02),                                            X00296**4
               LENGTH=01,                                              X00297**4
               ATTRB=(UNPROT,NORM),                                    X00298**4
               HILIGHT=UNDERLINE,                                      X00299**4
               COLOR=GREEN                                              00300**4
        DFHMDF POS=(13,04),                                            X00301**4
               LENGTH=00,                                              X00302**4
               ATTRB=(ASKIP)                                            00303**4
AACT04  DFHMDF POS=(13,05),                                            X00304**4
               LENGTH=03,                                              X00305**4
               ATTRB=(ASKIP,NORM),                                     X00306**4
               COLOR=BLUE                                               00307**4
ALINE04 DFHMDF POS=(13,09),                                            X00308**4
               LENGTH=04,                                              X00309**4
               ATTRB=(ASKIP,NORM),                                     X00310**4
               COLOR=BLUE                                               00311**4
ASTYL04 DFHMDF POS=(13,14),                                            X00312**4
               LENGTH=20,                                              X00313**4
               ATTRB=(ASKIP,NORM),                                     X00314**4
               COLOR=BLUE                                               00315**4
AQTY04  DFHMDF POS=(13,37),                                            X00316**4
               LENGTH=07,                                              X00317**4
               ATTRB=(ASKIP,NORM),                                     X00318**4
               COLOR=BLUE                                               00319**4
ACOST04 DFHMDF POS=(13,45),                                            X00320**4
               LENGTH=08,                                              X00321**4
               ATTRB=(ASKIP,NORM),                                     X00322**4
               COLOR=BLUE                                               00323**4
ACLR04  DFHMDF POS=(13,55),                                            X00324**4
               LENGTH=25,                                              X00325**4
               ATTRB=(ASKIP,NORM),                                     X00326**4
               COLOR=BLUE                                               00327**4
*                                                                       00328**4
ADESC04 DFHMDF POS=(14,14),                                            X00329**4
               LENGTH=25,                                              X00330**4
               ATTRB=(ASKIP,NORM),                                     X00331**4
               COLOR=BLUE                                               00332**4
ASIZE04 DFHMDF POS=(14,55),                                            X00333**4
               LENGTH=25,                                              X00334**4
               ATTRB=(ASKIP,NORM),                                     X00335**4
               COLOR=BLUE                                               00336**4
*                                                                       00337**4
ASEL05  DFHMDF POS=(15,02),                                            X00338**4
               LENGTH=01,                                              X00339**4
               ATTRB=(UNPROT,NORM),                                    X00340**4
               HILIGHT=UNDERLINE,                                      X00341**4
               COLOR=GREEN                                              00342**4
        DFHMDF POS=(15,04),                                            X00343**4
               LENGTH=00,                                              X00344**4
               ATTRB=(ASKIP)                                            00345**4
AACT05  DFHMDF POS=(15,05),                                            X00346**4
               LENGTH=03,                                              X00347**4
               ATTRB=(ASKIP,NORM),                                     X00348**4
               COLOR=BLUE                                               00349**4
ALINE05 DFHMDF POS=(15,09),                                            X00350**4
               LENGTH=04,                                              X00351**4
               ATTRB=(ASKIP,NORM),                                     X00352**4
               COLOR=BLUE                                               00353**4
ASTYL05 DFHMDF POS=(15,14),                                            X00354**4
               LENGTH=20,                                              X00355**4
               ATTRB=(ASKIP,NORM),                                     X00356**4
               COLOR=BLUE                                               00357**4
AQTY05  DFHMDF POS=(15,37),                                            X00358**4
               LENGTH=07,                                              X00359**4
               ATTRB=(ASKIP,NORM),                                     X00360**4
               COLOR=BLUE                                               00361**4
ACOST05 DFHMDF POS=(15,45),                                            X00362**4
               LENGTH=08,                                              X00363**4
               ATTRB=(ASKIP,NORM),                                     X00364**4
               COLOR=BLUE                                               00365**4
ACLR05  DFHMDF POS=(15,55),                                            X00366**4
               LENGTH=25,                                              X00367**4
               ATTRB=(ASKIP,NORM),                                     X00368**4
               COLOR=BLUE                                               00369**4
*                                                                       00370**4
ADESC05 DFHMDF POS=(16,14),                                            X00371**4
               LENGTH=25,                                              X00372**4
               ATTRB=(ASKIP,NORM),                                     X00373**4
               COLOR=BLUE                                               00374**4
ASIZE05 DFHMDF POS=(16,55),                                            X00375**4
               LENGTH=25,                                              X00376**4
               ATTRB=(ASKIP,NORM),                                     X00377**4
               COLOR=BLUE                                               00378**4
*                                                                       00379**4
ASEL06  DFHMDF POS=(17,02),                                            X00380**4
               LENGTH=01,                                              X00381**4
               ATTRB=(UNPROT,NORM),                                    X00382**4
               HILIGHT=UNDERLINE,                                      X00383**4
               COLOR=GREEN                                              00384**4
        DFHMDF POS=(17,04),                                            X00385**4
               LENGTH=00,                                              X00386**4
               ATTRB=(ASKIP)                                            00387**4
AACT06  DFHMDF POS=(17,05),                                            X00388**4
               LENGTH=03,                                              X00389**4
               ATTRB=(ASKIP,NORM),                                     X00390**4
               COLOR=BLUE                                               00391**4
ALINE06 DFHMDF POS=(17,09),                                            X00392**4
               LENGTH=04,                                              X00393**4
               ATTRB=(ASKIP,NORM),                                     X00394**4
               COLOR=BLUE                                               00395**4
ASTYL06 DFHMDF POS=(17,14),                                            X00396**4
               LENGTH=20,                                              X00397**4
               ATTRB=(ASKIP,NORM),                                     X00398**4
               COLOR=BLUE                                               00399**4
AQTY06  DFHMDF POS=(17,37),                                            X00400**4
               LENGTH=07,                                              X00401**4
               ATTRB=(ASKIP,NORM),                                     X00402**4
               COLOR=BLUE                                               00403**4
ACOST06 DFHMDF POS=(17,45),                                            X00404**4
               LENGTH=08,                                              X00405**4
               ATTRB=(ASKIP,NORM),                                     X00406**4
               COLOR=BLUE                                               00407**4
ACLR06  DFHMDF POS=(17,55),                                            X00408**4
               LENGTH=25,                                              X00409**4
               ATTRB=(ASKIP,NORM),                                     X00410**4
               COLOR=BLUE                                               00411**4
*                                                                       00412**4
ADESC06 DFHMDF POS=(18,14),                                            X00413**4
               LENGTH=25,                                              X00414**4
               ATTRB=(ASKIP,NORM),                                     X00415**4
               COLOR=BLUE                                               00416**4
ASIZE06 DFHMDF POS=(18,55),                                            X00417**4
               LENGTH=25,                                              X00418**4
               ATTRB=(ASKIP,NORM),                                     X00419**4
               COLOR=BLUE                                               00420**4
*                                                                       00421**4
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00422**4
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00423**4
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00424**4
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00425**4
**************                                                          00426**4
        DFHMSD TYPE=FINAL                                               00427**4
**************                                                          00428**4
        END                                                             00429**4
