*       MAPSET  - RCKM297                                                       
*       MAP     - RC297A                                                        
*       PROGRAM - RCKCS297                                                      
*       TRANSID - E297                                                          
*       SYSTEM  - CICS ARCHTECTURE (NEW) - RECEIVER                             
*                                                                               
  PRINT  NOGEN                                                                  
*                                                                               
RCKM297  DFHMSD TYPE=&&SYSPARM,                                        X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
RC297A   DFHMDI SIZE=(19,080),                                         X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               LINE=02,                                                X        
               COLUMN=01,                                              X        
               CTRL=(FREEKB)                                                    
*                                                                               
        DFHMDF POS=(02,01),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OPER ID:'                                               
AOPER   DFHMDF POS=(02,10),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(02,15),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='-'                                                      
AFCLTY  DFHMDF POS=(02,17),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,30),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DEPT NUMBER......:'                                     
ADEPT   DFHMDF POS=(02,49),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AZONE   DFHMDF POS=(02,54),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,63),                                            X        
               LENGTH=14,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STATUS.......:'                                         
ASTAT   DFHMDF POS=(02,78),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
        DFHMDF POS=(03,01),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO/RCVR:'                                               
APORCVR DFHMDF POS=(03,10),                                            X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APKCD   DFHMDF POS=(03,24),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVNDR   DFHMDF POS=(03,31),                                            X        
               LENGTH=19,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,51),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ITEMS'                                                  
ASTRTIT DFHMDF POS=(03,57),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(03,63),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(03,66),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(03,72),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(03,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
*                                                                               
****************************************************************                
*                                                                               
        DFHMDF POS=(04,21),                                            X        
               LENGTH=39,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='---------- FULLCASE PROCESS -----------'                
*                                                                               
****************************************************************                
*                                                                               
APACK1  DFHMDF POS=(05,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(05,21),                                            X        
               LENGTH=39,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CSEPK  CRTN OUT CURENT ODD  - CONFIRM -'                
        DFHMDF POS=(05,61),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='---- P2L ---- LINE'                                     
*                                                                               
****************************************************************                
*                                                                               
        DFHMDF POS=(06,01),                                            X        
               LENGTH=10,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='S ACT LINE'                                             
ASKUID  DFHMDF POS=(06,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(06,21),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='AREA   CNT  PAK '                                       
AQTYPK1 DFHMDF POS=(06,38),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(06,44),                                            X        
               LENGTH=16,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='QTY  DATE  TIME '                                       
AQTYPK2 DFHMDF POS=(06,61),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL                                                    
        DFHMDF POS=(06,67),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STATUS  STAT'                                           
*                                                                               
****************************************************************                
*                                                                               
ASEL01  DFHMDF POS=(07,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT01  DFHMDF POS=(07,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE01 DFHMDF POS=(07,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU01  DFHMDF POS=(07,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA01 DFHMDF POS=(07,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN01  DFHMDF POS=(07,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK01  DFHMDF POS=(07,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS01 DFHMDF POS=(07,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ01 DFHMDF POS=(07,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE01 DFHMDF POS=(07,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME01 DFHMDF POS=(07,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ01 DFHMDF POS=(07,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST01 DFHMDF POS=(07,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST01 DFHMDF POS=(07,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL02  DFHMDF POS=(08,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT02  DFHMDF POS=(08,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE02 DFHMDF POS=(08,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU02  DFHMDF POS=(08,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA02 DFHMDF POS=(08,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN02  DFHMDF POS=(08,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK02  DFHMDF POS=(08,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS02 DFHMDF POS=(08,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ02 DFHMDF POS=(08,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE02 DFHMDF POS=(08,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME02 DFHMDF POS=(08,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ02 DFHMDF POS=(08,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST02 DFHMDF POS=(08,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST02 DFHMDF POS=(08,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL03  DFHMDF POS=(09,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT03  DFHMDF POS=(09,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE03 DFHMDF POS=(09,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU03  DFHMDF POS=(09,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA03 DFHMDF POS=(09,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN03  DFHMDF POS=(09,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK03  DFHMDF POS=(09,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS03 DFHMDF POS=(09,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ03 DFHMDF POS=(09,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE03 DFHMDF POS=(09,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME03 DFHMDF POS=(09,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ03 DFHMDF POS=(09,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST03 DFHMDF POS=(09,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST03 DFHMDF POS=(09,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL04  DFHMDF POS=(10,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT04  DFHMDF POS=(10,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE04 DFHMDF POS=(10,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU04  DFHMDF POS=(10,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA04 DFHMDF POS=(10,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN04  DFHMDF POS=(10,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK04  DFHMDF POS=(10,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS04 DFHMDF POS=(10,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ04 DFHMDF POS=(10,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE04 DFHMDF POS=(10,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME04 DFHMDF POS=(10,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ04 DFHMDF POS=(10,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST04 DFHMDF POS=(10,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST04 DFHMDF POS=(10,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL05  DFHMDF POS=(11,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT05  DFHMDF POS=(11,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE05 DFHMDF POS=(11,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU05  DFHMDF POS=(11,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA05 DFHMDF POS=(11,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN05  DFHMDF POS=(11,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK05  DFHMDF POS=(11,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS05 DFHMDF POS=(11,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ05 DFHMDF POS=(11,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE05 DFHMDF POS=(11,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME05 DFHMDF POS=(11,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ05 DFHMDF POS=(11,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST05 DFHMDF POS=(11,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST05 DFHMDF POS=(11,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL06  DFHMDF POS=(12,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT06  DFHMDF POS=(12,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE06 DFHMDF POS=(12,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU06  DFHMDF POS=(12,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA06 DFHMDF POS=(12,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN06  DFHMDF POS=(12,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK06  DFHMDF POS=(12,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS06 DFHMDF POS=(12,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ06 DFHMDF POS=(12,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE06 DFHMDF POS=(12,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME06 DFHMDF POS=(12,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ06 DFHMDF POS=(12,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST06 DFHMDF POS=(12,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST06 DFHMDF POS=(12,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL07  DFHMDF POS=(13,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT07  DFHMDF POS=(13,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE07 DFHMDF POS=(13,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU07  DFHMDF POS=(13,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA07 DFHMDF POS=(13,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN07  DFHMDF POS=(13,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK07  DFHMDF POS=(13,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS07 DFHMDF POS=(13,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ07 DFHMDF POS=(13,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE07 DFHMDF POS=(13,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME07 DFHMDF POS=(13,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ07 DFHMDF POS=(13,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST07 DFHMDF POS=(13,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST07 DFHMDF POS=(13,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL08  DFHMDF POS=(14,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT08  DFHMDF POS=(14,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE08 DFHMDF POS=(14,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU08  DFHMDF POS=(14,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA08 DFHMDF POS=(14,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN08  DFHMDF POS=(14,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK08  DFHMDF POS=(14,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS08 DFHMDF POS=(14,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ08 DFHMDF POS=(14,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE08 DFHMDF POS=(14,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME08 DFHMDF POS=(14,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ08 DFHMDF POS=(14,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST08 DFHMDF POS=(14,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST08 DFHMDF POS=(14,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL09  DFHMDF POS=(15,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT09  DFHMDF POS=(15,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE09 DFHMDF POS=(15,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU09  DFHMDF POS=(15,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA09 DFHMDF POS=(15,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN09  DFHMDF POS=(15,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK09  DFHMDF POS=(15,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS09 DFHMDF POS=(15,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ09 DFHMDF POS=(15,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE09 DFHMDF POS=(15,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME09 DFHMDF POS=(15,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ09 DFHMDF POS=(15,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST09 DFHMDF POS=(15,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST09 DFHMDF POS=(15,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL10  DFHMDF POS=(16,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT10  DFHMDF POS=(16,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE10 DFHMDF POS=(16,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU10  DFHMDF POS=(16,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA10 DFHMDF POS=(16,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN10  DFHMDF POS=(16,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK10  DFHMDF POS=(16,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS10 DFHMDF POS=(16,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ10 DFHMDF POS=(16,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE10 DFHMDF POS=(16,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME10 DFHMDF POS=(16,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ10 DFHMDF POS=(16,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST10 DFHMDF POS=(16,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST10 DFHMDF POS=(16,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL11  DFHMDF POS=(17,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT11  DFHMDF POS=(17,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE11 DFHMDF POS=(17,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU11  DFHMDF POS=(17,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA11 DFHMDF POS=(17,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN11  DFHMDF POS=(17,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK11  DFHMDF POS=(17,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS11 DFHMDF POS=(17,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ11 DFHMDF POS=(17,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE11 DFHMDF POS=(17,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME11 DFHMDF POS=(17,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ11 DFHMDF POS=(17,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST11 DFHMDF POS=(17,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST11 DFHMDF POS=(17,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
****************************************************************                
*                                                                               
ASEL12  DFHMDF POS=(18,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM,IC),                                 X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT12  DFHMDF POS=(18,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE12 DFHMDF POS=(18,07),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZ',                                          X        
               COLOR=BLUE                                                       
ASKU12  DFHMDF POS=(18,12),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AAREA12 DFHMDF POS=(18,21),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(UNPROT),                                         X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE                                                
ACTN12  DFHMDF POS=(18,28),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
APAK12  DFHMDF POS=(18,33),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRCS12 DFHMDF POS=(18,38),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AODDQ12 DFHMDF POS=(18,44),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE12 DFHMDF POS=(18,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME12 DFHMDF POS=(18,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AP2LQ12 DFHMDF POS=(18,61),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
AP2ST12 DFHMDF POS=(18,67),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALNST12 DFHMDF POS=(18,75),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
*                                                                               
**************                                                                  
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'                
ASELIT  DFHMDF POS=(19,71),LENGTH=07,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                                      
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
