*********************************************************************** 00002   
*                                                                       00003   
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00004   
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00005   
*********************************************************************** 00006   
        PRINT NOGEN                                                     00007   
RCKM802 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00008   
RC802A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00009   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00010   
*********************************************************************** 00011   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00012   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00013   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00014   
               COLOR=GREEN,                                            X00015   
               HILIGHT=UNDERLINE,                                      X00016   
               PICOUT='ZZZZ9'                                           00017   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00018   
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='TO'                                             00020   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00021   
               COLOR=BLUE,                                             X00022   
               PICOUT='ZZZZ9'                                           00023   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00024   
               COLOR=NEUTRAL,                                          X00025   
               INITIAL='OF'                                             00026   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00027   
               COLOR=BLUE,                                             X00028   
               PICOUT='ZZZZ9'                                           00029   
**********************************************************************  00030   
        DFHMDF POS=(03,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00031   
               INITIAL='OP UNIT/FAC ID..:'                              00032   
AOPUNT  DFHMDF POS=(3,19),LENGTH=04,ATTRB=(ASKIP,NORM),                X00033   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00034   
AFACTY  DFHMDF POS=(3,24),LENGTH=04,ATTRB=(ASKIP,NORM),                X00035   
               COLOR=BLUE,PICOUT='ZZZZ'                                 00036   
AOPNME  DFHMDF POS=(3,29),LENGTH=25,ATTRB=(ASKIP,NORM),                X00037   
               COLOR=BLUE                                               00038   
**********************************************************************  00039   
        DFHMDF POS=(04,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00040   
               INITIAL='P.O. NUMBER.....:'                              00041   
APONBR  DFHMDF POS=(04,19),LENGTH=08,ATTRB=(ASKIP,NORM),               X00042   
               COLOR=BLUE                                               00043   
        DFHMDF POS=(04,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00044   
               INITIAL='EXPTED CART QTY:'                               00045   
AEXQTY  DFHMDF POS=(04,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00046   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00047   
        DFHMDF POS=(04,60),LENGTH=07,ATTRB=(ASKIP,BRT),                X00048   
               INITIAL='STATUS:'                                        00049   
ASTAT   DFHMDF POS=(04,68),LENGTH=02,ATTRB=(ASKIP,NORM),               X00050   
               COLOR=BLUE                                               00051   
**********************************************************************  00052   
        DFHMDF POS=(05,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X00053   
               INITIAL='SEQUENCE NBR....:'                              00054   
ASEQNBR DFHMDF POS=(05,19),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(05,34),LENGTH=16,ATTRB=(ASKIP,BRT),                X00057   
               INITIAL='ACTUAL CART QTY:'                               00058   
AACQTY  DFHMDF POS=(05,51),LENGTH=05,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00060   
**********************************************************************  00052   
*-------------------------------------------------------------------*           
* ADDED NEW ROW FIELD - DEPT.                   WR # 230ZZ          *           
*-------------------------------------------------------------------*           
        DFHMDF POS=(06,01),LENGTH=17,ATTRB=(ASKIP,BRT),                X        
               INITIAL='DEPT:...........:'                              00054   
ADEPTBR DFHMDF POS=(06,19),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE                                               00056   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
**********************************************************************  00052   
        DFHMDF POS=(07,12),LENGTH=24,ATTRB=(ASKIP,BRT),                X00062   
               INITIAL='PACK PACK             PO'                       00063   
        DFHMDF POS=(07,61),LENGTH=12,ATTRB=(ASKIP,BRT),                X00064   
               INITIAL='PO PACK  OTR'                                   00065   
**********************************************************************  00066   
        DFHMDF POS=(08,02),LENGTH=46,ATTRB=(ASKIP,BRT),                X00067   
               INITIAL='SEL  ACT   ID  DESC            LINE     STATUS' 00068   
        DFHMDF POS=(08,50),LENGTH=24,ATTRB=(ASKIP,BRT),                X00069   
               INITIAL='  SKU       RATIO   ITEM'                       00070   
**********************************************************************  00071   
        DFHMDF POS=(09,2),LENGTH=46,ATTRB=(ASKIP,BRT),                 X00072   
               INITIAL='---  ---  ---- --------------- ----     ------' 00073   
        DFHMDF POS=(09,50),LENGTH=25,ATTRB=(ASKIP,BRT),                X00074   
               INITIAL='----------  -----   -----'                      00075   
**********************************************************************  00076   
ASEL01  DFHMDF POS=(10,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(10,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT01  DFHMDF POS=(10,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(10,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID01 DFHMDF POS=(10,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS01 DFHMDF POS=(10,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN01  DFHMDF POS=(10,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(10,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA01  DFHMDF POS=(10,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU01  DFHMDF POS=(10,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT01 DFHMDF POS=(10,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR01  DFHMDF POS=(10,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(10,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00104   
ASEL02  DFHMDF POS=(11,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(11,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT02  DFHMDF POS=(11,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(11,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID02 DFHMDF POS=(11,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS02 DFHMDF POS=(11,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN02  DFHMDF POS=(11,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(11,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA02  DFHMDF POS=(11,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU02  DFHMDF POS=(11,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT02 DFHMDF POS=(11,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR02  DFHMDF POS=(11,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(11,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00132   
ASEL03  DFHMDF POS=(12,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(12,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT03  DFHMDF POS=(12,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(12,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID03 DFHMDF POS=(12,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS03 DFHMDF POS=(12,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN03  DFHMDF POS=(12,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(12,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA03  DFHMDF POS=(12,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU03  DFHMDF POS=(12,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT03 DFHMDF POS=(12,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR03  DFHMDF POS=(12,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(12,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00160   
ASEL04  DFHMDF POS=(13,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(13,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT04  DFHMDF POS=(13,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(13,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID04 DFHMDF POS=(13,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS04 DFHMDF POS=(13,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN04  DFHMDF POS=(13,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(13,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA04  DFHMDF POS=(13,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU04  DFHMDF POS=(13,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT04 DFHMDF POS=(13,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR04  DFHMDF POS=(13,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(13,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
ASEL05  DFHMDF POS=(14,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(14,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT05  DFHMDF POS=(14,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(14,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID05 DFHMDF POS=(14,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS05 DFHMDF POS=(14,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN05  DFHMDF POS=(14,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(14,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA05  DFHMDF POS=(14,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU05  DFHMDF POS=(14,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT05 DFHMDF POS=(14,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR05  DFHMDF POS=(14,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(14,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
ASEL06  DFHMDF POS=(15,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(15,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT06  DFHMDF POS=(15,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(15,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID06 DFHMDF POS=(15,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS06 DFHMDF POS=(15,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN06  DFHMDF POS=(15,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(15,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA06  DFHMDF POS=(15,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU06  DFHMDF POS=(15,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT06 DFHMDF POS=(15,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR06  DFHMDF POS=(15,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(15,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
ASEL07  DFHMDF POS=(16,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(16,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT07  DFHMDF POS=(16,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(16,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID07 DFHMDF POS=(16,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS07 DFHMDF POS=(16,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN07  DFHMDF POS=(16,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
ASTA07  DFHMDF POS=(16,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU07  DFHMDF POS=(16,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT07 DFHMDF POS=(16,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR07  DFHMDF POS=(16,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(16,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
ASEL08  DFHMDF POS=(17,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(17,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT08  DFHMDF POS=(17,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(17,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID08 DFHMDF POS=(17,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS08 DFHMDF POS=(17,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN08  DFHMDF POS=(17,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(17,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA08  DFHMDF POS=(17,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU08  DFHMDF POS=(17,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT08 DFHMDF POS=(17,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR08  DFHMDF POS=(17,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(17,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
ASEL09  DFHMDF POS=(18,03),LENGTH=01,ATTRB=(UNPROT,NORM),              X00077   
               HILIGHT=UNDERLINE,                                      X00078   
               COLOR=GREEN                                              00079   
        DFHMDF POS=(18,05),LENGTH=1,ATTRB=ASKIP                         00080   
AACT09  DFHMDF POS=(18,07),LENGTH=03,ATTRB=(ASKIP,NORM),               X00081   
               COLOR=BLUE                                               00082   
        DFHMDF POS=(18,11),LENGTH=1,ATTRB=ASKIP                         00083   
APKID09 DFHMDF POS=(18,13),LENGTH=03,ATTRB=(ASKIP,NORM),               X00055   
               COLOR=BLUE,PICOUT='ZZ9'                                  00056   
APKDS09 DFHMDF POS=(18,17),LENGTH=15,ATTRB=(ASKIP,NORM),               X00059   
               COLOR=BLUE                                               00060   
ALNN09  DFHMDF POS=(18,33),LENGTH=04,ATTRB=(ASKIP,NORM),               X00084   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00085   
        DFHMDF POS=(18,39),LENGTH=1,ATTRB=ASKIP                         00086   
ASTA09  DFHMDF POS=(18,44),LENGTH=02,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE                                               00100   
*-------------------------------------------------------------------*           
* INCREASED LENGTH OF SKU FROM 10 TO 11.           WR # 230ZZ       *           
*-------------------------------------------------------------------*           
ASKU09  DFHMDF POS=(18,50),LENGTH=11,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
APORT09 DFHMDF POS=(18,62),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
AOTR09  DFHMDF POS=(18,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00099   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00100   
        DFHMDF POS=(18,75),LENGTH=1,ATTRB=ASKIP                         00101   
*********************************************************************** 00328   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00330   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00331   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00332   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00333   
*********************************************************************** 00334   
*********************************************************************** 00335   
        DFHMSD TYPE=FINAL                                               00336   
        PRINT NOGEN                                                     00337   
        END                                                             00338   
