*          DATA SET RCK00088   AT LEVEL 003 AS OF 02/06/96                      
*          DATA SET RCKM278    AT LEVEL 005 AS OF 06/09/94              00001**2
*          DATA SET RCKM278    AT LEVEL 008 AS OF 03/30/94              00002**2
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM278                                            *   00006**2
*        MAP     RC278A                                             *   00007**2
*        PROGRAM RCKCS278                                           *   00008**2
*        TRANSID E278 - VERIFIED COUNT ADJ BY LINE                  *   00009**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM278 DFHMSD TYPE=MAP,                                               X00013**2
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               TIOAPFX=YES,                                            X00016   
               CTRL=(FREEKB)                                            00017   
RC278A  DFHMDI LINE=2,COLUMN=1,                                        X00018**3
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
*      LINE 2                                                           00022   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00023   
               INITIAL='RCVR NO:',                                     X00024   
               LENGTH=8,                                               X00025   
               COLOR=NEUTRAL,                                          X00026   
               POS=(02,02)                                              00027   
ARCVNBR DFHMDF ATTRB=(ASKIP),                                          X00028   
               LENGTH=8,                                               X00029   
               PICOUT='99999999',                                      X00030   
               COLOR=BLUE,                                             X00031   
               POS=(02,11)                                              00032   
ARCVSEQ DFHMDF ATTRB=(ASKIP),                                          X00033   
               LENGTH=4,                                               X00034   
               PICOUT='9999',                                          X00035   
               COLOR=BLUE,                                             X00036   
               POS=(02,20)                                              00037   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00039   
               INITIAL='OP ID:',                                       X00040   
               LENGTH=6,                                               X00041   
               COLOR=NEUTRAL,                                          X00042   
               POS=(02,30)                                              00043   
AOPER   DFHMDF ATTRB=(ASKIP),                                          X00045   
               LENGTH=4,                                               X00046   
               COLOR=BLUE,                                             X00047   
               PICOUT='ZZZ9',                                          X00048   
               POS=(02,37)                                              00049   
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00050   
               LENGTH=4,                                               X00051   
               COLOR=BLUE,                                             X00052   
               PICOUT='9999',                                          X00053   
               POS=(02,42)                                              00054   
AFCLNAM DFHMDF ATTRB=(ASKIP),                                          X00055   
               LENGTH=25,                                              X00056   
               COLOR=BLUE,                                             X00057   
               POS=(02,48)                                              00058   
*                                                                       00059   
*      LINE 3                                                           00059   
*                                                                       00059   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR PCKSLP QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(03,02)                                              00064   
ATPSLPQ DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZZ',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(03,20)                                              00069   
*-------------------------------------------------------------------*           
* ADDED NEW FIELD DEPT AT THE HEADER.              WR # 230ZZ       *           
*-------------------------------------------------------------------*           
        DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DEPT:',                                        X        
               LENGTH=05,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(03,30)                                                      
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=03,                                              X        
               COLOR=BLUE,                                             X        
               POS=(03,36)                                                      
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*                                                                       00079   
*      LINE 4                                                           00079   
*                                                                       00079   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR ACTUAL QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(04,02)                                              00064   
ATACTLQ DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZZ',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(04,20)                                              00069   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR STATUS:',                                 X00061   
               LENGTH=12,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(04,30)                                              00064   
ARCSTAT DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=2,                                               X00066   
               COLOR=BLUE,                                             X00068   
               POS=(04,44)                                              00069   
ARCVFYA DFHMDF ATTRB=(ASKIP),                                          X00070   
               LENGTH=28,                                              X00071   
               COLOR=BLUE,                                             X00072   
               POS=(04,49)                                              00073   
*                                                                       00079   
*      LINE 5                                                           00079   
*                                                                       00079   
*                                                                       00079   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00060   
               INITIAL='RCVR VERFYD QTY:',                             X00061   
               LENGTH=16,                                              X00062   
               COLOR=NEUTRAL,                                          X00063   
               POS=(05,02)                                              00064   
ATVFYDQ DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=7,                                               X00066   
               PICOUT='ZZZZZZZ',                                       X00067   
               COLOR=BLUE,                                             X00068   
               POS=(05,20)                                              00069   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00074   
               INITIAL='ITEMS',                                        X00075   
               COLOR=NEUTRAL,                                          X00076   
               LENGTH=5,                                               X00077   
               POS=(05,40)                                              00078   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00080   
               JUSTIFY=(LEFT,BLANK),                                   X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               PICOUT='ZZZZZ',                                         X00084   
               LENGTH=5,                                               X00085   
               POS=(05,47)                                              00086   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00088   
               INITIAL='TO',                                           X00089   
               COLOR=NEUTRAL,                                          X00090   
               LENGTH=2,                                               X00091   
               POS=(05,53)                                              00092   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00093   
               JUSTIFY=(LEFT,BLANK),                                   X00094   
               COLOR=BLUE,                                             X00095   
               PICOUT='ZZZZZ',                                         X00096   
               LENGTH=5,                                               X00097   
               POS=(05,56)                                              00098   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00100   
               INITIAL='OF',                                           X00101   
               COLOR=NEUTRAL,                                          X00102   
               LENGTH=2,                                               X00103   
               POS=(05,62)                                              00104   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00105   
               JUSTIFY=(LEFT,BLANK),                                   X00106   
               COLOR=BLUE,                                             X00107   
               PICOUT='ZZZZZ',                                         X00108   
               LENGTH=5,                                               X00109   
               POS=(05,65)                                              00110   
*                                                                       00132   
*      LINE 7 COLUMN HEADINGS                                           00132   
*                                                                       00132   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL='PCKSLP',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(07,40)                                              00126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL='ACTUAL',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(07,50)                                              00126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL='VERFYD',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(07,60)                                              00126**2
*                                                                       00111   
*      LINE 8 COLUMN HEADINGS                                           00111   
*                                                                       00111   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00112   
               INITIAL='SEL    ACT',                                   X00113**2
               COLOR=NEUTRAL,                                          X00114   
               LENGTH=10,                                              X00115**2
               POS=(08,2)                                               00116   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00117   
               INITIAL='LINE NO',                                      X00118**2
               COLOR=NEUTRAL,                                          X00119   
               LENGTH=7,                                               X00120**2
               POS=(08,16)                                              00121**2
*-------------------------------------------------------------------*           
* CHANGED THE LABEL OF SKU.                           WR # 230ZZ    *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00133   
               INITIAL='CL --SKU---',                                  X00134   
               COLOR=NEUTRAL,                                          X00135   
               LENGTH=11,                                              X00136   
               POS=(08,28)                                              00137   
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL=' QTY  ',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(08,41)                                              00126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL=' QTY  ',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(08,51)                                              00126**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00122   
               INITIAL=' QTY  ',                                       X00123   
               COLOR=NEUTRAL,                                          X00124   
               LENGTH=6,                                               X00125   
               POS=(08,61)                                              00126**2
*                                                                       00132   
*      LINES 9 THRU 18 - DETAIL LINES                                   00132   
*                                                                       00132   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(09,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(09,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(09,9)                                               00146**2
APO01    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(09,14)                                              00151   
*-------------------------------------------------------------------*           
* LENGTH OF THE SKU IS CHANGED FROM 10 TO 11 THROUGH OUT THE MAP    *           
*                                                     WR # 230ZZ    *           
*-------------------------------------------------------------------*           
ASKU01   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(09,28)                                              00161**2
APKSL01  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(09,41)                                              00156**2
AACTQ01  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(09,51)                                              00156**2
AVFYQ01  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(09,61)                                              00156**2
*                                                                       00162   
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(10,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(10,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(10,9)                                               00146**2
APO02    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(10,14)                                              00151   
ASKU02   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(10,28)                                              00161**2
APKSL02  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(10,41)                                              00156**2
AACTQ02  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(10,51)                                              00156**2
AVFYQ02  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(10,61)                                              00156**2
*                                                                       00162   
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(11,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(11,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(11,9)                                               00146**2
APO03    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(11,14)                                              00151   
ASKU03   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(11,28)                                              00161**2
APKSL03  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(11,41)                                              00156**2
AACTQ03  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(11,51)                                              00156**2
AVFYQ03  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(11,61)                                              00156**2
*                                                                       00162   
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(12,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(12,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(12,9)                                               00146**2
APO04    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(12,14)                                              00151   
ASKU04   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(12,28)                                              00161**2
APKSL04  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(12,41)                                              00156**2
AACTQ04  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(12,51)                                              00156**2
AVFYQ04  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(12,61)                                              00156**2
*                                                                       00162   
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(13,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(13,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(13,9)                                               00146**2
APO05    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(13,14)                                              00151   
ASKU05   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(13,28)                                              00161**2
APKSL05  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(13,41)                                              00156**2
AACTQ05  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(13,51)                                              00156**2
AVFYQ05  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(13,61)                                              00156**2
*                                                                       00162   
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(14,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(14,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(14,9)                                               00146**2
APO06    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(14,14)                                              00151   
ASKU06   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(14,28)                                              00161**2
APKSL06  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(14,41)                                              00156**2
AACTQ06  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(14,51)                                              00156**2
AVFYQ06  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(14,61)                                              00156**2
*                                                                       00162   
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(15,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(15,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(15,9)                                               00146**2
APO07    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(15,14)                                              00151   
ASKU07   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(15,28)                                              00161**2
APKSL07  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(15,41)                                              00156**2
AACTQ07  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(15,51)                                              00156**2
AVFYQ07  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(15,61)                                              00156**2
*                                                                       00162   
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(16,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(16,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(16,9)                                               00146**2
APO08    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(16,14)                                              00151   
ASKU08   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(16,28)                                              00161**2
APKSL08  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(16,41)                                              00156**2
AACTQ08  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(16,51)                                              00156**2
AVFYQ08  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(16,61)                                              00156**2
*                                                                       00162   
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(17,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(17,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(17,9)                                               00146**2
APO09    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(17,14)                                              00151   
ASKU09   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(17,28)                                              00161**2
APKSL09  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(17,41)                                              00156**2
AACTQ09  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(17,51)                                              00156**2
AVFYQ09  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(17,61)                                              00156**2
*                                                                       00162   
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00133   
               COLOR=GREEN,                                            X00134   
               HILIGHT=UNDERLINE,                                      X00135   
               LENGTH=1,                                               X00136   
               POS=(18,3)                                               00137   
         DFHMDF ATTRB=(ASKIP),                                         X00138   
               POS=(18,5),                                             X00139   
               INITIAL=' ',                                            X00140   
               LENGTH=1                                                 00141   
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00143   
               COLOR=BLUE,                                             X00144   
               LENGTH=3,                                               X00145   
               POS=(18,9)                                               00146**2
APO10    DFHMDF ATTRB=(ASKIP),                                         X00148   
               COLOR=BLUE,                                             X00149   
               LENGTH=8,                                               X00150   
               POS=(18,14)                                              00151   
ASKU10   DFHMDF ATTRB=(ASKIP),                                         X00158   
               COLOR=BLUE,                                             X00159   
               LENGTH=11,                                              X00160   
               POS=(18,28)                                              00161**2
APKSL10  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(18,41)                                              00156**2
AACTQ10  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(18,51)                                              00156**2
AVFYQ10  DFHMDF ATTRB=(ASKIP),                                         X00153   
               COLOR=BLUE,                                             X00154   
               LENGTH=5,                                               X00155   
               POS=(18,61)                                              00156**2
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*                                                                       00162   
*                                                                       00162   
*                                                                       00522   
*        LINE 19                                                        00523   
*                                                                       00524   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00525   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00526   
               COLOR=NEUTRAL,                                          X00527   
               LENGTH=25,                                              X00528   
               POS=(19,39)                                              00529   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00530   
               JUSTIFY=(LEFT,BLANK),                                   X00531   
               COLOR=BLUE,                                             X00532   
               PICOUT='ZZZZZZZ',                                       X00533   
               LENGTH=7,                                               X00534   
               POS=(19,66)                                              00535   
*                                                                       00536   
         DFHMSD TYPE=FINAL                                              00537   
         END                                                            00538   
