  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  RCKM836                                            *   00004   
*        MAP     RC836A                                             *   00005   
*        PROGRAM RCKCS836                                           *   00006   
*        TRANSID E836 - RECEIVING TRACKING CRIT SPEC                *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
RCKM836 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
RC836A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER THE NECESSARY DATA TO LOOK AT RECEIVING TX00022   
               RACKING RECORDS:',                                      X00024   
               LENGTH=63,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026**2
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='OPER UNIT ID.....:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(04,06)                                              00032**3
AOPRUNT DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(04,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(04,30)                                              00042**3
AOPRDSC DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               LENGTH=30,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(04,35)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PURCHASE ORDER...:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(06,06)                                              00032**3
APO     DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=09,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(06,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(06,35)                                              00042**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='RECEIVER SEQ NBR.:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(07,06)                                              00032**3
ARECSEQ DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=03,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(07,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(07,29)                                              00042**3
*                                                                       00073   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='LINE NUMBER......:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(08,06)                                              00032**3
ALINNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=4,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(08,30)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PACK NUMBER......:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(09,06)                                              00032**3
APAKNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=4,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(09,30)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='USER ID..........:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(10,06)                                              00032**3
AUSERID DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=8,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(10,34)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='REQUEST FROM DATE:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,06)                                              00032**3
AREQFMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,25)                                              00037**5
AREQFDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,28)                                              00037**5
AREQFYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,31)                                              00037**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='TO DATE:',                                     X00060   
               LENGTH=08,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,36)                                              00032**3
AREQTMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,45)                                              00037**5
AREQTDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,48)                                              00037**5
AREQTYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,51)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(12,56)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='MM DD YYYY',                                   X00060   
               LENGTH=10,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,58)                                              00032**3
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(12,69)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PO NUMBER OR USER ID ARE REQUIRED',            X00029**3
               LENGTH=33,                                              X00030**3
               COLOR=RED,                                              X00035**3
               POS=(14,06)                                              00032**3
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
