*       MAPSET  - RCKM299                                               00003   
*       MAP     - RC299A                                                00004   
*       PROGRAM - RCKCS299                                              00005   
*       TRANSID - E299                                                  00006   
*       SYSTEM  - CICS ARCHTECTURE (NEW) - RECEIVER                     00007   
*                                                                       00010   
  PRINT  NOGEN                                                          00009   
*                                                                       00010   
RCKM299  DFHMSD TYPE=&&SYSPARM,                                        X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TERM=3270-2,                                            X00015   
               TIOAPFX=YES                                              00016   
RC299A   DFHMDI SIZE=(19,080),                                         X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT),                                 X00019   
               LINE=02,                                                X00020   
               COLUMN=01,                                              X00021   
               CTRL=(FREEKB)                                            00022   
*      LINE 2                                                           00024*11
        DFHMDF POS=(02,01),                                            X00025*11
               LENGTH=05,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='OPER:'                                          00029*11
AOPER   DFHMDF POS=(02,07),                                            X00030*11
               LENGTH=04,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
ADESC   DFHMDF POS=(02,12),                                            X00045*15
               LENGTH=30,                                              X00046*15
               ATTRB=(ASKIP,NORM),                                     X00045*15
               COLOR=BLUE                                               00047*15
        DFHMDF POS=(02,51),                                            X00044*11
               LENGTH=05,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='ITEMS'                                          00048*11
ASTRTIT DFHMDF POS=(02,57),                                            X00049*11
               LENGTH=05,                                              X00050*11
               ATTRB=(NUM,UNPROT,NORM),                                X00051*11
               COLOR=GREEN,                                            X00052*11
               HILIGHT=UNDERLINE,                                      X00053*11
               PICOUT='ZZZZ9'                                           00054*11
        DFHMDF POS=(02,63),                                            X00055*11
               LENGTH=02,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               COLOR=NEUTRAL,                                          X00058*11
               INITIAL='TO'                                             00059*11
AENDIT  DFHMDF POS=(02,66),                                            X00060*11
               LENGTH=05,                                              X00061*11
               ATTRB=(ASKIP,NORM),                                     X00062*11
               COLOR=BLUE,                                             X00063*11
               PICOUT='ZZZZ9'                                           00064*11
        DFHMDF POS=(02,72),                                            X00065*11
               LENGTH=02,                                              X00066*11
               ATTRB=(ASKIP,NORM),                                     X00067*11
               COLOR=NEUTRAL,                                          X00068*11
               INITIAL='OF'                                             00069*11
ATOTIT  DFHMDF POS=(02,75),                                            X00070*11
               LENGTH=05,                                              X00071*11
               ATTRB=(ASKIP,NORM),                                     X00072*11
               COLOR=BLUE,                                             X00073*11
               PICOUT='ZZZZ9'                                           00074*11
*      LINE 3                                                           00075*11
ASEQMSG  DFHMDF POS=(03,001),                                          X00040   
               COLOR=YELLOW,                                           X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=024,                                             X00043   
               INITIAL='                        '                       00039   
        DFHMDF POS=(03,50),                                            X00044*11
               LENGTH=29,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='P'                                              00048*11
*      LINE 4                                                           00075*11
        DFHMDF POS=(04,10),                                            X00044*11
               LENGTH=07,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='PROCESS'                                        00048*11
        DFHMDF POS=(04,31),                                            X00044*11
               LENGTH=03,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='DPT'                                            00048*11
        DFHMDF POS=(04,50),                                            X00044*11
               LENGTH=29,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='K ARRIVAL  RCVR          SPND'                  00048*11
*      LINE 5                                                           00075*11
        DFHMDF POS=(05,01),                                            X00097*12
               LENGTH=45,                                              X00098*11
               ATTRB=(ASKIP,NORM),                                     X00099*11
               COLOR=NEUTRAL,                                          X00100*11
               INITIAL='SEL ACT  AREA    PO/RECEIVER  NBR VENDOR NAME'  00101*11
        DFHMDF POS=(05,50),                                            X00044*11
               LENGTH=29,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='G DATE     STATUS       LINES'                  00048*11
*      LINE 6                                                           00127*11
ASEL01  DFHMDF POS=(06,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(06,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT01  DFHMDF POS=(06,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(06,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA01 DFHMDF POS=(06,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO01   DFHMDF POS=(06,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT01 DFHMDF POS=(06,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND01 DFHMDF POS=(06,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG01  DFHMDF POS=(06,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE01  DFHMDF POS=(06,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT01 DFHMDF POS=(06,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP01 DFHMDF POS=(06,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 7                                                           00127*11
ASEL02  DFHMDF POS=(07,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(07,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT02  DFHMDF POS=(07,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(07,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA02 DFHMDF POS=(07,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO02   DFHMDF POS=(07,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT02 DFHMDF POS=(07,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND02 DFHMDF POS=(07,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG02  DFHMDF POS=(07,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE02  DFHMDF POS=(07,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT02 DFHMDF POS=(07,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP02 DFHMDF POS=(07,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 8                                                           00127*11
ASEL03  DFHMDF POS=(08,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(08,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT03  DFHMDF POS=(08,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(08,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA03 DFHMDF POS=(08,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO03   DFHMDF POS=(08,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT03 DFHMDF POS=(08,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND03 DFHMDF POS=(08,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG03  DFHMDF POS=(08,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE03  DFHMDF POS=(08,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT03 DFHMDF POS=(08,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP03 DFHMDF POS=(08,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 9                                                           00127*11
ASEL04  DFHMDF POS=(09,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(09,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT04  DFHMDF POS=(09,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(09,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA04 DFHMDF POS=(09,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO04   DFHMDF POS=(09,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT04 DFHMDF POS=(09,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND04 DFHMDF POS=(09,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG04  DFHMDF POS=(09,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE04  DFHMDF POS=(09,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT04 DFHMDF POS=(09,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP04 DFHMDF POS=(09,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 10                                                          00127*11
ASEL05  DFHMDF POS=(10,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(10,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT05  DFHMDF POS=(10,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(10,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA05 DFHMDF POS=(10,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO05   DFHMDF POS=(10,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT05 DFHMDF POS=(10,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND05 DFHMDF POS=(10,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG05  DFHMDF POS=(10,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE05  DFHMDF POS=(10,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT05 DFHMDF POS=(10,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP05 DFHMDF POS=(10,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 11                                                          00127*11
ASEL06  DFHMDF POS=(11,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(11,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT06  DFHMDF POS=(11,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(11,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA06 DFHMDF POS=(11,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO06   DFHMDF POS=(11,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT06 DFHMDF POS=(11,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND06 DFHMDF POS=(11,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG06  DFHMDF POS=(11,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE06  DFHMDF POS=(11,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT06 DFHMDF POS=(11,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP06 DFHMDF POS=(11,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 12                                                          00127*11
ASEL07  DFHMDF POS=(12,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(12,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT07  DFHMDF POS=(12,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(12,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA07 DFHMDF POS=(12,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO07   DFHMDF POS=(12,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT07 DFHMDF POS=(12,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND07 DFHMDF POS=(12,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG07  DFHMDF POS=(12,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE07  DFHMDF POS=(12,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT07 DFHMDF POS=(12,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP07 DFHMDF POS=(12,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 13                                                          00127*11
ASEL08  DFHMDF POS=(13,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(13,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT08  DFHMDF POS=(13,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(13,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA08 DFHMDF POS=(13,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO08   DFHMDF POS=(13,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT08 DFHMDF POS=(13,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND08 DFHMDF POS=(13,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG08  DFHMDF POS=(13,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE08  DFHMDF POS=(13,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT08 DFHMDF POS=(13,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP08 DFHMDF POS=(13,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 14                                                          00127*11
ASEL09  DFHMDF POS=(14,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(14,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT09  DFHMDF POS=(14,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(14,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA09 DFHMDF POS=(14,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO09   DFHMDF POS=(14,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT09 DFHMDF POS=(14,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND09 DFHMDF POS=(14,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG09  DFHMDF POS=(14,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE09  DFHMDF POS=(14,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT09 DFHMDF POS=(14,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP09 DFHMDF POS=(14,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 15                                                          00127*11
ASEL10  DFHMDF POS=(15,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(15,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT10  DFHMDF POS=(15,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(15,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA10 DFHMDF POS=(15,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO10   DFHMDF POS=(15,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT10 DFHMDF POS=(15,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND10 DFHMDF POS=(15,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG10  DFHMDF POS=(15,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE10  DFHMDF POS=(15,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT10 DFHMDF POS=(15,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP10 DFHMDF POS=(15,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 16                                                          00127*11
ASEL11  DFHMDF POS=(16,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(16,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT11  DFHMDF POS=(16,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(16,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA11 DFHMDF POS=(16,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO11   DFHMDF POS=(16,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT11 DFHMDF POS=(16,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND11 DFHMDF POS=(16,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG11  DFHMDF POS=(16,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE11  DFHMDF POS=(16,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT11 DFHMDF POS=(16,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP11 DFHMDF POS=(16,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*      LINE 17                                                          00127*11
ASEL12  DFHMDF POS=(17,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
        DFHMDF POS=(17,04),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AACT12  DFHMDF POS=(17,05),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
        DFHMDF POS=(17,09),                                            X00133*11
               LENGTH=00,                                              X00134*11
               ATTRB=(ASKIP)                                            00135*11
AAREA12 DFHMDF POS=(17,10),                                            X00140*12
               LENGTH=06,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
APO12   DFHMDF POS=(17,17),                                            X00144*12
               LENGTH=13,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ADEPT12 DFHMDF POS=(17,31),                                            X00144*12
               LENGTH=03,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
AVEND12 DFHMDF POS=(17,35),                                            X00148*12
               LENGTH=14,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
APKG12  DFHMDF POS=(17,50),                                            X00152*12
               LENGTH=01,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ADTE12  DFHMDF POS=(17,52),                                            X00152*12
               LENGTH=08,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASTAT12 DFHMDF POS=(17,61),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASUSP12 DFHMDF POS=(17,74),                                            X00156*12
               LENGTH=04,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE,                                             X00159*11
               PICOUT='ZZZ9'                                            00164*12
*                                                                       00738*11
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               C00739*12
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00740*12
ASELIT  DFHMDF POS=(19,71),LENGTH=07,ATTRB=(ASKIP,NORM),               C00741*12
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00742*11
**************                                                          00747*11
        DFHMSD TYPE=FINAL                                               00748*11
**************                                                          00749*11
        END                                                             00750*11
