*          DATA SET RCKM219    AT LEVEL 012 AS OF 04/22/94                      
*          DATA SET RCKM219                                             00001**2
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  RCKM219                                            *   00005**2
*        MAP     RC219A                                             *   00006**2
*        PROGRAM RCKCS219                                           *   00007**2
*        TRANSID E219 - VERIFIED COUNT CRITERIA SPEC                *   00008**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
RCKM219 DFHMSD TYPE=MAP,                                               X00012**2
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES,                                            X00015   
               CTRL=(FREEKB)                                            00016   
RC219A  DFHMDI LINE=2,COLUMN=1,                                        X00017**2
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
*                                                                       00021   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00022   
               INITIAL='ENTER OP ID, PO NUMBER, RCVR SEQ NO, AND OPTIONX00023**5
               ALY PO LINE NO',                                        X00024*10
               LENGTH=61,                                              X00025**5
               COLOR=NEUTRAL,                                          X00026   
               POS=(03,05)                                              00027   
*                                                                       00028   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00029**2
               INITIAL='FOR VRFY LST OR PACK LST.',                    X00030**5
               LENGTH=25,                                              X00032*10
               COLOR=NEUTRAL,                                          X00033**2
               POS=(04,05)                                              00034**2
*                                                                       00028   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00029**2
               INITIAL='ALL LISTED FIELDS ARE REQUIRED FOR STR LINE OR X00030**5
               STR PACK.',                                             X00031*10
               LENGTH=56,                                              X00032*10
               COLOR=NEUTRAL,                                          X00033**2
               POS=(05,05)                                              00034**2
*                                                                       00035**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00036   
               INITIAL='OP ID......:',                                 X00037**5
               LENGTH=12,                                              X00038**2
               COLOR=NEUTRAL,                                          X00039   
               POS=(07,18)                                              00040**5
*                                                                       00041   
AOPER   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00042**8
               LENGTH=4,                                               X00043**5
               COLOR=GREEN,                                            X00044   
               HILIGHT=UNDERLINE,                                      X00045   
               POS=(07,31)                                              00046**5
*                                                                       00058**5
AOPNAME DFHMDF ATTRB=(ASKIP),                                          X00054**5
               LENGTH=25,                                              X00055**5
               COLOR=BLUE,                                             X00056**5
               POS=(07,36)                                              00057**9
*                                                                       00058**5
        DFHMDF ATTRB=(ASKIP),                                          X00072**5
               LENGTH=1,                                               X00073**5
               COLOR=NEUTRAL,                                          X00074**5
               POS=(07,62)                                              00075*11
*                                                                       00058**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00059**5
               INITIAL='PO NUMBER..:',                                 X00060**5
               LENGTH=12,                                              X00061**5
               COLOR=NEUTRAL,                                          X00062**5
               POS=(08,18)                                              00063**5
*                                                                       00064**5
APONBR  DFHMDF ATTRB=(UNPROT,NORM,NUM,IC),                             X00065**5
               LENGTH=8,                                               X00066*11
               PICOUT='Z(8)',                                          X00067*12
               COLOR=GREEN,                                            X00068**5
               HILIGHT=UNDERLINE,                                      X00069**5
               POS=(08,31)                                              00070**5
*                                                                       00071**5
        DFHMDF ATTRB=(ASKIP),                                          X00072**5
               LENGTH=1,                                               X00073**5
               COLOR=NEUTRAL,                                          X00074**5
               POS=(08,40)                                              00075*11
*                                                                       00064**5
APKGTYP DFHMDF ATTRB=(ASKIP,BRT),                                      X00065**5
               LENGTH=8,                                               X00066*11
               COLOR=BLUE,                                             X00068**5
               POS=(08,42)                                              00070**5
*                                                                       00071**5
        DFHMDF ATTRB=(ASKIP),                                          X00072**5
               LENGTH=1,                                               X00073**5
               COLOR=NEUTRAL,                                          X00074**5
               POS=(08,51)                                              00075*11
*                                                                       00076   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00077**2
               INITIAL='RCVR SEQ NO:',                                 X00078**2
               LENGTH=12,                                              X00079**2
               COLOR=NEUTRAL,                                          X00080**2
               POS=(09,18)                                              00081**5
*                                                                       00082**2
ARCNBR  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00083**2
               LENGTH=4,                                               X00084**2
               COLOR=GREEN,                                            X00085**2
               HILIGHT=UNDERLINE,                                      X00086**2
               POS=(09,31)                                              00087**5
*                                                                       00088**2
        DFHMDF ATTRB=(ASKIP),                                          X00089**2
               LENGTH=1,                                               X00090**2
               COLOR=NEUTRAL,                                          X00091**2
               POS=(09,36)                                              00092**5
*                                                                       00093**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00094**2
               INITIAL='PO LINE NO.:',                                 X00095**2
               LENGTH=12,                                              X00096**2
               COLOR=NEUTRAL,                                          X00097**2
               POS=(10,18)                                              00098**5
*                                                                       00099**2
APOLNBR DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00100**2
               LENGTH=4,                                               X00101**2
               COLOR=GREEN,                                            X00102**2
               HILIGHT=UNDERLINE,                                      X00103**2
               POS=(10,31)                                              00104**5
*                                                                       00105**2
        DFHMDF ATTRB=(ASKIP),                                          X00106**2
               LENGTH=1,                                               X00107**2
               COLOR=NEUTRAL,                                          X00108**2
               POS=(10,36)                                              00109**5
*                                                                       00110**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00111**5
               INITIAL='STORE NO...:',                                 X00112**5
               LENGTH=12,                                              X00113**5
               COLOR=NEUTRAL,                                          X00114**5
               POS=(11,18)                                              00115**5
*                                                                       00116**5
ASTRNBR DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00117**5
               LENGTH=4,                                               X00118**5
               COLOR=GREEN,                                            X00119**5
               HILIGHT=UNDERLINE,                                      X00120**5
               POS=(11,31)                                              00121**5
*                                                                       00122**5
        DFHMDF ATTRB=(ASKIP),                                          X00123**5
               LENGTH=1,                                               X00124**5
               COLOR=NEUTRAL,                                          X00125**5
               POS=(11,36)                                              00126**5
*                                                                       00127**2
         DFHMSD TYPE=FINAL                                              00128   
         END                                                            00129   
