        PRINT  NOGEN                                                    00010053
RCKM816 DFHMSD TYPE=DSECT,                                             X00020053
               LANG=COBOL,                                             X00030053
               MODE=INOUT,                                             X00040053
               STORAGE=AUTO,                                           X00050053
               TERM=3270-2,                                            X00060053
               TIOAPFX=YES                                              00070053
**************************************************************          00080053
RC816A  DFHMDI LINE=2,COLUMN=1,                                        X00090053
               SIZE=(19,80),                                           X00100053
               CTRL=(FREEKB),                                          X00110053
               MAPATTS=(COLOR,HILIGHT),                                X00120053
               DSATTS=(COLOR,HILIGHT)                                   00130053
**************************************************************          00140053
        DFHMDF POS=(01,01),                                            X00150053
               LENGTH=10,                                              X00160053
               ATTRB=(ASKIP,NORM),                                     X00170053
               COLOR=NEUTRAL,                                          X00180053
               INITIAL='PO-RCVR..:'                                     00190053
APORCVR DFHMDF POS=(01,12),                                            X00200053
               LENGTH=13,                                              X00210053
               ATTRB=(ASKIP,NORM),                                     X00220053
               COLOR=BLUE                                               00230053
AREPLEN DFHMDF POS=(01,27),                                            X00231054
               LENGTH=05,                                              X00232054
               ATTRB=(ASKIP,NORM),                                     X00233054
               COLOR=BLUE                                               00234054
        DFHMDF POS=(01,34),                                            X00240053
               LENGTH=11,                                              X00250053
               ATTRB=(ASKIP,NORM),                                     X00260053
               COLOR=NEUTRAL,                                          X00270053
               INITIAL='SCAC......:'                                    00280053
ASCAC   DFHMDF POS=(01,46),                                            X00290053
               LENGTH=04,                                              X00300053
               ATTRB=(ASKIP,NORM),                                     X00310053
               COLOR=BLUE                                               00320053
        DFHMDF POS=(01,60),                                            X00330053
               LENGTH=10,                                              X00340053
               ATTRB=(ASKIP,NORM),                                     X00350053
               COLOR=NEUTRAL,                                          X00360053
               INITIAL='TRIP ID..:'                                     00370053
ATRIPID DFHMDF POS=(01,71),                                            X00380053
               LENGTH=09,                                              X00390053
               ATTRB=(NUM,ASKIP,NORM),                                 X00400053
               COLOR=BLUE,                                             X00410053
               PICOUT='ZZZZZZZZZ'                                       00420053
**************************************************************          00430053
        DFHMDF POS=(02,01),                                            X00440053
               LENGTH=10,                                              X00450053
               ATTRB=(ASKIP,NORM),                                     X00460053
               COLOR=NEUTRAL,                                          X00470053
               INITIAL='VENDOR...:'                                     00480053
AVENDOR DFHMDF POS=(02,12),                                            X00490053
               LENGTH=20,                                              X00500053
               ATTRB=(ASKIP,NORM),                                     X00510053
               COLOR=BLUE                                               00520053
        DFHMDF POS=(02,34),                                            X00530053
               LENGTH=11,                                              X00540053
               ATTRB=(ASKIP,NORM),                                     X00550053
               COLOR=NEUTRAL,                                          X00560053
               INITIAL='TRAILER NO:'                                    00570053
ATRLRNO DFHMDF POS=(02,46),                                            X00580053
               LENGTH=10,                                              X00590053
               ATTRB=(ASKIP,NORM),                                     X00600053
               COLOR=BLUE                                               00610053
        DFHMDF POS=(02,60),                                            X00620053
               LENGTH=10,                                              X00630053
               ATTRB=(ASKIP,NORM),                                     X00640053
               COLOR=NEUTRAL,                                          X00650053
               INITIAL='STATUS...:'                                     00660053
ASTATUS DFHMDF POS=(02,71),                                            X00670053
               LENGTH=02,                                              X00680053
               ATTRB=(ASKIP,NORM),                                     X00690053
               COLOR=BLUE                                               00700053
        DFHMDF POS=(02,74),                                            X00710053
               LENGTH=01,                                              X00720053
               ATTRB=(ASKIP,DRK)                                        00730053
**************************************************************          00740053
        DFHMDF POS=(04,01),                                            X00750053
               LENGTH=10,                                              X00760053
               ATTRB=(ASKIP,NORM),                                     X00770053
               COLOR=NEUTRAL,                                          X00780053
               INITIAL='TRBL RSN.:'                                     00790053
ATRBRSN DFHMDF POS=(04,12),                                            X00800053
               LENGTH=20,                                              X00810053
               ATTRB=(ASKIP,NORM),                                     X00820053
               COLOR=BLUE                                               00830053
        DFHMDF POS=(04,34),                                            X00840053
               LENGTH=11,                                              X00850053
               ATTRB=(ASKIP,NORM),                                     X00860053
               COLOR=NEUTRAL,                                          X00870053
               INITIAL='NEW STORE.:'                                    00880053
ANEWSTR DFHMDF POS=(04,46),                                            X00890053
               LENGTH=01,                                              X00900053
               ATTRB=(ASKIP,NORM),                                     X00910053
               COLOR=BLUE                                               00920053
        DFHMDF POS=(04,60),                                            X00930053
               LENGTH=10,                                              X00940053
               ATTRB=(ASKIP,NORM),                                     X00950053
               COLOR=NEUTRAL,                                          X00960053
               INITIAL='SET NAME.:'                                     00970053
ASETNM  DFHMDF POS=(04,71),                                            X00980053
               LENGTH=05,                                              X00990053
               ATTRB=(ASKIP,NORM),                                     X01000053
               COLOR=BLUE                                               01010053
        DFHMDF POS=(04,77),                                            X01020053
               LENGTH=01,                                              X01030053
               ATTRB=(ASKIP,DRK)                                        01040053
**************************************************************          01050053
        DFHMDF POS=(05,01),                                            X01060053
               LENGTH=10,                                              X01070053
               ATTRB=(ASKIP,NORM),                                     X01080053
               COLOR=NEUTRAL,                                          X01090053
               INITIAL='SPCL INS.:'                                     01100053
ASPCLIN DFHMDF POS=(05,12),                                            X01110053
               LENGTH=20,                                              X01120053
               ATTRB=(ASKIP,NORM),                                     X01130053
               COLOR=BLUE                                               01140053
        DFHMDF POS=(05,34),                                            X01150053
               LENGTH=11,                                              X01160053
               ATTRB=(ASKIP,NORM),                                     X01170053
               COLOR=NEUTRAL,                                          X01180053
               INITIAL='RTV.......:'                                    01190053
ARTV    DFHMDF POS=(05,46),                                            X01200053
               LENGTH=01,                                              X01210053
               ATTRB=(ASKIP,NORM),                                     X01220053
               COLOR=BLUE                                               01230053
        DFHMDF POS=(05,60),                                            X01240053
               LENGTH=10,                                              X01250053
               ATTRB=(ASKIP,NORM),                                     X01260053
               COLOR=NEUTRAL,                                          X01270053
               INITIAL='BOX ID...:'                                     01280053
ABOXID  DFHMDF POS=(05,71),                                            X01290053
               LENGTH=03,                                              X01300053
               ATTRB=(ASKIP,NORM),                                     X01310053
               COLOR=BLUE                                               01320053
        DFHMDF POS=(05,75),                                            X01330053
               LENGTH=01,                                              X01340053
               ATTRB=(ASKIP,DRK)                                        01350053
**************************************************************          01360053
        DFHMDF POS=(06,01),                                            X01370053
               LENGTH=10,                                              X01380053
               ATTRB=(ASKIP,NORM),                                     X01390053
               COLOR=NEUTRAL,                                          X01400053
               INITIAL='PRSNTATN.:'                                     01410053
APRSNTN DFHMDF POS=(06,12),                                            X01420053
               LENGTH=20,                                              X01430053
               ATTRB=(ASKIP,NORM),                                     X01440053
               COLOR=BLUE                                               01450053
        DFHMDF POS=(06,34),                                            X01460053
               LENGTH=11,                                              X01470053
               ATTRB=(ASKIP,NORM),                                     X01480053
               COLOR=NEUTRAL,                                          X01490053
               INITIAL='HANGERS...:'                                    01500053
AHANGRS DFHMDF POS=(06,46),                                            X01510053
               LENGTH=01,                                              X01520053
               ATTRB=(ASKIP,NORM),                                     X01530053
               COLOR=BLUE                                               01540053
        DFHMDF POS=(06,60),                                            X01550053
               LENGTH=10,                                              X01560053
               ATTRB=(ASKIP,NORM),                                     X01570053
               COLOR=NEUTRAL,                                          X01580053
               INITIAL='PACKAGING:'                                     01590053
APKG    DFHMDF POS=(06,71),                                            X01600053
               LENGTH=01,                                              X01610053
               ATTRB=(ASKIP,NORM),                                     X01620053
               COLOR=BLUE                                               01630053
        DFHMDF POS=(06,73),                                            X01640053
               LENGTH=01,                                              X01650053
               ATTRB=(ASKIP,DRK)                                        01660053
**************************************************************          01670053
        DFHMDF POS=(07,01),                                            X01680053
               LENGTH=10,                                              X01690053
               ATTRB=(ASKIP,NORM),                                     X01700053
               COLOR=NEUTRAL,                                          X01710053
               INITIAL='TCKT TYPE:'                                     01720053
ATKTTYP DFHMDF POS=(07,12),                                            X01730053
               LENGTH=20,                                              X01740053
               ATTRB=(ASKIP,NORM),                                     X01750053
               COLOR=BLUE                                               01760053
        DFHMDF POS=(07,34),                                            X01770053
               LENGTH=11,                                              X01780053
               ATTRB=(ASKIP,NORM),                                     X01790053
               COLOR=NEUTRAL,                                          X01800053
               INITIAL='PRETICKET.:'                                    01810053
APRETKT DFHMDF POS=(07,46),                                            X01820053
               LENGTH=01,                                              X01830053
               ATTRB=(ASKIP,NORM),                                     X01840053
               COLOR=BLUE                                               01850053
        DFHMDF POS=(07,60),                                            X01860053
               LENGTH=10,                                              X01870053
               ATTRB=(ASKIP,NORM),                                     X01880053
               COLOR=NEUTRAL,                                          X01890053
               INITIAL='PRICE CHG:'                                     01900053
APRCHG  DFHMDF POS=(07,71),                                            X01910053
               LENGTH=05,                                              X01920053
               ATTRB=(ASKIP,NORM),                                     X01930053
               COLOR=BLUE                                               01940053
        DFHMDF POS=(07,77),                                            X01950053
               LENGTH=01,                                              X01960053
               ATTRB=(ASKIP,DRK)                                        01970053
**************************************************************          01980053
        DFHMDF POS=(08,01),                                            X01990053
               LENGTH=40,                                              X02000053
               ATTRB=(ASKIP,NORM),                                     X02010053
               COLOR=NEUTRAL,                                          X02020053
               INITIAL='----------------------------------------'       02030053
        DFHMDF POS=(08,42),                                            X02040053
               LENGTH=36,                                              X02050053
               ATTRB=(ASKIP,NORM),                                     X02060053
               COLOR=NEUTRAL,                                          X02070053
               INITIAL='------------------------------------'           02080053
        DFHMDF POS=(08,79),                                            X02090053
               LENGTH=01,                                              X02100053
               ATTRB=(ASKIP,DRK)                                        02110053
**************************************************************          02120053
        DFHMDF POS=(09,01),                                            X02130053
               LENGTH=10,                                              X02140053
               ATTRB=(ASKIP,NORM),                                     X02150053
               COLOR=NEUTRAL,                                          X02160053
               INITIAL='OPER SET.:'                                     02170053
AOPER   DFHMDF POS=(09,12),                                            X02180053
               LENGTH=03,                                              X02190053
               ATTRB=(NUM,UNPROT),                                     X02200053
               COLOR=GREEN,                                            X02210053
               PICOUT='ZZ9',                                           X02220053
               HILIGHT=UNDERLINE                                        02230053
AOPRNME DFHMDF POS=(09,16),                                            X02240053
               LENGTH=16,                                              X02250053
               ATTRB=(ASKIP,NORM),                                     X02260053
               COLOR=BLUE                                               02270053
        DFHMDF POS=(09,34),                                            X02280053
               LENGTH=11,                                              X02290053
               ATTRB=(ASKIP,NORM),                                     X02300053
               COLOR=NEUTRAL,                                          X02310053
               INITIAL='VERIFIED..:'                                    02320053
AVFDDAT DFHMDF POS=(09,46),                                            X02330053
               LENGTH=05,                                              X02340053
               ATTRB=(ASKIP,NORM),                                     X02350053
               COLOR=BLUE                                               02360053
AVFDTME DFHMDF POS=(09,53),                                            X02370053
               LENGTH=05,                                              X02380053
               ATTRB=(ASKIP,NORM),                                     X02390053
               COLOR=BLUE                                               02400053
        DFHMDF POS=(09,60),                                            X02410053
               LENGTH=01,                                              X02420053
               ATTRB=(ASKIP,DRK)                                        02430053
**************************************************************          02440053
        DFHMDF POS=(10,01),                                            X02450053
               LENGTH=10,                                              X02460053
               ATTRB=(ASKIP,NORM),                                     X02470053
               COLOR=NEUTRAL,                                          X02480053
               INITIAL='RCV CLERK:'                                     02490053
ARCVCLK DFHMDF POS=(10,12),                                            X02500053
               LENGTH=03,                                              X02510053
               ATTRB=(UNPROT),                                         X02520053
               COLOR=GREEN,                                            X02530053
               HILIGHT=UNDERLINE                                        02540053
        DFHMDF POS=(10,16),                                            X02550053
               LENGTH=01,                                              X02560053
               ATTRB=(ASKIP,DRK)                                        02570053
        DFHMDF POS=(10,34),                                            X02580053
               LENGTH=11,                                              X02590053
               ATTRB=(ASKIP,NORM),                                     X02600053
               COLOR=NEUTRAL,                                          X02610053
               INITIAL='VERFD BY..:'                                    02620053
AVFDBY  DFHMDF POS=(10,46),                                            X02630053
               LENGTH=08,                                              X02640053
               ATTRB=(ASKIP,NORM),                                     X02650053
               COLOR=BLUE                                               02660053
        DFHMDF POS=(10,55),                                            X02670053
               LENGTH=01,                                              X02680053
               ATTRB=(ASKIP,DRK)                                        02690053
**************************************************************          02700053
        DFHMDF POS=(11,01),                                            X02710053
               LENGTH=10,                                              X02720053
               ATTRB=(ASKIP,NORM),                                     X02730053
               COLOR=NEUTRAL,                                          X02740053
               INITIAL='EXP CRTN.:'                                     02750053
AEXPCTN DFHMDF POS=(11,12),                                            X02760053
               LENGTH=05,                                              X02770053
               ATTRB=(NUM,ASKIP,NORM),                                 X02780053
               COLOR=BLUE,                                             X02790053
               PICOUT='ZZZZ9'                                           02800053
        DFHMDF POS=(11,34),                                            X02810053
               LENGTH=11,                                              X02820053
               ATTRB=(ASKIP,NORM),                                     X02830053
               COLOR=NEUTRAL,                                          X02840053
               INITIAL='PCS EXPTD.:'                                    02850053
APCINVC DFHMDF POS=(11,46),                                            X02860053
               LENGTH=07,                                              X02870053
               ATTRB=(NUM,ASKIP,NORM),                                 X02880053
               COLOR=BLUE,                                             X02890053
               PICOUT='ZZZZZZ9'                                         02900053
        DFHMDF POS=(11,55),                                            X02910053
               LENGTH=01,                                              X02920053
               ATTRB=(ASKIP,DRK)                                        02930053
**************************************************************          02940053
        DFHMDF POS=(12,01),                                            X02950053
               LENGTH=10,                                              X02960053
               ATTRB=(ASKIP,NORM),                                     X02970053
               COLOR=NEUTRAL,                                          X02980053
               INITIAL='ACT CRTN.:'                                     02990053
AACTCTN DFHMDF POS=(12,12),                                            X03000053
               LENGTH=05,                                              X03010053
               ATTRB=(NUM,UNPROT),                                     X03020053
               COLOR=GREEN,                                            X03030053
               HILIGHT=UNDERLINE,                                      X03040053
               PICOUT='ZZZZ9'                                           03050053
        DFHMDF POS=(12,18),                                            X03060053
               LENGTH=01,                                              X03070053
               ATTRB=(ASKIP,DRK)                                        03080053
        DFHMDF POS=(12,34),                                            X03090053
               LENGTH=11,                                              X03100053
               ATTRB=(ASKIP,NORM),                                     X03110053
               COLOR=NEUTRAL,                                          X03120053
               INITIAL='PCS VERFD.:'                                    03130053
APCSVFD DFHMDF POS=(12,46),                                            X03140053
               LENGTH=07,                                              X03150053
               ATTRB=(NUM,ASKIP,NORM),                                 X03160053
               COLOR=BLUE,                                             X03170053
               PICOUT='ZZZZZZ9'                                         03180053
        DFHMDF POS=(12,55),                                            X03190053
               LENGTH=01,                                              X03200053
               ATTRB=(ASKIP,DRK)                                        03210053
**************************************************************          03220053
        DFHMDF POS=(13,01),                                            X03230053
               LENGTH=10,                                              X03240053
               ATTRB=(ASKIP,NORM),                                     X03250053
               COLOR=NEUTRAL,                                          X03260053
               INITIAL='DMG CRTN.:'                                     03270053
ADMGCTN DFHMDF POS=(13,12),                                            X03280053
               LENGTH=05,                                              X03290053
               ATTRB=(NUM,UNPROT,NORM),                                X03300053
               COLOR=GREEN,                                            X03310053
               PICOUT='ZZZZ9',                                         X03320053
               HILIGHT=UNDERLINE                                        03330053
        DFHMDF POS=(13,18),                                            X03340053
               LENGTH=01,                                              X03350053
               ATTRB=(ASKIP,DRK)                                        03360053
**************************************************************          03370053
        DFHMDF POS=(14,45),                                            X03380053
               LENGTH=05,                                              X03390053
               ATTRB=(ASKIP,NORM),                                     X03400053
               COLOR=NEUTRAL,                                          X03410053
               INITIAL='ITEMS'                                          03420053
ASTRTIT DFHMDF POS=(14,51),                                            X03430053
               LENGTH=05,                                              X03440053
               ATTRB=(NUM,UNPROT,NORM),                                X03450053
               COLOR=GREEN,                                            X03460053
               PICOUT='ZZZZ9',                                         X03470053
               HILIGHT=UNDERLINE                                        03480053
        DFHMDF POS=(14,57),                                            X03490053
               LENGTH=02,                                              X03500053
               ATTRB=(ASKIP,NORM),                                     X03510053
               COLOR=NEUTRAL,                                          X03520053
               INITIAL='TO'                                             03530053
AENDIT  DFHMDF POS=(14,60),                                            X03540053
               LENGTH=05,                                              X03550053
               ATTRB=(ASKIP,NORM),                                     X03560053
               COLOR=BLUE,                                             X03570053
               PICOUT='ZZZZ9'                                           03580053
        DFHMDF POS=(14,66),                                            X03590053
               LENGTH=02,                                              X03600053
               ATTRB=(ASKIP,NORM),                                     X03610053
               COLOR=NEUTRAL,                                          X03620053
               INITIAL='OF'                                             03630053
ATOTIT  DFHMDF POS=(14,69),                                            X03640053
               LENGTH=05,                                              X03650053
               ATTRB=(ASKIP,NORM),                                     X03660053
               COLOR=BLUE,                                             X03670053
               PICOUT='ZZZZ9'                                           03680053
        DFHMDF POS=(14,75),                                            X03690053
               LENGTH=01,                                              X03700053
               ATTRB=(ASKIP,DRK)                                        03710053
**************************************************************          03720053
        DFHMDF POS=(15,38),                                            X03730053
               LENGTH=38,                                              X03740053
               ATTRB=(ASKIP,NORM),                                     X03750053
               COLOR=NEUTRAL,                                          X03760053
               INITIAL='  LOC     DATE    TIME    DATE    TIME'         03770053
**************************************************************          03780053
        DFHMDF POS=(16,01),                                            X03790053
               LENGTH=36,                                              X03800053
               ATTRB=(ASKIP,NORM),                                     X03810053
               COLOR=NEUTRAL,                                          X03820053
               INITIAL='SEL    SEQ   INSTRUCTION DESCRIPTION'           03830053
        DFHMDF POS=(16,40),                                            X03840053
               LENGTH=36,                                              X03850053
               ATTRB=(ASKIP,NORM),                                     X03860053
               COLOR=NEUTRAL,                                          X03870053
               INITIAL='CODE    START   START   COMP    COMP'           03880053
        DFHMDF POS=(16,80),                                            X03890053
               LENGTH=01,                                              X03900053
               ATTRB=(ASKIP,DRK)                                        03910053
**************************************************************          03920053
ASEL01  DFHMDF POS=(17,02),                                            X03930053
               LENGTH=01,                                              X03940053
               ATTRB=(UNPROT,NORM),                                    X03950053
               COLOR=GREEN,                                            X03960053
               HILIGHT=UNDERLINE                                        03970053
        DFHMDF POS=(17,04),                                            X03980053
               LENGTH=01,                                              X03990053
               ATTRB=(ASKIP,DRK)                                        04000053
ASEQ01  DFHMDF POS=(17,07),                                            X04010053
               LENGTH=04,                                              X04020053
               ATTRB=(ASKIP,NORM),                                     X04030053
               COLOR=BLUE,                                             X04040053
               PICOUT='ZZZ9'                                            04050053
AINST01 DFHMDF POS=(17,14),                                            X04060053
               LENGTH=23,                                              X04070053
               ATTRB=(ASKIP,NORM),                                     X04080053
               COLOR=BLUE                                               04090053
ALOC01  DFHMDF POS=(17,40),                                            X04100053
               LENGTH=05,                                              X04110053
               ATTRB=(UNPROT,NORM),                                    X04120053
               COLOR=GREEN,                                            X04130053
               HILIGHT=UNDERLINE                                        04140053
        DFHMDF POS=(17,46),                                            X04150053
               LENGTH=01,                                              X04160053
               ATTRB=(ASKIP,DRK)                                        04170053
ASTDT01 DFHMDF POS=(17,48),                                            X04180053
               LENGTH=05,                                              X04190053
               ATTRB=(ASKIP,NORM),                                     X04200053
               COLOR=BLUE                                               04210053
ASTTM01 DFHMDF POS=(17,56),                                            X04220053
               LENGTH=05,                                              X04230053
               ATTRB=(ASKIP,NORM),                                     X04240053
               COLOR=BLUE                                               04250053
ACMDT01 DFHMDF POS=(17,64),                                            X04260053
               LENGTH=05,                                              X04270053
               ATTRB=(ASKIP,NORM),                                     X04280053
               COLOR=BLUE                                               04290053
ACMTM01 DFHMDF POS=(17,72),                                            X04300053
               LENGTH=05,                                              X04310053
               ATTRB=(ASKIP,NORM),                                     X04320053
               COLOR=BLUE                                               04330053
**************************************************************          04340053
ASEL02  DFHMDF POS=(18,02),                                            X04350053
               LENGTH=01,                                              X04360053
               ATTRB=(UNPROT,NORM),                                    X04370053
               COLOR=GREEN,                                            X04380053
               HILIGHT=UNDERLINE                                        04390053
        DFHMDF POS=(18,04),                                            X04400053
               LENGTH=01,                                              X04410053
               ATTRB=(ASKIP,DRK)                                        04420053
ASEQ02  DFHMDF POS=(18,07),                                            X04430053
               LENGTH=04,                                              X04440053
               ATTRB=(ASKIP,NORM),                                     X04450053
               COLOR=BLUE,                                             X04460053
               PICOUT='ZZZ9'                                            04470053
AINST02 DFHMDF POS=(18,14),                                            X04480053
               LENGTH=23,                                              X04490053
               ATTRB=(ASKIP,NORM),                                     X04500053
               COLOR=BLUE                                               04510053
ALOC02  DFHMDF POS=(18,40),                                            X04520053
               LENGTH=05,                                              X04530053
               ATTRB=(UNPROT,NORM),                                    X04540053
               COLOR=GREEN,                                            X04550053
               HILIGHT=UNDERLINE                                        04560053
        DFHMDF POS=(18,46),                                            X04570053
               LENGTH=01,                                              X04580053
               ATTRB=(ASKIP,DRK)                                        04590053
ASTDT02 DFHMDF POS=(18,48),                                            X04600053
               LENGTH=05,                                              X04610053
               ATTRB=(ASKIP,NORM),                                     X04620053
               COLOR=BLUE                                               04630053
ASTTM02 DFHMDF POS=(18,56),                                            X04640053
               LENGTH=05,                                              X04650053
               ATTRB=(ASKIP,NORM),                                     X04660053
               COLOR=BLUE                                               04670053
ACMDT02 DFHMDF POS=(18,64),                                            X04680053
               LENGTH=05,                                              X04690053
               ATTRB=(ASKIP,NORM),                                     X04700053
               COLOR=BLUE                                               04710053
ACMTM02 DFHMDF POS=(18,72),                                            X04720053
               LENGTH=05,                                              X04730053
               ATTRB=(ASKIP,NORM),                                     X04740053
               COLOR=BLUE                                               04750053
**************************************************************          04760053
ASEL03  DFHMDF POS=(19,02),                                            X04770053
               LENGTH=01,                                              X04780053
               ATTRB=(UNPROT,NORM),                                    X04790053
               COLOR=GREEN,                                            X04800053
               HILIGHT=UNDERLINE                                        04810053
        DFHMDF POS=(19,04),                                            X04820053
               LENGTH=01,                                              X04830053
               ATTRB=(ASKIP,DRK)                                        04840053
ASEQ03  DFHMDF POS=(19,07),                                            X04850053
               LENGTH=04,                                              X04860053
               ATTRB=(ASKIP,NORM),                                     X04870053
               COLOR=BLUE,                                             X04880053
               PICOUT='ZZZ9'                                            04890053
AINST03 DFHMDF POS=(19,14),                                            X04900053
               LENGTH=23,                                              X04910053
               ATTRB=(ASKIP,NORM),                                     X04920053
               COLOR=BLUE                                               04930053
ALOC03  DFHMDF POS=(19,40),                                            X04940053
               LENGTH=05,                                              X04950053
               ATTRB=(UNPROT,NORM),                                    X04960053
               COLOR=GREEN,                                            X04970053
               HILIGHT=UNDERLINE                                        04980053
        DFHMDF POS=(19,46),                                            X04990053
               LENGTH=01,                                              X05000053
               ATTRB=(ASKIP,DRK)                                        05010053
ASTDT03 DFHMDF POS=(19,48),                                            X05020053
               LENGTH=05,                                              X05030053
               ATTRB=(ASKIP,NORM),                                     X05040053
               COLOR=BLUE                                               05050053
ASTTM03 DFHMDF POS=(19,56),                                            X05060053
               LENGTH=05,                                              X05070053
               ATTRB=(ASKIP,NORM),                                     X05080053
               COLOR=BLUE                                               05090053
ACMDT03 DFHMDF POS=(19,64),                                            X05100053
               LENGTH=05,                                              X05110053
               ATTRB=(ASKIP,NORM),                                     X05120053
               COLOR=BLUE                                               05130053
ACMTM03 DFHMDF POS=(19,72),                                            X05140053
               LENGTH=05,                                              X05150053
               ATTRB=(ASKIP,NORM),                                     X05160053
               COLOR=BLUE                                               05170053
**************************************************************          05180053
**************************************************************          05190053
        DFHMSD TYPE=FINAL                                               05200053
        END                                                             05210053
