*          DATA SET RCKM819    AT LEVEL 002 AS OF 02/10/00              00003   
        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  RCKM819                                            *   00007   
*        MAP     RC819A                                             *   00008   
*        PROGRAM RCKCS819                                           *   00009   
*        TRANSID E819 - STORE PACK ITEM LIST VERIFY                 *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
RCKM819 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
RC819A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(19,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=08,                                              X        
               INITIAL='RCVR NO:'                                       00020   
APO     DFHMDF POS=(02,11),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=08,                                              X        
               PICOUT='99999999'                                                
ARCVR   DFHMDF POS=(02,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
        DFHMDF POS=(02,32),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='OP ID......:'                                   00020   
AOPER   DFHMDF POS=(02,45),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
AFCLTY  DFHMDF POS=(02,50),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
ANAME   DFHMDF POS=(02,56),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=018                                                       
*                                                                               
        DFHMDF POS=(03,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=08,                                              X        
               INITIAL='PACK NO:'                                       00020   
APACK   DFHMDF POS=(03,11),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
ASKU    DFHMDF POS=(03,16),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=14                                                        
        DFHMDF POS=(03,32),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='PACK STATUS:'                                   00020   
ASTAT   DFHMDF POS=(03,45),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=02                                                        
ADTETK  DFHMDF POS=(03,50),                                            X00018   
               COLOR=BLUE,                                             X00022   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=28                                                        
**********************************************************************          
        DFHMDF POS=(04,02),                                            X00023   
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='STORE..:'                                       00025   
ASTORE   DFHMDF POS=(04,011),                                          X00733   
               LENGTH=004,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZ9'                                            00737   
        DFHMDF POS=(04,32),                                            X00023   
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOTAL ODD UNITS...:'                            00025   
AODD     DFHMDF POS=(04,052),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
**********************************************************************          
        DFHMDF POS=(05,02),                                            X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='PCKSLP PACKS:'                                  00025   
APCKSLP  DFHMDF POS=(05,016),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(05,32),                                            X00023   
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOTAL PKSLP UNITS.:'                            00025   
ATPKSLP  DFHMDF POS=(05,052),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*                                                                               
        DFHMDF POS=(06,02),                                            X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ACTUAL PACKS:'                                  00025   
AACTUAL  DFHMDF POS=(06,016),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(06,32),                                            X00023   
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOTAL ACTUAL UNITS:'                            00025   
ATACTUAL DFHMDF POS=(06,052),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*                                                                               
        DFHMDF POS=(07,02),                                            X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='VERFYD PACKS:'                                  00025   
AVERFYD  DFHMDF POS=(07,016),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(07,32),                                            X00023   
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOTAL VERFYD UNITS:'                            00025   
ATVERFYD DFHMDF POS=(07,052),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*******************************************************************             
        DFHMDF POS=(08,44),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(08,50),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(08,56),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(08,59),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(08,65),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(08,68),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
        DFHMDF POS=(09,12),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='UPDATE'                                         00025   
        DFHMDF POS=(09,42),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='ACTL'                                           00025   
        DFHMDF POS=(09,49),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='VRFYD'                                          00025   
        DFHMDF POS=(09,57),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='PKSLP'                                          00025   
        DFHMDF POS=(09,65),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='ACTL'                                           00025   
        DFHMDF POS=(09,71),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='VRFYD'                                          00025   
*                                                                               
        DFHMDF POS=(10,13),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ODD'                                            00025   
        DFHMDF POS=(10,35),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='PACK'                                           00025   
        DFHMDF POS=(10,43),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ODD'                                            00025   
        DFHMDF POS=(10,50),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ODD'                                            00025   
        DFHMDF POS=(10,57),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
        DFHMDF POS=(10,64),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
        DFHMDF POS=(10,71),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
*                                                                               
        DFHMDF POS=(11,02),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008,                                             X        
               INITIAL='SEL  ACT'                                       00025   
        DFHMDF POS=(11,12),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(11,19),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='LINE'                                           00025   
        DFHMDF POS=(11,27),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='SKU'                                            00025   
        DFHMDF POS=(11,35),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='RTIO'                                           00025   
        DFHMDF POS=(11,42),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(11,49),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(11,57),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(11,64),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(11,71),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
*******************************************************************             
ASEL01  DFHMDF POS=(12,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(12,05)                                              00068   
AACT01  DFHMDF POS=(12,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD01 DFHMDF POS=(12,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE01 DFHMDF POS=(12,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU01 DFHMDF POS=(12,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO01 DFHMDF POS=(12,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD01 DFHMDF POS=(12,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD01 DFHMDF POS=(12,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT01 DFHMDF POS=(12,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT01 DFHMDF POS=(12,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT01 DFHMDF POS=(12,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL02  DFHMDF POS=(13,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(13,05)                                              00068   
AACT02  DFHMDF POS=(13,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD02 DFHMDF POS=(13,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE02 DFHMDF POS=(13,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU02 DFHMDF POS=(13,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO02 DFHMDF POS=(13,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD02 DFHMDF POS=(13,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD02 DFHMDF POS=(13,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT02 DFHMDF POS=(13,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT02 DFHMDF POS=(13,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT02 DFHMDF POS=(13,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL03  DFHMDF POS=(14,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(14,05)                                              00068   
AACT03  DFHMDF POS=(14,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD03 DFHMDF POS=(14,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE03 DFHMDF POS=(14,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU03 DFHMDF POS=(14,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO03 DFHMDF POS=(14,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD03 DFHMDF POS=(14,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD03 DFHMDF POS=(14,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT03 DFHMDF POS=(14,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT03 DFHMDF POS=(14,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT03 DFHMDF POS=(14,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL04  DFHMDF POS=(15,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(15,05)                                              00068   
AACT04  DFHMDF POS=(15,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD04 DFHMDF POS=(15,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE04 DFHMDF POS=(15,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU04 DFHMDF POS=(15,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO04 DFHMDF POS=(15,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD04 DFHMDF POS=(15,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD04 DFHMDF POS=(15,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT04 DFHMDF POS=(15,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT04 DFHMDF POS=(15,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT04 DFHMDF POS=(15,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL05  DFHMDF POS=(16,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(16,05)                                              00068   
AACT05  DFHMDF POS=(16,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD05 DFHMDF POS=(16,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE05 DFHMDF POS=(16,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU05 DFHMDF POS=(16,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO05 DFHMDF POS=(16,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD05 DFHMDF POS=(16,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD05 DFHMDF POS=(16,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT05 DFHMDF POS=(16,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT05 DFHMDF POS=(16,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT05 DFHMDF POS=(16,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL06  DFHMDF POS=(17,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(17,05)                                              00068   
AACT06  DFHMDF POS=(17,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD06 DFHMDF POS=(17,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE06 DFHMDF POS=(17,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU06 DFHMDF POS=(17,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO06 DFHMDF POS=(17,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD06 DFHMDF POS=(17,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD06 DFHMDF POS=(17,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT06 DFHMDF POS=(17,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT06 DFHMDF POS=(17,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT06 DFHMDF POS=(17,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
ASEL07  DFHMDF POS=(18,03),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=1,                                               X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(18,05)                                              00068   
AACT07  DFHMDF POS=(18,07),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
AUPOD07 DFHMDF POS=(18,12),                                            X00137   
               COLOR=GREEN,                                            X00138   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X00139   
               LENGTH=005                                               00140   
ALINE07 DFHMDF POS=(18,019),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
ASKU07 DFHMDF POS=(18,025),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ARTIO07 DFHMDF POS=(18,035),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
AAODD07 DFHMDF POS=(18,042),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                               00140   
AVODD07 DFHMDF POS=(18,049),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
APUNT07 DFHMDF POS=(18,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AAUNT07 DFHMDF POS=(18,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
AVUNT07 DFHMDF POS=(18,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005                                                       
**********************************************************************  00011   
         DFHMDF POS=(19,040),                                          X00728   
               COLOR=NEUTRAL,                                          X00729   
               ATTRB=(ASKIP,NORM),                                     X00730   
               LENGTH=025,                                             X00731   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,067),                                          X00733   
               COLOR=BLUE,                                             X00734   
               ATTRB=(ASKIP,NORM),                                     X00735   
               LENGTH=007,                                             X00736   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
