*          DATA SET RCKM295    AT LEVEL 011 AS OF 05/26/95                      
*          DATA SET RCKM295    AT LEVEL 009 AS OF 06/22/94              00001*10
*          DATA SET RCKM295    AT LEVEL 003 AS OF 05/05/94              00002*10
*          DATA SET RCKM295A1  AT LEVEL 014 AS OF 03/26/94              00003*11
  PRINT  NOGEN                                                          00004*10
*-------------------------------------------------------------------*   00005*10
*                                                                   *   00006*10
*        MAPSET  RCKM295                                            *   00007*10
*        MAP     RC295A                                             *   00008*10
*        PROGRAM RCKCS295                                           *   00009*10
*        TRANSID E295 - STORE DISTRIBUTION                          *   00010*10
*        SYSTEM  RC NEW RECEIVING                                   *   00011*10
*                                                                   *   00012*10
*-------------------------------------------------------------------*   00013*10
RCKM295 DFHMSD TYPE=DSECT,                                             X00014*10
               MODE=INOUT,                                             X00015*10
               LANG=COBOL,                                             X00016*10
               STORAGE=AUTO,                                           X00017*10
               TIOAPFX=YES,                                            X00018*10
               TERM=3270-2                                              00019*10
RC295A  DFHMDI LINE=2,COLUMN=1,                                        X00020*10
               SIZE=(19,80),                                           X00021*10
               MAPATTS=(COLOR,HILIGHT),                                X00022*10
               DSATTS=(COLOR,HILIGHT),                                 X00023*10
               CTRL=(FREEKB)                                            00024*10
*                                                                       00025*10
        DFHMDF POS=(02,01),                                            X00026*10
               LENGTH=05,                                              X00027*10
               ATTRB=(ASKIP,NORM),                                     X00028*10
               COLOR=NEUTRAL,                                          X00029*10
               INITIAL='RCVR:'                                          00030*10
ARCVR   DFHMDF POS=(02,07),                                            X00031*10
               LENGTH=13,                                              X00032*10
               ATTRB=(ASKIP,NORM),                                     X00033*10
               COLOR=BLUE                                               00034*10
        DFHMDF POS=(02,21),                                            X00035*10
               LENGTH=04,                                              X00036*10
               ATTRB=(ASKIP,NORM),                                     X00037*10
               COLOR=NEUTRAL,                                          X00038*10
               INITIAL='LNE:'                                           00039*10
ALINE   DFHMDF POS=(02,26),                                            X00040*10
               LENGTH=04,                                              X00041*10
               ATTRB=(ASKIP,NORM),                                     X00042*10
               COLOR=BLUE                                               00043*10
        DFHMDF POS=(02,31),                                            X00044*10
               LENGTH=06,                                              X00045*10
               ATTRB=(ASKIP,NORM),                                     X00046*10
               COLOR=NEUTRAL,                                          X00047*10
               INITIAL='OP ID:'                                         00048*10
AOPER   DFHMDF POS=(02,38),                                            X00049*10
               LENGTH=04,                                              X00050*10
               ATTRB=(ASKIP,NORM),                                     X00051*10
               COLOR=BLUE                                               00052*10
        DFHMDF POS=(02,43),                                            X00053*10
               LENGTH=06,                                              X00054*10
               ATTRB=(ASKIP,NORM),                                     X00055*10
               COLOR=NEUTRAL,                                          X00056*10
               INITIAL='FCLTY:'                                         00057*10
AFCLTY  DFHMDF POS=(02,50),                                            X00058*10
               LENGTH=04,                                              X00059*10
               ATTRB=(ASKIP,NORM),                                     X00060*10
               COLOR=BLUE                                               00061*10
AFDESC  DFHMDF POS=(02,55),                                            X00062*10
               LENGTH=25,                                              X00063*10
               ATTRB=(ASKIP,NORM),                                     X00064*10
               COLOR=BLUE                                               00065*10
*                                                                       00066*10
        DFHMDF POS=(03,01),                                            X00067*10
               LENGTH=05,                                              X00068*10
               ATTRB=(ASKIP,NORM),                                     X00069*10
               COLOR=NEUTRAL,                                          X00070*10
               INITIAL='AD..:'                                          00071*10
AADDTE  DFHMDF POS=(03,07),                                            X00072*10
               LENGTH=10,                                              X00073*10
               ATTRB=(ASKIP,NORM),                                     X00074*10
               COLOR=BLUE                                               00075*10
        DFHMDF POS=(03,20),                                            X00076*10
               LENGTH=04,                                              X00077*10
               ATTRB=(ASKIP,NORM),                                     X00078*10
               COLOR=NEUTRAL,                                          X00079*10
               INITIAL='SKU:'                                           00080*10
ASKUNBR DFHMDF POS=(03,25),                                            X00081*10
               LENGTH=15,                                              X00082*10
               ATTRB=(ASKIP,NORM),                                     X00083*10
               COLOR=BLUE                                               00084*10
        DFHMDF POS=(03,45),                                            X00085*10
               LENGTH=05,                                              X00086*10
               ATTRB=(ASKIP,NORM),                                     X00087*10
               COLOR=NEUTRAL,                                          X00088*10
               INITIAL='ITEMS'                                          00089*10
ASTRTIT DFHMDF POS=(03,51),                                            X00090*10
               LENGTH=05,                                              X00091*10
               ATTRB=(NUM,UNPROT,NORM,IC),                             X00092*10
               COLOR=GREEN,                                            X00093*10
               HILIGHT=UNDERLINE,                                      X00094*10
               PICOUT='ZZZZ9'                                           00095*10
        DFHMDF POS=(03,57),                                            X00096*10
               LENGTH=02,                                              X00097*10
               ATTRB=(ASKIP,NORM),                                     X00098*10
               COLOR=NEUTRAL,                                          X00099*10
               INITIAL='TO'                                             00100*10
AENDIT  DFHMDF POS=(03,60),                                            X00101*10
               LENGTH=05,                                              X00102*10
               ATTRB=(ASKIP,NORM),                                     X00103*10
               COLOR=BLUE,                                             X00104*10
               PICOUT='ZZZZ9'                                           00105*10
        DFHMDF POS=(03,66),                                            X00106*10
               LENGTH=02,                                              X00107*10
               ATTRB=(ASKIP,NORM),                                     X00108*10
               COLOR=NEUTRAL,                                          X00109*10
               INITIAL='OF'                                             00110*10
ATOTIT  DFHMDF POS=(03,69),                                            X00111*10
               LENGTH=05,                                              X00112*10
               ATTRB=(ASKIP,NORM),                                     X00113*10
               COLOR=BLUE,                                             X00114*10
               PICOUT='ZZZZ9'                                           00115*10
*                                                                       00116*10
        DFHMDF POS=(04,01),                                            X00117*10
               LENGTH=14,                                              X00118*10
               ATTRB=(PROT,NORM),                                      X00119*10
               COLOR=NEUTRAL,                                          X00120*10
               INITIAL='RCVR  LNE QTY:'                                 00121*10
ARQTY   DFHMDF POS=(04,16),                                            X00122*10
               LENGTH=07,                                              X00123*10
               ATTRB=(ASKIP,NORM),                                     X00124*10
               PICOUT='ZZZ,ZZ9',                                       X00125*10
               COLOR=BLUE                                               00126*10
AVNSTYL DFHMDF POS=(04,25),                                            X00127*10
               LENGTH=19,                                              X00128*10
               ATTRB=(ASKIP,NORM),                                     X00129*10
               COLOR=BLUE                                               00130*10
        DFHMDF POS=(04,45),                                            X00131*10
               LENGTH=09,                                              X00132*10
               ATTRB=(PROT,NORM),                                      X00133*10
               COLOR=NEUTRAL,                                          X00134*10
               INITIAL='VNDR NME:'                                      00135*10
AVEND   DFHMDF POS=(04,55),                                            X00136*10
               LENGTH=25,                                              X00137*10
               ATTRB=(ASKIP,NORM),                                     X00138*10
               COLOR=BLUE                                               00139*10
*                                                                       00140*10
        DFHMDF POS=(05,01),                                            X00141*10
               LENGTH=14,                                              X00142*10
               ATTRB=(PROT,NORM),                                      X00143*10
               COLOR=NEUTRAL,                                          X00144*10
               INITIAL='DISTR LNE QTY:'                                 00145*10
ADQTY   DFHMDF POS=(05,16),                                            X00146*10
               LENGTH=07,                                              X00147*10
               ATTRB=(ASKIP,NORM),                                     X00148*10
               PICOUT='ZZZ,ZZ9',                                       X00149*10
               COLOR=BLUE                                               00150*10
*                                                                       00151*10
        DFHMDF POS=(05,25),                                            X00152*10
               LENGTH=11,                                              X00153*10
               ATTRB=(PROT,NORM),                                      X00154*10
               COLOR=NEUTRAL,                                          X00155*10
               INITIAL='TOTAL OTR.:'                                    00156*10
ATOTR   DFHMDF POS=(05,37),                                            X00157*10
               LENGTH=07,                                              X00158*10
               ATTRB=(ASKIP,NORM),                                     X00159*10
               PICOUT='ZZZ,ZZ9',                                       X00160*10
               COLOR=BLUE                                               00161*10
*                                                                       00162*10
        DFHMDF POS=(05,45),                                            X00163*10
               LENGTH=09,                                              X00164*10
               ATTRB=(PROT,NORM),                                      X00165*10
               COLOR=NEUTRAL,                                          X00166*10
               INITIAL='OUTR PCK:'                                      00167*10
AOUTR   DFHMDF POS=(05,55),                                            X00168*10
               LENGTH=03,                                              X00169*10
               ATTRB=(ASKIP,NORM),                                     X00170*10
               COLOR=BLUE                                               00171*10
        DFHMDF POS=(05,60),                                            X00172*10
               LENGTH=09,                                              X00173*10
               ATTRB=(PROT,NORM),                                      X00174*10
               COLOR=NEUTRAL,                                          X00175*10
               INITIAL='INNR PCK:'                                      00176*10
AINNR   DFHMDF POS=(05,70),                                            X00177*10
               LENGTH=03,                                              X00178*10
               ATTRB=(ASKIP,NORM),                                     X00179*10
               COLOR=BLUE                                               00180*10
*                                                                       00181*10
        DFHMDF POS=(07,05),                                            X00182*10
               LENGTH=18,                                              X00183*10
               ATTRB=(PROT,NORM),                                      X00184*10
               COLOR=NEUTRAL,                                          X00185*10
               INITIAL='STORE      DISTR'                               00186*10
        DFHMDF POS=(07,30),                                            X00187*10
               LENGTH=18,                                              X00188*10
               ATTRB=(PROT,NORM),                                      X00189*10
               COLOR=NEUTRAL,                                          X00190*10
               INITIAL='ORDER  TOTAL VERFD'                             00191*10
        DFHMDF POS=(07,55),                                            X00192*10
               LENGTH=10,                                              X00193*10
               ATTRB=(PROT,NORM),                                      X00194*10
               COLOR=NEUTRAL,                                          X00195*10
               INITIAL='QTY   DATE'                                     00196*10
        DFHMDF POS=(07,69),                                            X00197*10
               LENGTH=10,                                              X00198*10
               ATTRB=(PROT,NORM),                                      X00199*10
               COLOR=NEUTRAL,                                          X00200*10
               INITIAL='QTY   DATE'                                     00201*10
*                                                                       00202*10
        DFHMDF POS=(08,01),                                            X00203*10
               LENGTH=03,                                              X00204*10
               ATTRB=(PROT,NORM),                                      X00205*10
               COLOR=NEUTRAL,                                          X00206*10
               INITIAL='SEL'                                            00207*10
        DFHMDF POS=(08,06),                                            X00208*10
               LENGTH=03,                                              X00209*10
               ATTRB=(PROT,NORM),                                      X00210*10
               COLOR=NEUTRAL,                                          X00211*10
               INITIAL='QTY'                                            00212*10
        DFHMDF POS=(08,11),                                            X00213*10
               LENGTH=09,                                              X00214*10
               ATTRB=(PROT,NORM),                                      X00215*10
               COLOR=NEUTRAL,                                          X00216*10
               INITIAL='STR  PLAN'                                      00217*10
        DFHMDF POS=(08,25),                                            X00218*10
               LENGTH=03,                                              X00219*10
               ATTRB=(PROT,NORM),                                      X00220*10
               COLOR=NEUTRAL,                                          X00221*10
               INITIAL='OTR'                                            00222*10
        DFHMDF POS=(08,31),                                            X00223*10
               LENGTH=16,                                              X00224*10
               ATTRB=(PROT,NORM),                                      X00225*10
               COLOR=NEUTRAL,                                          X00226*10
               INITIAL='QTY   RECVD  QTY'                               00227*10
        DFHMDF POS=(08,50),                                            X00228*10
               LENGTH=16,                                              X00229*10
               ATTRB=(PROT,NORM),                                      X00230*10
               COLOR=NEUTRAL,                                          X00231*10
               INITIAL='ST  RECVD  RECVD'                               00232*10
        DFHMDF POS=(08,68),                                            X00233*10
               LENGTH=12,                                              X00234*10
               ATTRB=(PROT,NORM),                                      X00235*10
               COLOR=NEUTRAL,                                          X00236*10
               INITIAL='RECVD  RECVD'                                   00237*10
*                                                                       00238*10
ASEL01  DFHMDF POS=(09,02),                                            X00239*10
               LENGTH=01,                                              X00240*10
               ATTRB=(ASKIP,NORM),                                     X00241*10
               COLOR=GREEN                                              00243*10
        DFHMDF POS=(09,04),                                            X00244*10
               LENGTH=00,                                              X00245*10
               ATTRB=ASKIP                                              00246*10
AQTY01  DFHMDF POS=(09,05),                                            X00247*10
               LENGTH=05,                                              X00248*10
               ATTRB=(ASKIP,NORM),                                     X00249*10
               COLOR=BLUE                                               00251*10
ASTR01  DFHMDF POS=(09,11),                                            X00252*10
               LENGTH=04,                                              X00253*10
               ATTRB=(ASKIP,NORM),                                     X00254*10
               COLOR=BLUE                                               00255*10
ADIST01 DFHMDF POS=(09,16),                                            X00256*10
               LENGTH=05,                                              X00257*10
               ATTRB=(ASKIP,NORM),                                     X00258*10
               COLOR=BLUE                                               00259*10
AOTR01  DFHMDF POS=(09,22),                                            X00260*10
               LENGTH=06,                                              X00261*10
               ATTRB=(ASKIP,NORM),                                     X00262*10
               COLOR=BLUE                                               00263*10
AORDR01 DFHMDF POS=(09,29),                                            X00264*10
               LENGTH=06,                                              X00265*10
               ATTRB=(ASKIP,NORM),                                     X00266*10
               COLOR=BLUE                                               00267*10
ATOT01  DFHMDF POS=(09,36),                                            X00268*10
               LENGTH=06,                                              X00269*10
               ATTRB=(ASKIP,NORM),                                     X00270*10
               COLOR=BLUE                                               00271*10
AVER01  DFHMDF POS=(09,43),                                            X00272*10
               LENGTH=05,                                              X00273*10
               ATTRB=(ASKIP,NORM),                                     X00274*10
               COLOR=BLUE                                               00275*10
ASTAT01 DFHMDF POS=(09,50),                                            X00276*10
               LENGTH=02,                                              X00277*10
               ATTRB=(ASKIP,NORM),                                     X00278*10
               COLOR=BLUE                                               00279*10
ALQTY01 DFHMDF POS=(09,53),                                            X00280*10
               LENGTH=06,                                              X00281*10
               ATTRB=(ASKIP,NORM),                                     X00282*10
               COLOR=BLUE                                               00283*10
ALDTE01 DFHMDF POS=(09,60),                                            X00284*10
               LENGTH=06,                                              X00285*10
               ATTRB=(ASKIP,NORM),                                     X00286*10
               COLOR=BLUE                                               00287*10
APQTY01 DFHMDF POS=(09,67),                                            X00288*10
               LENGTH=06,                                              X00289*10
               ATTRB=(ASKIP,NORM),                                     X00290*10
               COLOR=BLUE                                               00291*10
APDTE01 DFHMDF POS=(09,74),                                            X00292*10
               LENGTH=06,                                              X00293*10
               ATTRB=(ASKIP,NORM),                                     X00294*10
               COLOR=BLUE                                               00295*10
*                                                                       00296*10
ASEL02  DFHMDF POS=(10,02),                                            X00297*10
               LENGTH=01,                                              X00298*10
               ATTRB=(ASKIP,NORM),                                     X00299*10
               COLOR=BLUE                                               00301*10
        DFHMDF POS=(10,04),                                            X00302*10
               LENGTH=00,                                              X00303*10
               ATTRB=ASKIP                                              00304*10
AQTY02  DFHMDF POS=(10,05),                                            X00305*10
               LENGTH=05,                                              X00306*10
               ATTRB=(ASKIP,NORM),                                     X00307*10
               COLOR=BLUE                                               00309*10
ASTR02  DFHMDF POS=(10,11),                                            X00310*10
               LENGTH=04,                                              X00311*10
               ATTRB=(ASKIP,NORM),                                     X00312*10
               COLOR=BLUE                                               00313*10
ADIST02 DFHMDF POS=(10,16),                                            X00314*10
               LENGTH=05,                                              X00315*10
               ATTRB=(ASKIP,NORM),                                     X00316*10
               COLOR=BLUE                                               00317*10
AOTR02  DFHMDF POS=(10,22),                                            X00318*10
               LENGTH=06,                                              X00319*10
               ATTRB=(ASKIP,NORM),                                     X00320*10
               COLOR=BLUE                                               00321*10
AORDR02 DFHMDF POS=(10,29),                                            X00322*10
               LENGTH=06,                                              X00323*10
               ATTRB=(ASKIP,NORM),                                     X00324*10
               COLOR=BLUE                                               00325*10
ATOT02  DFHMDF POS=(10,36),                                            X00326*10
               LENGTH=06,                                              X00327*10
               ATTRB=(ASKIP,NORM),                                     X00328*10
               COLOR=BLUE                                               00329*10
AVER02  DFHMDF POS=(10,43),                                            X00330*10
               LENGTH=05,                                              X00331*10
               ATTRB=(ASKIP,NORM),                                     X00332*10
               COLOR=BLUE                                               00333*10
ASTAT02 DFHMDF POS=(10,50),                                            X00334*10
               LENGTH=02,                                              X00335*10
               ATTRB=(ASKIP,NORM),                                     X00336*10
               COLOR=BLUE                                               00337*10
ALQTY02 DFHMDF POS=(10,53),                                            X00338*10
               LENGTH=06,                                              X00339*10
               ATTRB=(ASKIP,NORM),                                     X00340*10
               COLOR=BLUE                                               00341*10
ALDTE02 DFHMDF POS=(10,60),                                            X00342*10
               LENGTH=06,                                              X00343*10
               ATTRB=(ASKIP,NORM),                                     X00344*10
               COLOR=BLUE                                               00345*10
APQTY02 DFHMDF POS=(10,67),                                            X00346*10
               LENGTH=06,                                              X00347*10
               ATTRB=(ASKIP,NORM),                                     X00348*10
               COLOR=BLUE                                               00349*10
APDTE02 DFHMDF POS=(10,74),                                            X00350*10
               LENGTH=06,                                              X00351*10
               ATTRB=(ASKIP,NORM),                                     X00352*10
               COLOR=BLUE                                               00353*10
*                                                                       00354*10
ASEL03  DFHMDF POS=(11,02),                                            X00355*10
               LENGTH=01,                                              X00356*10
               ATTRB=(ASKIP,NORM),                                     X00357*10
               COLOR=BLUE                                               00359*10
        DFHMDF POS=(11,04),                                            X00360*10
               LENGTH=00,                                              X00361*10
               ATTRB=ASKIP                                              00362*10
AQTY03  DFHMDF POS=(11,05),                                            X00363*10
               LENGTH=05,                                              X00364*10
               ATTRB=(ASKIP,NORM),                                     X00365*10
               COLOR=BLUE                                               00367*10
ASTR03  DFHMDF POS=(11,11),                                            X00368*10
               LENGTH=04,                                              X00369*10
               ATTRB=(ASKIP,NORM),                                     X00370*10
               COLOR=BLUE                                               00371*10
ADIST03 DFHMDF POS=(11,16),                                            X00372*10
               LENGTH=05,                                              X00373*10
               ATTRB=(ASKIP,NORM),                                     X00374*10
               COLOR=BLUE                                               00375*10
AOTR03  DFHMDF POS=(11,22),                                            X00376*10
               LENGTH=06,                                              X00377*10
               ATTRB=(ASKIP,NORM),                                     X00378*10
               COLOR=BLUE                                               00379*10
AORDR03 DFHMDF POS=(11,29),                                            X00380*10
               LENGTH=06,                                              X00381*10
               ATTRB=(ASKIP,NORM),                                     X00382*10
               COLOR=BLUE                                               00383*10
ATOT03  DFHMDF POS=(11,36),                                            X00384*10
               LENGTH=06,                                              X00385*10
               ATTRB=(ASKIP,NORM),                                     X00386*10
               COLOR=BLUE                                               00387*10
AVER03  DFHMDF POS=(11,43),                                            X00388*10
               LENGTH=05,                                              X00389*10
               ATTRB=(ASKIP,NORM),                                     X00390*10
               COLOR=BLUE                                               00391*10
ASTAT03 DFHMDF POS=(11,50),                                            X00392*10
               LENGTH=02,                                              X00393*10
               ATTRB=(ASKIP,NORM),                                     X00394*10
               COLOR=BLUE                                               00395*10
ALQTY03 DFHMDF POS=(11,53),                                            X00396*10
               LENGTH=06,                                              X00397*10
               ATTRB=(ASKIP,NORM),                                     X00398*10
               COLOR=BLUE                                               00399*10
ALDTE03 DFHMDF POS=(11,60),                                            X00400*10
               LENGTH=06,                                              X00401*10
               ATTRB=(ASKIP,NORM),                                     X00402*10
               COLOR=BLUE                                               00403*10
APQTY03 DFHMDF POS=(11,67),                                            X00404*10
               LENGTH=06,                                              X00405*10
               ATTRB=(ASKIP,NORM),                                     X00406*10
               COLOR=BLUE                                               00407*10
APDTE03 DFHMDF POS=(11,74),                                            X00408*10
               LENGTH=06,                                              X00409*10
               ATTRB=(ASKIP,NORM),                                     X00410*10
               COLOR=BLUE                                               00411*10
*                                                                       00412*10
ASEL04  DFHMDF POS=(12,02),                                            X00413*10
               LENGTH=01,                                              X00414*10
               ATTRB=(ASKIP,NORM),                                     X00415*10
               COLOR=BLUE                                               00417*10
        DFHMDF POS=(12,04),                                            X00418*10
               LENGTH=00,                                              X00419*10
               ATTRB=ASKIP                                              00420*10
AQTY04  DFHMDF POS=(12,05),                                            X00421*10
               LENGTH=05,                                              X00422*10
               ATTRB=(ASKIP,NORM),                                     X00423*10
               COLOR=BLUE                                               00425*10
ASTR04  DFHMDF POS=(12,11),                                            X00426*10
               LENGTH=04,                                              X00427*10
               ATTRB=(ASKIP,NORM),                                     X00428*10
               COLOR=BLUE                                               00429*10
ADIST04 DFHMDF POS=(12,16),                                            X00430*10
               LENGTH=05,                                              X00431*10
               ATTRB=(ASKIP,NORM),                                     X00432*10
               COLOR=BLUE                                               00433*10
AOTR04  DFHMDF POS=(12,22),                                            X00434*10
               LENGTH=06,                                              X00435*10
               ATTRB=(ASKIP,NORM),                                     X00436*10
               COLOR=BLUE                                               00437*10
AORDR04 DFHMDF POS=(12,29),                                            X00438*10
               LENGTH=06,                                              X00439*10
               ATTRB=(ASKIP,NORM),                                     X00440*10
               COLOR=BLUE                                               00441*10
ATOT04  DFHMDF POS=(12,36),                                            X00442*10
               LENGTH=06,                                              X00443*10
               ATTRB=(ASKIP,NORM),                                     X00444*10
               COLOR=BLUE                                               00445*10
AVER04  DFHMDF POS=(12,43),                                            X00446*10
               LENGTH=05,                                              X00447*10
               ATTRB=(ASKIP,NORM),                                     X00448*10
               COLOR=BLUE                                               00449*10
ASTAT04 DFHMDF POS=(12,50),                                            X00450*10
               LENGTH=02,                                              X00451*10
               ATTRB=(ASKIP,NORM),                                     X00452*10
               COLOR=BLUE                                               00453*10
ALQTY04 DFHMDF POS=(12,53),                                            X00454*10
               LENGTH=06,                                              X00455*10
               ATTRB=(ASKIP,NORM),                                     X00456*10
               COLOR=BLUE                                               00457*10
ALDTE04 DFHMDF POS=(12,60),                                            X00458*10
               LENGTH=06,                                              X00459*10
               ATTRB=(ASKIP,NORM),                                     X00460*10
               COLOR=BLUE                                               00461*10
APQTY04 DFHMDF POS=(12,67),                                            X00462*10
               LENGTH=06,                                              X00463*10
               ATTRB=(ASKIP,NORM),                                     X00464*10
               COLOR=BLUE                                               00465*10
APDTE04 DFHMDF POS=(12,74),                                            X00466*10
               LENGTH=06,                                              X00467*10
               ATTRB=(ASKIP,NORM),                                     X00468*10
               COLOR=BLUE                                               00469*10
*                                                                       00470*10
ASEL05  DFHMDF POS=(13,02),                                            X00471*10
               LENGTH=01,                                              X00472*10
               ATTRB=(ASKIP,NORM),                                     X00473*10
               COLOR=BLUE                                               00475*10
        DFHMDF POS=(13,04),                                            X00476*10
               LENGTH=00,                                              X00477*10
               ATTRB=ASKIP                                              00478*10
AQTY05  DFHMDF POS=(13,05),                                            X00479*10
               LENGTH=05,                                              X00480*10
               ATTRB=(ASKIP,NORM),                                     X00481*10
               COLOR=BLUE                                               00483*10
ASTR05  DFHMDF POS=(13,11),                                            X00484*10
               LENGTH=04,                                              X00485*10
               ATTRB=(ASKIP,NORM),                                     X00486*10
               COLOR=BLUE                                               00487*10
ADIST05 DFHMDF POS=(13,16),                                            X00488*10
               LENGTH=05,                                              X00489*10
               ATTRB=(ASKIP,NORM),                                     X00490*10
               COLOR=BLUE                                               00491*10
AOTR05  DFHMDF POS=(13,22),                                            X00492*10
               LENGTH=06,                                              X00493*10
               ATTRB=(ASKIP,NORM),                                     X00494*10
               COLOR=BLUE                                               00495*10
AORDR05 DFHMDF POS=(13,29),                                            X00496*10
               LENGTH=06,                                              X00497*10
               ATTRB=(ASKIP,NORM),                                     X00498*10
               COLOR=BLUE                                               00499*10
ATOT05  DFHMDF POS=(13,36),                                            X00500*10
               LENGTH=06,                                              X00501*10
               ATTRB=(ASKIP,NORM),                                     X00502*10
               COLOR=BLUE                                               00503*10
AVER05  DFHMDF POS=(13,43),                                            X00504*10
               LENGTH=05,                                              X00505*10
               ATTRB=(ASKIP,NORM),                                     X00506*10
               COLOR=BLUE                                               00507*10
ASTAT05 DFHMDF POS=(13,50),                                            X00508*10
               LENGTH=02,                                              X00509*10
               ATTRB=(ASKIP,NORM),                                     X00510*10
               COLOR=BLUE                                               00511*10
ALQTY05 DFHMDF POS=(13,53),                                            X00512*10
               LENGTH=06,                                              X00513*10
               ATTRB=(ASKIP,NORM),                                     X00514*10
               COLOR=BLUE                                               00515*10
ALDTE05 DFHMDF POS=(13,60),                                            X00516*10
               LENGTH=06,                                              X00517*10
               ATTRB=(ASKIP,NORM),                                     X00518*10
               COLOR=BLUE                                               00519*10
APQTY05 DFHMDF POS=(13,67),                                            X00520*10
               LENGTH=06,                                              X00521*10
               ATTRB=(ASKIP,NORM),                                     X00522*10
               COLOR=BLUE                                               00523*10
APDTE05 DFHMDF POS=(13,74),                                            X00524*10
               LENGTH=06,                                              X00525*10
               ATTRB=(ASKIP,NORM),                                     X00526*10
               COLOR=BLUE                                               00527*10
*                                                                       00528*10
ASEL06  DFHMDF POS=(14,02),                                            X00529*10
               LENGTH=01,                                              X00530*10
               ATTRB=(ASKIP,NORM),                                     X00531*10
               COLOR=BLUE                                               00533*10
        DFHMDF POS=(14,04),                                            X00534*10
               LENGTH=00,                                              X00535*10
               ATTRB=ASKIP                                              00536*10
AQTY06  DFHMDF POS=(14,05),                                            X00537*10
               LENGTH=05,                                              X00538*10
               ATTRB=(ASKIP,NORM),                                     X00539*10
               COLOR=BLUE                                               00541*10
ASTR06  DFHMDF POS=(14,11),                                            X00542*10
               LENGTH=04,                                              X00543*10
               ATTRB=(ASKIP,NORM),                                     X00544*10
               COLOR=BLUE                                               00545*10
ADIST06 DFHMDF POS=(14,16),                                            X00546*10
               LENGTH=05,                                              X00547*10
               ATTRB=(ASKIP,NORM),                                     X00548*10
               COLOR=BLUE                                               00549*10
AOTR06  DFHMDF POS=(14,22),                                            X00550*10
               LENGTH=06,                                              X00551*10
               ATTRB=(ASKIP,NORM),                                     X00552*10
               COLOR=BLUE                                               00553*10
AORDR06 DFHMDF POS=(14,29),                                            X00554*10
               LENGTH=06,                                              X00555*10
               ATTRB=(ASKIP,NORM),                                     X00556*10
               COLOR=BLUE                                               00557*10
ATOT06  DFHMDF POS=(14,36),                                            X00558*10
               LENGTH=06,                                              X00559*10
               ATTRB=(ASKIP,NORM),                                     X00560*10
               COLOR=BLUE                                               00561*10
AVER06  DFHMDF POS=(14,43),                                            X00562*10
               LENGTH=05,                                              X00563*10
               ATTRB=(ASKIP,NORM),                                     X00564*10
               COLOR=BLUE                                               00565*10
ASTAT06 DFHMDF POS=(14,50),                                            X00566*10
               LENGTH=02,                                              X00567*10
               ATTRB=(ASKIP,NORM),                                     X00568*10
               COLOR=BLUE                                               00569*10
ALQTY06 DFHMDF POS=(14,53),                                            X00570*10
               LENGTH=06,                                              X00571*10
               ATTRB=(ASKIP,NORM),                                     X00572*10
               COLOR=BLUE                                               00573*10
ALDTE06 DFHMDF POS=(14,60),                                            X00574*10
               LENGTH=06,                                              X00575*10
               ATTRB=(ASKIP,NORM),                                     X00576*10
               COLOR=BLUE                                               00577*10
APQTY06 DFHMDF POS=(14,67),                                            X00578*10
               LENGTH=06,                                              X00579*10
               ATTRB=(ASKIP,NORM),                                     X00580*10
               COLOR=BLUE                                               00581*10
APDTE06 DFHMDF POS=(14,74),                                            X00582*10
               LENGTH=06,                                              X00583*10
               ATTRB=(ASKIP,NORM),                                     X00584*10
               COLOR=BLUE                                               00585*10
*                                                                       00586*10
ASEL07  DFHMDF POS=(15,02),                                            X00587*10
               LENGTH=01,                                              X00588*10
               ATTRB=(ASKIP,NORM),                                     X00589*10
               COLOR=BLUE                                               00591*10
        DFHMDF POS=(15,04),                                            X00592*10
               LENGTH=00,                                              X00593*10
               ATTRB=ASKIP                                              00594*10
AQTY07  DFHMDF POS=(15,05),                                            X00595*10
               LENGTH=05,                                              X00596*10
               ATTRB=(ASKIP,NORM),                                     X00597*10
               COLOR=BLUE                                               00599*10
ASTR07  DFHMDF POS=(15,11),                                            X00600*10
               LENGTH=04,                                              X00601*10
               ATTRB=(ASKIP,NORM),                                     X00602*10
               COLOR=BLUE                                               00603*10
ADIST07 DFHMDF POS=(15,16),                                            X00604*10
               LENGTH=05,                                              X00605*10
               ATTRB=(ASKIP,NORM),                                     X00606*10
               COLOR=BLUE                                               00607*10
AOTR07  DFHMDF POS=(15,22),                                            X00608*10
               LENGTH=06,                                              X00609*10
               ATTRB=(ASKIP,NORM),                                     X00610*10
               COLOR=BLUE                                               00611*10
AORDR07 DFHMDF POS=(15,29),                                            X00612*10
               LENGTH=06,                                              X00613*10
               ATTRB=(ASKIP,NORM),                                     X00614*10
               COLOR=BLUE                                               00615*10
ATOT07  DFHMDF POS=(15,36),                                            X00616*10
               LENGTH=06,                                              X00617*10
               ATTRB=(ASKIP,NORM),                                     X00618*10
               COLOR=BLUE                                               00619*10
AVER07  DFHMDF POS=(15,43),                                            X00620*10
               LENGTH=05,                                              X00621*10
               ATTRB=(ASKIP,NORM),                                     X00622*10
               COLOR=BLUE                                               00623*10
ASTAT07 DFHMDF POS=(15,50),                                            X00624*10
               LENGTH=02,                                              X00625*10
               ATTRB=(ASKIP,NORM),                                     X00626*10
               COLOR=BLUE                                               00627*10
ALQTY07 DFHMDF POS=(15,53),                                            X00628*10
               LENGTH=06,                                              X00629*10
               ATTRB=(ASKIP,NORM),                                     X00630*10
               COLOR=BLUE                                               00631*10
ALDTE07 DFHMDF POS=(15,60),                                            X00632*10
               LENGTH=06,                                              X00633*10
               ATTRB=(ASKIP,NORM),                                     X00634*10
               COLOR=BLUE                                               00635*10
APQTY07 DFHMDF POS=(15,67),                                            X00636*10
               LENGTH=06,                                              X00637*10
               ATTRB=(ASKIP,NORM),                                     X00638*10
               COLOR=BLUE                                               00639*10
APDTE07 DFHMDF POS=(15,74),                                            X00640*10
               LENGTH=06,                                              X00641*10
               ATTRB=(ASKIP,NORM),                                     X00642*10
               COLOR=BLUE                                               00643*10
*                                                                       00644*10
ASEL08  DFHMDF POS=(16,02),                                            X00645*10
               LENGTH=01,                                              X00646*10
               ATTRB=(ASKIP,NORM),                                     X00647*10
               COLOR=BLUE                                               00649*10
        DFHMDF POS=(16,04),                                            X00650*10
               LENGTH=00,                                              X00651*10
               ATTRB=ASKIP                                              00652*10
AQTY08  DFHMDF POS=(16,05),                                            X00653*10
               LENGTH=05,                                              X00654*10
               ATTRB=(ASKIP,NORM),                                     X00655*10
               COLOR=BLUE                                               00657*10
ASTR08  DFHMDF POS=(16,11),                                            X00658*10
               LENGTH=04,                                              X00659*10
               ATTRB=(ASKIP,NORM),                                     X00660*10
               COLOR=BLUE                                               00661*10
ADIST08 DFHMDF POS=(16,16),                                            X00662*10
               LENGTH=05,                                              X00663*10
               ATTRB=(ASKIP,NORM),                                     X00664*10
               COLOR=BLUE                                               00665*10
AOTR08  DFHMDF POS=(16,22),                                            X00666*10
               LENGTH=06,                                              X00667*10
               ATTRB=(ASKIP,NORM),                                     X00668*10
               COLOR=BLUE                                               00669*10
AORDR08 DFHMDF POS=(16,29),                                            X00670*10
               LENGTH=06,                                              X00671*10
               ATTRB=(ASKIP,NORM),                                     X00672*10
               COLOR=BLUE                                               00673*10
ATOT08  DFHMDF POS=(16,36),                                            X00674*10
               LENGTH=06,                                              X00675*10
               ATTRB=(ASKIP,NORM),                                     X00676*10
               COLOR=BLUE                                               00677*10
AVER08  DFHMDF POS=(16,43),                                            X00678*10
               LENGTH=05,                                              X00679*10
               ATTRB=(ASKIP,NORM),                                     X00680*10
               COLOR=BLUE                                               00681*10
ASTAT08 DFHMDF POS=(16,50),                                            X00682*10
               LENGTH=02,                                              X00683*10
               ATTRB=(ASKIP,NORM),                                     X00684*10
               COLOR=BLUE                                               00685*10
ALQTY08 DFHMDF POS=(16,53),                                            X00686*10
               LENGTH=06,                                              X00687*10
               ATTRB=(ASKIP,NORM),                                     X00688*10
               COLOR=BLUE                                               00689*10
ALDTE08 DFHMDF POS=(16,60),                                            X00690*10
               LENGTH=06,                                              X00691*10
               ATTRB=(ASKIP,NORM),                                     X00692*10
               COLOR=BLUE                                               00693*10
APQTY08 DFHMDF POS=(16,67),                                            X00694*10
               LENGTH=06,                                              X00695*10
               ATTRB=(ASKIP,NORM),                                     X00696*10
               COLOR=BLUE                                               00697*10
APDTE08 DFHMDF POS=(16,74),                                            X00698*10
               LENGTH=06,                                              X00699*10
               ATTRB=(ASKIP,NORM),                                     X00700*10
               COLOR=BLUE                                               00701*10
*                                                                       00702*10
ASEL09  DFHMDF POS=(17,02),                                            X00703*10
               LENGTH=01,                                              X00704*10
               ATTRB=(ASKIP,NORM),                                     X00705*10
               COLOR=BLUE                                               00707*10
        DFHMDF POS=(17,04),                                            X00708*10
               LENGTH=00,                                              X00709*10
               ATTRB=ASKIP                                              00710*10
AQTY09  DFHMDF POS=(17,05),                                            X00711*10
               LENGTH=05,                                              X00712*10
               ATTRB=(ASKIP,NORM),                                     X00713*10
               COLOR=BLUE                                               00715*10
ASTR09  DFHMDF POS=(17,11),                                            X00716*10
               LENGTH=04,                                              X00717*10
               ATTRB=(ASKIP,NORM),                                     X00718*10
               COLOR=BLUE                                               00719*10
ADIST09 DFHMDF POS=(17,16),                                            X00720*10
               LENGTH=05,                                              X00721*10
               ATTRB=(ASKIP,NORM),                                     X00722*10
               COLOR=BLUE                                               00723*10
AOTR09  DFHMDF POS=(17,22),                                            X00724*10
               LENGTH=06,                                              X00725*10
               ATTRB=(ASKIP,NORM),                                     X00726*10
               COLOR=BLUE                                               00727*10
AORDR09 DFHMDF POS=(17,29),                                            X00728*10
               LENGTH=06,                                              X00729*10
               ATTRB=(ASKIP,NORM),                                     X00730*10
               COLOR=BLUE                                               00731*10
ATOT09  DFHMDF POS=(17,36),                                            X00732*10
               LENGTH=06,                                              X00733*10
               ATTRB=(ASKIP,NORM),                                     X00734*10
               COLOR=BLUE                                               00735*10
AVER09  DFHMDF POS=(17,43),                                            X00736*10
               LENGTH=05,                                              X00737*10
               ATTRB=(ASKIP,NORM),                                     X00738*10
               COLOR=BLUE                                               00739*10
ASTAT09 DFHMDF POS=(17,50),                                            X00740*10
               LENGTH=02,                                              X00741*10
               ATTRB=(ASKIP,NORM),                                     X00742*10
               COLOR=BLUE                                               00743*10
ALQTY09 DFHMDF POS=(17,53),                                            X00744*10
               LENGTH=06,                                              X00745*10
               ATTRB=(ASKIP,NORM),                                     X00746*10
               COLOR=BLUE                                               00747*10
ALDTE09 DFHMDF POS=(17,60),                                            X00748*10
               LENGTH=06,                                              X00749*10
               ATTRB=(ASKIP,NORM),                                     X00750*10
               COLOR=BLUE                                               00751*10
APQTY09 DFHMDF POS=(17,67),                                            X00752*10
               LENGTH=06,                                              X00753*10
               ATTRB=(ASKIP,NORM),                                     X00754*10
               COLOR=BLUE                                               00755*10
APDTE09 DFHMDF POS=(17,74),                                            X00756*10
               LENGTH=06,                                              X00757*10
               ATTRB=(ASKIP,NORM),                                     X00758*10
               COLOR=BLUE                                               00759*10
*                                                                       00760*10
ASEL10  DFHMDF POS=(18,02),                                            X00761*10
               LENGTH=01,                                              X00762*10
               ATTRB=(ASKIP,NORM),                                     X00763*10
               COLOR=BLUE                                               00765*10
        DFHMDF POS=(18,04),                                            X00766*10
               LENGTH=00,                                              X00767*10
               ATTRB=ASKIP                                              00768*10
AQTY10  DFHMDF POS=(18,05),                                            X00769*10
               LENGTH=05,                                              X00770*10
               ATTRB=(ASKIP,NORM),                                     X00771*10
               COLOR=BLUE                                               00773*10
ASTR10  DFHMDF POS=(18,11),                                            X00774*10
               LENGTH=04,                                              X00775*10
               ATTRB=(ASKIP,NORM),                                     X00776*10
               COLOR=BLUE                                               00777*10
ADIST10 DFHMDF POS=(18,16),                                            X00778*10
               LENGTH=05,                                              X00779*10
               ATTRB=(ASKIP,NORM),                                     X00780*10
               COLOR=BLUE                                               00781*10
AOTR10  DFHMDF POS=(18,22),                                            X00782*10
               LENGTH=06,                                              X00783*10
               ATTRB=(ASKIP,NORM),                                     X00784*10
               COLOR=BLUE                                               00785*10
AORDR10 DFHMDF POS=(18,29),                                            X00786*10
               LENGTH=06,                                              X00787*10
               ATTRB=(ASKIP,NORM),                                     X00788*10
               COLOR=BLUE                                               00789*10
ATOT10  DFHMDF POS=(18,36),                                            X00790*10
               LENGTH=06,                                              X00791*10
               ATTRB=(ASKIP,NORM),                                     X00792*10
               COLOR=BLUE                                               00793*10
AVER10  DFHMDF POS=(18,43),                                            X00794*10
               LENGTH=05,                                              X00795*10
               ATTRB=(ASKIP,NORM),                                     X00796*10
               COLOR=BLUE                                               00797*10
ASTAT10 DFHMDF POS=(18,50),                                            X00798*10
               LENGTH=02,                                              X00799*10
               ATTRB=(ASKIP,NORM),                                     X00800*10
               COLOR=BLUE                                               00801*10
ALQTY10 DFHMDF POS=(18,53),                                            X00802*10
               LENGTH=06,                                              X00803*10
               ATTRB=(ASKIP,NORM),                                     X00804*10
               COLOR=BLUE                                               00805*10
ALDTE10 DFHMDF POS=(18,60),                                            X00806*10
               LENGTH=06,                                              X00807*10
               ATTRB=(ASKIP,NORM),                                     X00808*10
               COLOR=BLUE                                               00809*10
APQTY10 DFHMDF POS=(18,67),                                            X00810*10
               LENGTH=06,                                              X00811*10
               ATTRB=(ASKIP,NORM),                                     X00812*10
               COLOR=BLUE                                               00813*10
APDTE10 DFHMDF POS=(18,74),                                            X00814*10
               LENGTH=06,                                              X00815*10
               ATTRB=(ASKIP,NORM),                                     X00816*10
               COLOR=BLUE                                               00817*10
*                                                                       00818*10
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00819*10
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00820*10
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00821*10
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00822*10
**************                                                          00823*10
        DFHMSD TYPE=FINAL                                               00824*10
**************                                                          00825*10
        END                                                             00826*10
