*          DATA SET RCKM280    AT LEVEL 009 AS OF 04/21/94              00001**2
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  RCKM280                                            *   00005**2
*        MAP     RC280A                                             *   00006**2
*        PROGRAM RCKCS280                                           *   00007**2
*        TRANSID E280 - VERIFIED COUNT ADJ BY STORE                 *   00008**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
RCKM280 DFHMSD TYPE=MAP,                                               X00012**2
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES,                                            X00015   
               CTRL=(FREEKB)                                            00016   
RC280A  DFHMDI LINE=2,COLUMN=1,                                        X00017**2
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
*                                                                       00021   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00022   
               INITIAL='RCVR  NO:',                                    X00023   
               LENGTH=9,                                               X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026   
ARCVNBR DFHMDF ATTRB=(ASKIP),                                          X00027   
               LENGTH=8,                                               X00028   
               PICOUT='99999999',                                      X00029   
               COLOR=BLUE,                                             X00030   
               POS=(02,12)                                              00031   
ARCVSEQ DFHMDF ATTRB=(ASKIP),                                          X00032   
               LENGTH=4,                                               X00033   
               PICOUT='9999',                                          X00034   
               COLOR=BLUE,                                             X00035   
               POS=(02,21)                                              00036   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00048   
               INITIAL='OP ID:',                                       X00049   
               LENGTH=6,                                               X00050   
               COLOR=NEUTRAL,                                          X00051   
               POS=(02,28)                                              00052   
AOPER   DFHMDF ATTRB=(ASKIP),                                          X00053   
               LENGTH=4,                                               X00054   
               COLOR=BLUE,                                             X00055   
               PICOUT='ZZZ9',                                          X00056   
               POS=(02,36)                                              00057   
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00063   
               LENGTH=4,                                               X00064   
               COLOR=BLUE,                                             X00065   
               PICOUT='9999',                                          X00066   
               POS=(02,41)                                              00067   
AFCLNAM DFHMDF ATTRB=(ASKIP),                                          X00068   
               LENGTH=25,                                              X00069   
               COLOR=BLUE,                                             X00070   
               POS=(02,46)                                              00071   
*                                                                       00072   
*       LINE 3                                                          00073   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00038   
               INITIAL='STORE NO:',                                    X00039**2
               LENGTH=9,                                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(03,02)                                              00042   
ASTR    DFHMDF ATTRB=(ASKIP),                                          X00043**2
               LENGTH=4,                                               X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZ9',                                          X00046   
               POS=(03,12)                                              00047   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00038   
               INITIAL='DEPT:',                                        X00039**2
               LENGTH=5,                                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(03,28)                                              00042   
ADEPT   DFHMDF ATTRB=(ASKIP),                                          X00043**2
               LENGTH=3,                                               X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZ9',                                           X00046   
               POS=(03,35)                                              00047   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00038   
               INITIAL='RCVR STATUS:',                                 X00039**2
               LENGTH=12,                                              X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(03,45)                                              00042   
ARVST   DFHMDF ATTRB=(ASKIP),                                          X00043**2
               LENGTH=2,                                               X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='XX',                                            X00046   
               POS=(03,59)                                              00047   
*                                                                       00101   
* LINE 4                                                                        
*                                                                               
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00103   
               INITIAL='ITEMS',                                        X00104   
               COLOR=NEUTRAL,                                          X00105   
               LENGTH=5,                                               X00106   
               POS=(04,45)                                              00107   
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00108   
               JUSTIFY=(LEFT,BLANK),                                   X00109   
               COLOR=GREEN,                                            X00110   
               HILIGHT=UNDERLINE,                                      X00111   
               PICOUT='ZZZZZ',                                         X00112   
               LENGTH=5,                                               X00113   
               POS=(04,52)                                              00114   
*                                                                       00115   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00116   
               INITIAL='TO',                                           X00117   
               COLOR=NEUTRAL,                                          X00118   
               LENGTH=2,                                               X00119   
               POS=(04,58)                                              00120   
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00121   
               JUSTIFY=(LEFT,BLANK),                                   X00122   
               COLOR=BLUE,                                             X00123   
               PICOUT='ZZZZZ',                                         X00124   
               LENGTH=5,                                               X00125   
               POS=(04,61)                                              00126   
*                                                                       00127   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00128   
               INITIAL='OF',                                           X00129   
               COLOR=NEUTRAL,                                          X00130   
               LENGTH=2,                                               X00131   
               POS=(04,67)                                              00132   
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00133   
               JUSTIFY=(LEFT,BLANK),                                   X00134   
               COLOR=BLUE,                                             X00135   
               PICOUT='ZZZZZ',                                         X00136   
               LENGTH=5,                                               X00137   
               POS=(04,70)                                              00138   
*                                                                       00139   
*       LINE 6                                                          00140**2
*                                                                       00141   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00142   
               INITIAL='ADJ',                                          X00143   
               COLOR=NEUTRAL,                                          X00144   
               LENGTH=03,                                              X00145   
               POS=(06,16)                                              00146   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00152   
               INITIAL='LINE',                                         X00153   
               COLOR=NEUTRAL,                                          X00154   
               LENGTH=04,                                              X00155   
               POS=(06,25)                                              00156**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00152   
               INITIAL='PCKSLP',                                       X00153   
               COLOR=NEUTRAL,                                          X00154   
               LENGTH=06,                                              X00155   
               POS=(06,46)                                              00156**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00152   
               INITIAL='ACTUAL',                                       X00153   
               COLOR=NEUTRAL,                                          X00154   
               LENGTH=06,                                              X00155   
               POS=(06,56)                                              00156**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00152   
               INITIAL='VERFYD',                                       X00153   
               COLOR=NEUTRAL,                                          X00154   
               LENGTH=06,                                              X00155   
               POS=(06,66)                                              00156**2
*                                                                       00157   
*       LINE 7                                                          00158   
*                                                                       00159   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00160   
               INITIAL='SEL   ACT',                                    X00161   
               COLOR=NEUTRAL,                                          X00162   
               LENGTH=09,                                              X00163   
               POS=(07,2)                                               00164   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00165   
               INITIAL='QTY',                                          X00166   
               COLOR=NEUTRAL,                                          X00167   
               LENGTH=3,                                               X00168   
               POS=(07,16)                                              00169   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00170   
               INITIAL='NO',                                           X00171**2
               COLOR=NEUTRAL,                                          X00172   
               LENGTH=2,                                               X00173**2
               POS=(07,26)                                              00174**2
*-------------------------------------------------------------------*           
* CHANGED THE LABEL FROM 'CLASS/SKU:' TO 'CL   SKU' IN THE HEADER   *           
* RECORD.                                   ** WR # 230ZZ.          *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00175**2
               INITIAL='CL   SKU ',                                    X00176**2
               COLOR=NEUTRAL,                                          X00177**2
               LENGTH=9,                                               X00178**2
               POS=(07,34)                                              00179**2
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00180   
               INITIAL='QTY',                                          X00181   
               COLOR=NEUTRAL,                                          X00182   
               LENGTH=3,                                               X00183   
               POS=(07,48)                                              00184**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00180   
               INITIAL='QTY',                                          X00181   
               COLOR=NEUTRAL,                                          X00182   
               LENGTH=3,                                               X00183   
               POS=(07,58)                                              00184**2
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00180   
               INITIAL='QTY',                                          X00181   
               COLOR=NEUTRAL,                                          X00182   
               LENGTH=3,                                               X00183   
               POS=(07,68)                                              00184**2
*                                                                       00185   
*        LINE 8                                                         00186   
*                                                                       00187   
ASEL01   DFHMDF ATTRB=(UNPROT,IC),                                     X00188   
               COLOR=GREEN,                                            X00189   
               HILIGHT=UNDERLINE,                                      X00190   
               LENGTH=1,                                               X00191   
               POS=(08,3)                                               00192   
         DFHMDF ATTRB=(ASKIP),                                         X00193   
               POS=(08,5),                                             X00194   
               INITIAL=' ',                                            X00195   
               LENGTH=1                                                 00196   
*                                                                       00197   
AACT01   DFHMDF ATTRB=(ASKIP),                                         X00198   
               COLOR=BLUE,                                             X00199   
               LENGTH=3,                                               X00200   
               POS=(08,08)                                              00201   
*                                                                       00202   
AQTY01   DFHMDF ATTRB=(UNPROT,NUM),                                    X00203   
               COLOR=GREEN,                                            X00204   
               HILIGHT=UNDERLINE,                                      X00205   
               PICOUT='ZZZZZ',                                         X00206   
               LENGTH=5,                                               X00207   
               POS=(08,15)                                              00208   
         DFHMDF ATTRB=(ASKIP),                                         X00209   
               POS=(08,21),                                            X00210   
               INITIAL=' ',                                            X00211   
               LENGTH=1                                                 00212   
*                                                                       00213   
APOL01   DFHMDF ATTRB=(ASKIP),                                         X00214**2
               COLOR=BLUE,                                             X00215   
               LENGTH=5,                                               X00216**2
               POS=(08,24)                                              00217**2
*                                                                       00218**3
*-------------------------------------------------------------------*           
* CHANGED THE LENGTH OF SKU FROM 6 TO 11.      ** WR # 230ZZ.       *           
*-------------------------------------------------------------------*           
ASKU01   DFHMDF ATTRB=(ASKIP),                                         X00219**3
               COLOR=BLUE,                                             X00220**3
               LENGTH=11,                                              X00221**3
               POS=(08,34)                                              00222**3
*                                                                       00223   
APQTY01  DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=BLUE,                                             X00225   
               PICOUT='ZZZZZZ',                                        X00226   
               LENGTH=6,                                               X00227   
               POS=(08,46)                                              00228**3
*                                                                       00223   
ACQTY01  DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=BLUE,                                             X00225   
               PICOUT='ZZZZZZ',                                        X00226   
               LENGTH=6,                                               X00227   
               POS=(08,56)                                              00228**3
*                                                                       00235**3
AVQTY01  DFHMDF ATTRB=(ASKIP),                                         X00224   
               COLOR=BLUE,                                             X00225   
               PICOUT='ZZZZZZ',                                        X00226   
               LENGTH=6,                                               X00227   
               POS=(08,66)                                              00228**3
*                                                                       00235**3
*        LINE 9                                                         00236**3
*                                                                       00237**3
ASEL02   DFHMDF ATTRB=(UNPROT,IC),                                     X00238**3
               COLOR=GREEN,                                            X00239**3
               HILIGHT=UNDERLINE,                                      X00240**3
               LENGTH=1,                                               X00241**3
               POS=(09,3)                                               00242**3
         DFHMDF ATTRB=(ASKIP),                                         X00243**3
               POS=(09,5),                                             X00244**3
               INITIAL=' ',                                            X00245**3
               LENGTH=1                                                 00246**3
*                                                                       00247**3
AACT02   DFHMDF ATTRB=(ASKIP),                                         X00248**3
               COLOR=BLUE,                                             X00249**3
               LENGTH=3,                                               X00250**3
               POS=(09,08)                                              00251**3
*                                                                       00252**3
AQTY02   DFHMDF ATTRB=(UNPROT,NUM),                                    X00253**3
               COLOR=GREEN,                                            X00254**3
               HILIGHT=UNDERLINE,                                      X00255**3
               PICOUT='ZZZZZ',                                         X00256**3
               LENGTH=5,                                               X00257**3
               POS=(09,15)                                              00258**3
         DFHMDF ATTRB=(ASKIP),                                         X00259**3
               POS=(09,21),                                            X00260**3
               INITIAL=' ',                                            X00261**3
               LENGTH=1                                                 00262**3
*                                                                       00263**3
APOL02   DFHMDF ATTRB=(ASKIP),                                         X00264**3
               COLOR=BLUE,                                             X00265**3
               LENGTH=5,                                               X00266**3
               POS=(09,24)                                              00267**3
*                                                                       00268**3
ASKU02   DFHMDF ATTRB=(ASKIP),                                         X00269**3
               COLOR=BLUE,                                             X00270**3
               LENGTH=11,                                              X00271**3
               POS=(09,34)                                              00272**3
*                                                                       00273**3
APQTY02  DFHMDF ATTRB=(ASKIP),                                         X00274**3
               COLOR=BLUE,                                             X00275**3
               PICOUT='ZZZZZZ',                                        X00276**3
               LENGTH=6,                                               X00277**3
               POS=(09,46)                                              00278**3
*                                                                       00285**3
ACQTY02  DFHMDF ATTRB=(ASKIP),                                         X00274**3
               COLOR=BLUE,                                             X00275**3
               PICOUT='ZZZZZZ',                                        X00276**3
               LENGTH=6,                                               X00277**3
               POS=(09,56)                                              00278**3
*                                                                       00285**3
AVQTY02  DFHMDF ATTRB=(ASKIP),                                         X00274**3
               COLOR=BLUE,                                             X00275**3
               PICOUT='ZZZZZZ',                                        X00276**3
               LENGTH=6,                                               X00277**3
               POS=(09,66)                                              00278**3
*                                                                       00285**3
*        LINE 10                                                        00286**3
*                                                                       00287**3
ASEL03   DFHMDF ATTRB=(UNPROT,IC),                                     X00288**3
               COLOR=GREEN,                                            X00289**3
               HILIGHT=UNDERLINE,                                      X00290**3
               LENGTH=1,                                               X00291**3
               POS=(10,3)                                               00292**3
         DFHMDF ATTRB=(ASKIP),                                         X00293**3
               POS=(10,5),                                             X00294**3
               INITIAL=' ',                                            X00295**3
               LENGTH=1                                                 00296**3
*                                                                       00297**3
AACT03   DFHMDF ATTRB=(ASKIP),                                         X00298**3
               COLOR=BLUE,                                             X00299**3
               LENGTH=3,                                               X00300**3
               POS=(10,08)                                              00301**3
*                                                                       00302**3
AQTY03   DFHMDF ATTRB=(UNPROT,NUM),                                    X00303**3
               COLOR=GREEN,                                            X00304**3
               HILIGHT=UNDERLINE,                                      X00305**3
               PICOUT='ZZZZZ',                                         X00306**3
               LENGTH=5,                                               X00307**3
               POS=(10,15)                                              00308**3
         DFHMDF ATTRB=(ASKIP),                                         X00309**3
               POS=(10,21),                                            X00310**3
               INITIAL=' ',                                            X00311**3
               LENGTH=1                                                 00312**3
*                                                                       00313**3
APOL03   DFHMDF ATTRB=(ASKIP),                                         X00314**3
               COLOR=BLUE,                                             X00315**3
               LENGTH=5,                                               X00316**3
               POS=(10,24)                                              00317**3
*                                                                       00318**3
ASKU03   DFHMDF ATTRB=(ASKIP),                                         X00319**3
               COLOR=BLUE,                                             X00320**3
               LENGTH=11,                                              X00321**3
               POS=(10,34)                                              00322**3
*                                                                       00323**3
APQTY03  DFHMDF ATTRB=(ASKIP),                                         X00324**3
               COLOR=BLUE,                                             X00325**3
               PICOUT='ZZZZZZ',                                        X00326**3
               LENGTH=6,                                               X00327**3
               POS=(10,46)                                              00328**3
*                                                                       00335**3
ACQTY03  DFHMDF ATTRB=(ASKIP),                                         X00324**3
               COLOR=BLUE,                                             X00325**3
               PICOUT='ZZZZZZ',                                        X00326**3
               LENGTH=6,                                               X00327**3
               POS=(10,56)                                              00328**3
*                                                                       00335**3
AVQTY03  DFHMDF ATTRB=(ASKIP),                                         X00324**3
               COLOR=BLUE,                                             X00325**3
               PICOUT='ZZZZZZ',                                        X00326**3
               LENGTH=6,                                               X00327**3
               POS=(10,66)                                              00328**3
*                                                                       00335**3
*        LINE 11                                                        00336**3
*                                                                       00337**3
ASEL04   DFHMDF ATTRB=(UNPROT,IC),                                     X00338**3
               COLOR=GREEN,                                            X00339**3
               HILIGHT=UNDERLINE,                                      X00340**3
               LENGTH=1,                                               X00341**3
               POS=(11,3)                                               00342**3
         DFHMDF ATTRB=(ASKIP),                                         X00343**3
               POS=(11,5),                                             X00344**3
               INITIAL=' ',                                            X00345**3
               LENGTH=1                                                 00346**3
*                                                                       00347**3
AACT04   DFHMDF ATTRB=(ASKIP),                                         X00348**3
               COLOR=BLUE,                                             X00349**3
               LENGTH=3,                                               X00350**3
               POS=(11,08)                                              00351**3
*                                                                       00352**3
AQTY04   DFHMDF ATTRB=(UNPROT,NUM),                                    X00353**3
               COLOR=GREEN,                                            X00354**3
               HILIGHT=UNDERLINE,                                      X00355**3
               PICOUT='ZZZZZ',                                         X00356**3
               LENGTH=5,                                               X00357**3
               POS=(11,15)                                              00358**3
         DFHMDF ATTRB=(ASKIP),                                         X00359**3
               POS=(11,21),                                            X00360**3
               INITIAL=' ',                                            X00361**3
               LENGTH=1                                                 00362**3
*                                                                       00363**3
APOL04   DFHMDF ATTRB=(ASKIP),                                         X00364**3
               COLOR=BLUE,                                             X00365**3
               LENGTH=5,                                               X00366**3
               POS=(11,24)                                              00367**3
*                                                                       00368**3
ASKU04   DFHMDF ATTRB=(ASKIP),                                         X00369**3
               COLOR=BLUE,                                             X00370**3
               LENGTH=11,                                              X00371**3
               POS=(11,34)                                              00372**3
*                                                                       00373**3
APQTY04  DFHMDF ATTRB=(ASKIP),                                         X00374**3
               COLOR=BLUE,                                             X00375**3
               PICOUT='ZZZZZZ',                                        X00376**3
               LENGTH=6,                                               X00377**3
               POS=(11,46)                                              00378**3
*                                                                       00373**3
ACQTY04  DFHMDF ATTRB=(ASKIP),                                         X00374**3
               COLOR=BLUE,                                             X00375**3
               PICOUT='ZZZZZZ',                                        X00376**3
               LENGTH=6,                                               X00377**3
               POS=(11,56)                                              00378**3
*                                                                       00373**3
AVQTY04  DFHMDF ATTRB=(ASKIP),                                         X00374**3
               COLOR=BLUE,                                             X00375**3
               PICOUT='ZZZZZZ',                                        X00376**3
               LENGTH=6,                                               X00377**3
               POS=(11,66)                                              00378**3
*                                                                       00379**3
*        LINE 12                                                        00386**3
*                                                                       00387**3
ASEL05   DFHMDF ATTRB=(UNPROT,IC),                                     X00388**3
               COLOR=GREEN,                                            X00389**3
               HILIGHT=UNDERLINE,                                      X00390**3
               LENGTH=1,                                               X00391**3
               POS=(12,3)                                               00392**3
         DFHMDF ATTRB=(ASKIP),                                         X00393**3
               POS=(12,5),                                             X00394**3
               INITIAL=' ',                                            X00395**3
               LENGTH=1                                                 00396**3
*                                                                       00397**3
AACT05   DFHMDF ATTRB=(ASKIP),                                         X00398**3
               COLOR=BLUE,                                             X00399**3
               LENGTH=3,                                               X00400**3
               POS=(12,08)                                              00401**3
*                                                                       00402**3
AQTY05   DFHMDF ATTRB=(UNPROT,NUM),                                    X00403**3
               COLOR=GREEN,                                            X00404**3
               HILIGHT=UNDERLINE,                                      X00405**3
               PICOUT='ZZZZZ',                                         X00406**3
               LENGTH=5,                                               X00407**3
               POS=(12,15)                                              00408**3
         DFHMDF ATTRB=(ASKIP),                                         X00409**3
               POS=(12,21),                                            X00410**3
               INITIAL=' ',                                            X00411**3
               LENGTH=1                                                 00412**3
*                                                                       00413**3
APOL05   DFHMDF ATTRB=(ASKIP),                                         X00414**3
               COLOR=BLUE,                                             X00415**3
               LENGTH=5,                                               X00416**3
               POS=(12,24)                                              00417**3
*                                                                       00418**3
ASKU05   DFHMDF ATTRB=(ASKIP),                                         X00419**3
               COLOR=BLUE,                                             X00420**3
               LENGTH=11,                                              X00421**3
               POS=(12,34)                                              00422**3
*                                                                       00423**3
APQTY05  DFHMDF ATTRB=(ASKIP),                                         X00424**3
               COLOR=BLUE,                                             X00425**3
               PICOUT='ZZZZZZ',                                        X00426**3
               LENGTH=6,                                               X00427**3
               POS=(12,46)                                              00428**3
*                                                                       00423**3
ACQTY05  DFHMDF ATTRB=(ASKIP),                                         X00424**3
               COLOR=BLUE,                                             X00425**3
               PICOUT='ZZZZZZ',                                        X00426**3
               LENGTH=6,                                               X00427**3
               POS=(12,56)                                              00428**3
*                                                                       00423**3
AVQTY05  DFHMDF ATTRB=(ASKIP),                                         X00424**3
               COLOR=BLUE,                                             X00425**3
               PICOUT='ZZZZZZ',                                        X00426**3
               LENGTH=6,                                               X00427**3
               POS=(12,66)                                              00428**3
*                                                                       00435**3
*        LINE 13                                                        00436**3
*                                                                       00437**3
ASEL06   DFHMDF ATTRB=(UNPROT,IC),                                     X00438**3
               COLOR=GREEN,                                            X00439**3
               HILIGHT=UNDERLINE,                                      X00440**3
               LENGTH=1,                                               X00441**3
               POS=(13,3)                                               00442**3
         DFHMDF ATTRB=(ASKIP),                                         X00443**3
               POS=(13,5),                                             X00444**3
               INITIAL=' ',                                            X00445**3
               LENGTH=1                                                 00446**3
*                                                                       00447**3
AACT06   DFHMDF ATTRB=(ASKIP),                                         X00448**3
               COLOR=BLUE,                                             X00449**3
               LENGTH=3,                                               X00450**3
               POS=(13,08)                                              00451**3
*                                                                       00452**3
AQTY06   DFHMDF ATTRB=(UNPROT,NUM),                                    X00453**3
               COLOR=GREEN,                                            X00454**3
               HILIGHT=UNDERLINE,                                      X00455**3
               PICOUT='ZZZZZ',                                         X00456**3
               LENGTH=5,                                               X00457**3
               POS=(13,15)                                              00458**3
         DFHMDF ATTRB=(ASKIP),                                         X00459**3
               POS=(13,21),                                            X00460**3
               INITIAL=' ',                                            X00461**3
               LENGTH=1                                                 00462**3
*                                                                       00463**3
APOL06   DFHMDF ATTRB=(ASKIP),                                         X00464**3
               COLOR=BLUE,                                             X00465**3
               LENGTH=5,                                               X00466**3
               POS=(13,24)                                              00467**3
*                                                                       00468**3
ASKU06   DFHMDF ATTRB=(ASKIP),                                         X00469**3
               COLOR=BLUE,                                             X00470**3
               LENGTH=11,                                              X00471**3
               POS=(13,34)                                              00472**3
*                                                                       00473**3
APQTY06  DFHMDF ATTRB=(ASKIP),                                         X00474**3
               COLOR=BLUE,                                             X00475**3
               PICOUT='ZZZZZZ',                                        X00476**3
               LENGTH=06,                                              X00477**3
               POS=(13,46)                                              00478**3
*                                                                       00473**3
ACQTY06  DFHMDF ATTRB=(ASKIP),                                         X00474**3
               COLOR=BLUE,                                             X00475**3
               PICOUT='ZZZZZZ',                                        X00476**3
               LENGTH=06,                                              X00477**3
               POS=(13,56)                                              00478**3
*                                                                       00473**3
AVQTY06  DFHMDF ATTRB=(ASKIP),                                         X00474**3
               COLOR=BLUE,                                             X00475**3
               PICOUT='ZZZZZZ',                                        X00476**3
               LENGTH=06,                                              X00477**3
               POS=(13,66)                                              00478**3
*                                                                       00485**3
*        LINE 14                                                        00486**3
*                                                                       00487**3
ASEL07   DFHMDF ATTRB=(UNPROT,IC),                                     X00488**3
               COLOR=GREEN,                                            X00489**3
               HILIGHT=UNDERLINE,                                      X00490**3
               LENGTH=1,                                               X00491**3
               POS=(14,3)                                               00492**3
         DFHMDF ATTRB=(ASKIP),                                         X00493**3
               POS=(14,5),                                             X00494**3
               INITIAL=' ',                                            X00495**3
               LENGTH=1                                                 00496**3
*                                                                       00497**3
AACT07   DFHMDF ATTRB=(ASKIP),                                         X00498**3
               COLOR=BLUE,                                             X00499**3
               LENGTH=3,                                               X00500**3
               POS=(14,08)                                              00501**3
*                                                                       00502**3
AQTY07   DFHMDF ATTRB=(UNPROT,NUM),                                    X00503**3
               COLOR=GREEN,                                            X00504**3
               HILIGHT=UNDERLINE,                                      X00505**3
               PICOUT='ZZZZZ',                                         X00506**3
               LENGTH=5,                                               X00507**3
               POS=(14,15)                                              00508**3
         DFHMDF ATTRB=(ASKIP),                                         X00509**3
               POS=(14,21),                                            X00510**3
               INITIAL=' ',                                            X00511**3
               LENGTH=1                                                 00512**3
*                                                                       00513**3
APOL07   DFHMDF ATTRB=(ASKIP),                                         X00514**3
               COLOR=BLUE,                                             X00515**3
               LENGTH=5,                                               X00516**3
               POS=(14,24)                                              00517**3
*                                                                       00518**3
ASKU07   DFHMDF ATTRB=(ASKIP),                                         X00519**3
               COLOR=BLUE,                                             X00520**3
               LENGTH=11,                                              X00521**3
               POS=(14,34)                                              00522**3
*                                                                       00523**3
APQTY07  DFHMDF ATTRB=(ASKIP),                                         X00524**3
               COLOR=BLUE,                                             X00525**3
               PICOUT='ZZZZZZ',                                        X00526**3
               LENGTH=6,                                               X00527**3
               POS=(14,46)                                              00528**3
*                                                                       00523**3
ACQTY07  DFHMDF ATTRB=(ASKIP),                                         X00524**3
               COLOR=BLUE,                                             X00525**3
               PICOUT='ZZZZZZ',                                        X00526**3
               LENGTH=6,                                               X00527**3
               POS=(14,56)                                              00528**3
*                                                                       00523**3
AVQTY07  DFHMDF ATTRB=(ASKIP),                                         X00524**3
               COLOR=BLUE,                                             X00525**3
               PICOUT='ZZZZZZ',                                        X00526**3
               LENGTH=6,                                               X00527**3
               POS=(14,66)                                              00528**3
*                                                                       00535**3
*        LINE 15                                                        00536**3
*                                                                       00537**3
ASEL08   DFHMDF ATTRB=(UNPROT,IC),                                     X00538**3
               COLOR=GREEN,                                            X00539**3
               HILIGHT=UNDERLINE,                                      X00540**3
               LENGTH=1,                                               X00541**3
               POS=(15,3)                                               00542**3
         DFHMDF ATTRB=(ASKIP),                                         X00543**3
               POS=(15,5),                                             X00544**3
               INITIAL=' ',                                            X00545**3
               LENGTH=1                                                 00546**3
*                                                                       00547**3
AACT08   DFHMDF ATTRB=(ASKIP),                                         X00548**3
               COLOR=BLUE,                                             X00549**3
               LENGTH=3,                                               X00550**3
               POS=(15,08)                                              00551**3
*                                                                       00552**3
AQTY08   DFHMDF ATTRB=(UNPROT,NUM),                                    X00553**3
               COLOR=GREEN,                                            X00554**3
               HILIGHT=UNDERLINE,                                      X00555**3
               PICOUT='ZZZZZ',                                         X00556**3
               LENGTH=5,                                               X00557**3
               POS=(15,15)                                              00558**3
         DFHMDF ATTRB=(ASKIP),                                         X00559**3
               POS=(15,21),                                            X00560**3
               INITIAL=' ',                                            X00561**3
               LENGTH=1                                                 00562**3
*                                                                       00613**3
APOL08   DFHMDF ATTRB=(ASKIP),                                         X00614**3
               COLOR=BLUE,                                             X00615**3
               LENGTH=5,                                               X00616**3
               POS=(15,24)                                              00617**3
*                                                                       00568**3
ASKU08   DFHMDF ATTRB=(ASKIP),                                         X00569**3
               COLOR=BLUE,                                             X00570**3
               LENGTH=11,                                              X00571**3
               POS=(15,34)                                              00572**3
*                                                                       00573**3
APQTY08  DFHMDF ATTRB=(ASKIP),                                         X00574**3
               COLOR=BLUE,                                             X00575**3
               PICOUT='ZZZZZZ',                                        X00576**3
               LENGTH=6,                                               X00577**3
               POS=(15,46)                                              00578**3
*                                                                       00573**3
ACQTY08  DFHMDF ATTRB=(ASKIP),                                         X00574**3
               COLOR=BLUE,                                             X00575**3
               PICOUT='ZZZZZZ',                                        X00576**3
               LENGTH=6,                                               X00577**3
               POS=(15,56)                                              00578**3
*                                                                       00573**3
AVQTY08  DFHMDF ATTRB=(ASKIP),                                         X00574**3
               COLOR=BLUE,                                             X00575**3
               PICOUT='ZZZZZZ',                                        X00576**3
               LENGTH=6,                                               X00577**3
               POS=(15,66)                                              00578**3
*                                                                       00585**3
*        LINE 16                                                        00586**3
*                                                                       00587**3
ASEL09   DFHMDF ATTRB=(UNPROT,IC),                                     X00588**3
               COLOR=GREEN,                                            X00589**3
               HILIGHT=UNDERLINE,                                      X00590**3
               LENGTH=1,                                               X00591**3
               POS=(16,3)                                               00592**3
         DFHMDF ATTRB=(ASKIP),                                         X00593**3
               POS=(16,5),                                             X00594**3
               INITIAL=' ',                                            X00595**3
               LENGTH=1                                                 00596**3
*                                                                       00597**3
AACT09   DFHMDF ATTRB=(ASKIP),                                         X00598**3
               COLOR=BLUE,                                             X00599**3
               LENGTH=3,                                               X00600**3
               POS=(16,08)                                              00601**3
*                                                                       00602**3
AQTY09   DFHMDF ATTRB=(UNPROT,NUM),                                    X00603**3
               COLOR=GREEN,                                            X00604**3
               HILIGHT=UNDERLINE,                                      X00605**3
               PICOUT='ZZZZZ',                                         X00606**3
               LENGTH=5,                                               X00607**3
               POS=(16,15)                                              00608**3
         DFHMDF ATTRB=(ASKIP),                                         X00609**3
               POS=(16,21),                                            X00610**3
               INITIAL=' ',                                            X00611**3
               LENGTH=1                                                 00612**3
*                                                                       00613**3
APOL09   DFHMDF ATTRB=(ASKIP),                                         X00614**3
               COLOR=BLUE,                                             X00615**3
               LENGTH=5,                                               X00616**3
               POS=(16,24)                                              00617**3
*                                                                       00618**3
ASKU09   DFHMDF ATTRB=(ASKIP),                                         X00619**3
               COLOR=BLUE,                                             X00620**3
               LENGTH=11,                                              X00621**3
               POS=(16,34)                                              00622**3
*                                                                       00623**3
APQTY09  DFHMDF ATTRB=(ASKIP),                                         X00624**3
               COLOR=BLUE,                                             X00625**3
               PICOUT='ZZZZZZ',                                        X00626**3
               LENGTH=06,                                              X00627**3
               POS=(16,46)                                              00628**3
*                                                                       00623**3
ACQTY09  DFHMDF ATTRB=(ASKIP),                                         X00624**3
               COLOR=BLUE,                                             X00625**3
               PICOUT='ZZZZZZ',                                        X00626**3
               LENGTH=6,                                               X00627**3
               POS=(16,56)                                              00628**3
*                                                                       00623**3
AVQTY09  DFHMDF ATTRB=(ASKIP),                                         X00624**3
               COLOR=BLUE,                                             X00625**3
               PICOUT='ZZZZZZ',                                        X00626**3
               LENGTH=6,                                               X00627**3
               POS=(16,66)                                              00628**3
*                                                                       00635**3
*        LINE 17                                                        00636**3
*                                                                       00637**3
ASEL10   DFHMDF ATTRB=(UNPROT,IC),                                     X00638**3
               COLOR=GREEN,                                            X00639**3
               HILIGHT=UNDERLINE,                                      X00640**3
               LENGTH=1,                                               X00641**3
               POS=(17,3)                                               00642**3
         DFHMDF ATTRB=(ASKIP),                                         X00643**3
               POS=(17,5),                                             X00644**3
               INITIAL=' ',                                            X00645**3
               LENGTH=1                                                 00646**3
*                                                                       00647**3
AACT10   DFHMDF ATTRB=(ASKIP),                                         X00648**3
               COLOR=BLUE,                                             X00649**3
               LENGTH=3,                                               X00650**3
               POS=(17,08)                                              00651**3
*                                                                       00652**3
AQTY10   DFHMDF ATTRB=(UNPROT,NUM),                                    X00653**3
               COLOR=GREEN,                                            X00654**3
               HILIGHT=UNDERLINE,                                      X00655**3
               PICOUT='ZZZZZ',                                         X00656**3
               LENGTH=5,                                               X00657**3
               POS=(17,15)                                              00658**3
         DFHMDF ATTRB=(ASKIP),                                         X00659**3
               POS=(17,21),                                            X00660**3
               INITIAL=' ',                                            X00661**3
               LENGTH=1                                                 00662**3
*                                                                       00663**3
APOL10   DFHMDF ATTRB=(ASKIP),                                         X00664**3
               COLOR=BLUE,                                             X00665**3
               LENGTH=5,                                               X00666**3
               POS=(17,24)                                              00667**3
*                                                                       00668**3
ASKU10   DFHMDF ATTRB=(ASKIP),                                         X00669**3
               COLOR=BLUE,                                             X00670**3
               LENGTH=11,                                              X00671**3
               POS=(17,34)                                              00672**3
*                                                                       00673**3
APQTY10  DFHMDF ATTRB=(ASKIP),                                         X00674**3
               COLOR=BLUE,                                             X00675**3
               PICOUT='ZZZZZZ',                                        X00676**3
               LENGTH=6,                                               X00677**3
               POS=(17,46)                                              00678**3
*                                                                       00673**3
ACQTY10  DFHMDF ATTRB=(ASKIP),                                         X00674**3
               COLOR=BLUE,                                             X00675**3
               PICOUT='ZZZZZZ',                                        X00676**3
               LENGTH=6,                                               X00677**3
               POS=(17,56)                                              00678**3
*                                                                       00673**3
AVQTY10  DFHMDF ATTRB=(ASKIP),                                         X00674**3
               COLOR=BLUE,                                             X00675**3
               PICOUT='ZZZZZZ',                                        X00676**3
               LENGTH=6,                                               X00677**3
               POS=(17,66)                                              00678**3
*-------------------------------------------------------------------*           
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *           
*-------------------------------------------------------------------*           
*                                                                       00729**3
*        LINE 18                                                        00736   
*                                                                       00737   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00738   
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00739   
               COLOR=NEUTRAL,                                          X00740   
               LENGTH=25,                                              X00741   
               POS=(18,39)                                              00742   
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00743   
               JUSTIFY=(LEFT,BLANK),                                   X00744   
               COLOR=BLUE,                                             X00745   
               PICOUT='ZZZZZZZ',                                       X00746   
               LENGTH=7,                                               X00747   
               POS=(18,66)                                              00748   
*                                                                       00749   
         DFHMSD TYPE=FINAL                                              00750   
         END                                                            00751   
