*          DATA SET RCKM230    AT LEVEL 004 AS OF 03/24/94                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  RCKM230                                            *   00004   
*        MAP     RC230A                                             *   00005   
*        PROGRAM RCKCS230                                           *   00006   
*        TRANSID E230 - STORE DISTRIBUTION ADD                      *   00007   
*        SYSTEM  RC NEW RECEIVING                                   *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
RCKM230 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
RC230A  DFHMDI LINE=2,COLUMN=1,                                        X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='OP ID...:',                                    X00022   
               LENGTH=09,                                              X00023   
               COLOR=NEUTRAL,                                          X00024   
               POS=(03,01)                                              00025   
*                                                                       00026   
AOPER   DFHMDF ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=4,                                               X00028   
               COLOR=BLUE,                                             X00029   
               POS=(03,11)                                              00030   
*                                                                       00031   
AFCLTY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=4,                                               X00033   
               COLOR=BLUE,                                             X00034   
               POS=(03,16)                                              00035   
*                                                                       00036   
AFDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00037   
               LENGTH=30,                                              X00038   
               COLOR=BLUE,                                             X00039   
               POS=(03,22)                                              00040**4
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='RCVR NO.:',                                    X00043   
               LENGTH=09,                                              X00044   
               COLOR=NEUTRAL,                                          X00045   
               POS=(04,01)                                              00046   
*                                                                       00047   
ARCVR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00048   
               LENGTH=13,                                              X00049   
               COLOR=BLUE,                                             X00050   
               POS=(04,11)                                              00051   
*                                                                       00052   
ALNPK   DFHMDF ATTRB=(ASKIP,BRT),                                      X00053   
               LENGTH=08,                                              X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(04,27)                                              00057   
*                                                                       00058   
ALINE   DFHMDF ATTRB=(ASKIP,NORM),                                     X00059   
               LENGTH=04,                                              X00060   
               COLOR=BLUE,                                             X00061   
               POS=(04,36)                                              00062   
*                                                                       00063   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00064   
               INITIAL='VNDR NME:',                                    X00065   
               LENGTH=09,                                              X00066   
               COLOR=NEUTRAL,                                          X00067   
               POS=(05,01)                                              00068   
*                                                                       00069   
AVEND   DFHMDF ATTRB=(ASKIP,NORM),                                     X00070   
               LENGTH=30,                                              X00071**2
               COLOR=BLUE,                                             X00072   
               POS=(05,11)                                              00073   
*                                                                       00074**2
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00075**2
               INITIAL='PACK SLIP:',                                   X00076**2
               LENGTH=10,                                              X00077**2
               COLOR=NEUTRAL,                                          X00078**2
               POS=(05,43)                                              00079**2
*                                                                       00080**2
APKSLIP DFHMDF ATTRB=(ASKIP,NORM),                                     X00081**3
               LENGTH=10,                                              X00082**2
               COLOR=BLUE,                                             X00083**2
               POS=(05,54)                                              00084**2
*                                                                       00085   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00086   
               INITIAL='STORE NUMBER:',                                X00087   
               LENGTH=13,                                              X00088   
               COLOR=NEUTRAL,                                          X00089   
               POS=(08,18)                                              00090   
*                                                                       00091   
ASTR    DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00092   
               LENGTH=04,                                              X00093   
               COLOR=GREEN,                                            X00094   
               HILIGHT=UNDERLINE,                                      X00095   
               POS=(08,32)                                              00096   
*                                                                       00097   
ASDESC  DFHMDF ATTRB=(ASKIP,NORM),                                     X00098   
               LENGTH=30,                                              X00099   
               COLOR=BLUE,                                             X00100   
               POS=(08,37)                                              00101   
*                                                                       00102   
         DFHMSD TYPE=FINAL                                              00103   
         END                                                            00104   
