*          DATA SET RCKM817    AT LEVEL 002 AS OF 02/10/00              00003   
        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  RCKM817                                            *   00007   
*        MAP     RC817A                                             *   00008   
*        PROGRAM RCKCS817                                           *   00009   
*        TRANSID E817 - VERIFY RECEIVER BY PACK                     *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
RCKM817 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
RC817A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(19,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=08,                                              X        
               INITIAL='RCVR NO:'                                       00020   
APO     DFHMDF POS=(02,11),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=08,                                              X        
               PICOUT='99999999'                                                
ARCVR   DFHMDF POS=(02,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
        DFHMDF POS=(02,32),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='OP ID......:'                                   00020   
AOPER   DFHMDF POS=(02,45),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
AFCLTY  DFHMDF POS=(02,50),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
ANAME   DFHMDF POS=(02,56),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=018                                                       
*                                                                               
        DFHMDF POS=(03,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=08,                                              X        
               INITIAL='DEPT NO:'                                       00020   
ADEPT   DFHMDF POS=(03,11),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
        DFHMDF POS=(03,32),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='RCVR STATUS:'                                   00020   
ASTAT   DFHMDF POS=(03,45),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=02                                                        
ADTETK  DFHMDF POS=(03,50),                                            X00018   
               COLOR=BLUE,                                             X00022   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=28                                                        
**********************************************************************          
        DFHMDF POS=(04,02),                                            X00023   
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR PCKSLP PACKS:'                             00025   
APCKSLP  DFHMDF POS=(04,021),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(04,32),                                            X00023   
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR ODD UNITS.........:'                       00025   
AODD     DFHMDF POS=(04,057),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*                                                                               
        DFHMDF POS=(05,02),                                            X00023   
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR CURRNT PACKS:'                             00025   
AACTUAL  DFHMDF POS=(05,021),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(05,32),                                            X00023   
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR TOTAL CURRNT UNITS:'                       00025   
ATACTUAL DFHMDF POS=(05,057),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*                                                                               
        DFHMDF POS=(06,02),                                            X00023   
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR VERFYD PACKS:'                             00025   
AVERFYD  DFHMDF POS=(06,021),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(06,32),                                            X00023   
               LENGTH=024,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR TOTAL VERFYD UNITS:'                       00025   
ATVERFYD DFHMDF POS=(06,057),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*******************************************************************             
        DFHMDF POS=(07,44),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(07,50),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(07,56),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(07,59),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(07,65),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(07,68),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
        DFHMDF POS=(08,59),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
        DFHMDF POS=(08,66),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
AACTEXP DFHMDF POS=(08,73),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006                                                       
*                                                                               
        DFHMDF POS=(09,11),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='PACK'                                           00025   
        DFHMDF POS=(09,25),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='STAT'                                           00025   
        DFHMDF POS=(09,31),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019,                                             X        
               INITIAL='PKSLP CURRENT VRFYD'                            00025   
        DFHMDF POS=(09,53),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ODD'                                            00025   
        DFHMDF POS=(09,58),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='CURRENT'                                        00025   
        DFHMDF POS=(09,66),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='VRFYD'                                          00025   
        DFHMDF POS=(09,73),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='VRFYD'                                          00025   
*                                                                               
        DFHMDF POS=(10,02),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008,                                             X        
               INITIAL='S ACT CL'                                       00025   
        DFHMDF POS=(10,12),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='ID'                                             00025   
        DFHMDF POS=(10,16),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008,                                             X        
               INITIAL='PACK SKU'                                       00025   
        DFHMDF POS=(10,26),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='CD'                                             00025   
        DFHMDF POS=(10,31),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='PACKS'                                          00025   
        DFHMDF POS=(10,38),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='PACKS'                                          00025   
        DFHMDF POS=(10,45),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='PACKS'                                          00025   
        DFHMDF POS=(10,52),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(10,59),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(10,66),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
        DFHMDF POS=(10,73),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='SOURCE'                                         00025   
*******************************************************************             
ASEL01  DFHMDF POS=(11,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT01  DFHMDF POS=(11,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL01   DFHMDF POS=(11,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID01 DFHMDF POS=(11,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK01 DFHMDF POS=(11,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT01 DFHMDF POS=(11,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK01 DFHMDF POS=(11,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK01 DFHMDF POS=(11,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK01 DFHMDF POS=(11,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN01 DFHMDF POS=(11,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN01 DFHMDF POS=(11,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN01 DFHMDF POS=(11,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC01 DFHMDF POS=(11,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(12,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT02  DFHMDF POS=(12,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL02   DFHMDF POS=(12,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID02 DFHMDF POS=(12,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK02 DFHMDF POS=(12,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT02 DFHMDF POS=(12,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK02 DFHMDF POS=(12,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK02 DFHMDF POS=(12,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK02 DFHMDF POS=(12,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN02 DFHMDF POS=(12,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN02 DFHMDF POS=(12,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN02 DFHMDF POS=(12,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC02 DFHMDF POS=(12,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(13,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT03  DFHMDF POS=(13,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL03   DFHMDF POS=(13,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID03 DFHMDF POS=(13,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK03 DFHMDF POS=(13,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT03 DFHMDF POS=(13,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK03 DFHMDF POS=(13,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK03 DFHMDF POS=(13,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK03 DFHMDF POS=(13,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN03 DFHMDF POS=(13,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN03 DFHMDF POS=(13,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN03 DFHMDF POS=(13,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC03 DFHMDF POS=(13,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(14,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT04  DFHMDF POS=(14,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL04   DFHMDF POS=(14,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID04 DFHMDF POS=(14,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK04 DFHMDF POS=(14,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT04 DFHMDF POS=(14,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK04 DFHMDF POS=(14,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK04 DFHMDF POS=(14,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK04 DFHMDF POS=(14,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN04 DFHMDF POS=(14,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN04 DFHMDF POS=(14,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN04 DFHMDF POS=(14,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC04 DFHMDF POS=(14,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(15,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT05  DFHMDF POS=(15,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL05   DFHMDF POS=(15,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID05 DFHMDF POS=(15,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK05 DFHMDF POS=(15,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT05 DFHMDF POS=(15,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK05 DFHMDF POS=(15,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK05 DFHMDF POS=(15,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK05 DFHMDF POS=(15,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN05 DFHMDF POS=(15,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN05 DFHMDF POS=(15,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN05 DFHMDF POS=(15,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC05 DFHMDF POS=(15,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(16,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT06  DFHMDF POS=(16,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL06   DFHMDF POS=(16,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID06 DFHMDF POS=(16,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK06 DFHMDF POS=(16,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT06 DFHMDF POS=(16,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK06 DFHMDF POS=(16,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK06 DFHMDF POS=(16,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK06 DFHMDF POS=(16,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN06 DFHMDF POS=(16,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN06 DFHMDF POS=(16,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN06 DFHMDF POS=(16,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC06 DFHMDF POS=(16,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(17,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT07  DFHMDF POS=(17,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL07   DFHMDF POS=(17,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID07 DFHMDF POS=(17,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK07 DFHMDF POS=(17,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT07 DFHMDF POS=(17,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK07 DFHMDF POS=(17,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK07 DFHMDF POS=(17,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK07 DFHMDF POS=(17,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN07 DFHMDF POS=(17,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN07 DFHMDF POS=(17,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN07 DFHMDF POS=(17,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC07 DFHMDF POS=(17,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(18,02),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT08  DFHMDF POS=(18,04),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ACL08   DFHMDF POS=(18,08),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKID08 DFHMDF POS=(18,011),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004                                               00140   
APKSK08 DFHMDF POS=(18,016),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ASTAT08 DFHMDF POS=(18,026),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
APKPK08 DFHMDF POS=(18,030),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AACPK08 DFHMDF POS=(18,037),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AVFPK08 DFHMDF POS=(18,044),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00140   
AODUN08 DFHMDF POS=(18,051),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AACUN08 DFHMDF POS=(18,058),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFUN08 DFHMDF POS=(18,065),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='ZZZZZ9'                                          00033   
AVFSC08 DFHMDF POS=(18,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
         DFHMDF POS=(19,040),                                          X00728   
               COLOR=NEUTRAL,                                          X00729   
               ATTRB=(ASKIP,NORM),                                     X00730   
               LENGTH=025,                                             X00731   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,067),                                          X00733   
               COLOR=BLUE,                                             X00734   
               ATTRB=(ASKIP,NORM),                                     X00735   
               LENGTH=007,                                             X00736   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
