*          DATA SET RCKM216    AT LEVEL 001 AS OF 02/20/96                      
*          DATA SET RCKM216    AT LEVEL 004 AS OF 01/18/96              00001   
*          DATA SET RCKM216    AT LEVEL 008 AS OF 04/20/94              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  RCKM216                                            *   00006   
*        MAP     RC216A                                             *   00007   
*        PROGRAM RCKCS216                                           *   00008   
*        TRANSID E216 - MATCH PURCHASE ORDER LINE                   *   00009   
*        SYSTEM  RC NEW RECEIVING                                   *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
RCKM216 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
RC216A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT),                                 X00022   
               CTRL=(FREEKB)                                            00023   
*                                                                       00024   
        DFHMDF POS=(01,01),                                            X00025   
               LENGTH=06,                                              X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               COLOR=NEUTRAL,                                          X00028   
               INITIAL='OP ID:'                                         00029   
AOPER   DFHMDF POS=(01,08),                                            X00030   
               LENGTH=04,                                              X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               COLOR=BLUE                                               00033   
        DFHMDF POS=(01,16),                                            X00034   
               LENGTH=06,                                              X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               COLOR=NEUTRAL,                                          X00037   
               INITIAL='FCLTY:'                                         00038   
AFCLTY  DFHMDF POS=(01,23),                                            X00039   
               LENGTH=04,                                              X00040   
               ATTRB=(ASKIP,NORM),                                     X00041   
               COLOR=BLUE                                               00042   
*                                                                       00043   
        DFHMDF POS=(02,01),                                            X00044   
               LENGTH=06,                                              X00045   
               ATTRB=(ASKIP,NORM),                                     X00046   
               COLOR=NEUTRAL,                                          X00047   
               INITIAL='PO NO:'                                         00048   
APO     DFHMDF POS=(02,08),                                            X00049   
               LENGTH=08,                                              X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               COLOR=BLUE                                               00052   
        DFHMDF POS=(02,17),                                            X00053   
               LENGTH=06,                                              X00054   
               ATTRB=(ASKIP,NORM),                                     X00055   
               COLOR=NEUTRAL,                                          X00056   
               INITIAL='PS NO:'                                         00057   
APKSLIP DFHMDF POS=(02,24),                                            X00058   
               LENGTH=10,                                              X00059   
               ATTRB=(ASKIP,NORM),                                     X00060   
               COLOR=BLUE                                               00061   
        DFHMDF POS=(02,35),                                            X00062   
               LENGTH=04,                                              X00063   
               ATTRB=(ASKIP,NORM),                                     X00064   
               COLOR=NEUTRAL,                                          X00065   
               INITIAL='STR:'                                           00066   
ASTR    DFHMDF POS=(02,40),                                            X00067   
               LENGTH=04,                                              X00068   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=BLUE                                               00070   
        DFHMDF POS=(02,45),                                            X00071   
               LENGTH=05,                                              X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               COLOR=NEUTRAL,                                          X00074   
               INITIAL='ITEMS'                                          00075   
ASTRTIT DFHMDF POS=(02,51),                                            X00076   
               LENGTH=05,                                              X00077   
               ATTRB=(NUM,UNPROT,NORM),                                X00078   
               COLOR=GREEN,                                            X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               PICOUT='ZZZZ9'                                           00081   
        DFHMDF POS=(02,57),                                            X00082   
               LENGTH=02,                                              X00083   
               ATTRB=(ASKIP,NORM),                                     X00084   
               COLOR=NEUTRAL,                                          X00085   
               INITIAL='TO'                                             00086   
AENDIT  DFHMDF POS=(02,60),                                            X00087   
               LENGTH=05,                                              X00088   
               ATTRB=(ASKIP,NORM),                                     X00089   
               COLOR=BLUE,                                             X00090   
               PICOUT='ZZZZ9'                                           00091   
        DFHMDF POS=(02,66),                                            X00092   
               LENGTH=02,                                              X00093   
               ATTRB=(ASKIP,NORM),                                     X00094   
               COLOR=NEUTRAL,                                          X00095   
               INITIAL='OF'                                             00096   
ATOTIT  DFHMDF POS=(02,69),                                            X00097   
               LENGTH=05,                                              X00098   
               ATTRB=(ASKIP,NORM),                                     X00099   
               COLOR=BLUE,                                             X00100   
               PICOUT='ZZZZ9'                                           00101   
*                                                                       00102   
        DFHMDF POS=(03,01),                                            X00103   
               LENGTH=16,                                              X00104   
               ATTRB=(PROT,NORM),                                      X00105   
               COLOR=NEUTRAL,                                          X00106   
               INITIAL='SEARCH FOR LINE:'                               00107   
ALINE   DFHMDF POS=(03,18),                                            X00108   
               LENGTH=04,                                              X00109   
               ATTRB=(UNPROT,NORM,IC),                                 X00110   
               HILIGHT=UNDERLINE,                                      X00111   
               COLOR=GREEN                                              00112   
        DFHMDF POS=(03,23),                                            X00113   
               LENGTH=01,                                              X00114   
               COLOR=NEUTRAL,                                          X00115   
               ATTRB=(ASKIP)                                            00116   
        DFHMDF POS=(03,40),                                            X00117   
               LENGTH=12,                                              X00118   
               ATTRB=(ASKIP,NORM),                                     X00119   
               COLOR=NEUTRAL,                                          X00120   
               INITIAL='VENDOR NAME:'                                   00121   
AVEND   DFHMDF POS=(03,53),                                            X00122   
               LENGTH=27,                                              X00123   
               ATTRB=(ASKIP,NORM),                                     X00124   
               COLOR=BLUE                                               00125   
*                                                                       00126   
        DFHMDF POS=(05,12),                                            X00127   
               LENGTH=02,                                              X00128   
               ATTRB=(PROT,NORM),                                      X00129   
               COLOR=NEUTRAL,                                          X00130   
               INITIAL='PO'                                             00131   
        DFHMDF POS=(05,16),                                            X00132   
               LENGTH=12,                                              X00133   
               ATTRB=(PROT,NORM),                                      X00134   
               COLOR=NEUTRAL,                                          X00135   
               INITIAL='VENDOR STYLE'                                   00136   
        DFHMDF POS=(05,37),                                            X00137   
               LENGTH=17,                                              X00138   
               ATTRB=(PROT,NORM),                                      X00139   
               COLOR=NEUTRAL,                                          X00140   
               INITIAL='COLOR DESCRIPTION'                              00141   
        DFHMDF POS=(05,66),                                            X00142   
               LENGTH=03,                                              X00143   
               ATTRB=(PROT,NORM),                                      X00144   
               COLOR=NEUTRAL,                                          X00145   
               INITIAL='OTR'                                            00146   
        DFHMDF POS=(05,75),                                            X00147   
               LENGTH=04,                                              X00148   
               ATTRB=(PROT,NORM),                                      X00149   
               COLOR=NEUTRAL,                                          X00150   
               INITIAL='COST'                                           00151   
*                                                                       00152   
        DFHMDF POS=(06,01),                                            X00153   
               LENGTH=03,                                              X00154   
               ATTRB=(PROT,NORM),                                      X00155   
               COLOR=NEUTRAL,                                          X00156   
               INITIAL='SEL'                                            00157   
        DFHMDF POS=(06,06),                                            X00158   
               LENGTH=03,                                              X00159   
               ATTRB=(PROT,NORM),                                      X00160   
               COLOR=NEUTRAL,                                          X00161   
               INITIAL='QTY'                                            00162   
        DFHMDF POS=(06,11),                                            X00163   
               LENGTH=04,                                              X00164   
               ATTRB=(PROT,NORM),                                      X00165   
               COLOR=NEUTRAL,                                          X00166   
               INITIAL='LINE'                                           00167   
        DFHMDF POS=(06,16),                                            X00168   
               LENGTH=11,                                              X00169   
               ATTRB=(PROT,NORM),                                      X00170   
               COLOR=NEUTRAL,                                          X00171   
               INITIAL='DESCRIPTION'                                    00172   
        DFHMDF POS=(06,37),                                            X00173   
               LENGTH=16,                                              X00174   
               ATTRB=(PROT,NORM),                                      X00175   
               COLOR=NEUTRAL,                                          X00176   
               INITIAL='SIZE DESCRIPTION'                               00177   
        DFHMDF POS=(06,63),                                            X00178   
               LENGTH=06,                                              X00179   
               ATTRB=(PROT,NORM),                                      X00180   
               COLOR=NEUTRAL,                                          X00181   
               INITIAL='CL SKU'                                         00182   
        DFHMDF POS=(06,74),                                            X00183   
               LENGTH=06,                                              X00184   
               ATTRB=(PROT,NORM),                                      X00185   
               COLOR=NEUTRAL,                                          X00186   
               INITIAL='STATUS'                                         00187   
*                                                                       00188   
ASEL01  DFHMDF POS=(07,02),                                            X00189   
               LENGTH=01,                                              X00190   
               ATTRB=(UNPROT,NORM),                                    X00191   
               HILIGHT=UNDERLINE,                                      X00192   
               COLOR=GREEN                                              00193   
AQTY01  DFHMDF POS=(07,04),                                            X00194   
               LENGTH=06,                                              X00195   
               ATTRB=(UNPROT,NORM,NUM),                                X00196   
               HILIGHT=UNDERLINE,                                      X00197   
               COLOR=GREEN                                              00198   
ALINE01 DFHMDF POS=(07,11),                                            X00199   
               LENGTH=04,                                              X00200   
               ATTRB=(ASKIP,NORM),                                     X00201   
               COLOR=BLUE                                               00202   
ASTYL01 DFHMDF POS=(07,16),                                            X00203   
               LENGTH=20,                                              X00204   
               ATTRB=(ASKIP,NORM),                                     X00205   
               COLOR=BLUE                                               00206   
ACLR01  DFHMDF POS=(07,37),                                            X00207   
               LENGTH=25,                                              X00208   
               ATTRB=(ASKIP,NORM),                                     X00209   
               COLOR=BLUE                                               00210   
AOTR01  DFHMDF POS=(07,63),                                            X00211   
               LENGTH=06,                                              X00212   
               ATTRB=(ASKIP,NORM),                                     X00213   
               COLOR=BLUE                                               00214   
ACOST01 DFHMDF POS=(07,70),                                            X00215   
               LENGTH=10,                                              X00216   
               ATTRB=(ASKIP,NORM),                                     X00217   
               COLOR=BLUE                                               00218   
*                                                                       00219   
ADESC01 DFHMDF POS=(08,16),                                            X00220   
               LENGTH=20,                                              X00221   
               ATTRB=(ASKIP,NORM),                                     X00222   
               COLOR=BLUE                                               00223   
ASIZE01 DFHMDF POS=(08,37),                                            X00224   
               LENGTH=25,                                              X00225   
               ATTRB=(ASKIP,NORM),                                     X00226   
               COLOR=BLUE                                               00227   
ACL01   DFHMDF POS=(08,63),                                            X00228   
               LENGTH=02,                                              X00229   
               ATTRB=(ASKIP,NORM),                                     X00230   
               COLOR=BLUE                                               00231   
ASKU01  DFHMDF POS=(08,66),                                            X00232   
               LENGTH=08,                                              X00233   
               ATTRB=(ASKIP,NORM),                                     X00234   
               COLOR=BLUE                                               00235   
ASTAT01 DFHMDF POS=(08,76),                                            X00236   
               LENGTH=2,                                               X00237   
               ATTRB=(ASKIP,NORM),                                     X00238   
               COLOR=BLUE                                               00239   
*                                                                       00240   
ASEL02  DFHMDF POS=(09,02),                                            X00241   
               LENGTH=01,                                              X00242   
               ATTRB=(UNPROT,NORM),                                    X00243   
               HILIGHT=UNDERLINE,                                      X00244   
               COLOR=GREEN                                              00245   
AQTY02  DFHMDF POS=(09,04),                                            X00246   
               LENGTH=06,                                              X00247   
               ATTRB=(UNPROT,NORM,NUM),                                X00248   
               HILIGHT=UNDERLINE,                                      X00249   
               COLOR=GREEN                                              00250   
ALINE02 DFHMDF POS=(09,11),                                            X00251   
               LENGTH=04,                                              X00252   
               ATTRB=(ASKIP,NORM),                                     X00253   
               COLOR=BLUE                                               00254   
ASTYL02 DFHMDF POS=(09,16),                                            X00255   
               LENGTH=20,                                              X00256   
               ATTRB=(ASKIP,NORM),                                     X00257   
               COLOR=BLUE                                               00258   
ACLR02  DFHMDF POS=(09,37),                                            X00259   
               LENGTH=25,                                              X00260   
               ATTRB=(ASKIP,NORM),                                     X00261   
               COLOR=BLUE                                               00262   
AOTR02  DFHMDF POS=(09,63),                                            X00263   
               LENGTH=06,                                              X00264   
               ATTRB=(ASKIP,NORM),                                     X00265   
               COLOR=BLUE                                               00266   
ACOST02 DFHMDF POS=(09,70),                                            X00267   
               LENGTH=10,                                              X00268   
               ATTRB=(ASKIP,NORM),                                     X00269   
               COLOR=BLUE                                               00270   
*                                                                       00271   
ADESC02 DFHMDF POS=(10,16),                                            X00272   
               LENGTH=20,                                              X00273   
               ATTRB=(ASKIP,NORM),                                     X00274   
               COLOR=BLUE                                               00275   
ASIZE02 DFHMDF POS=(10,37),                                            X00276   
               LENGTH=25,                                              X00277   
               ATTRB=(ASKIP,NORM),                                     X00278   
               COLOR=BLUE                                               00279   
ACL02   DFHMDF POS=(10,63),                                            X00280   
               LENGTH=02,                                              X00281   
               ATTRB=(ASKIP,NORM),                                     X00282   
               COLOR=BLUE                                               00283   
ASKU02  DFHMDF POS=(10,66),                                            X00284   
               LENGTH=08,                                              X00285   
               ATTRB=(ASKIP,NORM),                                     X00286   
               COLOR=BLUE                                               00287   
ASTAT02 DFHMDF POS=(10,76),                                            X00288   
               LENGTH=02,                                              X00289   
               ATTRB=(ASKIP,NORM),                                     X00290   
               COLOR=BLUE                                               00291   
*                                                                       00292   
ASEL03  DFHMDF POS=(11,02),                                            X00293   
               LENGTH=01,                                              X00294   
               ATTRB=(UNPROT,NORM),                                    X00295   
               HILIGHT=UNDERLINE,                                      X00296   
               COLOR=GREEN                                              00297   
AQTY03  DFHMDF POS=(11,04),                                            X00298   
               LENGTH=06,                                              X00299   
               ATTRB=(UNPROT,NORM,NUM),                                X00300   
               HILIGHT=UNDERLINE,                                      X00301   
               COLOR=GREEN                                              00302   
ALINE03 DFHMDF POS=(11,11),                                            X00303   
               LENGTH=04,                                              X00304   
               ATTRB=(ASKIP,NORM),                                     X00305   
               COLOR=BLUE                                               00306   
ASTYL03 DFHMDF POS=(11,16),                                            X00307   
               LENGTH=20,                                              X00308   
               ATTRB=(ASKIP,NORM),                                     X00309   
               COLOR=BLUE                                               00310   
ACLR03  DFHMDF POS=(11,37),                                            X00311   
               LENGTH=25,                                              X00312   
               ATTRB=(ASKIP,NORM),                                     X00313   
               COLOR=BLUE                                               00314   
AOTR03  DFHMDF POS=(11,63),                                            X00315   
               LENGTH=06,                                              X00316   
               ATTRB=(ASKIP,NORM),                                     X00317   
               COLOR=BLUE                                               00318   
ACOST03 DFHMDF POS=(11,70),                                            X00319   
               LENGTH=10,                                              X00320   
               ATTRB=(ASKIP,NORM),                                     X00321   
               COLOR=BLUE                                               00322   
*                                                                       00323   
ADESC03 DFHMDF POS=(12,16),                                            X00324   
               LENGTH=20,                                              X00325   
               ATTRB=(ASKIP,NORM),                                     X00326   
               COLOR=BLUE                                               00327   
ASIZE03 DFHMDF POS=(12,37),                                            X00328   
               LENGTH=25,                                              X00329   
               ATTRB=(ASKIP,NORM),                                     X00330   
               COLOR=BLUE                                               00331   
ACL03   DFHMDF POS=(12,63),                                            X00332   
               LENGTH=02,                                              X00333   
               ATTRB=(ASKIP,NORM),                                     X00334   
               COLOR=BLUE                                               00335   
ASKU03  DFHMDF POS=(12,66),                                            X00336   
               LENGTH=08,                                              X00337   
               ATTRB=(ASKIP,NORM),                                     X00338   
               COLOR=BLUE                                               00339   
ASTAT03 DFHMDF POS=(12,76),                                            X00340   
               LENGTH=02,                                              X00341   
               ATTRB=(ASKIP,NORM),                                     X00342   
               COLOR=BLUE                                               00343   
*                                                                       00344   
ASEL04  DFHMDF POS=(13,02),                                            X00345   
               LENGTH=01,                                              X00346   
               ATTRB=(UNPROT,NORM),                                    X00347   
               HILIGHT=UNDERLINE,                                      X00348   
               COLOR=GREEN                                              00349   
AQTY04  DFHMDF POS=(13,04),                                            X00350   
               LENGTH=06,                                              X00351   
               ATTRB=(UNPROT,NORM,NUM),                                X00352   
               HILIGHT=UNDERLINE,                                      X00353   
               COLOR=GREEN                                              00354   
ALINE04 DFHMDF POS=(13,11),                                            X00355   
               LENGTH=04,                                              X00356   
               ATTRB=(ASKIP,NORM),                                     X00357   
               COLOR=BLUE                                               00358   
ASTYL04 DFHMDF POS=(13,16),                                            X00359   
               LENGTH=20,                                              X00360   
               ATTRB=(ASKIP,NORM),                                     X00361   
               COLOR=BLUE                                               00362   
ACLR04  DFHMDF POS=(13,37),                                            X00363   
               LENGTH=25,                                              X00364   
               ATTRB=(ASKIP,NORM),                                     X00365   
               COLOR=BLUE                                               00366   
AOTR04  DFHMDF POS=(13,63),                                            X00367   
               LENGTH=06,                                              X00368   
               ATTRB=(ASKIP,NORM),                                     X00369   
               COLOR=BLUE                                               00370   
ACOST04 DFHMDF POS=(13,70),                                            X00371   
               LENGTH=10,                                              X00372   
               ATTRB=(ASKIP,NORM),                                     X00373   
               COLOR=BLUE                                               00374   
*                                                                       00375   
ADESC04 DFHMDF POS=(14,16),                                            X00376   
               LENGTH=20,                                              X00377   
               ATTRB=(ASKIP,NORM),                                     X00378   
               COLOR=BLUE                                               00379   
ASIZE04 DFHMDF POS=(14,37),                                            X00380   
               LENGTH=25,                                              X00381   
               ATTRB=(ASKIP,NORM),                                     X00382   
               COLOR=BLUE                                               00383   
ACL04   DFHMDF POS=(14,63),                                            X00384   
               LENGTH=02,                                              X00385   
               ATTRB=(ASKIP,NORM),                                     X00386   
               COLOR=BLUE                                               00387   
ASKU04  DFHMDF POS=(14,66),                                            X00388   
               LENGTH=08,                                              X00389   
               ATTRB=(ASKIP,NORM),                                     X00390   
               COLOR=BLUE                                               00391   
ASTAT04 DFHMDF POS=(14,76),                                            X00392   
               LENGTH=02,                                              X00393   
               ATTRB=(ASKIP,NORM),                                     X00394   
               COLOR=BLUE                                               00395   
*                                                                       00396   
ASEL05  DFHMDF POS=(15,02),                                            X00397   
               LENGTH=01,                                              X00398   
               ATTRB=(UNPROT,NORM),                                    X00399   
               HILIGHT=UNDERLINE,                                      X00400   
               COLOR=GREEN                                              00401   
AQTY05  DFHMDF POS=(15,04),                                            X00402   
               LENGTH=06,                                              X00403   
               ATTRB=(UNPROT,NORM,NUM),                                X00404   
               HILIGHT=UNDERLINE,                                      X00405   
               COLOR=GREEN                                              00406   
ALINE05 DFHMDF POS=(15,11),                                            X00407   
               LENGTH=04,                                              X00408   
               ATTRB=(ASKIP,NORM),                                     X00409   
               COLOR=BLUE                                               00410   
ASTYL05 DFHMDF POS=(15,16),                                            X00411   
               LENGTH=20,                                              X00412   
               ATTRB=(ASKIP,NORM),                                     X00413   
               COLOR=BLUE                                               00414   
ACLR05  DFHMDF POS=(15,37),                                            X00415   
               LENGTH=25,                                              X00416   
               ATTRB=(ASKIP,NORM),                                     X00417   
               COLOR=BLUE                                               00418   
AOTR05  DFHMDF POS=(15,63),                                            X00419   
               LENGTH=06,                                              X00420   
               ATTRB=(ASKIP,NORM),                                     X00421   
               COLOR=BLUE                                               00422   
ACOST05 DFHMDF POS=(15,70),                                            X00423   
               LENGTH=10,                                              X00424   
               ATTRB=(ASKIP,NORM),                                     X00425   
               COLOR=BLUE                                               00426   
*                                                                       00427   
ADESC05 DFHMDF POS=(16,16),                                            X00428   
               LENGTH=20,                                              X00429   
               ATTRB=(ASKIP,NORM),                                     X00430   
               COLOR=BLUE                                               00431   
ASIZE05 DFHMDF POS=(16,37),                                            X00432   
               LENGTH=25,                                              X00433   
               ATTRB=(ASKIP,NORM),                                     X00434   
               COLOR=BLUE                                               00435   
ACL05   DFHMDF POS=(16,63),                                            X00436   
               LENGTH=02,                                              X00437   
               ATTRB=(ASKIP,NORM),                                     X00438   
               COLOR=BLUE                                               00439   
ASKU05  DFHMDF POS=(16,66),                                            X00440   
               LENGTH=08,                                              X00441   
               ATTRB=(ASKIP,NORM),                                     X00442   
               COLOR=BLUE                                               00443   
ASTAT06 DFHMDF POS=(16,76),                                            X00444   
               LENGTH=02,                                              X00445   
               ATTRB=(ASKIP,NORM),                                     X00446   
               COLOR=BLUE                                               00447   
*                                                                       00448   
ASEL06  DFHMDF POS=(17,02),                                            X00449   
               LENGTH=01,                                              X00450   
               ATTRB=(UNPROT,NORM),                                    X00451   
               HILIGHT=UNDERLINE,                                      X00452   
               COLOR=GREEN                                              00453   
AQTY06  DFHMDF POS=(17,04),                                            X00454   
               LENGTH=06,                                              X00455   
               ATTRB=(UNPROT,NORM,NUM),                                X00456   
               HILIGHT=UNDERLINE,                                      X00457   
               COLOR=GREEN                                              00458   
ALINE06 DFHMDF POS=(17,11),                                            X00459   
               LENGTH=04,                                              X00460   
               ATTRB=(ASKIP,NORM),                                     X00461   
               COLOR=BLUE                                               00462   
ASTYL06 DFHMDF POS=(17,16),                                            X00463   
               LENGTH=20,                                              X00464   
               ATTRB=(ASKIP,NORM),                                     X00465   
               COLOR=BLUE                                               00466   
ACLR06  DFHMDF POS=(17,37),                                            X00467   
               LENGTH=25,                                              X00468   
               ATTRB=(ASKIP,NORM),                                     X00469   
               COLOR=BLUE                                               00470   
AOTR06  DFHMDF POS=(17,63),                                            X00471   
               LENGTH=06,                                              X00472   
               ATTRB=(ASKIP,NORM),                                     X00473   
               COLOR=BLUE                                               00474   
ACOST06 DFHMDF POS=(17,70),                                            X00475   
               LENGTH=10,                                              X00476   
               ATTRB=(ASKIP,NORM),                                     X00477   
               COLOR=BLUE                                               00478   
*                                                                       00479   
ADESC06 DFHMDF POS=(18,16),                                            X00480   
               LENGTH=20,                                              X00481   
               ATTRB=(ASKIP,NORM),                                     X00482   
               COLOR=BLUE                                               00483   
ASIZE06 DFHMDF POS=(18,37),                                            X00484   
               LENGTH=25,                                              X00485   
               ATTRB=(ASKIP,NORM),                                     X00486   
               COLOR=BLUE                                               00487   
ACL06   DFHMDF POS=(18,63),                                            X00488   
               LENGTH=02,                                              X00489   
               ATTRB=(ASKIP,NORM),                                     X00490   
               COLOR=BLUE                                               00491   
ASKU06  DFHMDF POS=(18,66),                                            X00492   
               LENGTH=08,                                              X00493   
               ATTRB=(ASKIP,NORM),                                     X00494   
               COLOR=BLUE                                               00495   
ASTAT07 DFHMDF POS=(18,76),                                            X00496   
               LENGTH=02,                                              X00497   
               ATTRB=(ASKIP,NORM),                                     X00498   
               COLOR=BLUE                                               00499   
*                                                                       00500   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00501   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00502   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00503   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00504   
**************                                                          00505   
        DFHMSD TYPE=FINAL                                               00506   
**************                                                          00507   
        END                                                             00508   
