*          DATA SET RCKM262    AT LEVEL 001 AS OF 07/14/95                      
*          DATA SET RCKM262    AT LEVEL 001 AS OF 04/11/95              00001   
*          DATA SET RCKM262A1  AT LEVEL 004 AS OF 04/03/95              00002   
*          DATA SET RCKM262    AT LEVEL 008 AS OF 02/17/93              00003   
*          DATA SET RCKM262    AT LEVEL 002 AS OF 08/13/92              00004   
        PRINT  NOGEN                                                    00005   
RCKM262 DFHMSD TYPE=DSECT,                                             C00006   
               LANG=COBOL,                                             C00007   
               MODE=INOUT,                                             C00008   
               STORAGE=AUTO,                                           C00009   
               TERM=3270-2,                                            C00010   
               TIOAPFX=YES                                              00011   
**************                                                          00012   
RC262A  DFHMDI LINE=2,COLUMN=1,                                        C00013   
               SIZE=(19,80),                                           C00014   
               CTRL=(FREEKB),                                          C00015   
               MAPATTS=(COLOR,HILIGHT),                                C00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
**************                                                          00018   
        DFHMDF POS=(02,03),LENGTH=10,ATTRB=(PROT,NORM),                C00019   
               COLOR=NEUTRAL,                                          C00020   
               INITIAL='OPER UNIT:'                                     00021   
AOPRUNT DFHMDF POS=(02,14),LENGTH=04,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=BLUE                                               00023   
        DFHMDF POS=(02,20),LENGTH=09,ATTRB=(PROT,NORM),                C00024   
               COLOR=NEUTRAL,                                          C00025   
               INITIAL='FACILITY:'                                      00026   
AFCLTY  DFHMDF POS=(02,30),LENGTH=04,ATTRB=(ASKIP,NORM),               C00027   
               COLOR=BLUE                                               00028   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00029   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00030   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00031   
               COLOR=GREEN,                                            C00032   
               HILIGHT=UNDERLINE,                                      C00033   
               PICOUT='ZZZZ9'                                           00034   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='TO'                                             00037   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00038   
               COLOR=BLUE,                                             C00039   
               PICOUT='ZZZZ9'                                           00040   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00041   
               COLOR=NEUTRAL,                                          C00042   
               INITIAL='OF'                                             00043   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00044   
               COLOR=BLUE,                                             C00045   
               PICOUT='ZZZZ9'                                           00046   
*                                                                       00047   
        DFHMDF POS=(03,03),LENGTH=14,ATTRB=(PROT,NORM),                C00048   
               COLOR=NEUTRAL,                                          C00049   
               INITIAL='DELIVERY SCAC:'                                 00050   
ADELSCA DFHMDF POS=(03,18),LENGTH=04,ATTRB=(ASKIP,NORM),               C00051   
               COLOR=BLUE                                               00052   
        DFHMDF POS=(03,26),LENGTH=08,ATTRB=(PROT,NORM),                C00053   
               COLOR=NEUTRAL,                                          C00054   
               INITIAL='TRAILER:'                                       00055   
ATRALER DFHMDF POS=(03,35),LENGTH=10,ATTRB=(ASKIP,NORM),               C00056   
               COLOR=BLUE                                               00057   
        DFHMDF POS=(03,49),LENGTH=07,ATTRB=(PROT,NORM),                C00058   
               COLOR=NEUTRAL,                                          C00059   
               INITIAL='STATUS:'                                        00060   
ASTATUS DFHMDF POS=(03,57),LENGTH=02,ATTRB=(ASKIP,NORM),               C00061   
               COLOR=BLUE                                               00062   
*                                                                       00063   
        DFHMDF POS=(04,55),LENGTH=09,ATTRB=(PROT,NORM),                C00064   
               COLOR=NEUTRAL,                                          C00065   
               INITIAL='-CTN CNT-'                                      00066   
        DFHMDF POS=(04,76),LENGTH=04,ATTRB=(PROT,NORM),                C00067   
               COLOR=NEUTRAL,                                          C00068   
               INITIAL='ORIG'                                           00069   
*                                                                       00070   
        DFHMDF POS=(05,01),LENGTH=03,ATTRB=(PROT,NORM),                C00071   
               COLOR=NEUTRAL,                                          C00072   
               INITIAL='SEL'                                            00073   
        DFHMDF POS=(05,05),LENGTH=02,ATTRB=(PROT,NORM),                C00074   
               COLOR=NEUTRAL,                                          C00075   
               INITIAL='ST'                                             00076   
        DFHMDF POS=(05,08),LENGTH=03,ATTRB=(PROT,NORM),                C00077   
               COLOR=NEUTRAL,                                          C00078   
               INITIAL='RCV'                                            00079   
        DFHMDF POS=(05,13),LENGTH=05,ATTRB=(PROT,NORM),                C00080   
               COLOR=NEUTRAL,                                          C00081   
               INITIAL='PO NO'                                          00082   
        DFHMDF POS=(05,21),LENGTH=12,ATTRB=(PROT,NORM),                C00083   
               COLOR=NEUTRAL,                                          C00084   
               INITIAL='FREIGHT BILL'                                   00085   
        DFHMDF POS=(05,38),LENGTH=14,ATTRB=(PROT,NORM),                C00086   
               COLOR=NEUTRAL,                                          C00087   
               INITIAL='BILL OF LADING'                                 00088   
        DFHMDF POS=(05,55),LENGTH=08,ATTRB=(PROT,NORM),                C00089   
               COLOR=NEUTRAL,                                          C00090   
               INITIAL='ADJ  ASN'                                       00091   
        DFHMDF POS=(05,65),LENGTH=06,ATTRB=(PROT,NORM),                C00092   
               COLOR=NEUTRAL,                                          C00093   
               INITIAL='VENDOR'                                         00094   
        DFHMDF POS=(05,76),LENGTH=04,ATTRB=(PROT,NORM),                C00095   
               COLOR=NEUTRAL,                                          C00096   
               INITIAL='SCAC'                                           00097   
*                                                                       00098   
ASEL01  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00099   
               HILIGHT=UNDERLINE,                                      C00100   
               COLOR=GREEN                                              00101   
        DFHMDF POS=(06,04),LENGTH=00,ATTRB=(ASKIP)                      00102   
ASTA01  DFHMDF POS=(06,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00103   
               COLOR=BLUE                                               00104   
ARCV01  DFHMDF POS=(06,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00105   
               COLOR=BLUE                                               00106   
APO01   DFHMDF POS=(06,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00107   
               COLOR=BLUE                                               00108   
AFRBL01 DFHMDF POS=(06,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00109   
               COLOR=BLUE                                               00110   
ABOL01  DFHMDF POS=(06,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00111   
               COLOR=BLUE                                               00112   
AADCT01 DFHMDF POS=(06,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00113   
               COLOR=BLUE                                               00114   
AASCT01 DFHMDF POS=(06,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00115   
               COLOR=BLUE                                               00116   
AVEND01 DFHMDF POS=(06,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00117   
               COLOR=BLUE                                               00118   
AOSCA01 DFHMDF POS=(06,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00119   
               COLOR=BLUE                                               00120   
*                                                                       00121   
ASEL02  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00122   
               HILIGHT=UNDERLINE,                                      C00123   
               COLOR=GREEN                                              00124   
        DFHMDF POS=(07,04),LENGTH=00,ATTRB=(ASKIP)                      00125   
ASTA02  DFHMDF POS=(07,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00126   
               COLOR=BLUE                                               00127   
ARCV02  DFHMDF POS=(07,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00128   
               COLOR=BLUE                                               00129   
APO02   DFHMDF POS=(07,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00130   
               COLOR=BLUE                                               00131   
AFRBL02 DFHMDF POS=(07,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00132   
               COLOR=BLUE                                               00133   
ABOL02  DFHMDF POS=(07,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00134   
               COLOR=BLUE                                               00135   
AADCT02 DFHMDF POS=(07,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00136   
               COLOR=BLUE                                               00137   
AASCT02 DFHMDF POS=(07,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00138   
               COLOR=BLUE                                               00139   
AVEND02 DFHMDF POS=(07,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00140   
               COLOR=BLUE                                               00141   
AOSCA02 DFHMDF POS=(07,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00142   
               COLOR=BLUE                                               00143   
*                                                                       00144   
ASEL03  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00145   
               HILIGHT=UNDERLINE,                                      C00146   
               COLOR=GREEN                                              00147   
        DFHMDF POS=(08,04),LENGTH=00,ATTRB=(ASKIP)                      00148   
ASTA03  DFHMDF POS=(08,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00149   
               COLOR=BLUE                                               00150   
ARCV03  DFHMDF POS=(08,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00151   
               COLOR=BLUE                                               00152   
APO03   DFHMDF POS=(08,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00153   
               COLOR=BLUE                                               00154   
AFRBL03 DFHMDF POS=(08,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00155   
               COLOR=BLUE                                               00156   
ABOL03  DFHMDF POS=(08,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00157   
               COLOR=BLUE                                               00158   
AADCT03 DFHMDF POS=(08,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00159   
               COLOR=BLUE                                               00160   
AASCT03 DFHMDF POS=(08,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00161   
               COLOR=BLUE                                               00162   
AVEND03 DFHMDF POS=(08,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00163   
               COLOR=BLUE                                               00164   
AOSCA03 DFHMDF POS=(08,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00165   
               COLOR=BLUE                                               00166   
*                                                                       00167   
ASEL04  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00168   
               HILIGHT=UNDERLINE,                                      C00169   
               COLOR=GREEN                                              00170   
        DFHMDF POS=(09,04),LENGTH=00,ATTRB=(ASKIP)                      00171   
ASTA04  DFHMDF POS=(09,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00172   
               COLOR=BLUE                                               00173   
ARCV04  DFHMDF POS=(09,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00174   
               COLOR=BLUE                                               00175   
APO04   DFHMDF POS=(09,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00176   
               COLOR=BLUE                                               00177   
AFRBL04 DFHMDF POS=(09,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00178   
               COLOR=BLUE                                               00179   
ABOL04  DFHMDF POS=(09,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00180   
               COLOR=BLUE                                               00181   
AADCT04 DFHMDF POS=(09,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00182   
               COLOR=BLUE                                               00183   
AASCT04 DFHMDF POS=(09,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00184   
               COLOR=BLUE                                               00185   
AVEND04 DFHMDF POS=(09,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00186   
               COLOR=BLUE                                               00187   
AOSCA04 DFHMDF POS=(09,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00188   
               COLOR=BLUE                                               00189   
*                                                                       00190   
ASEL05  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00191   
               HILIGHT=UNDERLINE,                                      C00192   
               COLOR=GREEN                                              00193   
        DFHMDF POS=(10,04),LENGTH=00,ATTRB=(ASKIP)                      00194   
ASTA05  DFHMDF POS=(10,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00195   
               COLOR=BLUE                                               00196   
ARCV05  DFHMDF POS=(10,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00197   
               COLOR=BLUE                                               00198   
APO05   DFHMDF POS=(10,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00199   
               COLOR=BLUE                                               00200   
AFRBL05 DFHMDF POS=(10,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00201   
               COLOR=BLUE                                               00202   
ABOL05  DFHMDF POS=(10,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00203   
               COLOR=BLUE                                               00204   
AADCT05 DFHMDF POS=(10,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00205   
               COLOR=BLUE                                               00206   
AASCT05 DFHMDF POS=(10,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00207   
               COLOR=BLUE                                               00208   
AVEND05 DFHMDF POS=(10,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00209   
               COLOR=BLUE                                               00210   
AOSCA05 DFHMDF POS=(10,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00211   
               COLOR=BLUE                                               00212   
*                                                                       00213   
ASEL06  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00214   
               HILIGHT=UNDERLINE,                                      C00215   
               COLOR=GREEN                                              00216   
        DFHMDF POS=(11,04),LENGTH=00,ATTRB=(ASKIP)                      00217   
ASTA06  DFHMDF POS=(11,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00218   
               COLOR=BLUE                                               00219   
ARCV06  DFHMDF POS=(11,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00220   
               COLOR=BLUE                                               00221   
APO06   DFHMDF POS=(11,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00222   
               COLOR=BLUE                                               00223   
AFRBL06 DFHMDF POS=(11,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00224   
               COLOR=BLUE                                               00225   
ABOL06  DFHMDF POS=(11,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00226   
               COLOR=BLUE                                               00227   
AADCT06 DFHMDF POS=(11,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00228   
               COLOR=BLUE                                               00229   
AASCT06 DFHMDF POS=(11,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00230   
               COLOR=BLUE                                               00231   
AVEND06 DFHMDF POS=(11,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00232   
               COLOR=BLUE                                               00233   
AOSCA06 DFHMDF POS=(11,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00234   
               COLOR=BLUE                                               00235   
*                                                                       00236   
ASEL07  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00237   
               HILIGHT=UNDERLINE,                                      C00238   
               COLOR=GREEN                                              00239   
        DFHMDF POS=(12,04),LENGTH=00,ATTRB=(ASKIP)                      00240   
ASTA07  DFHMDF POS=(12,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00241   
               COLOR=BLUE                                               00242   
ARCV07  DFHMDF POS=(12,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00243   
               COLOR=BLUE                                               00244   
APO07   DFHMDF POS=(12,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00245   
               COLOR=BLUE                                               00246   
AFRBL07 DFHMDF POS=(12,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00247   
               COLOR=BLUE                                               00248   
ABOL07  DFHMDF POS=(12,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00249   
               COLOR=BLUE                                               00250   
AADCT07 DFHMDF POS=(12,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00251   
               COLOR=BLUE                                               00252   
AASCT07 DFHMDF POS=(12,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00253   
               COLOR=BLUE                                               00254   
AVEND07 DFHMDF POS=(12,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00255   
               COLOR=BLUE                                               00256   
AOSCA07 DFHMDF POS=(12,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00257   
               COLOR=BLUE                                               00258   
*                                                                       00259   
ASEL08  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00260   
               HILIGHT=UNDERLINE,                                      C00261   
               COLOR=GREEN                                              00262   
        DFHMDF POS=(13,04),LENGTH=00,ATTRB=(ASKIP)                      00263   
ASTA08  DFHMDF POS=(13,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00264   
               COLOR=BLUE                                               00265   
ARCV08  DFHMDF POS=(13,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=BLUE                                               00267   
APO08   DFHMDF POS=(13,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00268   
               COLOR=BLUE                                               00269   
AFRBL08 DFHMDF POS=(13,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00270   
               COLOR=BLUE                                               00271   
ABOL08  DFHMDF POS=(13,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00272   
               COLOR=BLUE                                               00273   
AADCT08 DFHMDF POS=(13,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00274   
               COLOR=BLUE                                               00275   
AASCT08 DFHMDF POS=(13,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00276   
               COLOR=BLUE                                               00277   
AVEND08 DFHMDF POS=(13,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00278   
               COLOR=BLUE                                               00279   
AOSCA08 DFHMDF POS=(13,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00280   
               COLOR=BLUE                                               00281   
*                                                                       00282   
ASEL09  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00283   
               HILIGHT=UNDERLINE,                                      C00284   
               COLOR=GREEN                                              00285   
        DFHMDF POS=(14,04),LENGTH=00,ATTRB=(ASKIP)                      00286   
ASTA09  DFHMDF POS=(14,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00287   
               COLOR=BLUE                                               00288   
ARCV09  DFHMDF POS=(14,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00289   
               COLOR=BLUE                                               00290   
APO09   DFHMDF POS=(14,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00291   
               COLOR=BLUE                                               00292   
AFRBL09 DFHMDF POS=(14,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00293   
               COLOR=BLUE                                               00294   
ABOL09  DFHMDF POS=(14,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00295   
               COLOR=BLUE                                               00296   
AADCT09 DFHMDF POS=(14,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00297   
               COLOR=BLUE                                               00298   
AASCT09 DFHMDF POS=(14,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00299   
               COLOR=BLUE                                               00300   
AVEND09 DFHMDF POS=(14,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00301   
               COLOR=BLUE                                               00302   
AOSCA09 DFHMDF POS=(14,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00303   
               COLOR=BLUE                                               00304   
*                                                                       00305   
ASEL10  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00306   
               HILIGHT=UNDERLINE,                                      C00307   
               COLOR=GREEN                                              00308   
        DFHMDF POS=(15,04),LENGTH=00,ATTRB=(ASKIP)                      00309   
ASTA10  DFHMDF POS=(15,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00310   
               COLOR=BLUE                                               00311   
ARCV10  DFHMDF POS=(15,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00312   
               COLOR=BLUE                                               00313   
APO10   DFHMDF POS=(15,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00314   
               COLOR=BLUE                                               00315   
AFRBL10 DFHMDF POS=(15,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00316   
               COLOR=BLUE                                               00317   
ABOL10  DFHMDF POS=(15,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00318   
               COLOR=BLUE                                               00319   
AADCT10 DFHMDF POS=(15,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00320   
               COLOR=BLUE                                               00321   
AASCT10 DFHMDF POS=(15,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00322   
               COLOR=BLUE                                               00323   
AVEND10 DFHMDF POS=(15,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00324   
               COLOR=BLUE                                               00325   
AOSCA10 DFHMDF POS=(15,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00326   
               COLOR=BLUE                                               00327   
*                                                                       00328   
ASEL11  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00329   
               HILIGHT=UNDERLINE,                                      C00330   
               COLOR=GREEN                                              00331   
        DFHMDF POS=(16,04),LENGTH=00,ATTRB=(ASKIP)                      00332   
ASTA11  DFHMDF POS=(16,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00333   
               COLOR=BLUE                                               00334   
ARCV11  DFHMDF POS=(16,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00335   
               COLOR=BLUE                                               00336   
APO11   DFHMDF POS=(16,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00337   
               COLOR=BLUE                                               00338   
AFRBL11 DFHMDF POS=(16,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00339   
               COLOR=BLUE                                               00340   
ABOL11  DFHMDF POS=(16,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00341   
               COLOR=BLUE                                               00342   
AADCT11 DFHMDF POS=(16,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00343   
               COLOR=BLUE                                               00344   
AASCT11 DFHMDF POS=(16,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00345   
               COLOR=BLUE                                               00346   
AVEND11 DFHMDF POS=(16,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00347   
               COLOR=BLUE                                               00348   
AOSCA11 DFHMDF POS=(16,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00349   
               COLOR=BLUE                                               00350   
*                                                                       00351   
ASEL12  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00352   
               HILIGHT=UNDERLINE,                                      C00353   
               COLOR=GREEN                                              00354   
        DFHMDF POS=(17,04),LENGTH=00,ATTRB=(ASKIP)                      00355   
ASTA12  DFHMDF POS=(17,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00356   
               COLOR=BLUE                                               00357   
ARCV12  DFHMDF POS=(17,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00358   
               COLOR=BLUE                                               00359   
APO12   DFHMDF POS=(17,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00360   
               COLOR=BLUE                                               00361   
AFRBL12 DFHMDF POS=(17,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00362   
               COLOR=BLUE                                               00363   
ABOL12  DFHMDF POS=(17,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00364   
               COLOR=BLUE                                               00365   
AADCT12 DFHMDF POS=(17,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00366   
               COLOR=BLUE                                               00367   
AASCT12 DFHMDF POS=(17,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00368   
               COLOR=BLUE                                               00369   
AVEND12 DFHMDF POS=(17,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00370   
               COLOR=BLUE                                               00371   
AOSCA12 DFHMDF POS=(17,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00372   
               COLOR=BLUE                                               00373   
*                                                                       00374   
ASEL13  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00375   
               HILIGHT=UNDERLINE,                                      C00376   
               COLOR=GREEN                                              00377   
        DFHMDF POS=(18,04),LENGTH=00,ATTRB=(ASKIP)                      00378   
ASTA13  DFHMDF POS=(18,05),LENGTH=02,ATTRB=(ASKIP,NORM),               C00379   
               COLOR=BLUE                                               00380   
ARCV13  DFHMDF POS=(18,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00381   
               COLOR=BLUE                                               00382   
APO13   DFHMDF POS=(18,12),LENGTH=08,ATTRB=(ASKIP,NORM),               C00383   
               COLOR=BLUE                                               00384   
AFRBL13 DFHMDF POS=(18,21),LENGTH=16,ATTRB=(ASKIP,NORM),               C00385   
               COLOR=BLUE                                               00386   
ABOL13  DFHMDF POS=(18,38),LENGTH=16,ATTRB=(ASKIP,NORM),               C00387   
               COLOR=BLUE                                               00388   
AADCT13 DFHMDF POS=(18,55),LENGTH=04,ATTRB=(ASKIP,NORM),               C00389   
               COLOR=BLUE                                               00390   
AASCT13 DFHMDF POS=(18,60),LENGTH=04,ATTRB=(ASKIP,NORM),               C00391   
               COLOR=BLUE                                               00392   
AVEND13 DFHMDF POS=(18,65),LENGTH=10,ATTRB=(ASKIP,NORM),               C00393   
               COLOR=BLUE                                               00394   
AOSCA13 DFHMDF POS=(18,76),LENGTH=04,ATTRB=(ASKIP,NORM),               C00395   
               COLOR=BLUE                                               00396   
*                                                                       00397   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00398   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00399   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00400   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00401   
**************                                                          00402   
        DFHMSD TYPE=FINAL                                               00403   
**************                                                          00404   
        END                                                             00405   
