*          DATA SET RCKM265    AT LEVEL 002 AS OF 08/29/95                      
*          DATA SET RCKM265    AT LEVEL 005 AS OF 10/17/94              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  RCKM265                                            *   00005   
*        MAP     RC265A                                             *   00006   
*        PROGRAM RCKCS265                                           *   00007   
*        TRANSID E265 - ADD TO RECEIVER                             *   00008   
*        SYSTEM  RC RECEIVING                                       *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
RCKM265 DFHMSD TYPE=DSECT,                                             X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               STORAGE=AUTO,                                           X00015   
               TIOAPFX=YES,                                            X00016   
               TERM=3270-2                                              00017   
RC265A  DFHMDI LINE=2,COLUMN=1,                                        X00018   
               SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT),                                 X00021   
               CTRL=(FREEKB)                                            00022   
*                                                                       00023   
        DFHMDF POS=(02,01),                                            X00024   
               LENGTH=06,                                              X00025   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00027   
               INITIAL='PO NO:'                                         00028   
APO     DFHMDF POS=(02,08),                                            X00029   
               LENGTH=08,                                              X00030   
               ATTRB=(ASKIP,NORM),                                     X00031   
               COLOR=BLUE,                                             X00032**2
               PICOUT='ZZZZZZZ9'                                        00033**2
*                                                                       00034   
        DFHMDF POS=(03,01),                                            X00035   
               LENGTH=12,                                              X00036   
               ATTRB=(ASKIP,NORM),                                     X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='VENDOR NAME:'                                   00039   
AVEND   DFHMDF POS=(03,14),                                            X00040   
               LENGTH=30,                                              X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               COLOR=BLUE                                               00043   
        DFHMDF POS=(03,45),                                            X00044   
               LENGTH=05,                                              X00045   
               ATTRB=(ASKIP,NORM),                                     X00046   
               COLOR=NEUTRAL,                                          X00047   
               INITIAL='ITEMS'                                          00048   
ASTRTIT DFHMDF POS=(03,51),                                            X00049   
               LENGTH=05,                                              X00050   
               ATTRB=(NUM,UNPROT,NORM),                                X00051   
               COLOR=GREEN,                                            X00052   
               HILIGHT=UNDERLINE,                                      X00053   
               PICOUT='ZZZZ9'                                           00054   
        DFHMDF POS=(03,57),                                            X00055   
               LENGTH=02,                                              X00056   
               ATTRB=(ASKIP,NORM),                                     X00057   
               COLOR=NEUTRAL,                                          X00058   
               INITIAL='TO'                                             00059   
AENDIT  DFHMDF POS=(03,60),                                            X00060   
               LENGTH=05,                                              X00061   
               ATTRB=(ASKIP,NORM),                                     X00062   
               COLOR=BLUE,                                             X00063   
               PICOUT='ZZZZ9'                                           00064   
        DFHMDF POS=(03,66),                                            X00065   
               LENGTH=02,                                              X00066   
               ATTRB=(ASKIP,NORM),                                     X00067   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='OF'                                             00069   
ATOTIT  DFHMDF POS=(03,69),                                            X00070   
               LENGTH=05,                                              X00071   
               ATTRB=(ASKIP,NORM),                                     X00072   
               COLOR=BLUE,                                             X00073   
               PICOUT='ZZZZ9'                                           00074   
*                                                                       00075   
        DFHMDF POS=(04,09),                                            X00076   
               LENGTH=03,                                              X00077   
               ATTRB=(PROT,NORM),                                      X00078   
               COLOR=NEUTRAL,                                          X00079   
               INITIAL='REC'                                            00080   
        DFHMDF POS=(04,13),                                            X00081   
               LENGTH=07,                                              X00082   
               ATTRB=(PROT,NORM),                                      X00083   
               COLOR=NEUTRAL,                                          X00084   
               INITIAL='ARRIVAL'                                        00085   
        DFHMDF POS=(04,22),                                            X00086   
               LENGTH=06,                                              X00087   
               ATTRB=(PROT,NORM),                                      X00088   
               COLOR=NEUTRAL,                                          X00089   
               INITIAL='CARTON'                                         00090   
*                                                                       00091   
        DFHMDF POS=(05,01),                                            X00092   
               LENGTH=03,                                              X00093   
               ATTRB=(PROT,NORM),                                      X00094   
               COLOR=NEUTRAL,                                          X00095   
               INITIAL='SEL'                                            00096   
        DFHMDF POS=(05,05),                                            X00097   
               LENGTH=03,                                              X00098   
               ATTRB=(PROT,NORM),                                      X00099   
               COLOR=NEUTRAL,                                          X00100   
               INITIAL='ACT'                                            00101   
        DFHMDF POS=(05,09),                                            X00102   
               LENGTH=03,                                              X00103   
               ATTRB=(PROT,NORM),                                      X00104   
               COLOR=NEUTRAL,                                          X00105   
               INITIAL='SEQ'                                            00106   
        DFHMDF POS=(05,15),                                            X00107   
               LENGTH=04,                                              X00108   
               ATTRB=(PROT,NORM),                                      X00109   
               COLOR=NEUTRAL,                                          X00110   
               INITIAL='DATE'                                           00111   
        DFHMDF POS=(05,24),                                            X00112   
               LENGTH=03,                                              X00113   
               ATTRB=(PROT,NORM),                                      X00114   
               COLOR=NEUTRAL,                                          X00115   
               INITIAL='CNT'                                            00116   
        DFHMDF POS=(05,29),                                            X00117   
               LENGTH=04,                                              X00118   
               ATTRB=(PROT,NORM),                                      X00119   
               COLOR=NEUTRAL,                                          X00120   
               INITIAL='SCAC'                                           00121   
        DFHMDF POS=(05,35),                                            X00122   
               LENGTH=07,                                              X00123   
               ATTRB=(PROT,NORM),                                      X00124   
               COLOR=NEUTRAL,                                          X00125   
               INITIAL='TRAILER'                                        00126   
        DFHMDF POS=(05,45),                                            X00127   
               LENGTH=12,                                              X00128   
               ATTRB=(PROT,NORM),                                      X00129   
               COLOR=NEUTRAL,                                          X00130   
               INITIAL='FREIGHT BILL'                                   00131   
        DFHMDF POS=(05,62),                                            X00132   
               LENGTH=14,                                              X00133   
               ATTRB=(PROT,NORM),                                      X00134   
               COLOR=NEUTRAL,                                          X00135   
               INITIAL='BILL OF LADING'                                 00136   
*                                                                       00137   
ASEL01  DFHMDF POS=(06,02),                                            X00138   
               LENGTH=01,                                              X00139   
               ATTRB=(UNPROT,NORM,IC),                                 X00140   
               HILIGHT=UNDERLINE,                                      X00141   
               COLOR=GREEN                                              00142   
        DFHMDF POS=(06,04),                                            X00143   
               LENGTH=00,                                              X00144   
               ATTRB=(ASKIP)                                            00145   
AACT01  DFHMDF POS=(06,05),                                            X00146   
               LENGTH=03,                                              X00147   
               ATTRB=(ASKIP,NORM),                                     X00148   
               COLOR=BLUE                                               00149   
ASEQ01  DFHMDF POS=(06,09),                                            X00150   
               LENGTH=03,                                              X00151   
               ATTRB=(ASKIP,NORM),                                     X00152   
               COLOR=BLUE                                               00153   
AADTE01 DFHMDF POS=(06,13),                                            X00154   
               LENGTH=08,                                              X00155   
               ATTRB=(ASKIP,NORM),                                     X00156   
               COLOR=BLUE                                               00157   
ACART01 DFHMDF POS=(06,22),                                            X00158   
               LENGTH=06,                                              X00159   
               ATTRB=(ASKIP,NORM),                                     X00160   
               COLOR=BLUE,                                             X00161   
               PICOUT='ZZZZZ9'                                          00162   
ASCAC01 DFHMDF POS=(06,29),                                            X00163   
               LENGTH=04,                                              X00164   
               ATTRB=(ASKIP,NORM),                                     X00165   
               COLOR=BLUE                                               00166   
ATRLR01 DFHMDF POS=(06,34),                                            X00167   
               LENGTH=10,                                              X00168   
               ATTRB=(ASKIP,NORM),                                     X00169   
               COLOR=BLUE                                               00170   
APRO01  DFHMDF POS=(06,45),                                            X00171   
               LENGTH=16,                                              X00172   
               ATTRB=(ASKIP,NORM),                                     X00173   
               COLOR=BLUE                                               00174   
ABOL01  DFHMDF POS=(06,62),                                            X00175   
               LENGTH=16,                                              X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               COLOR=BLUE                                               00178   
*                                                                       00179   
ASEL02  DFHMDF POS=(07,02),                                            X00180   
               LENGTH=01,                                              X00181   
               ATTRB=(UNPROT,NORM,IC),                                 X00182   
               HILIGHT=UNDERLINE,                                      X00183   
               COLOR=GREEN                                              00184   
        DFHMDF POS=(07,04),                                            X00185   
               LENGTH=00,                                              X00186   
               ATTRB=(ASKIP)                                            00187   
AACT02  DFHMDF POS=(07,05),                                            X00188   
               LENGTH=03,                                              X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               COLOR=BLUE                                               00191   
ASEQ02  DFHMDF POS=(07,09),                                            X00192   
               LENGTH=03,                                              X00193   
               ATTRB=(ASKIP,NORM),                                     X00194   
               COLOR=BLUE                                               00195   
AADTE02 DFHMDF POS=(07,13),                                            X00196   
               LENGTH=08,                                              X00197   
               ATTRB=(ASKIP,NORM),                                     X00198   
               COLOR=BLUE                                               00199   
ACART02 DFHMDF POS=(07,22),                                            X00200   
               LENGTH=06,                                              X00201   
               ATTRB=(ASKIP,NORM),                                     X00202   
               COLOR=BLUE,                                             X00203   
               PICOUT='ZZZZZ9'                                          00204   
ASCAC02 DFHMDF POS=(07,29),                                            X00205   
               LENGTH=04,                                              X00206   
               ATTRB=(ASKIP,NORM),                                     X00207   
               COLOR=BLUE                                               00208   
ATRLR02 DFHMDF POS=(07,34),                                            X00209   
               LENGTH=10,                                              X00210   
               ATTRB=(ASKIP,NORM),                                     X00211   
               COLOR=BLUE                                               00212   
APRO02  DFHMDF POS=(07,45),                                            X00213   
               LENGTH=16,                                              X00214   
               ATTRB=(ASKIP,NORM),                                     X00215   
               COLOR=BLUE                                               00216   
ABOL02  DFHMDF POS=(07,62),                                            X00217   
               LENGTH=16,                                              X00218   
               ATTRB=(ASKIP,NORM),                                     X00219   
               COLOR=BLUE                                               00220   
*                                                                       00221   
ASEL03  DFHMDF POS=(08,02),                                            X00222   
               LENGTH=01,                                              X00223   
               ATTRB=(UNPROT,NORM,IC),                                 X00224   
               HILIGHT=UNDERLINE,                                      X00225   
               COLOR=GREEN                                              00226   
        DFHMDF POS=(08,04),                                            X00227   
               LENGTH=00,                                              X00228   
               ATTRB=(ASKIP)                                            00229   
AACT03  DFHMDF POS=(08,05),                                            X00230   
               LENGTH=03,                                              X00231   
               ATTRB=(ASKIP,NORM),                                     X00232   
               COLOR=BLUE                                               00233   
ASEQ03  DFHMDF POS=(08,09),                                            X00234   
               LENGTH=03,                                              X00235   
               ATTRB=(ASKIP,NORM),                                     X00236   
               COLOR=BLUE                                               00237   
AADTE03 DFHMDF POS=(08,13),                                            X00238   
               LENGTH=08,                                              X00239   
               ATTRB=(ASKIP,NORM),                                     X00240   
               COLOR=BLUE                                               00241   
ACART03 DFHMDF POS=(08,22),                                            X00242   
               LENGTH=06,                                              X00243   
               ATTRB=(ASKIP,NORM),                                     X00244   
               COLOR=BLUE,                                             X00245   
               PICOUT='ZZZZZ9'                                          00246   
ASCAC03 DFHMDF POS=(08,29),                                            X00247   
               LENGTH=04,                                              X00248   
               ATTRB=(ASKIP,NORM),                                     X00249   
               COLOR=BLUE                                               00250   
ATRLR03 DFHMDF POS=(08,34),                                            X00251   
               LENGTH=10,                                              X00252   
               ATTRB=(ASKIP,NORM),                                     X00253   
               COLOR=BLUE                                               00254   
APRO03  DFHMDF POS=(08,45),                                            X00255   
               LENGTH=16,                                              X00256   
               ATTRB=(ASKIP,NORM),                                     X00257   
               COLOR=BLUE                                               00258   
ABOL03  DFHMDF POS=(08,62),                                            X00259   
               LENGTH=16,                                              X00260   
               ATTRB=(ASKIP,NORM),                                     X00261   
               COLOR=BLUE                                               00262   
*                                                                       00263   
ASEL04  DFHMDF POS=(09,02),                                            X00264   
               LENGTH=01,                                              X00265   
               ATTRB=(UNPROT,NORM,IC),                                 X00266   
               HILIGHT=UNDERLINE,                                      X00267   
               COLOR=GREEN                                              00268   
        DFHMDF POS=(09,04),                                            X00269   
               LENGTH=00,                                              X00270   
               ATTRB=(ASKIP)                                            00271   
AACT04  DFHMDF POS=(09,05),                                            X00272   
               LENGTH=03,                                              X00273   
               ATTRB=(ASKIP,NORM),                                     X00274   
               COLOR=BLUE                                               00275   
ASEQ04  DFHMDF POS=(09,09),                                            X00276   
               LENGTH=03,                                              X00277   
               ATTRB=(ASKIP,NORM),                                     X00278   
               COLOR=BLUE                                               00279   
AADTE04 DFHMDF POS=(09,13),                                            X00280   
               LENGTH=08,                                              X00281   
               ATTRB=(ASKIP,NORM),                                     X00282   
               COLOR=BLUE                                               00283   
ACART04 DFHMDF POS=(09,22),                                            X00284   
               LENGTH=06,                                              X00285   
               ATTRB=(ASKIP,NORM),                                     X00286   
               COLOR=BLUE,                                             X00287   
               PICOUT='ZZZZZ9'                                          00288   
ASCAC04 DFHMDF POS=(09,29),                                            X00289   
               LENGTH=04,                                              X00290   
               ATTRB=(ASKIP,NORM),                                     X00291   
               COLOR=BLUE                                               00292   
ATRLR04 DFHMDF POS=(09,34),                                            X00293   
               LENGTH=10,                                              X00294   
               ATTRB=(ASKIP,NORM),                                     X00295   
               COLOR=BLUE                                               00296   
APRO04  DFHMDF POS=(09,45),                                            X00297   
               LENGTH=16,                                              X00298   
               ATTRB=(ASKIP,NORM),                                     X00299   
               COLOR=BLUE                                               00300   
ABOL04  DFHMDF POS=(09,62),                                            X00301   
               LENGTH=16,                                              X00302   
               ATTRB=(ASKIP,NORM),                                     X00303   
               COLOR=BLUE                                               00304   
*                                                                       00305   
ASEL05  DFHMDF POS=(10,02),                                            X00306   
               LENGTH=01,                                              X00307   
               ATTRB=(UNPROT,NORM,IC),                                 X00308   
               HILIGHT=UNDERLINE,                                      X00309   
               COLOR=GREEN                                              00310   
        DFHMDF POS=(10,04),                                            X00311   
               LENGTH=00,                                              X00312   
               ATTRB=(ASKIP)                                            00313   
AACT05  DFHMDF POS=(10,05),                                            X00314   
               LENGTH=03,                                              X00315   
               ATTRB=(ASKIP,NORM),                                     X00316   
               COLOR=BLUE                                               00317   
ASEQ05  DFHMDF POS=(10,09),                                            X00318   
               LENGTH=03,                                              X00319   
               ATTRB=(ASKIP,NORM),                                     X00320   
               COLOR=BLUE                                               00321   
AADTE05 DFHMDF POS=(10,13),                                            X00322   
               LENGTH=08,                                              X00323   
               ATTRB=(ASKIP,NORM),                                     X00324   
               COLOR=BLUE                                               00325   
ACART05 DFHMDF POS=(10,22),                                            X00326   
               LENGTH=06,                                              X00327   
               ATTRB=(ASKIP,NORM),                                     X00328   
               COLOR=BLUE,                                             X00329   
               PICOUT='ZZZZZ9'                                          00330   
ASCAC05 DFHMDF POS=(10,29),                                            X00331   
               LENGTH=04,                                              X00332   
               ATTRB=(ASKIP,NORM),                                     X00333   
               COLOR=BLUE                                               00334   
ATRLR05 DFHMDF POS=(10,34),                                            X00335   
               LENGTH=10,                                              X00336   
               ATTRB=(ASKIP,NORM),                                     X00337   
               COLOR=BLUE                                               00338   
APRO05  DFHMDF POS=(10,45),                                            X00339   
               LENGTH=16,                                              X00340   
               ATTRB=(ASKIP,NORM),                                     X00341   
               COLOR=BLUE                                               00342   
ABOL05  DFHMDF POS=(10,62),                                            X00343   
               LENGTH=16,                                              X00344   
               ATTRB=(ASKIP,NORM),                                     X00345   
               COLOR=BLUE                                               00346   
*                                                                       00347   
ASEL06  DFHMDF POS=(11,02),                                            X00348   
               LENGTH=01,                                              X00349   
               ATTRB=(UNPROT,NORM,IC),                                 X00350   
               HILIGHT=UNDERLINE,                                      X00351   
               COLOR=GREEN                                              00352   
        DFHMDF POS=(11,04),                                            X00353   
               LENGTH=00,                                              X00354   
               ATTRB=(ASKIP)                                            00355   
AACT06  DFHMDF POS=(11,05),                                            X00356   
               LENGTH=03,                                              X00357   
               ATTRB=(ASKIP,NORM),                                     X00358   
               COLOR=BLUE                                               00359   
ASEQ06  DFHMDF POS=(11,09),                                            X00360   
               LENGTH=03,                                              X00361   
               ATTRB=(ASKIP,NORM),                                     X00362   
               COLOR=BLUE                                               00363   
AADTE06 DFHMDF POS=(11,13),                                            X00364   
               LENGTH=08,                                              X00365   
               ATTRB=(ASKIP,NORM),                                     X00366   
               COLOR=BLUE                                               00367   
ACART06 DFHMDF POS=(11,22),                                            X00368   
               LENGTH=06,                                              X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               COLOR=BLUE,                                             X00371   
               PICOUT='ZZZZZ9'                                          00372   
ASCAC06 DFHMDF POS=(11,29),                                            X00373   
               LENGTH=04,                                              X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               COLOR=BLUE                                               00376   
ATRLR06 DFHMDF POS=(11,34),                                            X00377   
               LENGTH=10,                                              X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               COLOR=BLUE                                               00380   
APRO06  DFHMDF POS=(11,45),                                            X00381   
               LENGTH=16,                                              X00382   
               ATTRB=(ASKIP,NORM),                                     X00383   
               COLOR=BLUE                                               00384   
ABOL06  DFHMDF POS=(11,62),                                            X00385   
               LENGTH=16,                                              X00386   
               ATTRB=(ASKIP,NORM),                                     X00387   
               COLOR=BLUE                                               00388   
*                                                                       00389   
ASEL07  DFHMDF POS=(12,02),                                            X00390   
               LENGTH=01,                                              X00391   
               ATTRB=(UNPROT,NORM,IC),                                 X00392   
               HILIGHT=UNDERLINE,                                      X00393   
               COLOR=GREEN                                              00394   
        DFHMDF POS=(12,04),                                            X00395   
               LENGTH=00,                                              X00396   
               ATTRB=(ASKIP)                                            00397   
AACT07  DFHMDF POS=(12,05),                                            X00398   
               LENGTH=03,                                              X00399   
               ATTRB=(ASKIP,NORM),                                     X00400   
               COLOR=BLUE                                               00401   
ASEQ07  DFHMDF POS=(12,09),                                            X00402   
               LENGTH=03,                                              X00403   
               ATTRB=(ASKIP,NORM),                                     X00404   
               COLOR=BLUE                                               00405   
AADTE07 DFHMDF POS=(12,13),                                            X00406   
               LENGTH=08,                                              X00407   
               ATTRB=(ASKIP,NORM),                                     X00408   
               COLOR=BLUE                                               00409   
ACART07 DFHMDF POS=(12,22),                                            X00410   
               LENGTH=06,                                              X00411   
               ATTRB=(ASKIP,NORM),                                     X00412   
               COLOR=BLUE,                                             X00413   
               PICOUT='ZZZZZ9'                                          00414   
ASCAC07 DFHMDF POS=(12,29),                                            X00415   
               LENGTH=04,                                              X00416   
               ATTRB=(ASKIP,NORM),                                     X00417   
               COLOR=BLUE                                               00418   
ATRLR07 DFHMDF POS=(12,34),                                            X00419   
               LENGTH=10,                                              X00420   
               ATTRB=(ASKIP,NORM),                                     X00421   
               COLOR=BLUE                                               00422   
APRO07  DFHMDF POS=(12,45),                                            X00423   
               LENGTH=16,                                              X00424   
               ATTRB=(ASKIP,NORM),                                     X00425   
               COLOR=BLUE                                               00426   
ABOL07  DFHMDF POS=(12,62),                                            X00427   
               LENGTH=16,                                              X00428   
               ATTRB=(ASKIP,NORM),                                     X00429   
               COLOR=BLUE                                               00430   
*                                                                       00431   
ASEL08  DFHMDF POS=(13,02),                                            X00432   
               LENGTH=01,                                              X00433   
               ATTRB=(UNPROT,NORM,IC),                                 X00434   
               HILIGHT=UNDERLINE,                                      X00435   
               COLOR=GREEN                                              00436   
        DFHMDF POS=(13,04),                                            X00437   
               LENGTH=00,                                              X00438   
               ATTRB=(ASKIP)                                            00439   
AACT08  DFHMDF POS=(13,05),                                            X00440   
               LENGTH=03,                                              X00441   
               ATTRB=(ASKIP,NORM),                                     X00442   
               COLOR=BLUE                                               00443   
ASEQ08  DFHMDF POS=(13,09),                                            X00444   
               LENGTH=03,                                              X00445   
               ATTRB=(ASKIP,NORM),                                     X00446   
               COLOR=BLUE                                               00447   
AADTE08 DFHMDF POS=(13,13),                                            X00448   
               LENGTH=08,                                              X00449   
               ATTRB=(ASKIP,NORM),                                     X00450   
               COLOR=BLUE                                               00451   
ACART08 DFHMDF POS=(13,22),                                            X00452   
               LENGTH=06,                                              X00453   
               ATTRB=(ASKIP,NORM),                                     X00454   
               COLOR=BLUE,                                             X00455   
               PICOUT='ZZZZZ9'                                          00456   
ASCAC08 DFHMDF POS=(13,29),                                            X00457   
               LENGTH=04,                                              X00458   
               ATTRB=(ASKIP,NORM),                                     X00459   
               COLOR=BLUE                                               00460   
ATRLR08 DFHMDF POS=(13,34),                                            X00461   
               LENGTH=10,                                              X00462   
               ATTRB=(ASKIP,NORM),                                     X00463   
               COLOR=BLUE                                               00464   
APRO08  DFHMDF POS=(13,45),                                            X00465   
               LENGTH=16,                                              X00466   
               ATTRB=(ASKIP,NORM),                                     X00467   
               COLOR=BLUE                                               00468   
ABOL08  DFHMDF POS=(13,62),                                            X00469   
               LENGTH=16,                                              X00470   
               ATTRB=(ASKIP,NORM),                                     X00471   
               COLOR=BLUE                                               00472   
*                                                                       00473   
ASEL09  DFHMDF POS=(14,02),                                            X00474   
               LENGTH=01,                                              X00475   
               ATTRB=(UNPROT,NORM,IC),                                 X00476   
               HILIGHT=UNDERLINE,                                      X00477   
               COLOR=GREEN                                              00478   
        DFHMDF POS=(14,04),                                            X00479   
               LENGTH=00,                                              X00480   
               ATTRB=(ASKIP)                                            00481   
AACT09  DFHMDF POS=(14,05),                                            X00482   
               LENGTH=03,                                              X00483   
               ATTRB=(ASKIP,NORM),                                     X00484   
               COLOR=BLUE                                               00485   
ASEQ09  DFHMDF POS=(14,09),                                            X00486   
               LENGTH=03,                                              X00487   
               ATTRB=(ASKIP,NORM),                                     X00488   
               COLOR=BLUE                                               00489   
AADTE09 DFHMDF POS=(14,13),                                            X00490   
               LENGTH=08,                                              X00491   
               ATTRB=(ASKIP,NORM),                                     X00492   
               COLOR=BLUE                                               00493   
ACART09 DFHMDF POS=(14,22),                                            X00494   
               LENGTH=06,                                              X00495   
               ATTRB=(ASKIP,NORM),                                     X00496   
               COLOR=BLUE,                                             X00497   
               PICOUT='ZZZZZ9'                                          00498   
ASCAC09 DFHMDF POS=(14,29),                                            X00499   
               LENGTH=04,                                              X00500   
               ATTRB=(ASKIP,NORM),                                     X00501   
               COLOR=BLUE                                               00502   
ATRLR09 DFHMDF POS=(14,34),                                            X00503   
               LENGTH=10,                                              X00504   
               ATTRB=(ASKIP,NORM),                                     X00505   
               COLOR=BLUE                                               00506   
APRO09  DFHMDF POS=(14,45),                                            X00507   
               LENGTH=16,                                              X00508   
               ATTRB=(ASKIP,NORM),                                     X00509   
               COLOR=BLUE                                               00510   
ABOL09  DFHMDF POS=(14,62),                                            X00511   
               LENGTH=16,                                              X00512   
               ATTRB=(ASKIP,NORM),                                     X00513   
               COLOR=BLUE                                               00514   
*                                                                       00515   
ASEL10  DFHMDF POS=(15,02),                                            X00516   
               LENGTH=01,                                              X00517   
               ATTRB=(UNPROT,NORM,IC),                                 X00518   
               HILIGHT=UNDERLINE,                                      X00519   
               COLOR=GREEN                                              00520   
        DFHMDF POS=(15,04),                                            X00521   
               LENGTH=00,                                              X00522   
               ATTRB=(ASKIP)                                            00523   
AACT10  DFHMDF POS=(15,05),                                            X00524   
               LENGTH=03,                                              X00525   
               ATTRB=(ASKIP,NORM),                                     X00526   
               COLOR=BLUE                                               00527   
ASEQ10  DFHMDF POS=(15,09),                                            X00528   
               LENGTH=03,                                              X00529   
               ATTRB=(ASKIP,NORM),                                     X00530   
               COLOR=BLUE                                               00531   
AADTE10 DFHMDF POS=(15,13),                                            X00532   
               LENGTH=08,                                              X00533   
               ATTRB=(ASKIP,NORM),                                     X00534   
               COLOR=BLUE                                               00535   
ACART10 DFHMDF POS=(15,22),                                            X00536   
               LENGTH=06,                                              X00537   
               ATTRB=(ASKIP,NORM),                                     X00538   
               COLOR=BLUE,                                             X00539   
               PICOUT='ZZZZZ9'                                          00540   
ASCAC10 DFHMDF POS=(15,29),                                            X00541   
               LENGTH=04,                                              X00542   
               ATTRB=(ASKIP,NORM),                                     X00543   
               COLOR=BLUE                                               00544   
ATRLR10 DFHMDF POS=(15,34),                                            X00545   
               LENGTH=10,                                              X00546   
               ATTRB=(ASKIP,NORM),                                     X00547   
               COLOR=BLUE                                               00548   
APRO10  DFHMDF POS=(15,45),                                            X00549   
               LENGTH=16,                                              X00550   
               ATTRB=(ASKIP,NORM),                                     X00551   
               COLOR=BLUE                                               00552   
ABOL10  DFHMDF POS=(15,62),                                            X00553   
               LENGTH=16,                                              X00554   
               ATTRB=(ASKIP,NORM),                                     X00555   
               COLOR=BLUE                                               00556   
*                                                                       00557   
ASEL11  DFHMDF POS=(16,02),                                            X00558   
               LENGTH=01,                                              X00559   
               ATTRB=(UNPROT,NORM,IC),                                 X00560   
               HILIGHT=UNDERLINE,                                      X00561   
               COLOR=GREEN                                              00562   
        DFHMDF POS=(16,04),                                            X00563   
               LENGTH=00,                                              X00564   
               ATTRB=(ASKIP)                                            00565   
AACT11  DFHMDF POS=(16,05),                                            X00566   
               LENGTH=03,                                              X00567   
               ATTRB=(ASKIP,NORM),                                     X00568   
               COLOR=BLUE                                               00569   
ASEQ11  DFHMDF POS=(16,09),                                            X00570   
               LENGTH=03,                                              X00571   
               ATTRB=(ASKIP,NORM),                                     X00572   
               COLOR=BLUE                                               00573   
AADTE11 DFHMDF POS=(16,13),                                            X00574   
               LENGTH=08,                                              X00575   
               ATTRB=(ASKIP,NORM),                                     X00576   
               COLOR=BLUE                                               00577   
ACART11 DFHMDF POS=(16,22),                                            X00578   
               LENGTH=06,                                              X00579   
               ATTRB=(ASKIP,NORM),                                     X00580   
               COLOR=BLUE,                                             X00581   
               PICOUT='ZZZZZ9'                                          00582   
ASCAC11 DFHMDF POS=(16,29),                                            X00583   
               LENGTH=04,                                              X00584   
               ATTRB=(ASKIP,NORM),                                     X00585   
               COLOR=BLUE                                               00586   
ATRLR11 DFHMDF POS=(16,34),                                            X00587   
               LENGTH=10,                                              X00588   
               ATTRB=(ASKIP,NORM),                                     X00589   
               COLOR=BLUE                                               00590   
APRO11  DFHMDF POS=(16,45),                                            X00591   
               LENGTH=16,                                              X00592   
               ATTRB=(ASKIP,NORM),                                     X00593   
               COLOR=BLUE                                               00594   
ABOL11  DFHMDF POS=(16,62),                                            X00595   
               LENGTH=16,                                              X00596   
               ATTRB=(ASKIP,NORM),                                     X00597   
               COLOR=BLUE                                               00598   
*                                                                       00599   
ASEL12  DFHMDF POS=(17,02),                                            X00600   
               LENGTH=01,                                              X00601   
               ATTRB=(UNPROT,NORM,IC),                                 X00602   
               HILIGHT=UNDERLINE,                                      X00603   
               COLOR=GREEN                                              00604   
        DFHMDF POS=(17,04),                                            X00605   
               LENGTH=00,                                              X00606   
               ATTRB=(ASKIP)                                            00607   
AACT12  DFHMDF POS=(17,05),                                            X00608   
               LENGTH=03,                                              X00609   
               ATTRB=(ASKIP,NORM),                                     X00610   
               COLOR=BLUE                                               00611   
ASEQ12  DFHMDF POS=(17,09),                                            X00612   
               LENGTH=03,                                              X00613   
               ATTRB=(ASKIP,NORM),                                     X00614   
               COLOR=BLUE                                               00615   
AADTE12 DFHMDF POS=(17,13),                                            X00616   
               LENGTH=08,                                              X00617   
               ATTRB=(ASKIP,NORM),                                     X00618   
               COLOR=BLUE                                               00619   
ACART12 DFHMDF POS=(17,22),                                            X00620   
               LENGTH=06,                                              X00621   
               ATTRB=(ASKIP,NORM),                                     X00622   
               COLOR=BLUE,                                             X00623   
               PICOUT='ZZZZZ9'                                          00624   
ASCAC12 DFHMDF POS=(17,29),                                            X00625   
               LENGTH=04,                                              X00626   
               ATTRB=(ASKIP,NORM),                                     X00627   
               COLOR=BLUE                                               00628   
ATRLR12 DFHMDF POS=(17,34),                                            X00629   
               LENGTH=10,                                              X00630   
               ATTRB=(ASKIP,NORM),                                     X00631   
               COLOR=BLUE                                               00632   
APRO12  DFHMDF POS=(17,45),                                            X00633   
               LENGTH=16,                                              X00634   
               ATTRB=(ASKIP,NORM),                                     X00635   
               COLOR=BLUE                                               00636   
ABOL12  DFHMDF POS=(17,62),                                            X00637   
               LENGTH=16,                                              X00638   
               ATTRB=(ASKIP,NORM),                                     X00639   
               COLOR=BLUE                                               00640   
*                                                                       00641   
ASEL13  DFHMDF POS=(18,02),                                            X00642   
               LENGTH=01,                                              X00643   
               ATTRB=(UNPROT,NORM,IC),                                 X00644   
               HILIGHT=UNDERLINE,                                      X00645   
               COLOR=GREEN                                              00646   
        DFHMDF POS=(18,04),                                            X00647   
               LENGTH=00,                                              X00648   
               ATTRB=(ASKIP)                                            00649   
AACT13  DFHMDF POS=(18,05),                                            X00650   
               LENGTH=03,                                              X00651   
               ATTRB=(ASKIP,NORM),                                     X00652   
               COLOR=BLUE                                               00653   
ASEQ13  DFHMDF POS=(18,09),                                            X00654   
               LENGTH=03,                                              X00655   
               ATTRB=(ASKIP,NORM),                                     X00656   
               COLOR=BLUE                                               00657   
AADTE13 DFHMDF POS=(18,13),                                            X00658   
               LENGTH=08,                                              X00659   
               ATTRB=(ASKIP,NORM),                                     X00660   
               COLOR=BLUE                                               00661   
ACART13 DFHMDF POS=(18,22),                                            X00662   
               LENGTH=06,                                              X00663   
               ATTRB=(ASKIP,NORM),                                     X00664   
               COLOR=BLUE,                                             X00665   
               PICOUT='ZZZZZ9'                                          00666   
ASCAC13 DFHMDF POS=(18,29),                                            X00667   
               LENGTH=04,                                              X00668   
               ATTRB=(ASKIP,NORM),                                     X00669   
               COLOR=BLUE                                               00670   
ATRLR13 DFHMDF POS=(18,34),                                            X00671   
               LENGTH=10,                                              X00672   
               ATTRB=(ASKIP,NORM),                                     X00673   
               COLOR=BLUE                                               00674   
APRO13  DFHMDF POS=(18,45),                                            X00675   
               LENGTH=16,                                              X00676   
               ATTRB=(ASKIP,NORM),                                     X00677   
               COLOR=BLUE                                               00678   
ABOL13  DFHMDF POS=(18,62),                                            X00679   
               LENGTH=16,                                              X00680   
               ATTRB=(ASKIP,NORM),                                     X00681   
               COLOR=BLUE                                               00682   
*                                                                       00683   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00684   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00685   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00686   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00687   
**************                                                          00688   
        DFHMSD TYPE=FINAL                                               00689   
**************                                                          00690   
        END                                                             00691   
