000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.             RCKRP095.                                00020000
000300 AUTHOR.                 GERMAN BANDA.                            00030002
000400 INSTALLATION.           KOHLS INC.                               00040001
000500 DATE-WRITTEN.           JANUARY, 2022.                           00050000
000600 DATE-COMPILED.                                                   00060000
000700                                                                  00070000
000800***************************************************************** 00080000
000900*                                                               * 00090000
001000*  ERROR REPORT - DISPLAYING ERRORS FOUND DURING THE EDIT OF    * 00100000
001100*  OUTBOUND SHIPMENT DATA BEING SENT FROM A THIRD PARTY SOURCE. * 00110000
001110*  WHEN TRAILER IS SHIPPED FROM THIRD PARTY THAT WILL CONTAIN   * 00111000
001120*  STORE CARTON DATA, THAT DATA WILL RUN THRU EDIT PROGRAM      * 00112000
001130*  RCKUT190 AND ANY INVALID DATA FOULD WILL BE WRITTEN TO FILE  * 00113000
001140*  LAYOUT RCRD120 AND THEN PICKED UP BY THIS PROGRAM TO CREATE  * 00114000
001150*  AN ERROR REPORT.                                             * 00115000
001200*                                                               * 00120000
001500***************************************************************** 00150000
001600 ENVIRONMENT DIVISION.                                            00160000
001700 CONFIGURATION SECTION.                                           00170000
001800                                                                  00180000
001900 SOURCE-COMPUTER.        IBM-3090.                                00190000
002000 OBJECT-COMPUTER.        IBM-3090.                                00200000
002100                                                                  00210000
002200***************************************************************** 00220000
002300 INPUT-OUTPUT SECTION.                                            00230000
002400                                                                  00240000
002500 FILE-CONTROL.                                                    00250000
002600                                                                  00260000
002700     SELECT INPUT-FILE                                            00270000
002800         ASSIGN TO INP01.                                         00280000
002900                                                                  00290000
003000     SELECT REPORT-FILE                                           00300000
003100         ASSIGN TO RPT01.                                         00310000
003200                                                                  00320000
003300***************************************************************** 00330000
003400 DATA DIVISION.                                                   00340000
003500***************************************************************** 00350000
003600 FILE SECTION.                                                    00360000
003700                                                                  00370000
003800 FD  INPUT-FILE                                                   00380000
003900     RECORDING MODE IS F                                          00390000
004000     LABEL RECORDS ARE STANDARD                                   00400000
004100     BLOCK CONTAINS 0 RECORDS.                                    00410000
004200 01  INPUT-RECORD                    PIC  X(330).                 00420000
004300                                                                  00430000
004400 FD  REPORT-FILE                                                  00440000
004500     RECORDING MODE IS F                                          00450000
004600     BLOCK CONTAINS 0  RECORDS.                                   00460000
004700 01  REPORT-RECORD                   PIC X(132).                  00470002
004800                                                                  00480000
004900***************************************************************** 00490000
005000 WORKING-STORAGE SECTION.                                         00500000
005100                                                                  00510000
005200 01  PROGRAM-SWITCHES.                                            00520000
005300     05  PS-END-OF-INPUT-FILE-SW     PIC X(01) VALUE 'N'.         00530000
005400         88  PS-END-OF-INPUT                   VALUE 'Y'.         00540000
005500         88  PS-NOT-END-OF-INPUT               VALUE 'N'.         00550000
005510     05  PS-HEADER-PRINTER-SW        PIC X(01) VALUE 'N'.         00551040
005520         88  PS-HEADER-PRINTED-YES             VALUE 'Y'.         00552040
005530         88  PS-HEADER-PRINTED-NO              VALUE 'N'.         00553040
005600                                                                  00560000
005700 01  PC-PROGRAM-CONSTANTS.                                        00570000
005710     05  PC-RCKRP095                 PIC X(08) VALUE              00571006
005720                                     'PCKRP095'.                  00572006
006000     05  PC-REPORT-NBR               PIC X(02) VALUE '-1'.        00600000
006100     05  PC-MAX-LINE-COUNT           PIC S9(3) VALUE +60          00610016
006200                                               COMP-3.            00620000
006300     05  PC-SLASH                    PIC X(01) VALUE '/'.         00630000
006400     05  PC-DASH                     PIC X(01) VALUE '-'.         00640000
006410     05  PC-ASTERISK                 PIC X(03) VALUE '***'.       00641005
006500                                                                  00650000
006510 01  PC-ERROR-FIELD-NAMES.                                        00651006
006530     05  PC-3RD-PARTY-DC             PIC X(19) VALUE              00653006
006540                                     '3RD PARTY DC NUMBER'.       00654006
006550     05  PC-SHP-TO-DC-NBR            PIC X(19) VALUE              00655006
006560                                     'SHIP TO DC NUMBER  '.       00656006
006570     05  PC-SHIP-DATE                PIC X(10) VALUE              00657006
006580                                     'SHIP DATE '.                00658006
006590     05  PC-CUST-ORD-NBR             PIC X(21) VALUE              00659006
006591                                     'CUSTOMER ORDER NUMBER'.     00659106
006592     05  PC-KOHLS-PO-NBR             PIC X(16) VALUE              00659206
006593                                     'KOHLS PO NUMBER '.          00659306
006594     05  PC-DEST-STR-NBR             PIC X(25) VALUE              00659406
006595                                     'DESTINATION STORE NUMBER'.  00659506
006596     05  PC-SKU-NUMBER               PIC X(11) VALUE              00659606
006597                                     'SKU NUMBER '.               00659706
006598     05  PC-SML-NUMBER               PIC X(11) VALUE              00659806
006599                                     'SML NUMBER '.               00659906
006600     05  PC-STORE-SHP-QTY            PIC X(20) VALUE              00660006
006601                                     'STORE SHIP QUANTITY '.      00660106
006610 01  SD-DATE-TIME.                                                00661006
006700     05  SD-SYSTEM-DATE.                                          00670000
006800         10  SD-SYSTEM-DATE-YY       PIC 9(02) VALUE ZERO.        00680000
006900         10  SD-SYSTEM-DATE-MM       PIC 9(02) VALUE ZERO.        00690000
007000         10  SD-SYSTEM-DATE-DD       PIC 9(02) VALUE ZERO.        00700000
007100     05  SD-SYSTEM-TIME.                                          00710000
007200         10  SD-SYSTEM-TIME-HH       PIC 9(02) VALUE ZERO.        00720000
007300         10  SD-SYSTEM-TIME-MM       PIC 9(02) VALUE ZERO.        00730000
007400         10  SD-SYSTEM-TIME-SS       PIC 9(02) VALUE ZERO.        00740000
007500         10  FILLER                  PIC 9(02) VALUE ZERO.        00750000
007600*                                                                 00760000
007700 01  PV-PROGRAM-VARIABLES.                                        00770000
007800     05  PV-PREV-RECORD-NBR       PIC  9(06).                     00780004
007810     05  PV-PREV-SCAC             PIC  X(06).                     00781021
007820     05  PV-PREV-TRAILER          PIC  X(30).                     00782021
007900     05  PV-PREV-PO                  PIC  9(09).                  00790000
008000     05  PV-SQLCODE                  PIC  9(09) VALUE ZERO.       00800000
008100     05  PV-SUB                      PIC S9(04) VALUE ZERO        00810000
008110                                                COMP SYNC.        00811000
008120                                                                  00812000
008130     05  PV-PAGE-COUNT               PIC S9(4) VALUE ZERO         00813000
008140                                               COMP-3.            00814000
008150     05  PV-READ-COUNT                PIC S9(7) COMP-3            00815000
008160                                                VALUE ZERO.       00816000
008170     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            00817000
008180                                                VALUE ZERO.       00818000
008190     05  PV-LINE-COUNT               PIC S9(3) VALUE ZERO         00819000
008200                                               COMP-3.            00820000
008300     05  PV-LINES-ON-PAGE            PIC  9(3) VALUE 57.          00830035
008400                                                                  00840000
008500     05  PV-RPT-DATE.                                             00850000
008600         10  PV-RPT-DATE-MM          PIC 9(02) VALUE ZERO.        00860000
008700         10  FILLER                  PIC X(01) VALUE '-'.         00870000
008800         10  PV-RPT-DATE-DD          PIC 9(02) VALUE ZERO.        00880000
008900         10  FILLER                  PIC X(01) VALUE '-'.         00890000
009000         10  PV-RPT-DATE-YY          PIC 9(02) VALUE ZERO.        00900000
009100                                                                  00910000
009200 01  PV-ABEND-FIELDS.                                             00920000
009300     05  PV-DB2-FUNCTION              PIC X(30) VALUE SPACES.     00930000
009400     05  PV-DB2-TABLE-NAME            PIC X(30) VALUE SPACES.     00940000
009500     05  PV-ABEND-CODE               PIC S9(4) VALUE +0           00950000
009600                                               COMP SYNC.         00960000
009700     05  PV-ABEND-PROGRAM            PIC X(08) VALUE 'RCKRP095'.  00970002
009800     05  PV-ABEND-PARAGRAPH          PIC X(50) VALUE SPACES.      00980000
009900     05  PV-ABEND-OPERATION          PIC X(50) VALUE SPACES.      00990000
010000     05  PV-ABEND-STRUCTURE-1        PIC X(08) VALUE SPACES.      01000000
010100                                                                  01010000
010200     05  PV-DISPLAY-READ-COUNT       PIC ZZZ,ZZZ,ZZ9.             01020000
010300     05  PV-DISPLAY-WRITE-COUNT      PIC ZZZ,ZZZ,ZZ9.             01030000
010400     05  PV-DISP-SQL                 PIC  -999.                   01040000
010500     05  PV-DISP-OPER                PIC  9999.                   01050000
010600                                                                  01060000
010700******************************************************************01070000
010800* RECORD LAYOUT FOR THE INPUT FILE.                               01080000
010900******************************************************************01090000
011000     COPY RCRD120.                                                01100003
011100                                                                  01110000
011200******************************************************************01120000
011300*  WORK FIELDS FOR PRINTING A 132 CHARACTER REPORT.               01130002
011400******************************************************************01140000
011500     COPY DPWS132O.                                               01150002
011600                                                                  01160000
011700 01  WS-BATCH-PROC-DATE.                                          01170000
011800     05  WS-BATCH-PROC-CC            PIC X(02) VALUE SPACES.      01180000
011900     05  WS-BATCH-PROC-YY            PIC X(02) VALUE SPACES.      01190000
012000     05  FILLER                      PIC X(01) VALUE SPACES.      01200000
012100     05  WS-BATCH-PROC-MM            PIC X(02) VALUE SPACES.      01210000
012200     05  FILLER                      PIC X(01) VALUE SPACES.      01220000
012300     05  WS-BATCH-PROC-DD            PIC X(02) VALUE SPACES.      01230000
012400*                                                                 01240000
012500 01  HEADING-LINES.                                               01250000
012600     05  HEADING-LINE1.                                           01260000
012700         10  FILLER                  PIC X(35) VALUE SPACES.      01270002
012800         10  FILLER                  PIC X(50) VALUE              01280002
012900         'THIRD PARTY PROCESSED MERCHANDISE SHIPPED TRAILER '.    01290002
013000         10  FILLER                  PIC X(14) VALUE              01300002
013100         '- INVALID DATA'.                                        01310002
013200         10  FILLER                  PIC X(33) VALUE SPACES.      01320002
013210                                                                  01321002
013300                                                                  01330000
013400     05  HEADING-LINE2.                                           01340000
013500         10  FILLER                  PIC X(53) VALUE SPACES.      01350002
013600         10  FILLER                  PIC X(16)  VALUE             01360000
013700         'PROCESS DATE OF '.                                      01370000
013800         10  HD2-PROCESS-DATE        PIC X(10)  VALUE SPACES.     01380000
013900         10  FILLER                  PIC X(53) VALUE SPACES.      01390002
014000                                                                  01400000
014100     05  HEADING-LINE3.                                           01410000
014200         10  FILLER                  PIC X(01) VALUE SPACES.      01420003
014201         10  FILLER                  PIC X(06) VALUE 'SCAC: '.    01420103
014202         10  HD3-SHIP-SCAC           PIC X(06) VALUE ZEROES.      01420203
014204         10  FILLER                  PIC X(02) VALUE SPACES.      01420403
014205         10  FILLER                  PIC X(09) VALUE 'TRAILER: '. 01420509
014206         10  HD3-SHIP-TRAILER-NBR    PIC X(30) VALUE SPACES.      01420603
014300         10  FILLER                  PIC X(02) VALUE SPACES.      01430003
014310         10  FILLER                  PIC X(05) VALUE 'BOL: '.     01431003
014320         10  HD3-SHIP-BOL            PIC X(30) VALUE SPACES.      01432003
014330         10  FILLER                  PIC X(02) VALUE SPACES.      01433003
014340         10  FILLER                  PIC X(05) VALUE 'PRO: '.     01434003
014350         10  HD3-SHIP-PRO            PIC X(30) VALUE SPACES.      01435003
014360         10  FILLER                  PIC X(04) VALUE SPACES.      01436003
014600                                                                  01460000
014700     05  HEADING-LINE4.                                           01470000
014800         10  FILLER                  PIC  X(01)  VALUE SPACES.    01480003
014900         10  FILLER                  PIC  X(04)  VALUE 'FILE'.    01490010
015000         10  FILLER                  PIC  X(05)  VALUE SPACES.    01500003
015100         10  FILLER                  PIC  X(05)  VALUE 'FIELD'.   01510003
015318         10  FILLER                  PIC  X(117) VALUE SPACES.    01531810
015319                                                                  01531900
015320     05  HEADING-LINE5.                                           01532003
015321         10  FILLER                  PIC  X(01)  VALUE SPACES.    01532103
015322         10  FILLER                  PIC  X(06)  VALUE 'RECORD'.  01532203
015323         10  FILLER                  PIC  X(03)  VALUE SPACES.    01532303
015324         10  FILLER                  PIC  X(02)  VALUE 'IN'.      01532403
015325         10  FILLER                  PIC  X(120) VALUE SPACES.    01532503
015326                                                                  01532603
015327     05  HEADING-LINE6.                                           01532703
015328         10  FILLER                PIC  X(01)  VALUE SPACES.      01532803
015329         10  FILLER                PIC  X(06)  VALUE 'NUMBER'.    01532903
015330         10  FILLER                PIC  X(03)  VALUE SPACES.      01533003
015340         10  FILLER                PIC  X(06)  VALUE 'ERROR?'.    01534003
015341         10  FILLER                PIC  X(03)  VALUE SPACES.      01534103
015342         10  FILLER                PIC  X(10)  VALUE 'FIELD NAME'.01534203
015343         10  FILLER                PIC  X(18)  VALUE SPACES.      01534303
015344         10  FILLER                PIC  X(26)  VALUE              01534403
015345                                   'DATA VALUE PASSED TO KOHLS'.  01534503
015346         10  FILLER                PIC  X(05)  VALUE SPACES.      01534619
015347         10  FILLER                PIC  X(17)  VALUE              01534703
015348                                   'ERROR DESCRIPTION'.           01534803
015349         10  FILLER                PIC  X(32)  VALUE SPACES.      01534919
015360                                                                  01536003
015365 01  DETAIL-LINES.                                                01536503
015366     05  DETAIL-LINE1.                                            01536603
015367         10  FILLER                  PIC  X(01)    VALUE SPACES.  01536705
015368         10  DL1-FILE-RECORD-NBR     PIC  Z(06)    VALUE SPACES.  01536805
015370         10  FILLER                  PIC  X(03)    VALUE SPACES.  01537004
015380         10  DL1-ERROR-IND           PIC  X(03)    VALUE ZEROES.  01538004
015390         10  FILLER                  PIC  X(06)    VALUE SPACES.  01539013
015400         10  DL1-ERR-FIELD-NAME      PIC  X(27)    VALUE SPACES.  01540004
015500         10  FILLER                  PIC  X(01)    VALUE SPACES.  01550004
015600         10  DL1-ERR-DATA-VALUE      PIC  X(30)    VALUE SPACES.  01560004
015601         10  FILLER                  PIC  X(01)    VALUE SPACES.  01560100
015602         10  DL1-ERR-DESC            PIC  X(30)    VALUE SPACES.  01560204
015603         10  FILLER                  PIC  X(24)    VALUE SPACES.  01560313
015630                                                                  01563000
015640 01  MISCELLANEOUS-LINES.                                         01564000
015650     05  BLANK-LINE.                                              01565000
015660         10  FILLER                  PIC X(132) VALUE SPACES.     01566007
015670                                                                  01567000
015680     05  END-OF-REPORT-LINE.                                      01568000
015690         10  FILLER                  PIC X(25) VALUE SPACES.      01569033
015700         10  FILLER                  PIC X(45) VALUE              01570000
015800             '*******   E N D   O F   R E P O R T   *******'.     01580000
015900         10  FILLER                  PIC X(62) VALUE SPACES.      01590033
016000                                                                  01600000
016100     05  NO-DATA-TO-REPORT-LINE.                                  01610000
016200         10  FILLER                  PIC X(40) VALUE SPACES.      01620000
016300         10  FILLER                  PIC  X(52)    VALUE          01630000
016400         '*******  N O   D A T A   T O   R E P O R T   *******'.  01640000
016500         10  FILLER                  PIC  X(40)    VALUE SPACES.  01650000
016700                                                                  01670000
016800                                                                  01680000
020300******************************************************************02030000
020400 PROCEDURE DIVISION.                                              02040000
020500     DISPLAY '**** START OF RCKRP095 ****'.                       02050002
020600                                                                  02060000
020700*OPEN FILES.                                                      02070000
020800     OPEN INPUT  INPUT-FILE                                       02080000
020900          OUTPUT REPORT-FILE.                                     02090000
021000                                                                  02100000
021100     PERFORM 1000-INITIALIZATION.                                 02110000
021200                                                                  02120000
021300     SET  PS-NOT-END-OF-INPUT   TO  TRUE.                         02130000
021400                                                                  02140000
021500     PERFORM 7000-READ-EXTRACT-FILE.                              02150000
021600                                                                  02160000
021700*    MOVE RC120-INVALID-FILE-RECORD-NBR TO                        02170021
021900*                               PV-PREV-RECORD-NBR.               02190021
021910     MOVE RC120-SHIP-SCAC       TO   PV-PREV-SCAC.                02191021
021920     MOVE RC120-SHIP-TRAILER-NBR TO   PV-PREV-TRAILER.            02192022
022000     IF PS-END-OF-INPUT                                           02200000
022100        ADD +1                  TO PV-PAGE-COUNT                  02210000
022200        MOVE PV-PAGE-COUNT      TO DP132O-PAGE-NUMBER             02220004
022300        WRITE REPORT-RECORD                                       02230000
022400          FROM DP132O-STANDRD-HEADER-132-COLS                     02240007
022500            AFTER ADVANCING PAGE                                  02250000
022600        WRITE REPORT-RECORD                                       02260000
022700          FROM HEADING-LINE1                                      02270000
022800            AFTER ADVANCING 1 LINES                               02280000
022900        WRITE REPORT-RECORD                                       02290000
023000          FROM HEADING-LINE2                                      02300000
023100            AFTER ADVANCING 1 LINE                                02310000
023200        WRITE REPORT-RECORD                                       02320000
023300          FROM NO-DATA-TO-REPORT-LINE                             02330000
023400            AFTER ADVANCING 2 LINES                               02340000
023500     ELSE                                                         02350000
023600         MOVE RC120-INVALID-FILE-RECORD-NBR TO PV-PREV-RECORD-NBR 02360004
023610         MOVE RC120-SHIP-SCAC       TO   PV-PREV-SCAC             02361021
023620         MOVE RC120-SHIP-TRAILER-NBR TO   PV-PREV-TRAILER         02362023
023700         MOVE RC120-SHIP-SCAC        TO HD3-SHIP-SCAC             02370007
023710         MOVE RC120-SHIP-TRAILER-NBR TO HD3-SHIP-TRAILER-NBR      02371007
023720         MOVE RC120-SHIP-BOL         TO HD3-SHIP-BOL              02372007
023730         MOVE RC120-SHIP-PRO         TO HD3-SHIP-PRO              02373007
023800         PERFORM 1500-PRINT-HEADINGS                              02380000
023810                                                                  02381007
023900         PERFORM 2000-PROCESS-INPUT                               02390000
024000           UNTIL PS-END-OF-INPUT                                  02400000
024100     END-IF.                                                      02410000
024200                                                                  02420000
024300*FINISH REPORT.                                                   02430000
024400                                                                  02440000
024410     PERFORM 6000-PRINT-BLANK-LINE.                               02441036
024420                                                                  02442036
024500     WRITE REPORT-RECORD                                          02450000
024600       FROM END-OF-REPORT-LINE                                    02460000
024700         AFTER ADVANCING 3 LINES.                                 02470000
024800                                                                  02480000
024900*CLOSE FILES.                                                     02490000
025000     CLOSE INPUT-FILE                                             02500000
025100           REPORT-FILE.                                           02510000
025200                                                                  02520000
025300     MOVE PV-READ-COUNT TO PV-DISPLAY-READ-COUNT.                 02530000
025400     DISPLAY 'TOTAL INPUT READ ' PV-DISPLAY-READ-COUNT.           02540000
025500                                                                  02550000
025600     MOVE PV-WRITE-COUNT TO PV-DISPLAY-WRITE-COUNT.               02560000
025700     DISPLAY 'TOTAL RECS WRITTEN ' PV-DISPLAY-WRITE-COUNT.        02570000
025800                                                                  02580000
025900     GOBACK.                                                      02590000
026000*                                                                 02600000
026100******************************************************************02610000
026200*  PERFORM THE INITIAL PROCESSING FOR THE PROGRAM.               *02620000
026300******************************************************************02630000
026400 1000-INITIALIZATION.                                             02640000
026500     ACCEPT SD-SYSTEM-DATE                                        02650000
026600       FROM DATE.                                                 02660000
026700                                                                  02670000
026800     ACCEPT SD-SYSTEM-TIME                                        02680000
026900       FROM TIME.                                                 02690000
027000                                                                  02700000
027100     MOVE SD-SYSTEM-DATE-MM  TO DP132O-RUN-MONTH.                 02710004
027200     MOVE SD-SYSTEM-DATE-DD  TO DP132O-RUN-DAY.                   02720004
027300     MOVE SD-SYSTEM-DATE-YY  TO DP132O-RUN-YEAR.                  02730004
027400     MOVE SD-SYSTEM-TIME-HH  TO DP132O-RUN-HOUR.                  02740004
027500     MOVE SD-SYSTEM-TIME-MM  TO DP132O-RUN-MINUTE.                02750004
027600                                                                  02760000
027700     MOVE SD-SYSTEM-DATE-MM  TO PV-RPT-DATE-MM.                   02770000
027800     MOVE SD-SYSTEM-DATE-DD  TO PV-RPT-DATE-DD.                   02780000
027900     MOVE SD-SYSTEM-DATE-YY  TO PV-RPT-DATE-YY.                   02790000
028000                                                                  02800000
028100     MOVE PC-RCKRP095             TO DP132O-PROGRAM-NAME.         02810004
028200     MOVE PC-REPORT-NBR           TO DP132O-REPORT-NUMBER.        02820004
028300     MOVE +0                      TO PV-PAGE-COUNT.               02830000
028400                                                                  02840000
028500                                                                  02850000
028600******************************************************************02860000
028700**  WRITES REPORT HEADER LINES FOR FIRST PAGE AND ANY SUBSEQUENT  02870000
028800**  PAGES (AS NEEDED).                                            02880000
028900******************************************************************02890000
029000 1500-PRINT-HEADINGS.                                             02900000
029100     ADD +1                  TO PV-PAGE-COUNT.                    02910000
029200     MOVE PV-PAGE-COUNT      TO DP132O-PAGE-NUMBER.               02920004
029300                                                                  02930000
029400     MOVE PV-RPT-DATE        TO  HD2-PROCESS-DATE.                02940000
029500                                                                  02950000
029600     WRITE REPORT-RECORD                                          02960000
029700       FROM DP132O-STANDRD-HEADER-132-COLS                        02970004
029800         AFTER ADVANCING PAGE.                                    02980000
029900                                                                  02990000
030000     WRITE REPORT-RECORD                                          03000000
030100       FROM HEADING-LINE1                                         03010000
030200         AFTER ADVANCING 1 LINES.                                 03020000
030300                                                                  03030000
030400     WRITE REPORT-RECORD                                          03040000
030500       FROM HEADING-LINE2                                         03050000
030600         AFTER ADVANCING 1 LINE.                                  03060000
030601                                                                  03060120
030610     PERFORM 6000-PRINT-BLANK-LINE.                               03061020
030700                                                                  03070000
030800     WRITE REPORT-RECORD                                          03080000
030900       FROM HEADING-LINE3                                         03090000
031000         AFTER ADVANCING 2 LINES.                                 03100000
031100                                                                  03110000
031200     PERFORM 6000-PRINT-BLANK-LINE.                               03120000
031300                                                                  03130000
031400     WRITE REPORT-RECORD                                          03140000
031500       FROM HEADING-LINE4                                         03150000
031600         AFTER ADVANCING 1 LINES.                                 03160000
031700                                                                  03170000
031800     WRITE REPORT-RECORD                                          03180000
031900       FROM HEADING-LINE5                                         03190000
032000         AFTER ADVANCING 1 LINES.                                 03200000
032100                                                                  03210000
032110     WRITE REPORT-RECORD                                          03211005
032120       FROM HEADING-LINE6                                         03212005
032130         AFTER ADVANCING 1 LINES.                                 03213005
032140                                                                  03214005
032150     PERFORM 6000-PRINT-BLANK-LINE                                03215032
032200     MOVE +08                TO PV-LINE-COUNT.                    03220034
032300                                                                  03230000
032400                                                                  03240000
032500******************************************************************03250000
032600**  READ INPUT-FILE, WHEN DC CHANGES, DO A PAGE BREAK             03260000
032700******************************************************************03270000
032800 2000-PROCESS-INPUT.                                              03280000
032900     IF  RC120-INVALID-FILE-RECORD-NBR = PV-PREV-RECORD-NBR       03290029
033100         CONTINUE                                                 03310029
033200     ELSE                                                         03320029
033300         PERFORM 6000-PRINT-BLANK-LINE                            03330029
033400         IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                    03340029
033500             PERFORM 1500-PRINT-HEADINGS                          03350029
033510             SET PS-HEADER-PRINTED-YES TO TRUE                    03351040
033520         ELSE                                                     03352041
033530             SET PS-HEADER-PRINTED-NO  TO TRUE                    03353041
033600         END-IF                                                   03360029
033700     END-IF.                                                      03370029
033800                                                                  03380000
033910     IF  (RC120-SHIP-SCAC       = PV-PREV-SCAC ) AND              03391021
033920         (RC120-SHIP-TRAILER-NBR = PV-PREV-TRAILER )              03392021
034000         CONTINUE                                                 03400000
034100     ELSE                                                         03410000
034200         MOVE RC120-INVALID-FILE-RECORD-NBR TO PV-PREV-RECORD-NBR 03420004
034210         MOVE RC120-SHIP-SCAC       TO   PV-PREV-SCAC             03421021
034220         MOVE RC120-SHIP-TRAILER-NBR TO   PV-PREV-TRAILER         03422021
034300         MOVE RC120-SHIP-SCAC        TO HD3-SHIP-SCAC             03430007
034310         MOVE RC120-SHIP-TRAILER-NBR TO HD3-SHIP-TRAILER-NBR      03431007
034320         MOVE RC120-SHIP-BOL         TO HD3-SHIP-BOL              03432007
034330         MOVE RC120-SHIP-PRO         TO HD3-SHIP-PRO              03433007
034331                                                                  03433125
034332         PERFORM 6000-PRINT-BLANK-LINE                            03433225
034333                                                                  03433338
034340*        IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                    03434039
034341         IF  PS-HEADER-PRINTED-YES                                03434140
034342             SET PS-HEADER-PRINTED-NO TO TRUE                     03434240
034343         ELSE                                                     03434340
034350             PERFORM 1500-PRINT-HEADINGS                          03435014
034360         END-IF                                                   03436040
034370*        END-IF                                                   03437040
034500     END-IF.                                                      03450000
034800                                                                  03480000
034900     PERFORM 5000-WRITE-RPT-DTL.                                  03490000
035000                                                                  03500000
035100     PERFORM 7000-READ-EXTRACT-FILE.                              03510000
035200                                                                  03520000
035300                                                                  03530000
035400****************************************************************  03540000
035500* MOVE THE DETAILS TO REPORT LINE.                             *  03550000
035600****************************************************************  03560000
035700 5000-WRITE-RPT-DTL.                                              03570000
035800                                                                  03580000
041030                                                                  04103006
041200     PERFORM 5100-WRITE-3PDCNBR.                                  04120007
041300     PERFORM 5200-WRITE-SHIP-TO-DC-NBR.                           04130007
041400     PERFORM 5300-WRITE-SHPDTE-VALID.                             04140007
041500     PERFORM 5400-WRITE-CUST-ORDER-NBR.                           04150007
041510     PERFORM 5500-WRITE-KOHLS-PO-NBR.                             04151007
041520     PERFORM 5600-WRITE-DEST-STORE-NBR.                           04152007
041530     PERFORM 5700-WRITE-SKU-NUMBER.                               04153007
041540     PERFORM 5800-WRITE-SML-NUMBER.                               04154007
041550     PERFORM 5900-WRITE-ORDER-QTY.                                04155008
041600                                                                  04160000
041700                                                                  04170000
041710 5100-WRITE-3PDCNBR.                                              04171006
041799     MOVE RC120-INVALID-FILE-RECORD-NBR TO DL1-FILE-RECORD-NBR.   04179907
041800     MOVE PC-3RD-PARTY-DC           TO DL1-ERR-FIELD-NAME.        04180007
041801     MOVE RC120-3RD-PRTY-DC-NBR     TO DL1-ERR-DATA-VALUE.        04180110
041802                                                                  04180211
041803     IF RC120-3PDCNBR-VALID                                       04180311
041804         MOVE  SPACES       TO DL1-ERROR-IND                      04180411
041805     ELSE                                                         04180511
041806        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04180611
041807     END-IF                                                       04180711
041808                                                                  04180811
041809     EVALUATE TRUE                                                04180907
041810       WHEN RC120-3PDCNBR-VALID                                   04181007
041811            MOVE SPACES TO DL1-ERR-DESC                           04181107
041812       WHEN RC120-3PDCNBR-NOT-NUMERIC                             04181207
041813            MOVE 'DC NUMBER NOT NUMERIC' TO DL1-ERR-DESC          04181307
041814       WHEN RC120-3PDCNBR-INVALID-NBR                             04181407
041815            MOVE 'DC NUMBER INVALID ' TO DL1-ERR-DESC             04181507
041816       WHEN RC120-3PDCNBR-NOT-A-DC                                04181607
041817            MOVE 'DC NUMBER NOT A DC' TO DL1-ERR-DESC             04181707
041818       WHEN RC120-3PDCNBR-MISSING                                 04181807
041819            MOVE 'MISSING DATA      ' TO DL1-ERR-DESC             04181907
041820       WHEN RC120-3PDCNBR-OTHER-ISSUE                             04182030
041821            MOVE 'OTHER ISSUE       ' TO DL1-ERR-DESC             04182130
041822     END-EVALUATE                                                 04182230
041823                                                                  04182330
041824     PERFORM 5010-WRITE-DETAIL.                                   04182430
041825                                                                  04182530
041826                                                                  04182630
041827 5200-WRITE-SHIP-TO-DC-NBR.                                       04182730
041828                                                                  04182830
041829     MOVE PC-SHP-TO-DC-NBR           TO DL1-ERR-FIELD-NAME.       04182930
041830     MOVE RC120-KOHLS-SHIP-TO-DC-NBR TO DL1-ERR-DATA-VALUE.       04183030
041831     IF RC120-KSDCNBR-VALID                                       04183130
041832         MOVE  SPACES       TO DL1-ERROR-IND                      04183230
041833     ELSE                                                         04183330
041834        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04183430
041835     END-IF                                                       04183530
041836                                                                  04183630
041837     EVALUATE TRUE                                                04183730
041838       WHEN RC120-KSDCNBR-VALID                                   04183830
041839            MOVE SPACES TO DL1-ERR-DESC                           04183930
041840       WHEN RC120-KSDCNBR-NOT-NUMERIC                             04184030
041841            MOVE 'DC NUMBER NOT NUMERIC' TO DL1-ERR-DESC          04184130
041842       WHEN RC120-KSDCNBR-INVALID-NBR                             04184230
041843            MOVE 'DC NUMBER INVALID ' TO DL1-ERR-DESC             04184330
041844       WHEN RC120-KSDCNBR-NOT-A-DC                                04184430
041845            MOVE 'DC NUMBER NOT A DC' TO DL1-ERR-DESC             04184530
041846       WHEN RC120-KSDCNBR-MISSING                                 04184630
041847            MOVE 'MISSING DATA      ' TO DL1-ERR-DESC             04184730
041848       WHEN RC120-KSDCNBR-OTHER-ISSUE                             04184830
041849            MOVE 'OTHER ISSUE       ' TO DL1-ERR-DESC             04184930
041850     END-EVALUATE                                                 04185030
041851                                                                  04185130
041852                                                                  04185230
041853     PERFORM 5010-WRITE-DETAIL.                                   04185330
041854                                                                  04185430
041855 5300-WRITE-SHPDTE-VALID.                                         04185530
041856                                                                  04185630
041857     MOVE PC-SHIP-DATE               TO DL1-ERR-FIELD-NAME.       04185730
041858     MOVE RC120-SHIP-DATE            TO DL1-ERR-DATA-VALUE.       04185830
041859     IF RC120-SHPDTE-VALID                                        04185930
041860         MOVE  SPACES       TO DL1-ERROR-IND                      04186030
041861     ELSE                                                         04186130
041862        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04186230
041863     END-IF                                                       04186330
041864                                                                  04186430
041865     EVALUATE TRUE                                                04186530
041866       WHEN RC120-SHPDTE-VALID                                    04186630
041867            MOVE SPACES TO DL1-ERR-DESC                           04186730
041868       WHEN RC120-SHPDTE-NOT-NUMERIC                              04186830
041869            MOVE 'SHIP DATE NOT NUMERIC'     TO DL1-ERR-DESC      04186930
041870       WHEN RC120-SHPDTE-FORMAT-ISSUE                             04187030
041871            MOVE 'SHIP DATE FORMAT INVALID ' TO DL1-ERR-DESC      04187130
041872       WHEN RC120-SHPDTE-INVALID-DATE                             04187230
041873            MOVE 'SHIP DATE INVALID '        TO DL1-ERR-DESC      04187330
041874       WHEN RC120-SHPDTE-MISSING                                  04187430
041875            MOVE 'MISSING DATA      '        TO DL1-ERR-DESC      04187530
041876       WHEN RC120-SHPDTE-OTHER-ISSUE                              04187630
041877            MOVE 'OTHER ISSUE       '        TO DL1-ERR-DESC      04187730
041878     END-EVALUATE                                                 04187830
041879                                                                  04187930
041880                                                                  04188030
041881     PERFORM 5010-WRITE-DETAIL.                                   04188130
041882                                                                  04188230
041883                                                                  04188330
041884 5400-WRITE-CUST-ORDER-NBR.                                       04188430
041885                                                                  04188530
041886     MOVE PC-CUST-ORD-NBR            TO DL1-ERR-FIELD-NAME.       04188630
041887     MOVE RC120-CUST-ORDER-NBR       TO DL1-ERR-DATA-VALUE.       04188730
041888     IF RC120-CUSTORD-VALID                                       04188830
041889         MOVE  SPACES       TO DL1-ERROR-IND                      04188930
041890     ELSE                                                         04189030
041891        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04189130
041892     END-IF                                                       04189230
041893                                                                  04189330
041894     EVALUATE TRUE                                                04189430
041895       WHEN RC120-CUSTORD-VALID                                   04189530
041896            MOVE SPACES TO DL1-ERR-DESC                           04189630
041897       WHEN RC120-CUSTORD-FORMAT-ISSUE                            04189730
041898            MOVE 'ORDER FORMAT ISSUE   '     TO DL1-ERR-DESC      04189830
041899       WHEN RC120-CUSTORD-INVALID-PO                              04189930
041900            MOVE 'ORDER INVALID PO     ' TO DL1-ERR-DESC          04190030
041901       WHEN RC120-CUSTORD-INVALID-STORE                           04190130
041902            MOVE 'ORDER INVALID STORE '      TO DL1-ERR-DESC      04190230
041903       WHEN RC120-CUSTORD-INVALID-POSTR                           04190330
041904            MOVE 'ORDER INVALID PO/STORE '   TO DL1-ERR-DESC      04190430
041905       WHEN RC120-CUSTORD-MISSING                                 04190530
041906            MOVE 'MISSING DATA      '        TO DL1-ERR-DESC      04190630
041907       WHEN RC120-CUSTORD-OTHER-ISSUE                             04190730
041908            MOVE 'OTHER ISSUE       '        TO DL1-ERR-DESC      04190830
041909     END-EVALUATE                                                 04190930
041910                                                                  04191030
041911                                                                  04191130
041912     PERFORM 5010-WRITE-DETAIL.                                   04191230
041913                                                                  04191330
041914 5500-WRITE-KOHLS-PO-NBR.                                         04191430
041915                                                                  04191530
041916     MOVE PC-KOHLS-PO-NBR            TO DL1-ERR-FIELD-NAME.       04191630
041917     MOVE RC120-KOHLS-PO-NBR         TO DL1-ERR-DATA-VALUE.       04191730
041918                                                                  04191830
041919     IF RC120-KPONBR-VALID                                        04191930
041920         MOVE  SPACES       TO DL1-ERROR-IND                      04192030
041921     ELSE                                                         04192130
041922        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04192230
041923     END-IF                                                       04192330
041924                                                                  04192430
041925     EVALUATE TRUE                                                04192530
041926       WHEN RC120-KPONBR-VALID                                    04192630
041927            MOVE SPACES TO DL1-ERR-DESC                           04192730
041928       WHEN RC120-KPONBR-NOT-NUMERIC                              04192830
041929            MOVE 'KOHLS PO IS NOT NUMERIC'     TO DL1-ERR-DESC    04192930
041930       WHEN RC120-KPONBR-INVALID-PO                               04193030
041931            MOVE 'KOHLS PO IS  INVALID '       TO DL1-ERR-DESC    04193130
041932       WHEN RC120-KPONBR-GT-8-DIGIT                               04193230
041933            MOVE 'KOHLS PO GREATER 8 DIGITS'   TO DL1-ERR-DESC    04193330
041934       WHEN RC120-KPONBR-MISSING                                  04193430
041935            MOVE 'MISSING DATA  '              TO DL1-ERR-DESC    04193530
041936       WHEN RC120-KPONBR-OTHER-ISSUE                              04193630
041937            MOVE 'OTHER ISSUE   '              TO DL1-ERR-DESC    04193730
041938     END-EVALUATE                                                 04193830
041939                                                                  04193930
041940                                                                  04194030
041941     PERFORM 5010-WRITE-DETAIL.                                   04194130
041942                                                                  04194230
041943                                                                  04194330
041944                                                                  04194430
041945 5600-WRITE-DEST-STORE-NBR.                                       04194530
041946                                                                  04194630
041947     MOVE PC-DEST-STR-NBR            TO DL1-ERR-FIELD-NAME.       04194730
041948     MOVE RC120-DEST-STORE-NBR       TO DL1-ERR-DATA-VALUE.       04194830
041949     IF RC120-DSTSTR-VALID                                        04194930
041950         MOVE  SPACES       TO DL1-ERROR-IND                      04195030
041951     ELSE                                                         04195130
041952        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04195230
041953     END-IF                                                       04195330
041954                                                                  04195430
041955     EVALUATE TRUE                                                04195530
041956       WHEN RC120-DSTSTR-VALID                                    04195630
041957            MOVE SPACES TO DL1-ERR-DESC                           04195730
041958       WHEN RC120-DSTSTR-NOT-NUMERIC                              04195830
041959            MOVE 'STORE NUMBER NOT NUMERIC '     TO DL1-ERR-DESC  04195930
041960       WHEN RC120-DSTSTR-INVALID-STR                              04196030
041961            MOVE 'STORE NUMBER NOT FOUND   '    TO DL1-ERR-DESC   04196130
041962       WHEN RC120-DSTSTR-NOT-A-DS-STR                             04196230
041963            MOVE 'INVALID LOCATION  TYPE   '   TO DL1-ERR-DESC    04196330
041964       WHEN RC120-DSTSTR-MISSING                                  04196430
041965            MOVE 'MISSING DATA  '              TO DL1-ERR-DESC    04196530
041966     END-EVALUATE                                                 04196630
041967                                                                  04196730
041968                                                                  04196830
041969     PERFORM 5010-WRITE-DETAIL.                                   04196930
041970                                                                  04197030
041971 5700-WRITE-SKU-NUMBER.                                           04197130
041972                                                                  04197230
041973     MOVE PC-SKU-NUMBER              TO DL1-ERR-FIELD-NAME.       04197330
041974     MOVE RC120-SKU-NBR              TO DL1-ERR-DATA-VALUE.       04197430
041975     IF RC120-SKUNBR-VALID                                        04197530
041976         MOVE  SPACES       TO DL1-ERROR-IND                      04197630
041977     ELSE                                                         04197730
041978        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04197830
041979     END-IF                                                       04197930
041980                                                                  04198030
041981     EVALUATE TRUE                                                04198130
041982       WHEN RC120-SKUNBR-VALID                                    04198230
041983            MOVE SPACES TO DL1-ERR-DESC                           04198330
041984       WHEN RC120-SKUNBR-NOT-NUMERIC                              04198430
041985            MOVE 'SKU NUMBER NOT NUMERIC '     TO DL1-ERR-DESC    04198530
041986       WHEN RC120-SKUNBR-GT-8-DIGIT                               04198630
041987            MOVE 'SKU NUMBER LENGTH ISSUE'    TO DL1-ERR-DESC     04198730
041988       WHEN RC120-SKUNBR-NOT-ON-MSTR                              04198830
041989            MOVE 'SKU NOT FOUND ON SKU MASTER' TO DL1-ERR-DESC    04198930
041990       WHEN RC120-SKUNBR-NOT-ON-PO                                04199030
041991            MOVE 'SKU NOT ON PO '              TO DL1-ERR-DESC    04199130
041992       WHEN RC120-SKUNBR-MISSING                                  04199230
041993            MOVE 'MISSING DATA  '              TO DL1-ERR-DESC    04199330
041994       WHEN RC120-SKUNBR-OTHER-ISSUE                              04199430
041995            MOVE 'OTHER ISSUE   '              TO DL1-ERR-DESC    04199530
041996     END-EVALUATE                                                 04199630
041997                                                                  04199730
041998                                                                  04199830
041999     PERFORM 5010-WRITE-DETAIL.                                   04199930
042000                                                                  04200030
042001                                                                  04200130
042002 5800-WRITE-SML-NUMBER.                                           04200230
042003                                                                  04200330
042004     MOVE PC-SML-NUMBER              TO DL1-ERR-FIELD-NAME.       04200430
042005     MOVE RC120-SML-NBR              TO DL1-ERR-DATA-VALUE.       04200530
042006     IF RC120-SMLNBR-VALID                                        04200630
042007         MOVE  SPACES       TO DL1-ERROR-IND                      04200730
042008     ELSE                                                         04200830
042009        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04200930
042010     END-IF                                                       04201030
042011                                                                  04201130
042012     EVALUATE TRUE                                                04201230
042013       WHEN RC120-SMLNBR-VALID                                    04201330
042014            MOVE SPACES TO DL1-ERR-DESC                           04201430
042015       WHEN RC120-SMLNBR-NOT-NUMERIC                              04201530
042016            MOVE 'SML NUMBER NOT NUMERIC '     TO DL1-ERR-DESC    04201630
042017       WHEN RC120-SMLNBR-FORMAT-ISSUE                             04201730
042018            MOVE 'SML FORMAT ISSUE       '     TO DL1-ERR-DESC    04201830
042019       WHEN RC120-SMLNBR-GT-20-DIGIT                              04201930
042020            MOVE 'SML LENGTH ISSUE  '          TO DL1-ERR-DESC    04202030
042021       WHEN RC120-SMLNBR-MISMATCH-STR                             04202130
042022            MOVE 'SML STORE NOT EQUAL DEST STORE'                 04202230
042023                                              TO DL1-ERR-DESC     04202330
042024       WHEN RC120-SMLNBR-INVALID-DC                               04202430
042025            MOVE 'SML STR TO DC DISTRIBUTION '                    04202530
042026                                              TO DL1-ERR-DESC     04202630
042027       WHEN RC120-SMLNBR-ALREADY-EXISTS                           04202730
042028            MOVE 'SML NBR ALREADY EXISTS '    TO DL1-ERR-DESC     04202830
042029       WHEN RC120-SMLNBR-STR-SHIPPED                              04202930
042030            MOVE 'SML NBR STORE SHIPPED '     TO DL1-ERR-DESC     04203030
042031       WHEN RC120-SMLNBR-STR-SCANNED                              04203130
042032            MOVE 'SML NBR STORE SCANNED '     TO DL1-ERR-DESC     04203230
042033       WHEN RC120-SMLNBR-MISSING                                  04203330
042034            MOVE 'MISSING DATA  '             TO DL1-ERR-DESC     04203430
042035       WHEN RC120-SMLNBR-OTHER-ISSUE                              04203530
042036            MOVE 'OTHER ISSUE   '             TO DL1-ERR-DESC     04203630
042037     END-EVALUATE                                                 04203730
042038                                                                  04203830
042039                                                                  04203930
042040     PERFORM 5010-WRITE-DETAIL.                                   04204030
042041                                                                  04204130
042042 5900-WRITE-ORDER-QTY.                                            04204230
042043                                                                  04204330
042044     MOVE PC-STORE-SHP-QTY           TO DL1-ERR-FIELD-NAME.       04204430
042045     MOVE RC120-SHIP-QTY             TO DL1-ERR-DATA-VALUE.       04204536
042046     IF RC120-ORDQTY-VALID                                        04204630
042047         MOVE  SPACES       TO DL1-ERROR-IND                      04204730
042048     ELSE                                                         04204830
042049        MOVE PC-ASTERISK    TO DL1-ERROR-IND                      04204930
042050     END-IF                                                       04205030
042051                                                                  04205130
042052     EVALUATE TRUE                                                04205230
042053       WHEN RC120-SHPQTY-VALID                                    04205336
042054            MOVE SPACES TO DL1-ERR-DESC                           04205430
042055       WHEN RC120-SHPQTY-NOT-NUMERIC                              04205536
042056            MOVE 'SHIP QTY NOT NUMERIC '         TO DL1-ERR-DESC  04205636
042057       WHEN RC120-SHPQTY-RECV-GT-ORD                              04205736
042058            MOVE 'SHIP QTY GREATER THEN ORDER '  TO DL1-ERR-DESC  04205836
042059       WHEN RC120-SHPQTY-MISSING                                  04205936
042060            MOVE 'MISSING DATA  '             TO DL1-ERR-DESC     04206036
042061       WHEN RC120-SHPQTY-MISSING                                  04206136
042062            MOVE 'MISSING DATA  '             TO DL1-ERR-DESC     04206236
042063     END-EVALUATE                                                 04206336
042064                                                                  04206436
042065                                                                  04206536
042066     PERFORM 5010-WRITE-DETAIL.                                   04206636
042067                                                                  04206736
042068                                                                  04206836
042069 5010-WRITE-DETAIL.                                               04206936
042070                                                                  04207036
042080*    PERFORM 6000-PRINT-BLANK-LINE.                               04208036
042100                                                                  04210000
042200     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        04220000
042300         PERFORM 1500-PRINT-HEADINGS                              04230000
042400     END-IF.                                                      04240000
042500                                                                  04250000
043200     WRITE REPORT-RECORD                                          04320000
043300      FROM DETAIL-LINE1                                           04330000
043400     AFTER ADVANCING 1 LINES.                                     04340000
043500                                                                  04350000
043600     ADD  1                  TO PV-LINE-COUNT.                    04360000
043700     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        04370000
043800         PERFORM 1500-PRINT-HEADINGS                              04380000
043900     END-IF.                                                      04390000
044000     MOVE SPACES  TO DETAIL-LINES.                                04400028
046800****************************************************************  04680000
046900* PRINTS A BLANK LINE                                          *  04690000
047000****************************************************************  04700000
047100 6000-PRINT-BLANK-LINE.                                           04710000
047200                                                                  04720000
047300        WRITE REPORT-RECORD                                       04730000
047400          FROM BLANK-LINE                                         04740000
047500            AFTER ADVANCING 1 LINE                                04750000
047600                                                                  04760000
047700     ADD +1 TO PV-LINE-COUNT.                                     04770000
047800                                                                  04780000
047900******************************************************************04790000
048000*  READ A FROM THE INPUT FILE                                    *04800000
048100******************************************************************04810000
048200 7000-READ-EXTRACT-FILE.                                          04820000
048300     READ INPUT-FILE                                              04830000
048400          INTO RC120-INVALID-SHIPMENT-REC                         04840010
048500         AT END                                                   04850000
048600             SET PS-END-OF-INPUT TO TRUE                          04860000
048700         NOT AT END                                               04870000
048800             ADD +1 TO PV-READ-COUNT                              04880000
048900     END-READ.                                                    04890000
049000                                                                  04900000
049300******************************************************************04930000
060600******************************************************************06060000
060700*                 E N D   O F   P R O G R A M                    *06070000
060800******************************************************************06080000
