000400***************************************************************** 00010001
000500 IDENTIFICATION DIVISION.                                         00020001
000600***************************************************************** 00030001
000700 PROGRAM-ID.             RCKRP036.                                00040001
000800 AUTHOR.                 PATRICK BURKE.                           00050001
000900 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00060001
001000 DATE-WRITTEN.           JANUARY 2002.                            00070001
001100 DATE-COMPILED.                                                   00080001
001200*                                                                 00090001
001300***************************************************************** 00100001
001400* THIS PROGRAM TAKES THE EXTRACT FILE CREATED IN RCKUT118 AND     00110001
001610* CREATES A VERIFICATION SUMMARY REPORT BY VENDOR.                00120001
001620* THIS PROGRAM PULLS IN A CONTROL CARD TO DETERMINE WHICH OF THE  00130001
001630* 3 VERSIONS OF THE REPORT IS BEING EXECUTED. EACH OF THE 3       00140001
001640* VERSIONS WILL RUN ON A MONTHLY BASIS.                           00150001
001700***************************************************************** 00160001
001800 ENVIRONMENT DIVISION.                                            00170001
001900***************************************************************** 00180001
002000 CONFIGURATION SECTION.                                           00190001
002100 SOURCE-COMPUTER.                        IBM-3090.                00200001
002200 OBJECT-COMPUTER.                        IBM-3090.                00210001
002300 INPUT-OUTPUT SECTION.                                            00220001
002400 FILE-CONTROL.                                                    00230001
002500                                                                  00240001
002600     SELECT EXTRACT-FILE-1                                        00250001
002700         ASSIGN TO INP01.                                         00260001
002800                                                                  00270001
003200     SELECT REPORT-FILE                                           00280001
003300         ASSIGN TO RPT01.                                         00290001
003400                                                                  00300001
003500***************************************************************** 00310001
003600 DATA DIVISION.                                                   00320001
003700***************************************************************** 00330001
003800 FILE SECTION.                                                    00340001
003900                                                                  00350001
004000 FD  EXTRACT-FILE-1                                               00360001
004100     RECORDING MODE IS F                                          00370001
004200     LABEL RECORDS ARE STANDARD                                   00380001
004300     BLOCK CONTAINS 0 RECORDS.                                    00390001
004400 01  EXTRACT-RECORD-1                 PIC X(650).                 00400012
004500                                                                  00410001
005200 FD  REPORT-FILE                                                  00420001
005300     RECORDING MODE IS F                                          00430001
005400     BLOCK CONTAINS 0 RECORDS.                                    00440001
005500 01  REPORT-RECORD                    PIC X(132).                 00450001
005600/                                                                 00460001
005700***************************************************************** 00470001
005800 WORKING-STORAGE SECTION.                                         00480001
005900***************************************************************** 00490001
006000*                                                                 00500001
006100**************************************************************    00510001
006200*  CONTROL CARD LAYOUT.                                           00520001
006300**************************************************************    00530001
006400*    COPY RCCC033.                                                00540001
006500/                                                                 00550001
006600**************************************************************    00560001
006700 01  CC-CONTROL-CARD.                                             00570001
006800     05  CC-CONSTANT              PIC  X(07)      VALUE SPACE.    00580001
006900     05  FILLER                   PIC  X(01)      VALUE SPACE.    00590001
007000     05  CC-SEQUENCE-IND          PIC  X(01).                     00600001
007100         88  CC-SEQUENCE-OVERAGE                  VALUE 'O'.      00610001
007200         88  CC-SEQUENCE-SHORTAGE                 VALUE 'S'.      00620001
007210         88  CC-SEQUENCE-GROSS                    VALUE 'G'.      00630001
007500     05  FILLER                   PIC  X(71)      VALUE SPACE.    00640001
007600                                                                  00650001
007700**************************************************************    00660001
007800 01  PS-SWITCHES.                                                 00670001
007900     05  PS-PRINT-DETAILS-SW          PIC X(01) VALUE 'N'.        00680001
008000         88  PS-PRINT-DETAILS                   VALUE 'Y'.        00690001
008100         88  PS-NOT-PRINT-DETAILS               VALUE 'N'.        00700001
008200     05  PS-END-OF-INPUT-FILE-SW      PIC X(01) VALUE 'N'.        00710001
008300         88  PS-END-OF-INPUT                    VALUE 'Y'.        00720001
008400         88  PS-NOT-END-OF-INPUT                VALUE 'N'.        00730001
008500     05  PS-PAGE-SW                   PIC X(01) VALUE 'N'.        00740001
008600         88  PS-NEW-PAGE                        VALUE 'Y'.        00750001
008700         88  PS-SAME-PAGE                       VALUE 'N'.        00760001
008800     05  PS-OPER-ALL-SW               PIC X(01) VALUE 'N'.        00770001
008900         88  PS-OPER-ALL                        VALUE 'Y'.        00780001
009000     05  PS-PRINT-LINE-SW             PIC X(01) VALUE 'N'.        00790001
009100         88  PS-PRINT-LINE                      VALUE 'Y'.        00800001
009200     05  PS-CRSDCK-SW                 PIC X(01) VALUE 'N'.        00810001
009300         88  PS-CRSDCK-YES                      VALUE 'Y'.        00820001
009400         88  PS-CRSDCK-NO                       VALUE 'N'.        00830001
009500     05  PS-B-RECORD-SW               PIC X(01) VALUE 'N'.        00840001
009600         88  PS-END-B-RECORD                    VALUE 'Y'.        00850001
009700         88  PS-NOT-END-B-RECORD                VALUE 'N'.        00860001
009800     05  PS-D-RECORD-SW               PIC X(01) VALUE 'N'.        00870001
009900         88  PS-END-D-RECORD                    VALUE 'Y'.        00880001
010000         88  PS-NOT-END-D-RECORD                VALUE 'N'.        00890001
010100     05  PS-END-TABLE-SW              PIC X(01) VALUE 'N'.        00900001
010200         88  PS-END-TABLE                       VALUE 'Y'.        00910001
010300         88  PS-END-TABLE-NO                    VALUE 'N'.        00920001
010400     05  PS-ECOMM-SW                  PIC X(01) VALUE 'N'.        00930001
010500         88  PS-ECOMM-YES                       VALUE 'Y'.        00940001
010600         88  PS-ECOMM-NO                        VALUE 'N'.        00950001
010700     05  PS-SUMMARY-SW                PIC X(01) VALUE 'N'.        00960001
010800         88  PS-SUMMARY-YES                     VALUE 'Y'.        00970001
010900         88  PS-SUMMARY-NO                      VALUE 'N'.        00980001
011000     05  PS-CURR-PREV-SW              PIC X(01) VALUE 'N'.        00990001
011100         88  PS-CURRENT                         VALUE 'Y'.        01000001
011200         88  PS-PREVIOUS                        VALUE 'N'.        01010001
011300                                                                  01020001
011400 01  PV-DATE-RECORD.                                              01030001
011500     05  PV-KEY-DATE                 PIC X(10).                   01040001
011600     05  PV-KEY-YYYYMMDD.                                         01050001
011700         10  PV-KEY-YYYY             PIC X(04).                   01060001
011800         10  FILLER                  PIC X(01) VALUE '-'.         01070001
011900         10  PV-KEY-MM               PIC X(02).                   01080001
012000         10  FILLER                  PIC X(01) VALUE '-'.         01090001
012100         10  PV-KEY-DD               PIC X(02) VALUE '01'.        01100001
012200     05  PV-MN-END-DTE.                                           01110001
012300         10  PV-MN-END-YYYY          PIC X(04).                   01120001
012400         10  FILLER                  PIC X(01).                   01130001
012500         10  PV-MN-END-MM            PIC X(02).                   01140001
012600         10  FILLER                  PIC X(01).                   01150001
012700         10  PV-MN-END-DD            PIC X(02).                   01160001
012800                                                                  01170001
012900     05  PV-FISCAL-YEAR              PIC X(04).                   01180001
013000     05  PV-FISCAL-MONTH             PIC X(02).                   01190001
013100                                                                  01200001
013200     05  PV-START1.                                               01210001
013300         10  PV-START-DATE1              PIC  X(10).              01220001
013400         10  PV-START-TIME1              PIC  X(16)  VALUE        01230001
013500                   '-00.00.00.000000'.                            01240001
013600     05  PV-START-TMST1 REDEFINES PV-START1 PIC X(26).            01250001
013700                                                                  01260001
013800     05  PV-END1.                                                 01270001
013900         10  PV-END-DATE1                 PIC  X(10).             01280001
014000         10  PV-END-TIME1                 PIC  X(16)  VALUE       01290001
014100                   '-23.59.59.999999'.                            01300001
014200     05  PV-END-TMST1 REDEFINES PV-END1    PIC  X(26).            01310001
014300                                                                  01320001
014400     05  PV-START2.                                               01330001
014500         10  PV-START-DATE2              PIC  X(10).              01340001
014600         10  PV-START-TIME2              PIC  X(16)  VALUE        01350001
014700                   '-00.00.00.000000'.                            01360001
014800     05  PV-START-TMST2 REDEFINES PV-START2 PIC X(26).            01370001
014900                                                                  01380001
015000     05  PV-END2.                                                 01390001
015100         10  PV-END-DATE2                 PIC  X(10).             01400001
015200         10  PV-END-TIME2                 PIC  X(16)  VALUE       01410001
015300                   '-23.59.59.999999'.                            01420001
015400     05  PV-END-TMST2 REDEFINES PV-END2    PIC  X(26).            01430001
015500                                                                  01440001
015600     05  PV-FISCAL-YYYY              PIC X(04) VALUE SPACES.      01450001
015700     05  PV-START-RPT-DATE           PIC X(10).                   01460001
015800     05  PV-END-RPT-DATE             PIC X(10).                   01470001
015900     05  PV-FROM-DATE                PIC X(10).                   01480001
016000     05  PV-TO-DATE                  PIC X(10).                   01490001
016100     05  PV-PREV-FROM-DATE           PIC X(10).                   01500001
016200     05  PV-PREV-TO-DATE             PIC X(10).                   01510001
016300                                                                  01520001
016400     05  PV-DIVIDEND                 PIC 9(03)V9999999.           01530001
016410     05  PV-RPT-TYP-PARM             PIC X(06).                   01540013
016500                                                                  01550001
016600 01  SD-SYSTEM-DATE.                                              01560001
016700     05  SD-SYSTEM-DATE-YY          PIC  9(02)   VALUE ZERO.      01570001
016800     05  SD-SYSTEM-DATE-MM          PIC  9(02)   VALUE ZERO.      01580001
016900     05  SD-SYSTEM-DATE-DD          PIC  9(02)   VALUE ZERO.      01590001
017000                                                                  01600001
017100 01  ST-SYSTEM-TIME.                                              01610001
017200     05  ST-SYSTEM-HOUR             PIC  9(02)   VALUE ZERO.      01620001
017300     05  ST-SYSTEM-MINUTE           PIC  9(02)   VALUE ZERO.      01630001
017400     05  FILLER                     PIC  9(04)   VALUE ZERO.      01640001
017500                                                                  01650001
017600**************************************************************    01660001
017700 01  PV-VARIABLES.                                                01670001
017800     05  PV-READ-COUNT-1              PIC S9(7) COMP-3            01680001
017900                                                VALUE ZERO.       01690001
018000     05  PV-READ-COUNT-2              PIC S9(7) COMP-3            01700001
018100                                                VALUE ZERO.       01710001
018200     05  PV-REC-READ-QTY              PIC S9(7) COMP-3            01720001
018300                                                VALUE ZERO.       01730001
018400     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            01740001
018500                                                VALUE ZERO.       01750001
018600     05  PV-PAGE-COUNT                PIC S9(3) COMP-3            01760001
018700                                                VALUE ZERO.       01770001
018800     05  PV-LINE-COUNT                PIC S9(04) VALUE ZERO       01780001
018900                                                 COMP SYNC.       01790001
019000     05  PV-SPACE-COUNT               PIC S9(05) VALUE ZERO       01800001
019100                                                 COMP-3.          01810001
019200     05  PV-CHAR-COUNT                PIC S9(05) VALUE ZERO       01820001
019300                                                 COMP-3.          01830001
019400     05  PV-REMAINDER                 PIC S9(05) VALUE ZERO       01840001
019500                                                 COMP-3.          01850001
019600     05  PV-RESULT                    PIC S9(05)V99 VALUE ZERO    01860001
019700                                                 COMP-3.          01870001
019800     05  PV-DEPT                      PIC 9(03) VALUE ZEROS.      01880001
019900     05  PV-STORE-NAME                PIC X(25) VALUE SPACES.     01890001
020000     05  PV-PREV-STORE-NAME           PIC X(25) VALUE SPACES.     01900001
020100     05  PV-ORD-NBR                   PIC S9(09) COMP.            01910001
020200     05  PV-PREV-ORD-NBR              PIC S9(09) COMP.            01920001
020300     05  PV-PREV-ORD-NBR-MM           PIC S9(09) COMP.            01930001
020400     05  PV-REC-SEQ-NBR               PIC S9(09) COMP.            01940001
020500     05  PV-PREV-REC-SEQ-NBR          PIC S9(09) COMP.            01950001
020600     05  PV-OPER-UNT-ID               PIC S9(04) COMP.            01960001
020700     05  PV-PREV-OPER-UNT-ID          PIC S9(04) COMP.            01970001
020800     05  PV-SAVE-OPER-UNT-ID          PIC S9(04) COMP.            01980001
020900     05  PV-DC-OPER                   PIC S9(04) COMP.            01990001
021000     05  PV-PREV-PROCESS-AREA         PIC X(06) VALUE SPACES.     02000001
021100     05  PV-PREV-PROCESS-GROUP        PIC X(06) VALUE SPACES.     02010001
021200     05  PV-UNIT-RETAIL               PIC X(14) VALUE SPACES.     02020001
021300     05  PV-OPER-DESC                 PIC X(05) VALUE SPACES.     02030001
021400     05  PV-STORE-CODE                PIC X(01) VALUE SPACES.     02040001
021500     05  PV-EXTENDED-RETAIL           PIC S9(12)V99.              02050001
021600     05  PV-EXTENDED-RETAIL-Z         PIC ZZZ,ZZZ,ZZZ.ZZ-         02060001
021700                                                 VALUE ZEROS.     02070001
021800     05  PV-UNT-WRKD-QTY              PIC S9(09) COMP.            02080001
021810     05  PV-ENT-ID                    PIC S9(09) COMP.            02090012
021820     05  PV-PREV-ENT-ID               PIC S9(09) COMP.            02100012
021830     05  PV-ENT-NAME                  PIC  X(30) VALUE SPACES.    02110012
021840     05  PV-PREV-ENT-NAME             PIC  X(30) VALUE SPACES.    02120012
021850     05  PV-P12MN-SLSRNK-NBR          PIC S9(04) COMP.            02130012
021860     05  PV-PREV-P12MN-SLSRNK-NBR     PIC S9(04) COMP.            02140012
021870     05  PV-PARM-P12MN-SLSRNK-NBR     PIC S9(04) COMP.            02150012
021900                                                                  02160001
022000     05  PV-DB2-FUNCTION              PIC X(30) VALUE SPACES.     02170001
022100     05  PV-PARAGRAPH                 PIC X(30) VALUE SPACES.     02180001
022200     05  PV-DISP-NUMBER               PIC Z,ZZZ,ZZ9.              02190001
022300                                                                  02200001
022400     05  PV-RUN-DATE                  PIC X(10) VALUE SPACES.     02210001
022500     05  PV-SAVE-START-DATE           PIC X(10) VALUE SPACES.     02220001
022600     05  PV-ERROR-MESSAGE-1           PIC X(60)  VALUE SPACES.    02230001
022700     05  PV-ERROR-MESSAGE-2           PIC X(60)  VALUE SPACES.    02240001
022800     05  PV-DB2-YEAR                  PIC S9(08) COMP             02250001
022900                                          VALUE ZERO.             02260001
023000     05  PV-DB2-MONTH                 PIC S9(08) COMP             02270001
023100                                          VALUE ZERO.             02280001
023200     05  PV-DB2-DAY                   PIC S9(08) COMP             02290001
023300                                          VALUE ZERO.             02300001
023400     05  PV-DB2-HOUR                  PIC S9(08) COMP             02310001
023500                                          VALUE ZERO.             02320001
023600     05  PV-DB2-MINUTE                PIC S9(08) COMP             02330001
023700                                          VALUE ZERO.             02340001
023800     05  PV-DB2-SECOND                PIC S9(08) COMP             02350001
023900                                          VALUE ZERO.             02360001
024000                                                                  02370001
024100     05  PV-DIVIDEND-X                PIC S9(12)V99 VALUE +0.     02380001
024200     05  PV-CURR-PERCENT              PIC S9(03)V99 VALUE +0      02390001
024300                                                 COMP.            02400001
024400     05  PV-PREV-PERCENT              PIC S9(03)V99 VALUE +0      02410001
024500                                                 COMP.            02420001
024600     05  PV-DIFF-PERCENT              PIC S9(03)V99 VALUE +0      02430001
024700                                                 COMP.            02440001
024800/                                                                 02450001
024900******************************************************************02460001
025000 01  PV-FORMAT-DATE.                                              02470001
025100     05  PV-FORMAT-CCYY           PIC  X(04)   VALUE SPACES.      02480001
025200     05  FILLER                   PIC  X(01)   VALUE '/'.         02490001
025300     05  PV-FORMAT-MM             PIC  X(02)   VALUE SPACES.      02500001
025400     05  FILLER                   PIC  X(01)   VALUE '/'.         02510001
025500     05  PV-FORMAT-DD             PIC  X(02)   VALUE SPACES.      02520001
025600                                                                  02530001
025700 01  PV-ABEND-FIELDS.                                             02540001
025800     05  PV-ABEND-CODE                PIC S9(04) VALUE +0         02550001
025900                                                 COMP SYNC.       02560001
026000     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'RCKRP036'.02570001
026100     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    02580001
026200     05  PV-ABEND-OPERATION           PIC  X(51) VALUE SPACES.    02590001
026300     05  PV-ABEND-STRUCTURE-1         PIC  X(8)  VALUE SPACES.    02600001
026400     05  PV-ABEND-STRUCTURE-2         PIC  X(8)  VALUE SPACES.    02610001
026500     05  PV-ABEND-STRUCTURE-3         PIC  X(8)  VALUE SPACES.    02620001
026600     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    02630001
026700     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    02640001
026800     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    02650001
026900/                                                                 02660001
027000 01  PC-CONSTANTS.                                                02670001
027100     05  PC-RCKRP036                  PIC X(08) VALUE 'RCKRP036'. 02680001
027200     05  PC-CURRENT-PROGRAM-NAME      PIC X(08) VALUE 'RCKRP036'. 02690001
027300     05  PC-END-OF-PAGE               PIC S9(3) COMP-3 VALUE +60. 02700001
027400     05  PC-MAX-LINE-COUNT            PIC S9(3) VALUE +60         02710001
027500                                                COMP-3.           02720001
027600******************************************************************02730001
027700 01  PV-YTD-TOTALS.                                               02740001
027800     05  PV-NBR-RCVRS-VRFD-YTD        PIC S9(12) VALUE +0.        02750001
027900     05  PV-NBR-LINES-VRFD-YTD        PIC S9(12) VALUE +0.        02760001
028000     05  PV-NBR-POS-YTD               PIC S9(12) VALUE +0.        02770001
028100     05  PV-AVG-RCVRS-PER-PO-YTD      PIC S9(04)V9 VALUE +0.      02780001
028200     05  PV-AVG-LINES-PER-REC-YTD     PIC S9(04)V9 VALUE +0.      02790001
028300                                                                  02800001
028400     05  PV-PACK-BY-STORE-YTD         PIC S9(12) VALUE +0.        02810001
028500     05  PV-INNER-PRE-PACK-YTD        PIC S9(12) VALUE +0.        02820001
028600     05  PV-MULTI-SKU-PRE-PACK-YTD    PIC S9(12) VALUE +0.        02830001
028700     05  PV-SINGLE-SKU-PRE-PACK-YTD   PIC S9(12) VALUE +0.        02840001
028800     05  PV-CASEPACK-YTD              PIC S9(12) VALUE +0.        02850001
028900     05  PV-BULKPACK-YTD              PIC S9(12) VALUE +0.        02860001
029000                                                                  02870001
029100     05  PV-EXPTED-CART-CNT-YTD       PIC S9(18) VALUE +0.        02880001
029200     05  PV-ACTL-CART-CNT-YTD         PIC S9(18) VALUE +0.        02890001
029300     05  PV-DIFF-CART-CNT-YTD         PIC S9(18) VALUE +0.        02900001
029400                                                                  02910001
029500     05  PV-EXPTED-ITM-QTY-YTD        PIC S9(17) VALUE +0.        02920001
029600     05  PV-VERIFY-ITM-QTY-YTD        PIC S9(17) VALUE +0.        02930001
029700     05  PV-AP-VERIFY-ITM-QTY-YTD     PIC S9(17) VALUE +0.        02940001
029800     05  PV-DIFF-ITM-QTY-YTD          PIC S9(17) VALUE +0.        02950001
029900     05  PV-QTY-ADJ-INT-VRFY-YTD      PIC S9(17) VALUE +0.        02960001
030000                                                                  02970001
030100     05  PV-EXPTED-EXT-RETAIL-YTD     PIC S9(15)V99 VALUE +0.     02980001
030200     05  PV-VERIFY-EXT-RETAIL-YTD     PIC S9(15)V99 VALUE +0.     02990001
030300     05  PV-AP-VERIFY-EXT-RETAIL-YTD  PIC S9(15)V99 VALUE +0.     03000001
030400     05  PV-DIFF-EXT-RETAIL-YTD       PIC S9(15)V99 VALUE +0.     03010001
030500     05  PV-EXT-RTL-ADJ-INT-VRFY-YTD  PIC S9(15)V99 VALUE +0.     03020001
030600                                                                  03030001
030700     05  PV-EXPD-VS-ACTL-OVRG-YTD     PIC S9(15)V99 VALUE +0.     03040001
030800     05  PV-EXPD-VS-ACTL-SHTG-YTD     PIC S9(15)V99 VALUE +0.     03050001
030900     05  PV-VARIANCE-OVR-SHRT-YTD     PIC S9(15)V99 VALUE +0.     03060001
031000                                                                  03070001
031100     05  PV-NBR-RCVR-OVR-CRTNS-YTD     PIC S9(12) VALUE +0.       03080001
031200     05  PV-NBR-RCVR-SHRT-CRTNS-YTD    PIC S9(12) VALUE +0.       03090001
031300     05  PV-NBR-RCVR-NODIFF-CRTNS-YTD  PIC S9(12) VALUE +0.       03100001
031400                                                                  03110001
031500     05  PV-NBR-RCVR-OVR-UNITS-YTD     PIC S9(12) VALUE +0.       03120001
031600     05  PV-NBR-RCVR-SHRT-UNITS-YTD    PIC S9(12) VALUE +0.       03130001
031700     05  PV-NBR-RCVR-NODIFF-UNITS-YTD  PIC S9(12) VALUE +0.       03140001
031800                                                                  03150001
031900     05  PV-NBR-RCVR-OVR-RTL-YTD       PIC S9(12) VALUE +0.       03160001
032000     05  PV-NBR-RCVR-SHRT-RTL-YTD      PIC S9(12) VALUE +0.       03170001
032100     05  PV-NBR-RCVR-NODIFF-RTL-YTD    PIC S9(12) VALUE +0.       03180001
032200                                                                  03190001
032300     05  PV-NBR-LINE-OVR-UNITS-YTD     PIC S9(12) VALUE +0.       03200001
032400     05  PV-NBR-LINE-SHRT-UNITS-YTD    PIC S9(12) VALUE +0.       03210001
032500     05  PV-NBR-LINE-NODIFF-UNITS-YTD  PIC S9(12) VALUE +0.       03220001
032600                                                                  03230001
032700     05  PV-NBR-LINE-OVR-RTL-YTD       PIC S9(12) VALUE +0.       03240001
032800     05  PV-NBR-LINE-SHRT-RTL-YTD      PIC S9(12) VALUE +0.       03250001
032900     05  PV-NBR-LINE-NODIFF-RTL-YTD    PIC S9(12) VALUE +0.       03260001
033000/                                                                 03270001
033100******************************************************************03280001
033200 01  PV-MONTH-TOTALS.                                             03290001
033300     05  PV-NBR-RCVRS-VRFD-MM         PIC S9(12) VALUE +0.        03300001
033400     05  PV-NBR-LINES-VRFD-MM         PIC S9(12) VALUE +0.        03310001
033500     05  PV-NBR-POS-MM                PIC S9(12) VALUE +0.        03320001
033600     05  PV-AVG-RCVRS-PER-PO-MM       PIC S9(04)V9 VALUE +0.      03330001
033700     05  PV-AVG-LINES-PER-REC-MM      PIC S9(04)V9 VALUE +0.      03340001
033800                                                                  03350001
033900     05  PV-PACK-BY-STORE-MM          PIC S9(12) VALUE +0.        03360001
034000     05  PV-INNER-PRE-PACK-MM         PIC S9(12) VALUE +0.        03370001
034100     05  PV-MULTI-SKU-PRE-PACK-MM     PIC S9(12) VALUE +0.        03380001
034200     05  PV-SINGLE-SKU-PRE-PACK-MM    PIC S9(12) VALUE +0.        03390001
034300     05  PV-CASEPACK-MM               PIC S9(12) VALUE +0.        03400001
034400     05  PV-BULKPACK-MM               PIC S9(12) VALUE +0.        03410001
034500                                                                  03420001
034600     05  PV-EXPTED-CART-CNT-MM        PIC S9(18) VALUE +0.        03430001
034700     05  PV-ACTL-CART-CNT-MM          PIC S9(18) VALUE +0.        03440001
034800     05  PV-DIFF-CART-CNT-MM          PIC S9(18) VALUE +0.        03450001
034900                                                                  03460001
035000     05  PV-EXPTED-ITM-QTY-MM         PIC S9(17) VALUE +0.        03470001
035100     05  PV-VERIFY-ITM-QTY-MM         PIC S9(17) VALUE +0.        03480001
035200     05  PV-AP-VERIFY-ITM-QTY-MM      PIC S9(17) VALUE +0.        03490001
035300     05  PV-DIFF-ITM-QTY-MM           PIC S9(17) VALUE +0.        03500001
035400     05  PV-QTY-ADJ-INT-VRFY-MM       PIC S9(17) VALUE +0.        03510001
035500                                                                  03520001
035600     05  PV-EXPTED-EXT-RETAIL-MM      PIC S9(15)V99 VALUE +0.     03530001
035700     05  PV-VERIFY-EXT-RETAIL-MM      PIC S9(15)V99 VALUE +0.     03540001
035800     05  PV-AP-VERIFY-EXT-RETAIL-MM   PIC S9(15)V99 VALUE +0.     03550001
035900     05  PV-DIFF-EXT-RETAIL-MM        PIC S9(15)V99 VALUE +0.     03560001
036000     05  PV-EXT-RTL-ADJ-INT-VRFY-MM   PIC S9(15)V99 VALUE +0.     03570001
036100                                                                  03580001
036200     05  PV-EXPD-VS-ACTL-OVRG-MM      PIC S9(15)V99 VALUE +0.     03590001
036300     05  PV-EXPD-VS-ACTL-SHTG-MM      PIC S9(15)V99 VALUE +0.     03600001
036400     05  PV-VARIANCE-OVR-SHRT-MM      PIC S9(15)V99 VALUE +0.     03610001
036500                                                                  03620001
036600     05  PV-NBR-RCVR-OVR-CRTNS-MM      PIC S9(12) VALUE +0.       03630001
036700     05  PV-NBR-RCVR-SHRT-CRTNS-MM     PIC S9(12) VALUE +0.       03640001
036800     05  PV-NBR-RCVR-NODIFF-CRTNS-MM   PIC S9(12) VALUE +0.       03650001
036900                                                                  03660001
037000     05  PV-NBR-RCVR-OVR-UNITS-MM      PIC S9(12) VALUE +0.       03670001
037100     05  PV-NBR-RCVR-SHRT-UNITS-MM     PIC S9(12) VALUE +0.       03680001
037200     05  PV-NBR-RCVR-NODIFF-UNITS-MM   PIC S9(12) VALUE +0.       03690001
037300                                                                  03700001
037400     05  PV-NBR-RCVR-OVR-RTL-MM        PIC S9(12) VALUE +0.       03710001
037500     05  PV-NBR-RCVR-SHRT-RTL-MM       PIC S9(12) VALUE +0.       03720001
037600     05  PV-NBR-RCVR-NODIFF-RTL-MM     PIC S9(12) VALUE +0.       03730001
037700                                                                  03740001
037800     05  PV-NBR-LINE-OVR-UNITS-MM      PIC S9(12) VALUE +0.       03750001
037900     05  PV-NBR-LINE-SHRT-UNITS-MM     PIC S9(12) VALUE +0.       03760001
038000     05  PV-NBR-LINE-NODIFF-UNITS-MM   PIC S9(12) VALUE +0.       03770001
038100                                                                  03780001
038200     05  PV-NBR-LINE-OVR-RTL-MM        PIC S9(12) VALUE +0.       03790001
038300     05  PV-NBR-LINE-SHRT-RTL-MM       PIC S9(12) VALUE +0.       03800001
038400     05  PV-NBR-LINE-NODIFF-RTL-MM     PIC S9(12) VALUE +0.       03810001
038500/                                                                 03820001
038600******************************************************************03830001
038700*  WORK FIELDS FOR PRINTING A 132 CHARACTER REPORT.               03840001
038800******************************************************************03850001
038900     COPY DPWS132O.                                               03860001
039000*                                                                 03870001
039100 01  HL-HEADING-LINE-1.                                           03880012
039200     05  HL1-RPT-VERSION             PIC  X(30)  VALUE SPACES.    03890012
039300     05  FILLER                      PIC  X(102)  VALUE SPACES.   03900012
039301                                                                  03910012
039310 01  HL-HEADING-LINE-2.                                           03920012
039320     05  FILLER                      PIC  X(42)  VALUE            03930012
039330      '            SUMMARY OF VERIFIED RECEIVERS '.               03940016
039400     05  FILLER                      PIC  X(25)  VALUE            03950001
039500      'BY VENDOR - MONTH ENDING '.                                03960001
039600     05  HL2-MONTH-END-DATE.                                      03970001
039700         10  HL2-MM                  PIC 99.                      03980001
039800         10  FILLER                  PIC X VALUE '/'.             03990001
039900         10  HL2-DD                  PIC 99.                      04000001
040000         10  FILLER                  PIC X VALUE '/'.             04010001
040100         10  HL2-YYYY                PIC 9(04).                   04020001
040200     05  FILLER                      PIC  X(16)  VALUE            04030001
040300      ' OF FISCAL YEAR '.                                         04040001
040400     05  HL2-YEAR                    PIC 9(04).                   04050001
040500     05  FILLER                      PIC  X(10)  VALUE SPACES.    04060001
040600                                                                  04070001
040700 01  HL-HEADING-LINE-3.                                           04080001
040800     05  FILLER                      PIC  X(14)  VALUE            04090001
040900            'VENDOR NAME:  '.                                     04100001
041300     05  HL3-VENDOR-NAME             PIC  X(30) VALUE SPACES.     04110001
041400     05  FILLER                      PIC  X(10) VALUE SPACES.     04120001
041410     05  FILLER                      PIC  X(31)  VALUE            04130001
041420            'PREVIOUS 12 MONTH SALES RANK:  '.                    04140001
041430     05  HL3-SALES-RANK              PIC  ZZ,ZZ9.                 04150016
041440     05  FILLER                      PIC  X(12)  VALUE            04160016
041450            '(OUT OF TOP '.                                       04170016
041460     05  HL3-TOP-RANK                PIC  ZZ,ZZ9.                 04180016
041470     05  FILLER                      PIC  X(21)  VALUE            04190016
041480            ' PREV 12 MONTH SALES)'.                              04200016
041500                                                                  04210001
041600 01  HL-HEADING-LINE-4.                                           04220001
041700     05  FILLER                      PIC  X(44)  VALUE            04230001
041800           '                                           '.         04240001
041900     05  FILLER                      PIC  X(44)  VALUE            04250001
042000           '                    MONTHLY INFORMATION    '.         04260001
042100     05  FILLER                      PIC  X(44)  VALUE            04270001
042200           '                 YEAR-TO-DATE INFORMATION   '.        04280001
042300                                                                  04290001
042400******************************************************************04300001
042500*  42 DETAIL LINES FOR REPORT.                                    04310001
042600******************************************************************04320001
042700 01  DL-DETAIL-LINE-1.                                            04330001
042800     05  FILLER                       PIC X(44) VALUE             04340001
042900          'NUMBER OF RECEIVERS VERIFIED               '.          04350001
043000     05  FILLER                       PIC X(16) VALUE SPACES.     04360001
043100     05  DL1-REC-VRFD-MONTH           PIC ZZZ,ZZZ,ZZZ,ZZ9.        04370001
043200     05  FILLER                       PIC X(27) VALUE SPACES.     04380001
043300     05  DL1-REC-VRFD-YTD             PIC ZZZ,ZZZ,ZZZ,ZZ9.        04390001
043400     05  FILLER                       PIC X(01) VALUE SPACES.     04400001
043500                                                                  04410001
043600 01  DL-DETAIL-LINE-2.                                            04420001
043700     05  FILLER                       PIC X(44) VALUE             04430001
043800          'NUMBER OF LINES VERIFIED                   '.          04440001
043900     05  FILLER                       PIC X(16) VALUE SPACES.     04450001
044000     05  DL2-LINES-VRFD-MONTH         PIC ZZZ,ZZZ,ZZZ,ZZ9.        04460001
044100     05  FILLER                       PIC X(27) VALUE SPACES.     04470001
044200     05  DL2-LINES-VRFD-YTD           PIC ZZZ,ZZZ,ZZZ,ZZ9.        04480001
044300     05  FILLER                       PIC X(01) VALUE SPACES.     04490001
044400                                                                  04500001
044500 01  DL-DETAIL-LINE-3.                                            04510001
044600     05  FILLER                       PIC X(44) VALUE             04520001
044700          'NUMBER OF POS WITH A VERIFIED RECEIVER     '.          04530001
044800     05  FILLER                       PIC X(16) VALUE SPACES.     04540001
044900     05  DL3-POS-VRFD-MONTH           PIC ZZZ,ZZZ,ZZZ,ZZ9.        04550001
045000     05  FILLER                       PIC X(27) VALUE SPACES.     04560001
045100     05  DL3-POS-VRFD-YTD             PIC ZZZ,ZZZ,ZZZ,ZZ9.        04570001
045200     05  FILLER                       PIC X(01) VALUE SPACES.     04580001
045300                                                                  04590001
045400 01  DL-DETAIL-LINE-4.                                            04600001
045500     05  FILLER                       PIC X(44) VALUE             04610001
045600          'AVERAGE RECEIVERS PER PO                   '.          04620001
045700     05  FILLER                       PIC X(24) VALUE SPACES.     04630001
045800     05  DL4-AVG-REC-PER-PO-MONTH     PIC Z,ZZZ.9.                04640001
045900     05  FILLER                       PIC X(35) VALUE SPACES.     04650001
046000     05  DL4-AVG-REC-PER-PO-YTD       PIC Z,ZZZ.9.                04660001
046100     05  FILLER                       PIC X(01) VALUE SPACES.     04670001
046200                                                                  04680001
046300 01  DL-DETAIL-LINE-5.                                            04690001
046400     05  FILLER                       PIC X(44) VALUE             04700001
046500          'AVERAGE LINES PER RECEIVER                 '.          04710001
046600     05  FILLER                       PIC X(24) VALUE SPACES.     04720001
046700     05  DL5-LINES-PER-REC-MONTH      PIC Z,ZZZ.9.                04730001
046800     05  FILLER                       PIC X(35) VALUE SPACES.     04740001
046900     05  DL5-LINES-PER-REC-YTD        PIC Z,ZZZ.9.                04750001
047000     05  FILLER                       PIC X(01) VALUE SPACES.     04760001
047100                                                                  04770001
047200 01  DL-DETAIL-LINE-6.                                            04780001
047300     05  FILLER                       PIC X(44) VALUE             04790001
047400          'NUMBER OF PACK-BY-STORE RECEIVERS          '.          04800001
047500     05  FILLER                       PIC X(16) VALUE SPACES.     04810001
047600     05  DL6-PCKBYSTR-REC-MONTH       PIC ZZZ,ZZZ,ZZZ,ZZ9.        04820001
047700     05  FILLER                       PIC X(03)  VALUE            04830001
047800      '  ('.                                                      04840001
047900     05  DL6-PERCENT-MONTH            PIC ZZZ.Z.                  04850001
048000     05  FILLER                       PIC X(01)  VALUE            04860001
048100      ')'.                                                        04870001
048200     05  FILLER                       PIC X(18) VALUE SPACES.     04880001
048300     05  DL6-PCKBYSTR-REC-YTD         PIC ZZZ,ZZZ,ZZZ,ZZ9.        04890001
048400     05  FILLER                       PIC X(03)  VALUE            04900001
048500      '  ('.                                                      04910001
048600     05  DL6-PERCENT-YTD              PIC ZZZ.Z.                  04920001
048700     05  FILLER                       PIC X(01)  VALUE            04930001
048800      ')'.                                                        04940001
048900     05  FILLER                       PIC X(01) VALUE SPACES.     04950001
049000                                                                  04960001
049100 01  DL-DETAIL-LINE-7.                                            04970001
049200     05  FILLER                       PIC X(44) VALUE             04980001
049300          'NUMBER OF INNER PRE-PACK RECEIVERS         '.          04990001
049400     05  FILLER                       PIC X(16) VALUE SPACES.     05000001
049500     05  DL7-INNER-PRPCK-REC-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        05010001
049600     05  FILLER                       PIC X(03)  VALUE            05020001
049700      '  ('.                                                      05030001
049800     05  DL7-PERCENT-MONTH            PIC ZZZ.Z.                  05040001
049900     05  FILLER                       PIC X(01)  VALUE            05050001
050000      ')'.                                                        05060001
050100     05  FILLER                       PIC X(18) VALUE SPACES.     05070001
050200     05  DL7-INNER-PRPCK-REC-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        05080001
050300     05  FILLER                       PIC X(03)  VALUE            05090001
050400      '  ('.                                                      05100001
050500     05  DL7-PERCENT-YTD              PIC ZZZ.Z.                  05110001
050600     05  FILLER                       PIC X(01)  VALUE            05120001
050700      ')'.                                                        05130001
050800     05  FILLER                       PIC X(01) VALUE SPACES.     05140001
050900                                                                  05150001
051000 01  DL-DETAIL-LINE-8.                                            05160001
051100     05  FILLER                       PIC X(44) VALUE             05170001
051200          'NUMBER OF MULTI SKU PRE-PACK RECEIVERS     '.          05180001
051300     05  FILLER                       PIC X(16) VALUE SPACES.     05190001
051400     05  DL8-MLTSKU-PRPCK-REC-MONTH   PIC ZZZ,ZZZ,ZZZ,ZZ9.        05200001
051500     05  FILLER                       PIC X(03)  VALUE            05210001
051600      '  ('.                                                      05220001
051700     05  DL8-PERCENT-MONTH            PIC ZZZ.Z.                  05230001
051800     05  FILLER                       PIC X(01)  VALUE            05240001
051900      ')'.                                                        05250001
052000     05  FILLER                       PIC X(18) VALUE SPACES.     05260001
052100     05  DL8-MLTSKU-PRPCK-REC-YTD     PIC ZZZ,ZZZ,ZZZ,ZZ9.        05270001
052200     05  FILLER                       PIC X(03)  VALUE            05280001
052300      '  ('.                                                      05290001
052400     05  DL8-PERCENT-YTD              PIC ZZZ.Z.                  05300001
052500     05  FILLER                       PIC X(01)  VALUE            05310001
052600      ')'.                                                        05320001
052700     05  FILLER                       PIC X(01) VALUE SPACES.     05330001
052800                                                                  05340001
052900 01  DL-DETAIL-LINE-9.                                            05350001
053000     05  FILLER                       PIC X(44) VALUE             05360001
053100          'NUMBER OF SINGLE SKU PRE-PACK RECEIVERS    '.          05370001
053200     05  FILLER                       PIC X(16) VALUE SPACES.     05380001
053300     05  DL9-SGLSKU-PRPCK-REC-MONTH   PIC ZZZ,ZZZ,ZZZ,ZZ9.        05390001
053400     05  FILLER                       PIC X(03)  VALUE            05400001
053500      '  ('.                                                      05410001
053600     05  DL9-PERCENT-MONTH            PIC ZZZ.Z.                  05420001
053700     05  FILLER                       PIC X(01)  VALUE            05430001
053800      ')'.                                                        05440001
053900     05  FILLER                       PIC X(18) VALUE SPACES.     05450001
054000     05  DL9-SGLSKU-PRPCK-REC-YTD     PIC ZZZ,ZZZ,ZZZ,ZZ9.        05460001
054100     05  FILLER                       PIC X(03)  VALUE            05470001
054200      '  ('.                                                      05480001
054300     05  DL9-PERCENT-YTD              PIC ZZZ.Z.                  05490001
054400     05  FILLER                       PIC X(01)  VALUE            05500001
054500      ')'.                                                        05510001
054600     05  FILLER                       PIC X(01) VALUE SPACES.     05520001
054700                                                                  05530001
054800 01  DL-DETAIL-LINE-10.                                           05540001
054900     05  FILLER                       PIC X(44) VALUE             05550001
055000          'NUMBER OF CASEPACK RECEIVERS               '.          05560001
055100     05  FILLER                       PIC X(16) VALUE SPACES.     05570001
055200     05  DL10-CASEPACK-REC-MONTH      PIC ZZZ,ZZZ,ZZZ,ZZ9.        05580001
055300     05  FILLER                       PIC X(03)  VALUE            05590001
055400      '  ('.                                                      05600001
055500     05  DL10-PERCENT-MONTH           PIC ZZZ.Z.                  05610001
055600     05  FILLER                       PIC X(01)  VALUE            05620001
055700      ')'.                                                        05630001
055800     05  FILLER                       PIC X(18) VALUE SPACES.     05640001
055900     05  DL10-CASEPACK-REC-YTD        PIC ZZZ,ZZZ,ZZZ,ZZ9.        05650001
056000     05  FILLER                       PIC X(03)  VALUE            05660001
056100      '  ('.                                                      05670001
056200     05  DL10-PERCENT-YTD             PIC ZZZ.Z.                  05680001
056300     05  FILLER                       PIC X(01)  VALUE            05690001
056400      ')'.                                                        05700001
056500     05  FILLER                       PIC X(01) VALUE SPACES.     05710001
056600                                                                  05720001
056700 01  DL-DETAIL-LINE-11.                                           05730001
056800     05  FILLER                       PIC X(44) VALUE             05740001
056900          'NUMBER OF BULK PACK RECEIVERS              '.          05750001
057000     05  FILLER                       PIC X(16) VALUE SPACES.     05760001
057100     05  DL11-BULKPACK-REC-MONTH      PIC ZZZ,ZZZ,ZZZ,ZZ9.        05770001
057200     05  FILLER                       PIC X(03)  VALUE            05780001
057300      '  ('.                                                      05790001
057400     05  DL11-PERCENT-MONTH           PIC ZZZ.Z.                  05800001
057500     05  FILLER                       PIC X(01)  VALUE            05810001
057600      ')'.                                                        05820001
057700     05  FILLER                       PIC X(18) VALUE SPACES.     05830001
057800     05  DL11-BULKPACK-REC-YTD        PIC ZZZ,ZZZ,ZZZ,ZZ9.        05840001
057900     05  FILLER                       PIC X(03)  VALUE            05850001
058000      '  ('.                                                      05860001
058100     05  DL11-PERCENT-YTD             PIC ZZZ.Z.                  05870001
058200     05  FILLER                       PIC X(01)  VALUE            05880001
058300      ')'.                                                        05890001
058400     05  FILLER                       PIC X(01) VALUE SPACES.     05900001
058500                                                                  05910001
058600 01  DL-DETAIL-LINE-12.                                           05920001
058700     05  FILLER                       PIC X(44) VALUE             05930001
058800          'EXPECTED CARTON COUNT                      '.          05940001
058900     05  FILLER                       PIC X(16) VALUE SPACES.     05950001
059000     05  DL12-EXPTD-CRTCNT-MONTH      PIC ZZZ,ZZZ,ZZZ,ZZ9.        05960001
059100     05  FILLER                       PIC X(27) VALUE SPACES.     05970001
059200     05  DL12-EXPTD-CRTCNT-YTD        PIC ZZZ,ZZZ,ZZZ,ZZ9.        05980001
059300     05  FILLER                       PIC X(01) VALUE SPACES.     05990001
059400                                                                  06000001
059500 01  DL-DETAIL-LINE-13.                                           06010001
059600     05  FILLER                       PIC X(44) VALUE             06020001
059700          'ACTUAL CARTON COUNT                        '.          06030001
059800     05  FILLER                       PIC X(16) VALUE SPACES.     06040001
059900     05  DL13-ACTL-CRTCNT-MONTH       PIC ZZZ,ZZZ,ZZZ,ZZ9.        06050001
060000     05  FILLER                       PIC X(27) VALUE SPACES.     06060001
060100     05  DL13-ACTL-CRTCNT-YTD         PIC ZZZ,ZZZ,ZZZ,ZZ9.        06070001
060200     05  FILLER                       PIC X(01) VALUE SPACES.     06080001
060300                                                                  06090001
060400 01  DL-DETAIL-LINE-14.                                           06100001
060500     05  FILLER                       PIC X(44) VALUE             06110001
060600          'CARTON COUNT DIFFERENCE                    '.          06120001
060700     05  FILLER                       PIC X(16) VALUE SPACES.     06130001
060800     05  DL14-DIFF-CRTCNT-MONTH       PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06140001
060900     05  FILLER                       PIC X(02)  VALUE            06150001
061000      ' ('.                                                       06160001
061100     05  DL14-PERCENT-MONTH           PIC ZZZ.Z.                  06170001
061200     05  FILLER                       PIC X(01)  VALUE            06180001
061300      ')'.                                                        06190001
061400     05  FILLER                       PIC X(18) VALUE SPACES.     06200001
061500     05  DL14-DIFF-CRTCNT-YTD         PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06210001
061600     05  FILLER                       PIC X(02)  VALUE            06220001
061700      ' ('.                                                       06230001
061800     05  DL14-PERCENT-YTD             PIC ZZZ.Z.                  06240001
061900     05  FILLER                       PIC X(01)  VALUE            06250001
062000      ')'.                                                        06260001
062100     05  FILLER                       PIC X(01) VALUE SPACES.     06270001
062200                                                                  06280001
062300 01  DL-DETAIL-LINE-15.                                           06290001
062400     05  FILLER                       PIC X(44) VALUE             06300001
062500          'EXPECTED ITEM QUANTITY                     '.          06310001
062600     05  FILLER                       PIC X(16) VALUE SPACES.     06320001
062700     05  DL15-EXPTD-ITEM-MONTH        PIC ZZZ,ZZZ,ZZZ,ZZ9.        06330001
062800     05  FILLER                       PIC X(27) VALUE SPACES.     06340001
062900     05  DL15-EXPTD-ITEM-YTD          PIC ZZZ,ZZZ,ZZZ,ZZ9.        06350001
063000     05  FILLER                       PIC X(01) VALUE SPACES.     06360001
063100                                                                  06370001
063200 01  DL-DETAIL-LINE-16.                                           06380001
063300     05  FILLER                       PIC X(44) VALUE             06390001
063400          'INITIAL VERIFIED ITEM QUANTITY             '.          06400001
063500     05  FILLER                       PIC X(16) VALUE SPACES.     06410001
063600     05  DL16-INTL-VRFD-ITEM-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        06420001
063700     05  FILLER                       PIC X(27) VALUE SPACES.     06430001
063800     05  DL16-INTL-VRFD-ITEM-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        06440001
063900     05  FILLER                       PIC X(01) VALUE SPACES.     06450001
064000                                                                  06460001
064100 01  DL-DETAIL-LINE-17.                                           06470001
064200     05  FILLER                       PIC X(44) VALUE             06480001
064300          'FINAL VERIFIED ITEM QUANTITY               '.          06490001
064400     05  FILLER                       PIC X(16) VALUE SPACES.     06500001
064500     05  DL17-FINL-VRFD-ITEM-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        06510001
064600     05  FILLER                       PIC X(27) VALUE SPACES.     06520001
064700     05  DL17-FINL-VRFD-ITEM-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        06530001
064800     05  FILLER                       PIC X(01) VALUE SPACES.     06540001
064900                                                                  06550001
065000 01  DL-DETAIL-LINE-18.                                           06560001
065100     05  FILLER                       PIC X(44) VALUE             06570001
065200          'ITEM QUANTITY DIFFERENCE (EXP VS FINAL)    '.          06580001
065300     05  FILLER                       PIC X(16) VALUE SPACES.     06590001
065400     05  DL18-ITEM-QTY-DIFF-MONTH     PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06600001
065500     05  FILLER                       PIC X(02)  VALUE            06610001
065600      ' ('.                                                       06620001
065700     05  DL18-PERCENT-MONTH           PIC ZZZ.Z.                  06630001
065800     05  FILLER                       PIC X(01)  VALUE            06640001
065900      ')'.                                                        06650001
066000     05  FILLER                       PIC X(18) VALUE SPACES.     06660001
066100     05  DL18-ITEM-QTY-DIFF-YTD       PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06670001
066200     05  FILLER                       PIC X(02)  VALUE            06680001
066300      ' ('.                                                       06690001
066400     05  DL18-PERCENT-YTD             PIC ZZZ.Z.                  06700001
066500     05  FILLER                       PIC X(01)  VALUE            06710001
066600      ')'.                                                        06720001
066700     05  FILLER                       PIC X(01) VALUE SPACES.     06730001
066800                                                                  06740001
066900 01  DL-DETAIL-LINE-19.                                           06750001
067000     05  FILLER                       PIC X(44) VALUE             06760001
067100          'QUANTITY ADJUSTED AFTER INITIAL VERIFY     '.          06770001
067200     05  FILLER                       PIC X(16) VALUE SPACES.     06780001
067300     05  DL19-QTY-ADJ-INL-VRFY-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06790001
067400     05  FILLER                       PIC X(02)  VALUE            06800001
067500      ' ('.                                                       06810001
067600     05  DL19-PERCENT-MONTH           PIC ZZZ.Z.                  06820001
067700     05  FILLER                       PIC X(01)  VALUE            06830001
067800      ')'.                                                        06840001
067900     05  FILLER                       PIC X(18) VALUE SPACES.     06850001
068000     05  DL19-QTY-ADJ-INL-VRFY-YTD    PIC ZZZ,ZZZ,ZZZ,ZZ9-.       06860001
068100     05  FILLER                       PIC X(02)  VALUE            06870001
068200      ' ('.                                                       06880001
068300     05  DL19-PERCENT-YTD             PIC ZZZ.Z.                  06890001
068400     05  FILLER                       PIC X(01)  VALUE            06900001
068500      ')'.                                                        06910001
068600     05  FILLER                       PIC X(01) VALUE SPACES.     06920001
068700                                                                  06930001
068800 01  DL-DETAIL-LINE-20.                                           06940001
068900     05  FILLER                       PIC X(44) VALUE             06950001
069000          'EXPECTED ITEM EXTENDED RETAIL              '.          06960001
069100     05  FILLER                       PIC X(13) VALUE SPACES.     06970001
069200     05  DL20-EXPDITM-EXTD-RTL-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     06980001
069300     05  FILLER                       PIC X(24) VALUE SPACES.     06990001
069400     05  DL20-EXPDITM-EXTD-RTL-YTD    PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     07000001
069500     05  FILLER                       PIC X(01) VALUE SPACES.     07010001
069600                                                                  07020001
069700 01  DL-DETAIL-LINE-21.                                           07030001
069800     05  FILLER                       PIC X(44) VALUE             07040001
069900          'INITIAL VERIFY EXTENDED RETAIL             '.          07050001
070000     05  FILLER                       PIC X(13) VALUE SPACES.     07060001
070100     05  DL21-INLVRFY-EXTD-RTL-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     07070001
070200     05  FILLER                       PIC X(24) VALUE SPACES.     07080001
070300     05  DL21-INLVRFY-EXTD-RTL-YTD    PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     07090001
070400     05  FILLER                       PIC X(01) VALUE SPACES.     07100001
070500                                                                  07110001
070600 01  DL-DETAIL-LINE-22.                                           07120001
070700     05  FILLER                       PIC X(44) VALUE             07130001
070800          'FINAL VERIFY EXTENDED RETAIL               '.          07140001
070900     05  FILLER                       PIC X(13) VALUE SPACES.     07150001
071000     05  DL22-FNLVRFY-EXTD-RTL-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     07160001
071100     05  FILLER                       PIC X(24) VALUE SPACES.     07170001
071200     05  DL22-FNLVRFY-EXTD-RTL-YTD    PIC ZZZ,ZZZ,ZZZ,ZZZ.99.     07180001
071300     05  FILLER                       PIC X(01) VALUE SPACES.     07190001
071400                                                                  07200001
071500 01  DL-DETAIL-LINE-23.                                           07210001
071600     05  FILLER                       PIC X(44) VALUE             07220001
071700          'EXTENDED RETAIL DIFFERENCE (EXP VS FINAL)  '.          07230001
071800     05  FILLER                       PIC X(13) VALUE SPACES.     07240001
071900     05  DL23-DIFF-EXTD-RTL-MONTH     PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07250001
072000     05  FILLER                       PIC X(02)  VALUE            07260001
072100      ' ('.                                                       07270001
072200     05  DL23-PERCENT-MONTH           PIC ZZZ.Z.                  07280001
072300     05  FILLER                       PIC X(01)  VALUE            07290001
072400      ')'.                                                        07300001
072500     05  FILLER                       PIC X(15) VALUE SPACES.     07310001
072600     05  DL23-DIFF-EXTD-RTL-YTD       PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07320001
072700     05  FILLER                       PIC X(02)  VALUE            07330001
072800      ' ('.                                                       07340001
072900     05  DL23-PERCENT-YTD             PIC ZZZ.Z.                  07350001
073000     05  FILLER                       PIC X(01)  VALUE            07360001
073100      ')'.                                                        07370001
073200     05  FILLER                       PIC X(01) VALUE SPACES.     07380001
073300                                                                  07390001
073400 01  DL-DETAIL-LINE-24.                                           07400001
073500     05  FILLER                       PIC X(46) VALUE             07410001
073600          'EXTENDED RETAIL ADJUSTED AFTER INITIAL VERIFY'.        07420001
073700     05  FILLER                       PIC X(11) VALUE SPACES.     07430001
073800     05  DL24-EXTD-RTL-ADJ-MONTH      PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07440001
073900     05  FILLER                       PIC X(02)  VALUE            07450001
074000      ' ('.                                                       07460001
074100     05  DL24-PERCENT-MONTH           PIC ZZZ.Z.                  07470001
074200     05  FILLER                       PIC X(01)  VALUE            07480001
074300      ')'.                                                        07490001
074400     05  FILLER                       PIC X(15) VALUE SPACES.     07500001
074500     05  DL24-EXTD-RTL-ADJ-YTD        PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07510001
074600     05  FILLER                       PIC X(02)  VALUE            07520001
074700      ' ('.                                                       07530001
074800     05  DL24-PERCENT-YTD             PIC ZZZ.Z.                  07540001
074900     05  FILLER                       PIC X(01)  VALUE            07550001
075000      ')'.                                                        07560001
075100     05  FILLER                       PIC X(01) VALUE SPACES.     07570001
075200                                                                  07580001
075300 01  DL-DETAIL-LINE-24A.                                          07590001
075400     05  FILLER                       PIC X(46) VALUE             07600001
075500          'EXPECTED VS ACTUAL RETAIL OVERAGE VERIFIED   '.        07610001
075600     05  FILLER                       PIC X(11) VALUE SPACES.     07620001
075700     05  DL24A-EXPD-VS-ACTL-OVRG-MM   PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07630001
075800     05  FILLER                       PIC X(02)  VALUE            07640001
075900      ' ('.                                                       07650001
076000     05  DL24A-PERCENT-MONTH          PIC ZZZ.Z.                  07660001
076100     05  FILLER                       PIC X(01)  VALUE            07670001
076200      ')'.                                                        07680001
076300     05  FILLER                       PIC X(15) VALUE SPACES.     07690001
076400     05  DL24A-EXPD-VS-ACTL-OVRG-YTD  PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07700001
076500     05  FILLER                       PIC X(02)  VALUE            07710001
076600      ' ('.                                                       07720001
076700     05  DL24A-PERCENT-YTD            PIC ZZZ.Z.                  07730001
076800     05  FILLER                       PIC X(01)  VALUE            07740001
076900      ')'.                                                        07750001
077000     05  FILLER                       PIC X(01) VALUE SPACES.     07760001
077100                                                                  07770001
077200 01  DL-DETAIL-LINE-24B.                                          07780001
077300     05  FILLER                       PIC X(46) VALUE             07790001
077400          'EXPECTED VS ACTUAL RETAIL SHORTAGE VERIFIED  '.        07800001
077500     05  FILLER                       PIC X(11) VALUE SPACES.     07810001
077600     05  DL24B-EXPD-VS-ACTL-SHTG-MM   PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07820001
077700     05  FILLER                       PIC X(02)  VALUE            07830001
077800      ' ('.                                                       07840001
077900     05  DL24B-PERCENT-MONTH          PIC ZZZ.Z.                  07850001
078000     05  FILLER                       PIC X(01)  VALUE            07860001
078100      ')'.                                                        07870001
078200     05  FILLER                       PIC X(15) VALUE SPACES.     07880001
078300     05  DL24B-EXPD-VS-ACTL-SHTG-YTD  PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    07890001
078400     05  FILLER                       PIC X(02)  VALUE            07900001
078500      ' ('.                                                       07910001
078600     05  DL24B-PERCENT-YTD            PIC ZZZ.Z.                  07920001
078700     05  FILLER                       PIC X(01)  VALUE            07930001
078800      ')'.                                                        07940001
078900     05  FILLER                       PIC X(01) VALUE SPACES.     07950001
079000                                                                  07960001
079100 01  DL-DETAIL-LINE-24C.                                          07970001
079200     05  FILLER                       PIC X(46) VALUE             07980001
079300          'GROSS RETAIL VARIANCE OVER/SHORT VERIFIED    '.        07990001
079400     05  FILLER                       PIC X(11) VALUE SPACES.     08000001
079500     05  DL24C-VARIANCE-OVR-SHRT-MM   PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    08010001
079600     05  FILLER                       PIC X(23) VALUE SPACES.     08020001
079700     05  DL24C-VARIANCE-OVR-SHRT-YTD  PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.    08030001
079800     05  FILLER                       PIC X(01) VALUE SPACES.     08040001
079900                                                                  08050001
080000 01  DL-DETAIL-LINE-25.                                           08060001
080100     05  FILLER                       PIC X(44) VALUE             08070001
080200          'NUMBER OF RECEIVERS WITH CARTON OVERAGE    '.          08080001
080300     05  FILLER                       PIC X(16) VALUE SPACES.     08090001
080400     05  DL25-RCVR-CRTN-OVR-MONTH     PIC ZZZ,ZZZ,ZZZ,ZZ9.        08100001
080500     05  FILLER                       PIC X(03)  VALUE            08110001
080600      '  ('.                                                      08120001
080700     05  DL25-PERCENT-MONTH           PIC ZZZ.Z.                  08130001
080800     05  FILLER                       PIC X(01)  VALUE            08140001
080900      ')'.                                                        08150001
081000     05  FILLER                       PIC X(18) VALUE SPACES.     08160001
081100     05  DL25-RCVR-CRTN-OVR-YTD       PIC ZZZ,ZZZ,ZZZ,ZZ9.        08170001
081200     05  FILLER                       PIC X(03)  VALUE            08180001
081300      '  ('.                                                      08190001
081400     05  DL25-PERCENT-YTD             PIC ZZZ.Z.                  08200001
081500     05  FILLER                       PIC X(01)  VALUE            08210001
081600      ')'.                                                        08220001
081700     05  FILLER                       PIC X(01) VALUE SPACES.     08230001
081800                                                                  08240001
081900 01  DL-DETAIL-LINE-26.                                           08250001
082000     05  FILLER                       PIC X(44) VALUE             08260001
082100          'NUMBER OF RECEIVERS WITH CARTON SHORTAGE   '.          08270001
082200     05  FILLER                       PIC X(16) VALUE SPACES.     08280001
082300     05  DL26-RCVR-CRTN-SHRT-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        08290001
082400     05  FILLER                       PIC X(03)  VALUE            08300001
082500      '  ('.                                                      08310001
082600     05  DL26-PERCENT-MONTH           PIC ZZZ.Z.                  08320001
082700     05  FILLER                       PIC X(01)  VALUE            08330001
082800      ')'.                                                        08340001
082900     05  FILLER                       PIC X(18) VALUE SPACES.     08350001
083000     05  DL26-RCVR-CRTN-SHRT-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        08360001
083100     05  FILLER                       PIC X(03)  VALUE            08370001
083200      '  ('.                                                      08380001
083300     05  DL26-PERCENT-YTD             PIC ZZZ.Z.                  08390001
083400     05  FILLER                       PIC X(01)  VALUE            08400001
083500      ')'.                                                        08410001
083600     05  FILLER                       PIC X(01) VALUE SPACES.     08420001
083700                                                                  08430001
083800 01  DL-DETAIL-LINE-27.                                           08440001
083900     05  FILLER                       PIC X(46) VALUE             08450001
084000          'NUMBER OF RECEIVERS WITHOUT CARTON DIFFERENCE'.        08460001
084100     05  FILLER                       PIC X(14) VALUE SPACES.     08470001
084200     05  DL27-RCVR-CRTN-NO-DIFF-MONTH PIC ZZZ,ZZZ,ZZZ,ZZ9.        08480001
084300     05  FILLER                       PIC X(03)  VALUE            08490001
084400      '  ('.                                                      08500001
084500     05  DL27-PERCENT-MONTH           PIC ZZZ.Z.                  08510001
084600     05  FILLER                       PIC X(01)  VALUE            08520001
084700      ')'.                                                        08530001
084800     05  FILLER                       PIC X(18) VALUE SPACES.     08540001
084900     05  DL27-RCVR-CRTN-NO-DIFF-YTD   PIC ZZZ,ZZZ,ZZZ,ZZ9.        08550001
085000     05  FILLER                       PIC X(03)  VALUE            08560001
085100      '  ('.                                                      08570001
085200     05  DL27-PERCENT-YTD             PIC ZZZ.Z.                  08580001
085300     05  FILLER                       PIC X(01)  VALUE            08590001
085400      ')'.                                                        08600001
085500     05  FILLER                       PIC X(01) VALUE SPACES.     08610001
085600                                                                  08620001
085700 01  DL-DETAIL-LINE-28.                                           08630001
085800     05  FILLER                       PIC X(44) VALUE             08640001
085900          'NUMBER OF RECEIVERS WITH UNIT OVERAGE      '.          08650001
086000     05  FILLER                       PIC X(16) VALUE SPACES.     08660001
086100     05  DL28-RCVR-UNIT-OVR-MONTH     PIC ZZZ,ZZZ,ZZZ,ZZ9.        08670001
086200     05  FILLER                       PIC X(03)  VALUE            08680001
086300      '  ('.                                                      08690001
086400     05  DL28-PERCENT-MONTH           PIC ZZZ.Z.                  08700001
086500     05  FILLER                       PIC X(01)  VALUE            08710001
086600      ')'.                                                        08720001
086700     05  FILLER                       PIC X(18) VALUE SPACES.     08730001
086800     05  DL28-RCVR-UNIT-OVR-YTD       PIC ZZZ,ZZZ,ZZZ,ZZ9.        08740001
086900     05  FILLER                       PIC X(03)  VALUE            08750001
087000      '  ('.                                                      08760001
087100     05  DL28-PERCENT-YTD             PIC ZZZ.Z.                  08770001
087200     05  FILLER                       PIC X(01)  VALUE            08780001
087300      ')'.                                                        08790001
087400     05  FILLER                       PIC X(01) VALUE SPACES.     08800001
087500                                                                  08810001
087600 01  DL-DETAIL-LINE-29.                                           08820001
087700     05  FILLER                       PIC X(44) VALUE             08830001
087800          'NUMBER OF RECEIVERS WITH UNIT SHORTAGE     '.          08840001
087900     05  FILLER                       PIC X(16) VALUE SPACES.     08850001
088000     05  DL29-RCVR-UNIT-SHRT-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        08860001
088100     05  FILLER                       PIC X(03)  VALUE            08870001
088200      '  ('.                                                      08880001
088300     05  DL29-PERCENT-MONTH           PIC ZZZ.Z.                  08890001
088400     05  FILLER                       PIC X(01)  VALUE            08900001
088500      ')'.                                                        08910001
088600     05  FILLER                       PIC X(18) VALUE SPACES.     08920001
088700     05  DL29-RCVR-UNIT-SHRT-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        08930001
088800     05  FILLER                       PIC X(03)  VALUE            08940001
088900      '  ('.                                                      08950001
089000     05  DL29-PERCENT-YTD             PIC ZZZ.Z.                  08960001
089100     05  FILLER                       PIC X(01)  VALUE            08970001
089200      ')'.                                                        08980001
089300     05  FILLER                       PIC X(01) VALUE SPACES.     08990001
089400                                                                  09000001
089500 01  DL-DETAIL-LINE-30.                                           09010001
089600     05  FILLER                       PIC X(44) VALUE             09020001
089700          'NUMBER OF RECEIVERS WITHOUT UNIT DIFFERENCE '.         09030001
089800     05  FILLER                       PIC X(16) VALUE SPACES.     09040001
089900     05  DL30-RCVR-UNIT-NO-DIFF-MONTH PIC ZZZ,ZZZ,ZZZ,ZZ9.        09050001
090000     05  FILLER                       PIC X(03)  VALUE            09060001
090100      '  ('.                                                      09070001
090200     05  DL30-PERCENT-MONTH           PIC ZZZ.Z.                  09080001
090300     05  FILLER                       PIC X(01)  VALUE            09090001
090400      ')'.                                                        09100001
090500     05  FILLER                       PIC X(18) VALUE SPACES.     09110001
090600     05  DL30-RCVR-UNIT-NO-DIFF-YTD   PIC ZZZ,ZZZ,ZZZ,ZZ9.        09120001
090700     05  FILLER                       PIC X(03)  VALUE            09130001
090800      '  ('.                                                      09140001
090900     05  DL30-PERCENT-YTD             PIC ZZZ.Z.                  09150001
091000     05  FILLER                       PIC X(01)  VALUE            09160001
091100      ')'.                                                        09170001
091200     05  FILLER                       PIC X(01) VALUE SPACES.     09180001
091300                                                                  09190001
091400 01  DL-DETAIL-LINE-31.                                           09200001
091500     05  FILLER                       PIC X(44) VALUE             09210001
091600          'NUMBER OF RECEIVERS WITH EXT RETAIL OVERAGE '.         09220001
091700     05  FILLER                       PIC X(16) VALUE SPACES.     09230001
091800     05  DL31-RCVR-EXTRTL-OVR-MONTH   PIC ZZZ,ZZZ,ZZZ,ZZ9.        09240001
091900     05  FILLER                       PIC X(03)  VALUE            09250001
092000      '  ('.                                                      09260001
092100     05  DL31-PERCENT-MONTH           PIC ZZZ.Z.                  09270001
092200     05  FILLER                       PIC X(01)  VALUE            09280001
092300      ')'.                                                        09290001
092400     05  FILLER                       PIC X(18) VALUE SPACES.     09300001
092500     05  DL31-RCVR-EXTRTL-OVR-YTD     PIC ZZZ,ZZZ,ZZZ,ZZ9.        09310001
092600     05  FILLER                       PIC X(03)  VALUE            09320001
092700      '  ('.                                                      09330001
092800     05  DL31-PERCENT-YTD             PIC ZZZ.Z.                  09340001
092900     05  FILLER                       PIC X(01)  VALUE            09350001
093000      ')'.                                                        09360001
093100     05  FILLER                       PIC X(01) VALUE SPACES.     09370001
093200                                                                  09380001
093300 01  DL-DETAIL-LINE-32.                                           09390001
093400     05  FILLER                       PIC X(44) VALUE             09400001
093500          'NUMBER OF RECEIVERS WITH EXT RETAIL SHORTAGE'.         09410001
093600     05  FILLER                       PIC X(16) VALUE SPACES.     09420001
093700     05  DL32-RCVR-EXTRTL-SHRT-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZ9.        09430001
093800     05  FILLER                       PIC X(03)  VALUE            09440001
093900      '  ('.                                                      09450001
094000     05  DL32-PERCENT-MONTH           PIC ZZZ.Z.                  09460001
094100     05  FILLER                       PIC X(01)  VALUE            09470001
094200      ')'.                                                        09480001
094300     05  FILLER                       PIC X(18) VALUE SPACES.     09490001
094400     05  DL32-RCVR-EXTRTL-SHRT-YTD    PIC ZZZ,ZZZ,ZZZ,ZZ9.        09500001
094500     05  FILLER                       PIC X(03)  VALUE            09510001
094600      '  ('.                                                      09520001
094700     05  DL32-PERCENT-YTD             PIC ZZZ.Z.                  09530001
094800     05  FILLER                       PIC X(01)  VALUE            09540001
094900      ')'.                                                        09550001
095000     05  FILLER                       PIC X(01) VALUE SPACES.     09560001
095100                                                                  09570001
095200 01  DL-DETAIL-LINE-33.                                           09580001
095300     05  FILLER                       PIC X(49) VALUE             09590001
095400          'NUMBER OF RECEIVERS WITHOUT EXT RETAIL DIFFERENCE'.    09600001
095500     05  FILLER                       PIC X(11) VALUE SPACES.     09610001
095600     05  DL33-RCVR-EXTRTL-NO-DIFF-MONTH                           09620001
095700                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        09630001
095800     05  FILLER                       PIC X(03)  VALUE            09640001
095900      '  ('.                                                      09650001
096000     05  DL33-PERCENT-MONTH           PIC ZZZ.Z.                  09660001
096100     05  FILLER                       PIC X(01)  VALUE            09670001
096200      ')'.                                                        09680001
096300     05  FILLER                       PIC X(18) VALUE SPACES.     09690001
096400     05  DL33-RCVR-EXTRTL-NO-DIFF-YTD                             09700001
096500                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        09710001
096600     05  FILLER                       PIC X(03)  VALUE            09720001
096700      '  ('.                                                      09730001
096800     05  DL33-PERCENT-YTD             PIC ZZZ.Z.                  09740001
096900     05  FILLER                       PIC X(01)  VALUE            09750001
097000      ')'.                                                        09760001
097100     05  FILLER                       PIC X(01) VALUE SPACES.     09770001
097200                                                                  09780001
097300 01  DL-DETAIL-LINE-34.                                           09790001
097400     05  FILLER                       PIC X(44) VALUE             09800001
097500          'NUMBER OF LINES WITH UNIT OVERAGE           '.         09810001
097600     05  FILLER                       PIC X(16) VALUE SPACES.     09820001
097700     05  DL34-LINES-UNIT-OVR-MONTH    PIC ZZZ,ZZZ,ZZZ,ZZ9.        09830001
097800     05  FILLER                       PIC X(03)  VALUE            09840001
097900      '  ('.                                                      09850001
098000     05  DL34-PERCENT-MONTH           PIC ZZZ.Z.                  09860001
098100     05  FILLER                       PIC X(01)  VALUE            09870001
098200      ')'.                                                        09880001
098300     05  FILLER                       PIC X(18) VALUE SPACES.     09890001
098400     05  DL34-LINES-UNIT-OVR-YTD      PIC ZZZ,ZZZ,ZZZ,ZZ9.        09900001
098500     05  FILLER                       PIC X(03)  VALUE            09910001
098600      '  ('.                                                      09920001
098700     05  DL34-PERCENT-YTD             PIC ZZZ.Z.                  09930001
098800     05  FILLER                       PIC X(01)  VALUE            09940001
098900      ')'.                                                        09950001
099000     05  FILLER                       PIC X(01) VALUE SPACES.     09960001
099100                                                                  09970001
099200 01  DL-DETAIL-LINE-35.                                           09980001
099300     05  FILLER                       PIC X(44) VALUE             09990001
099400          'NUMBER OF LINES WITH UNIT SHORTAGE          '.         10000001
099500     05  FILLER                       PIC X(16) VALUE SPACES.     10010001
099600     05  DL35-LINES-UNIT-SHRT-MONTH   PIC ZZZ,ZZZ,ZZZ,ZZ9.        10020001
099700     05  FILLER                       PIC X(03)  VALUE            10030001
099800      '  ('.                                                      10040001
099900     05  DL35-PERCENT-MONTH           PIC ZZZ.Z.                  10050001
100000     05  FILLER                       PIC X(01)  VALUE            10060001
100100      ')'.                                                        10070001
100200     05  FILLER                       PIC X(18) VALUE SPACES.     10080001
100300     05  DL35-LINES-UNIT-SHRT-YTD     PIC ZZZ,ZZZ,ZZZ,ZZ9.        10090001
100400     05  FILLER                       PIC X(03)  VALUE            10100001
100500      '  ('.                                                      10110001
100600     05  DL35-PERCENT-YTD             PIC ZZZ.Z.                  10120001
100700     05  FILLER                       PIC X(01)  VALUE            10130001
100800      ')'.                                                        10140001
100900     05  FILLER                       PIC X(01) VALUE SPACES.     10150001
101000                                                                  10160001
101100 01  DL-DETAIL-LINE-36.                                           10170001
101200     05  FILLER                       PIC X(44) VALUE             10180001
101300          'NUMBER OF LINES WITHOUT UNIT DIFFERENCE     '.         10190001
101400     05  FILLER                       PIC X(16) VALUE SPACES.     10200001
101500     05  DL36-LINES-UNIT-NO-DIFF-MONTH                            10210001
101600                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10220001
101700     05  FILLER                       PIC X(03)  VALUE            10230001
101800      '  ('.                                                      10240001
101900     05  DL36-PERCENT-MONTH           PIC ZZZ.Z.                  10250001
102000     05  FILLER                       PIC X(01)  VALUE            10260001
102100      ')'.                                                        10270001
102200     05  FILLER                       PIC X(18) VALUE SPACES.     10280001
102300     05  DL36-LINES-UNIT-NO-DIFF-YTD                              10290001
102400                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10300001
102500     05  FILLER                       PIC X(03)  VALUE            10310001
102600      '  ('.                                                      10320001
102700     05  DL36-PERCENT-YTD             PIC ZZZ.Z.                  10330001
102800     05  FILLER                       PIC X(01)  VALUE            10340001
102900      ')'.                                                        10350001
103000     05  FILLER                       PIC X(01) VALUE SPACES.     10360001
103100                                                                  10370001
103200 01  DL-DETAIL-LINE-37.                                           10380001
103300     05  FILLER                       PIC X(44) VALUE             10390001
103400          'NUMBER OF LINES WITH EXT RETAIL OVERAGE     '.         10400001
103500     05  FILLER                       PIC X(16) VALUE SPACES.     10410001
103600     05  DL37-LINES-EXTRTL-OVR-MONTH  PIC ZZZ,ZZZ,ZZZ,ZZ9.        10420001
103700     05  FILLER                       PIC X(03)  VALUE            10430001
103800      '  ('.                                                      10440001
103900     05  DL37-PERCENT-MONTH           PIC ZZZ.Z.                  10450001
104000     05  FILLER                       PIC X(01)  VALUE            10460001
104100      ')'.                                                        10470001
104200     05  FILLER                       PIC X(18) VALUE SPACES.     10480001
104300     05  DL37-LINES-EXTRTL-OVR-YTD    PIC ZZZ,ZZZ,ZZZ,ZZ9.        10490001
104400     05  FILLER                       PIC X(03)  VALUE            10500001
104500      '  ('.                                                      10510001
104600     05  DL37-PERCENT-YTD             PIC ZZZ.Z.                  10520001
104700     05  FILLER                       PIC X(01)  VALUE            10530001
104800      ')'.                                                        10540001
104900     05  FILLER                       PIC X(01) VALUE SPACES.     10550001
105000                                                                  10560001
105100 01  DL-DETAIL-LINE-38.                                           10570001
105200     05  FILLER                       PIC X(44) VALUE             10580001
105300          'NUMBER OF LINES WITH EXT RETAIL SHORTAGE    '.         10590001
105400     05  FILLER                       PIC X(16) VALUE SPACES.     10600001
105500     05  DL38-LINES-EXTRTL-SHRT-MONTH                             10610001
105600                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10620001
105700     05  FILLER                       PIC X(03)  VALUE            10630001
105800      '  ('.                                                      10640001
105900     05  DL38-PERCENT-MONTH           PIC ZZZ.Z.                  10650001
106000     05  FILLER                       PIC X(01)  VALUE            10660001
106100      ')'.                                                        10670001
106200     05  FILLER                       PIC X(18) VALUE SPACES.     10680001
106300     05  DL38-LINES-EXTRTL-SHRT-YTD                               10690001
106400                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10700001
106500     05  FILLER                       PIC X(03)  VALUE            10710001
106600      '  ('.                                                      10720001
106700     05  DL38-PERCENT-YTD             PIC ZZZ.Z.                  10730001
106800     05  FILLER                       PIC X(01)  VALUE            10740001
106900      ')'.                                                        10750001
107000     05  FILLER                       PIC X(01) VALUE SPACES.     10760001
107100                                                                  10770001
107200 01  DL-DETAIL-LINE-39.                                           10780001
107300     05  FILLER                       PIC X(48) VALUE             10790001
107400          'NUMBER OF LINES WITHOUT EXT RETAIL DIFFERENCE   '.     10800001
107500     05  FILLER                       PIC X(12) VALUE SPACES.     10810001
107600     05  DL39-LINES-NO-DIFF-MONTH                                 10820001
107700                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10830001
107800     05  FILLER                       PIC X(03)  VALUE            10840001
107900      '  ('.                                                      10850001
108000     05  DL39-PERCENT-MONTH           PIC ZZZ.Z.                  10860001
108100     05  FILLER                       PIC X(01)  VALUE            10870001
108200      ')'.                                                        10880001
108300     05  FILLER                       PIC X(18) VALUE SPACES.     10890001
108400     05  DL39-LINES-NO-DIFF-YTD                                   10900001
108500                                      PIC ZZZ,ZZZ,ZZZ,ZZ9.        10910001
108600     05  FILLER                       PIC X(03)  VALUE            10920001
108700      '  ('.                                                      10930001
108800     05  DL39-PERCENT-YTD             PIC ZZZ.Z.                  10940001
108900     05  FILLER                       PIC X(01)  VALUE            10950001
109000      ')'.                                                        10960001
109100     05  FILLER                       PIC X(01) VALUE SPACES.     10970001
109200                                                                  10980001
109300******************************************************************10990001
109400 01  TL1-NOTE-LINE.                                               11000001
109500     05  FILLER                       PIC X(10) VALUE             11010001
109600          '** NOTE **'.                                           11020001
109700     05  FILLER                       PIC X(50) VALUE             11030001
109800          '  ON THE ABOVE LINES DISPLAYING OVERAGE, SHORTAGE,'.   11040001
109900     05  FILLER                       PIC X(51) VALUE             11050001
110000          ' AND DIFFERENCE INFORMATION, THESE ARE BASED ON THE'.  11060001
110100     05  FILLER                       PIC X(31) VALUE             11070001
110200          ' EXPECTED                     '.                       11080001
110300                                                                  11090001
110400 01  TL2-NOTE-LINE.                                               11100001
110500     05  FILLER                       PIC X(12) VALUE SPACES.     11110001
110600     05  FILLER                       PIC X(52) VALUE             11120001
110700          'INFORMATION AND THE FINAL VERIFY INFORMATION (FINAL,'. 11130001
110800     05  FILLER                       PIC X(52) VALUE             11140001
110900          ' VERIFY MINUS EXPECTED VERIFY).  THE PERCENTAGE THAT'. 11150001
111000     05  FILLER                       PIC X(28) VALUE             11160001
111100          ' FOLLOWS                   '.                          11170001
111200                                                                  11180001
111300 01  TL3-NOTE-LINE.                                               11190001
111400     05  FILLER                       PIC X(12) VALUE SPACES.     11200001
111500     05  FILLER                       PIC X(52) VALUE             11210001
111600          'IS THE PERCENT OF DIFFERENCE TO THE EXPECTED INFORMA'. 11220001
111700     05  FILLER                       PIC X(52) VALUE             11230001
111800          'TION OR PERCENT OF DIFFERENCE BETWEEN FINAL AND INIT'. 11240001
111900     05  FILLER                       PIC X(28) VALUE             11250001
112000          'IAL VERIFIES.              '.                          11260001
112100                                                                  11270001
112200 01  TL4-NOTE-LINE.                                               11280001
112300     05  FILLER                       PIC X(12) VALUE SPACES.     11290001
112400     05  FILLER                       PIC X(52) VALUE             11300001
112500          'THE OTHER PERCENTAGES (LIKE BY RECEIVER TYPE, NUMBER'. 11310001
112600     05  FILLER                       PIC X(52) VALUE             11320001
112700          ' OF RECEIVERS WITH THE VARIOUS SHORTAGES, OVERAGES O'. 11330001
112800     05  FILLER                       PIC X(28) VALUE             11340001
112900          'R WITHOUT                  '.                          11350001
113000                                                                  11360001
113100 01  TL5-NOTE-LINE.                                               11370001
113200     05  FILLER                       PIC X(12) VALUE SPACES.     11380001
113300     05  FILLER                       PIC X(52) VALUE             11390001
113400          'SHORT/OVER, ETC...) ARE PERCENT TO TOTALS.          '. 11400001
113500     05  FILLER                       PIC X(52) VALUE             11410001
113600          '                                                    '. 11420001
113700     05  FILLER                       PIC X(28) VALUE             11430001
113800          '                           '.                          11440001
113900                                                                  11450001
114000 01  ER-END-OF-REPORT-LINE.                                       11460001
114100     05  FILLER                       PIC X(19)  VALUE            11470001
114200         '** END OF REPORT **'.                                   11480001
114300     05  FILLER                       PIC X(113)  VALUE SPACES.   11490001
114400                                                                  11500001
114500 01  EP-EMPTY-REPORT-LINE.                                        11510001
114600     05  FILLER                       PIC X(34)  VALUE SPACES.    11520001
114700     05  FILLER                       PIC X(52)  VALUE            11530001
114800      '*************** EMPTY INPUT FILE *******************'.     11540001
114900     05  FILLER                       PIC X(49)  VALUE SPACES.    11550001
115000                                                                  11560001
115100 01  DL-BLANK-LINE                    PIC X(132) VALUE SPACES.    11570001
115200                                                                  11580001
115300 01  EL1-ERROR-LINE-1P.                                           11590001
115400     05  FILLER                      PIC  X(02)     VALUE SPACES. 11600001
115500     05  FILLER                      PIC  X(48)     VALUE         11610001
115600         'A PROBLEM WAS ENCOUNTERED DURING THE PROCESS OF '.      11620001
115700     05  FILLER                      PIC  X(49)     VALUE         11630001
115800         'CREATING YOUR REPORT.   THIS REPORT COULD NOT BE '.     11640001
115900     05  FILLER                      PIC  X(33)     VALUE         11650001
116000         'COMPLETED.                       '.                     11660001
116100                                                                  11670001
116200 01  EL2-ERROR-LINE-2F.                                           11680001
116300     05  FILLER                      PIC  X(02)     VALUE SPACES. 11690001
116400     05  FILLER                      PIC  X(36)     VALUE         11700001
116500         'NONE OF YOUR REPORTS WERE CREATED.  '.                  11710001
116600     05  FILLER                      PIC  X(36)     VALUE         11720001
116700         'PLEASE RE-SUBMIT YOUR REQUEST AGAIN.'.                  11730001
116800     05  FILLER                      PIC  X(58)     VALUE SPACES. 11740001
116900                                                                  11750001
117000 01  EL3-ERROR-LINE-3.                                            11760001
117100     05  FILLER                      PIC  X(02)     VALUE SPACES. 11770001
117200     05  FILLER                      PIC  X(50)     VALUE         11780001
117300         'YOUR REQUEST WAS AS FOLLOWS:                      '.    11790001
117400     05  FILLER                      PIC  X(81)     VALUE SPACES. 11800001
117500                                                                  11810001
117600 01  EL4-ERROR-LINE-4.                                            11820001
117700     05  FILLER                      PIC  X(02)     VALUE SPACES. 11830001
117800     05  FILLER                      PIC  X(18)     VALUE         11840001
117900         'REQUESTOR       : '.                                    11850001
118000     05  EL4-REQUESTOR-ID            PIC  X(10)     VALUE SPACES. 11860001
118100     05  FILLER                      PIC  X(07)     VALUE SPACES. 11870001
118200     05  FILLER                      PIC  X(21)     VALUE         11880001
118300         'PRINTER DESTINATION: '.                                 11890001
118400     05  EL4-PRINTER-ID              PIC  X(10)     VALUE SPACES. 11900001
118500     05  FILLER                      PIC  X(65)     VALUE SPACES. 11910001
118600                                                                  11920001
118700 01  EL5-ERROR-LINE-5B.                                           11930001
118800     05  FILLER                      PIC  X(02)     VALUE SPACES. 11940001
118900     05  FILLER                      PIC  X(18)     VALUE         11950001
119000         'START DATE RANGE: '.                                    11960001
119100     05  EL5-START-DATE-RANGE        PIC  X(10).                  11970001
119200     05  FILLER                      PIC  X(07)     VALUE SPACES. 11980001
119300     05  FILLER                      PIC  X(21)     VALUE         11990001
119400         'END DATE RANGE     : '.                                 12000001
119500     05  EL5-END-DATE-RANGE          PIC  X(10).                  12010001
119600     05  FILLER                      PIC  X(20)     VALUE SPACES. 12020001
119700/                                                                 12030001
119800******************************************************************12040001
119900*  COPYBOOK USED BY MBS SYSTEM                                    12050001
120000******************************************************************12060001
120100     COPY DPWS003.                                                12070001
120200*                                                                 12080001
120300******************************************************************12090001
120400*  WORKING STORAGE AREA FOR NAME REFORMAT DPPD024                 12100001
120500******************************************************************12110001
120600     COPY DPWS024.                                                12120018
120700/                                                                 12130001
120800******************************************************************12140001
120900*  DB2 FORMATTED MESSAGE AREA                                     12150001
121000******************************************************************12160001
121100     COPY DPWS004.                                                12170001
121200/                                                                 12180001
121300******************************************************************12190001
121400* CORPORATE DATE ROUTINES                                         12200001
121500******************************************************************12210001
121600     COPY DPWS500.                                                12220001
121700/                                                                 12230001
121800******************************************************************12240001
121900*  RECORD LAYOUT FOR INPUT FILE                                   12250001
122000******************************************************************12260001
122100     COPY RCRD063.                                                12270013
122200/                                                                 12280001
122300******************************************************************12290001
122400*   DB2 SQL COMMUNICATION AREA                                    12300001
122500******************************************************************12310001
122600     EXEC SQL                                                     12320001
122700         INCLUDE SQLCA                                            12330001
122800     END-EXEC.                                                    12340001
122900*                                                                 12350001
123000     COPY SQLCA2.                                                 12360001
123100*                                                                 12370001
123800/                                                                 12380001
123900****************************************************************  12390001
124000*  DATE TABLE.                                                    12400001
124100****************************************************************  12410001
124200     EXEC SQL                                                     12420001
124300         INCLUDE TDTATTR                                          12430001
124400     END-EXEC.                                                    12440001
124500/                                                                 12450001
124600******************************************************************12460001
124700*  COBOL DECLARATION AND DCLGEN MEMBER FOR THE COMPANY CONTROL    12470001
124800*  TABLE                                                          12480001
124900******************************************************************12490001
125000     EXEC SQL                                                     12500001
125100          INCLUDE TCOCNTL                                         12510001
125200     END-EXEC.                                                    12520001
125300*                                                                 12530001
125310******************************************************************12540012
125320*  COBOL DECLARATION AND DCLGEN MEMBER FOR THE PARM TABLE         12550012
125340******************************************************************12560012
125350     EXEC SQL                                                     12570012
125360          INCLUDE TKRPRPM                                         12580012
125370     END-EXEC.                                                    12590012
125380*                                                                 12600012
125400******************************************************************12610001
125500 PROCEDURE DIVISION.                                              12620001
125600******************************************************************12630001
125700 0000-MAINLINE.                                                   12640001
125800                                                                  12650001
125900     ACCEPT CC-CONTROL-CARD FROM SYSIN.                           12660001
126000     PERFORM 1100-VALIDATE-CONTROL-CARD.                          12670001
126100                                                                  12680001
126200     OPEN INPUT  EXTRACT-FILE-1                                   12690001
126400     OPEN OUTPUT REPORT-FILE                                      12700001
126500                                                                  12710001
126600     PERFORM 2100-READ-EXTRACT-1                                  12720001
126610     IF PS-END-OF-INPUT                                           12730016
126620        PERFORM 1150-NO-DATA-ON-INPUT                             12740016
126630     END-IF                                                       12750016
126700     PERFORM 1000-INITIALIZE                                      12760001
126800     PERFORM 2000-PROCESS-EXTRACT                                 12770013
126900         UNTIL PS-END-OF-INPUT                                    12780001
128600     PERFORM 9000-EOJ.                                            12790001
128700                                                                  12800001
128800     GOBACK.                                                      12810001
128900                                                                  12820001
129000******************************************************************12830001
129100 1000-INITIALIZE.                                                 12840001
129200******************************************************************12850001
129300*                                                                 12860001
129400* LOAD SYSTEM DATE INTO HEADINGS                                  12870001
129500     ACCEPT SD-SYSTEM-DATE FROM DATE.                             12880001
129600     ACCEPT ST-SYSTEM-TIME FROM TIME.                             12890001
129700                                                                  12900001
129800     MOVE SD-SYSTEM-DATE-YY      TO DP132O-RUN-YEAR.              12910001
129900     MOVE SD-SYSTEM-DATE-MM      TO DP132O-RUN-MONTH.             12920001
130000     MOVE SD-SYSTEM-DATE-DD      TO DP132O-RUN-DAY.               12930001
130100     MOVE ST-SYSTEM-HOUR         TO DP132O-RUN-HOUR.              12940001
130200     MOVE ST-SYSTEM-MINUTE       TO DP132O-RUN-MINUTE.            12950001
130300                                                                  12960001
130400     MOVE PC-CURRENT-PROGRAM-NAME                                 12970001
130500                                 TO DP132O-PROGRAM-NAME.          12980001
130600     MOVE 1                      TO DP132O-REPORT-NUMBER          12990001
130700                                    DP132O-PAGE-NUMBER.           13000001
130800                                                                  13010001
130900     MOVE RC063-FISCAL-YYYY        TO HL2-YEAR                    13020012
131000                                      PV-FISCAL-YEAR.             13030012
131100     MOVE RC063-FISCAL-MM          TO PV-FISCAL-MONTH.            13040012
131200     MOVE RC063-RPT-MONTH-END-DATE TO PV-KEY-DATE.                13050012
131210     MOVE RPT-MONTH-END-MM         TO HL2-MM.                     13060012
131220     MOVE RPT-MONTH-END-DD         TO HL2-DD.                     13070012
131230     MOVE RPT-MONTH-END-YYYY       TO HL2-YYYY.                   13080012
131300                                                                  13090012
131400     MOVE PV-ENT-ID                TO PV-PREV-ENT-ID.             13100012
131500     MOVE PV-ENT-NAME              TO PV-PREV-ENT-NAME.           13110012
131510     MOVE PV-P12MN-SLSRNK-NBR      TO PV-PREV-P12MN-SLSRNK-NBR.   13120012
131511     MOVE PV-PARM-P12MN-SLSRNK-NBR TO HL3-TOP-RANK.               13130016
131520                                                                  13140012
131530     DISPLAY '** FISCAL YEAR = ' PV-FISCAL-YEAR.                  13150012
131540     DISPLAY '** FISCAL MONTH = ' PV-FISCAL-MONTH.                13160012
131550     DISPLAY '** END DATE = ' PV-KEY-DATE.                        13170012
131560                                                                  13180012
131600*                                                                 13190001
131700******************************************************************13200001
131800* IF VALUE IS NOT O,S,G, ABEND PROGRAM WITH INVALID CONTROL CARD  13210012
131810*  MESSAGE.                                                       13220012
131900******************************************************************13230001
132000 1100-VALIDATE-CONTROL-CARD.                                      13240001
132100                                                                  13250001
132200     IF  CC-CONSTANT = 'CONTROL'                                  13260001
132300        CONTINUE                                                  13270012
132400     ELSE                                                         13280001
132500         DISPLAY '** ABEND **'                                    13290001
132600         DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME     13300013
132700         DISPLAY '** PARAGRAPH ** =  1100-VALIDATE-CONTROL-CARD'  13310013
132800         DISPLAY '** CONTROL CONSTANT INVALID'                    13320001
132900         DISPLAY '** CONTROL CONSTANT = ' CC-CONSTANT             13330013
133000         DISPLAY '** CHANGE TO CONTROL'                           13340001
133100         MOVE +4003              TO PV-ABEND-CODE                 13350013
133200         CALL 'ILBOABN0' USING PV-ABEND-CODE                      13360001
133300     END-IF.                                                      13370001
133400                                                                  13380001
133410     EVALUATE TRUE                                                13390002
133420         WHEN CC-SEQUENCE-OVERAGE                                 13400002
133421              MOVE 'VND#OR'     TO PV-RPT-TYP-PARM                13410002
133422              MOVE 'YTD OVERAGE RETAIL $ SEQUENCE '               13420012
133423                                       TO HL1-RPT-VERSION         13430012
133430         WHEN CC-SEQUENCE-SHORTAGE                                13440002
133431              MOVE 'VND#SR'     TO PV-RPT-TYP-PARM                13450002
133432              MOVE 'YTD SHORTAGE RETAIL $ SEQUENCE '              13460012
133433                                       TO HL1-RPT-VERSION         13470012
133440         WHEN CC-SEQUENCE-GROSS                                   13480002
133450              MOVE 'VND#GR'     TO PV-RPT-TYP-PARM                13490002
133451              MOVE 'YTD GROSS RETAIL $ SEQUENCE '                 13500012
133452                                       TO HL1-RPT-VERSION         13510012
133460         WHEN OTHER                                               13520002
133462            DISPLAY '** ABEND **'                                 13530013
133463            DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME  13540013
133464           DISPLAY '** PARAGRAPH ** = 1100-VALIDATE-CONTROL-CARD' 13550013
133465            DISPLAY '** CONTROL VARIABLE INVALID'                 13560013
133466            DISPLAY '** CONTROL VARIABLE = ' CC-SEQUENCE-IND      13570013
133467            DISPLAY '** CHECK VALUE OF VARIABLE'                  13580013
133468            MOVE +4003              TO PV-ABEND-CODE              13590013
133469            CALL 'ILBOABN0' USING PV-ABEND-CODE                   13600013
133470     END-EVALUATE.                                                13610002
133480                                                                  13620002
133600     PERFORM 1250-SELECT-TKRPRPM.                                 13630002
134900                                                                  13640001
135000/                                                                 13650001
135001***************************************************************** 13660016
135002 1150-NO-DATA-ON-INPUT.                                           13670016
135003***************************************************************** 13680016
135010/                                                                 13690016
135100     DISPLAY '** ABEND **'                                        13700016
135200     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME         13710016
135300     DISPLAY '** PARAGRAPH ** =  1150-NO-DATA-ON-INPUT'           13720016
135400     DISPLAY '** NO DATA ON INPUT FILE   '                        13730016
135600     DISPLAY '** CHECK INPUT FILE '                               13740016
135700     MOVE +4003              TO PV-ABEND-CODE.                    13750016
135800     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         13760016
135900/                                                                 13770016
141201***************************************************************** 13780002
141210 1250-SELECT-TKRPRPM.                                             13790002
141211***************************************************************** 13800002
141220     MOVE '1250-SELECT-TKRPRPM'                                   13810002
141230         TO PV-ABEND-PARAGRAPH.                                   13820002
141240     MOVE 'SELECT TOP NUMBER OF VENDORS TO INCLUDE ON REPORT'     13830002
141250         TO PV-DB2-OPERATION-MESSAGE-1.                           13840013
141260                                                                  13850002
141270     INITIALIZE DCLTKRPRPM.                                       13860002
141280                                                                  13870002
141290     EXEC SQL                                                     13880002
141291         SELECT  FUNC_QTY                                         13890002
141292           INTO  :KRPRPM-FUNC-QTY                                 13900002
141293           FROM  TKRPRPM                                          13910002
141294          WHERE  LOC_ID           = 90                            13920002
141295            AND  INTFC_SYS_CDE    = 'KHL'                         13930002
141296            AND  SYS_PRC_FUNC_CDE = :PV-RPT-TYP-PARM              13940013
141298     END-EXEC.                                                    13950002
141299                                                                  13960002
141300     EVALUATE TRUE                                                13970002
141301         WHEN SQLCODE = ZERO                                      13980002
141302              MOVE KRPRPM-FUNC-QTY TO PV-PARM-P12MN-SLSRNK-NBR    13990012
141304         WHEN SQLCODE = +100                                      14000002
141305         WHEN SQLWARN0 NOT = SPACE                                14010002
141306         WHEN SQLCODE < ZERO                                      14020002
141307         WHEN SQLCODE > ZERO                                      14030002
141308             PERFORM 9200-SQL-ABEND                               14040013
141309     END-EVALUATE.                                                14050002
141310                                                                  14060002
141320******************************************************************14070001
141400*  PRINT A 'NO INPUT' REPORT LINE.                                14080001
141500******************************************************************14090001
141600 1300-NO-DETAIL-LINE.                                             14100001
141700                                                                  14110001
141800     WRITE REPORT-RECORD                                          14120001
141900       FROM EP-EMPTY-REPORT-LINE                                  14130001
142000         AFTER ADVANCING 3 LINES.                                 14140001
142100*                                                                 14150001
142200***************************************************************** 14160001
142300* DO PROCESSING FOR MONTHLY INFORMATION.                          14170001
142400***************************************************************** 14180001
142500 1400-PROCESS-MONTHLY.                                            14190001
142600*                                                                 14200001
143300     MOVE RC063-NBR-RCVR-VRFD-MM   TO PV-NBR-RCVRS-VRFD-MM.       14210016
143400     MOVE RC063-NBR-LINE-VRFD-MM   TO PV-NBR-LINES-VRFD-MM.       14220016
143500     MOVE RC063-NBR-PO-VRFD-MM     TO PV-NBR-POS-MM               14230016
143510                                                                  14240016
143910     MOVE RC063-NBR-PBS-RCVR-VRFD-MM TO PV-PACK-BY-STORE-MM       14250016
143911     MOVE RC063-NBR-IPP-RCVR-VRFD-MM TO PV-INNER-PRE-PACK-MM      14260016
143912     MOVE RC063-NBR-MPP-RCVR-VRFD-MM                              14270016
143913                                   TO PV-MULTI-SKU-PRE-PACK-MM    14280016
143914     MOVE RC063-NBR-SPP-RCVR-VRFD-MM                              14290016
143915                                   TO PV-SINGLE-SKU-PRE-PACK-MM   14300016
143916     MOVE RC063-NBR-CSP-RCVR-VRFD-MM TO PV-CASEPACK-MM            14310016
143917     MOVE RC063-NBR-BLK-RCVR-VRFD-MM TO PV-BULKPACK-MM            14320016
143920                                                                  14330016
143930     MOVE RC063-EXP-CART-COUNT-MM  TO PV-EXPTED-CART-CNT-MM       14340016
143940     MOVE RC063-ACT-CART-COUNT-MM  TO PV-ACTL-CART-CNT-MM         14350016
143950     MOVE RC063-DIF-CART-COUNT-MM  TO PV-DIFF-CART-CNT-MM         14360016
143960                                                                  14370016
144000     MOVE RC063-EXP-ITEM-QTY-MM    TO PV-EXPTED-ITM-QTY-MM        14380016
144100     MOVE RC063-INT-ITEM-QTY-MM    TO PV-VERIFY-ITM-QTY-MM        14390016
144200     MOVE RC063-FNL-ITEM-QTY-MM    TO PV-AP-VERIFY-ITM-QTY-MM     14400016
144300     MOVE RC063-FNL-DIF-ITEM-QTY-MM TO PV-DIFF-ITM-QTY-MM         14410016
144310     MOVE RC063-FNL-ADJ-ITEM-QTY-MM TO PV-QTY-ADJ-INT-VRFY-MM     14420016
144400                                                                  14430016
144500     MOVE RC063-EXP-ITEM-RTL-MM    TO PV-EXPTED-EXT-RETAIL-MM     14440016
144600     MOVE RC063-INT-ITEM-RTL-MM    TO PV-VERIFY-EXT-RETAIL-MM     14450016
144700     MOVE RC063-FNL-ITEM-RTL-MM                                   14460016
144800                               TO PV-AP-VERIFY-EXT-RETAIL-MM      14470016
144900     MOVE RC063-FNL-DIF-ITEM-RTL-MM  TO PV-DIFF-EXT-RETAIL-MM     14480016
145000                                                                  14490016
145100     MOVE RC063-NBR-RCVR-CART-SHR-MM                              14500016
145200                               TO PV-NBR-RCVR-SHRT-CRTNS-MM       14510016
145300     MOVE RC063-NBR-RCVR-CART-OVR-MM                              14520016
145310                               TO PV-NBR-RCVR-OVR-CRTNS-MM        14530016
145810     MOVE RC063-NBR-RCVR-CART-EQL-MM                              14540016
145820                                 TO PV-NBR-RCVR-NODIFF-CRTNS-MM   14550016
145900                                                                  14560016
146000     MOVE RC063-NBR-RCVR-QTY-SHR-MM                               14570016
146100                                 TO PV-NBR-RCVR-SHRT-UNITS-MM     14580016
146200     MOVE RC063-NBR-RCVR-QTY-OVR-MM                               14590016
146210                                 TO PV-NBR-RCVR-OVR-UNITS-MM      14600016
146710     MOVE RC063-NBR-RCVR-QTY-EQL-MM                               14610016
146720                                 TO PV-NBR-RCVR-NODIFF-UNITS-MM   14620016
146800                                                                  14630016
146900     MOVE RC063-NBR-RCVR-RTL-SHR-MM TO PV-NBR-RCVR-SHRT-RTL-MM    14640016
147000     MOVE RC063-NBR-RCVR-RTL-OVR-MM                               14650016
147010                              TO PV-NBR-RCVR-OVR-RTL-MM           14660016
147510     MOVE RC063-NBR-RCVR-RTL-EQL-MM                               14670016
147520                              TO PV-NBR-RCVR-NODIFF-RTL-MM        14680016
147600                                                                  14690016
147700     MOVE RC063-NBR-LINE-QTY-SHR-MM                               14700016
147800                              TO PV-NBR-LINE-SHRT-UNITS-MM        14710016
147900     MOVE RC063-NBR-LINE-QTY-OVR-MM                               14720016
147910                              TO PV-NBR-LINE-OVR-UNITS-MM         14730016
148410     MOVE RC063-NBR-LINE-QTY-EQL-MM                               14740016
148420                               TO PV-NBR-LINE-NODIFF-UNITS-MM     14750016
148430                                                                  14760016
148600     MOVE RC063-NBR-LINE-RTL-SHR-MM TO PV-NBR-LINE-SHRT-RTL-MM    14770016
148700     MOVE RC063-NBR-LINE-RTL-OVR-MM TO PV-NBR-LINE-OVR-RTL-MM     14780016
149210     MOVE RC063-NBR-LINE-RTL-EQL-MM                               14790016
149220                                 TO PV-NBR-LINE-NODIFF-RTL-MM     14800016
149230                                                                  14810016
149810     MOVE RC063-EXP-V-ACT-OVER-RTL-MM                             14820016
149820                                   TO PV-EXPD-VS-ACTL-OVRG-MM.    14830016
150410     MOVE RC063-EXP-V-ACT-SHRT-RTL-MM                             14840016
150420                                   TO PV-EXPD-VS-ACTL-SHTG-MM.    14850016
150600/                                                                 14860001
150700***************************************************************** 14870001
150710* DO PROCESSING FOR MONTHLY INFORMATION.                          14880016
151100***************************************************************** 14890001
151200 1450-PROCESS-YTD.                                                14900001
151300*                                                                 14910001
152000      MOVE RC063-NBR-RCVR-VRFD-YTD  TO PV-NBR-RCVRS-VRFD-YTD      14920016
152100      MOVE RC063-NBR-LINE-VRFD-YTD  TO PV-NBR-LINES-VRFD-YTD      14930016
152200      MOVE RC063-NBR-PO-VRFD-YTD    TO PV-NBR-POS-YTD             14940016
152201                                                                  14950016
152210      MOVE RC063-NBR-PBS-RCVR-VRFD-YTD TO PV-PACK-BY-STORE-YTD    14960016
152211      MOVE RC063-NBR-IPP-RCVR-VRFD-YTD TO PV-INNER-PRE-PACK-YTD   14970016
152212      MOVE RC063-NBR-MPP-RCVR-VRFD-YTD                            14980016
152213                                   TO PV-MULTI-SKU-PRE-PACK-YTD   14990016
152214      MOVE RC063-NBR-SPP-RCVR-VRFD-YTD                            15000016
152215                                   TO PV-SINGLE-SKU-PRE-PACK-YTD  15010016
152216      MOVE RC063-NBR-CSP-RCVR-VRFD-YTD TO PV-CASEPACK-YTD         15020016
152217      MOVE RC063-NBR-BLK-RCVR-VRFD-YTD TO PV-BULKPACK-YTD         15030016
152220                                                                  15040016
152300      MOVE RC063-EXP-CART-COUNT-YTD TO PV-EXPTED-CART-CNT-YTD     15050016
152400      MOVE RC063-ACT-CART-COUNT-YTD TO PV-ACTL-CART-CNT-YTD       15060016
152500      MOVE RC063-DIF-CART-COUNT-YTD TO PV-DIFF-CART-CNT-YTD       15070016
152600                                                                  15080008
152700      MOVE RC063-EXP-ITEM-QTY-YTD  TO PV-EXPTED-ITM-QTY-YTD       15090016
152800      MOVE RC063-INT-ITEM-QTY-YTD  TO PV-VERIFY-ITM-QTY-YTD       15100016
152900      MOVE RC063-FNL-ITEM-QTY-YTD  TO PV-AP-VERIFY-ITM-QTY-YTD    15110016
153000      MOVE RC063-FNL-DIF-ITEM-QTY-YTD TO PV-DIFF-ITM-QTY-YTD      15120016
153100                                                                  15130008
153200      MOVE RC063-EXP-ITEM-RTL-YTD  TO PV-EXPTED-EXT-RETAIL-YTD    15140016
153300      MOVE RC063-INT-ITEM-RTL-YTD  TO PV-VERIFY-EXT-RETAIL-YTD    15150016
153400      MOVE RC063-FNL-ITEM-RTL-YTD                                 15160016
153500                                 TO PV-AP-VERIFY-EXT-RETAIL-YTD   15170008
153600      MOVE RC063-FNL-DIF-ITEM-RTL-YTD TO PV-DIFF-EXT-RETAIL-YTD   15180016
153700                                                                  15190008
153800      MOVE RC063-NBR-RCVR-CART-SHR-YTD                            15200016
153900                                 TO PV-NBR-RCVR-SHRT-CRTNS-YTD    15210008
154000      MOVE RC063-NBR-RCVR-CART-OVR-YTD                            15220016
154010                                 TO PV-NBR-RCVR-OVR-CRTNS-YTD     15230010
154510      MOVE RC063-NBR-RCVR-CART-EQL-YTD                            15240016
154520                                TO PV-NBR-RCVR-NODIFF-CRTNS-YTD   15250010
154600                                                                  15260008
154700      MOVE RC063-NBR-RCVR-QTY-SHR-YTD                             15270016
154800                                TO PV-NBR-RCVR-SHRT-UNITS-YTD     15280008
154900      MOVE RC063-NBR-RCVR-QTY-OVR-YTD                             15290016
155000                                TO PV-NBR-RCVR-OVR-UNITS-YTD      15300008
155510      MOVE RC063-NBR-RCVR-QTY-EQL-YTD                             15310016
155520                                TO PV-NBR-RCVR-NODIFF-UNITS-YTD   15320010
155600                                                                  15330008
155700      MOVE RC063-NBR-RCVR-RTL-SHR-YTD                             15340016
155710                                   TO PV-NBR-RCVR-SHRT-RTL-YTD    15350010
155800      MOVE RC063-NBR-RCVR-RTL-OVR-YTD                             15360016
155810                                   TO PV-NBR-RCVR-OVR-RTL-YTD     15370010
156310      MOVE RC063-NBR-RCVR-RTL-EQL-YTD                             15380016
156320                                TO PV-NBR-RCVR-NODIFF-RTL-YTD     15390010
156400                                                                  15400008
156500      MOVE RC063-NBR-LINE-QTY-SHR-YTD                             15410016
156600                                TO PV-NBR-LINE-SHRT-UNITS-YTD     15420008
156700      MOVE RC063-NBR-LINE-QTY-OVR-YTD                             15430016
156800                                TO PV-NBR-LINE-OVR-UNITS-YTD      15440008
157320      MOVE RC063-NBR-LINE-QTY-EQL-YTD                             15450016
157330                              TO PV-NBR-LINE-NODIFF-UNITS-YTD     15460010
157400                                                                  15470008
157500      MOVE RC063-NBR-LINE-RTL-SHR-YTD                             15480016
157600                                TO PV-NBR-LINE-SHRT-RTL-YTD       15490008
157700      MOVE RC063-NBR-LINE-RTL-OVR-YTD                             15500016
157800                                TO PV-NBR-LINE-OVR-RTL-YTD        15510008
158310      MOVE RC063-NBR-LINE-RTL-EQL-YTD                             15520016
158320                                TO PV-NBR-LINE-NODIFF-RTL-YTD     15530010
158400                                                                  15540008
159010      MOVE RC063-EXP-V-ACT-OVER-RTL-YTD                           15550016
159020                                  TO PV-EXPD-VS-ACTL-OVRG-YTD     15560011
159030                                                                  15570011
159701      MOVE RC063-EXP-V-ACT-SHRT-RTL-YTD                           15580016
159702                                  TO PV-EXPD-VS-ACTL-SHTG-YTD.    15590016
159900/                                                                 15600001
160000***************************************************************** 15610001
160100* DETERMINE AVERAGE RECEIVERS PER PO.                             15620001
160200***************************************************************** 15630001
160300 1460-AVG-AND-QTY-TOTALS.                                         15640001
160400*                                                                 15650001
160500     IF PV-NBR-POS-YTD        > ZERO                              15660001
160600      DIVIDE PV-NBR-RCVRS-VRFD-YTD    BY PV-NBR-POS-YTD           15670001
160700         GIVING PV-AVG-RCVRS-PER-PO-YTD ROUNDED                   15680001
160800     ELSE                                                         15690001
160900           MOVE ZEROS  TO  PV-AVG-RCVRS-PER-PO-YTD                15700001
161000     END-IF.                                                      15710001
161100                                                                  15720001
161200     IF PV-NBR-POS-MM         > ZERO                              15730001
161300      DIVIDE PV-NBR-RCVRS-VRFD-MM     BY PV-NBR-POS-MM            15740001
161400         GIVING PV-AVG-RCVRS-PER-PO-MM ROUNDED                    15750001
161500     ELSE                                                         15760001
161600           MOVE ZEROS  TO  PV-AVG-RCVRS-PER-PO-MM                 15770001
161700     END-IF.                                                      15780001
161800                                                                  15790001
161900     IF PV-NBR-RCVRS-VRFD-YTD   > ZERO                            15800001
162000         DIVIDE PV-NBR-LINES-VRFD-YTD    BY PV-NBR-RCVRS-VRFD-YTD 15810001
162100           GIVING PV-AVG-LINES-PER-REC-YTD ROUNDED                15820001
162200     ELSE                                                         15830001
162300           MOVE ZEROS  TO  PV-AVG-LINES-PER-REC-YTD               15840001
162400     END-IF.                                                      15850001
162500                                                                  15860001
162600     IF PV-NBR-RCVRS-VRFD-MM    > ZERO                            15870001
162700         DIVIDE PV-NBR-LINES-VRFD-MM     BY PV-NBR-RCVRS-VRFD-MM  15880001
162800           GIVING PV-AVG-LINES-PER-REC-MM ROUNDED                 15890001
162900     ELSE                                                         15900001
163000           MOVE ZEROS  TO  PV-AVG-LINES-PER-REC-MM                15910001
163100     END-IF.                                                      15920001
163200                                                                  15930001
163300     SUBTRACT PV-AP-VERIFY-ITM-QTY-MM FROM PV-VERIFY-ITM-QTY-MM   15940001
163400           GIVING PV-QTY-ADJ-INT-VRFY-MM                          15950001
163500     SUBTRACT PV-AP-VERIFY-ITM-QTY-YTD FROM PV-VERIFY-ITM-QTY-YTD 15960001
163600           GIVING PV-QTY-ADJ-INT-VRFY-YTD                         15970001
163700                                                                  15980001
163800     SUBTRACT PV-AP-VERIFY-EXT-RETAIL-MM                          15990001
163900                                   FROM PV-VERIFY-EXT-RETAIL-MM   16000001
164000           GIVING PV-EXT-RTL-ADJ-INT-VRFY-MM                      16010001
164100     SUBTRACT PV-AP-VERIFY-EXT-RETAIL-YTD                         16020001
164200                                   FROM PV-VERIFY-EXT-RETAIL-YTD  16030001
164300           GIVING PV-EXT-RTL-ADJ-INT-VRFY-YTD.                    16040001
164400                                                                  16050001
164500     ADD PV-EXPD-VS-ACTL-OVRG-MM  TO PV-EXPD-VS-ACTL-SHTG-MM      16060001
164600                    GIVING PV-VARIANCE-OVR-SHRT-MM.               16070001
164700     ADD PV-EXPD-VS-ACTL-OVRG-YTD TO PV-EXPD-VS-ACTL-SHTG-YTD     16080001
164800                    GIVING PV-VARIANCE-OVR-SHRT-YTD.              16090001
164900/                                                                 16100001
170400***************************************************************** 16110001
170500* INITIALIZE AREA TOTALS.                                         16120001
170600***************************************************************** 16130001
170700 1550-INITIALIZE-TOTALS.                                          16140001
170800*                                                                 16150001
170900     INITIALIZE     PV-YTD-TOTALS                                 16160001
171000                    PV-MONTH-TOTALS.                              16170001
171100/                                                                 16180001
171200******************************************************************16190001
171300* PROCESS DETAIL RECORDS TO GENERATE REPORT                       16200016
171400******************************************************************16210001
171500 2000-PROCESS-EXTRACT.                                            16220013
171600*                                                                 16230001
171710     IF RC063-P12MN-SLSRNK-NBR >  PV-PARM-P12MN-SLSRNK-NBR        16240016
171800         CONTINUE                                                 16250001
171900     ELSE                                                         16260001
172100         PERFORM 1400-PROCESS-MONTHLY                             16270016
172110         PERFORM 1450-PROCESS-YTD                                 16280016
172200         MOVE RC063-P12MN-SLSRNK-NBR  TO HL3-SALES-RANK           16290016
172300         MOVE RC063-ENT-NAME          TO HL3-VENDOR-NAME          16300016
172400         PERFORM 8000-WRITE-MAIN-HEADINGS                         16310016
172500         PERFORM 8100-WRITE-SUB-HEADINGS                          16320016
172600         PERFORM 1460-AVG-AND-QTY-TOTALS                          16330016
172700         PERFORM 2900-BUILD-DETAILS                               16340016
172800         PERFORM 3000-PRINT-TOTALS                                16350016
172900         PERFORM 1550-INITIALIZE-TOTALS                           16360016
173400     END-IF.                                                      16370001
173500                                                                  16380001
173600     PERFORM 2100-READ-EXTRACT-1.                                 16390001
173700*                                                                 16400001
173800******************************************************************16410001
173900*  READ NEXT INPUT FILE RECORD.                                   16420001
174000******************************************************************16430001
174100 2100-READ-EXTRACT-1.                                             16440001
174200                                                                  16450001
174300     READ EXTRACT-FILE-1 INTO RCRD063-VND-RCVR-SUMMARY            16460013
174400        AT END                                                    16470001
174500           SET PS-END-OF-INPUT TO TRUE                            16480001
174600        NOT AT END                                                16490001
174700           ADD +1                        TO PV-READ-COUNT-1       16500001
174800           MOVE RC063-ENT-ID             TO PV-ENT-ID             16510012
174900           MOVE RC063-ENT-NAME           TO PV-ENT-NAME           16520012
175000           MOVE RC063-P12MN-SLSRNK-NBR   TO PV-P12MN-SLSRNK-NBR   16530012
175120     END-READ.                                                    16540012
175200/                                                                 16550001
179400******************************************************************16560001
179500*  BUILD DETAIL LINES.                                            16570001
179600******************************************************************16580001
179700 2900-BUILD-DETAILS.                                              16590001
179800*                                                                 16600001
179900     MOVE PV-NBR-RCVRS-VRFD-MM    TO DL1-REC-VRFD-MONTH.          16610001
180000     MOVE PV-NBR-RCVRS-VRFD-YTD   TO DL1-REC-VRFD-YTD.            16620001
180100     MOVE PV-NBR-LINES-VRFD-MM    TO DL2-LINES-VRFD-MONTH         16630001
180200     MOVE PV-NBR-LINES-VRFD-YTD   TO DL2-LINES-VRFD-YTD.          16640001
180300     MOVE PV-NBR-POS-MM           TO DL3-POS-VRFD-MONTH.          16650001
180400     MOVE PV-NBR-POS-YTD          TO DL3-POS-VRFD-YTD.            16660001
180500     MOVE PV-AVG-RCVRS-PER-PO-MM  TO DL4-AVG-REC-PER-PO-MONTH.    16670001
180600     MOVE PV-AVG-RCVRS-PER-PO-YTD TO DL4-AVG-REC-PER-PO-YTD.      16680001
180700     MOVE PV-AVG-LINES-PER-REC-MM TO DL5-LINES-PER-REC-MONTH.     16690001
180800     MOVE PV-AVG-LINES-PER-REC-YTD  TO DL5-LINES-PER-REC-YTD.     16700001
180900     MOVE PV-PACK-BY-STORE-MM     TO DL6-PCKBYSTR-REC-MONTH.      16710001
181000     MOVE PV-PACK-BY-STORE-YTD    TO DL6-PCKBYSTR-REC-YTD.        16720001
181100     MOVE PV-INNER-PRE-PACK-MM    TO DL7-INNER-PRPCK-REC-MONTH.   16730001
181200     MOVE PV-INNER-PRE-PACK-YTD   TO DL7-INNER-PRPCK-REC-YTD.     16740001
181300     MOVE PV-MULTI-SKU-PRE-PACK-MM TO DL8-MLTSKU-PRPCK-REC-MONTH. 16750001
181400     MOVE PV-MULTI-SKU-PRE-PACK-YTD TO DL8-MLTSKU-PRPCK-REC-YTD.  16760001
181500     MOVE PV-SINGLE-SKU-PRE-PACK-MM TO DL9-SGLSKU-PRPCK-REC-MONTH.16770001
181600     MOVE PV-SINGLE-SKU-PRE-PACK-YTD TO DL9-SGLSKU-PRPCK-REC-YTD. 16780001
181700     MOVE PV-CASEPACK-MM            TO DL10-CASEPACK-REC-MONTH.   16790001
181800     MOVE PV-CASEPACK-YTD           TO DL10-CASEPACK-REC-YTD.     16800001
181900     MOVE PV-BULKPACK-MM            TO DL11-BULKPACK-REC-MONTH.   16810001
182000     MOVE PV-BULKPACK-YTD           TO DL11-BULKPACK-REC-YTD.     16820001
182100     MOVE PV-EXPTED-CART-CNT-MM     TO DL12-EXPTD-CRTCNT-MONTH.   16830001
182200     MOVE PV-EXPTED-CART-CNT-YTD    TO DL12-EXPTD-CRTCNT-YTD.     16840001
182300     MOVE PV-ACTL-CART-CNT-MM       TO DL13-ACTL-CRTCNT-MONTH.    16850001
182400     MOVE PV-ACTL-CART-CNT-YTD      TO DL13-ACTL-CRTCNT-YTD.      16860001
182500     MOVE PV-DIFF-CART-CNT-MM       TO DL14-DIFF-CRTCNT-MONTH.    16870001
182600     MOVE PV-DIFF-CART-CNT-YTD      TO DL14-DIFF-CRTCNT-YTD.      16880001
182700     MOVE PV-EXPTED-ITM-QTY-MM      TO DL15-EXPTD-ITEM-MONTH.     16890001
182800     MOVE PV-EXPTED-ITM-QTY-YTD     TO DL15-EXPTD-ITEM-YTD.       16900001
182900     MOVE PV-VERIFY-ITM-QTY-MM      TO DL16-INTL-VRFD-ITEM-MONTH. 16910001
183000     MOVE PV-VERIFY-ITM-QTY-YTD     TO DL16-INTL-VRFD-ITEM-YTD.   16920001
183100     MOVE PV-AP-VERIFY-ITM-QTY-MM   TO DL17-FINL-VRFD-ITEM-MONTH. 16930001
183200     MOVE PV-AP-VERIFY-ITM-QTY-YTD  TO DL17-FINL-VRFD-ITEM-YTD.   16940001
183300     MOVE PV-DIFF-ITM-QTY-MM        TO DL18-ITEM-QTY-DIFF-MONTH.  16950001
183400     MOVE PV-DIFF-ITM-QTY-YTD       TO DL18-ITEM-QTY-DIFF-YTD.    16960001
183500     MOVE PV-QTY-ADJ-INT-VRFY-MM   TO DL19-QTY-ADJ-INL-VRFY-MONTH.16970001
183600     MOVE PV-QTY-ADJ-INT-VRFY-YTD  TO DL19-QTY-ADJ-INL-VRFY-YTD.  16980001
183700                                                                  16990001
183800     MOVE PV-EXPTED-EXT-RETAIL-MM  TO DL20-EXPDITM-EXTD-RTL-MONTH.17000001
183900     MOVE PV-EXPTED-EXT-RETAIL-YTD TO DL20-EXPDITM-EXTD-RTL-YTD.  17010001
184000     MOVE PV-VERIFY-EXT-RETAIL-MM  TO DL21-INLVRFY-EXTD-RTL-MONTH.17020001
184100     MOVE PV-VERIFY-EXT-RETAIL-YTD TO DL21-INLVRFY-EXTD-RTL-YTD.  17030001
184200     MOVE PV-AP-VERIFY-EXT-RETAIL-MM                              17040001
184300                                   TO DL22-FNLVRFY-EXTD-RTL-MONTH.17050001
184400     MOVE PV-AP-VERIFY-EXT-RETAIL-YTD                             17060001
184500                                   TO DL22-FNLVRFY-EXTD-RTL-YTD.  17070001
184600     MOVE PV-DIFF-EXT-RETAIL-MM    TO DL23-DIFF-EXTD-RTL-MONTH.   17080001
184700     MOVE PV-DIFF-EXT-RETAIL-YTD   TO DL23-DIFF-EXTD-RTL-YTD.     17090001
184800     MOVE PV-EXT-RTL-ADJ-INT-VRFY-MM  TO DL24-EXTD-RTL-ADJ-MONTH. 17100001
184900     MOVE PV-EXT-RTL-ADJ-INT-VRFY-YTD TO DL24-EXTD-RTL-ADJ-YTD.   17110001
185000     MOVE PV-EXPD-VS-ACTL-OVRG-MM  TO DL24A-EXPD-VS-ACTL-OVRG-MM. 17120001
185100     MOVE PV-EXPD-VS-ACTL-OVRG-YTD TO DL24A-EXPD-VS-ACTL-OVRG-YTD.17130001
185200     MOVE PV-EXPD-VS-ACTL-SHTG-MM  TO DL24B-EXPD-VS-ACTL-SHTG-MM. 17140001
185300     MOVE PV-EXPD-VS-ACTL-SHTG-YTD TO DL24B-EXPD-VS-ACTL-SHTG-YTD.17150001
185400     MOVE PV-VARIANCE-OVR-SHRT-MM  TO DL24C-VARIANCE-OVR-SHRT-MM. 17160001
185500     MOVE PV-VARIANCE-OVR-SHRT-YTD TO DL24C-VARIANCE-OVR-SHRT-YTD.17170001
185600     MOVE PV-NBR-RCVR-OVR-CRTNS-MM   TO DL25-RCVR-CRTN-OVR-MONTH. 17180001
185700     MOVE PV-NBR-RCVR-OVR-CRTNS-YTD  TO DL25-RCVR-CRTN-OVR-YTD.   17190001
185800     MOVE PV-NBR-RCVR-SHRT-CRTNS-MM TO DL26-RCVR-CRTN-SHRT-MONTH. 17200001
185900     MOVE PV-NBR-RCVR-SHRT-CRTNS-YTD TO DL26-RCVR-CRTN-SHRT-YTD.  17210001
186000     MOVE PV-NBR-RCVR-NODIFF-CRTNS-MM                             17220001
186100                                 TO DL27-RCVR-CRTN-NO-DIFF-MONTH. 17230001
186200     MOVE PV-NBR-RCVR-NODIFF-CRTNS-YTD                            17240001
186300                                 TO DL27-RCVR-CRTN-NO-DIFF-YTD.   17250001
186400     MOVE PV-NBR-RCVR-OVR-UNITS-MM TO DL28-RCVR-UNIT-OVR-MONTH.   17260001
186500     MOVE PV-NBR-RCVR-OVR-UNITS-YTD TO DL28-RCVR-UNIT-OVR-YTD.    17270001
186600     MOVE PV-NBR-RCVR-SHRT-UNITS-MM TO DL29-RCVR-UNIT-SHRT-MONTH. 17280001
186700     MOVE PV-NBR-RCVR-SHRT-UNITS-YTD TO DL29-RCVR-UNIT-SHRT-YTD.  17290001
186800     MOVE PV-NBR-RCVR-NODIFF-UNITS-MM                             17300001
186900                                TO DL30-RCVR-UNIT-NO-DIFF-MONTH.  17310001
187000     MOVE PV-NBR-RCVR-NODIFF-UNITS-YTD                            17320001
187100                                TO DL30-RCVR-UNIT-NO-DIFF-YTD.    17330001
187200     MOVE PV-NBR-RCVR-OVR-RTL-MM TO DL31-RCVR-EXTRTL-OVR-MONTH.   17340001
187300     MOVE PV-NBR-RCVR-OVR-RTL-YTD TO DL31-RCVR-EXTRTL-OVR-YTD.    17350001
187400     MOVE PV-NBR-RCVR-SHRT-RTL-MM TO DL32-RCVR-EXTRTL-SHRT-MONTH. 17360001
187500     MOVE PV-NBR-RCVR-SHRT-RTL-YTD TO DL32-RCVR-EXTRTL-SHRT-YTD.  17370001
187600     MOVE PV-NBR-RCVR-NODIFF-RTL-MM                               17380001
187700                               TO DL33-RCVR-EXTRTL-NO-DIFF-MONTH. 17390001
187800     MOVE PV-NBR-RCVR-NODIFF-RTL-YTD                              17400001
187900                               TO DL33-RCVR-EXTRTL-NO-DIFF-YTD.   17410001
188000     MOVE PV-NBR-LINE-OVR-UNITS-MM TO DL34-LINES-UNIT-OVR-MONTH.  17420001
188100     MOVE PV-NBR-LINE-OVR-UNITS-YTD TO DL34-LINES-UNIT-OVR-YTD.   17430001
188200     MOVE PV-NBR-LINE-SHRT-UNITS-MM TO DL35-LINES-UNIT-SHRT-MONTH.17440001
188300     MOVE PV-NBR-LINE-SHRT-UNITS-YTD TO DL35-LINES-UNIT-SHRT-YTD. 17450001
188400     MOVE PV-NBR-LINE-NODIFF-UNITS-MM                             17460001
188500                                 TO DL36-LINES-UNIT-NO-DIFF-MONTH.17470001
188600     MOVE PV-NBR-LINE-NODIFF-UNITS-YTD                            17480001
188700                                 TO DL36-LINES-UNIT-NO-DIFF-YTD.  17490001
188800                                                                  17500001
188900     MOVE PV-NBR-LINE-OVR-RTL-MM TO DL37-LINES-EXTRTL-OVR-MONTH.  17510001
189000     MOVE PV-NBR-LINE-OVR-RTL-YTD TO DL37-LINES-EXTRTL-OVR-YTD.   17520001
189100     MOVE PV-NBR-LINE-SHRT-RTL-MM TO DL38-LINES-EXTRTL-SHRT-MONTH.17530001
189200     MOVE PV-NBR-LINE-SHRT-RTL-YTD TO DL38-LINES-EXTRTL-SHRT-YTD. 17540001
189300     MOVE PV-NBR-LINE-NODIFF-RTL-MM                               17550001
189400                               TO DL39-LINES-NO-DIFF-MONTH.       17560001
189500     MOVE PV-NBR-LINE-NODIFF-RTL-YTD                              17570001
189600                               TO DL39-LINES-NO-DIFF-YTD.         17580001
189700                                                                  17590001
189800     PERFORM 5000-DETERMINE-PERCENTS.                             17600001
189900/                                                                 17610001
190000******************************************************************17620001
190100 3000-PRINT-TOTALS.                                               17630001
190200******************************************************************17640001
190300                                                                  17650001
190400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-1                  17660001
190500         AFTER ADVANCING 1 LINE                                   17670001
190600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-2                  17680001
190700         AFTER ADVANCING 1 LINE                                   17690001
190800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-3                  17700001
190900         AFTER ADVANCING 1 LINE                                   17710001
191000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-4                  17720001
191100         AFTER ADVANCING 1 LINE                                   17730001
191200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-5                  17740001
191300         AFTER ADVANCING 1 LINE                                   17750001
191400     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     17760001
191500         AFTER ADVANCING 1 LINE                                   17770001
191600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-6                  17780001
191700         AFTER ADVANCING 1 LINE                                   17790001
191800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-7                  17800001
191900         AFTER ADVANCING 1 LINE                                   17810001
192000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-8                  17820001
192100         AFTER ADVANCING 1 LINE                                   17830001
192200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-9                  17840001
192300         AFTER ADVANCING 1 LINE                                   17850001
192400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-10                 17860001
192500         AFTER ADVANCING 1 LINE                                   17870001
192600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-11                 17880001
192700         AFTER ADVANCING 1 LINE                                   17890001
192800     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     17900001
192900         AFTER ADVANCING 1 LINE                                   17910001
193000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-12                 17920001
193100         AFTER ADVANCING 1 LINE                                   17930001
193200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-13                 17940001
193300         AFTER ADVANCING 1 LINE                                   17950001
193400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-14                 17960001
193500         AFTER ADVANCING 1 LINE                                   17970001
193600     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     17980001
193700         AFTER ADVANCING 1 LINE                                   17990001
193800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-15                 18000001
193900         AFTER ADVANCING 1 LINE                                   18010001
194000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-16                 18020001
194100         AFTER ADVANCING 1 LINE                                   18030001
194200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-17                 18040001
194300         AFTER ADVANCING 1 LINE                                   18050001
194400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-18                 18060001
194500         AFTER ADVANCING 1 LINE                                   18070001
194600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-19                 18080001
194700         AFTER ADVANCING 1 LINE                                   18090001
194800     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18100001
194900         AFTER ADVANCING 1 LINE                                   18110001
195000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-20                 18120001
195100         AFTER ADVANCING 1 LINE                                   18130001
195200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-21                 18140001
195300         AFTER ADVANCING 1 LINE                                   18150001
195400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-22                 18160001
195500         AFTER ADVANCING 1 LINE                                   18170001
195600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-23                 18180001
195700         AFTER ADVANCING 1 LINE                                   18190001
195800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-24                 18200001
195900         AFTER ADVANCING 1 LINE                                   18210001
196000     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18220001
196100         AFTER ADVANCING 1 LINE                                   18230001
196200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-24A                18240001
196300         AFTER ADVANCING 1 LINE                                   18250001
196400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-24B                18260001
196500         AFTER ADVANCING 1 LINE                                   18270001
196600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-24C                18280001
196700         AFTER ADVANCING 1 LINE                                   18290001
196800     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18300001
196900         AFTER ADVANCING 1 LINE                                   18310001
197000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-25                 18320001
197100         AFTER ADVANCING 1 LINE                                   18330001
197200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-26                 18340001
197300         AFTER ADVANCING 1 LINE                                   18350001
197400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-27                 18360001
197500         AFTER ADVANCING 1 LINE                                   18370001
197600     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18380001
197700         AFTER ADVANCING 1 LINE                                   18390001
197800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-28                 18400001
197900         AFTER ADVANCING 1 LINE                                   18410001
198000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-29                 18420001
198100         AFTER ADVANCING 1 LINE                                   18430001
198200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-30                 18440001
198300         AFTER ADVANCING 1 LINE                                   18450001
198400     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18460001
198500         AFTER ADVANCING 1 LINE                                   18470001
198600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-31                 18480001
198700         AFTER ADVANCING 1 LINE                                   18490001
198800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-32                 18500001
198900         AFTER ADVANCING 1 LINE                                   18510001
199000     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-33                 18520001
199100         AFTER ADVANCING 1 LINE                                   18530001
199200     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18540001
199300         AFTER ADVANCING 1 LINE                                   18550001
199400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-34                 18560001
199500         AFTER ADVANCING 1 LINE                                   18570001
199600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-35                 18580001
199700         AFTER ADVANCING 1 LINE                                   18590001
199800     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-36                 18600001
199900         AFTER ADVANCING 1 LINE                                   18610001
200000     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18620001
200100         AFTER ADVANCING 1 LINE                                   18630001
200200     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-37                 18640001
200300         AFTER ADVANCING 1 LINE                                   18650001
200400     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-38                 18660001
200500         AFTER ADVANCING 1 LINE                                   18670001
200600     WRITE REPORT-RECORD   FROM DL-DETAIL-LINE-39                 18680001
200700         AFTER ADVANCING 1 LINE                                   18690001
200800     WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     18700001
200900         AFTER ADVANCING 1 LINE                                   18710001
201000                                                                  18720001
201100     WRITE REPORT-RECORD   FROM TL1-NOTE-LINE                     18730001
201200         AFTER ADVANCING 1 LINES                                  18740001
201300     WRITE REPORT-RECORD   FROM TL2-NOTE-LINE                     18750001
201400         AFTER ADVANCING 1 LINE                                   18760001
201500     WRITE REPORT-RECORD   FROM TL3-NOTE-LINE                     18770001
201600         AFTER ADVANCING 1 LINES                                  18780001
201700     WRITE REPORT-RECORD   FROM TL4-NOTE-LINE                     18790001
201800         AFTER ADVANCING 1 LINE                                   18800001
201900     WRITE REPORT-RECORD   FROM TL5-NOTE-LINE                     18810001
202000         AFTER ADVANCING 1 LINE                                   18820001
202100                                                                  18830001
202200     ADD 60                  TO PV-LINE-COUNT.                    18840001
202300*                                                                 18850001
202400******************************************************************18860001
202500 3900-PRINT-BLANK-LINE.                                           18870001
202600******************************************************************18880001
202700*                                                                 18890001
202800     WRITE REPORT-RECORD  FROM DL-BLANK-LINE                      18900001
202900     AFTER ADVANCING 1 LINE                                       18910001
203000     ADD 1                     TO PV-LINE-COUNT.                  18920001
203100/                                                                 18930001
203200***************************************************************** 18940001
203300*  FIGURE PECENTAGES.                                             18950001
203400***************************************************************** 18960001
203500 5000-DETERMINE-PERCENTS.                                         18970001
203510*                                                                 18980002
203520* PERCENT TO TOTAL FOR PACK-TO-STORE RECEIVERS                    18990002
203530*                                                                 19000002
203540        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           19010002
203550          DIVIDE PV-PACK-BY-STORE-MM   BY PV-NBR-RCVRS-VRFD-MM    19020002
203560            GIVING PV-DIVIDEND                                    19030002
203570          MULTIPLY PV-DIVIDEND BY 100                             19040002
203580            GIVING DL6-PERCENT-MONTH ROUNDED                      19050002
203590        ELSE                                                      19060002
203591              MOVE ZEROES  TO  PV-DIVIDEND                        19070002
203592                               DL6-PERCENT-MONTH                  19080002
203593        END-IF.                                                   19090002
203594                                                                  19100002
203595        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           19110002
203596          DIVIDE PV-PACK-BY-STORE-YTD  BY PV-NBR-RCVRS-VRFD-YTD   19120002
203597            GIVING PV-DIVIDEND                                    19130002
203598          MULTIPLY PV-DIVIDEND BY 100                             19140002
203599            GIVING DL6-PERCENT-YTD ROUNDED                        19150002
203600        ELSE                                                      19160002
203601              MOVE ZEROES  TO  PV-DIVIDEND                        19170002
203602                               DL6-PERCENT-YTD                    19180002
203603        END-IF.                                                   19190002
203604*                                                                 19200002
203605* PERCENT TO TOTAL FOR INNER PRE-PACK RECEIVERS                   19210002
203606*                                                                 19220002
203607        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           19230002
203608          DIVIDE PV-INNER-PRE-PACK-MM  BY PV-NBR-RCVRS-VRFD-MM    19240002
203609            GIVING PV-DIVIDEND                                    19250002
203610          MULTIPLY PV-DIVIDEND BY 100                             19260002
203611            GIVING DL7-PERCENT-MONTH ROUNDED                      19270002
203612        ELSE                                                      19280002
203613              MOVE ZEROES  TO  PV-DIVIDEND                        19290002
203614                               DL7-PERCENT-MONTH                  19300002
203615        END-IF.                                                   19310002
203616                                                                  19320002
203617        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           19330002
203618          DIVIDE PV-INNER-PRE-PACK-YTD BY PV-NBR-RCVRS-VRFD-YTD   19340002
203619            GIVING PV-DIVIDEND                                    19350002
203620          MULTIPLY PV-DIVIDEND BY 100                             19360002
203621            GIVING DL7-PERCENT-YTD ROUNDED                        19370002
203622        ELSE                                                      19380002
203623              MOVE ZEROES  TO  PV-DIVIDEND                        19390002
203624                               DL7-PERCENT-YTD                    19400002
203625        END-IF.                                                   19410002
203626*                                                                 19420002
203627* PERCENT TO TOTAL FOR MULTI SKU PRE-PACK RECEIVERS               19430002
203628*                                                                 19440002
203629        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           19450002
203630          DIVIDE PV-MULTI-SKU-PRE-PACK-MM BY PV-NBR-RCVRS-VRFD-MM 19460002
203631            GIVING PV-DIVIDEND                                    19470002
203632          MULTIPLY PV-DIVIDEND BY 100                             19480002
203633            GIVING DL8-PERCENT-MONTH ROUNDED                      19490002
203634        ELSE                                                      19500002
203635              MOVE ZEROES  TO  PV-DIVIDEND                        19510002
203636                               DL8-PERCENT-MONTH                  19520002
203637        END-IF.                                                   19530002
203638                                                                  19540002
203639        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           19550002
203640          DIVIDE PV-MULTI-SKU-PRE-PACK-YTD                        19560002
203641                                      BY PV-NBR-RCVRS-VRFD-YTD    19570002
203642            GIVING PV-DIVIDEND                                    19580002
203643          MULTIPLY PV-DIVIDEND BY 100                             19590002
203644            GIVING DL8-PERCENT-YTD ROUNDED                        19600002
203645        ELSE                                                      19610002
203646              MOVE ZEROES  TO  PV-DIVIDEND                        19620002
203647                               DL8-PERCENT-YTD                    19630002
203648        END-IF.                                                   19640002
203649*                                                                 19650002
203650* PERCENT TO TOTAL FOR SINGLE SKU PRE-PACK RECEIVERS              19660002
203651*                                                                 19670002
203652        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           19680002
203653          DIVIDE PV-SINGLE-SKU-PRE-PACK-MM BY PV-NBR-RCVRS-VRFD-MM19690002
203654            GIVING PV-DIVIDEND                                    19700002
203655          MULTIPLY PV-DIVIDEND BY 100                             19710002
203656            GIVING DL9-PERCENT-MONTH ROUNDED                      19720002
203657        ELSE                                                      19730002
203658              MOVE ZEROES  TO  PV-DIVIDEND                        19740002
203659                               DL9-PERCENT-MONTH                  19750002
203660        END-IF.                                                   19760002
203661                                                                  19770002
203662        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           19780002
203663          DIVIDE PV-SINGLE-SKU-PRE-PACK-YTD                       19790002
203664                                       BY PV-NBR-RCVRS-VRFD-YTD   19800002
203665            GIVING PV-DIVIDEND                                    19810002
203666          MULTIPLY PV-DIVIDEND BY 100                             19820002
203667            GIVING DL9-PERCENT-YTD ROUNDED                        19830002
203668        ELSE                                                      19840002
203669              MOVE ZEROES  TO  PV-DIVIDEND                        19850002
203670                               DL9-PERCENT-YTD                    19860002
203671        END-IF.                                                   19870002
203672*                                                                 19880002
203673* PERCENT TO TOTAL FOR CASEPACK RECEIVERS                         19890002
203674*                                                                 19900002
203675        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           19910002
203676          DIVIDE PV-CASEPACK-MM    BY PV-NBR-RCVRS-VRFD-MM        19920002
203677            GIVING PV-DIVIDEND                                    19930002
203678          MULTIPLY PV-DIVIDEND BY 100                             19940002
203679            GIVING DL10-PERCENT-MONTH ROUNDED                     19950002
203680        ELSE                                                      19960002
203681              MOVE ZEROES  TO  PV-DIVIDEND                        19970002
203682                               DL10-PERCENT-MONTH                 19980002
203683        END-IF.                                                   19990002
203684                                                                  20000002
203685        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           20010002
203686          DIVIDE PV-CASEPACK-YTD   BY PV-NBR-RCVRS-VRFD-YTD       20020002
203687            GIVING PV-DIVIDEND                                    20030002
203688          MULTIPLY PV-DIVIDEND BY 100                             20040002
203689            GIVING DL10-PERCENT-YTD ROUNDED                       20050002
203690        ELSE                                                      20060002
203691              MOVE ZEROES  TO  PV-DIVIDEND                        20070002
203692                               DL10-PERCENT-YTD                   20080002
203693        END-IF.                                                   20090002
203694*                                                                 20100002
203695* PERCENT TO TOTAL FOR BULK PACK RECEIVERS                        20110002
203696*                                                                 20120002
203697        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           20130002
203698          DIVIDE PV-BULKPACK-MM    BY PV-NBR-RCVRS-VRFD-MM        20140002
203699            GIVING PV-DIVIDEND                                    20150002
203700          MULTIPLY PV-DIVIDEND BY 100                             20160002
203701            GIVING DL11-PERCENT-MONTH ROUNDED                     20170002
203702        ELSE                                                      20180002
203703              MOVE ZEROES  TO  PV-DIVIDEND                        20190002
203704                               DL11-PERCENT-MONTH                 20200002
203705        END-IF.                                                   20210002
203706                                                                  20220002
203707        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           20230002
203708          DIVIDE PV-BULKPACK-YTD   BY PV-NBR-RCVRS-VRFD-YTD       20240002
203709            GIVING PV-DIVIDEND                                    20250002
203710          MULTIPLY PV-DIVIDEND BY 100                             20260002
203711            GIVING DL11-PERCENT-YTD ROUNDED                       20270002
203712        ELSE                                                      20280002
203713              MOVE ZEROES  TO  PV-DIVIDEND                        20290002
203714                               DL11-PERCENT-YTD                   20300002
203715        END-IF.                                                   20310002
203716*                                                                 20320002
203717* PERCENT VARIANCE FOR CARTON COUNT DIFFERENCE                    20330002
203718*                                                                 20340002
203719        IF PV-EXPTED-CART-CNT-MM   > ZERO                         20350002
203720          DIVIDE PV-DIFF-CART-CNT-MM BY PV-EXPTED-CART-CNT-MM     20360002
203721            GIVING PV-DIVIDEND                                    20370002
203722          MULTIPLY PV-DIVIDEND BY 100                             20380002
203723            GIVING DL14-PERCENT-MONTH ROUNDED                     20390002
203724        ELSE                                                      20400002
203725              MOVE ZEROES  TO  PV-DIVIDEND                        20410002
203726                               DL14-PERCENT-MONTH                 20420002
203727        END-IF.                                                   20430002
203728                                                                  20440002
203729        IF PV-EXPTED-CART-CNT-YTD > ZERO                          20450002
203730          DIVIDE PV-DIFF-CART-CNT-YTD BY PV-EXPTED-CART-CNT-YTD   20460002
203731            GIVING PV-DIVIDEND                                    20470002
203732          MULTIPLY PV-DIVIDEND BY 100                             20480002
203733            GIVING DL14-PERCENT-YTD ROUNDED                       20490002
203734        ELSE                                                      20500002
203735              MOVE ZEROES  TO  PV-DIVIDEND                        20510002
203736                               DL14-PERCENT-YTD                   20520002
203737        END-IF.                                                   20530002
203738*                                                                 20540002
203739* PERCENT VARIANCE FOR ITEM QUANTITY DIFFERENCE(EXP VS FINAL)     20550002
203740*                                                                 20560002
203741        IF PV-EXPTED-ITM-QTY-MM   > ZERO                          20570002
203742          DIVIDE PV-DIFF-ITM-QTY-MM  BY PV-EXPTED-ITM-QTY-MM      20580002
203743            GIVING PV-DIVIDEND                                    20590002
203744          MULTIPLY PV-DIVIDEND BY 100                             20600002
203745            GIVING DL18-PERCENT-MONTH ROUNDED                     20610002
203746        ELSE                                                      20620002
203747              MOVE ZEROES  TO  PV-DIVIDEND                        20630002
203748                               DL18-PERCENT-MONTH                 20640002
203749        END-IF.                                                   20650002
203750                                                                  20660002
203751        IF PV-EXPTED-ITM-QTY-YTD  > ZERO                          20670002
203752          DIVIDE PV-DIFF-ITM-QTY-YTD  BY PV-EXPTED-ITM-QTY-YTD    20680002
203753            GIVING PV-DIVIDEND                                    20690002
203754          MULTIPLY PV-DIVIDEND BY 100                             20700002
203755            GIVING DL18-PERCENT-YTD ROUNDED                       20710002
203756        ELSE                                                      20720002
203757              MOVE ZEROES  TO  PV-DIVIDEND                        20730002
203758                               DL18-PERCENT-YTD                   20740002
203759        END-IF.                                                   20750002
203760*                                                                 20760002
203761* PERCENT VARIANCE FOR QUANTITY ADJUSTED AFTER INITIAL VERIFY     20770002
203762*                                                                 20780002
203763        IF PV-VERIFY-ITM-QTY-MM  > ZERO                           20790002
203764          DIVIDE PV-QTY-ADJ-INT-VRFY-MM BY PV-VERIFY-ITM-QTY-MM   20800002
203765            GIVING PV-DIVIDEND                                    20810002
203766          MULTIPLY PV-DIVIDEND BY 100                             20820002
203767            GIVING DL19-PERCENT-MONTH ROUNDED                     20830002
203768        ELSE                                                      20840002
203769              MOVE ZEROES  TO  PV-DIVIDEND                        20850002
203770                               DL19-PERCENT-MONTH                 20860002
203771        END-IF.                                                   20870002
203772                                                                  20880002
203773        IF PV-VERIFY-ITM-QTY-YTD  > ZERO                          20890002
203774          DIVIDE PV-QTY-ADJ-INT-VRFY-YTD BY PV-VERIFY-ITM-QTY-YTD 20900002
203775            GIVING PV-DIVIDEND                                    20910002
203776          MULTIPLY PV-DIVIDEND BY 100                             20920002
203777            GIVING DL19-PERCENT-YTD ROUNDED                       20930002
203778        ELSE                                                      20940002
203779              MOVE ZEROES  TO  PV-DIVIDEND                        20950002
203780                               DL18-PERCENT-YTD                   20960002
203781        END-IF.                                                   20970002
203782*                                                                 20980002
203783* PERCENT VARIANCE FOR EXTENDED RETAIL DIFFERENCE (EXP VS FINAL)  20990002
203784*                                                                 21000002
203785        IF PV-EXPTED-EXT-RETAIL-MM  > ZERO                        21010002
203786          DIVIDE PV-DIFF-EXT-RETAIL-MM  BY PV-EXPTED-EXT-RETAIL-MM21020002
203787            GIVING PV-DIVIDEND                                    21030002
203788          MULTIPLY PV-DIVIDEND BY 100                             21040002
203789            GIVING DL23-PERCENT-MONTH ROUNDED                     21050002
203790        ELSE                                                      21060002
203791              MOVE ZEROES  TO  PV-DIVIDEND                        21070002
203792                               DL23-PERCENT-MONTH                 21080002
203793        END-IF.                                                   21090002
203794                                                                  21100002
203795        IF PV-EXPTED-EXT-RETAIL-YTD  > ZERO                       21110002
203796          DIVIDE PV-DIFF-EXT-RETAIL-YTD                           21120002
203797                                     BY PV-EXPTED-EXT-RETAIL-YTD  21130002
203798            GIVING PV-DIVIDEND                                    21140002
203799          MULTIPLY PV-DIVIDEND BY 100                             21150002
203800            GIVING DL23-PERCENT-YTD ROUNDED                       21160002
203801        ELSE                                                      21170002
203802              MOVE ZEROES  TO  PV-DIVIDEND                        21180002
203803                               DL23-PERCENT-YTD                   21190002
203804        END-IF.                                                   21200002
203805*                                                                 21210002
203806* PERCENT VARIANCE FOR EXTENDED RETAIL ADJUSTED AFTER INITIAL     21220002
203807*  VERIFY                                                         21230002
203808*                                                                 21240002
203809        IF PV-VERIFY-EXT-RETAIL-MM  > ZERO                        21250002
203810          DIVIDE PV-EXT-RTL-ADJ-INT-VRFY-MM                       21260002
203811                                   BY PV-VERIFY-EXT-RETAIL-MM     21270002
203812            GIVING PV-DIVIDEND                                    21280002
203813          MULTIPLY PV-DIVIDEND BY 100                             21290002
203814            GIVING DL24-PERCENT-MONTH ROUNDED                     21300002
203815        ELSE                                                      21310002
203816              MOVE ZEROES  TO  PV-DIVIDEND                        21320002
203817                               DL24-PERCENT-MONTH                 21330002
203818        END-IF.                                                   21340002
203819                                                                  21350002
203820        IF PV-VERIFY-EXT-RETAIL-YTD  > ZERO                       21360002
203821          DIVIDE PV-EXT-RTL-ADJ-INT-VRFY-YTD                      21370002
203822                                     BY PV-VERIFY-EXT-RETAIL-YTD  21380002
203823            GIVING PV-DIVIDEND                                    21390002
203824          MULTIPLY PV-DIVIDEND BY 100                             21400002
203825            GIVING DL24-PERCENT-YTD ROUNDED                       21410002
203826        ELSE                                                      21420002
203827              MOVE ZEROES  TO  PV-DIVIDEND                        21430002
203828                               DL24-PERCENT-YTD                   21440002
203829        END-IF.                                                   21450002
203830*                                                                 21460002
203831* PERCENT FOR EXPECTED VS ACTUAL RETAIL OVERAGE VERIFIED          21470002
203832*                                                                 21480002
203833        IF PV-EXPTED-EXT-RETAIL-MM  > ZERO                        21490002
203834          DIVIDE PV-EXPD-VS-ACTL-OVRG-MM                          21500002
203835                                   BY PV-EXPTED-EXT-RETAIL-MM     21510002
203836            GIVING PV-DIVIDEND                                    21520002
203837          MULTIPLY PV-DIVIDEND BY 100                             21530002
203838            GIVING DL24A-PERCENT-MONTH ROUNDED                    21540002
203839        ELSE                                                      21550002
203840              MOVE ZEROES  TO  PV-DIVIDEND                        21560002
203841                               DL24A-PERCENT-MONTH                21570002
203842        END-IF.                                                   21580002
203843                                                                  21590002
203844        IF PV-EXPTED-EXT-RETAIL-YTD  > ZERO                       21600002
203845          DIVIDE PV-EXPD-VS-ACTL-OVRG-YTD                         21610002
203846                                     BY PV-EXPTED-EXT-RETAIL-YTD  21620002
203847            GIVING PV-DIVIDEND                                    21630002
203848          MULTIPLY PV-DIVIDEND BY 100                             21640002
203849            GIVING DL24A-PERCENT-YTD ROUNDED                      21650002
203850        ELSE                                                      21660002
203851              MOVE ZEROES  TO  PV-DIVIDEND                        21670002
203852                               DL24A-PERCENT-YTD                  21680002
203853        END-IF.                                                   21690002
203854*                                                                 21700002
203855* PERCENT FOR EXPECTED VS ACTUAL RETAIL SHORTAGE VERIFIED         21710002
203856*                                                                 21720002
203857        IF PV-EXPTED-EXT-RETAIL-MM  > ZERO                        21730002
203858          DIVIDE PV-EXPD-VS-ACTL-SHTG-MM                          21740002
203859                                   BY PV-EXPTED-EXT-RETAIL-MM     21750002
203860            GIVING PV-DIVIDEND                                    21760002
203861          MULTIPLY PV-DIVIDEND BY 100                             21770002
203862            GIVING DL24B-PERCENT-MONTH ROUNDED                    21780002
203863        ELSE                                                      21790002
203864              MOVE ZEROES  TO  PV-DIVIDEND                        21800002
203865                               DL24B-PERCENT-MONTH                21810002
203866        END-IF.                                                   21820002
203867                                                                  21830002
203868        IF PV-EXPTED-EXT-RETAIL-YTD  > ZERO                       21840002
203869          DIVIDE PV-EXPD-VS-ACTL-SHTG-YTD                         21850002
203870                                     BY PV-EXPTED-EXT-RETAIL-YTD  21860002
203871            GIVING PV-DIVIDEND                                    21870002
203872          MULTIPLY PV-DIVIDEND BY 100                             21880002
203873            GIVING DL24B-PERCENT-YTD ROUNDED                      21890002
203874        ELSE                                                      21900002
203875              MOVE ZEROES  TO  PV-DIVIDEND                        21910002
203876                               DL24B-PERCENT-YTD                  21920002
203877        END-IF.                                                   21930002
203878*                                                                 21940002
203879* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH CARTON OVERAGE   21950002
203880*                                                                 21960002
203881        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           21970002
203882          DIVIDE PV-NBR-RCVR-OVR-CRTNS-MM                         21980002
203883                                   BY PV-NBR-RCVRS-VRFD-MM        21990002
203884            GIVING PV-DIVIDEND                                    22000002
203885          MULTIPLY PV-DIVIDEND BY 100                             22010002
203886            GIVING DL25-PERCENT-MONTH ROUNDED                     22020002
203887        ELSE                                                      22030002
203888              MOVE ZEROES  TO  PV-DIVIDEND                        22040002
203889                               DL25-PERCENT-MONTH                 22050002
203890        END-IF.                                                   22060002
203891                                                                  22070002
203892        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           22080002
203893          DIVIDE PV-NBR-RCVR-OVR-CRTNS-YTD                        22090002
203894                                     BY PV-NBR-RCVRS-VRFD-YTD     22100002
203895            GIVING PV-DIVIDEND                                    22110002
203896          MULTIPLY PV-DIVIDEND BY 100                             22120002
203897            GIVING DL25-PERCENT-YTD ROUNDED                       22130002
203898        ELSE                                                      22140002
203899              MOVE ZEROES  TO  PV-DIVIDEND                        22150002
203900                               DL25-PERCENT-YTD                   22160002
203901        END-IF.                                                   22170002
203902*                                                                 22180002
203903* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH CARTON SHORTAGE  22190002
203904*                                                                 22200002
203905        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           22210002
203906          DIVIDE PV-NBR-RCVR-SHRT-CRTNS-MM                        22220002
203907                                   BY PV-NBR-RCVRS-VRFD-MM        22230002
203908            GIVING PV-DIVIDEND                                    22240002
203909          MULTIPLY PV-DIVIDEND BY 100                             22250002
203910            GIVING DL26-PERCENT-MONTH ROUNDED                     22260002
203911        ELSE                                                      22270002
203912              MOVE ZEROES  TO  PV-DIVIDEND                        22280002
203913                               DL26-PERCENT-MONTH                 22290002
203914        END-IF.                                                   22300002
203915                                                                  22310002
203916        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           22320002
203917          DIVIDE PV-NBR-RCVR-SHRT-CRTNS-YTD                       22330002
203918                                     BY PV-NBR-RCVRS-VRFD-YTD     22340002
203919            GIVING PV-DIVIDEND                                    22350002
203920          MULTIPLY PV-DIVIDEND BY 100                             22360002
203921            GIVING DL26-PERCENT-YTD ROUNDED                       22370002
203922        ELSE                                                      22380002
203923              MOVE ZEROES  TO  PV-DIVIDEND                        22390002
203924                               DL26-PERCENT-YTD                   22400002
203925        END-IF.                                                   22410002
203926*                                                                 22420002
203927* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITHOUT CARTON        22430002
203928*  DIFFERENCE                                                     22440002
203929*                                                                 22450002
203930        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           22460002
203931          DIVIDE PV-NBR-RCVR-NODIFF-CRTNS-MM                      22470002
203932                                   BY PV-NBR-RCVRS-VRFD-MM        22480002
203933            GIVING PV-DIVIDEND                                    22490002
203934          MULTIPLY PV-DIVIDEND BY 100                             22500002
203935            GIVING DL27-PERCENT-MONTH ROUNDED                     22510002
203936        ELSE                                                      22520002
203937              MOVE ZEROES  TO  PV-DIVIDEND                        22530002
203938                               DL27-PERCENT-MONTH                 22540002
203939        END-IF.                                                   22550002
203940                                                                  22560002
203941        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           22570002
203942          DIVIDE PV-NBR-RCVR-NODIFF-CRTNS-YTD                     22580002
203943                                     BY PV-NBR-RCVRS-VRFD-YTD     22590002
203944            GIVING PV-DIVIDEND                                    22600002
203945          MULTIPLY PV-DIVIDEND BY 100                             22610002
203946            GIVING DL27-PERCENT-YTD ROUNDED                       22620002
203947        ELSE                                                      22630002
203948              MOVE ZEROES  TO  PV-DIVIDEND                        22640002
203949                               DL27-PERCENT-YTD                   22650002
203950        END-IF.                                                   22660002
203951*                                                                 22670002
203952* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH UNIT OVERAGE     22680002
203953*                                                                 22690002
203954        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           22700002
203955          DIVIDE PV-NBR-RCVR-OVR-UNITS-MM                         22710002
203956                                   BY PV-NBR-RCVRS-VRFD-MM        22720002
203957            GIVING PV-DIVIDEND                                    22730002
203958          MULTIPLY PV-DIVIDEND BY 100                             22740002
203959            GIVING DL28-PERCENT-MONTH ROUNDED                     22750002
203960        ELSE                                                      22760002
203961              MOVE ZEROES  TO  PV-DIVIDEND                        22770002
203962                               DL28-PERCENT-MONTH                 22780002
203963        END-IF.                                                   22790002
203964                                                                  22800002
203965        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           22810002
203966          DIVIDE PV-NBR-RCVR-OVR-UNITS-YTD                        22820002
203967                                     BY PV-NBR-RCVRS-VRFD-YTD     22830002
203968            GIVING PV-DIVIDEND                                    22840002
203969          MULTIPLY PV-DIVIDEND BY 100                             22850002
203970            GIVING DL28-PERCENT-YTD ROUNDED                       22860002
203971        ELSE                                                      22870002
203972              MOVE ZEROES  TO  PV-DIVIDEND                        22880002
203973                               DL28-PERCENT-YTD                   22890002
203974        END-IF.                                                   22900002
203975*                                                                 22910002
203976* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH UNIT SHORTAGE    22920002
203977*                                                                 22930002
203978        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           22940002
203979          DIVIDE PV-NBR-RCVR-SHRT-UNITS-MM                        22950002
203980                                   BY PV-NBR-RCVRS-VRFD-MM        22960002
203981            GIVING PV-DIVIDEND                                    22970002
203982          MULTIPLY PV-DIVIDEND BY 100                             22980002
203983            GIVING DL29-PERCENT-MONTH ROUNDED                     22990002
203984        ELSE                                                      23000002
203985              MOVE ZEROES  TO  PV-DIVIDEND                        23010002
203986                               DL29-PERCENT-MONTH                 23020002
203987        END-IF.                                                   23030002
203988                                                                  23040002
203989        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           23050002
203990          DIVIDE PV-NBR-RCVR-SHRT-UNITS-YTD                       23060002
203991                                     BY PV-NBR-RCVRS-VRFD-YTD     23070002
203992            GIVING PV-DIVIDEND                                    23080002
203993          MULTIPLY PV-DIVIDEND BY 100                             23090002
203994            GIVING DL29-PERCENT-YTD ROUNDED                       23100002
203995        ELSE                                                      23110002
203996              MOVE ZEROES  TO  PV-DIVIDEND                        23120002
203997                               DL29-PERCENT-YTD                   23130002
203998        END-IF.                                                   23140002
203999*                                                                 23150002
204000* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITHOUT UNIT          23160002
204001*  DIFFERENCE                                                     23170002
204002*                                                                 23180002
204003        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           23190002
204004          DIVIDE PV-NBR-RCVR-NODIFF-UNITS-MM                      23200002
204005                                   BY PV-NBR-RCVRS-VRFD-MM        23210002
204006            GIVING PV-DIVIDEND                                    23220002
204007          MULTIPLY PV-DIVIDEND BY 100                             23230002
204008            GIVING DL30-PERCENT-MONTH ROUNDED                     23240002
204009        ELSE                                                      23250002
204010              MOVE ZEROES  TO  PV-DIVIDEND                        23260002
204011                               DL30-PERCENT-MONTH                 23270002
204012        END-IF.                                                   23280002
204013                                                                  23290002
204014        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           23300002
204015          DIVIDE PV-NBR-RCVR-NODIFF-UNITS-YTD                     23310002
204016                                     BY PV-NBR-RCVRS-VRFD-YTD     23320002
204017            GIVING PV-DIVIDEND                                    23330002
204018          MULTIPLY PV-DIVIDEND BY 100                             23340002
204019            GIVING DL30-PERCENT-YTD ROUNDED                       23350002
204020        ELSE                                                      23360002
204021              MOVE ZEROES  TO  PV-DIVIDEND                        23370002
204022                               DL30-PERCENT-YTD                   23380002
204023        END-IF.                                                   23390002
204024*                                                                 23400002
204025* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH EXT RETAIL       23410002
204026* OVERAGE                                                         23420002
204027*                                                                 23430002
204028        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           23440002
204029          DIVIDE PV-NBR-RCVR-OVR-RTL-MM                           23450002
204030                                   BY PV-NBR-RCVRS-VRFD-MM        23460002
204031            GIVING PV-DIVIDEND                                    23470002
204032          MULTIPLY PV-DIVIDEND BY 100                             23480002
204033            GIVING DL31-PERCENT-MONTH ROUNDED                     23490002
204034        ELSE                                                      23500002
204035              MOVE ZEROES  TO  PV-DIVIDEND                        23510002
204036                               DL31-PERCENT-MONTH                 23520002
204037        END-IF.                                                   23530002
204038                                                                  23540002
204039        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           23550002
204040          DIVIDE PV-NBR-RCVR-OVR-RTL-YTD                          23560002
204041                                     BY PV-NBR-RCVRS-VRFD-YTD     23570002
204042            GIVING PV-DIVIDEND                                    23580002
204043          MULTIPLY PV-DIVIDEND BY 100                             23590002
204044            GIVING DL31-PERCENT-YTD ROUNDED                       23600002
204045        ELSE                                                      23610002
204046              MOVE ZEROES  TO  PV-DIVIDEND                        23620002
204047                               DL31-PERCENT-YTD                   23630002
204048        END-IF.                                                   23640002
204049*                                                                 23650002
204050* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITH EXT RETAIL       23660002
204051*  SHORTAGE                                                       23670002
204052*                                                                 23680002
204053        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           23690002
204054          DIVIDE PV-NBR-RCVR-SHRT-RTL-MM                          23700002
204055                                   BY PV-NBR-RCVRS-VRFD-MM        23710002
204056            GIVING PV-DIVIDEND                                    23720002
204057          MULTIPLY PV-DIVIDEND BY 100                             23730002
204058            GIVING DL32-PERCENT-MONTH ROUNDED                     23740002
204059        ELSE                                                      23750002
204060              MOVE ZEROES  TO  PV-DIVIDEND                        23760002
204061                               DL32-PERCENT-MONTH                 23770002
204062        END-IF.                                                   23780002
204063                                                                  23790002
204064        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           23800002
204065          DIVIDE PV-NBR-RCVR-SHRT-RTL-YTD                         23810002
204066                                     BY PV-NBR-RCVRS-VRFD-YTD     23820002
204067            GIVING PV-DIVIDEND                                    23830002
204068          MULTIPLY PV-DIVIDEND BY 100                             23840002
204069            GIVING DL32-PERCENT-YTD ROUNDED                       23850002
204070        ELSE                                                      23860002
204071              MOVE ZEROES  TO  PV-DIVIDEND                        23870002
204072                               DL32-PERCENT-YTD                   23880002
204073        END-IF.                                                   23890002
204074*                                                                 23900002
204075* PERCENT TO TOTALS FOR NUMBER OF RECEIVERS WITHOUT EXT RETAIL    23910002
204076*  DIFFERENCE                                                     23920002
204077*                                                                 23930002
204078        IF PV-NBR-RCVRS-VRFD-MM  > ZERO                           23940002
204079          DIVIDE PV-NBR-RCVR-NODIFF-RTL-MM                        23950002
204080                                   BY PV-NBR-RCVRS-VRFD-MM        23960002
204081            GIVING PV-DIVIDEND                                    23970002
204082          MULTIPLY PV-DIVIDEND BY 100                             23980002
204083            GIVING DL33-PERCENT-MONTH ROUNDED                     23990002
204084        ELSE                                                      24000002
204085              MOVE ZEROES  TO  PV-DIVIDEND                        24010002
204086                               DL33-PERCENT-MONTH                 24020002
204087        END-IF.                                                   24030002
204088                                                                  24040002
204089        IF PV-NBR-RCVRS-VRFD-YTD > ZERO                           24050002
204090          DIVIDE PV-NBR-RCVR-NODIFF-RTL-YTD                       24060002
204091                                     BY PV-NBR-RCVRS-VRFD-YTD     24070002
204092            GIVING PV-DIVIDEND                                    24080002
204093          MULTIPLY PV-DIVIDEND BY 100                             24090002
204094            GIVING DL33-PERCENT-YTD ROUNDED                       24100002
204095        ELSE                                                      24110002
204096              MOVE ZEROES  TO  PV-DIVIDEND                        24120002
204097                               DL33-PERCENT-YTD                   24130002
204098        END-IF.                                                   24140002
204099*                                                                 24150002
204100* PERCENT TO TOTALS FOR NUMBER OF LINES WITH UNIT OVERAGE         24160002
204101*                                                                 24170002
204102        IF PV-NBR-LINES-VRFD-MM  > ZERO                           24180002
204103          DIVIDE PV-NBR-LINE-OVR-UNITS-MM                         24190002
204104                                   BY PV-NBR-LINES-VRFD-MM        24200002
204105            GIVING PV-DIVIDEND                                    24210002
204106          MULTIPLY PV-DIVIDEND BY 100                             24220002
204107            GIVING DL34-PERCENT-MONTH ROUNDED                     24230002
204108        ELSE                                                      24240002
204109              MOVE ZEROES  TO  PV-DIVIDEND                        24250002
204110                               DL34-PERCENT-MONTH                 24260002
204111        END-IF.                                                   24270002
204112                                                                  24280002
204113        IF PV-NBR-LINES-VRFD-YTD > ZERO                           24290002
204114          DIVIDE PV-NBR-LINE-OVR-UNITS-YTD                        24300002
204115                                     BY PV-NBR-LINES-VRFD-YTD     24310002
204116            GIVING PV-DIVIDEND                                    24320002
204117          MULTIPLY PV-DIVIDEND BY 100                             24330002
204118            GIVING DL34-PERCENT-YTD ROUNDED                       24340002
204119        ELSE                                                      24350002
204120              MOVE ZEROES  TO  PV-DIVIDEND                        24360002
204121                               DL34-PERCENT-YTD                   24370002
204122        END-IF.                                                   24380002
204123*                                                                 24390002
204124* PERCENT TO TOTALS FOR NUMBER OF LINES WITH UNIT SHORTAGE        24400002
204125*                                                                 24410002
204126        IF PV-NBR-LINES-VRFD-MM  > ZERO                           24420002
204127          DIVIDE PV-NBR-LINE-SHRT-UNITS-MM                        24430002
204128                                   BY PV-NBR-LINES-VRFD-MM        24440002
204129            GIVING PV-DIVIDEND                                    24450002
204130          MULTIPLY PV-DIVIDEND BY 100                             24460002
204131            GIVING DL35-PERCENT-MONTH ROUNDED                     24470002
204132        ELSE                                                      24480002
204133              MOVE ZEROES  TO  PV-DIVIDEND                        24490002
204134                               DL35-PERCENT-MONTH                 24500002
204135        END-IF.                                                   24510002
204136                                                                  24520002
204137        IF PV-NBR-LINES-VRFD-YTD > ZERO                           24530002
204138          DIVIDE PV-NBR-LINE-SHRT-UNITS-YTD                       24540002
204139                                     BY PV-NBR-LINES-VRFD-YTD     24550002
204140            GIVING PV-DIVIDEND                                    24560002
204141          MULTIPLY PV-DIVIDEND BY 100                             24570002
204142            GIVING DL35-PERCENT-YTD ROUNDED                       24580002
204143        ELSE                                                      24590002
204144              MOVE ZEROES  TO  PV-DIVIDEND                        24600002
204145                               DL32-PERCENT-YTD                   24610002
204146        END-IF.                                                   24620002
204147*                                                                 24630002
204148* PERCENT TO TOTALS FOR NUMBER OF LINES WITHOUT UNIT DIFFERENCE   24640002
204149*                                                                 24650002
204150        IF PV-NBR-LINES-VRFD-MM  > ZERO                           24660002
204151          DIVIDE PV-NBR-LINE-NODIFF-UNITS-MM                      24670002
204152                                   BY PV-NBR-LINES-VRFD-MM        24680002
204153            GIVING PV-DIVIDEND                                    24690002
204154          MULTIPLY PV-DIVIDEND BY 100                             24700002
204155            GIVING DL36-PERCENT-MONTH ROUNDED                     24710002
204156        ELSE                                                      24720002
204157              MOVE ZEROES  TO  PV-DIVIDEND                        24730002
204158                               DL36-PERCENT-MONTH                 24740002
204159        END-IF.                                                   24750002
204160                                                                  24760002
204161        IF PV-NBR-LINES-VRFD-YTD > ZERO                           24770002
204162          DIVIDE PV-NBR-LINE-NODIFF-UNITS-YTD                     24780002
204163                                     BY PV-NBR-LINES-VRFD-YTD     24790002
204164            GIVING PV-DIVIDEND                                    24800002
204165          MULTIPLY PV-DIVIDEND BY 100                             24810002
204166            GIVING DL36-PERCENT-YTD ROUNDED                       24820002
204167        ELSE                                                      24830002
204168              MOVE ZEROES  TO  PV-DIVIDEND                        24840002
204169                               DL36-PERCENT-YTD                   24850002
204170        END-IF.                                                   24860002
204171*                                                                 24870002
204172* PERCENT TO TOTALS FOR NUMBER OF LINES WITH EXT RETAIL           24880002
204173* OVERAGE                                                         24890002
204174*                                                                 24900002
204175        IF PV-NBR-LINES-VRFD-MM  > ZERO                           24910002
204176          DIVIDE PV-NBR-LINE-OVR-RTL-MM                           24920002
204177                                   BY PV-NBR-LINES-VRFD-MM        24930002
204178            GIVING PV-DIVIDEND                                    24940002
204179          MULTIPLY PV-DIVIDEND BY 100                             24950002
204180            GIVING DL37-PERCENT-MONTH ROUNDED                     24960002
204181        ELSE                                                      24970002
204182              MOVE ZEROES  TO  PV-DIVIDEND                        24980002
204183                               DL37-PERCENT-MONTH                 24990002
204184        END-IF.                                                   25000002
204185                                                                  25010002
204186        IF PV-NBR-LINES-VRFD-YTD > ZERO                           25020002
204187          DIVIDE PV-NBR-LINE-OVR-RTL-YTD                          25030002
204188                                     BY PV-NBR-LINES-VRFD-YTD     25040002
204189            GIVING PV-DIVIDEND                                    25050002
204190          MULTIPLY PV-DIVIDEND BY 100                             25060002
204191            GIVING DL37-PERCENT-YTD ROUNDED                       25070002
204192        ELSE                                                      25080002
204193              MOVE ZEROES  TO  PV-DIVIDEND                        25090002
204194                               DL37-PERCENT-YTD                   25100002
204195        END-IF.                                                   25110002
204196*                                                                 25120002
204197* PERCENT TO TOTALS FOR NUMBER OF LINES WITH EXT RETAIL           25130002
204198*  SHORTAGE                                                       25140002
204199*                                                                 25150002
204200        IF PV-NBR-LINES-VRFD-MM  > ZERO                           25160002
204201          DIVIDE PV-NBR-LINE-SHRT-RTL-MM                          25170002
204202                                   BY PV-NBR-LINES-VRFD-MM        25180002
204203            GIVING PV-DIVIDEND                                    25190002
204204          MULTIPLY PV-DIVIDEND BY 100                             25200002
204205            GIVING DL38-PERCENT-MONTH ROUNDED                     25210002
204206        ELSE                                                      25220002
204207              MOVE ZEROES  TO  PV-DIVIDEND                        25230002
204208                               DL38-PERCENT-MONTH                 25240002
204209        END-IF.                                                   25250002
204210                                                                  25260002
204211        IF PV-NBR-LINES-VRFD-YTD > ZERO                           25270002
204212          DIVIDE PV-NBR-LINE-SHRT-RTL-YTD                         25280002
204213                                     BY PV-NBR-LINES-VRFD-YTD     25290002
204214            GIVING PV-DIVIDEND                                    25300002
204215          MULTIPLY PV-DIVIDEND BY 100                             25310002
204216            GIVING DL38-PERCENT-YTD ROUNDED                       25320002
204217        ELSE                                                      25330002
204218              MOVE ZEROES  TO  PV-DIVIDEND                        25340002
204219                               DL38-PERCENT-YTD                   25350002
204220        END-IF.                                                   25360002
204221*                                                                 25370002
204222* PERCENT TO TOTALS FOR NUMBER OF LINES WITHOUT EXT RETAIL        25380002
204223*  DIFFERENCE                                                     25390002
204224*                                                                 25400002
204225        IF PV-NBR-LINES-VRFD-MM  > ZERO                           25410002
204226          DIVIDE PV-NBR-LINE-NODIFF-RTL-MM                        25420002
204227                                   BY PV-NBR-LINES-VRFD-MM        25430002
204228            GIVING PV-DIVIDEND                                    25440002
204229          MULTIPLY PV-DIVIDEND BY 100                             25450002
204230            GIVING DL39-PERCENT-MONTH ROUNDED                     25460002
204231        ELSE                                                      25470002
204232              MOVE ZEROES  TO  PV-DIVIDEND                        25480002
204233                               DL39-PERCENT-MONTH                 25490002
204234        END-IF.                                                   25500002
204235                                                                  25510002
204236        IF PV-NBR-LINES-VRFD-YTD > ZERO                           25520002
204237          DIVIDE PV-NBR-LINE-NODIFF-RTL-YTD                       25530002
204238                                     BY PV-NBR-LINES-VRFD-YTD     25540002
204239            GIVING PV-DIVIDEND                                    25550002
204240          MULTIPLY PV-DIVIDEND BY 100                             25560002
204241            GIVING DL39-PERCENT-YTD ROUNDED                       25570002
204242        ELSE                                                      25580002
204243              MOVE ZEROES  TO  PV-DIVIDEND                        25590002
204244                               DL39-PERCENT-YTD                   25600002
204245        END-IF.                                                   25610002
270000*                                                                 25620001
280400******************************************************************25630001
280500 8000-WRITE-MAIN-HEADINGS.                                        25640001
280600******************************************************************25650001
280700*                                                                 25660001
280800     ADD 1                         TO PV-PAGE-COUNT.              25670001
280900     MOVE PV-PAGE-COUNT            TO DP132O-PAGE-NUMBER.         25680001
281000     MOVE ZERO                     TO PV-LINE-COUNT.              25690001
281100                                                                  25700001
281200     WRITE REPORT-RECORD   FROM                                   25710001
281300         DP132O-STANDRD-HEADER-132-COLS                           25720001
281400         AFTER ADVANCING PAGE                                     25730001
281500*    WRITE REPORT-RECORD   FROM DL-BLANK-LINE                     25740017
281600*        AFTER ADVANCING 1 LINE                                   25750017
281700     WRITE REPORT-RECORD   FROM HL-HEADING-LINE-1                 25760017
281800         AFTER ADVANCING 1 LINES                                  25770001
281810     WRITE REPORT-RECORD   FROM HL-HEADING-LINE-2                 25780017
281820         AFTER ADVANCING 1 LINES                                  25790017
281900     ADD 4                            TO PV-LINE-COUNT.           25800017
282000/                                                                 25810001
282100******************************************************************25820001
282200 8100-WRITE-SUB-HEADINGS.                                         25830001
282300******************************************************************25840001
282400*                                                                 25850001
283400     WRITE REPORT-RECORD   FROM HL-HEADING-LINE-3                 25860001
283500        AFTER ADVANCING 2 LINES.                                  25870001
283600     WRITE REPORT-RECORD   FROM HL-HEADING-LINE-4                 25880001
283700        AFTER ADVANCING 1 LINES.                                  25890001
283800                                                                  25900001
283900     ADD 3                       TO PV-LINE-COUNT.                25910001
284000*                                                                 25920001
284100******************************************************************25930001
284200 9000-EOJ.                                                        25940001
284300******************************************************************25950001
284400*                                                                 25960001
284500     WRITE REPORT-RECORD   FROM ER-END-OF-REPORT-LINE             25970001
284600        AFTER ADVANCING 1 LINES.                                  25980001
284700                                                                  25990001
284800*CLOSE FILES.                                                     26000001
284900     CLOSE EXTRACT-FILE-1                                         26010001
285100     CLOSE REPORT-FILE.                                           26020001
285200/                                                                 26030001
285300******************************************************************26040001
285400 9200-SQL-ABEND.                                                  26050001
285500******************************************************************26060001
285600                                                                  26070001
285700     MOVE SQLCODE                     TO SQLCODE2.                26080001
285800     MOVE SQLERRD(3)                  TO SQLERRD3.                26090001
285900                                                                  26100001
286000     DISPLAY '** ABEND **         ** = SQLERROR'.                 26110001
286100     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME.        26120001
286200     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH.                   26130001
286300     DISPLAY '** OPERATION ** = ' PV-DB2-FUNCTION.                26140001
286400     DISPLAY '*** MESSAGE     = ' PV-DB2-OPERATION-MESSAGE-1.     26150001
286500     DISPLAY '***             = ' PV-DB2-OPERATION-MESSAGE-2.     26160001
286600     DISPLAY '***             = ' PV-DB2-OPERATION-MESSAGE-3.     26170001
286700                                                                  26180001
286800     DISPLAY '** SQLCODE          ** = ' SQLCODE2.                26190001
286900     DISPLAY '** ROWS PROCESSED   ** = ' SQLERRD3.                26200001
287000     DISPLAY '** SQLERRM          ** = ' SQLERRM.                 26210001
287100     DISPLAY '** SQLERRMC         ** = ' SQLERRMC.                26220001
287200                                                                  26230001
287300                                                                  26240001
287400     MOVE +4013                       TO PV-ABEND-CODE.           26250001
287500     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         26260001
287600                                                                  26270001
287700******************************************************************26280001
287800 9300-SQL-WARNING.                                                26290001
287900******************************************************************26300001
288000                                                                  26310001
288100     DISPLAY '9300-SQL-WARNING'.                                  26320001
288200     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME.        26330001
288300     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH.                   26340001
288400     DISPLAY '** OPERATION ** = ' PV-DB2-FUNCTION.                26350001
288500                                                                  26360001
288600     MOVE SQLCODE                     TO SQLCODE2.                26370001
288700     MOVE SQLERRD(3)                  TO SQLERRD3.                26380001
288800     DISPLAY '** ABEND **       ** = SQLWARNING'.                 26390001
288900     DISPLAY '** SQLCODE        ** = ' SQLCODE2.                  26400001
289000     DISPLAY '** ROWS PROCESSED ** = ' SQLERRD3.                  26410001
289100     DISPLAY '** SQLWARN0       ** = ' SQLWARN0.                  26420001
289200     DISPLAY '** SQLWARN1       ** = ' SQLWARN1.                  26430001
289300     DISPLAY '** SQLWARN2       ** = ' SQLWARN2.                  26440001
289400     DISPLAY '** SQLWARN3       ** = ' SQLWARN3.                  26450001
289500     DISPLAY '** SQLWARN4       ** = ' SQLWARN4.                  26460001
289600     DISPLAY '** SQLWARN5       ** = ' SQLWARN5.                  26470001
289700     DISPLAY '** SQLWARN6       ** = ' SQLWARN6.                  26480001
289800     DISPLAY '** SQLWARN7       ** = ' SQLWARN7.                  26490001
289900                                                                  26500001
290000     MOVE +4013                       TO PV-ABEND-CODE.           26510001
290100     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         26520001
290200*                                                                 26530001
290300******************************************************************26540001
290400*  PERFORMS A NON-SQL ABEND FOR THE PROGRAM                       26550001
290500******************************************************************26560001
290600 9400-ABEND.                                                      26570001
290700*                                                                 26580001
290800     DISPLAY '***************************'.                       26590001
290900     DISPLAY '**       ABEND           **'.                       26600001
291000     DISPLAY '**  IN PROGRAM RCKRP036  **'.                       26610001
291100     DISPLAY '***************************'.                       26620001
291200     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH.             26630001
291300     DISPLAY '**   ERROR         ** = ' DP003-RETURN-MSG.         26640001
291400     DISPLAY '**                 ** = ' PV-ERROR-MESSAGE-1.       26650001
291500     DISPLAY '**                 ** = ' PV-ERROR-MESSAGE-2.       26660001
291600                                                                  26670001
291700     MOVE +4014                  TO PV-ABEND-CODE.                26680001
291800     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         26690001
291900*                                                                 26700001
292000******************************************************************26710001
