000100 RC001-RETURN-MSG.                                                        
000200                                                                          
000300     EXEC CICS                                                            
000400         ASSIGN                                                           
000500         USERID (RC001-USERID)                                            
000600     END-EXEC                                                             
000700                                                                          
000800     MOVE SQLCODE                     TO RC001-SAVE-SQLCODE               
000900     EXEC SQL                                                             
001000         SELECT                                                           
001100             CURRENT_DATE                                                 
001200           , CURRENT_TIME                                                 
001300         INTO                                                             
001400             :RC001-DATE                                                  
001500           , :RC001-TIME                                                  
001600         FROM TCOCNTL                                                     
001700     END-EXEC                                                             
001800                                                                          
001900     EXEC CICS                                                            
002000         ENQ                                                              
002100         RESOURCE (RC001-LOG-QUEUE)                                       
002200     END-EXEC                                                             
002300                                                                          
002400     MOVE RC809-PREPACK-PGM-NBR       TO RC001-PREPACK-PGM-NBR            
002500     MOVE RC809-PREPACK-ERROR-NBR     TO RC001-PREPACK-ERROR-NBR          
002600     MOVE RC809-OPER-UNT-ID           TO RC001-OPER-UNT-ID                
002700     MOVE RC809-FCLTY-ID              TO RC001-FCLTY-ID                   
002800     MOVE RC809-PO-NBR                TO RC001-PO-NBR                     
002900     MOVE RC809-REC-SEQ-NBR           TO RC001-REC-SEQ-NBR                
003000     MOVE RC809-PREPK-ID              TO RC001-PREPK-ID                   
003100     MOVE RC001-SAVE-SQLCODE          TO RC001-SQLCODE                    
003200                                                                          
003300*    HOST PROGRAM MOVES LINE AND STORE NUMBERS                            
003400                                                                          
003500     MOVE SPACES                      TO RC001-LOG-LINE                   
003600     PERFORM RC001-WRITE-CSSL.                                            
003700                                                                          
003800     MOVE RC001-LINE-00               TO RC001-LOG-LINE                   
003900     PERFORM RC001-WRITE-CSSL.                                            
004000                                                                          
004100     MOVE RC001-LINE-01               TO RC001-LOG-LINE                   
004200     PERFORM RC001-WRITE-CSSL.                                            
004300                                                                          
004400     MOVE RC001-LINE-02               TO RC001-LOG-LINE                   
004500     PERFORM RC001-WRITE-CSSL.                                            
004600                                                                          
004700     MOVE SPACES                      TO RC001-LOG-LINE                   
004800     PERFORM RC001-WRITE-CSSL.                                            
004900                                                                          
005000     EXEC CICS                                                            
005100         DEQ                                                              
005200         RESOURCE (RC001-LOG-QUEUE)                                       
005300     END-EXEC.                                                            
005301                                                                          
005310     PERFORM RC001-GOBACK.                                                
005400                                                                          
005500 RC001-WRITE-CSSL.                                                        
005600     EXEC CICS                                                            
005700         WRITEQ TD                                                        
005800             QUEUE (RC001-LOG-QUEUE)                                      
005900             FROM  (RC001-LOG-LINE)                                       
006000             RESP (RC001-CICS-RESPONSE)                                   
006100     END-EXEC.                                                            
006200                                                                          
006300     IF RC001-CICS-RESPONSE = DFHRESP(NORMAL)                             
006400         CONTINUE                                                         
006500     ELSE                                                                 
006600         EXEC CICS                                                        
006700             ABEND                                                        
006800                 ABCODE (EIBTRMID)                                        
006900         END-EXEC                                                         
007000     END-IF.                                                              
007100 RC001-GOBACK.                                                            
007200     PERFORM 0000-GOBACK.                                                 
007300                                                                          
