000010************************************************************      00010000
000020*    RCRD048 - FILE LAYOUT FOR A FILE TO BE USED TO CREATE        00020000
000021*              A REPORT LISTING THOSE ITEMS/STORES THAT           00030000
000022*              RECEIVED MERCHANDISE WHERE THE RETAIL PRICE        00040000
000023*              ON THE PURCHASE ORDER WAS DIFFERENT THAN THE       00050000
000024*              CURRENT SELLING PRICE FOUND ON THE ITEM            00060000
000025*              TABLES.                                            00070000
000030*                                                                 00080000
000040*    RECORD LENGTH - 140 BYTES                                    00090000
000050************************************************************      00100000
000060************************************************************      00110000
000070*                                            WR # 21361    *      00120000
000080* THE DASHES UNDER GROUP ITEM RC048-SKU-NBR HAVE BEEN      *      00130000
000090* REMOVED AND RC048-DEPT AND RC048-CLASS HAS BEEN REMOVED  *      00140000
000091* FROM 10 LEVEL TO 05 LEVEL. A VARIABLE RC048-SKU-NBR X(8) *      00150000
000092* HAS BEEN ADDED AT THE END AND THE SIZE OF LAST FILLER    *      00160000
000093* HAS BEEN REDUCED TO 48 FROM 51.                          *      00170000
000094************************************************************      00180000
000100 01  RC048-PRICE-DIFFERENCES.                                     00190000
000300     05  RC048-PO                    PIC  9(08).                  00200000
000310     05  RC048-REC-SEQ-NBR           PIC  9(09).                  00210000
000320     05  RC048-POLINENO              PIC  9(04).                  00220000
000321     05  RC048-STORE                 PIC  9(04).                  00230000
000500     05  RC048-DEPT                  PIC  X(03).                  00240000
000600     05  RC048-CLASS                 PIC  X(02).                  00250000
002800     05  RC048-PO-UNIT-RETAIL        PIC  S9(07)V99.              00260000
002810     05  RC048-STORE-UNIT-RETAIL     PIC  S9(07)V99.              00270000
002900     05  RC048-SKU-STATUS            PIC  X(15).                  00280000
003000     05  RC048-RETAIL-STATUS         PIC  X(15).                  00290000
003200     05  RC048-RETAIL-UNITS-MARK     PIC  S9(06).                 00300000
003300     05  RC048-SKU-NBR               PIC  X(08).                  00310000
005700     05  RC048-VERIFY-DATE.                                       00320012
               10 RC048-VERIFY-YEAR.                                    00330014
                  15 RC048-VERIFY-CC       PIC  9(02).                  00340014
                  15 RC048-VERIFY-YY       PIC  9(02).                  00350014
005700         10 FILLER                   PIC  X(01) VALUE '-'.        00360015
               10 RC048-VERIFY-MM          PIC  9(02).                  00370012
005700         10 FILLER                   PIC  X(01) VALUE '-'.        00380015
               10 RC048-VERIFY-DD          PIC  9(02).                  00390012
005700     05  FILLER                      PIC  X(38).                  00400014
005800************************************************************      00410000
005810* CHANGES MADE FOR WR # 21361 ENDS HERE.                   *      00420000
005900************************************************************      00430000
