000100******************************************************************00010000
000200**                        RCRD104                               **00020000
000300**                                                              **00030000
000400**  EXTRACT FILE OF ASN PO ITEM DATA FOR MULTI SKU REPURPOSING  **00040000
000410**                                                              **00041000
000420**  LENGTH:  100 BYTES                                          **00042000
000430******************************************************************00043000
000440 01  RC104-SKU-SORT-DTL-REC.                                      00044000
000450     05  RC104-KOHLS-ORD-NBR            PIC  9(09).               00045000
000451     05  RC104-VENDR-ORD-NBR            PIC  9(09).               00045100
000452     05  RC104-DC-NBR                   PIC  9(04).               00045200
000453     05  RC104-SEQ-NBR                  PIC  9(04).               00045300
000454     05  RC104-SKU-NBR                  PIC  9(08).               00045400
000455     05  RC104-UPC-NBR                  PIC  9(15).               00045500
000456     05  RC104-SHIP-QTY                 PIC  9(05).               00045600
000457     05  RC104-DEPT-NBR                 PIC  9(04).               00045700
000458     05  FILLER                         PIC  X(42).               00045800
