000100***************************************************************** 00010000
000200*    COPYBOOK NAME:  RCRD082                                    * 00020000
000300*    RECORD PURPOSE: THIS RECORD LAYOUT IS USED TO ACCUMULATE   * 00030000
000400*                    VARIOUS STATISTICS FOR BATCH PROCESSES     * 00040000
000500*                    ASSOCIATED TO THE RECEIVING PROCESS.  IT   * 00050000
000600*                    IS INTENDED TO LOG BEGIN AND END TIMES     * 00060000
000700*                    FOR THE PROGRAM AND KEEP INFORMATION LIKE  * 00070000
000800*                    RECORDS IN, RECORDS OUT, ETC...            * 00080000
000900*    RECORD LENGTH:  215                                        * 00090003
001000*    RECORD FORMAT:  SEQUENTIAL                                 * 00100000
001100***************************************************************** 00110000
001200                                                                  00120000
001300 01  RC082-STAT-DATA-RECORD.                                      00130000
001400     05  RC082-PGM-NM                     PIC  X(08).             00140001
001401     05  RC082-PGM-DESC                   PIC  X(50).             00140101
001402     05  RC082-RECV-PROCESS-JOB-NBR       PIC  X(08).             00140201
001403         88  RC082-ASN-PRE-RECV-NTERFACE  VALUE 'RCK090  '.       00140305
001404         88  RC082-OLD-ASN-SNK-PRINT      VALUE 'SNK005  '.       00140404
001405         88  RC082-TRNS-CSEPK-PROCESS-1   VALUE 'RCK066  '.       00140507
001406         88  RC082-TRNS-CSEPK-PROCESS-2   VALUE 'RCK067  '.       00140607
001407     05  RC082-PGM-IN-JOB-SEQ-NBR         PIC  9(03).             00140707
001408     05  RC082-DISP-FROM-PGM-SEQ-NBR      PIC  9(02).             00140807
001409     05  RC082-PGM-END-CDE                PIC  X(01).             00140907
001410         88  RC082-PGM-END-SUCCESS        VALUE 'S'.              00141007
001411         88  RC082-PGM-END-FAILURE        VALUE 'F'.              00141107
001412     05  RC082-PGM-START-TMST             PIC  X(26).             00141207
001413     05  FILLER REDEFINES RC082-PGM-START-TMST.                   00141307
001414         10  RC082-PS-TMST-YY             PIC  X(04).             00141407
001415         10  FILLER                       PIC  X(01).             00141507
001416         10  RC082-PS-TMST-MM             PIC  X(02).             00141607
001417         10  FILLER                       PIC  X(01).             00141707
001418         10  RC082-PS-TMST-DD             PIC  X(02).             00141807
001419         10  FILLER                       PIC  X(01).             00141907
001420         10  RC082-PS-TMST-HRS            PIC  X(02).             00142007
001421         10  FILLER                       PIC  X(01).             00142107
001422         10  RC082-PS-TMST-MIN            PIC  X(02).             00142207
001423         10  FILLER                       PIC  X(01).             00142307
001424         10  RC082-PS-TMST-SEC            PIC  X(02).             00142407
001425         10  FILLER                       PIC  X(07).             00142507
001430     05  RC082-PGM-END-TMST               PIC  X(26).             00143006
001431     05  FILLER REDEFINES RC082-PGM-END-TMST.                     00143106
001440         10  RC082-PE-TMST-YY             PIC  X(04).             00144001
001450         10  FILLER                       PIC  X(01).             00145001
001460         10  RC082-PE-TMST-MM             PIC  X(02).             00146001
001470         10  FILLER                       PIC  X(01).             00147001
001480         10  RC082-PE-TMST-DD             PIC  X(02).             00148001
001490         10  FILLER                       PIC  X(01).             00149001
001491         10  RC082-PE-TMST-HRS            PIC  X(02).             00149101
001492         10  FILLER                       PIC  X(01).             00149201
001493         10  RC082-PE-TMST-MIN            PIC  X(02).             00149301
001494         10  FILLER                       PIC  X(01).             00149401
001495         10  RC082-PE-TMST-SEC            PIC  X(02).             00149501
001496         10  FILLER                       PIC  X(07).             00149601
001497     05  RC082-OPER-UNT-ID                PIC  9(05).             00149701
001498         88  RC082-COMPANY-OPER-UNT-ID    VALUE 99999.            00149801
001499     05  RC082-STAT-DATA-DESC             PIC  X(50).             00149901
001500     05  RC082-STAT-DATA-QTY              PIC  9(09).             00150001
001510     05  RC082-PROCESS-GROUP-DESC         PIC  X(05).             00151004
001520         88  RC082-ASN-TO-RECV-GROUP      VALUE 'ASNRV'.          00152004
001600     05  FILLER                           PIC  X(22).             00160004
