000100***********************************************************************   
000101* THIS FILE IS CREATED BY RCKUT194 - IT WILL CONTAIN ANY PREPACK ORDER*   
000102* WHERE AT LEAST 1 LINE ON THE PREPACK IS VERIFIED, BUT NOT ALL LINES *   
000103* ON THE PREPACK HAVE VERIFIED YET.                                   *   
000104*   JOB RCK012 WILL BE USED TO SEND AN EMAIL ALERT TO THE DC.         *   
000105*   RECORD LENGTH:  80                                                *   
000106***********************************************************************   
000107 01  RC123-PREPK-RCVR-VE-REC.                                             
000110     05  RC123-OPER-UNT-ID            PIC  S9(04) COMP.                   
000123     05  RC123-ORD-NBR                PIC  S9(09) COMP.                   
000200     05  RC123-REC-SEQ-NBR            PIC  S9(09) COMP.                   
000300     05  RC123-RCVR-STATUS            PIC   X(02).                        
000400     05  RC123-PKGNG-CDE              PIC   X(01).                        
000500     05  RC123-VE-ORD-LNE-NBR         PIC  S9(09) COMP.                   
000600     05  RC123-VE-PREPK-ID            PIC  S9(04) COMP.                   
000700     05  RC123-PREPK-DRVR-LNE-CDE     PIC   X(01).                        
000800     05  RC123-VE-LINE-STATUS         PIC   X(02).                        
000900     05  RC123-VE-LINE-STATUS-TMST    PIC   X(26).                        
001000     05  RC123-NOT-VE-ORD-LNE-NBR     PIC  S9(09) COMP.                   
001100     05  RC123-NOT-VE-LNE-STATUS      PIC   X(02).                        
001200     05  RC123-NOT-VE-PREPK-ID        PIC  S9(04) COMP.                   
001300     05  FILLER                       PIC   X(24).                        
