000100 01  RC044-REC.                                                           
000200     05 RC044-GMM-NBR                 PIC   X(02).                        
000300     05 RC044-DMM-NBR                 PIC   X(02).                        
000400     05 RC044-GMM-NAME                PIC   X(25).                        
000400     05 RC044-DMM-NAME                PIC   X(25).                        
000500     05 RC044-VRFYD-QTY               PIC   S9(09) COMP-3.                
000600     05 RC044-GOH-QTY                 PIC   S9(09) COMP-3.                
000700     05 RC044-PRETKT-QTY              PIC   S9(09) COMP-3.                
000800     05 RC044-SINGLE-QTY              PIC   S9(09) COMP-3.                
000900     05 RC044-MULTI-QTY               PIC   S9(09) COMP-3.                
001000     05 RC044-INNER-QTY               PIC   S9(09) COMP-3.                
001000     05 RC044-BULK-QTY                PIC   S9(09) COMP-3.                
001000     05 RC044-CASE-QTY                PIC   S9(09) COMP-3.                
001000     05 RC044-PBS-QTY                 PIC   S9(09) COMP-3.                
00008      05 RC044-CROSS-DOCK-QTY          PIC   S9(09) COMP-3.        RCRD010 
00008      05 RC044-NON-CROSS-DOCK-QTY      PIC   S9(09) COMP-3.        RCRD010 
00008      05 FILLER                        PIC   X(26).                RCRD010 
