000100***************************************************************** 00010000
000200*    RCRD114                                                    * 00020000
000300*    RECORD: ASN download to 3rd party (Geodis)                 * 00030000
000310*            po information                                     * 00031002
000400***************************************************************** 00040000
000474 01 asnDetail.                                                    00047406
000475    05 poInfo.                                                    00047506
000477       10 poNumber                  PIC 9(09).                    00047706
000478       10 poCtnQty                  PIC 9(09).                    00047806
000479       10 vendorPoNbr               PIC X(10).                    00047908
000480       10 setYear                   PIC X(04).                    00048011
000481       10 setShortName              PIC X(05).                    00048111
000482       10 dcDetail.                                               00048211
000483          15 dcLocationDetail.                                    00048311
000484             20 dcNumber            PIC 9(04).                    00048411
000485             20 masterCartonInfo.                                 00048511
000486                25 masterCartonId   PIC X.                        00048611
