000100******************************************************************00010000
000200**                        RCRD100                               **00020000
000300**                                                              **00030000
000400**  EXTRACT FILE OF EFC FREE ASTRAY RECEIVERS THAT ARE NOT      **00040000
000410**  VERIFIED.  CREATED BY RCKUT092.  EXTRACT FILE WILL BE       **00041000
000420**  USED BY RCKUP067 TO VERIFY THE RECEIVERS.                   **00042000
000430**                                                              **00043000
000440**  LENGTH:  200 BYTES                                          **00044000
000450******************************************************************00045000
000460 01  RC100-EFC-RCVR-REC.                                          00046000
000470     05  RC100-CURR-OPER-UNIT           PIC  9(04).               00047000
000480     05  RC100-ORD-NBR                  PIC  9(09).               00048000
000490     05  RC100-REC-SEQ-NBR              PIC  9(04).               00049000
000491     05  RC100-ORD-LNE-NBR              PIC  9(04).               00049101
000492     05  RC100-RCVR-STATUS              PIC  9(04).               00049200
000493     05  RC100-CREATE-USERID            PIC  X(08).               00049300
000494     05  RC100-UPDATE-USERID            PIC  X(08).               00049400
000495     05  RC100-UPDATE-PROGRAM           PIC  X(08).               00049500
000496     05  RC100-CREATE-TMST              PIC  X(26).               00049600
000497     05  RC100-SCAC                     PIC  X(04).               00049700
000498     05  RC100-VEHICL                   PIC  X(10).               00049800
000499     05  RC100-TRIP                     PIC  9(09).               00049900
000500     05  RC100-EFC-SHIPMT-NBR           PIC  X(20).               00050000
000510     05  RC100-TRIP-STATUS              PIC  X(02).               00051000
000520     05  RC100-TRIP-STATUS-DATE         PIC  X(10).               00052000
000530     05  RC100-TRIP-STATUS-TIME         PIC  X(08).               00053000
000540     05  RC100-TRIP-STATUS-UID          PIC  X(08).               00054000
000550     05  RC100-TRIP-STATUS-DESC         PIC  X(30).               00055000
000560     05  FILLER                         PIC  X(24).               00056001
