000100******************************************************************00010000
000200**                        RCRD098                               **00020003
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT FOR A FILE CREATED BY RCKUT166 TO BE     **00040000
000410**  USED BY RCKUP066 TO CREATE CR RECEIVERS FOR P2L FAILED      **00041000
000420**  STORE UNIT ADJUSTMENTS.                                     **00042000
000430**                                                              **00043000
000440**  LENGTH:  200 BYTES                                          **00044005
000450******************************************************************00045000
000460 01  RC098-ITEM-REC.                                              00046000
000461     05  RC098-ORIG-OPER-UNIT           PIC  9(05).               00046101
000480     05  RC098-ORIG-PO-NBR              PIC  9(09).               00048001
000500     05  RC098-ORIG-PO-RCVR             PIC  9(04).               00050001
000510     05  RC098-ORIG-PO-LNE-NBR          PIC  9(04).               00051001
000540     05  RC098-ORIG-STR-NBR             PIC  9(05).               00054001
000551     05  RC098-OPER-UNIT                PIC  9(05).               00055101
000552     05  RC098-PO-NBR                   PIC  9(09).               00055201
000553     05  RC098-PO-LNE-NBR               PIC  9(04).               00055301
000554     05  RC098-SKU-NBR                  PIC  9(08).               00055401
000555     05  RC098-STR-NBR                  PIC  9(05).               00055501
000556     05  RC098-PKGNG-CDE                PIC  X(01).               00055605
000557     05  RC098-PREPK-ID                 PIC  9(04).               00055706
000558     05  RC098-PREPK-RATO-QTY           PIC  9(04).               00055806
000559     05  RC098-PREPK-DRV-LNE-CDE        PIC  X(01).               00055905
000560     05  RC098-AP-VERIFY-QTY            PIC  9(09).               00056001
000580     05  RC098-MANIFEST-QTY             PIC  9(09).               00058001
000600     05  RC098-TO-VERIFY-QTY            PIC  9(09).               00060001
000800     05  RC098-REC-TYP-CDE              PIC  X(02).               00080001
001000     05  RC098-RCVG-CLERK-INIT-ID       PIC  X(03).               00100001
001020     05  RC098-CRE-UID                  PIC  X(08).               00102001
001080     05  RC098-FINCL-ADJ-ID             PIC S9(09) COMP.          00108003
001090     05  RC098-FINCL-ADJ-ERR-CDE        PIC  9(04).               00109001
001096     05  RC098-ADJ-ERR-DESC             PIC  X(10).               00109601
001097     05  RC098-PRC-RSN-CDE              PIC  X(08).               00109709
001098     05  RC098-ERROR-PARA-NAME          PIC  X(25).               00109803
001099     05  RC098-ERROR-TYPE               PIC  X(02).               00109906
001100         88  RC098-NO-ERROR                       VALUE '  '.     00110004
001110         88  RC098-PO-NOF                         VALUE '01'.     00111004
001120         88  RC098-ITEM-NOT-ON-PO                 VALUE '02'.     00112004
001130         88  RC098-DB-ERROR                       VALUE '03'.     00113004
001140         88  RC098-STORE-INV-CYCLE                VALUE '04'.     00114004
001150     05  RC098-NEW-PO-RCVR              PIC  9(04).               00115008
001200     05  FILLER                         PIC  X(35).               00120008
