000100******************************************************************00010000
000200*    COPY MEMBER:  RCRD110                       LRECL = 150     *00020001
000300*                                                                *00030000
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *00040000
000500*    BULK ORDERS - MIXED SKU CARTONS SPLIT SUMMARY RECORD        *00050001
000510*                                                                *00051000
000520*    THIS IS THE INFORMATION USED FOR REPORT RCKRP092            *00052001
000600*                                                                *00060000
000700******************************************************************00070000
000800 01  RC110-DCBULK-MIXSKU-SUM-REC.                                 00080001
001200     05  RC110-DIST-CNTR        PIC  9(04)    VALUE ZEROES.       00120001
001300     05  RC110-ENT-ID           PIC  9(09)    VALUE ZEROES.       00130001
001301     05  RC110-ENT-NME          PIC  X(40)    VALUE SPACES.       00130101
001310     05  RC110-DEPT-NBR         PIC  9(03)    VALUE ZEROES.       00131001
001320     05  RC110-SKU-CNT          PIC  9(15)    VALUE ZEROES.       00132001
001400     05  RC110-SSCC-COUNT       PIC  9(15)    VALUE ZEROES.       00140001
001500     05  RC110-UNIT-CNT         PIC  9(15)    VALUE ZEROES.       00150001
001510     05  FILLER                 PIC  X(49)    VALUE SPACES.       00151001
