000100******************************************************************00010006
000200*    COPY MEMBER:  RCRD016                                       *00020007
000300*                                                                *00030006
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *00040006
000500*    CARTON FILE ERRORS.                                         *00050006
000600*                                                                *00060006
000700******************************************************************00070006
000800 01  RC016-ASN-CARTON-ERRORS.                                     00080006
000900     05  RC016-ASN-CARTON-ERR       PIC  X(02)    VALUE SPACES.   00090006
001000         88  RC016-FIRST-NOT-00               VALUE '01'.         00100006
001100         88  RC016-NOT-NUMERIC                VALUE '02'.         00110006
001200         88  RC016-21-40-GT-SPACES            VALUE '03'.         00120006
001300         88  RC016-NO-CART-RECS               VALUE '04'.         00130006
001310         88  RC016-PREVIOUSLY-SENT            VALUE '05'.         00131007
001320         88  RC016-STR-PO-NOT-EQUAL           VALUE '06'.         00131007
001400     05  RC016-ASN-CARTON-NBR       PIC  X(40)    VALUE SPACES.   00140006
001500     05  RC016-ASN-CARTON-PO        PIC  9(09)    VALUE ZERO.     00150006
001600     05  RC016-ASN-ASNHDR-NBR       PIC  X(30)    VALUE SPACES.   00160006
001700     05  RC016-ASN-DATE-SHIPPED     PIC  9(08)    VALUE ZERO.     00170006
001800     05  RC016-ASN-PO-LINE-NBR      PIC  X(04)    VALUE SPACES.   00180006
039100     05  RC016-ASN-PO-LINE-NBR-9 REDEFINES RC016-ASN-PO-LINE-NBR.         
039200         10  FILLER                 PIC  9(04).                           
001900     05  RC016-ASN-STORE-NBR        PIC  9(04)    VALUE ZERO.     00190006
002000     05  RC016-ASN-VENDOR-NBR       PIC  X(09)    VALUE SPACES.   00200008
002010     05  RC016-ASN-OPER-UNIT        PIC  X(04)    VALUE SPACES.   00201009
002100     05  RC016-FILLER               PIC  X(10)    VALUE SPACES.   00210008
