000010******************************************************************00001000
000020*    COPY MEMBER:  RCRD089                       LRECL = 75      *00002001
000030*                                                                *00003000
000040*    THIS MEMBER IS USED AS THE DRIVER FILE LAYOUT FOR THE       *00004000
000050*    PURGE OF THE RCT_PO_RCVR_TRKG DATABASE                      *00005000
000060*                                                                *00006000
000070******************************************************************00007000
000100 01  RC089-PO-RCVR-TRKG-DELETE.                                   00010000
000200     10 RC089-ORD-NBR                 PIC  S9(09) COMP.           00020001
000300     10 RC089-REC-SEQ-NBR             PIC  S9(09) COMP.           00030001
000400     10 RC089-STATUS-CDE              PIC   X(02).                00040001
000500     10 RC089-VERFYD-TMST             PIC   X(26).                00050001
000600     10 RC089-ORD-LNE-NBR             PIC  S9(09) COMP.           00060001
000700     10 RC089-PREPK-ID                PIC  S9(04) COMP.           00070001
001500     10 FILLER                        PIC   X(33).                00150001
