000100******************************************************************00010007
000200*    COPY MEMBER:  RCRD053                       LRECL = 300     *00020017
000300*                                                                *00030007
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *00040007
000500*    RECEIVER PACKSLIP EXTRACT ERROR FILE.                       *00050007
000600*                                                                *00060007
000700******************************************************************00070007
000800 01  RC053-ASN-RECVR-PKSLIP-ERRREC.                               00080007
000900     05  RC053-TYPE-CODE            PIC  X(01).                   00090007
001000         88  RC053-CARTON-COUNT-ERR               VALUE '1'.      00100007
001100         88  RC053-CARTON-CONTENT-QTY-ERR         VALUE '2'.      00110007
001200         88  RC053-UPC-ERR                        VALUE '3'.      00120013
001300         88  RC053-VEND-SUMM-REC                  VALUE '4'.      00130018
00025 *EXPANDED THE PO NUMBER FIELD FROM 7 TO 9                         00131028
001400     05  RC053-PO-NBR               PIC  9(09)    VALUE ZEROES.   00140031
001500     05  RC053-SEQ-NBR              PIC  9(04)    VALUE ZEROES.   00150015
001600     05  RC053-VENDOR-NAME          PIC  X(25)    VALUE SPACES.   00160007
001700     05  RC053-ASN-NBR              PIC  X(30)    VALUE SPACES.   00170007
001800     05  RC053-BOL-NBR              PIC  X(30)    VALUE SPACES.   00180007
001900     05  RC053-SCAC                 PIC  X(04)    VALUE SPACES.   00190007
002000     05  RC053-DC                   PIC  9(04)    VALUE ZEROES.   00200015
002100     05  RC053-DEST-STORE           PIC  9(04)    VALUE ZEROES.   00210015
002200     05  RC053-TPKSLIP-EXP-QTY      PIC  9(07)    VALUE ZEROES.   00220015
002300     05  RC053-TINPKSU-PKG-COUNT    PIC  9(07)    VALUE ZEROES.   00230015
002400     05  RC053-PKSL-LINE-NBR        PIC  9(05)    VALUE ZEROES.   00240015
002500     05  RC053-TRN-LINE-NBR         PIC  9(05)    VALUE ZEROES.   00250015
002600     05  RC053-TPKITEM-EXP-QTY      PIC  9(07)    VALUE ZEROES.   00260015
002700     05  RC053-TSHUUPC-SHP-QTY      PIC  9(07)    VALUE ZEROES.   00270015
002800     05  RC053-ASN-ERR-IND          PIC  X(01).                   00280013
002900         88  RC053-TPKSLIP-NOTFND                 VALUE '1'.      00290013
003000         88  RC053-TINPKSU-NOTFND                 VALUE '2'.      00300013
003100         88  RC053-TSHUUPC-NOTFND                 VALUE '3'.      00310013
003200         88  RC053-TPKITEM-NOTFND                 VALUE '4'.      00320013
003300         88  RC053-TUPCSKU-NOTFND                 VALUE '5'.      00330013
003400         88  RC053-TPURITM-NOTFND                 VALUE '6'.      00340013
003500         88  RC053-QTY-MISMATCH                   VALUE '7'.      00350014
003600         88  RC053-NOMATCH                        VALUE '8'.      00360014
003700     05  RC053-TPURCHS-ENT-ID       PIC  9(09)    VALUE ZEROES.   00370015
003800     05  RC053-EDIISA-CNTL-NBR      PIC  9(09)    VALUE ZEROES.   00380015
003900     05  RC053-SHIPT-UNT-ID         PIC  9(18)    VALUE ZEROES.   00390016
004000     05  RC053-UPC-NBR              PIC  9(15)    VALUE ZEROES.   00400016
004100     05  RC053-TOT-VEND-RECS        PIC  9(07)    VALUE ZEROES.   00410018
004200     05  RC053-VEND-PKSL-ERRS       PIC  9(05)    VALUE ZEROES.   00420018
004300     05  RC053-PKSL-DTL-ERRS        PIC  9(05)    VALUE ZEROES.   00430019
004310     05  RC053-UPC-UPDATE-IND       PIC  X(01).                   00431021
004311         88  RC053-UPC-UPD-NOT-RESLVED            VALUE '1'.      00431121
004312         88  RC053-UPC-UPD-RESOLVED               VALUE '2'.      00431221
004320     05  RC053-UPC-RECYCLE-COUNT    PIC  9(04)    VALUE ZEROES.   00432020
004330     05  RC053-UPC-BAD-CRTN-REC     PIC  X(01)    VALUE SPACES.   00433022
004340     05  RC053-ASN-PBS-ERROR-IND    PIC  X(01).                   00434023
004350         88  RC053-PBS-UNITS-ERR                  VALUE '1'.      00435023
004351         88  RC053-PBS-UPC-NOT-ON-PO-ERR          VALUE '2'.      00435123
004352         88  RC053-PBS-LNE-ZERO-ERR               VALUE '3'.      00435223
004360         88  RC053-PBS-UPC-CTN-ERR                VALUE '4'.      00436023
004370         88  RC053-PBS-UPC-PKSL-ERR               VALUE '5'.      00437023
004380     05  RC053-DEPT-NBR             PIC  X(03)    VALUE SPACES.   00438024
004390     05  RC053-PBS-CREATE-DATE      PIC  X(10)    VALUE SPACES.   00439027
00056 *REDUCED THE FILLER FIELD FROM 64 TO 62                           00439132
004400     05  FILLER                     PIC  X(62)    VALUE SPACES.   00440029
