000100******************************************************************00010013
000200*    COPY MEMBER:  RCRD047                       LRECL = 120     *00020015
000300*                                                                *00030014
000400*    THIS MEMBER IS USED AS A LAYOUT FOR AN EXTRACT FILE         *00040014
000500*    CONTAINING NON-ASN VENDORS FOR REPORTING PURPOSES.          *00050014
000600*                                                                *00060014
000700*                                                                *00070014
000800******************************************************************00080014
000900 01  RC047-NON-ASN-VENDOR-RECORD.                                 00090014
001000     05  RC047-VENDOR-NO-DUNNS           PIC  X(09)  VALUE SPACE. 00100014
001100     05  RC047-PO-NBR                    PIC  9(08)  VALUE ZEROS. 00110016
001200     05  RC047-REC-SEQ-NBR               PIC  9(09)  VALUE ZEROS. 00120016
001210     05  RC047-DEPT-NBR                  PIC  9(03)  VALUE ZEROS. 00121017
001300     05  RC047-DATE-RECEIVED             PIC  9(06)  VALUE ZEROS. 00130016
001400     05  RC047-DATE-VERIFIED-COUNT       PIC  9(06)  VALUE ZEROS. 00140016
001500     05  RC047-VENDOR-NAME-DUNNS         PIC  X(25)  VALUE SPACE. 00150014
001600     05  RC047-CURR-OPER-UNT-ID          PIC S9(04)  COMP.        00160014
001700     05  RC047-ACTL-CART-CNT             PIC S9(04)  COMP.        00170014
001800     05  RC047-EXPTED-CART-CNT           PIC S9(04)  COMP.        00180014
001900     05  RC047-BOL-NBR                   PIC  X(30)  VALUE SPACE. 00190014
002000     05  RC047-VEH-NBR                   PIC  X(10)  VALUE SPACE. 00200014
002100     05  RC047-OWNER-SCAC-ID             PIC  X(04)  VALUE SPACE. 00210014
002200     05  RC047-PROD-TEST-IND             PIC  X(01)  VALUE SPACE. 00220014
002300         88  RC047-TEST-IND                          VALUE 'T'.   00230014
002400         88  RC047-PROD-IND                          VALUE 'P'.   00240014
002500         88  RC047-NO-IND                            VALUE 'N'.   00250014
002600     05  FILLER                          PIC  X(03)  VALUE SPACE. 00260017
