000100******************************************************************00010000
000200**                        RCRD095                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT FOR THE CARRIER TRACKING STATUS DATA     **00040000
000500**  AFTER IT HAS BEEN REFORMATED FROM THE MQ                    **00050000
000600**                                                              **00060000
000700**  LENGTH:  125 BYTES                                          **00070000
000800******************************************************************00080000
000900 01  RC095-TRKG-REC.                                              00090000
001000     05  RC095-PO-NBR                   PIC 9(09).                00100000
001100     05  RC095-STR-NBR                  PIC 9(04).                00110000
001200     05  RC095-SHIPT-UNT-ID             PIC 9(18).                00120001
001300     05  RC095-TRKG-STAT-CDE            PIC X(03).                00130002
001400         88  RC095-DELIVERY-STAT                  VALUE 'DEL'.    00140002
001410         88  RC095-PICKUP-STAT                    VALUE 'PKU'.    00141002
001420     05  RC095-TRKG-CRE-TMST            PIC X(26).                00142002
001430     05  RC095-TRKG-NBR                 PIC X(30).                00143002
001440     05  RC095-PRCD-TYPE                PIC X(03).                00144002
001450         88  RC095-IND-IR                        VALUE 'IR '.     00145002
001460         88  RC095-IND-ASN                       VALUE 'ASN'.     00146002
001470     05  RC095-REC-SEQ-NBR              PIC 9(04).                00147002
001480     05  RC095-ERROR-SW                 PIC X(02).                00148002
001490         88  RC095-TRK-NO-NOT-FND                VALUE 'TR'.      00149002
001500         88  RC095-PREV-CHECKED-IN               VALUE 'CI'.      00150000
001600         88  RC095-ASN-FOUND                     VALUE 'AS'.      00160002
001700         88  RC095-NOT-INBND-OTBND               VALUE 'IO'.      00170000
001701         88  RC095-DUP-TRACK-NBR                 VALUE 'DT'.      00170101
001710     05  RC095-ZIP-10-CDE               PIC X(10).                00171000
001800     05  RC095-CURR-OPER-UNT            PIC 9(04).                00180002
001900     05  FILLER                         PIC X(12).                00190002
