000100******************************************************************01/19/96
000200*    COPY MEMBER:  RCRD014                       LRECL = 175     *RCR00007
000300*                                                                *   LV007
000400*    THIS MEMBER IS USED AS A FILE LAYOUT WHICH CORRESPONDS TO   *RCR00007
000500*    THE DB2 RECEIPT DISTRIBUTION AUDIT TABLE.  THIS LAYOUT      *RCR00007
000600*    WILL BE USED TO PROCESS AND RETAIN THE AUDIT INFORMATION    *RCR00007
000700*    WITHIN A SEQUENTIAL FILE CREATED FROM AN EXTRACT OF THE     *RCR00007
000800*    DB2 TABLE.                                                  *RCR00007
000900*                                                                *RCR00007
001000******************************************************************RCR00007
001100 01  RC014-TRECDIS-AUDIT-RECORD.                                  RCR00007
001200     05  RC014-ORD-NBR              PIC  S9(9) COMP.              RCR00007
001300     05  RC014-ORD-LNE-NBR          PIC  S9(9) COMP.              RCR00007
001400     05  RC014-REC-SEQ-NBR          PIC  S9(9) COMP.              RCR00007
001500     05  RC014-OPER-UNT-ID          PIC  S9(4) COMP.              RCR00007
001600     05  RC014-FCLTY-ID             PIC  S9(4) COMP.              RCR00007
001700     05  RC014-CRE-TMST             PIC   X(26).                  RCR00007
001800     05  RC014-CRE-UID              PIC   X(8).                   RCR00007
001900     05  RC014-VER-STATUS-CDE       PIC   X(1).                   RCR00007
002000     05  RC014-EXPTED-ITM-QTY       PIC  S9(9) COMP.              RCR00007
002100     05  RC014-VERIFY-ITM-QTY       PIC  S9(9) COMP.              RCR00007
002200     05  RC014-AP-VERIFY-ITM-QTY    PIC  S9(9) COMP.              RCR00007
002300     05  RC014-STR-NBR              PIC  S9(4) COMP.              RCR00007
002400     05  RC014-STR-FCLTY-ID         PIC  S9(4) COMP.              RCR00007
002500     05  RC014-PLAN-ITM-QTY         PIC  S9(4) COMP.              RCR00007
002600     05  FILLER                     PIC   X(10).                  RCR00007
002700     05  RC014-AP-PRC-CDE           PIC   X(1).                   RCR00007
002800     05  RC014-AP-PRC-DTE           PIC   X(10).                  RCR00007
002900     05  RC014-UPD-TMST             PIC   X(26).                     CL**3
003000     05  RC014-UPD-UID              PIC   X(8).                      CL**3
003100     05  RC014-UPD-PGM-ID           PIC   X(8).                      CL**3
003200     05  RC014-AUD-TYP-CDE          PIC   X(1).                      CL**3
003300         88  RC014-AUD-TYP-BEFORE                    VALUE 'B'.      CL**3
003400         88  RC014-AUD-TYP-AFTER                     VALUE 'A'.      CL**3
003500     05  RC014-FUNC-CDE             PIC   X(1).                      CL**3
003600         88  RC014-FUNC-INSERT                       VALUE 'I'.      CL**3
003700         88  RC014-FUNC-UPDATE                       VALUE 'U'.      CL**3
003800         88  RC014-FUNC-DELETE                       VALUE 'D'.      CL**3
003800         88  RC014-FUNC-TRIGGER                      VALUE 'T'.      CL**3
003900     05  RC014-ROW-UNLD-SW          PIC   X(1).                      CL**7
004000         88  RC014-ROW-UNLOADED                      VALUE 'U'.      CL**7
004100     05  RC014-NOTIF-NBR            PIC  S9(9) COMP.                 CL**5
004110     05  RC014-ADJ-CYC-NBR          PIC  S9(9) COMP.                 CL**5
004200     05  FILLER                     PIC   X(32)      VALUE SPACES.   CL**7
