       01  RC932-NET-SALES-SUM-RECORD       PIC  X(158).                00010002
                                                                        00020000
000100****************************************************************  00030001
000200* RCRD932                                        LRECL = ????  *  00040001
000300*           COMMAREA FOR NET SALES SUM INSERT                  *  00050001
000400****************************************************************  00060001
000500 01  RC932-COMMAREA.                                              00070000
         05  RC932-PERCENTAGE-STORES        PIC S9(05) COMP.            00080005
                                                                        00090004
000600   05  RC932-UNIX-RECV-SALES-UPL-REC.                             00100000
000610       10  FILLER                     PIC  X(01).                 00110002
000700       10  RC932-UNIX-DEPT-NBR        PIC  X(03).                 00120002
000710       10  FILLER                     PIC  X(03).                 00130002
000800       10  RC932-UNIX-MAJ-CL-NBR      PIC  X(02).                 00140002
000810       10  FILLER                     PIC  X(03).                 00150002
000900       10  RC932-UNIX-SUB-CL-NBR      PIC  X(02).                 00160002
000910       10  FILLER                     PIC  X(03).                 00170002
001000       10  RC932-UNIX-PHY-SITE-ID     PIC  X(05).                 00180002
001010       10  FILLER                     PIC  X(03).                 00190002
001100       10  RC932-UNIX-TM-DIM-KY-DTE   PIC  X(10).                 00200002
001110       10  FILLER                     PIC  X(03).                 00210002
001200       10  RC932-UNIX-SLS-UNT-QTY     PIC  X(12).                 00220002
001201       10  FILLER                     PIC  X(01).                 00230002
001210                                                                  00240000
         05  RC932-RCT-NET-SLS-SUM-REC.                                 00250003
             10  RC932-NET-DEPT-NBR         PIC S9(04)V COMP-3.         00260003
             10  RC932-NET-MAJ-CL-NBR       PIC S9(04)V COMP-3.         00270003
             10  RC932-NET-SUB-CL-NBR       PIC S9(04)V COMP-3.         00280003
             10  RC932-NET-LOC-NBR          PIC S9(04)  COMP.           00290003
             10  RC932-NET-SLS-EOW-DTE      PIC  X(10).                 00300003
             10  RC932-NET-NET-SLS-UNT-QTY  PIC S9(12)V COMP-3.         00310003
                                                                        00320000
         05  RC932-RCT-LOC-DEPT-RNK-REC.                                00330000
             10  RC932-DEPT-PRCG-NBR        PIC S9(09)  COMP.           00340002
             10  RC932-DEPT-LOC-NBR         PIC S9(04)  COMP.           00350002
             10  RC932-DEPT-DEPT-NBR        PIC S9(04)V COMP-3.         00360002
             10  RC932-DEPT-RNK-NBR         PIC S9(04)  COMP.           00370002
                                                                        00380000
         05  RC932-RCT-LOC-MAJ-RNK-REC.                                 00390000
             10  RC932-MAJ-PRCG-NBR         PIC S9(09)  COMP.           00400002
             10  RC932-MAJ-LOC-NBR          PIC S9(04)  COMP.           00410002
             10  RC932-MAJ-DEPT-NBR         PIC S9(04)V COMP-3.         00420002
             10  RC932-MAJ-MAJ-CL-NBR       PIC S9(04)V COMP-3.         00430002
             10  RC932-MAJ-RNK-NBR          PIC S9(04)  COMP.           00440002
                                                                        00450000
         05  RC932-RCT-LOC-SUB-RNK-REC.                                 00460000
             10  RC932-SUB-PRCG-NBR         PIC S9(09)  COMP.           00470002
             10  RC932-SUB-LOC-NBR          PIC S9(04)  COMP.           00480002
             10  RC932-SUB-DEPT-NBR         PIC S9(04)V COMP-3.         00490002
             10  RC932-SUB-MAJ-CL-NBR       PIC S9(04)V COMP-3.         00500002
             10  RC932-SUB-SUB-CL-NBR       PIC S9(04)V COMP-3.         00510002
             10  RC932-SUB-RNK-NBR          PIC S9(04)  COMP.           00520002
                                                                        00530000
         05  RC932-RCT-PRCG-CNTL-REC.                                   00540000
             10  RC932-PRCG-PRCG-NBR        PIC S9(09)  COMP.           00550002
             10  RC932-PRCG-BEG-TMST        PIC  X(26).                 00560000
             10  RC932-PRCG-END-TMST        PIC  X(26).                 00570000
                                                                        00580000
         05  RC932-RCT-LOC-RNK-REC.                                     00590000
             10  RC932-RNK-PRCG-NBR         PIC S9(09)  COMP.           00600002
             10  RC932-RNK-LOC-NBR          PIC S9(04)  COMP.           00610002
             10  RC932-RNK-RNK-NBR          PIC S9(04)  COMP.           00620002
