000100 01  RC111-DATE-CONTROL-REC.                                              
000110     05  RC111-RPT-TYPE               PIC X(01).                          
000120         88 RC111-DAILY                          VALUE 'D'.               
000121         88 RC111-WEEKLY                         VALUE 'W'.               
000122         88 RC111-MONTHLY                        VALUE 'M'.               
000123     05  FILLER                       PIC X(01).                          
000200     05  RC111-REPORT-DATE            PIC X(10).                          
000300     05  FILLER                       PIC X(01).                          
000400     05  RC111-MONTH-END-DATE         PIC X(10).                          
000500     05  FILLER                       PIC X(01).                          
