000100**************************************************************    00010000
000200*  RCRD063 - SUMMARY FILE BY VENDOR OF THE PO/RECEIVERS           00020000
000300*            VERIFIED FOR THE JUST COMPLETED FISCAL MONTH AND     00030000
000400*            YEAR-TO-DATE.                                        00040000
000500*            FILE WILL BE USED TO BE SORTED AND CONTROL WHAT      00050000
000600*            VENDORS ARE TO PRINT ON THE VENDOR SUMMARY REPORT    00060000
000700*            BASED ON AMOUNT OF RECEIPTS AND VARIANCES.           00070000
000800*  LRECL = 650                                                    00080003
000900**************************************************************    00090000
001000 01  RCRD063-VND-RCVR-SUMMARY.                                    00100000
001100     05  RC063-ENT-ID                    PIC  S9(9) COMP.         00110000
001200     05  RC063-ENT-NAME                  PIC   X(30).             00120000
001300     05  RC063-P12MN-SLSRNK-NBR          PIC  S9(4) COMP.         00130000
001400     05  RC063-FISCAL-YYYY               PIC   9(4).              00140000
001410     05  RC063-FISCAL-MM                 PIC   9(2).              00141000
001420     05  RC063-RPT-MONTH-END-DATE.                                00142005
001430         10  RPT-MONTH-END-MM            PIC   X(2).              00143005
001440         10  FILLER                      PIC   X(1).              00144005
001450         10  RPT-MONTH-END-DD            PIC   X(2).              00145005
001460         10  FILLER                      PIC   X(1).              00146005
001470         10  RPT-MONTH-END-YYYY          PIC   X(4).              00147005
001500                                                                  00150000
001600     05  RC063-NBR-RCVR-VRFD-MM          PIC  S9(11) COMP-3.      00160000
001700     05  RC063-NBR-RCVR-VRFD-YTD         PIC  S9(11) COMP-3.      00170000
001800     05  RC063-NBR-LINE-VRFD-MM          PIC  S9(11) COMP-3.      00180000
001900     05  RC063-NBR-LINE-VRFD-YTD         PIC  S9(11) COMP-3.      00190000
002000     05  RC063-NBR-PO-VRFD-MM            PIC  S9(11) COMP-3.      00200000
002100     05  RC063-NBR-PO-VRFD-YTD           PIC  S9(11) COMP-3.      00210000
002200                                                                  00220000
002300     05  RC063-NBR-PBS-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00230000
002400     05  RC063-NBR-PBS-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00240000
002500     05  RC063-NBR-IPP-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00250000
002600     05  RC063-NBR-IPP-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00260000
002700     05  RC063-NBR-MPP-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00270000
002800     05  RC063-NBR-MPP-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00280000
002900     05  RC063-NBR-SPP-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00290000
003000     05  RC063-NBR-SPP-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00300000
003100     05  RC063-NBR-CSP-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00310000
003200     05  RC063-NBR-CSP-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00320000
003300     05  RC063-NBR-BLK-RCVR-VRFD-MM      PIC  S9(11) COMP-3.      00330000
003400     05  RC063-NBR-BLK-RCVR-VRFD-YTD     PIC  S9(11) COMP-3.      00340000
003500                                                                  00350000
003600     05  RC063-EXP-CART-COUNT-MM         PIC  S9(13) COMP-3.      00360000
003700     05  RC063-EXP-CART-COUNT-YTD        PIC  S9(13) COMP-3.      00370000
003800     05  RC063-ACT-CART-COUNT-MM         PIC  S9(13) COMP-3.      00380000
003900     05  RC063-ACT-CART-COUNT-YTD        PIC  S9(13) COMP-3.      00390000
004000     05  RC063-DIF-CART-COUNT-MM         PIC  S9(13) COMP-3.      00400000
004100     05  RC063-DIF-CART-COUNT-YTD        PIC  S9(13) COMP-3.      00410000
004200                                                                  00420000
004300     05  RC063-EXP-ITEM-QTY-MM           PIC  S9(13) COMP-3.      00430000
004400     05  RC063-EXP-ITEM-QTY-YTD          PIC  S9(13) COMP-3.      00440000
004500     05  RC063-INT-ITEM-QTY-MM           PIC  S9(13) COMP-3.      00450000
004600     05  RC063-INT-ITEM-QTY-YTD          PIC  S9(13) COMP-3.      00460000
004700     05  RC063-FNL-ITEM-QTY-MM           PIC  S9(13) COMP-3.      00470000
004800     05  RC063-FNL-ITEM-QTY-YTD          PIC  S9(13) COMP-3.      00480000
004900     05  RC063-FNL-DIF-ITEM-QTY-MM       PIC  S9(13) COMP-3.      00490000
005000     05  RC063-FNL-DIF-ITEM-QTY-YTD      PIC  S9(13) COMP-3.      00500000
005100     05  RC063-FNL-ADJ-ITEM-QTY-MM       PIC  S9(13) COMP-3.      00510000
005200     05  RC063-FNL-ADJ-ITEM-QTY-YTD      PIC  S9(13) COMP-3.      00520000
005300                                                                  00530000
005400     05  RC063-EXP-ITEM-RTL-MM           PIC  S9(13)V99           00540000
005500                                                     COMP-3.      00550000
005600     05  RC063-EXP-ITEM-RTL-YTD          PIC  S9(13)V99           00560000
005700                                                     COMP-3.      00570000
005800     05  RC063-INT-ITEM-RTL-MM           PIC  S9(13)V99           00580000
005900                                                     COMP-3.      00590000
006000     05  RC063-INT-ITEM-RTL-YTD          PIC  S9(13)V99           00600000
006100                                                     COMP-3.      00610000
006200     05  RC063-FNL-ITEM-RTL-MM           PIC  S9(13)V99           00620000
006300                                                     COMP-3.      00630000
006400     05  RC063-FNL-ITEM-RTL-YTD          PIC  S9(13)V99           00640000
006500                                                     COMP-3.      00650000
006600     05  RC063-FNL-DIF-ITEM-RTL-MM       PIC  S9(13)V99           00660000
006700                                                     COMP-3.      00670000
006800     05  RC063-FNL-DIF-ITEM-RTL-YTD      PIC  S9(13)V99           00680000
006900                                                     COMP-3.      00690000
007000     05  RC063-FNL-ADJ-ITEM-RTL-MM       PIC  S9(13)V99           00700000
007100                                                     COMP-3.      00710000
007200     05  RC063-FNL-ADJ-ITEM-RTL-YTD      PIC  S9(13)V99           00720000
007300                                                     COMP-3.      00730000
007400                                                                  00740000
007500     05  RC063-EXP-V-ACT-OVER-RTL-MM     PIC  S9(13)V99           00750003
007501                                                     COMP-3.      00750103
007502     05  RC063-EXP-V-ACT-OVER-RTL-YTD    PIC  S9(13)V99           00750204
007503                                                     COMP-3.      00750303
007504     05  RC063-EXP-V-ACT-OVER-PCT-MM     PIC  S9(05)V9999         00750404
007505                                                     COMP-3.      00750504
007506     05  RC063-EXP-V-ACT-SHRT-RTL-MM     PIC  S9(13)V99           00750604
007507                                                     COMP-3.      00750704
007508     05  RC063-EXP-V-ACT-SHRT-RTL-YTD    PIC  S9(13)V99           00750804
007509                                                     COMP-3.      00750904
007510     05  RC063-EXP-V-ACT-SHRT-PCT-MM     PIC  S9(05)V9999         00751004
007511                                                     COMP-3.      00751104
007512     05  RC063-EXP-V-ACT-GRSS-RTL-MM     PIC  S9(13)V99           00751204
007513                                                     COMP-3.      00751304
007514     05  RC063-EXP-V-ACT-GRSS-RTL-YTD    PIC  S9(13)V99           00751404
007515                                                     COMP-3.      00751504
007516                                                                  00751604
007517     05  RC063-NBR-RCVR-CART-OVR-MM      PIC  S9(11) COMP-3.      00751704
007518     05  RC063-NBR-RCVR-CART-OVR-YTD     PIC  S9(11) COMP-3.      00751804
007520     05  RC063-NBR-RCVR-CART-SHR-MM      PIC  S9(11) COMP-3.      00752000
007530     05  RC063-NBR-RCVR-CART-SHR-YTD     PIC  S9(11) COMP-3.      00753000
007540     05  RC063-NBR-RCVR-CART-EQL-MM      PIC  S9(11) COMP-3.      00754000
007550     05  RC063-NBR-RCVR-CART-EQL-YTD     PIC  S9(11) COMP-3.      00755000
007560                                                                  00756000
007570     05  RC063-NBR-RCVR-QTY-OVR-MM       PIC  S9(11) COMP-3.      00757000
007580     05  RC063-NBR-RCVR-QTY-OVR-YTD      PIC  S9(11) COMP-3.      00758000
007590     05  RC063-NBR-RCVR-QTY-SHR-MM       PIC  S9(11) COMP-3.      00759000
007600     05  RC063-NBR-RCVR-QTY-SHR-YTD      PIC  S9(11) COMP-3.      00760000
007700     05  RC063-NBR-RCVR-QTY-EQL-MM       PIC  S9(11) COMP-3.      00770000
007800     05  RC063-NBR-RCVR-QTY-EQL-YTD      PIC  S9(11) COMP-3.      00780000
007810                                                                  00781000
007820     05  RC063-NBR-RCVR-RTL-OVR-MM       PIC  S9(11) COMP-3.      00782000
007830     05  RC063-NBR-RCVR-RTL-OVR-YTD      PIC  S9(11) COMP-3.      00783000
007840     05  RC063-NBR-RCVR-RTL-SHR-MM       PIC  S9(11) COMP-3.      00784000
007850     05  RC063-NBR-RCVR-RTL-SHR-YTD      PIC  S9(11) COMP-3.      00785000
007860     05  RC063-NBR-RCVR-RTL-EQL-MM       PIC  S9(11) COMP-3.      00786000
007870     05  RC063-NBR-RCVR-RTL-EQL-YTD      PIC  S9(11) COMP-3.      00787000
007900                                                                  00790000
008000     05  RC063-NBR-LINE-QTY-OVR-MM       PIC  S9(11) COMP-3.      00800000
008100     05  RC063-NBR-LINE-QTY-OVR-YTD      PIC  S9(11) COMP-3.      00810000
008110     05  RC063-NBR-LINE-QTY-SHR-MM       PIC  S9(11) COMP-3.      00811000
008120     05  RC063-NBR-LINE-QTY-SHR-YTD      PIC  S9(11) COMP-3.      00812000
008130     05  RC063-NBR-LINE-QTY-EQL-MM       PIC  S9(11) COMP-3.      00813000
008140     05  RC063-NBR-LINE-QTY-EQL-YTD      PIC  S9(11) COMP-3.      00814000
008150                                                                  00815000
008160     05  RC063-NBR-LINE-RTL-OVR-MM       PIC  S9(11) COMP-3.      00816000
008170     05  RC063-NBR-LINE-RTL-OVR-YTD      PIC  S9(11) COMP-3.      00817000
008180     05  RC063-NBR-LINE-RTL-SHR-MM       PIC  S9(11) COMP-3.      00818000
008190     05  RC063-NBR-LINE-RTL-SHR-YTD      PIC  S9(11) COMP-3.      00819000
008191     05  RC063-NBR-LINE-RTL-EQL-MM       PIC  S9(11) COMP-3.      00819100
008192     05  RC063-NBR-LINE-RTL-EQL-YTD      PIC  S9(11) COMP-3.      00819200
012700                                                                  01270000
012800     05  FILLER                          PIC   X(70).             01280004
