000100******************************************************************00010003
000200*    COPY MEMBER:  RCRD012                       LRECL = 400     *00020003
000300*                                                                *00030003
000400*    THIS MEMBER IS USED AS A FILE LAYOUT WHICH CORRESPONDS TO   *00040003
000500*    THE DB2 RECEIVER AUDIT TABLE.  THIS LAYOUT WILL BE USED TO  *00050003
000600*    PROCESS AND RETAIN THE AUDIT INFORMATION WITHIN SEQUENTIAL  *00060003
000700*    FILES CREATED FROM AN EXTRACT OF THE DB2 TABLE.             *00070003
000800*                                                                *00080003
000900******************************************************************00090003
001000 01  RC012-TRECEIV-AUDIT-RECORD.                                  00100003
001100     05  RC012-ORD-NBR              PIC  S9(9) COMP.              00110003
001200     05  RC012-REC-SEQ-NBR          PIC  S9(9) COMP.              00120003
001300     05  RC012-CRE-TMST             PIC   X(26).                  00130003
001400     05  RC012-CRE-UID              PIC   X(8).                   00140003
001500     05  RC012-PO-VER-NBR           PIC  S9(9) COMP.              00150003
001600     05  RC012-OPER-UNT-ID          PIC  S9(4) COMP.              00160003
001700     05  RC012-FCLTY-ID             PIC  S9(4) COMP.              00170003
001800     05  RC012-STATUS-CDE           PIC   X(2).                   00180003
001900     05  RC012-SYST-CRE-CDE         PIC   X(1).                   00190003
002000     05  RC012-REC-TYP-CDE          PIC   X(2).                   00200003
002100     05  RC012-VER-STATUS-CDE       PIC   X(1).                   00210003
002200     05  RC012-PACK-BY-ST-IND       PIC   X(1).                   00220003
002300     05  RC012-REC-TMST             PIC   X(26).                  00230003
002400     05  RC012-EXPTED-CART-CNT      PIC  S9(4) COMP.              00240003
002500     05  RC012-ACTL-CART-CNT        PIC  S9(4) COMP.              00250003
002600     05  RC012-EXPTED-ITM-QTY       PIC  S9(9) COMP.              00260003
002700     05  RC012-ACTL-ITM-QTY         PIC  S9(9) COMP.              00270003
002800     05  RC012-RCVR-NBR             PIC  S9(9) COMP.              00280003
002900     05  RC012-ML-POST-TMST         PIC   X(26).                  00290003
003000     05  RC012-FS-POST-TMST         PIC   X(26).                  00300003
003100     05  RC012-PRE-TKT-IND          PIC   X(1).                   00310003
003200     05  RC012-AD-INFO-DESC         PIC   X(4).                   00320003
003300     05  RC012-IN-TRBL-TMST         PIC   X(26).                  00330003
003400     05  RC012-IN-TRBL-MIN-CNT      PIC  S9(4) COMP.              00340003
003500     05  RC012-IN-TRBL-HOUR-CNT     PIC  S9(4) COMP.              00350003
003600     05  RC012-VERFYD-TMST          PIC   X(26).                  00360003
003700     05  RC012-RCVG-CLERK-INIT-ID   PIC   X(3).                   00370003
003800     05  RC012-AP-TMST              PIC   X(26)      VALUE SPACES.00380003
003900     05  RC012-REFER-BACK-SEQ-NBR   PIC  S9(9) COMP.              00390003
004000     05  RC012-AP-PRC-CDE           PIC   X(1).                   00400003
004100     05  RC012-AP-PRC-DTE           PIC   X(10).                  00410003
004200     05  RC012-MIS-DIRECT-IND       PIC   X(1).                   00420003
004300     05  RC012-IMPRT-IND            PIC   X(1).                   00430003
004400     05  RC012-CRE-OPER-UNT-ID      PIC  S9(4) COMP.              00440003
004500     05  RC012-CRE-FCLTY-ID         PIC  S9(4) COMP.              00450003
004600     05  RC012-CURR-OPER-UNT-ID     PIC  S9(4) COMP.              00460003
004700     05  RC012-CURR-FCLTY-ID        PIC  S9(4) COMP.              00470003
004800     05  RC012-UPD-TMST             PIC   X(26).                  00480003
004900     05  RC012-UPD-UID              PIC   X(8).                   00490003
005000     05  RC012-UPD-PGM-ID           PIC   X(8).                   00500003
005100     05  RC012-APRON-LOC-DESC       PIC   X(8).                   00510003
005200     05  RC012-MKNG-APRN-PRT-TMST   PIC   X(26).                  00520003
005300     05  RC012-GOH-IND              PIC   X(1).                   00530003
005400     05  RC012-AUD-TYP-CDE          PIC   X(1).                   00540003
005500         88  RC012-AUD-TYP-BEFORE                    VALUE 'B'.   00550003
005600         88  RC012-AUD-TYP-AFTER                     VALUE 'A'.   00560003
005700     05  RC012-FUNC-CDE             PIC   X(1).                   00570003
005800         88  RC012-FUNC-INSERT                       VALUE 'I'.   00580003
005900         88  RC012-FUNC-UPDATE                       VALUE 'U'.   00590003
006000         88  RC012-FUNC-DELETE                       VALUE 'D'.   00600003
006100     05  RC012-NOTIF-NBR            PIC  S9(9) COMP.              00610003
006200     05  RC012-VRFD-USR-ID          PIC  X(08)       VALUE SPACES.00620003
006300     05  RC012-AP-RVRSL-IND         PIC  X(01)       VALUE SPACES.00630003
006400     05  RC012-AP-RVRSL-DTE         PIC  X(10)       VALUE SPACES.00640003
006500     05  RC012-PKGNG-CDE            PIC  X(01)       VALUE SPACES.00650003
006510     05  RC012-FRE-ASTRA-IND        PIC  X(01)       VALUE SPACES.00651004
006600     05  FILLER                     PIC  X(30)       VALUE SPACES.00660004
