000100******************************************************************00010008
000200*    COPY MEMBER:  RCRD013                       LRECL = 450     *00020008
000300*                                                                *00030008
000400*    THIS MEMBER IS USED AS A FILE LAYOUT WHICH CORRESPONDS TO   *00040008
000500*    THE DB2 RECEIPT ITEM AUDIT TABLE.  THIS LAYOUT WILL BE      *00050008
000600*    USED TO PROCESS AND RETAIN THE AUDIT INFORMATION WITHIN     *00060008
000700*    SEQUENTIAL FILE CREATED FROM AN EXTRACT OF THE DB2 TABLE.   *00070008
000800*                                                                *00080008
000900******************************************************************00090008
001000 01  RC013-TRECITM-AUDIT-RECORD.                                  00100008
001100     05  RC013-ORD-NBR              PIC  S9(9) COMP.              00110008
001200     05  RC013-ORD-LNE-NBR          PIC  S9(9) COMP.              00120008
001300     05  RC013-REC-SEQ-NBR          PIC  S9(9) COMP.              00130008
001400     05  RC013-OPER-UNT-ID          PIC  S9(4) COMP.              00140008
001500     05  RC013-FCLTY-ID             PIC  S9(4) COMP.              00150008
001600     05  RC013-CRE-TMST             PIC   X(26).                  00160008
001700     05  RC013-CRE-UID              PIC   X(8).                   00170008
001800     05  RC013-PO-VER-NBR           PIC  S9(9) COMP.              00180008
001900     05  RC013-ITM-NBR              PIC  S9(15)V COMP-3.          00190008
002000     05  RC013-PRE-TKT-IND          PIC   X(1).                   00200008
002100     05  RC013-TKT-FMT-ID           PIC   X(6).                   00210008
002200     05  RC013-RTV-IND              PIC   X(1).                   00220008
002300     05  RC013-STATUS-CDE           PIC   X(2).                   00230008
002400     05  RC013-VER-STATUS-CDE       PIC   X(1).                   00240008
002500     05  RC013-PKSL-ITM-QTY         PIC  S9(9) COMP.              00250008
002600     05  RC013-DTL-CK-ITM-QTY       PIC  S9(9) COMP.              00260008
002700     05  RC013-INNR-PACK-QTY        PIC  S9(4) COMP.              00270008
002800     05  RC013-CASE-PACK-QTY        PIC  S9(4) COMP.              00280008
002900     05  RC013-RTV-QTY              PIC  S9(9) COMP.              00290008
003000     05  RC013-EXPTED-CART-CNT      PIC  S9(9) COMP.              00300008
003100     05  RC013-ACTL-CART-CNT        PIC  S9(9) COMP.              00310008
003200     05  RC013-MKING-APRON-TMST     PIC   X(26).                  00320008
003300     05  RC013-UNT-COST-AMT         PIC  S9(4)V9(3) COMP-3.       00330008
003400     05  RC013-COLOR-DESC           PIC   X(25).                  00340008
003500     05  RC013-SIZE-DESC            PIC   X(25).                  00350008
003600     05  RC013-VEND-STYL-NAME       PIC   X(20).                  00360008
003700     05  RC013-VEND-DESC            PIC   X(25).                  00370008
003800     05  RC013-VERFYD-TMST          PIC   X(26).                  00380008
003900     05  RC013-PKSL-NBR             PIC   X(10).                  00390008
004000     05  RC013-REC-INV-LNE-NBR      PIC  S9(3)V COMP-3.           00400008
004100     05  RC013-DMG-ITM-QTY          PIC  S9(9) COMP.              00410008
004200     05  RC013-UPD-TMST             PIC   X(26).                  00420008
004300     05  RC013-UPD-UID              PIC   X(8).                   00430008
004400     05  RC013-UPD-PGM-ID           PIC   X(8).                   00440008
004500     05  RC013-RCPT-DISTR-UPD-CDE   PIC   X(1).                   00450008
004600         88  RC013-DISTR-UPD-ADJUSTMENT              VALUE 'A'.   00460008
004700         88  RC013-DISTR-UPD-UNVERIFY                VALUE 'U'.   00470008
004800     05  RC013-AUD-TYP-CDE          PIC   X(1).                   00480008
004900         88  RC013-AUD-TYP-BEFORE                    VALUE 'B'.   00490008
005000         88  RC013-AUD-TYP-AFTER                     VALUE 'A'.   00500008
005100     05  RC013-FUNC-CDE             PIC   X(1).                   00510008
005200         88  RC013-FUNC-INSERT                       VALUE 'I'.   00520008
005300         88  RC013-FUNC-UPDATE                       VALUE 'U'.   00530008
005400         88  RC013-FUNC-DELETE                       VALUE 'D'.   00540008
005500     05  RC013-NOTIF-NBR            PIC  S9(9) COMP.              00550008
005600     05  RC013-VRFD-USR-ID          PIC  X(08)       VALUE SPACES.00560008
005700     05  RC013-LAST-TRSCP-TMST      PIC  X(26).                   00570008
005800     05  RC013-LAST-TRSCP-USR-ID    PIC  X(08)       VALUE SPACES.00580008
005900     05  RC013-ROW-CRER-PGM-ID      PIC  X(8).                    00590008
006000     05  RC013-ROW-CRER-USR-ID      PIC  X(8).                    00600008
006100     05  RC013-ROW-CREN-TMST        PIC  X(26).                   00610008
006200     05  RC013-PREPK-ID             PIC  S9(4) COMP.              00620008
006300     05  RC013-PREPK-RATO-QTY       PIC  S9(4) COMP.              00630008
006400     05  RC013-PREPK-ODD-UNT-QTY    PIC  S9(4) COMP.              00640008
006500     05  RC013-PREPK-DRV-LNE-CDE    PIC  X(1).                    00650008
006510     05  RC013-UNT-RTL-AMT          PIC  S9(7)V9(2) COMP-3.       00651009
006520     05  RC013-GP-RTL-AMT           PIC  S9(7)V9(2) COMP-3.       00652009
006530     05  RC013-GP-QTY               PIC  S9(4) COMP.              00653009
006540     05  RC013-ORIG-PKSL-ITM-QTY    PIC  S9(9) COMP.              00654009
006600     05  FILLER                     PIC  X(30)       VALUE SPACES.00660009
