000100******************************************************************01/19/96
000200*    COPY MEMBER:  RCRD034                       LRECL = ???     *RCR00007
000300*                                                                *   LV007
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR THE CREATION OF    *RCR00007
000500*    A REPORT SHOWING RECEIPT ADJUSTMENTS TO RECEIVERS WHICH     *RCR00007
000600*    HAVE STORES THAT COULD NOT BE UPDATED DUE TO PHYSICAL       *RCR00007
000700*    INVENTORY DC CUTOFF DATES (RCKRP020).                       *RCR00007
000900*                                                                *RCR00007
000910*    THIS FILE LAYOUT IS CREATED BY MATCHING A TRIGGER FILE      *RCR00007
000911*    (RCRD014) TO A FILE OF ADJUSTMENTS (RCRD015) TO CREATE      *RCR00007
000912*    THE DATA NEEDED FOR THE REPORT AND TO MERGE THE TWO ABOVE   *RCR00007
000913*    FILES INTO ONE COMMON RECORD LAYOUT FOR THE CREATION OF     *RCR00007
000914*    THE REPORT.                                                 *RCR00007
000920*                                                                *RCR00007
001000******************************************************************RCR00007
001100 01  RC034-ADJUST-COMBINE-RECORD.                                 RCR00007
001200     05  RC034-ORD-NBR              PIC  S9(9) COMP.              RCR00007
001300     05  RC034-ORD-LNE-NBR          PIC  S9(9) COMP.              RCR00007
001400     05  RC034-REC-SEQ-NBR          PIC  S9(9) COMP.              RCR00007
001500     05  RC034-OPER-UNT-ID          PIC  S9(4) COMP.              RCR00007
001600     05  RC034-FCLTY-ID             PIC  S9(4) COMP.              RCR00007
001601     05  RC034-STR-NBR              PIC  S9(4) COMP.              RCR00007
001602     05  RC034-UPD-TMST             PIC   X(26).                     CL**3
001603     05  RC034-UPD-PGM-ID           PIC   X(8).                      CL**3
003500     05  RC034-REC-TYPE-CDE         PIC   X(1).                      CL**3
003600         88  RC034-REC-TYPE-TRIG-NOADJ               VALUE 'A'.      CL**3
003700         88  RC034-REC-TYPE-ADJ                      VALUE 'B'.      CL**3
003701         88  RC034-REC-TYPE-TRIG-ADJ                 VALUE 'C'.      CL**3
003702         88  RC034-REC-TYPE-STORE-NOADJ              VALUE 'D'.      CL**3
003703     05  RC034-SORT-FIELD           PIC  X(10).                           
003710     05  RC034-ADJ-ITM-QTY          PIC  S9(9)        COMP.          CL*10
003720     05  RC034-ADJ-RTL-EXTN-AMT     PIC  S9(7)V9(2)   COMP-3.        CL*10
003730     05  RC034-ADJ-COST-EXTN-AMT    PIC  S9(7)V9(2)   COMP-3.        CL*10
003740     05  RC034-B4-ITM-QTY           PIC  S9(9)        COMP.          CL*10
003750     05  RC034-AFT-ITM-QTY          PIC  S9(9)        COMP.          CL*10
004200     05  FILLER                     PIC   X(40)      VALUE SPACES.   CL**7
