00001 ******************************************************************10/13/94
00002 *    COPY MEMBER:  RCRD004                       LRECL = 200     *RCRD004 
00003 *                                                                *   LV005
00004 *    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *RCRD004 
00005 *    RECEIVING REPORT FILE.                                      *RCRD004 
00006 *                                                                *RCRD004 
00007 ******************************************************************RCRD004 
00008  01  RC004-ASN-RECEIVING-RECORD.                                  RCRD004 
00009      05  RC004-DIST-CNTR            PIC  X(04)    VALUE SPACES.      CL**3
00010      05  RC004-CARRIER-SCAC-CODE    PIC  X(04)    VALUE SPACES.   RCRD004 
00011      05  RC004-BILL-OF-LADING-NBR   PIC  X(16)    VALUE SPACES.      CL**5
00012      05  RC004-PRO-NBR              PIC  X(30).                      CL**2
00013      05  RC004-EDI-VEND-NAME        PIC  X(25)    VALUE SPACES.   RCRD004 
00014      05  RC004-PO-NBR               PIC  9(09)    VALUE ZEROS.       CL**2
00015      05  RC004-DATE-SHIPPED         PIC  9(08)    VALUE ZEROES.      CL**2
00016      05  RC004-TRAILER-NBR          PIC  X(15).                   RCRD004 
00017      05  RC004-CONSOLIDATION-IND    PIC  X(01).                   RCRD004 
00018              88  RC004-CONSOLIDATE-INVOICE-YES    VALUE 'Y'.      RCRD004 
00019              88  RC004-CONSOLIDATE-INVOICE-NO     VALUE 'N'.      RCRD004 
00020      05  RC004-ASN-CARTONS          PIC  9(09)    VALUE ZEROS.       CL**4
00021      05  RC004-CALC-CARTONS         PIC  9(09)    VALUE ZEROS.       CL**4
00022      05  FILLER                     PIC  X(70).                      CL**5
