000100******************************************************************00010000
000200**                        RCRD068                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE COMMAREA PASSED TO RCKUP008 TO FORMAT           **00040004
000500**  AND CREATE VIOLATION IN THE VENDOR COMPLIANCE SYSTEM        **00050004
000600**  LENGTH:  200 BYTES                                          **00060005
000700******************************************************************00070000
000800 01  RC068-VEND-VILN-CRE-RECORD.                                  00080004
000810     05 RC068-VILN-CREATE-TYPE          PIC  X(01).               00081013
000820         88 RC068-PBS-EDIT-CREATE       VALUE 'A'.                00082013
000840     05 RC068-PO-NUMBER                 PIC S9(09) COMP.          00084009
000850     05 RC068-PKSLIP-SEQ-NBR            PIC S9(04) COMP.          00085009
000880     05 RC068-VILN-GROUP-CDE            PIC  X(03).               00088015
000881     05 RC068-VILN-GROUP-MST            PIC  X(03).               00088115
000882     05 RC068-GP-SEQ-NBR                PIC  S9(4) COMP.          00088210
000883     05 RC068-DEPT-NBR                  PIC  S9(4) COMP.          00088310
000890     05 RC068-OPER-UNT-ID               PIC S9(04) COMP.          00089009
000900     05 RC068-REC-SEQ-NBR               PIC S9(09) COMP.          00090009
000910     05 RC068-DEST-STORE                PIC S9(04) COMP.          00091020
001000     05 RC068-ASN-NBR                   PIC  X(30).               00100015
001100     05 RC068-ENT-ID                    PIC  9(09).               00110016
001200     05 RC068-USER-ID                   PIC  X(08).               00120016
001545     05 RC068-PACK-BY-STORE-IND         PIC  X(01).               00154516
001546     05 RC068-VILN-RESP-ID              PIC  9(02).               00154600
001547     05 RC068-FCLTY-AREA-ID             PIC  X(06).               00154716
001548     05 RC068-PO-TYP-CDE                PIC  X(02).               00154816
001549     05 RC068-OCRNC-SHFT-CDE            PIC  X(01).               00154916
001550     05 RC068-OCRNC-DTE                 PIC  X(10).               00155017
001551     05 RC068-RECEIV-DTE                PIC  X(10).               00155124
001552     05 RC068-VERFD-CRTN-COUNT          PIC  S9(4) COMP.          00155224
001553     05 RC068-ERROR-CRTN-COUNT          PIC  S9(4) COMP.          00155324
001554     05 RC068-SHIPT-UNT-ID              PIC  9(18).               00155424
001555     05 RC068-UPC-NBR                   PIC  9(15).               00155524
001556     05 RC068-TSHUUPC-SHP-QTY           PIC S9(09) COMP.          00155624
001557     05 RC068-TPKSLIP-EXP-QTY           PIC S9(09) COMP.          00155724
001558     05 RC068-TPKITEM-EXP-QTY           PIC S9(09) COMP.          00155827
001559     05 RC068-PKSL-LINE-NBR             PIC S9(04) COMP.          00155927
001560     05 RC068-CDE-ID                    PIC S9(04) COMP.          00156027
001561     05 RC068-CDVL-CDE                  PIC  X(02).               00156127
001562     05 RC068-MOD-SUCCESS-CDE           PIC  X(1).                00156227
001563        88  RC068-MOD-SUCCESSFUL        VALUE 'A'.                00156327
001564        88  RC068-MOD-UNSUCCESSFUL      VALUE 'B'.                00156427
001565        88  RC068-MOD-NO-VILN-CREATE    VALUE 'C'.                00156527
001566     05 RC068-DB2-SQLCODE               PIC S9(9).                00156627
001567        88  RC068-SUCCESSFUL-DB2        VALUE  +0.                00156727
001568        88  RC068-NOT-FOUND             VALUE  +100.              00156827
001569        88  RC068-CONTENTION            VALUES -904, -911, -913.  00156927
001570     05 FILLER                            PIC  X(31).             00157027
