000100******************************************************************10/07/94
000200*    COPY MEMBER:  RCRD001                       LRECL = 600     *RCRD001 
000300*                                                                *   LV001
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *RCRD001 
000500*    TRANSCRIPTION EXTRACT FILE.                                 *RCRD001 
000600*                                                                *RCRD001 
000700******************************************************************RCRD001 
000800 01  RC001-ASN-TRANSCRIPTION-RECORD.                              RCRD001 
000900     05  RC001-ASN-TRANSCRIPTION-KEY.                             RCRD001 
001000         10  RC001-OPERATING-COMPANY                              RCRD001 
001100                                    PIC  X(02)    VALUE SPACES.   RCRD001 
001200         10  RC001-DIST-CNTR        PIC  9(04)    VALUE ZEROES.   RCRD001 
001300         10  RC001-EDI-VEND-ID      PIC  9(09)    VALUE ZEROS.    RCRD001 
001400         10  RC001-CARRIER-SCAC-CODE                              RCRD001 
001500                                    PIC  X(04)    VALUE SPACES.   RCRD001 
001600         10  RC001-BILL-OF-LADING-NBR                             RCRD001 
001700                                    PIC  X(30)    VALUE SPACES.   RCRD001 
001800         10  RC001-PO-NBR           PIC  9(09)    VALUE ZEROS.    RCRD001 
001900         10  RC001-STORE-NBR        PIC  9(04)    VALUE ZEROS.    RCRD001 
002000         10  RC001-PO-LINE-NBR      PIC  X(04)    VALUE SPACES.   RCRD001 
002100             88  RC001-PO-LINE-NBR-HDR            VALUE ZERO.     RCRD001 
039100         10  RC001-PO-LINE-NBR-N REDEFINES RC001-PO-LINE-NBR.             
039200             15  RC001-PO-LINE-NBR-9  PIC  9(04).                         
039201         10  RC001-SEQUENCE-NBR     PIC  9(07)    VALUE ZEROS.    RCRD001 
039202         10  RC001-CARTON-IND       PIC  X(01)    VALUE SPACES.   RCRD001 
039203             88  RC001-DETAIL-RECORD              VALUE 'N'.      RCRD001 
039204             88  RC001-CARTON-RECORD              VALUE 'Y'.      RCRD001 
039205*                                                                 RCRD001 
039206     05  RC001-ASN-COMMON-FIELDS-LAYOUT.                          RCRD001 
039207         10  RC001-ASNHDR-NBR       PIC  X(30)    VALUE SPACES.   RCRD001 
039208         10  RC001-EDI-VEND-NAME    PIC  X(25)    VALUE SPACES.   RCRD001 
039209         10  RC001-ORIG-BOL-NBR     PIC  X(30)    VALUE SPACES.   RCRD001 
039210         10  RC001-SEQ-NBR-IND      PIC  X(01)    VALUE SPACES.   RCRD001 
039211             88  RC001-SEQ-NBR-SEQ                VALUE 'Y'.      RCRD001 
039212             88  RC001-SEQ-NBR-STR                VALUE 'N'.      RCRD001 
                                                                                
           05  FILLER                 PIC  X(40)    VALUE SPACES.               
039213*                                                                 RCRD001 
039214     05  RC001-HEADER-DETAIL-LAYOUT PIC  X(400)   VALUE SPACES.   RCRD001 
039215*                                                                 RCRD001 
039216     05  RC001-HEADER-LAYOUT        REDEFINES                     RCRD001 
039217         RC001-HEADER-DETAIL-LAYOUT.                              RCRD001 
039218         10  RC001-DEPT-NBR         PIC  9(03).                   RCRD001 
039219         10  RC001-DEPT-DESC        PIC  X(25).                   RCRD001 
039220         10  RC001-BUYER-NBR        PIC  9(03).                   RCRD001 
039221         10  RC001-BUYER-NAME       PIC  X(32).                   RCRD001 
039222         10  RC001-ANALYST-NAME     PIC  X(32).                   RCRD001 
039223         10  RC001-DATE-SHIPPED     PIC  9(08).                   RCRD001 
039224         10  RC001-PO-DATE          PIC  9(06).                   RCRD001 
039225         10  RC001-REQ-SHIP-DATE    PIC  9(06).                   RCRD001 
039226         10  RC001-CANCEL-DATE      PIC  9(06).                   RCRD001 
039227         10  RC001-CANCEL-EXT-DATE  PIC  9(06).                   RCRD001 
039228         10  RC001-AD-DATE          PIC  9(06).                   RCRD001 
039229         10  RC001-CARR-VEND-ID     PIC S9(09)    COMP-3.         RCRD001 
039230         10  RC001-CARRIER-NAME     PIC  X(35).                   RCRD001 
039231         10  RC001-PRO-NBR          PIC  X(30).                   RCRD001 
039232         10  RC001-TRAILER-NBR      PIC  X(15).                   RCRD001 
039233         10  RC001-SHIPMENT-WEIGHT  PIC S9(09)    COMP-3.         RCRD001 
039234         10  RC001-SHIP-WEIGHT-UM   PIC  X(02).                   RCRD001 
039235         10  RC001-CARTON-CNT-STORE PIC S9(09)    COMP-3.         RCRD001 
039236         10  RC001-CARTON-CNT-PO    PIC S9(09)    COMP-3.         RCRD001 
039237         10  RC001-CARTON-CNT-SHPMT PIC S9(09)    COMP-3.         RCRD001 
039238         10  RC001-SPECIAL-INSTR-1  PIC  X(25).                   RCRD001 
039239         10  RC001-SPECIAL-INSTR-2  PIC  X(25).                   RCRD001 
039240         10  RC001-SPECIAL-INSTR-3  PIC  X(25).                   RCRD001 
039241         10  FILLER                 PIC  X(02).                           
039249         10  RC001-ASNORD-EARLY-LTE-CDE                           RCRD001 
039250                                    PIC  X(01).                   RCRD001 
039251             88  RC001-PO-SHIPPED-EARLY           VALUE 'E'.      RCRD001 
039252             88  RC001-PO-SHIPPED-LATE            VALUE 'L'.      RCRD001 
039253         10  RC001-ASNORD-MTCH-PO-CDE                             RCRD001 
039254                                    PIC  X(01).                   RCRD001 
039255             88  RC001-PO-UNMATCHED               VALUE 'U'.      RCRD001 
039256             88  RC001-PO-CANCELLED-OR-COMPLETE   VALUE 'C'.      RCRD001 
039257         10  RC001-VENDOR-TRSCP-IND PIC  X(01).                   RCRD001 
039258             88  RC001-VENDOR-TRSCP-YES           VALUE 'Y'.      RCRD001 
039259             88  RC001-VENDOR-TRSCP-NO            VALUE 'N'.      RCRD001 
039260             88  RC001-CREATE-PACKSLIP            VALUE 'P'.      RCRD001 
039261         10  RC001-LINE-ERROR-IND   PIC  X(01).                   RCRD001 
039262         10  RC001-CONT-NBR         PIC  X(12).                           
               10  RC001-ISA-NBR          PIC  S9(9) COMP-3.                    
               10  RC001-MAN-SEG-IND      PIC  X(01).                           
               10  RC001-CARR-AUTH-ID     PIC  X(30).                           
039263         10  RC001-HDR-FILLER       PIC  X(31).                   RCRD001 
039264*                                                                 RCRD001 
039265     05  RC001-DETAIL-LAYOUT        REDEFINES                     RCRD001 
039266         RC001-HEADER-DETAIL-LAYOUT.                              RCRD001 
039267         10  RC001-SKU-DEPT-NBR     PIC  X(03).                   RCRD001 
039268         10  RC001-SKU-CLASS-NBR    PIC  X(02).                   RCRD001 
039269         10  RC001-SKU-SEQ-NBR      PIC  X(03).                   RCRD001 
039270         10  RC001-DIST-PACK-QTY    PIC S9(05)    COMP-3.         RCRD001 
039271         10  RC001-UPC-NBR          PIC S9(15)    COMP-3.         RCRD001 
039272         10  RC001-UPC-DESC         PIC  X(25).                   RCRD001 
039273         10  RC001-VENDOR-STYLE     PIC  X(15).                   RCRD001 
039274         10  RC001-SIZE             PIC  X(10).                   RCRD001 
039275         10  RC001-COLOR            PIC  X(10).                   RCRD001 
039276         10  RC001-UNIT-COST        PIC S9(06)V99 COMP-3.         RCRD001 
039277         10  RC001-UNIT-RETAIL      PIC S9(06)V99 COMP-3.         RCRD001 
039278         10  RC001-QTY-ORDERED      PIC S9(07)    COMP-3.         RCRD001 
039279         10  RC001-QTY-ORDERED-UM   PIC  X(03).                   RCRD001 
039280         10  RC001-QTY-SHIPPED      PIC S9(07)    COMP-3.         RCRD001 
039281         10  RC001-QTY-SHIPPED-UM   PIC  X(03).                   RCRD001 
039282         10  RC001-QTY-SHIPPED-VAR  PIC S9(07)    COMP-3.         RCRD001 
039283         10  RC001-PR-CHG-EFF-DAYS  PIC S9(03)    COMP-3.         RCRD001 
039284         10  RC001-ASDTPL-ALLOC-IND PIC  X(01).                   RCRD001 
039285         10  RC001-ASDTPL-MATCH-IND PIC  X(01).                   RCRD001 
039286             88  RC001-LINE-MATCHED               VALUE 'Y'.      RCRD001 
039287             88  RC001-LINE-NOT-MATCHED           VALUE 'N'.      RCRD001 
039288         10  RC001-ASDTPL-PR-DISC-IND                             RCRD001 
039289                                    PIC  X(01).                   RCRD001 
039290             88  RC001-PRICE-DISCREPANCY          VALUE 'Y'.      RCRD001 
039291             88  RC001-NO-PRICE-DISCREPANCY       VALUE 'N'.      RCRD001 
039292         10  RC001-ASDTPL-PR-VAR-IND                              RCRD001 
039293                                    PIC  X(01).                   RCRD001 
039294             88  RC001-PRICE-VARIANCE             VALUE 'Y'.      RCRD001 
039295             88  RC001-NO-PRICE-VARIANCE          VALUE 'N'.      RCRD001 
039296         10  RC001-SKU-NBR          PIC  X(08).                   RCRD001 
039296         10  RC001-DTL-FILLER       PIC  X(279).                  RCRD001 
039297     05  RC001-DETAIL-CARTON-LAYOUT  REDEFINES                    RCRD001 
039298         RC001-HEADER-DETAIL-LAYOUT.                              RCRD001 
039299         10  RC001-CARTON-TABLE OCCURS 10 TIMES.                  RCRD001 
039300             15  RC001-CARTON-NBR   PIC S9(18)  COMP-3.           RCRD001 
039301             15  RC001-CARTON-QTY   PIC S9(09)  COMP-3.           RCRD001 
039302             15  RC001-CTN-UPC      PIC S9(15)  COMP-3.           RCRD001 
039303             15  RC001-CARTON-FIL   PIC  X(07).                   RCRD001 
039304         10  RC001-CARTON-FILLER    PIC  X(100).                  RCRD001 
