000100******************************************************************00010000
000200**                        RCRD120                               **00020000
000300**                                                              **00030000
000400**  INVALID DATA FILE FROM THE THIRD PARTY OUTBOUND SHIPPING    **00040000
000500**  INFORMATION FOR A TRAILER OF PROCESSED CARTONS TO BE SENT   **00050000
000600**  TO THE STORES.                                              **00060000
000700**                                                              **00070000
000800**  LENGTH:  330 BYTES                                          **00080006
000900******************************************************************00090000
001000 01  RC120-INVALID-SHIPMENT-REC.                                  00100007
001100     05  RC120-INVALID-FILE-RECORD-NBR  PIC  9(06).               00110020
001200     05  RC120-RECORD-TYPE-SW           PIC  X(01).               00120009
001300         88  RC120-ERROR-RECORD              VALUE 'E'.           00130009
001400         88  RC120-WARNING-RECORD            VALUE 'W'.           00140009
001500     05  RC120-3RD-PRTY-DC-NBR          PIC  X(06).               00150003
001600     05  RC120-3PDCNBR-VALID-SW         PIC  X(01).               00160003
001700         88  RC120-3PDCNBR-VALID             VALUE 'Y'.           00170003
001800         88  RC120-3PDCNBR-NOT-NUMERIC       VALUE 'A'.           00180003
001900         88  RC120-3PDCNBR-INVALID-NBR       VALUE 'B'.           00190003
002000         88  RC120-3PDCNBR-NOT-A-DC          VALUE 'C'.           00200014
002100         88  RC120-3PDCNBR-MISSING           VALUE 'D'.           00210017
002200         88  RC120-3PDCNBR-OTHER-ISSUE       VALUE 'O'.           00220017
002300     05  RC120-KOHLS-SHIP-TO-DC-NBR     PIC  X(06).               00230003
002400     05  RC120-KSDCNBR-VALID-SW         PIC  X(01).               00240003
002500         88  RC120-KSDCNBR-VALID             VALUE 'Y'.           00250003
002600         88  RC120-KSDCNBR-NOT-NUMERIC       VALUE 'A'.           00260003
002700         88  RC120-KSDCNBR-INVALID-NBR       VALUE 'B'.           00270003
002800         88  RC120-KSDCNBR-NOT-A-DC          VALUE 'C'.           00280015
002900         88  RC120-KSDCNBR-MISSING           VALUE 'D'.           00290017
003000         88  RC120-KSDCNBR-OTHER-ISSUE       VALUE 'O'.           00300017
003100     05  RC120-SHIP-SCAC                PIC  X(06).               00310003
003200     05  RC120-SHIP-TRAILER-NBR         PIC  X(30).               00320003
003300     05  RC120-SHIP-BOL                 PIC  X(30).               00330003
003400     05  RC120-SHIP-PRO                 PIC  X(30).               00340003
003500     05  RC120-SHIP-DATE                PIC  X(08).               00350003
003600     05  RC120-SHPDTE-VALID-SW          PIC  X(01).               00360003
003700         88  RC120-SHPDTE-VALID              VALUE 'Y'.           00370003
003800         88  RC120-SHPDTE-NOT-NUMERIC        VALUE 'A'.           00380011
003900         88  RC120-SHPDTE-FORMAT-ISSUE       VALUE 'B'.           00390011
004000         88  RC120-SHPDTE-INVALID-DATE       VALUE 'C'.           00400011
004100         88  RC120-SHPDTE-MISSING            VALUE 'D'.           00410017
004200         88  RC120-SHPDTE-OTHER-ISSUE        VALUE 'O'.           00420003
004300     05  RC120-CUST-ORDER-NBR           PIC  X(20).               00430003
004400     05  RC120-CUSTORD-VALID-SW         PIC  X(01).               00440003
004500         88  RC120-CUSTORD-VALID             VALUE 'Y'.           00450003
004600         88  RC120-CUSTORD-FORMAT-ISSUE      VALUE 'A'.           00460003
004700         88  RC120-CUSTORD-INVALID-PO        VALUE 'B'.           00470003
004800         88  RC120-CUSTORD-INVALID-STORE     VALUE 'C'.           00480003
004900         88  RC120-CUSTORD-INVALID-POSTR     VALUE 'D'.           00490003
005000         88  RC120-CUSTORD-MISSING           VALUE 'E'.           00500017
005100         88  RC120-CUSTORD-OTHER-ISSUE       VALUE 'O'.           00510003
005200     05  RC120-KOHLS-PO-NBR             PIC  X(10).               00520003
005300     05  RC120-KPONBR-VALID-SW          PIC  X(01).               00530003
005400         88  RC120-KPONBR-VALID              VALUE 'Y'.           00540003
005500         88  RC120-KPONBR-NOT-NUMERIC        VALUE 'A'.           00550003
005600         88  RC120-KPONBR-INVALID-PO         VALUE 'B'.           00560003
005700         88  RC120-KPONBR-GT-8-DIGIT         VALUE 'C'.           00570003
005800         88  RC120-KPONBR-MISSING            VALUE 'D'.           00580017
005900         88  RC120-KPONBR-OTHER-ISSUE        VALUE 'O'.           00590003
006000     05  RC120-3RD-PRTY-ORDER-NBR       PIC  X(15).               00600005
006100     05  RC120-DEST-STORE-NBR           PIC  X(06).               00610012
006200     05  RC120-DSTSTR_VALID-SW          PIC  X(01).               00620012
006300         88  RC120-DSTSTR-VALID              VALUE 'Y'.           00630012
006400         88  RC120-DSTSTR-NOT-NUMERIC        VALUE 'A'.           00640012
006500         88  RC120-DSTSTR-INVALID-STR        VALUE 'B'.           00650012
006600         88  RC120-DSTSTR-NOT-A-DS-STR       VALUE 'C'.           00660016
006700         88  RC120-DSTSTR-MISSING            VALUE 'D'.           00670017
006800     05  RC120-SML-NBR                  PIC  X(30).               00680003
006900     05  RC120-SMLNBR-VALID-SW          PIC  X(01).               00690008
007000         88  RC120-SMLNBR-VALID              VALUE 'Y'.           00700003
007100         88  RC120-SMLNBR-NOT-NUMERIC        VALUE 'A'.           00710003
007200         88  RC120-SMLNBR-FORMAT-ISSUE       VALUE 'B'.           00720003
007300         88  RC120-SMLNBR-GT-20-DIGIT        VALUE 'C'.           00730003
007400         88  RC120-SMLNBR-MISMATCH-STR       VALUE 'D'.           00740013
007500         88  RC120-SMLNBR-INVALID-DC         VALUE 'E'.           00750003
007600         88  RC120-SMLNBR-ALREADY-EXISTS     VALUE 'F'.           00760003
007700         88  RC120-SMLNBR-STR-SHIPPED        VALUE 'G'.           00770003
007800         88  RC120-SMLNBR-STR-SCANNED        VALUE 'H'.           00780003
007900         88  RC120-SMLNBR-MISSING            VALUE 'I'.           00790018
008000         88  RC120-SMLNBR-OTHER-ISSUE        VALUE 'O'.           00800018
008100     05  RC120-3RD-PRTY-CARTON-ID       PIC  X(30).               00810003
008200     05  RC120-CUST-ORDER-LINE-NBR      PIC  X(08).               00820003
008300     05  RC120-CORDLN-VALID-SW          PIC  X(01).               00830008
008400         88  RC120-CORDLN-VALID              VALUE 'Y'.           00840004
008500         88  RC120-CORDLN-NOT-NUMERIC        VALUE 'A'.           00850004
008600     05  RC120-SKU-NBR                  PIC  X(10).               00860003
008700     05  RC120-SKUNBR-VALID-SW          PIC  X(01).               00870008
008800         88  RC120-SKUNBR-VALID              VALUE 'Y'.           00880004
008900         88  RC120-SKUNBR-NOT-NUMERIC        VALUE 'A'.           00890004
009000         88  RC120-SKUNBR-GT-8-DIGIT         VALUE 'B'.           00900004
009100         88  RC120-SKUNBR-NOT-ON-MSTR        VALUE 'C'.           00910004
009200         88  RC120-SKUNBR-NOT-ON-PO          VALUE 'D'.           00920004
009300         88  RC120-SKUNBR-MISSING            VALUE 'E'.           00930017
009400         88  RC120-SKUNBR-OTHER-ISSUE        VALUE 'O'.           00940004
009500     05  RC120-SKUNBR-STR-ALLOC-SW      PIC  X(01).               00950009
009600         88  RC120-SKUNBR-STRALLOC-VALID     VALUE 'Y'.           00960009
009700         88  RC120-SKUNBR-NO-STRALLOC        VALUE 'A'.           00970009
009800         88  RC120-SKUNBR-STRALLOC-NA        VALUE 'N'.           00980010
009900         88  RC120-SKUNBR-STRALLOC-OTHER     VALUE 'O'.           00990009
010000     05  RC120-SHIP-QTY                 PIC  X(10).               01000003
010100     05  RC120-SHPQTY-VALID-SW          PIC  X(01).               01010008
010200         88  RC120-SHPQTY-VALID              VALUE 'Y'.           01020004
010300         88  RC120-SHPQTY-NOT-NUMERIC        VALUE 'A'.           01030004
010400         88  RC120-SHPQTY-RECV-GT-ORD        VALUE 'B'.           01040004
010500         88  RC120-SHPQTY-MISSING            VALUE 'C'.           01050017
010600         88  RC120-SHPQTY-OTHER-ISSUE        VALUE 'O'.           01060004
010700     05  RC120-ORDER-QTY                PIC  X(10).               01070003
010800     05  RC120-ORDQTY-VALID-SW          PIC  X(01).               01080008
010900         88  RC120-ORDQTY-VALID              VALUE 'Y'.           01090004
011000         88  RC120-ORDQTY-NOT-NUMERIC        VALUE 'A'.           01100004
011100         88  RC120-ORDQTY-MISSING            VALUE 'B'.           01110017
011200     05  FILLER                         PIC  X(46).               01120019
