000100******************************************************************12/12/95
000200*    COPY MEMBER:  RCRD011                       LRECL = 50      *RCR00004
000300*                                                                *   LV004
000400*    THIS MEMBER IS USED AS A FILE LAYOUT WHICH WILL CONTAIN A   *RCR00004
000500*    TIMESTAMP WHICH WILL BE USED TO CONTROL THE EXTRACTING AND  *RCR00004
000600*    DELETING OF DATA FROM VARIOUS DB2 AUDIT TABLES.             *RCR00004
000700*                                                                *RCR00004
000800******************************************************************RCR00004
000900 01  RC011-CONTROL-RECORD.                                        RCR00004
001000     05  RC011-CONTROL-TMST.                                      RCR00004
001100         10  RC011-TMST-YYYY        PIC 9(4).                        CL**2
001200         10  FILLER                 PIC X(1).                        CL**2
001300         10  RC011-TMST-MM          PIC 9(2).                        CL**2
001400         10  FILLER                 PIC X(1).                        CL**2
001500         10  RC011-TMST-DD          PIC 9(2).                        CL**2
001600         10  FILLER                 PIC X(1).                        CL**2
001700         10  RC011-TMST-HH          PIC 9(2).                        CL**2
001800         10  FILLER                 PIC X(1).                        CL**2
001900         10  RC011-TMST-MM          PIC 9(2).                        CL**2
002000         10  FILLER                 PIC X(1).                        CL**2
002100         10  RC011-TMST-SS          PIC 9(2).                        CL**2
002200         10  FILLER                 PIC X(1).                        CL**2
002300         10  RC011-TMST-NNNNNN      PIC 9(6).                        CL**2
002400     05  FILLER                     PIC X(24)     VALUE SPACES.      CL**2
002500                                                                  RCR00004
