000100***************************************************************** 00010000
000200*    RCRD113                                                    * 00020000
000300*    RECORD: Sephora - Inbound ASN to 3rd party (geodis)        * 00030006
000400***************************************************************** 00040000
000458 01 asnHeader.                                                    00045809
000459    05 version                      PIC 9.                        00045909
000460    05 sender                       PIC X(07).                    00046009
000461    05 receiver                     PIC X(05).                    00046109
000462    05 opCompany                    PIC 9(02).                    00046209
000463    05 vendorId                     PIC 9(09).                    00046309
000464    05 shipmentIdentificationNumber PIC X(30).                    00046409
000465    05 dateShipped                  PIC X(10).                    00046513
000466    05 asnType                      PIC X(02).                    00046613
000467    05 tpLoadNbr                    PIC x.                        00046713
000468    05 informationContact           PIC X(17).                    00046813
000469    05 scac                         PIC X(04).                    00046913
000470    05 bolNbr                       PIC X(30).                    00047013
000471    05 proNbr                       PIC X(30).                    00047113
000472    05 totalCartonQty               PIC 9(09).                    00047213
000473    05 totalCartonWeight            PIC 9(09).                    00047313
000474    05 ShipFromDetails.                                           00047413
000475       10 dc                        PIC 9(04).                    00047513
000476       10 addressLine               PIC X(30).                    00047613
000477       10 city                      PIC X(20).                    00047713
000478       10 state                     PIC X(02).                    00047813
000479       10 zip                       PIC X(05).                    00047913
000480    05 creationTime                 PIC 9(26).                    00048013
