000100******************************************************************00010000
000200*    COPY MEMBER:  RCRD109                       LRECL = 1100    *00020006
000300*                                                                *00030000
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE ASN          *00040000
000500*    BULK ORDERS - MIXED SKU CARTONS SPLIT                       *00050000
000600*                                                                *00060000
000700******************************************************************00070000
000800 01  RC109-ASN-TRANSCRIPTION-RECORD.                              00080000
000900     05  RC109-ASN-TRANSCRIPTION-KEY.                             00090000
001000         10  RC109-OPERATING-COMPANY                              00100000
001100                                    PIC  X(02)    VALUE SPACES.   00110000
001200         10  RC109-DIST-CNTR        PIC  9(04)    VALUE ZEROES.   00120000
001300         10  RC109-EDI-VEND-ID      PIC  9(09)    VALUE ZEROS.    00130000
001400         10  RC109-CARRIER-SCAC-CODE                              00140000
001500                                    PIC  X(04)    VALUE SPACES.   00150000
001600         10  RC109-BILL-OF-LADING-NBR                             00160000
001700                                    PIC  X(30)    VALUE SPACES.   00170000
001800         10  RC109-PO-NBR           PIC  9(09)    VALUE ZEROS.    00180000
001900         10  RC109-STORE-NBR        PIC  9(04)    VALUE ZEROS.    00190000
002000         10  RC109-PO-LINE-NBR      PIC  X(04)    VALUE SPACES.   00200000
002100             88  RC109-PO-LINE-NBR-HDR            VALUE ZERO.     00210000
002200         10  RC109-PO-LINE-NBR-N REDEFINES RC109-PO-LINE-NBR.     00220000
002300             15  RC109-PO-LINE-NBR-9  PIC  9(04).                 00230000
002400         10  RC109-SEQUENCE-NBR     PIC  9(07)    VALUE ZEROS.    00240000
002500         10  RC109-CARTON-IND       PIC  X(01)    VALUE SPACES.   00250000
002600             88  RC109-DETAIL-RECORD              VALUE 'N'.      00260000
002700             88  RC109-CARTON-RECORD              VALUE 'Y'.      00270000
002800*                                                                 00280000
002900     05  RC109-ASN-COMMON-FIELDS-LAYOUT.                          00290000
003000         10  RC109-ASNHDR-NBR       PIC  X(30)    VALUE SPACES.   00300000
003100         10  RC109-EDI-VEND-NAME    PIC  X(25)    VALUE SPACES.   00310000
003200         10  RC109-ORIG-BOL-NBR     PIC  X(30)    VALUE SPACES.   00320000
003300         10  RC109-SEQ-NBR-IND      PIC  X(01)    VALUE SPACES.   00330000
003400             88  RC109-SEQ-NBR-SEQ                VALUE 'Y'.      00340000
003500             88  RC109-SEQ-NBR-STR                VALUE 'N'.      00350000
003600                                                                  00360000
003700     05  FILLER                 PIC  X(02)    VALUE SPACES.       00370000
003800*                                                                 00380000
003900     05  RC109-HEADER-LAYOUT.                                     00390000
004000         10  RC109-DEPT-NBR         PIC  9(03).                   00400000
004100         10  RC109-DEPT-DESC        PIC  X(25).                   00410000
004200         10  RC109-BUYER-NBR        PIC  9(03).                   00420000
004300         10  RC109-BUYER-NAME       PIC  X(32).                   00430000
004400         10  RC109-ANALYST-NAME     PIC  X(32).                   00440000
004500         10  RC109-DATE-SHIPPED     PIC  9(08).                   00450000
004600         10  RC109-PO-DATE          PIC  9(06).                   00460000
004700         10  RC109-REQ-SHIP-DATE    PIC  9(06).                   00470000
004800         10  RC109-CANCEL-DATE      PIC  9(06).                   00480000
004900         10  RC109-CANCEL-EXT-DATE  PIC  9(06).                   00490000
005000         10  RC109-AD-DATE          PIC  9(06).                   00500000
005100         10  RC109-CARR-VEND-ID     PIC S9(09)    COMP-3.         00510000
005200         10  RC109-CARRIER-NAME     PIC  X(35).                   00520000
005300         10  RC109-PRO-NBR          PIC  X(30).                   00530000
005400         10  RC109-TRAILER-NBR      PIC  X(15).                   00540000
005500         10  RC109-SHIPMENT-WEIGHT  PIC S9(09)    COMP-3.         00550000
005600         10  RC109-SHIP-WEIGHT-UM   PIC  X(02).                   00560000
005700         10  RC109-CARTON-CNT-STORE PIC S9(09)    COMP-3.         00570000
005800         10  RC109-CARTON-CNT-PO    PIC S9(09)    COMP-3.         00580000
005900         10  RC109-CARTON-CNT-SHPMT PIC S9(09)    COMP-3.         00590000
006000         10  RC109-SPECIAL-INSTR-1  PIC  X(25).                   00600000
006100         10  RC109-SPECIAL-INSTR-2  PIC  X(25).                   00610000
006200         10  RC109-SPECIAL-INSTR-3  PIC  X(25).                   00620000
006300         10  FILLER                 PIC  X(02).                   00630000
006400         10  RC109-ASNORD-EARLY-LTE-CDE                           00640000
006500                                    PIC  X(01).                   00650000
006600             88  RC109-PO-SHIPPED-EARLY           VALUE 'E'.      00660000
006700             88  RC109-PO-SHIPPED-LATE            VALUE 'L'.      00670000
006800         10  RC109-ASNORD-MTCH-PO-CDE                             00680000
006900                                    PIC  X(01).                   00690000
007000             88  RC109-PO-UNMATCHED               VALUE 'U'.      00700000
007100             88  RC109-PO-CANCELLED-OR-COMPLETE   VALUE 'C'.      00710000
007200         10  RC109-VENDOR-TRSCP-IND PIC  X(01).                   00720000
007300             88  RC109-VENDOR-TRSCP-YES           VALUE 'Y'.      00730000
007400             88  RC109-VENDOR-TRSCP-NO            VALUE 'N'.      00740000
007500             88  RC109-CREATE-PACKSLIP            VALUE 'P'.      00750000
007600         10  RC109-LINE-ERROR-IND   PIC  X(01).                   00760000
007700         10  RC109-CONT-NBR         PIC  X(12).                   00770000
007800         10  RC109-ISA-NBR          PIC  S9(9) COMP-3.            00780000
007900         10  RC109-MAN-SEG-IND      PIC  X(01).                   00790000
008000         10  RC109-CARR-AUTH-ID     PIC  X(30).                   00800000
008100         10  RC109-HDR-FILLER       PIC  X(31).                   00810000
008200*                                                                 00820000
008300     05  FILLER                 PIC  X(02)    VALUE SPACES.       00830000
008400*                                                                 00840000
008500     05  RC109-DETAIL-LAYOUT.                                     00850000
008600         10  RC109-SKU-DEPT-NBR     PIC  X(03).                   00860000
008700         10  RC109-SKU-CLASS-NBR    PIC  X(02).                   00870000
008800         10  RC109-SKU-SEQ-NBR      PIC  X(03).                   00880000
008900         10  RC109-DIST-PACK-QTY    PIC S9(05)    COMP-3.         00890000
009000         10  RC109-UPC-NBR          PIC S9(15)    COMP-3.         00900000
009100         10  RC109-UPC-DESC         PIC  X(25).                   00910000
009200         10  RC109-VENDOR-STYLE     PIC  X(15).                   00920000
009300         10  RC109-SIZE             PIC  X(10).                   00930000
009400         10  RC109-COLOR            PIC  X(10).                   00940000
009500         10  RC109-UNIT-COST        PIC S9(06)V99 COMP-3.         00950000
009600         10  RC109-UNIT-RETAIL      PIC S9(06)V99 COMP-3.         00960000
009700         10  RC109-QTY-ORDERED      PIC S9(07)    COMP-3.         00970000
009800         10  RC109-QTY-ORDERED-UM   PIC  X(03).                   00980000
009900         10  RC109-QTY-SHIPPED      PIC S9(07)    COMP-3.         00990000
010000         10  RC109-QTY-SHIPPED-UM   PIC  X(03).                   01000000
010100         10  RC109-QTY-SHIPPED-VAR  PIC S9(07)    COMP-3.         01010000
010200         10  RC109-PR-CHG-EFF-DAYS  PIC S9(03)    COMP-3.         01020000
010300         10  RC109-ASDTPL-ALLOC-IND PIC  X(01).                   01030000
010400         10  RC109-ASDTPL-MATCH-IND PIC  X(01).                   01040000
010500             88  RC109-LINE-MATCHED               VALUE 'Y'.      01050000
010600             88  RC109-LINE-NOT-MATCHED           VALUE 'N'.      01060000
010700         10  RC109-ASDTPL-PR-DISC-IND                             01070000
010800                                    PIC  X(01).                   01080000
010900             88  RC109-PRICE-DISCREPANCY          VALUE 'Y'.      01090000
011000             88  RC109-NO-PRICE-DISCREPANCY       VALUE 'N'.      01100000
011100         10  RC109-ASDTPL-PR-VAR-IND                              01110000
011200                                    PIC  X(01).                   01120000
011300             88  RC109-PRICE-VARIANCE             VALUE 'Y'.      01130000
011400             88  RC109-NO-PRICE-VARIANCE          VALUE 'N'.      01140000
011500         10  RC109-SKU-NBR          PIC  X(08).                   01150000
011600         10  RC109-DTL-FILLER       PIC  X(279).                  01160000
011700*                                                                 01170000
011800     05  FILLER                 PIC  X(02)    VALUE SPACES.       01180000
011810*                                                                 01181000
011820     05  RC109-DETAIL-CARTON-LAYOUT.                              01182000
011830             15  RC109-CARTON-NBR     PIC  9(18).                 01183005
011840             15  RC109-CARTON-QTY     PIC S9(09)  COMP-3.         01184003
011850             15  RC109-CTN-UPC        PIC S9(15)  COMP-3.         01185003
011860             15  RC109-CRTN-UNIQUE-SW PIC  X(01).                 01186004
011861                88  RC109-CRTN-UNIQUE           VALUE 'Y'.        01186103
011862                88  RC109-CRTN-UNIQUE-NO        VALUE 'N'.        01186203
011863             15  RC109-CARTON-FIL     PIC  X(02).                 01186305
011890*                                                                 01189000
011900     05  RC109-ASN-DATE         PIC  X(10)    VALUE SPACES.       01190009
011910     05  RC109-ASN-TIME         PIC  X(08)    VALUE SPACES.       01191009
012000     05  FILLER                 PIC  X(82)    VALUE SPACES.       01200008
