000100 01  RC009-REC.                                                   02/01/96
000200     10 RC009-OP-CO-NBR               PIC   X(2).                 RCR00002
000300     10 RC009-STR-NBR                 PIC  S9(4) COMP.               LV002
000400     10 RC009-DIV-SEQ-NBR             PIC   X(3).                 RCR00002
000500     10 RC009-DEPT-NBR                PIC  S9(4) COMP.            RCR00002
000600     10 RC009-RCVR-NBR                PIC   X(8).                 RCR00002
000700     10 RC009-PO-NBR                  PIC  S9(9) COMP.            RCR00002
000800     10 RC009-INVC-NBR                PIC   X(10).                RCR00002
000900     10 RC009-VERIFYD-CT-DTE          PIC   X(6).                 RCR00002
001000     10 RC009-REC-DTE                 PIC   X(6).                 RCR00002
001100     10 RC009-CLASS-NBR               PIC   X(3).                 RCR00002
001200     10 RC009-VEND-INHSE-NAME         PIC   X(25).                RCR00002
001300     10 RC009-VEND-INHSE-NBR          PIC   X(3).                 RCR00002
001400     10 RC009-VEND-DUNS-DESC          PIC   X(25).                RCR00002
001500     10 RC009-VEND-DUNS-NBR           PIC   X(9).                 RCR00002
001600     10 RC009-SKU-SEQ-NBR             PIC   X(3).                 RCR00002
001700     10 RC009-UNIT-RTL-AMT            PIC  S9(7)V9(2) COMP-3.     RCR00002
001800     10 RC009-LOWST-UNIT-RTL-AMT      PIC  S9(7)V9(2) COMP-3.     RCR00002
001900     10 RC009-RTL-UNIT-ORD-QTY        PIC  S9(9) COMP.            RCR00002
002000     10 RC009-RTL-UNIT-RCVD-QTY       PIC  S9(9) COMP.            RCR00002
002100     10 RC009-RTL-UNIT-MK-QTY         PIC  S9(9) COMP.            RCR00002
002200     10 RC009-COST-EXTN-AMT           PIC  S9(7)V9(2) COMP-3.     RCR00002
002300     10 RC009-RTL-EXTN-AMT            PIC  S9(7)V9(2) COMP-3.     RCR00002
002400     10 RC009-PRC-FCLTY-AREA-ID       PIC   X(6).                 RCR00002
002500     10 RC009-INVC-RTL-QTY            PIC  S9(9) COMP.            RCR00002
002600     10 RC009-CASH-DISC-CDE           PIC   X(4).                 RCR00002
002700     10 RC009-DISC-DAYS-CNT           PIC  S9(4) COMP.            RCR00002
002800     10 RC009-DISC-TERMS-CDE          PIC   X(1).                 RCR00002
002900     10 RC009-EOM-IND                 PIC   X(1).                 RCR00002
003000     10 RC009-DATING-EXTN-CD          PIC  S9(4) COMP.            RCR00002
003100     10 RC009-FRGT-PAYT-CDE           PIC   X(1).                 RCR00002
003200     10 RC009-STR-TYP-CDE             PIC   X(2).                 RCR00002
003300     10 RC009-PO-LNE-NBR              PIC  S9(4) COMP.            RCR00002
003400     10 RC009-REC-SEQ-NBR             PIC  S9(9) COMP.            RCR00002
003500     10 RC009-REC-SRC-CDE             PIC   X(1).                    CL**2
003600     10 RC009-NOTIF-NBR               PIC  S9(9) COMP.               CL**2
003700     10 RC009-ADJ-CYC-NBR             PIC  S9(9) COMP.               CL**2
003800*    10 RC009-DFRD-BKG-DTE            PIC  X(10).                         
003810     10 RC009-CURR-OPER-UNT-ID        PIC  S9(4) COMP.                    
003900     10 RC009-CURR-FCLTY-ID           PIC  S9(4) COMP.                    
004000     10 RC009-OPER-UNT-ID             PIC  S9(4) COMP.                    
004100     10 RC009-FCLTY-ID                PIC  S9(4) COMP.                    
004200*    10 RC009-DFRD-BKG-CDE            PIC  X(01).                         
