000100******************************************************************00010000
000200* THIS FILE IS CREATED BY RCKRP096 - IT WILL CONTAIN ANY VERIFIED 00020000
000300* RECEIVER THAT HAS LINES ON IT THAT ARE NOT VERIFIED.            00030000
000400* THIS FILE WILL BE USED FOR THE BODY OF THE EMAIL ALERT.         00040000
000500* JOB RCK012 WILL BE USED TO SEND AN EMAIL ALERT TO INVENTORY CONT00050000
000600*   RECORD LENGTH: 80                                             00060000
000700******************************************************************00070000
000800 01  RC125-VE-RCVR-EMAIL-REC.                                     00080000
006600     05  FILLER                       PIC X(01)   VALUE SPACES.   00660000
006700     05  RC125-OPER                   PIC ZZZ9    VALUE ZEROES.   00670000
006800     05  FILLER                       PIC X(01)   VALUE '-'.      00680000
006900     05  RC125-PO                     PIC 9(09)   VALUE ZEROES.   00690000
007000     05  FILLER                       PIC X(01)   VALUE '-'.      00700000
007100     05  RC125-RCVR                   PIC 9(04)   VALUE ZEROES.   00710000
007200     05  FILLER                       PIC X(01)   VALUE SPACES.   00720001
007210     05  FILLER                       PIC X(11)   VALUE           00721001
007300                                                  '   VE TMST:'.  00730000
007400     05  RC125-VE-TMST                PIC X(26)   VALUE ZEROES.   00740000
007500     05  FILLER                       PIC X(03)   VALUE SPACES.   00750001
007600                                                                  00760000
007610     05  FILLER                       PIC X(10)   VALUE           00761001
007620                                                  'OPER-LINE:'.   00762001
007700     05  RC125-ITEM-OPER              PIC 9(04)   VALUE ZEROES.   00770000
007800     05  FILLER                       PIC X(01)   VALUE '-'.      00780000
007900     05  RC125-ITEM-LINE              PIC 9(04)   VALUE ZEROES.   00790000
008013                                                                  00801300
