000100**************************************************************            
000200*  LRECL = 100                                                            
000300**************************************************************            
000400 01  RCRD018-EXTRACT-LINE.                                                
000500     05  RC018-CURR-OPER-UNT-ID  PIC S9(4) COMP.                          
000600     05  RC018-CURR-FCLTY-ID     PIC S9(4) COMP.                          
000700     05  RC018-OPER-UNT-ID       PIC S9(4) COMP.                          
000800     05  RC018-FCLTY-ID          PIC S9(4) COMP.                          
000900     05  RC018-PROCESSING-AREA6  PIC X(6).                                
001000     05  RC018-PO                PIC 9(8).                                
001100     05  RC018-REC-SEQ-NBR       PIC 9(9).                                
001200     05  RC018-DATE-VERIFIED-COUNT PIC 9(6).                              
001300     05  FILLER REDEFINES RC018-DATE-VERIFIED-COUNT.                      
001400         10  RC018-DV-MM         PIC 9(2).                                
001500         10  RC018-DV-DD         PIC 9(2).                                
001600         10  RC018-DV-YY         PIC 9(2).                                
001700     05  RC018-QTY-VRFD          PIC S9(6).                               
001800     05  FILLER                  PIC X(10).                               
001900     05  RC018-SORT-CODE         PIC X(01).                               
002000     05  RC018-RETAIL-EXT-VRFD   PIC S9(7)V99   COMP-3.                   
002100     05  RC018-COST-EXT-AMT      PIC S9(7)V99   COMP-3.                   
002200     05  RC018-STR-TYP-CDE       PIC X(02).                               
002300         88  RC018-STR-IS-DC                VALUE 'DC'.                   
002400         88  RC018-STR-IS-DS                VALUE 'DS'.                   
002500     05  RC018-PO-LNE-NBR        PIC 9(09).                               
002600     05  FILLER                  PIC X(25).                          CL**3
