000100***************************************************************** 00010001
000200*    RCRD105                                                    * 00020001
000300*    RECORD: Sku Sort PO Detail (for XML conversion)            * 00030001
000400***************************************************************** 00040001
000410 01  RDC-Detail-WORK-FIELDS.                                      00041001
000420     05  PD-COUNT                        PIC 9(03).               00042001
000430     05  DC-COUNT                        PIC 9(03).               00043001
000440     05  SK-COUNT                        PIC 9(03).               00044001
000450     05  UP-COUNT                        PIC 9(03).               00045001
000451                                                                  00045101
000452 01  SHIPMENT.                                                    00045201
000453     05 RDCDetail.                                                00045301
000454        10  POInfo OCCURS 1 TO 10 TIMES                           00045401
000455                     DEPENDING ON PD-COUNT.                       00045501
000456         15 PoNumber                          PIC 9(08).          00045601
000457         15 VendorPONbr                       PIC 9(08).          00045701
000458         15 DeptNumber                        PIC 9(04).          00045801
000459         15 DcDetails.                                            00045901
000460            20 DCLocationDetails OCCURS 1 TO 9 TIMES              00046001
000461                        DEPENDING ON DC-COUNT.                    00046101
000470             25 DcNumber                PIC 9(04).                00047001
000480             25 DeliveryNbr             PIC X(04).                00048001
000490             25 ItemInfo OCCURS 1 TO 300 TIMES                    00049001
000500                        DEPENDING ON SK-COUNT.                    00050001
000600               35 SKUNumber            PIC 9(08).                 00060001
000700               35 UPCData OCCURS 1 TO 6 TIMES                     00070001
000800                         DEPENDING ON UP-COUNT.                   00080001
000900                  40 UPCNumber        PIC X(20).                  00090001
001000               35 UnitQuantity          PIC 9(05).                00100001
