000100***************************************************************** 00010000
000200*    RCRD117                                                    * 00020000
000300*    RECORD: ASN download to 3rd party (Geodis)                 * 00030000
000310*            carton contents                                    * 00031000
000320***************************************************************** 00032000
000350*                                                                 00035000
000450 01  skuInfo.                                                     00045003
000470     05 lineNumber                PIC X(04).                      00047005
000471     05 skuNumber                 PIC X(08).                      00047104
000480     05 upcNumber                 PIC 9(15).                      00048003
000490     05 unitQuantity              PIC 9(09).                      00049003
