      ******************************************************************        
      *    COPY MEMBER:  RCRD067                       LRECL = 80      *        
      *                                                                *        
      *    THIS MEMBER IS USED AS A FILE LAYOUT FOR THE DATE           *        
      *    EXTRACT RECORD CREATED IN PROGRAM RCKUT073 AND USED IN      *        
      *    RCKUT075, RCKUT077 AND RCKRP078.                            *        
      *                                                                *        
      ******************************************************************        
                                                                                
       01  RC067-DATE-RECORD.                                                   
           05  RC067-DATE-START.                                                
               10  RC067-DATE-STA-MM     PIC  X(02).                            
               10  FILLER                PIC  X(01)  VALUE '/'.                 
               10  RC067-DATE-STA-DD     PIC  X(02).                            
               10  FILLER                PIC  X(01)  VALUE '/'.                 
               10  RC067-DATE-STA-CCYY   PIC  X(04).                            
           05  FILLER                    PIC  X(01).                            
           05  RC067-DATE-END.                                                  
               10  RC067-DATE-END-MM     PIC  X(02).                            
               10  FILLER                PIC  X(01)  VALUE '/'.                 
               10  RC067-DATE-END-DD     PIC  X(02).                            
               10  FILLER                PIC  X(01)  VALUE '/'.                 
               10  RC067-DATE-END-CCYY   PIC  X(04).                            
           05  FILLER                    PIC  X(01).                            
           05  RC067-DATE-FISCAL-PERIOD  PIC  9(02).                            
           05  FILLER                    PIC  X(01).                            
           05  RC067-DATE-FISCAL-QUARTER PIC  9(01).                            
           05  FILLER                    PIC  X(01).                            
           05  RC067-DATE-SEASON         PIC  X(06).                            
           05  FILLER                    PIC  X(47).                            
