000100******************************************************************00010000
000200**                        RCRD101                               **00020000
000300**                                                              **00030000
000400**  EXTRACT FILE OF SHIPPED MERCHANDISE FROM A VENDOR.          **00040000
000430**                                                              **00043000
000440**  LENGTH:  150 BYTES                                          **00044005
000450******************************************************************00045000
000460 01  RC101-SHIPPED-MDSE-REC.                                      00046000
000480     05  RC101-DC-NBR                   PIC  9(04).               00048001
000490     05  RC101-SENT-ORD-NBR             PIC  9(10).               00049001
000491     05  RC101-KOHLS-ORD-NBR            PIC  9(08).               00049101
000492     05  RC101-ORD-LNE-NBR              PIC  9(04).               00049201
000493     05  RC101-UPC-NBR                  PIC  9(15).               00049312
000494     05  RC101-SKU-NBR                  PIC  9(08).               00049401
000495     05  RC101-DEPT-NBR                 PIC  9(04).               00049501
000496     05  RC101-SENT-SSCC-NBR            PIC  9(18).               00049606
000497     05  RC101-SSCC-EXISTS-CDE          PIC  X(01).               00049703
000498         88  RC101-SSCC-NOT-EXISTS           VALUE 'N'.           00049803
000499         88  RC101-SSCC-EXISTS-SAME-PO       VALUE 'Y'.           00049904
000500         88  RC101-SSCC-EXISTS-DIFF-PO       VALUE 'D'.           00050004
000501     05  RC101-SHIP-QTY                 PIC  9(05).               00050104
000502     05  RC101-DC-ABBR                  PIC  X(02).               00050207
000503     05  RC101-MDSE-SOURCE              PIC  X(03).               00050309
000504     05  RC101-DELIVERY-SCAC            PIC  X(04).               00050410
000505     05  RC101-FILE-SOURCE              PIC  X(05).               00050510
000506         88  RC101-FILE-SOURCE-SEPHORA       VALUE 'SPHRA'.       00050610
000507         88  RC101-FILE-SOURCE-SKU-SORT      VALUE 'SKSRT'.       00050710
000508     05  RC101-FILE-NAME.                                         00050811
000509         10  RC101-FILE-NAME-YEAR       PIC  9(04).               00050911
000510         10  RC101-FILE-NAME-MONTH      PIC  9(02).               00051011
000520         10  RC101-FILE-NAME-DAY        PIC  9(02).               00052011
000530         10  RC101-FILE-NAME-HOUR       PIC  9(02).               00053011
000540         10  RC101-FILE-NAME-MINUTE     PIC  9(02).               00054011
000550         10  RC101-FILE-NAME-SECOND     PIC  9(02).               00055011
000551         10  RC101-FILE-NAME-SEQ-NBR    PIC  9(06).               00055111
000560     05  FILLER                         PIC  X(39).               00056012
