000100******************************************************************02/19/98
000200*    COPY MEMBER:  RCRD035                       LRECL = 250     *        
000300*                                                                *        
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR THE EXTRACT OF     *        
000500*    RECEIVING INFORMATION TO BE USED TO PRODUCE A VARITY OF     *        
000600*    REPORTS.                                                    *        
000900*                                                                *        
000910*    THE EXTRACT IS BASED UPON THE ARRIVAL DATE OF THE RECEIVER  *        
000911*                                                                *        
001000******************************************************************        
001100 01  RC035-RCVR-EXTRACT-RECORD.                                     1-250 
001110     05  RC035-OPER-UNT-ID          PIC  S9(4) COMP.                1-2   
001120     05  RC035-FCLTY-ID             PIC  S9(4) COMP.                3-4   
001200     05  RC035-ORD-NBR              PIC  S9(9) COMP.                5-8   
001400     05  RC035-REC-SEQ-NBR          PIC  S9(9) COMP.                9-12  
001500     05  RC035-STATUS-CDE           PIC   X(02).                   13-14  
001600     05  RC035-DEPT-NBR             PIC   X(03).                   15-17  
001601     05  RC035-DMM-NMBR             PIC   X(02).                   18-19  
001602     05  RC035-DMM-NAME             PIC   X(32).                   20-51  
001603     05  RC035-BYR-NMBR             PIC   X(03).                   52-54  
001604     05  RC035-BYR-NAME             PIC   X(32).                   55-86  
001605     05  RC035-PO-TYP-CDE           PIC   X(02).                   87-88  
001606     05  RC035-ENT-ID               PIC   S9(09) COMP.             89-92  
001607     05  RC035-VEND-DESC            PIC   X(30).                   93-122 
001608     05  RC035-ARRIVE-DTE           PIC   X(10).                  123-132 
001609     05  RC035-ARRIVE-PERIOD-NBR    PIC   X(02).                  133-134 
001610     05  RC035-ARRIVE-PERIOD-WEEK   PIC   X(02).                  135-136 
001611     05  RC035-ARRIVE-FISCAL-WEEK   PIC   X(02).                  137-138 
001612     05  RC035-ARRIVE-QTR-NBR       PIC   X(02).                  139-140 
001613     05  RC035-VRFYD-DTE            PIC   X(10).                  141-150 
001614     05  RC035-VRFYD-PERIOD-NBR     PIC   X(02).                  151-152 
001615     05  RC035-VRFYD-PERIOD-WEEK    PIC   X(02).                  153-154 
001616     05  RC035-VRFYD-QTR-NBR        PIC   X(02).                  155-156 
001617     05  RC035-VRFYD-FISCAL-WEEK    PIC   X(02).                  157-158 
001618     05  RC035-VRFYD-USR-ID         PIC   X(08).                  159-166 
001619     05  RC035-CURR-OPER-UNT-ID     PIC  S9(4) COMP.              167-168 
001620     05  RC035-CURR-FCLTY-ID        PIC  S9(4) COMP.              169-170 
001621     05  RC035-EXPTED-ITM-QTY       PIC  S9(9) COMP.              171-174 
001622     05  RC035-VERIFY-ITM-QTY       PIC  S9(9) COMP.              175-178 
001623     05  RC035-EXPTED-CTN-CNT       PIC  S9(9) COMP.              179-182 
001630     05  RC035-ACTL-CTN-CNT         PIC  S9(9) COMP.              183-186 
004200     05  FILLER                     PIC   X(64)     VALUE SPACES. 187-250 
