      ******************************************************************        
      *    COPY MEMBER:  RCRD065                       LRECL = 400     *        
      *                                                                *        
      *    THIS MEMBER IS USED AS A FILE LAYOUT FOR THE EXTRACT OF     *        
      *    RECEIVING INFORMATION TO BE USED TO PRODUCE A VARITY OF     *        
      *    REPORTS.                                                    *        
      *                                                                *        
      *    THE EXTRACT IS BASED UPON THE ARRIVAL DATE OF THE RECEIVER  *        
      ******************************************************************        
       01  RC065-RCVR-EXTRACT-RECORD.                                           
           05  RC065-KEY.                                                       
               10  RC065-ORD-NBR          PIC S9(09)  COMP.                     
               10  RC065-OPER-UNT-ID      PIC S9(04)  COMP.                     
               10  RC065-ORD-LNE-NBR      PIC S9(09)  COMP.                     
           05  RC065-ITM-NBR              PIC S9(15)  COMP-3.                   
           05  RC065-FCLTY-ID             PIC S9(04)  COMP.                     
           05  RC065-REC-SEQ-NBR          PIC S9(09)  COMP.                     
           05  RC065-STATUS-CDE           PIC  X(02).                           
           05  RC065-DEPT-NBR             PIC  X(03).                           
           05  RC065-DEPT-DESC            PIC  X(25).                           
           05  RC065-GMM-NMBR             PIC  X(02).                           
           05  RC065-GMM-NAME             PIC  X(32).                           
           05  RC065-DMM-NMBR             PIC  X(02).                           
           05  RC065-DMM-NAME             PIC  X(32).                           
           05  RC065-BYR-NMBR             PIC  X(03).                           
           05  RC065-BYR-NAME             PIC  X(32).                           
           05  RC065-PO-TYP-CDE           PIC  X(02).                           
           05  RC065-CFY-SLSRNK-NBR       PIC S9(09) COMP.                      
           05  RC065-ENT-ID               PIC S9(09) COMP.                      
           05  RC065-VEND-DESC            PIC  X(30).                           
           05  RC065-IMPRT-VEND-NAME      PIC  X(35).                           
           05  RC065-IMPRT-FCTRY-NAME     PIC  X(35).                           
           05  RC065-ARRIVE-DTE           PIC  X(10).                           
           05  RC065-ARRIVE-PERIOD-NBR    PIC  X(02).                           
           05  RC065-ARRIVE-PERIOD-WEEK   PIC  X(02).                           
           05  RC065-ARRIVE-FISCAL-WEEK   PIC  X(02).                           
           05  RC065-ARRIVE-QTR-NBR       PIC  X(02).                           
           05  RC065-VRFYD-DTE            PIC  X(10).                           
           05  RC065-VRFYD-PERIOD-NBR     PIC  X(02).                           
           05  RC065-VRFYD-PERIOD-WEEK    PIC  X(02).                           
           05  RC065-VRFYD-QTR-NBR        PIC  X(02).                           
           05  RC065-VRFYD-FISCAL-WEEK    PIC  X(02).                           
           05  RC065-VRFYD-USR-ID         PIC  X(08).                           
           05  RC065-CURR-OPER-UNT-ID     PIC S9(04) COMP.                      
           05  RC065-CURR-FCLTY-ID        PIC S9(04) COMP.                      
           05  RC065-EXPTED-ITM-QTY       PIC S9(09) COMP.                      
           05  RC065-VERIFY-ITM-QTY       PIC S9(09) COMP.                      
           05  RC065-CURR-SPLIT-QTY       PIC S9(09) COMP.                      
      *                                                                         
      *        OVERAGE AMOUNTS                                                  
      *                                                                         
           05  RC065-OVERAGE-QTY          PIC S9(09) COMP.                      
           05  RC065-TOT-UNITS-ORD-OVER   PIC S9(09) COMP.                      
           05  RC065-OVERAGE-RETAIL-AMT   PIC S9(09) COMP.                      
      *                                                                         
      *        SHORTAGE AMOUNTS                                                 
      *                                                                         
           05  RC065-SHORTAGE-QTY         PIC S9(09) COMP.                      
           05  RC065-TOT-UNITS-ORD-SHORT  PIC S9(09) COMP.                      
           05  RC065-SHORTAGE-RETAIL-AMT  PIC S9(09) COMP.                      
                                                                                
           05  RC065-MONTH-END-DATE       PIC  X(10).                           
           05  RC065-PO-COUNT             PIC S9(09) COMP.                      
           05  RC065-FILLER               PIC  X(35).                           
