000100******************************************************************00010000
000200**                        RCRD118                               **00020000
000300**                                                              **00030000
000400**  PARSED DATA FILE FROM THE THIRD PARTY OUTBOUND SHIPPING     **00040000
000401**  INFORMATION FOR A TRAILER OF PROCESSED CARTONS TO BE SENT   **00040100
000402**  TO THE STORES.                                              **00040200
000410**                                                              **00041000
000420**  LENGTH:  330 BYTES                                          **00042000
000430******************************************************************00043000
000440 01  RC118-PARSED-SHIPMENT-REC.                                   00044000
000449     05  RC118-3RD-PRTY-DC-NBR          PIC  X(06).               00044902
000450     05  RC118-KOHLS-SHIP-TO-DC-NBR     PIC  X(06).               00045000
000451     05  RC118-SHIP-SCAC                PIC  X(06).               00045100
000452     05  RC118-SHIP-TRAILER-NBR         PIC  X(30).               00045200
000453     05  RC118-SHIP-BOL                 PIC  X(30).               00045300
000454     05  RC118-SHIP-PRO                 PIC  X(30).               00045400
000455     05  RC118-SHIP-DATE                PIC  X(08).               00045500
000456     05  RC118-CUST-ORDER-NBR           PIC  X(20).               00045600
000457     05  RC118-KOHLS-PO-NBR             PIC  X(10).               00045700
000458     05  RC118-3RD-PRTY-ORDER-NBR       PIC  X(15).               00045803
000459     05  RC118-DEST-STORE-NBR           PIC  X(06).               00045906
000460     05  RC118-SML-NBR                  PIC  X(30).               00046000
000461     05  RC118-3RD-PRTY-CARTON-ID       PIC  X(30).               00046102
000462     05  RC118-CUST-ORDER-LINE-NBR      PIC  X(08).               00046200
000463     05  RC118-SKU-NBR                  PIC  X(10).               00046300
000464     05  RC118-SHIP-QTY                 PIC  X(10).               00046400
000465     05  RC118-ORDER-QTY                PIC  X(10).               00046500
000470     05  FILLER                         PIC  X(65).               00047006
