000100******************************************************************00010000
000200**                        RCRD099                               **00020000
000300**                                                              **00030000
000400**  OUTPUT FILE CREATED BY RCKUP067 - EFC FA RECEIVERS IN IP    **00040000
000410**  STATUS ATTACHED TO ENDED TRIPS.  RECEIVERS VERIFIED BY      **00041000
000420**  RCKUP067.  FILE USED BY RCKRP___ TO CREATE REPORT.          **00042000
000430**                                                              **00043000
000440**  LENGTH:  200 BYTES                                          **00044000
000450******************************************************************00045000
000460 01  RC099-EFC-RCVR-REC.                                          00046001
000470     05  RC099-CURR-OPER-UNIT           PIC  9(04).               00047000
000480     05  RC099-ORD-NBR                  PIC  9(09).               00048000
000490     05  RC099-REC-SEQ-NBR              PIC  9(04).               00049000
000491     05  RC099-ORD-LNE-NBR              PIC  9(04).               00049100
000500     05  RC099-RCVR-STATUS              PIC  9(04).               00050000
000510     05  RC099-CREATE-USERID            PIC  X(08).               00051000
000520     05  RC099-UPDATE-USERID            PIC  X(08).               00052000
000530     05  RC099-UPDATE-PROGRAM           PIC  X(08).               00053000
000540     05  RC099-CREATE-TMST              PIC  X(26).               00054000
000550     05  RC099-SCAC                     PIC  X(04).               00055000
000551     05  RC099-VEHICL                   PIC  X(10).               00055100
000552     05  RC099-TRIP                     PIC  9(09).               00055200
000553     05  RC099-EFC-SHIPMT-NBR           PIC  X(20).               00055300
000554     05  RC099-TRIP-STATUS              PIC  X(02).               00055400
000555     05  RC099-TRIP-STATUS-DATE         PIC  X(10).               00055500
000556     05  RC099-TRIP-STATUS-TIME         PIC  X(08).               00055600
000557     05  RC099-TRIP-STATUS-UID          PIC  X(08).               00055700
000559     05  RC099-TRIP-STATUS-DESC         PIC  X(30).               00055900
001150     05  FILLER                         PIC  X(24).               00115000
