000010******************************************************************00001002
000020*    COPY MEMBER:  RCRD050                       LRECL = 80      *00002002
000040******************************************************************00004002
000050*                                                                 00005002
000100 01  RC050-RECORD.                                                00010002
000200     10 RC050-OPER-ID         PIC  S9(09)       COMP.             00020002
000300     10 RC050-PO-NBR          PIC  S9(09)       COMP.             00030002
000400     10 RC050-REC-SEQ-NBR     PIC  S9(09)       COMP.             00040002
000500     10 RC050-TRECDIS-QTY     PIC  S9(09)       COMP-3.           00050002
000600     10 RC050-TRECDIS-AMT     PIC  S9(08)V9(02) COMP-3.           00060002
000700     10 FILLER                PIC   X(57).                        00070002
