000100******************************************************************00010000
000200**                        RCRD108                               **00020000
000300**                                                              **00030000
000400**  EXTRACT FILE OF PO CARTON DETAILS FROM SKU SORT PROCESSING  **00040000
000410**                                                              **00041000
000420**  LENGTH:  100 BYTES                                          **00042000
000430******************************************************************00043000
000440 01  RC108-SKU-SRT-CARTON-REC.                                    00044000
000441     05  RC108-FILE-NAME.                                         00044102
000442         10  RC108-FILE-NAME-YEAR       PIC  9(04).               00044202
000443         10  RC108-FILE-NAME-MONTH      PIC  9(02).               00044302
000444         10  RC108-FILE-NAME-DAY        PIC  9(02).               00044402
000445         10  RC108-FILE-NAME-HOUR       PIC  9(02).               00044502
000446         10  RC108-FILE-NAME-MINUTE     PIC  9(02).               00044602
000447         10  RC108-FILE-NAME-SECOND     PIC  9(02).               00044702
000448         10  RC108-FILE-NAME-SEQ-NBR    PIC  9(06).               00044802
000450     05  RC108-KOHLS-ORD-NBR            PIC  9(08).               00045000
000451     05  RC108-VENDR-ORD-NBR            PIC  9(08).               00045100
000452     05  RC108-DC-NBR                   PIC  9(04).               00045200
000453     05  RC108-SEQ-NBR                  PIC  9(04).               00045300
000454     05  RC108-CARTON-ID                PIC  X(20).               00045400
000455     05  RC108-SKU-NBR                  PIC  9(08).               00045500
000457     05  RC108-SHIP-QTY                 PIC  9(05).               00045700
000458     05  FILLER                         PIC  X(23).               00045802
