000010******************************************************************        
000020*  RCWS041                                                       *        
000040*      THIS COPYBOOK IS USED FOR THE AUTO CONFIRMATION MODULE.   *        
000060*                                             LENGTH=400         *        
000080******************************************************************        
000100*                                                                         
000200 01  RC041-FIELDS.                                                        
000400     05  RC041-PO-NBR                    PIC S9(9) COMP.                  
000410     05  RC041-REC-SEQ-NBR               PIC S9(4) COMP.                  
000500     05  RC041-PO-LNE-NBR                PIC S9(4) COMP.                  
000600     05  RC041-PREPACK-ID                PIC S9(4) COMP.                  
000910     05  RC041-OPER-UNT-ID               PIC S9(4) COMP                   
000911                                                   VALUE ZERO.            
000920     05  RC041-FCLTY-ID                  PIC S9(4) COMP                   
000930                                                   VALUE ZERO.            
000940     05  RC041-PKGNG-CDE                 PIC X(01).                       
001100         88  RC041-BULK-CASE                       VALUE 'B', 'C'.        
001400         88  RC041-PREPACK                         VALUE 'M', 'I'.        
001401     05  RC041-PBS-IND                   PIC X(01).                       
001402         88  RC041-PBS                             VALUE 'Y'.             
001403     05  RC041-USER-ID                   PIC  X(08).                      
001404     05  RC041-PROGRAM-NAME              PIC X(08).                       
001405     05  RC041-SUCCESS-IND               PIC X(01).                       
001406         88  RC041-SUCCESSFUL          VALUES                             
001407                                      ZERO, SPACES, LOW-VALUES.           
001408         88  RC041-NOT-SUCCESSFUL                  VALUE '1'.             
001409         88  RC041-INVALID-SQL                     VALUE '2'.             
001410         88  RC041-DATABASE-BUSY                   VALUE '3'.             
001411     05  RC041-CRA-RET-MSG               PIC X(133) VALUE SPACES.         
001412     05  RC041-SQLCA                     PIC X(136).                      
001413     05  RC041-VERIFY-SW                 PIC X(01) VALUE 'N'.             
001420         88  RC041-VERIFY-YES                      VALUE 'Y'.             
001430         88  RC041-VERIFY-NO                       VALUE 'N'.             
001500     05  RC041-NO-VERIFY-REASON          PIC X(01) VALUE SPACE.           
001510         88  RC041-OPEN-SYSTEM-AUDIT               VALUE 'A'.             
001520         88  RC041-DISTRO-NO-MATCH                 VALUE 'B'.             
001521         88  RC041-ERROR                           VALUE 'C'.             
001530         88  RC041-NO-PRO                          VALUE 'D'.             
001600         88  RC041-STORE-INVENTORY                 VALUE 'E'.             
001900         88  RC041-RCVR-NOT-ACTIVE                 VALUE 'F'.             
002000         88  RC041-RCVR-NOT-FOUND                  VALUE 'G'.             
002001         88  RC041-LINE-NOT-FOUND                  VALUE 'H'.             
002010         88  RC041-NOT-ARRIVED                     VALUE 'I'.             
002011         88  RC041-RECEIVER-ALREADY-VE             VALUE 'J'.             
002012         88  RC041-LINE-ALREADY-VE                 VALUE 'K'.             
002013         88  RC041-RECV-TROUBLE                    VALUE 'L'.             
002014         88  RC041-LINE-TROUBLE                    VALUE 'M'.             
002020     05  RC041-RCVR-OPER-UNT-ID          PIC S9(4) COMP                   
002030                                                   VALUE ZERO.            
002040     05  RC041-CURR-OPER-UNT-ID          PIC S9(4) COMP                   
002050                                                   VALUE ZERO.            
002060     05  RC041-PROCESS-LEVEL-SW          PIC X(01).                       
002070         88  RC041-PROCESS-BY-RCVR                 VALUE 'R'.             
002080         88  RC041-PROCESS-BY-LINE                 VALUE 'L'.             
002090     05  RC041-TRIP-ID                   PIC S9(9) COMP.                  
003000     05  FILLER                          PIC X(86) VALUE SPACES.          
