000010******************************************************************        
000020*  RCWS033                                                       *        
000031*                                                                *        
000040*      THIS COPYBOOK IS USED FOR THE PROCESS AREA CALLED MODULE. *        
000050*  THIS MODULE WILL BE ABLE TO DETERMINE THE LAST AND THE SECOND *        
000060*  TO LAST PROCESS AREA THAT WORKED MERCHANDISE FOR A GIVEN      *        
000070*  PO/RCVR.                                                      *        
000080******************************************************************        
000100*                                                                         
000200 01  RC033-FIELDS.                                                        
000300     05  RC033-KEY-FIELDS.                                                
000400         10  RC033-PO-NBR                PIC S9(9) COMP.                  
000500         10  RC033-PO-LNE-NBR            PIC S9(9) COMP.                  
000600         10  RC033-REC-SEQ-NBR           PIC S9(9) COMP.                  
000900         10  RC033-PRC-AREA-TO-CHECK     PIC X(06) VALUE SPACES.          
000910         10  RC033-OPER-UNT-ID           PIC S9(4) COMP                   
000911                                                   VALUE ZERO.            
000920         10  RC033-FCLTY-ID              PIC S9(4) COMP                   
000930                                                   VALUE ZERO.            
000940     05  RC033-ACTION-CODES.                                              
001000         10  RC033-WO-EXIST-CDE          PIC X(01) VALUE SPACES.          
001100             88  RC033-CHECK-EXIST           VALUE 'Y'.                   
001400             88  RC033-BYPASS-CHECK-EXIST    VALUE 'N'.                   
001410         10  RC033-FUNCTION-CDE          PIC X(01) VALUE SPACES.          
001420             88  RC033-GET-WO-INST           VALUE 'I'.                   
001430             88  RC033-VALIDATE-PRC-AREA     VALUE 'V'.                   
001500         10  RC033-USE-WO-INST-LVL       PIC X(01) VALUE SPACE.           
001600             88  RC033-USE-ZERO-LVL          VALUE 'Z'.                   
001700             88  RC033-USE-LINE-LVL          VALUE 'L'.                   
001800         10  RC033-PROCESS-CDE           PIC X(01) VALUE SPACE.           
001900             88  RC033-VERIFICATION          VALUE 'V'.                   
002000         10  FILLER                      PIC X(30) VALUE SPACE.           
002506     05  RC033-RETURN-DATA.                                               
002507         10  RC033-RETURN-CODE       PIC X(02).                           
002510             88  RC033-CALL-SUCCESSFUL         VALUE '00'.                
002600             88  RC033-FUNC-CODE-INVALID       VALUE '01'.                
002700             88  RC033-WO-INST-LVL-INVALID     VALUE '02'.                
002710             88  RC033-PRC-AREA-INVALID        VALUE '03'.                
002800             88  RC033-DB2-ERROR               VALUE '04'.                
002900         10  RC033-RETURN-P2L-AREA   PIC X(06).                           
002901         10  RC033-RETURN-FCSE-AREA  PIC X(06).                           
002902         10  RC033-RETURN-LAST-AREA  PIC X(06).                           
002903         10  RC033-RETURN-GP-CDE     PIC X(02).                           
002904             88  RC033-GP-FULLCASE             VALUE 'FC'.                
002905             88  RC033-GP-P2L                  VALUE 'PL'.                
002906             88  RC033-GP-NONE                 VALUE '  '.                
002907             88  RC033-GP-UNKNOWN              VALUE '??'.                
002908         10  RC033-RETURN-WO-EXIST-CDE   PIC X(01).                       
002909                 88  RC033-WO-EXISTS               VALUE 'Y'.             
002910                 88  RC033-WO-NOT-EXISTS           VALUE 'N'.             
002913         10  RC033-SQLCODE               PIC ZZZZZZZZ9-.                  
002914         10  RC033-SQLCA                 PIC X(150).                      
002920         10  RC033-PARA                  PIC X(10).                       
003000         10  FILLER                      PIC X(53) VALUE SPACES.          
