000100******************************************************************07/11/95
000200**                        RCWS012                               **RCWS012 
000300**                                                              **   LV001
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **RCWS012 
000500**  PACK SLIP SYSTEM AND RECEIVER SYSTEM                        **RCWS012 
000600**  LENGTH:  200 BYTES                                          **RCWS012 
000700******************************************************************RCWS012 
000800         10  RC012-INTER-APPL-COMMAREA  REDEFINES                 RCWS012 
000900             INTER-APPL-COMM-AREA.                                RCWS012 
001000             15  FILLER                         PIC X(01).        RCWS012 
001100             15  RC012-PO-NBR                   PIC S9(09) COMP.  RCWS012 
001200             15  RC012-REC-SEQ-NBR              PIC S9(09) COMP.  RCWS012 
001300             15  RC012-OPER-UNT-ID              PIC S9(04) COMP.  RCWS012 
001400             15  RC012-FCLTY-ID                 PIC S9(04) COMP.  RCWS012 
001500             15  RC012-PKSL-NBR                 PIC X(10).        RCWS012 
001600             15  RC012-BOL-NBR                  PIC X(30).        RCWS012 
001700             15  RC012-PRO-NBR                  PIC X(22).        RCWS012 
001800             15  RC012-OWNER-SCAC-ID            PIC X(04).        RCWS012 
001900             15  RC012-VEH-NBR                  PIC X(10).        RCWS012 
002000             15  RC012-ARRIVAL-DTE              PIC X(10).        RCWS012 
002100             15  RC012-PRE-TKT-IND              PIC X(01).        RCWS012 
002200             15  RC012-TKT-TYP-DESC             PIC X(06).        RCWS012 
002300             15  RC012-AD-INFO-DESC             PIC X(04).        RCWS012 
002400             15  RC012-EXPTED-CART-CNT          PIC S9(09) COMP.  RCWS012 
002500             15  RC012-PKSL-STAT-CDES.                            RCWS012 
002600                 20  RC012-AC-STAT              PIC X(02).        RCWS012 
002700                 20  RC012-IN-STAT              PIC X(02).        RCWS012 
002800                 20  RC012-IP-STAT              PIC X(02).        RCWS012 
002900                 20  RC012-CM-STAT              PIC X(02).        RCWS012 
003000                 20  RC012-VE-STAT              PIC X(02).        RCWS012 
003100             15  RC012-STR-NBR                  PIC S9(04) COMP.  RCWS012 
003200             15  RC012-SEQ-NBR                  PIC S9(04) COMP.  RCWS012 
003300             15  RC012-PO-LNE-NBR               PIC S9(04) COMP.  RCWS012 
003400             15  RC012-NUMBER-OF-SELECTED-ITEMS PIC S9(09) COMP-3.RCWS012 
003500             15  RC012-NUMBER-OF-TS-ITEMS       PIC S9(05) COMP-3.RCWS012 
003600             15  RC012-SEL-QUEUE-NAME           PIC X(08).        RCWS012 
003700             15  RC012-FCLTY-NME                PIC X(25).        RCWS012 
003800             15  RC012-ORIGIN-SCAC-ID           PIC X(04).        RCWS012 
003900             15  RC012-STATUS                   PIC X(02).        RCWS012 
004000             15  RC012-MANIFEST                 PIC X(10).        RCWS012 
004100             15  RC012-TRIP-ID                  PIC S9(09) COMP.  RCWS012 
004101             15  RC012-PACK-BY-ST-SW            PIC X(01).              6 
004102                 88  RC012-PACK-BY-STORE        VALUE 'Y'.                
004110                 88  RC012-NOT-PACK-BY-STORE    VALUE 'N'.                
004200             15  FILLER                         PIC X(08).        RCWS012 
