000010******************************************************************        
000020*  RCWS038                                                       *        
000040*      THIS COPYBOOK IS USED FOR THE VERIFICATION ELIGIBILITY    *        
000050*  MODULE.  THIS MODULE WILL BE USED TO DETERMINE IF AN ORDER    *        
000060*  CAN BE VERIFIED.                           LENGTH=400         *        
000080******************************************************************        
000100*                                                                         
000200 01  RC038-FIELDS.                                                        
000400     05  RC038-PO-NBR                    PIC S9(9) COMP.                  
000410     05  RC038-REC-SEQ-NBR               PIC S9(4) COMP.                  
000500     05  RC038-PO-LNE-NBR                PIC S9(4) COMP.                  
000600     05  RC038-PREPACK-ID                PIC S9(4) COMP.                  
000910     05  RC038-OPER-UNT-ID               PIC S9(4) COMP                   
000911                                                   VALUE ZERO.            
000920     05  RC038-FCLTY-ID                  PIC S9(4) COMP                   
000930                                                   VALUE ZERO.            
000940     05  RC038-PKGNG-CDE                 PIC X(01).                       
001100         88  RC038-BULK-CASE                       VALUE 'B', 'C'.        
001400         88  RC038-PREPACK                         VALUE 'M', 'I'.        
001401     05  RC038-PBS-IND                   PIC X(01).                       
001402         88  RC038-PBS                             VALUE 'Y'.             
001403     05  RC038-USER-ID                   PIC  X(08).                      
001404     05  RC038-PROGRAM-NAME              PIC X(08).                       
001405     05  RC038-SUCCESS-IND               PIC X(01).                       
001406         88  RC038-SUCCESSFUL          VALUES                             
001407                                      ZERO, SPACES, LOW-VALUES.           
001408         88  RC038-NOT-SUCCESSFUL                  VALUE '1'.             
001409         88  RC038-INVALID-SQL                     VALUE '2'.             
001410         88  RC038-DATABASE-BUSY                   VALUE '3'.             
001411     05  RC038-CRA-RET-MSG               PIC X(133) VALUE SPACES.         
001412     05  RC038-SQLCA                     PIC X(136).                      
001413     05  RC038-VERIFY-SW                 PIC X(01) VALUE 'N'.             
001420         88  RC038-VERIFY-YES                      VALUE 'Y'.             
001430         88  RC038-VERIFY-NO                       VALUE 'N'.             
001500     05  RC038-NO-VERIFY-REASON          PIC X(01) VALUE SPACE.           
001510         88  RC038-OPEN-SYSTEM-AUDIT               VALUE 'A'.             
001520         88  RC038-DISTRO-NO-MATCH                 VALUE 'B'.             
001521         88  RC038-ERROR                           VALUE 'C'.             
001530         88  RC038-NO-PRO                          VALUE 'D'.             
001600         88  RC038-STORE-INVENTORY                 VALUE 'E'.             
001900         88  RC038-RCVR-NOT-ACTIVE                 VALUE 'F'.             
002000         88  RC038-RCVR-NOT-FOUND                  VALUE 'G'.             
002001         88  RC038-LINE-NOT-FOUND                  VALUE 'H'.             
002010         88  RC038-NOT-ARRIVED                     VALUE 'I'.             
002011         88  RC038-RECEIVER-ALREADY-VE             VALUE 'J'.             
002012         88  RC038-LINE-ALREADY-VE                 VALUE 'K'.             
002013         88  RC038-RECV-TROUBLE                    VALUE 'L'.             
002014         88  RC038-LINE-TROUBLE                    VALUE 'M'.             
002015         88  RC038-LINE-NOT-VE                     VALUE 'N'.             
002016         88  RC038-CASEPACK-NOT-PERFORMED          VALUE 'O'.             
002017         88  RC038-NOT-MANIFESTD                   VALUE 'P'.             
002020     05  RC038-RCVR-OPER-UNT-ID          PIC S9(4) COMP                   
002030                                                   VALUE ZERO.            
002040     05  RC038-CURR-OPER-UNT-ID          PIC S9(4) COMP                   
002050                                                   VALUE ZERO.            
002060     05  RC038-VERIFY-UNVERIFY-SW        PIC X(01).                       
002070         88  RC038-VERIFY                          VALUE ' ', 'Y'.        
002080         88  RC038-UNVERIFY                        VALUE 'N'.             
002090     05  RC038-PROCESS-LEVEL-SW          PIC X(01).                       
002100         88  RC038-PROCESS-BY-RCVR                 VALUE 'R'.             
002200         88  RC038-PROCESS-BY-LINE                 VALUE 'L'.             
002300     05  RC038-PROCESS-NO-UPDATE-SW      PIC X(01).                       
002400         88  RC038-PROCESS-UPDATE                  VALUE 'Y'.             
002500         88  RC038-PROCESS-NO-UPDATE               VALUE 'N'.             
002600     05  RC038-AUTOVE-PO-SW              PIC X(01).                       
002700         88  RC038-AUTOVE-PO-YES                   VALUE 'Y' ' '.         
002800         88  RC038-AUTOVE-PO-NO                    VALUE 'N'.             
002900     05  RC038-DIRECT-STR-SW             PIC X(01).                       
002910         88  RC038-NOT-DIRECT-STR                  VALUE ' '.             
002920         88  RC038-DIRECT-STR                      VALUE 'Y'.             
003000     05  FILLER                          PIC X(87) VALUE SPACES.          
