000410******************************************************************00041000
000420**                        RCWS836                               **00042000
000430**                                                              **00043000
000440**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00044000
000450**  RECEIVING TRACKING AUDIT CRIT SPEC                          **00045000
000460**  LENGTH:  200 BYTES                                          **00046000
000470******************************************************************00047000
000480         10  RC836-INTER-APPL-COMMAREA  REDEFINES                 00048000
000490             INTER-APPL-COMM-AREA.                                00049000
000491             15  FILLER                         PIC  X(01).       00049100
000492             15  RC836-OPER-UNIT-ID.                              00049200
000493                 20  RC836-OPER-UNIT-ID-N       PIC  9(04).       00049300
000505             15  RC836-PO                       PIC  9(09).       00050500
000506             15  RC836-RECEIVER-SEQ             PIC  9(03).       00050600
000509             15  RC836-LINE.                                      00050900
000510                 20  RC836-LINE-NBR             PIC  9(04).       00051000
000511             15  RC836-PACK.                                      00051100
000512                 20  RC836-PACK-NBR             PIC  9(04).       00051200
000513             15  RC836-USER-ID                  PIC  X(08).       00051300
000515             15  RC836-FROM-DATE-MM             PIC  9(02).       00051500
000516             15  RC836-FROM-DATE-DD             PIC  9(02).       00051600
000517             15  RC836-FROM-DATE-YY             PIC  9(04).       00051700
000518             15  RC836-TO-DATE-MM               PIC  9(02).       00051800
000519             15  RC836-TO-DATE-DD               PIC  9(02).       00051900
000520             15  RC836-TO-DATE-YY               PIC  9(04).       00052000
000524             15  FILLER                         PIC  X(151).      00052400
