000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE PACK LEVEL      00020000
000300*    VERIFICATION PROGRAMS                                        00030000
000400*    LENGTH = 200 BYTES                                           00040000
000500******************************************************************00050000
000600         10  RC036-INTER-APPL-COMMAREA  REDEFINES                 00060000
000700                                        INTER-APPL-COMM-AREA.     00070000
000800             15  FILLER                     PIC X.                00080000
000900             15  RC036-NUMBER-OF-SELECTED-ITEMS                   00090000
001000                                            PIC S9(09) COMP-3.    00100000
001100             15  RC036-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00110000
001200             15  RC036-SEL-QUEUE-NAME       PIC X(08).            00120000
001300             15  RC036-OPER-UNT-ID          PIC S9(04) COMP.      00130000
001400             15  RC036-FCLTY-ID             PIC S9(04) COMP.      00140000
001410             15  RC036-FCLTY-NME            PIC  X(25).           00141008
001500             15  RC036-PO-NBR               PIC S9(09) COMP.      00150000
001600             15  RC036-REC-SEQ-NBR          PIC S9(09) COMP.      00160000
001700             15  RC036-PO-PACK-ID           PIC S9(04) COMP.      00170005
001800             15  RC036-TRB-QUEUE-NAME       PIC X(08).            00180009
003120             15  FILLER                     PIC X(136).           00312009
