000100*                                                                         
000200 01  RC031-FIELDS.                                                        
000300     05  RC031-KEY-FIELDS.                                                
000400         10  RC031-PO-NBR                PIC S9(9) COMP.                  
000500         10  RC031-PO-LNE-NBR            PIC S9(9) COMP.                  
000600         10  RC031-REC-SEQ-NBR           PIC S9(9) COMP.                  
000700         10  RC031-OPER-UNT-ID           PIC S9(4) COMP.                  
000800         10  RC031-FCLTY-ID              PIC S9(4) COMP.                  
000900         10  RC031-STR-NBR               PIC S9(4) COMP.                  
001000         10  RC031-TABLE-TO-AUDIT        PIC X(01) VALUE SPACES.          
001100             88  RC031-AUDIT-TRECEIV         VALUE 'V'.                   
001200             88  RC031-AUDIT-TRECITM         VALUE 'I'.                   
001300             88  RC031-AUDIT-TRECDIS         VALUE 'D'.                   
001400             88  RC031-VALID-TABLES          VALUES 'D', 'I', 'V'.        
001500         10  RC031-AUD-TYP-CDE           PIC X(01) VALUE SPACE.           
001600             88  RC031-BEFORE                VALUE 'B'.                   
001700             88  RC031-AFTER                 VALUE 'A'.                   
001800             88  RC031-VALID-BEF-AFT         VALUES 'A', 'B'.             
001900         10  RC031-AUD-FUNC-CDE          PIC X(01) VALUE SPACE.           
002000             88  RC031-UPDATE                VALUE 'U'.                   
002100             88  RC031-DELETE                VALUE 'D'.                   
002200             88  RC031-ADD                   VALUE 'A'.                   
002300             88  RC031-TRIGGER               VALUE 'T'.                   
002400             88  RC031-VALID-AUD-FUNC        VALUES 'U', 'D',             
002500                                                    'A', 'T'.             
002600         10  RC031-UPD-PGM-ID            PIC X(08) VALUE SPACES.          
002700         10  RC031-UPD-UID               PIC X(08) VALUE SPACES.          
002800         10  RC031-UPD-TMST              PIC X(26) VALUE SPACES.          
002900         10  RC031-STATUS-CDE            PIC X(02) VALUE SPACES.          
003000         10  RC031-NOTIF-NBR             PIC S9(09) COMP                  
003100                                                   VALUE ZERO.            
003200         10  RC031-ADJ-CYC-NBR           PIC S9(09) COMP                  
003300                                                   VALUE ZERO.            
003400         10  RC031-RETURN-DATA.                                           
003500             15  RC031-RETURN-CODE       PIC X(02).                       
003600                 88  RC031-CALL-SUCCESSFUL         VALUE '00'.            
003700                 88  RC031-TABLE-CODE-INVALID      VALUE '01'.            
003800                 88  RC031-AUDIT-TYPE-CODE-INVALID VALUE '02'.            
003900                 88  RC031-AUDIT-FUNC-CODE-INVALID VALUE '03'.            
004000                 88  RC031-STAT-CDE-REQD-FOR-DEL   VALUE '04'.            
004100                 88  RC031-TRECEIV-REC-NOT-FOUND   VALUE '10'.            
004200                 88  RC031-TRECITM-REC-NOT-FOUND   VALUE '11'.            
004300                 88  RC031-TRECDIS-REC-NOT-FOUND   VALUE '12'.            
004400                 88  RC031-TRECEIV-SELECT-ERROR    VALUE '20'.            
004500                 88  RC031-TAURECV-INSERT-ERROR    VALUE '21'.            
004600                 88  RC031-TRECITM-SELECT-ERROR    VALUE '22'.            
004700                 88  RC031-TAURECI-INSERT-ERROR    VALUE '23'.            
004800                 88  RC031-TRECDIS-SELECT-ERROR    VALUE '24'.            
004900                 88  RC031-TAURECD-INSERT-ERROR    VALUE '25'.            
005000                 88  RC031-PGM-ID-UID-TMST-REQD    VALUE '31'.            
005100                 88  RC031-PGM-ID-UID-TMST-REQD    VALUE '32'.            
005200                 88  RC031-NOTIF-NBR-ADJ-CYC-REQD  VALUE '33'.            
005300                 88  RC031-PGM-ID-UID-TMST-REQD    VALUE '34'.            
005400             15  RC031-RETURN-DESC       PIC X(40).                       
005500         10  RC031-SQLCODE               PIC ZZZZZZZZ9-.                  
005600         10  RC031-SQLCA                 PIC X(150).                      
005700         10  FILLER                      PIC X(25) VALUE SPACES.          
005800 01  RC031-LINK-PARMS.                                                    
005900     05  RC031-COMMAREA-LENGTH        PIC S9(4) COMP VALUE 300.           
006000     05  RC031-AUDIT-PGM-NAME         PIC X(08) VALUE 'RCKCS290'.         
