000100******************************************************************        
000200*  RCWS817                                                                
000300*                                                                         
000400*  THIS IS THE SELECT QUEUE FORMAT FOR DATA PASSED FROM RCKCS299          
000500*  TO RCKCS816.                                                           
000600*                                                                         
000700******************************************************************        
000800 01  RC817-SELECT-RECORD.                                                 
000900     05  RC817-SELECTED-ITEMS         PIC S9(5) VALUE ZERO                
001000                                                COMP-3.                   
001100     05  RC817-MAX-ITEMS              PIC 99    VALUE 20.                 
001200     05  RC817-SELECTED-ITEM-ARRAY.                                       
001300         10  FILLER                   OCCURS 20 TIMES                     
001400                                      INDEXED BY RC817-IDX.               
001500             15  RC817-ITEM           PIC S9(9) COMP-3.                   
001600             15  RC817-ACTION-SW      PIC X.                              
001700                 88  RC817-INQ                  VALUE 'I'.                
001800                 88  RC817-UPD                  VALUE 'U'.                
001900                 88  RC817-DEL                  VALUE 'D'.                
002000                 88  RC817-ERR                  VALUE 'E'.                
002100                                                                          
002200             15  RC817-KEY-DATA.                                          
002300                 20  RC817-PO-NBR                 PIC S9(09) COMP.        
002400                 20  RC817-RCVR-NBR               PIC S9(09) COMP.        
002500                 20  RC817-VENDOR                 PIC  X(18).             
002600                 20  RC817-PKG-CODE               PIC  X(01).             
002700                 20  RC817-TRIP-ID                PIC S9(09) COMP.        
002800                 20  RC817-SCAC-CDE               PIC  X(04).             
002900                 20  RC817-TRLR-NBR               PIC  X(10).             
