000100 01  RC001-WORK-FIELDS.                                                   
000200     05  RC001-LOG-QUEUE              PIC X(04) VALUE 'CSSL'.             
000300     05  RC001-LOG-LINE               PIC X(80) VALUE SPACES.             
000400     05  RC001-CICS-RESPONSE          PIC S9(08) COMP VALUE ZERO.         
000500     05  RC001-SAVE-SQLCODE           PIC S9(08) COMP VALUE ZERO.         
000600 01  RC001-ERROR-MESSAGE-LINES.                                           
000700     05  RC001-LINE-00.                                                   
000800         10  FILLER                   PIC X(27) VALUE                     
000900             '**********   PREPACK ERROR '.                               
001000         10  RC001-PREPACK-PGM-NBR    PIC 9(03) VALUE ZERO.               
001100         10  FILLER                   PIC X(01) VALUE '-'.                
001200         10  RC001-PREPACK-ERROR-NBR  PIC 9(03) VALUE ZERO.               
001300         10  FILLER                   PIC X(02) VALUE SPACES.             
001310         10  FILLER                   PIC X(09)  VALUE                    
001320             ' USERID= '.                                                 
001400         10  RC001-USERID             PIC X(07) VALUE SPACES.             
001500         10  FILLER                   PIC X(02) VALUE SPACES.             
001600         10  FILLER                   PIC X(12) VALUE                     
001700             '  **********'.                                              
001800     05  RC001-LINE-01.                                                   
001900         10  RC001-DATE               PIC X(10)  VALUE SPACES.            
002000         10  FILLER                   PIC X(01)  VALUE SPACES.            
002100         10  RC001-TIME               PIC X(08)  VALUE SPACES.            
002200         10  FILLER                   PIC X(01)  VALUE SPACES.            
002300         10  RC001-PGM                PIC X(03)  VALUE SPACES.            
002400         10  FILLER                   PIC X(01)  VALUE SPACES.            
002500         10  FILLER                   PIC X(10)  VALUE                    
002600             'TM500-RC= '.                                                
002700         10  RC001-TM500-RC           PIC X(02)  VALUE SPACES.            
002800         10  FILLER                   PIC X(01)  VALUE SPACES.            
002900         10  FILLER                   PIC X(10)  VALUE                    
003000             'TRBL-RSN= '.                                                
003100         10  RC001-TRBL-RSN-CDE       PIC 9(03)  VALUE ZEROES.            
003200         10  FILLER                   PIC X(01)  VALUE SPACES.            
003300         10  FILLER                   PIC X(10)  VALUE                    
003400             ' SQLCODE= '.                                                
003500         10  RC001-SQLCODE            PIC -999.                           
003800                                                                          
003900     05  RC001-LINE-02.                                                   
004000         10  FILLER                   PIC X(14) VALUE                     
004100         ' OPER/FCLTY = '.                                                
004200         10  RC001-OP.                                                    
004300             15 RC001-OPER-UNT-ID     PIC 9(4) VALUE ZERO.                
004400         10  FILLER                   PIC X(1) VALUE '/'.                 
004500         10  RC001-FCLTY.                                                 
004600             15  RC001-FCLTY-ID       PIC 9(1) VALUE ZERO.                
004700         10  FILLER                   PIC X(1) VALUE SPACE.               
004800         10  FILLER                   PIC X(15) VALUE                     
004900         'PO/RCVR/LINE = '.                                               
005000         10  RC001-PO.                                                    
005100             15  RC001-PO-NBR         PIC 9(8) VALUE ZERO.                
005200         10  FILLER                   PIC X(1) VALUE '/'.                 
005300         10  RC001-RCVR.                                                  
005400             15  RC001-REC-SEQ-NBR    PIC 9(3) VALUE ZERO.                
005500         10  FILLER                   PIC X(1) VALUE '/'.                 
005600         10  RC001-LINE.                                                  
005700             15 RC001-PO-LNE-NBR      PIC 9(3) VALUE ZERO.                
005800         10  FILLER                   PIC X(1) VALUE SPACE.               
005900         10  FILLER                   PIC X(10) VALUE                     
006000         'PACK ID = '.                                                    
006100         10  RC001-PREPK-ID           PIC 9(3) VALUE ZERO.                
006200         10  FILLER                   PIC X(01)  VALUE SPACES.            
006300         10  FILLER                   PIC X(08) VALUE                     
006400         'STORE = '.                                                      
006500         10  RC001-STORE-NBR.                                             
006600             15  RC001-STORE-NBR-N    PIC 9(4) VALUE ZERO.                
006700                                                                          
