000100****************************************************************  00010000
000200* RCWS825                                        LRECL = 2711  *  00020017
000300*                  COMMAREA FOR RANDOMIZATION                  *  00030001
000400****************************************************************  00040000
000500 01  RC825-COMMAREA.                                              00050017
000600                                                                  00060001
000700     05  RC825-TRANSCRIPT-RAND-ROUTINE.                           00070017
000710                                                                  00071016
000800         10  RC825-RANDOM-SEL-MIN     PIC S9(4) COMP VALUE +1.    00080017
000900         10  RC825-RANDOM-SEL-MAX     PIC S9(4) COMP.             00090017
001000         10  RC825-RANDOM-STR-SEL-CNT PIC S9(4) COMP VALUE +999.  00100017
001100                                                                  00110001
001110*    -------------------------------------------------------------00111016
001200*    STORE TABLE CONTAINS AN ARRAY OF 999 STORES THAT WOULD       00120016
001300*    RECEIVE A PACK. IT IS NOT THE MAX STORES AT KOHLS.           00130016
001301*    -------------------------------------------------------------00130116
001310                                                                  00131016
001400     05  RC825-STORE-TABLE           OCCURS 200 TIMES             00140017
001500                                      INDEXED BY STR-INDEX.       00150001
001510         10  RC825-STORE-NUMBER       PIC 9(04).                  00151017
001600         10  RC825-STORE-RANDOM-IND   PIC X(01) VALUE 'N'.        00160017
001700                                                                  00170001
001701*    -------------------------------------------------------------00170116
001702*    STORE TABLE CONTAINS AN ARRAY OF 999 STORES THAT WOULD       00170216
001703*    RECEIVE A PACK. IT IS NOT THE MAX STORES AT KOHLS.           00170316
001704*    -------------------------------------------------------------00170416
001705                                                                  00170516
001706     05  RC825-STORE-RANDOM-TABLE    OCCURS 200 TIMES             00170617
001707                                      INDEXED BY RND-INDEX.       00170711
001708         10  RC825-RANDOM-STORE-NBR   PIC 9(04).                  00170817
001750                                                                  00175007
001800     05  RC825-RANDOM-STORE-MIN       PIC S9(4) COMP VALUE +1.    00180017
001801                                                                  00180116
001810*    -------------------------------------------------------------00181016
001900*    STORE MAX REPRESENTS THE MAX NUMBER OF STORES IN A PACK, NOT 00190016
002000*    CORPORATE. THIS VALUE SHOULD MATCH THE STORE TABLE ARRAY SIZE00200016
002010*    -------------------------------------------------------------00201016
002020                                                                  00202016
002100     05  RC825-RANDOM-STORE-MAX       PIC S9(4) COMP VALUE +200.  00210017
002220                                                                  00222006
002300     05  RC825-ERROR-FLAGS            PIC X(01) VALUE SPACES.     00230017
002400         88  RC825-NO-ERRORS                    VALUE SPACES.     00240017
002500         88  RC825-INV-MINIMUM                  VALUE '1'.        00250017
002600         88  RC825-INV-MAXIMUM                  VALUE '2'.        00260017
002700         88  RC825-INV-COUNT                    VALUE '3'.        00270017
