000010******************************************************************        
000020*  RCWS039                                                       *        
000040*      THIS COPYBOOK IS USED FOR THE F-KEY ELIGIBILITY MODULE.   *        
000050*  THIS WILL DETERMINE IF THE ASSOCIATE WILL BE ABLE TO MANUALLY *        
000060*  CONFIRM/UN-CONFIRM/VERIFY/UN-VERIFY        LENGTH=400         *        
000080******************************************************************        
000100*                                                                         
000200 01  RC039-FIELDS.                                                        
000400     05  RC039-SIGNON-LOCATION           PIC S9(4) COMP.                  
000401*                                                                         
000402     05  RC039-OPER-UNT-ID               PIC S9(4) COMP                   
000403                                                   VALUE ZERO.            
000404     05  RC039-FCLTY-ID                  PIC S9(4) COMP                   
000405                                                   VALUE ZERO.            
000406     05  RC039-PO-NBR                    PIC S9(9) COMP.                  
000410     05  RC039-REC-SEQ-NBR               PIC S9(4) COMP.                  
000500     05  RC039-PO-LNE-NBR                PIC S9(4) COMP.                  
000600     05  RC039-PREPACK-ID                PIC S9(4) COMP.                  
000700*                                                                         
000940     05  RC039-PKGNG-CDE                 PIC X(01).                       
001100         88  RC039-BULK-CASE                       VALUE 'B', 'C'.        
001400         88  RC039-PREPACK                         VALUE 'M', 'I'.        
001401     05  RC039-PBS-IND                   PIC X(01).                       
001402         88  RC039-PBS                             VALUE 'Y'.             
001403     05  RC039-REC-TYPE-CDE              PIC X(02).                       
001404*                                                                         
001406     05  RC039-FUNCTION-REQ              PIC  X.                          
001407         88  RC039-FUNC-CNFM                       VALUE 'A'.             
001408         88  RC039-FUNC-UNCNFM                     VALUE 'B'.             
001409         88  RC039-FUNC-VRFY                       VALUE 'C'.             
001410         88  RC039-FUNC-UNVRFY                     VALUE 'D'.             
001411         88  RC039-FUNC-SMOOTH                     VALUE 'E'.             
001412         88  RC039-FUNC-PHY-LBL                    VALUE 'F'.             
001413         88  RC039-PO-AUTOVE-CHECK                 VALUE 'G'.             
001414*                                                                         
001415     05  RC039-USER-ID                   PIC  X(08).                      
001416     05  RC039-PROGRAM-NAME              PIC X(08).                       
001417*                                                                         
001418     05  RC039-SUCCESS-IND               PIC X(01).                       
001419         88  RC039-SUCCESSFUL          VALUES                             
001420                                      ZERO, SPACES, LOW-VALUES.           
001421         88  RC039-NOT-SUCCESSFUL                  VALUE '1'.             
001422         88  RC039-INVALID-SQL                     VALUE '2'.             
001423         88  RC039-DATABASE-BUSY                   VALUE '3'.             
001424     05  RC039-CRA-RET-MSG               PIC X(133) VALUE SPACES.         
001425     05  RC039-SQLCA                     PIC X(136).                      
001426*                                                                         
001427     05  RC039-FUNCTION-SW               PIC X(01) VALUE 'N'.             
001428         88  RC039-FUNCTION-YES                    VALUE 'Y'.             
001430         88  RC039-FUNCTION-NO                     VALUE 'N'.             
001500     05  RC039-NO-FUNC-REASON            PIC X(01) VALUE SPACE.           
001510         88  RC039-NOT-STR-CORP                    VALUE 'A'.             
001520         88  RC039-NOT-AP-RCVR                     VALUE 'B'.             
001530         88  RC039-DC-IS-AUTO-VE                   VALUE 'C'.             
001540         88  RC039-TRLR-ARVD-AUTOVE                VALUE 'D'.             
001550         88  RC039-RACF                            VALUE 'E'.             
001560         88  RC039-OTHER-ERROR                     VALUE 'F'.             
003000     05  FILLER                          PIC X(91) VALUE SPACES.          
