000100******************************************************************00010000
000200*  RCWS816                                                        00011000
000300*                                                                 00012000
000400*  THIS MEMBER CONTAINS THE COMMON DATA THAT IS PASSED BETWEEN    00013000
000500*  THE RECEIVING SIMPLIFICATION PROGRAMS IN THE COMMAREA          00014000
000600*                                                                 00015000
000700******************************************************************00016000
000200 01  RC816-SELECT-RECORD.                                         00017000
000300     05  RC816-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00018000
000400                                                COMP-3.           00019000
000500     05  RC816-MAX-ITEMS              PIC 99    VALUE 20.         00020000
000600     05  RC816-SELECTED-ITEM-ARRAY.                               00030000
000700         10  FILLER                   OCCURS 20 TIMES             00040000
000800                                      INDEXED BY RC816-IDX.       00050000
000900             15  RC816-ITEM           PIC S9(9) COMP-3.           00060000
001000             15  RC816-ACTION-SW      PIC X.                      00070004
001100                 88  RC816-INQ                  VALUE 'I'.        00080004
001200                 88  RC816-UPD                  VALUE 'U'.        00090004
001300                 88  RC816-DEL                  VALUE 'D'.        00100004
001400                 88  RC816-ERR                  VALUE 'E'.        00110004
001500             15  RC816-KEY-DATA.                                  00120000
001600*                                                                 00130000
001700                 20  RC816-PO-CODE                PIC  X(01).     00140002
001700                 20  RC816-PO-NBR                 PIC S9(09) COMP.00141002
001800                 20  RC816-RCVR-NBR               PIC S9(09) COMP.00150000
001700                 20  RC816-PO-STATUS              PIC  X(02).     00151002
001900                 20  RC816-VENDOR                 PIC  X(18).     00160000
028810                 20  RC816-PKG-CODE               PIC  X(01).     00170002
028900                 20  RC816-EXP-CART-COUNT         PIC  9(05).     00180002
                       20  RC816-ACTL-CART-COUNT        PIC  9(05).     00190002
029100                 20  RC816-EXP-SCN-COUNT          PIC  9(05).     00200002
029200                 20  RC816-ACTL-SCN-COUNT         PIC  9(05).     00210002
029300                 20  RC816-PERCENT-SCND           PIC  X(06).     00220002
029400                 20  RC816-TOTAL-UNITS            PIC  9(06).     00230002
029500                 20  RC816-CSR-IND                PIC  X(01).     00240002
004200                                                                  00390000
