      ****************************************************************          
      * RCWS824                                      LRECL = 628     *          
      *                                                              *          
      *      NEW COMMAREA FOR PRORATION                              *          
      *                                                              *          
      * REVISED: 04/01/2003  -  RICH MOORE                           *          
      ****************************************************************          
                                                                                
       01  RC824-COMMAREA.                                                      
                                                                                
           05  RC824-RECEIVER-QUEUE-NAME.                                       
               10  RC824-REC-TERM-ID          PIC  X(4).                        
               10  RC824-REC-TASK-NUMBER      PIC S9(5)  COMP-3.                
               10  RC824-REC-SEQ              PIC  9(01) VALUE 1.               
                                                                                
           05  RC824-STORE-QUEUE-NAME.                                          
               10  RC824-STR-TERM-ID          PIC  X(4).                        
               10  RC824-STR-TASK-NUMBER      PIC S9(5)  COMP-3.                
               10  RC824-STR-SEQ              PIC  9(01) VALUE 2.               
                                                                                
           05  RC824-ITEM-QUEUE-NAME.                                           
               10  RC824-ITM-TERM-ID          PIC  X(4).                        
               10  RC824-ITM-TASK-NUMBER      PIC S9(5)  COMP-3.                
               10  RC824-ITM-SEQ              PIC  9(01) VALUE 3.               
                                                                                
           05  RC824-ITEM-QUEUE-COUNT         PIC  9(04).                       
                                                                                
           05  RC824-TM500-FIELDS.                                              
               10  RC824-TM500-DATA           PIC  X(600).                      
