000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE                 00020001
000210*    RECEIVER CHECK-IN SCREEN.                                    00021001
000300*    LENGTH = 200 BYTES                                           00030000
000400******************************************************************00040000
000500         10  RC815-INTER-APPL-COMMAREA  REDEFINES                 00050001
000600                                        INTER-APPL-COMM-AREA.     00060000
000700             15  FILLER                     PIC X.                00070000
000800             15  RC815-NUMBER-OF-SELECTED-ITEMS                   00080001
000900                                            PIC S9(09) COMP-3.    00090000
001000             15  RC815-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00100001
001100             15  RC815-SEL-QUEUE-NAME       PIC X(08).            00110001
001200             15  RC815-OPER-UNT-ID          PIC S9(04) COMP.      00120001
001300             15  RC815-FCLTY-ID             PIC S9(04) COMP.      00130001
001400             15  RC815-FCLTY-NME            PIC X(25).            00140001
001500             15  RC815-PO-NBR               PIC S9(09) COMP.      00150001
001600             15  RC815-REC-SEQ-NBR          PIC S9(09) COMP.      00160001
001700             15  RC815-TRIP-ID              PIC S9(09) COMP.      00170001
001800             15  RC815-SCAC-CDE             PIC X(04).            00180001
001900             15  RC815-TRLR-NBR             PIC X(10).            00190001
001910             15  RC815-TRAILER-STATUS       PIC X(02).            00191002
001920                 88  RC815-STATUS-ARRIVED       VALUE 'AR'.       00192002
001930                 88  RC815-STATUS-UNLOADING     VALUE 'UG'.       00193002
001940                 88  RC815-STATUS-UNLOADED      VALUE 'UN'.       00194002
001950                 88  RC815-STATUS-ENROUTE       VALUE 'EN'.       00195002
001960                 88  RC815-STATUS-DEPARTED      VALUE 'DP'.       00196002
002500             15  RC815-SHIPT-UNT-ID         PIC S9(18) COMP-3.    00250001
002600             15  RC815-ALL-PO-IND           PIC X(01).            00260001
002700                 88  RC815-ALL-PO-NBRS      VALUE 'Y'.            00270001
002800                 88  RC815-NOT-ALL-PO-NBRS  VALUE 'N'.            00280001
002810             15  RC815-TEMP-QUEUE-UPDATE-SW PIC X(01).            00281001
002820                 88  RC815-UPDATE-TSQ       VALUE 'Y'.            00282001
002830                 88  RC815-NO-TSQ-UPDATE    VALUE 'N'.            00283001
002840             15  RC815-PKGNG-CD             PIC X.                00284001
002850                 88  RC815-PRE-PACK-ORDER         VALUE 'I', 'M'. 00285001
002860                 88  RC815-INNER-PREPK            VALUE 'I'.      00286001
002870                 88  RC815-MULTI-SKU-PREPK        VALUE 'M'.      00287001
002880                 88  RC815-SINGLE-SKU-PREPK       VALUE 'S'.      00288001
002890                 88  RC815-CASEPACK               VALUE 'C'.      00289001
002891                 88  RC815-BULK-PACK              VALUE 'B'.      00289101
002900             15  FILLER                     PIC X(113).           00290002
