000100******************************************************************00010003
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE PACK SLIP AND   00020003
000300*    RECEIVING SELECTION LIST PROGRAMS                            00030003
000400*    LENGTH = 200 BYTES                                           00040003
000500******************************************************************00050003
000600         10  RC015-INTER-APPL-COMMAREA  REDEFINES                 00060003
000700                                        INTER-APPL-COMM-AREA.     00070003
000800             15  FILLER                     PIC X.                00080003
000900             15  RC015-NUMBER-OF-SELECTED-ITEMS                   00090003
001000                                            PIC S9(09) COMP-3.    00100003
001100             15  RC015-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00110003
001200             15  RC015-SEL-QUEUE-NAME       PIC X(08).            00120003
001300             15  RC015-OPER-UNT-ID          PIC S9(04) COMP.      00130003
001400             15  RC015-FCLTY-ID             PIC S9(04) COMP.      00140003
001500             15  RC015-PO-NBR               PIC S9(09) COMP.      00150003
001600             15  RC015-REC-SEQ-NBR          PIC S9(09) COMP.      00160003
001700             15  RC015-TRIP-ID              PIC S9(09) COMP.      00170003
001800             15  RC015-SHIPT-ID             PIC S9(09) COMP.      00180003
001900             15  RC015-SEQ-NBR              PIC S9(04) COMP.      00190003
002000             15  RC015-PKSL-NBR             PIC X(10).            00200003
002100             15  RC015-STR-NBR              PIC S9(04) COMP.      00210003
002200             15  RC015-PRO-NBR              PIC X(22).            00220003
002300             15  RC015-BOL-NBR              PIC X(30).            00230003
002400             15  RC015-PKSL-LNE-NBR         PIC S9(09) COMP.      00240003
002500             15  RC015-DISPLAY-Z-OTR        PIC X(01).            00250003
002600             15  RC015-CARTON-CNT           PIC S9(04) COMP.      00260003
002700             15  RC015-ADJ-CYC-NBR          PIC S9(09) COMP.      00270003
002800             15  RC015-PACK-BY-ST-SW        PIC X(01).            00280003
002900                 88  RC015-PACK-BY-STORE        VALUE 'Y'.        00290003
003000                 88  RC015-NOT-PACK-BY-STORE    VALUE 'N'.        00300003
003100             15  RC015-PO-LNE-NBR           PIC S9(09) COMP.      00310003
003110             15  RC015-PO-PACK-ID           PIC S9(04) COMP.      00311005
003200             15  FILLER                     PIC X(079).           00320005
