      ******************************************************************00010000
      *                          R C W S 8 1 1                         *00020003
      ******************************************************************00030003
      **  THIS COPYBOOK CONTAINS THE DATA NEEDED TO MANAGE RECDIS       00040000
      **  CHANGES WITHIN THE PREPACK SYSTEM.                            00050000
      **  THIS COPYBBOK IS USED BY STORE DISTROBUTION BY PACK,          00060000
      **  TRANSCRIPTION, REDISTRO, AND BY PACK DETAIL LIST FOR          00070000
      **  MANAGING CHANGES TO RECDIS.  THESE CHANGES INCLUDE:           00080000
      **      A) DELETING OLD RECDIS TO PERFORM A NEW PRORATION         00090000
      **         OF PACK QUANTITIES.                                    00100000
      **      B) ADDING A NEW LINE TO AN EXISTING TRANSCRIBED PACK.     00110000
      **      C) REMOVING A LINE FROM A TRANSCRIBED PACK.               00120000
      **      D) CHANGING A RECEIVER RATIO IN RECDIS.                   00130000
      ******************************************************************00140000
       01  RC811-STORE-RECDIS-PROCESSING.                               00150000
                                                                        00160000
           05  RC811-FUNCTION               PIC X.                      00170002
               88  RC811-VALID-FUNCTION               VALUE '1' '2'     00180000
                                                            '3' '4'.    00190000
               88  RC811-ADD-A-DISTRO-LINE            VALUE '1'.        00200002
               88  RC811-CONVERT-DISTRO-RATIO         VALUE '2'.        00210000
               88  RC811-DELETE-A-DISTRO-LINE         VALUE '3'.        00220000
               88  RC811-DELETE-A-DISTRO-PACK         VALUE '4'.        00230000
                                                                        00240000
           05  RC811-KEYS.                                              00250000
               10  RC811-PO-NBR             PIC S9(9) COMP.             00260000
               10  RC811-REC-SEQ-NBR        PIC S9(9) COMP.             00270000
               10  RC811-OPER-UNIT-ID       PIC S9(4) COMP.             00280001
               10  RC811-FACILITY-ID        PIC S9(4) COMP.             00290001
               10  RC811-PREPK-ID           PIC S9(4) COMP.             00300000
                                                                        00310000
           05  RC811-OPTIONAL-KEYS.                                     00320000
               10  RC811-CLONE-LINE-NBR     PIC S9(4) COMP.             00330000
               10  RC811-MODIFY-LINE-NBR    PIC S9(4) COMP.             00340000
               10  RC811-DELETE-LINE-NBR    PIC S9(4) COMP.             00350000
                                                                        00360000
           05  RC811-PROCESSING-DATA.                                   00370000
               15  RC811-OLD-DISTRO-RATIO   PIC S9(4) COMP.             00380000
               15  RC811-NEW-RC-RATIO       PIC S9(4) COMP.             00390000
                                                                        00400000
           05  RC811-RETURN-DATA.                                       00410000
               10  RC811-RETURN-CODE        PIC 9(3).                   00420000
                   88  RC811-SUCCESSFUL-UPDATE        VALUE 001.        00421004
                   88  RC811-ZERO-IN-OLD-RATIO        VALUE 002.        00421104
                   88  RC811-NO-RECDIS-ROW-TO-CONVERT VALUE 003.        00421204
                   88  RC811-RECDIS-ROW-VERIFD        VALUE 004.        00421404
                   88  RC811-DB-ERROR-CONVERT-RATIO   VALUE 005.        00421604
                   88  RC811-SUCCESSFUL-LINE-DELETE   VALUE 006.        00421704
                   88  RC811-ZERO-VALUE-LINE-DELETE   VALUE 007.        00421804
                   88  RC811-LINES-RECDIS-ROW-VERIFD  VALUE 008.        00421904
                   88  RC811-LINES-RECDIS-NOT-FOUND   VALUE 009.        00422004
                   88  RC811-DB-ERROR-DELETE-LINE     VALUE 010.        00422104
                   88  RC811-SUCCESSFUL-LINE-DELETE   VALUE 011.        00422204
                   88  RC811-PACK-IN-RECDIS-NOT-FOUND VALUE 013.        00422304
                   88  RC811-DB-ERROR-DELETE-PACK     VALUE 015.        00422404
                   88  RC811-SUCCESSFUL-PACK-DELETE   VALUE 016.        00422504
                   88  RC811-NO-RATIO-FOR-COPIED-LINE VALUE 017.        00422604
                   88  RC811-NO-STORE-ALLOC-FOR-CLONE VALUE 019.        00422804
                   88  RC811-CASE-PACK-SPLIT-EXISTS   VALUE 020.        00422904
                   88  RC811-DB-ERROR-COPY-LINE       VALUE 021.        00423004
                   88  RC811-CLONE-AND-LINE-NEEDED    VALUE 022.        00423104
                   88  RC811-MODIFY-LINE-NEEDED       VALUE 023.        00423204
                   88  RC811-STORE-ALLOC-EXISTS       VALUE 024.        00423304
                   88  RC811-DB-ERROR-ON-COUNTING     VALUE 025.        00423404
                   88  RC811-NO-LINE-TO-CLONE         VALUE 026.        00424004
                   88  RC811-DB-ERROR-ON-COUNTING     VALUE 027.        00425004
                   88  RC811-NOT-ALL-KEYS-PASSED      VALUE 998.        00426004
                   88  RC811-INVALID-FUNCTION-PASSED  VALUE 999.        00427004
               10  RC811-SEVERITY-IND       PIC X(01).                  00430000
                   88  RC811-FATAL-ERROR              VALUE 'F'.        00440000
                   88  RC811-WARNING-ERROR            VALUE 'W'.        00450000
                   88  RC811-NO-ERROR                 VALUE 'N'.        00460000
               10  RC811-MSG-NUMBER         PIC 9(05).                  00470004
