00001 *--------------------------------------------------------------*  03/28/94
00002 *    THIS IS USED TO PASS THE SELECTED INFORMATION FROM        *  RCWS026 
00003 *    RCKCS220 TO RCKCSXXX.                                     *     LV002
00004 *--------------------------------------------------------------*  RCWS026 
00005  01  RC026-SELECT-RECORD.                                         RCWS026 
00006      05  RC026-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        RCWS026 
00007                                                 COMP-3.           RCWS026 
00008      05  RC026-MAX-ITEMS              PIC S9(3) VALUE 50          RCWS026 
00009                                                 COMP-3.           RCWS026 
00010      05  RC026-ORD-NBR                PIC S9(9) COMP.             RCWS026 
00011      05  RC026-REC-SEQ-NBR            PIC S9(9) COMP.                CL**2
00012      05  RC026-OPER-UNT-ID            PIC S9(4) COMP.             RCWS026 
00013      05  RC026-FCLTY-ID               PIC S9(4) COMP.             RCWS026 
00014 *                                                                 RCWS026 
00015      05  RC026-SELECTED-ITEM-ARRAY.                               RCWS026 
00016          10  FILLER                   OCCURS 100 TIMES               CL**2
00017                                       INDEXED BY RC026-IDX.       RCWS026 
00018              15  RC026-ITEM           PIC S9(9) COMP-3.           RCWS026 
00019              15  RC026-ACTION-SW      PIC X.                      RCWS026 
00020                  88  RC026-INQ                  VALUE 'I'.        RCWS026 
00021                  88  RC026-UPD                  VALUE 'U'.        RCWS026 
00022                  88  RC026-DEL                  VALUE 'D'.        RCWS026 
00023                  88  RC026-ERR                  VALUE 'E'.        RCWS026 
00024              15  RC026-KEY-DATA.                                  RCWS026 
00025                  20  RC026-ORD-LNE-NBR PIC S9(09) COMP.           RCWS026 
