00001                                                                   07/14/95
00002  01  RC013-DC-SELECT-RECORD.                                      RCWS013 
00003      05  RC013-SELECTED-ITEMS         PIC S9(5) VALUE ZERO           LV001
00004                                                 COMP-3.           RCWS013 
00005      05  RC013-MAX-ITEMS              PIC 99    VALUE 20.         RCWS013 
00006      05  RC013-SELECTED-ITEM-ARRAY.                               RCWS013 
00007          10  FILLER                   OCCURS 20 TIMES             RCWS013 
00008                                       INDEXED BY RC013-IDX.       RCWS013 
00009              15  RC013-ITEM           PIC S9(9) COMP-3.           RCWS013 
00010              15  RC013-ACTION-SW      PIC X.                      RCWS013 
00011                  88  RC013-INQ                  VALUE 'I'.        RCWS013 
00012                  88  RC013-UPD                  VALUE 'U'.        RCWS013 
00013                  88  RC013-DEL                  VALUE 'D'.        RCWS013 
00014                  88  RC013-ERR                  VALUE 'E'.        RCWS013 
00015              15  RC013-KEY-DATA.                                  RCWS013 
00016                  20  RC013-PO-NBR     PIC S9(09) COMP.            RCWS013 
00017                  20  RC013-REC-SEQ-NBR                            RCWS013 
00018                                       PIC S9(09) COMP.            RCWS013 
00019                  20  RC013-SHIPT-ID   PIC S9(09) COMP.            RCWS013 
00020                  20  RC013-TRIP-ID    PIC S9(09) COMP.            RCWS013 
00021                  20  RC013-STR-NBR    PIC S9(04) COMP.            RCWS013 
00022                  20  RC013-PKSL-STAT-CDE                          RCWS013 
00023                                       PIC X(02).                  RCWS013 
00024                  20  RC013-PRO-NBR    PIC X(22).                  RCWS013 
00025                  20  RC013-BOL-NBR    PIC X(30).                  RCWS013 
00026                  20  RC013-OWNER-SCAC-ID                          RCWS013 
00027                                       PIC X(04).                  RCWS013 
00028                  20  RC013-VEH-NBR    PIC X(10).                  RCWS013 
00029                  20  RC013-ARRIVAL-DTE                            RCWS013 
00030                                       PIC X(10).                  RCWS013 
00031                  20  RC013-PKSL-NBR   PIC X(10).                  RCWS013 
00032                  20  RC013-PKSL-LNE-NBR.                          RCWS013 
00033                      25  RC013-PKSL-LNE-NBR-N                     RCWS013 
00034                                       PIC 9(04).                  RCWS013 
00035                  20  RC013-SEQ-NBR    PIC S9(04) COMP.            RCWS013 
00036                  20  RC013-OPER-UNT-ID                            RCWS013 
00037                                       PIC S9(04) COMP.            RCWS013 
00038                  20  RC013-FCLTY-ID   PIC S9(04) COMP.            RCWS013 
00039                  20  RC013-VND-SHP-DTE PIC  X(10).                RCWS013 
00040                  20  RC013-CSR-IND    PIC  X(1).                  RCWS013 
00041                                                                   RCWS013 
