000100******************************************************************00010000
000200**                        RCWS814                               **00020001
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  RECEIVING CRITERIA SPECIFICATION                            **00050001
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  RC814-INTER-APPL-COMMAREA  REDEFINES                 00080001
000900                                     INTER-APPL-COMM-AREA.        00090000
001000             15  FILLER                         PIC  X(01).       00100000
001100             15  RC814-OPER-UNT-ID              PIC S9(04) COMP.  00110001
001200             15  RC814-FCLTY-ID                 PIC S9(04) COMP.  00120001
001300             15  RC814-FCLTY-NME                PIC X(25).        00130001
001400             15  RC814-SCAC                     PIC X(04).        00140001
001500             15  RC814-TRLR-NBR                 PIC X(10).        00150001
001596             15  RC814-TRLR-STATUS         PIC X(02).             00159604
001597                 88  RC814-STATUS-ARRIVED       VALUE 'AR'.       00159703
001598                 88  RC814-STATUS-UNLOADING     VALUE 'UG'.       00159803
001599                 88  RC814-STATUS-UNLOADED      VALUE 'UN'.       00159903
001600                 88  RC814-STATUS-ENROUTE       VALUE 'EN'.       00160003
001601                 88  RC814-STATUS-DEPARTED      VALUE 'DP'.       00160103
002100             15  RC814-TRIP-ID                  PIC S9(09) COMP.  00210001
002200             15  RC814-PO-NBR                   PIC S9(09) COMP.  00220001
002300             15  RC814-REC-SEQ-NBR              PIC S9(09) COMP.  00230001
002400             15  RC814-SHIPT-UNT-ID             PIC S9(18) COMP-3.00240001
002500             15  FILLER                         PIC X(132).       00250002
