000100************************************************************      00010013
000200*    ******                IMPORTANT                 ******       00020013
000300*   WHEN THE PROGRAM CHANGES IT MUST BE COMPILED FOR              00030013
000400*   BOTH BATCH AND CICS                                           00040013
000500*                                                                 00050013
000600*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THI      00060013
000700*   FORMAT:                                                       00070013
000800*     CALL RC040-AUTOVE-CHECK-PGM USING DFHEIBLK                  00080013
000900*                                       RC040-COMMAREA            00090013
001000*                                       RC040-FIELDS              00100013
001100*   IN BATCH DO THIS:                                             00110013
001200*     CALL RC040-AUTOVE-CHECK-PGM USING RC040-FIELDS              00120013
001300*    ******                IMPORTANT                 ******       00130013
001400*                                                                 00140013
001500*     INITIALIZE RC040-FIELDS BEFORE CALLING RCKUT127             00150013
001600*                                                                 00160013
001700*                                                                 00170013
001800*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK                00180013
001900*           DECREMENT THE FILLER NEAR THE END OF THIS             00190013
002000*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME         00200013
002100************************************************************      00210013
002200******************************************************************00220011
002300*  RCWS040                                                       *00230011
002400*      THIS COPYBOOK IS USED FOR THE MODULE TO CHECK IF DC WILL  *00240011
002500*  BE AUTOVERIFING THE PO BEING PROCESSED.  (RCKUT127)           *00250011
002600*                                             LENGTH=400         *00260011
002700******************************************************************00270011
002800*                                                                 00280011
002900 01  RC040-FIELDS.                                                00290011
003000     05  RC040-SIGNON-LOCATION           PIC S9(4) COMP.          00300011
003100     05  RC040-PO-NBR                    PIC S9(9) COMP.          00310011
003200     05  RC040-PO-RCVR                   PIC S9(4) COMP.          00320011
003300     05  RC040-DEPT                      PIC S9(4) COMP.          00330011
003400     05  RC040-CALLING-PROGRAM           PIC  X(8).               00340011
003500     05  RC040-USER-ID                   PIC  X(8).               00350011
003600*                                                                 00360011
003700     05  RC040-SUCCESS-IND               PIC X(01).               00370011
003800         88  RC040-SUCCESSFUL          VALUES                     00380011
003900                                      ZERO, SPACES, LOW-VALUES.   00390011
004000         88  RC040-NOT-SUCCESSFUL                  VALUE '1'.     00400011
004100         88  RC040-INVALID-SQL                     VALUE '2'.     00410011
004200         88  RC040-DATABASE-BUSY                   VALUE '3'.     00420011
004300     05  RC040-CRA-RET-MSG               PIC X(133) VALUE SPACES. 00430011
004400     05  RC040-SQLCA                     PIC X(136).              00440011
004500     05  RC040-CRA-REQ-ID                PIC X(08)  VALUE SPACES. 00450011
004600*                                                                 00460011
004700     05  RC040-AUTO-VE-SW                PIC X(01).               00470011
004800         88  RC040-AUTO-VE-YES                     VALUE 'Y'.     00480011
004900         88  RC040-AUTO-VE-NO                      VALUE 'N'.     00490011
005000*                                                                 00500011
005100     05  RC040-ZERO-RCVR-SW              PIC X(01).               00510011
005200         88  RC040-RCVR-EXISTS                     VALUE 'Y'.     00520011
005300         88  RC040-NO-RCVR-EXISTS                  VALUE 'N'.     00530011
005310*                                                                 00531014
005311     05  RC040-FACILITY-AUTOVE-SW        PIC X(01) VALUE 'N'.     00531114
005312         88  RC040-FACILITY-AUTOVE-YES             VALUE 'Y'.     00531214
005313         88  RC040-FACILITY-AUTOVE-NO              VALUE 'N'.     00531314
005314     05  RC040-MODULE-EXECUTION-LEVEL    PIC X(01) VALUE 'P'.     00531415
005315         88  RC040-DC-LEVEL                        VALUE 'D'.     00531515
005316         88  RC040-PO-RCVR-LEVEL                   VALUE 'P'.     00531615
005317     05  RC040-CHECK-MISDRCT-PARM-SW     PIC X(01) VALUE 'N'.     00531716
005318         88  RC040-CHCK-MSDIRCT-YES                VALUE 'Y'.     00531816
005319         88  RC040-CHCK-MSDIRCT-NO                 VALUE 'N'.     00531919
005320     05  RC040-PROCESS-MSDIRCT-SW        PIC X(01) VALUE 'N'.     00532016
005321         88  RC040-PROCESS-MSDIRCT-YES             VALUE 'Y'.     00532116
005322         88  RC040-PROCESS-MSDIRCT-NO              VALUE 'N'.     00532216
005330*                                                                 00533016
005400     05  FILLER                          PIC X(90) VALUE SPACES.  00540018
005500 01  RC040-COMMAREA                   PIC X(01).                  00550011
005600 01  RC040-AUTOVE-CHECK-PGM           PIC X(08) VALUE 'RCKUT127'. 00560011
