      ****************************************************************          
      * RCWS821                                      LRECL = 39,184  *          
      *                                                              *          
      *      TMP STG QUE DATA FOR ALLOCATION / PRORATION / TROUBLE   *          
      *                                                              *          
      ****************************************************************          
                                                                                
       01  RC821-DATA-FIELDS.                                                   
                                                                                
         05  RC821-PO-RECEIVER-CONTENTS.                                        
                                                                                
      ****************************************************************          
      * PURCHASE ORDER NUMBER                                        *          
      ****************************************************************          
           10  RC821-ORD-NBR                 PIC S9(09)  COMP.                  
      ****************************************************************          
      * DISTRIBUTION CENTER OPER UNIT ID'S AND FACILITY              *          
      ****************************************************************          
           10  RC821-OPER-UNT-ID             PIC S9(04)  COMP.                  
           10  RC821-CRE-OPER-UNT-ID         PIC S9(04)  COMP.                  
           10  RC821-CURR-OPER-UNT-ID        PIC S9(04)  COMP.                  
           10  RC821-FCLTY-ID                PIC S9(04)  COMP.                  
      ****************************************************************          
      * DISTRIBUTION CENTER RECEIVER FOR ORDER                       *          
      ****************************************************************          
           10  RC821-REC-SEQ-NBR             PIC S9(09)  COMP.                  
      ****************************************************************          
      * ORDER SOURCED FROM FOREIGN FACTORY                           *          
      ****************************************************************          
           10  RC821-IMPRT-PO-IND            PIC  X(01).                        
      ****************************************************************          
      * ORDER FOR NEW STORE DISTRIBUTION                             *          
      ****************************************************************          
           10  RC821-NEW-STR-IND             PIC  X(01).                        
      ****************************************************************          
      * NUMBER OF RECEIVERS IN PROCESS FOR PO                        *          
      ****************************************************************          
           10  RC821-REC-COUNT               PIC S9(09)  COMP.                  
      ****************************************************************          
      * NUMBER OF RECEIVERS WITH SHORT TROUBLES                      *          
      ****************************************************************          
           10  RC821-REC-TROUBLE-SHORT-CNT   PIC S9(04)  COMP.                  
      ****************************************************************          
      * NUMBER OF RECEIVERS WITH DC BAD PACK TROUBLES                *          
      ****************************************************************          
           10  RC821-REC-TROUBLE-DCPACK-CNT  PIC S9(04)  COMP.                  
      ****************************************************************          
      * ORDER CREATED IN RMS VS LEGACY PO TPURCHS.PO_IN_RMS_IND      *          
      ****************************************************************          
           10  RC821-RMS-PO-IND              PIC  X(01).                        
      ****************************************************************          
      * DEPART ASSOCIATED TO ORDERED ITEMS IN PO                     *          
      ****************************************************************          
           10  RC821-DEPT-NBR                PIC S9(04)  COMP.                  
      ****************************************************************          
      * PACKAGING INSTRUCTIONS TO VENDOR                             *          
      ****************************************************************          
           10  RC821-PKGNG-CDE               PIC  X(01).                        
      ****************************************************************          
      * PREPACK PACKAGING CODE                                       *          
      ****************************************************************          
           10  RC821-PO-PKGNG-CDE            PIC  X(01).                        
      ****************************************************************          
      * SPECIAL ORDERS FOR STORE ; USUALLY REPLEN ORDERS             *          
      ****************************************************************          
           10  RC821-PACK-BY-STORE-IND       PIC  X(01).                        
      ****************************************************************          
      * OTR SCOPE CHANGES IF REDISTRO OR TRANSCRIPTION               *          
      ****************************************************************          
           10  RC821-OTR-SCOPE-IND           PIC  X(01).                        
      ****************************************************************          
      * MERCHANDISE TYPE CODE IN ORDER                               *          
      ****************************************************************          
           10  RC821-PO-TYP-CDE              PIC  X(02).                        
      ****************************************************************          
      * NUMBER ASSIGNED TO AN ALLOCATION PLAN FROM ADAM              *          
      ****************************************************************          
           10  RC821-PLAN-NBR                PIC S9(04) COMP.                   
      ****************************************************************          
      * A BREAKDOWN OF QTY TO SHIP TO THE DC FROM VENDOR             *          
      ****************************************************************          
           10  RC821-CURR-SPLIT-QTY          PIC S9(09) COMP.                   
      ****************************************************************          
      * A ROUNDING CODE FOR PRORATION                                *          
      ****************************************************************          
           10  RC821-PK-SIZE-RND-CDE         PIC  X(01).                        
      ****************************************************************          
      * IF MULTIPLE INNER PACKS IN A CARTON THIS IS THE              *          
      * ALLOCATION AMOUNT IN THE PLAN.                               *          
      ****************************************************************          
           10  RC821-ALLOC-OUTR-PK-QTY       PIC S9(09) COMP.                   
      ****************************************************************          
      * SUM OF STORE PLAN QTY FOR DC.  SHOULD MATCH DC SPLIT         *          
      ****************************************************************          
           10  RC821-SUM-STR-PLAN-QTY        PIC S9(09) COMP.                   
      ****************************************************************          
      * SUM OF STORE OTR IN UNITS.  BALANCE OF RECEIPTS OPEN         *          
      * FOR ALL STORES.                                              *          
      ****************************************************************          
           10  RC821-SUM-STR-OTR-QTY         PIC S9(09) COMP.                   
           10  RC821-SUM-STR-DISTRO-OTR-QTY  PIC S9(09) COMP.                   
      ****************************************************************          
      * SUM OF STORE PLAN IN PACKS.                                  *          
      ****************************************************************          
           10  RC821-SUM-STR-PLAN-PK         PIC S9(09) COMP.                   
      ****************************************************************          
      * SUM OF STORE OTR IN PACKS.  BALANCE OF RECEIPTS OPEN         *          
      * FOR ALL STORES.                                              *          
      ****************************************************************          
           10  RC821-SUM-STR-OTR-PK          PIC S9(09) COMP.                   
           10  RC821-SUM-STR-DISTRO-OTR-PK   PIC S9(09) COMP.                   
      ****************************************************************          
      * VALID DISTRO IND INDICATES IF STORE ALLOCATION AND PLAN      *          
      * FOR LINE OR PACK ARE VALID.                                  *          
      ****************************************************************          
           10  RC821-VALID-DISTRO-IND        PIC  X(01).                        
      ****************************************************************          
      * NO TALLPLN DISTRO INDICATES THAT A PLAN LEVEL RECORD IS NOT  *          
      * SET UP.                                                      *          
      ****************************************************************          
           10  RC821-NO-TALLPLN-DISTRO-IND   PIC  X(01).                        
      ****************************************************************          
      * NO TMESTDS DISTRO INDICATES THAT A STORE LEVEL DISTRO DATA   *          
      * IS NOT SET UP.                                               *          
      ****************************************************************          
           10  RC821-NO-TMESTDS-DISTRO-IND   PIC  X(01).                        
      ****************************************************************          
      * BAD MESTDS DISTRO FOR PREPACK.                               *          
      ****************************************************************          
           10  RC821-BAD-PACK-DISTRO-IND     PIC  X(01).                        
      ****************************************************************          
      * ALLOCATION PLAN IN ADAM PASSES ON THE PRORATION METHOD       *          
      * FOR OVERAGE RECEIPTS.                                        *          
      ****************************************************************          
           10  RC821-OVER-PRORATE-CDE        PIC  X(01).                        
      ****************************************************************          
      * ALLOCATION PLAN IN ADAM PASSES ON THE PRORATION METHOD       *          
      * FOR SHORTAGE RECEIPTS.                                       *          
      ****************************************************************          
           10  RC821-SHORT-PRORATE-CDE       PIC  X(01).                        
      ****************************************************************          
      * ALLOCATION PLAN IN ADAM PASSES ON AN INDICATOR FOR           *          
      * SPECIAL SHORTAGE PROCESSING.  USED IN TROUBLE.               *          
      ****************************************************************          
           10  RC821-SHORT-USE-EX-RULES-IND  PIC  X(01).                        
      ****************************************************************          
      * A CODE DETERMINED IF THE RECEIPT IS OVER OR SHORT OR         *          
      * NOT.                                                         *          
      ****************************************************************          
           10  RC821-OVER-SHORT-CDE          PIC  X(01).                        
      ****************************************************************          
      * A DC IS A STORE IN THE STORE MASTER AND IS REPRESENTED       *          
      * AS A TYPE.                                                   *          
      ****************************************************************          
           10  RC821-TYPE-CODE               PIC  X(02).                        
      ****************************************************************          
      * A DC STORE NUMBER.  SHOULD MATCH THE OPER UNIT ID.           *          
      ****************************************************************          
           10  RC821-DC-NMBR                 PIC  9(04).                        
      ****************************************************************          
      * THE DATE THE DC IS READY TO RECEIVE.                         *          
      ****************************************************************          
           10  RC821-DC-RCT-STA-DTE          PIC  X(10).                        
      ****************************************************************          
      * THE DATE THE DC IS CLOSED.                                   *          
      ****************************************************************          
           10  RC821-DC-RCT-STO-DTE          PIC  X(10).                        
      ****************************************************************          
      * THE SIZE OF RC821-STORE-ARRAY                                *          
      ****************************************************************          
           10  RC821-STR-COUNT               PIC S9(04)    COMP.                
      ****************************************************************          
      * THE SIZE OF RC821-ITEM-ARRAY                                 *          
      ****************************************************************          
           10  RC821-ITEM-COUNT              PIC S9(04)    COMP.                
      ****************************************************************          
      * THE MAX SIZE OF RC821-STORE-ARRAY                            *          
      ****************************************************************          
           10  RC821-MAX-STR-COUNT           PIC S9(04)    COMP                 
                                             VALUE +200.                        
      ****************************************************************          
      * THE MAX SIZE OF RC821-ITEM-ARRAY                             *          
      ****************************************************************          
           10  RC821-MAX-ITEM-COUNT          PIC S9(04)    COMP                 
                                             VALUE +100.                        
      ****************************************************************          
      * CONTROL RECORD FOR PERM PRICE CHANGE DAYS AND ODD UNIT PARMS *          
      ****************************************************************          
           10  RC821-REC-CONTROL.                                               
             15  RC821-LNE-ODU-TOL-QTY       PIC S9(09)    COMP.                
             15  RC821-LNE-ODU-TOL-AMT       PIC S9(05)V99 COMP-3.              
             15  RC821-PREPK-ODU-TOL-QTY     PIC S9(09)    COMP.                
             15  RC821-PREPK-ODU-TOL-AMT     PIC S9(05)V99 COMP-3.              
             15  RC821-DAYS-PR-CHG-NBR       PIC S9(02)V   COMP-3.              
      ****************************************************************          
      * REC-PACK DESCRIBES A PREPACK ATTRIBUTES.                     *          
      ****************************************************************          
           10  RC821-REC-PACK.                                                  
      ****************************************************************          
      * REC-PACK UPC IS A RMS ASSIGNED UPC CODE FOR THE PACK         *          
      ****************************************************************          
             15  RC821-PACK-UPC-NBR          PIC S9(15)V   COMP-3.              
      ****************************************************************          
      * REC-PACK SKU IS A RMS ASSIGNED SKU FOR THE PACK              *          
      ****************************************************************          
             15  RC821-PACK-SKU-NBR          PIC S9(08)V   COMP-3.              
      ****************************************************************          
      * INTERNAL RECEIVING ASSIGNED REPRESENTING THE PACK            *          
      ****************************************************************          
             15  RC821-PREPK-ID              PIC S9(04)    COMP.                
      ****************************************************************          
      * PREPACK CAN BE A INNER OR MULTI PREPACK                      *          
      ****************************************************************          
             15  RC821-PREPK-TYPE-CDE        PIC  X(01).                        
      ****************************************************************          
      * NUMBER OF INNER PACKS WITHIN THE PREPACK                     *          
      ****************************************************************          
             15  RC821-INPK-UNT-QTY          PIC S9(09)    COMP.                
      ****************************************************************          
      * NUMBER OF PACKS WITHIN A CARTON AS DESCRIBED BY VENDOR       *          
      ****************************************************************          
             15  RC821-OTPK-UNT-QTY          PIC S9(09)    COMP.                
      ****************************************************************          
      * AN ARBITRARY DRIVER LINE ASSIGNED FOR THE PACK               *          
      ****************************************************************          
             15  RC821-REC-DRV-LNE-NBR       PIC S9(09)    COMP.                
      ****************************************************************          
      * TOTAL NUMBER OF ODD UNITS IN THE PACK                        *          
      ****************************************************************          
             15  RC821-TOTAL-ODD-UNITS       PIC S9(09)    COMP.                
                                                                                
      ****************************************************************          
      * THE STORE ARRAY HOLDS OTR AND DISTRO PLAN                    *          
      * ONLY THE DRIVER LINE IS REPRESENTED.                         *          
      * THE REMAINING LINES IN A PACK ARE DERIVED USING THE          *          
      * PACK RATIO ASSIGNED TO THE RECEIVER                          *          
      ****************************************************************          
       05  RC821-STORE-COMPONENTS.                                              
           10  RC821-STORE-ARRAY            OCCURS 200 TIMES                    
                                            INDEXED BY RC821-STORE-IDX.         
             15  RC821-STORE-DETAIL.                                            
               20  RC821-STR-NBR               PIC S9(04) COMP.                 
               20  RC821-ALLOC-LNE-NBR         PIC S9(04) COMP.                 
               20  RC821-OPENED-DATE           PIC  X(10).                      
               20  RC821-CLOSED-DATE           PIC  X(10).                      
               20  RC821-EXISTING-STORE-CDE    PIC  X(01).                      
               20  RC821-ST-TYPE-CODE          PIC  X(02).                      
               20  RC821-ST-DC-NMBR            PIC  9(04).                      
               20  RC821-ST-DC-RCT-STA-DTE     PIC  X(10).                      
               20  RC821-ST-DC-RCT-STO-DTE     PIC  X(10).                      
      ****************************************************************          
      * STORE VALID IN PLAN BUT NOT ALL LINES IN PACK ARE VALID.     *          
      * OOR - OUT OF RATIO INDICATOR.                                *          
      ****************************************************************          
               20  RC821-STR-VAL-OOR-IND       PIC  X(01).                      
      ****************************************************************          
      * STORE NUMBER IS IN ALL LINES OF THE PACK.                    *          
      ****************************************************************          
               20  RC821-STR-GOOD-PLAN-IND     PIC  X(01).                      
               20  RC821-STR-DISTRO-QTY        PIC S9(09)   COMP.               
               20  RC821-STR-DISTRO-QTY-X      PIC  X(05).                      
               20  RC821-STR-DISTRO-PK         PIC S9(09)   COMP.               
               20  RC821-STR-DISTRO-OTR-QTY    PIC S9(09)   COMP.               
               20  RC821-STR-DISTRO-OTR-QTY-X  PIC  X(05).                      
               20  RC821-STR-DISTRO-OTR-PK     PIC S9(09)   COMP.               
               20  RC821-STR-OTR-PK            PIC S9(09)   COMP.               
               20  RC821-STR-OTR-QTY           PIC S9(09)   COMP.               
               20  RC821-STR-OTR-QTY-X         PIC  X(05).                      
               20  RC821-RNK-SEQ-NBR           PIC S9(04)   COMP.               
                                                                                
      ****************************************************************          
      * ITEM ARRAY HOLDS THE ITEM PACK COMPONENT INFORMATION         *          
      * BULK RECEIPTS ARE REPRESENTED IN THIS ARRAY AS A PACK        *          
      * OR 1 RATIO OF 1.                                             *          
      * AN IMAGE OF THE RECEIPT PACK (ACTUAL ASN INFORMATION)        *          
      * VS THE PO (PO INFORMATION) ARE KEPT SEPARATE.                *          
      * THIS DATA IS USED IN TROUBLE PROCESSING.                     *          
      ****************************************************************          
         05  RC821-ITEM-ARRAY-ALL.                                              
                                                                                
           10  RC821-ITEM-ARRAY               OCCURS 100 TIMES                  
                                              INDEXED BY RC821-ITEM-IDX.        
             15  RC821-ITEM-COMPONENTS.                                         
                                                                                
               20  RC821-REC-COMPONENTS.                                        
                 25  RC821-REC-LNE-NBR           PIC S9(09)    COMP.            
                 25  RC821-REC-ITEM-UPC-NBR      PIC S9(15)V   COMP-3.          
                 25  RC821-REC-ITEM-UPC-INTR-ID  PIC S9(09)    COMP.            
                 25  RC821-REC-ITEM-UPC-ID       PIC S9(09)    COMP.            
                 25  RC821-REC-SKU-NBR           PIC S9(08)V   COMP-3.          
                 25  RC821-REC-CLASS             PIC S9(04)    COMP-3.          
                 25  RC821-REC-SUBCLASS          PIC S9(04)    COMP-3.          
                 25  RC821-WEB-ITEM-IND          PIC  X(01).                    
                 25  RC821-REC-ITEM-NBR          PIC S9(15)V   COMP-3.          
                 25  RC821-REC-CASE-PACK-QTY     PIC S9(04)    COMP.            
                 25  RC821-REC-PACK-RATO-QTY     PIC S9(04)    COMP.            
                 25  RC821-REC-INNER-PACK-QTY    PIC S9(04)    COMP.            
                 25  RC821-SKU-INNER-PACK-QTY    PIC S9(04)    COMP.            
                 25  RC821-ODD-UNIT-QTY          PIC S9(04)    COMP.            
                 25  RC821-PKSL-ITM-QTY          PIC S9(09)    COMP.            
                 25  RC821-DTL-CK-ITM-QTY        PIC S9(09)    COMP.            
                 25  RC821-BEST-CASE-UNITS       PIC S9(09)    COMP.            
                 25  RC821-DRV-LNE-CDE           PIC  X(01).                    
                 25  RC821-SK-UNT-RTL-PR-AMT     PIC S9(07)V99 COMP-3.          
                 25  RC821-SK-GP-RTL-AMT         PIC S9(07)V99 COMP-3.          
                 25  RC821-SK-GP-QTY             PIC S9(09)    COMP.            
                 25  RC821-ITEM-DISTRO-QTY       PIC S9(09)    COMP.            
                 25  RC821-ITEM-DISTRO-OTR-QTY   PIC S9(09)    COMP.            
                 25  RC821-ITEM-OTR-QTY          PIC S9(09)    COMP.            
                                                                                
               20  RC821-PO-COMPONENTS.                                         
                 25  RC821-PO-LNE-NBR            PIC S9(09)    COMP.            
                 25  RC821-APP-PO-LNE-NBR        PIC S9(09)    COMP.            
                 25  RC821-PO-SKU-NBR            PIC S9(08)V   COMP-3.          
                 25  RC821-PO-CLASS              PIC S9(04)V   COMP-3.          
                 25  RC821-PO-SUBCLASS           PIC S9(04)V   COMP-3.          
                 25  RC821-PO-ITEM-NBR           PIC S9(15)V   COMP-3.          
                 25  RC821-PO-UNIT-QTY           PIC S9(09)    COMP.            
                 25  RC821-PO-LNE-STATUS-CDE     PIC  X(02).                    
                 25  RC821-PO-PACK-RATO-QTY      PIC S9(04)    COMP.            
                 25  RC821-PO-UNT-RTL-PR-AMT     PIC S9(06)V99 COMP-3.          
                 25  RC821-PO-GP-RTL-AMT         PIC S9(05)V99 COMP-3.          
                 25  RC821-PO-GP-QTY             PIC S9(04)    COMP.            
                 25  RC821-DUMMY-SKU-IND         PIC  X(01).                    
                                                                                
