000100******************************************************************00010000
000200*  RCWS076                                                       *00020000
000300*      THIS COPYBOOK IS USED TO CAPTURE INBOUND TRAILER UNLOADS  *00030000
000400*      THIS DATA WILL BE USED BY RPA TO CREATE MIS DIRECT RCVRS  *00040000
000500*                                             LENGTH=200         *00050001
000600******************************************************************00060000
000700*                                                                 00070000
000800 01  RC076-TRLR-UNLD-MIS-DIRECT.                                  00080000
000910     05  RC076-OPER-UNT-ID               PIC 9(04).               00091000
000920     05  FILLER                          PIC X(01).               00092000
001320     05  RC076-TRIP-ID                   PIC 9(09).               00132000
001321     05  FILLER                          PIC X(01).               00132100
001322     05  RC076-TRIP-STATUS               PIC X(02).               00132209
001323     05  FILLER                          PIC X(01).               00132306
001324     05  RC076-SCAC                      PIC X(04).               00132410
001325     05  FILLER                          PIC X(01).               00132506
001330     05  RC076-VEH-NBR                   PIC X(10).               00133009
001340     05  FILLER                          PIC X(01).               00134000
001380     05  RC076-PRO-NBR                   PIC X(22).               00138000
001381     05  FILLER                          PIC X(01).               00138100
001390     05  RC076-BOL-NBR                   PIC X(30).               00139000
001391     05  FILLER                          PIC X(01).               00139100
001400     05  RC076-VEND-SHIP-DATE            PIC X(08).               00140011
001401     05  FILLER                          PIC X(01).               00140100
001402     05  RC076-CARR-SHIP-DATE            PIC X(10).               00140203
001403     05  FILLER                          PIC X(01).               00140303
001404     05  RC076-ARRIVAL-DATE              PIC X(08).               00140411
001405     05  FILLER                          PIC X(01).               00140511
001410     05  RC076-CSR-SELECTION             PIC X(01).               00141000
001411     05  FILLER                          PIC X(01).               00141100
001412     05  RC076-PO-NBR                    PIC 9(09).               00141202
001413     05  FILLER                          PIC X(01).               00141302
001414     05  RC076-RCVR-SEQ-NBR              PIC 9(04).               00141402
001415     05  FILLER                          PIC X(01).               00141502
001420     05  RC076-EXPCTD-OPER               PIC 9(04).               00142016
001421     05  FILLER                          PIC X(01).               00142116
001422     05  RC076-EXPCTD-TRIP               PIC 9(09).               00142216
001430     05  FILLER                          PIC X(01).               00143000
001500     05  RC076-CARTON-COUNT              PIC 9(09).               00150000
001510     05  FILLER                          PIC X(01).               00151000
001600     05  RC076-UNIT-COUNT                PIC 9(09).               00160000
001610     05  FILLER                          PIC X(01).               00161000
001700     05  RC076-OPER-SET                  PIC 9(03).               00170014
003700     05  FILLER                          PIC X(01).               00370015
003800     05  RC076-PROGRAM-ID                PIC X(08).               00380014
003900     05  FILLER                          PIC X(46).               00390016
