000100*  COMMON AREA BETWEEN RCKCS808, RCKCS809 AND RCKCS810                    
000200 01  RC809-COMMAREA.                                                      
000300     05  RC809-QUEUE-NAME.                                                
000400         10  RC809-TERM-ID            PIC X(4).                           
000500         10  RC809-TASK-NUMBER        PIC S9(5) COMP-3.                   
000600         10  RC809-SEQ                PIC 9.                              
000700     05  RC809-QUEUE-REC-COUNT        PIC S9(04) COMP.                    
000800     05  RC809-PO-NBR                 PIC S9(09) COMP.                    
000900     05  RC809-REC-SEQ-NBR            PIC S9(09) COMP.                    
001000     05  RC809-OPER-UNT-ID            PIC S9(04) COMP.                    
001100     05  RC809-FCLTY-ID               PIC S9(04) COMP.                    
001200     05  RC809-PREPK-ID               PIC S9(04) COMP.                    
001300     05  RC809-DEPT-NBR               PIC X(03).                          
001400     05  RC809-PREPK-DRIVER-LINE-NBR  PIC S9(09) COMP.                    
001500     05  RC809-PURITM-LNE-NBR         PIC S9(09) COMP.                    
001600     05  RC809-DRIVER-LNE-PTR         PIC S9(04) COMP.                    
001700     05  RC809-PKGNG-CDE              PIC X(01).                          
001800     05  RC809-DISTRO-REQ-ID          PIC S9(09) COMP.                    
001900     05  RC809-PO-TYP-CDE             PIC X(01).                          
002000     05  RC809-UNITS-TO-ALLOC         PIC S9(09) COMP.                    
002100     05  RC809-OTR-SCOPE              PIC X.                              
002200         88  RC809-RECEIVER-OTR           VALUE 'R'.                      
002300         88  RC809-PO-OTR                 VALUE 'P'.                      
002400     05  RC809-STORE-PLAN-SCOPE       PIC X(01).                          
002500         88  RC809-SPECIFIC-PLAN          VALUE 'S'.                      
002600         88  RC809-MASTER-PLAN            VALUE 'M'.                      
002700     05  RC809-IMPRT-PO-IND           PIC X(01).                          
002710         88  RC809-IMPORT-YES                   VALUE 'Y'.                
002800     05  RC809-AD-ITM-IND             PIC X(01).                          
002900         88  RC809-AD-YES                       VALUE 'Y'.                
003000     05  RC809-NEW-STR-PO-IND         PIC X(01).                          
003010         88  RC809-NEW-STR-PO                   VALUE 'Y'.                
003100     05  RC809-PRORATE-IND            PIC X(01).                          
003200                                                                          
003300     05  RC809-PROCESS-IND            PIC X(03) VALUE SPACES.             
003400         88  RC809-CREATE-AUTO                 VALUE 'CRA'.               
003500         88  RC809-RESOLVE-AUTO                VALUE 'RLA'.               
003600         88  RC809-PREPACK-EDIT-ONLY           VALUE 'EDT'.               
003700     05  RC809-TROUBLE-FIELDS.                                            
003800         10  RC809-DETAILS-IND        PIC X.                              
003900             88  RC809-ADD-DETAILS        VALUE 'Y'.                      
004000             88  RC809-NO-DETAILS         VALUE 'N'.                      
004100         10  RC809-CRUD-IND           PIC X.                              
004200             88  RC809-CREATE             VALUE 'C'.                      
004300             88  RC809-UPDATE             VALUE 'U'.                      
004400             88  RC809-DELETE             VALUE 'D'.                      
004500         10  RC809-TRBL-RSN-CDE       PIC S9(4) COMP.                     
004600         10  RC809-CRE-UID            PIC X(8).                           
004700         10  RC809-NOTIF-UID          PIC X(8).                           
004800         10  RC809-FREEFORM-TEXT      PIC X(250).                         
004900     05  RC809-OUTPUT-FIELDS.                                             
005000         10  RC809-OVER-SHORT-PCT        PIC S9(4) COMP.                  
005100         10  RC809-TROUBLE-SW            PIC X(01) VALUE SPACE.           
005200             88  RC809-NO-TROUBLE                  VALUE 'N'.             
005300             88  RC809-IN-TROUBLE                  VALUE 'Y'.             
005400*                                                                         
005500         10  RC809-RETURN-DATA.                                           
005600             15  RC809-RETURN-CODE       PIC X(02).                       
005700                 88  RC809-CALL-SUCCESSFUL         VALUE '00'.            
005800                 88  RC809-DIDNT-ALLOC-DUE-TO-TRBL VALUE '01'.            
005900                 88  RC809-SHIPPING-WINDOW-ERROR   VALUE '02'.            
006000                 88  RC809-BUYER-ACTION-PENDING    VALUE '03'.            
006100                 88  RC809-TPURCHS-SELECT-NOT-FND  VALUE '1A'.            
006200                 88  RC809-RECORD-IN-PROCESS       VALUE '40'.            
006300                 88  RC809-RECORD-RESOLVED         VALUE '41'.            
006400                 88  RC809-RECORD-ACKNOWLEDGED     VALUE '42'.            
006500                 88  RC809-RECORD-NOT-RESOLVED     VALUE '43'.            
006600                 88  RC809-IN-PROC-UPDATE-NOT-FND  VALUE '44'.            
006700                 88  RC809-RESPOND-UPDATE-NOT-FND  VALUE '45'.            
006800                 88  RC809-ACKNWLG-UPDATE-NOT-FND  VALUE '45'.            
006900                 88  RC809-RESOLVE-UPDATE-NOT-FND  VALUE '47'.            
007000                 88  RC809-DUPLICATE-TROUBLE       VALUE '50'.            
007100                 88  RC809-TTRBNTF-UPDATE-NOT-FND  VALUE '51'.            
007200                 88  RC809-SKU-NOT-FOUND-FOR-LINE  VALUE '60'.            
007300                 88  RC809-PRORATE-ERROR VALUES '61' THRU '69'.           
007400                 88  RC809-RECEIVER-NOT-PREPACK    VALUE '61'.            
007500                 88  RC809-DRIVER-LINE-MISSING     VALUE '62'.            
007600                 88  RC809-TROUBLE-PREVENTS-ALLOC  VALUE '63'.            
007700                 88  RC809-DB2-TIMEOUT-ERROR       VALUE '64'.            
007800                 88  RC809-DB2-SQL-ERROR           VALUE '65'.            
007900                 88  RC809-DB2-UNRECOVERABLE-ERROR VALUE '66'.            
007910                 88  RC809-OTR-ERROR               VALUE '67'.            
007920                 88  RC809-INVALID-PRORATION       VALUE '68'.            
008000                 88  RC809-SYSTEM-ERROR            VALUE '69'.            
008100             15  RC809-RETURN-MSG        PIC X(40).                       
008200                                                                          
008300         10  RC809-SQLCODE               PIC ZZZZZZZZ9-.                  
008400         10  RC809-SQLCA                 PIC X(150).                      
008500                                                                          
008600         10  FILLER.                                                      
008700             15  RC809-ABEND-ACTION-IND                                   
008800                                      PIC X(01).                          
008900                 88  RC809-NO-DISTRO               VALUE 'D'.             
009000                 88  RC809-INVALID-DISTRO          VALUE 'I'.             
009100                 88  RC809-CROAK                   VALUE 'C'.             
009200                 88  RC809-SOFT-ABORT              VALUE 'S'.             
009300             15  RC809-SEVERITY-IND   PIC X(01).                          
009400                 88  RC809-FATAL-ERROR             VALUE 'F'.             
009500                 88  RC809-WARNING-ERROR           VALUE 'W'.             
009600             15  RC809-MSG-NUMBER     PIC 9(05).                          
009700         10  RC809-LINES-IN-TRBL-COUNT                                    
009800                                      PIC S9(04) COMP.                    
009900         10  RC809-PREPK-TRBL-SW      PIC X(01).                          
010000             88  RC809-CREATE-DC-BAD-PACK          VALUE 'Y'.             
010100     05  RC809-PREPACK-RETURN-AREA.                                       
010200         10  RC809-PREPACK-PGM-NBR    PIC 9(3) VALUE ZERO.                
010300         10  RC809-PREPACK-ERROR-NBR  PIC 9(3) VALUE ZERO.                
010400     05  FILLER                       PIC X(53).                          
