000100******************************************************************        
000200**                        RCWS017                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **        
000500**  PACK SLIP SYSTEM AND RECEIVER SYSTEM                        **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  RC017-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC X(01).                
001100             15  RC017-PO-NBR                   PIC S9(09) COMP.          
001200             15  RC017-REC-SEQ-NBR              PIC S9(09) COMP.          
001300             15  RC017-OPER-UNT-ID              PIC S9(04) COMP.          
001400             15  RC017-FCLTY-ID                 PIC S9(04) COMP.          
001500             15  RC017-PKSL-NBR                 PIC X(10).                
001600             15  RC017-BOL-NBR                  PIC X(30).                
001700             15  RC017-PRO-NBR                  PIC X(22).                
001800             15  RC017-OWNER-SCAC-ID            PIC X(04).                
001900             15  RC017-VEH-NBR                  PIC X(10).                
002000             15  RC017-ARRIVAL-DTE              PIC X(10).                
002100             15  RC017-PRE-TKT-IND              PIC X(01).                
002200             15  RC017-TKT-TYP-DESC             PIC X(06).                
002300             15  RC017-AD-INFO-DESC             PIC X(04).                
002400             15  RC017-EXPTED-CART-CNT          PIC S9(09) COMP.          
002500             15  RC017-PKSL-STAT-CDES.                                    
002600                 20  RC017-AC-STAT              PIC X(02).                
002700                 20  RC017-IN-STAT              PIC X(02).                
002800                 20  RC017-IP-STAT              PIC X(02).                
002900                 20  RC017-CM-STAT              PIC X(02).                
003000                 20  RC017-VE-STAT              PIC X(02).                
003100             15  RC017-STR-NBR                  PIC S9(04) COMP.          
003200             15  RC017-SEQ-NBR                  PIC S9(04) COMP.          
003300             15  RC017-PO-LNE-NBR               PIC S9(04) COMP.          
003400             15  RC017-NUMBER-OF-SELECTED-ITEMS PIC S9(09) COMP-3.        
003500             15  RC017-NUMBER-OF-TS-ITEMS       PIC S9(05) COMP-3.        
003600             15  RC017-SEL-QUEUE-NAME           PIC X(08).                
003700             15  RC017-FCLTY-NME                PIC X(25).                
003800             15  RC017-ORIGIN-SCAC-ID           PIC X(04).                
003900             15  RC017-STATUS                   PIC X(02).                
004000             15  RC017-FILLER                   PIC X(01).                
004100             15  RC017-PACK-BY-ST-SW            PIC X(01).                
004200                 88  RC017-PACK-BY-STORE        VALUE 'Y'.                
004300                 88  RC017-NOT-PACK-BY-STORE    VALUE 'N'.                
004400             15  RC017-ADJ-CYC-NBR              PIC S9(09) COMP.          
004500             15  RC017-TROUBLE-UPDATE-SW    PIC X(01).                    
004600                 88  RC017-TROUBLE-UPDATED      VALUE 'Y'.                
004700                 88  RC017-TROUBLE-NOT-UPDATED  VALUE 'N'.                
004800             15  RC017-TRB-QUEUE-NAME           PIC X(08).                
004900             15  FILLER                         PIC X(08).                
