00001      EJECT                                                        04/20/94
00002 *****************************************************************         
00003 *                        R C W S 8 0 0                          *    LV004
00004 *****************************************************************         
00005 *  THIS COPYBOOK CONTAINS THE COMMON DATA TO BE SHARED BY ALL   *         
00006 *  MODULES IN THE PREPACK SYSTEM                                *         
00007 *****************************************************************         
00008          10  RC800-INTER-APPL-COMMAREA REDEFINES                          
00009              INTER-APPL-COMM-AREA.                                        
00010                                                                           
                   15  FILLER                         PIC X(1).                 
                   15  RC800-KEY.                                               
                       20  RC800-REC-NBR-N            PIC S9(09) COMP.          
                       20  RC800-REC-SEQ-NBR-N        PIC S9(09) COMP.          
                       20  RC800-LINE-NBR-N           PIC S9(04) COMP.          
                       20  RC800-OPER-UNIT-ID         PIC S9(04) COMP.          
                       20  RC800-FACILITY-ID          PIC S9(04) COMP.          
                   15  RC800-REC-STATUS               PIC X(02).                
                   15  RC800-PACK-ID                  PIC 9(03).                
                   15  RC800-PACK-TYPE                PIC X(01).                
                   15  RC800-PACK-TYPE-DESC           PIC X(20).                
                   15  RC800-VENDOR-NAME              PIC X(25).                
                   15  RC800-PREPACK-DESC             PIC X(36).                
                   15  RC800-INNER-PACK-QTY           PIC 9(03).                
                                                                                
                   15  FILLER                         PIC X(079).               
                                                                                
      *-->         THIS IS THE AREA THAT IS POPULATED BY LIST PROGRAMS          
      *-->         AND READ BY DETAIL PROGRAMS AND THE PRINT CRITERIA           
      *-->         SPEC PROGRAM.                                                
      *-->                                                                      
                   15  RC800-TS-SELECTION-DATA.                                 
                       20  RC800-SEL-QUEUE-NAME       PIC X(8).                 
                       20  RC800-NUMBER-OF-SELECTED-ITEMS                       
                                                      PIC S9(04) COMP.          
                       20  RC800-NUMBER-OF-TS-ITEMS   PIC S9(04) COMP.          
                       20  RC800-TS-ITEM-NUMBER       PIC S9(04) COMP.          
                       20  RC800-IDX                  PIC S9(04) COMP.          
