000100*  TEMP STORAGE LAYOUT FOR 1 LINE IN A PACK                               
000200*  ANY CHANGES TO THIS LAYOUT MUST BE DUPLICATED IN RCWS808               
000300 01  RC810-TEMP-STORAGE-RECORD.                                           
000400     05  RC810-PACK-LINE.                                                 
000500         10  RC810-LINE-ERROR-IND     PIC X(01).                          
000600         10  RC810-PRPK-LNE-NBR       PIC S9(09) COMP.                    
000700         10  RC810-PKSL-ITM-QTY       PIC S9(09) COMP.                    
000800         10  RC810-DTL-CK-ITM-QTY     PIC S9(09) COMP.                    
000900         10  RC810-CURR-SPLIT-QTY     PIC S9(09) COMP.                    
001000         10  RC810-CASE-PACK-QTY      PIC S9(04) COMP.                    
001100         10  RC810-INNR-PACK-QTY      PIC S9(04) COMP.                    
001200         10  RC810-DRV-LNE-CDE        PIC X(01).                          
001300         10  RC810-RECITM-RATO-QTY    PIC S9(04) COMP.                    
001400         10  RC810-PURITM-RATO-QTY    PIC S9(04) COMP.                    
001500         10  RC810-BEST-CASE-UNITS    PIC S9(07) COMP.                    
001600         10  RC810-ODD-UNITS          PIC S9(05) COMP.                    
001700         10  RC810-LNE-DISTRO-QTY     PIC S9(09) COMP.                    
001800         10  RC810-LNE-OTR-QTY        PIC S9(09) COMP.                    
001900         10  RC810-LNE-OTR-PACK-QTY   PIC S9(09) COMP.                    
002000         10  RC810-ALLOC-OUTR-PK-QTY  PIC S9(05) COMP-3.                  
002100         10  RC810-PK-SIZE-RND-CDE    PIC X(01).                          
002200         10  RC810-AD-ITM-IND         PIC X(01).                          
002300             88  RC810-AD-NO                       VALUE 'N'.             
002400             88  RC810-AD-YES                      VALUE 'Y'.             
002500         10  RC810-PRORATE-IND        PIC X(1).                           
002600                                                                          
002700         10  RC810-PACK-STORE-TABLE OCCURS 200 TIMES                      
002800                 INDEXED BY RC810-STR-IDX.                                
002900             15  RC810-STR-PROCESS-IND                                    
003000                                      PIC X(01).                          
003100             15  RC810-STR-NBR        PIC S9(04) COMP.                    
003200             15  RC810-ALLOC-UNITS    PIC S9(09) COMP.                    
003300             15  RC810-STR-DISTRO-QTY PIC S9(09) COMP.                    
003400             15  RC810-STR-DISTRO-PK  PIC S9(09) COMP.                    
003500             15  RC810-ALLOC-SEQ-CDE  PIC X(01).                          
003600             15  RC810-RNK-SEQ-NBR    PIC S9(04) COMP.                    
003700             15  RC810-STR-CNSTR-CDE  PIC X(1).                           
003800             15  RC810-STR-CNSTR-QTY  PIC S9(9) COMP.                     
003900             15  RC810-STR-OTR-PK     PIC S9(9) COMP.                     
004000             15  RC810-STR-OTR-QTY    PIC S9(9) COMP.                     
