00001                                                                   04/13/94
00002  01  RC016-DC-SELECT-RECORD.                                      RCWS016 
00003      05  RC016-SELECTED-ITEMS         PIC S9(5) VALUE ZERO           LV002
00004                                                 COMP-3.           RCWS016 
00005      05  RC016-MAX-ITEMS              PIC 99    VALUE 20.         RCWS016 
00006      05  RC016-SELECTED-ITEM-ARRAY.                               RCWS016 
00007          10  FILLER                   OCCURS 20 TIMES             RCWS016 
00008                                       INDEXED BY RC016-IDX.       RCWS016 
00009              15  RC016-ITEM           PIC S9(9) COMP-3.           RCWS016 
00010              15  RC016-ACTION-SW      PIC X.                      RCWS016 
00011                  88  RC016-INQ                  VALUE 'I'.        RCWS016 
00012                  88  RC016-UPD                  VALUE 'U'.        RCWS016 
00013                  88  RC016-DEL                  VALUE 'D'.        RCWS016 
00014                  88  RC016-ERR                  VALUE 'E'.        RCWS016 
00015              15  RC016-KEY-DATA.                                  RCWS016 
00016                  20  RC016-PO-LNE-NBR PIC 9(09).                     CL**2
00017                  20  RC016-UNT-QTY    PIC X(09).                     CL**2
00018                  20  RC016-CLASS      PIC X(02).                     CL**2
00019                  20  RC016-SKU        PIC X(03).                     CL**2
00020                  20  RC016-UPC        PIC X(13).                     CL**2
00021                  20  RC016-VEND-STYL  PIC X(08).                     CL**2
00022                  20  RC016-SIZE       PIC X(03).                     CL**2
00023                  20  RC016-COLOR      PIC X(03).                     CL**2
00024                  20  RC016-UNT-RTL-PR PIC 9(06)V99.                  CL**2
00025                  20  RC016-GP-RTL-DSPLY PIC X(08).                   CL**2
00026                  20  RC016-OPT-BLK    PIC X(08).                     CL**2
00027                  20  RC016-ITM-NBR    PIC 9(15).                     CL**2
