000100******************************************************************12/04/95
000200**                        RCWS289                               **        
000300**                                                              **        
000400**  THIS IS THE COMMAREA LAYOUT USED TO PASS INFORMATION TO     **        
000500**  PCKCS200 WHICH PERFORMS THE VERIFICATION PROCESS.           **        
000600**  LENGTH:  100 BYTES                                          **        
000700******************************************************************        
002101 01  RC289-COMMAREA-FOR-E200.                                             
002102     05  RC289-ORD-NBR           PIC S9(9) COMP VALUE ZERO.               
002103     05  RC289-RCVR-SEQ-NBR      PIC S9(9) COMP VALUE ZERO.               
002110     05  RC289-ORD-LNE-NBR       PIC S9(4) COMP VALUE ZERO.               
002120     05  RC289-INV-CYCLE-SW      PIC  X(1)      VALUE SPACE.              
002130         88  RC289-INV-CYCLE-IN-PROCESS         VALUE 'Y'.                
002140         88  RC289-NO-INV-CYCLE                 VALUE 'N'.                
002150     05  RC289-SPLIT-PROCESS-SW  PIC  X(1)      VALUE SPACE.              
002160         88  RC289-P2L-CASE-PROCESS             VALUE 'S'.                
002170         88  RC289-P2L-PROCESS                  VALUE 'P'.                
002180         88  RC289-CASE-PROCESS                 VALUE 'C'.                
002190     05  RC289-PACKAGE-TYPE-CDE  PIC  X(1)      VALUE SPACE.              
002191         88  RC289-PBS                          VALUE 'K'.                
002192         88  RC289-BULK                         VALUE 'B'.                
002193         88  RC289-CASE                         VALUE 'C'.                
002200         88  RC289-PREPK-M-OR-I                 VALUE 'M', 'I'.           
002300     05  RC289-DISTHD-PROC-TYPE  PIC  X(1)      VALUE SPACE.              
002400         88  RC289-PREPK-DRIVER-LN              VALUE 'D'.                
002500     05  RC289-AUTOVE-PO-IND     PIC  X(1)      VALUE SPACE.              
002600         88  RC289-AUTOVE-PO-YES                VALUE 'Y'.                
002700         88  RC289-AUTOVE-PO-NO                 VALUE 'N'.                
002800     05  RC289-CALLED-BY-SWEEPER PIC  X(1)      VALUE 'N'.                
002900         88  RC289-CALLED-BY-SWEEPER-YES        VALUE 'Y'.                
003000         88  RC289-CALLED-BY-SWEEPER-NO         VALUE 'N'.                
003010     05  RC289-CALLING-PROGRAM   PIC  X(8)      VALUE SPACE.              
003011     05  RC289-USER-ID           PIC  X(8)      VALUE SPACE.              
003020     05  RC289-DC-FUNCTION-CODE  PIC  X(02).                              
003030         88  RC289-VERIF-CHECK-IN                  VALUE '01'.            
003050         88  RC289-VERIF-TRLR-UNLOAD               VALUE '03'.            
003060         88  RC289-VERIF-TRLR-UNLOAD-AT-0          VALUE '04'.            
003080         88  RC289-CONFIRMATION                    VALUE '06'.            
003090         88  RC289-VERIF-P2L                       VALUE '07'.            
003091         88  RC289-VERIF-SWEEPER                   VALUE '08'.            
003092         88  RC289-VERIF-HOT-COMPLETE              VALUE '09'.            
003093         88  RC289-VERIF-HOT-COMPLETE-0            VALUE '10'.            
003100     05  FILLER                  PIC  X(66).                              
