002200 01  RC035-DATA.                                                          
002300     05  RC035-LENGTH                 PIC S9(04) COMP.                    
002301     05  RC035-TARGET-SIZE            PIC 999.                            
002302     05  RC035-STRING-LENGTH          PIC 999.                            
002303     05  RC035-STRING                 PIC X(500).                         
002304     05  RC035-RETURN-AREA.                                               
002306         10  RC035-SEGMENT-COUNT      PIC 999.                            
002307         10  RC035-OUT-STRING.                                            
002308             15 RC035-OUT-CHAR        PIC X(01)                           
002309                       OCCURS 1500 TIMES.                                 
