*          DATA SET RDKM036                                                     
        PRINT  NOGEN                                                    00002   
RDKM036 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
RD036A   DFHMDI LINE=2,                                                X00019**2
               COLUMN=1,                                               X00020   
               SIZE=(19,80),                                           X00021   
               JUSTIFY=FIRST,                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
**************  LAST NAME                                               00009   
        DFHMDF POS=(02,01),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='LAST NAME..:'                                   00037   
ALASTNM DFHMDF POS=(02,14),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,45),LENGTH=01,ATTRB=(ASKIP)                      00056   
        DFHMDF POS=(02,49),                                            C00035   
               LENGTH=03,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DL:'                                            00037   
ADRVLIC DFHMDF POS=(02,53),                                            C00054**2
               LENGTH=25,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,79),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  FIRST NAME                                              00009   
        DFHMDF POS=(03,01),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='FIRST NAME.:'                                   00037   
AFRSTNM DFHMDF POS=(03,14),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,45),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  ADDRESS 1                                               00009   
        DFHMDF POS=(04,01),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ADDRESS 1..:'                                   00037   
AADDLN1 DFHMDF POS=(04,14),                                            C00054**2
               LENGTH=40,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,55),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  ADDRESS 2                                               00009   
        DFHMDF POS=(05,01),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ADDRESS 2..:'                                   00037   
AADDLN2 DFHMDF POS=(05,14),                                            C00054**2
               LENGTH=40,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,55),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  CITY                                                    00009   
        DFHMDF POS=(06,01),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CITY.......:'                                   00037   
ACITYNM DFHMDF POS=(06,14),                                            C00054**2
               LENGTH=20,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,35),                                            C00035   
               LENGTH=06,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STATE:'                                         00037   
ASTCODE DFHMDF POS=(06,42),                                            C00054**2
               LENGTH=02,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,45),                                            C00035   
               LENGTH=04,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ZIP:'                                           00037   
APSTLCD DFHMDF POS=(06,50),                                            C00054**2
               LENGTH=11,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,62),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  CUSTOMER PHONE                                          00009   
        DFHMDF POS=(08,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CUSTOMER PHONE.:'                               00037   
APHNNBR DFHMDF POS=(08,18),                                            C00054**2
               LENGTH=26,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,45),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  STORE                                                   00009   
        DFHMDF POS=(09,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STORE..........:'                               00037   
ALOCNBR DFHMDF POS=(09,18),                                            C00054**2
               LENGTH=05,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE,                                             C00056   
               PICOUT='Z9999'                                           00056   
ALOCNAM DFHMDF POS=(09,24),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(09,56),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  RECEIPT DATE                                            00009   
        DFHMDF POS=(10,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='RECEIPT DATE...:'                               00037   
AREQDTE DFHMDF POS=(10,18),                                            C00054**2
               LENGTH=10,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(10,29),                                            C00035   
               LENGTH=09,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='REGISTER:'                                      00037   
ASTRRGT DFHMDF POS=(10,40),                                            C00054**2
               LENGTH=04,                                              C00054**2
               ATTRB=(PROT,NORM,NUM),                                  C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(10,45),                                            C00035   
               LENGTH=12,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='TRANSACTION:'                                   00037   
ATRANNO DFHMDF POS=(10,59),                                            C00054**2
               LENGTH=04,                                              C00054**2
               ATTRB=(PROT,NORM,NUM),                                  C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(10,64),                                            C00035   
               LENGTH=04,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='SEQ:'                                           00037   
ASEQNBR DFHMDF POS=(10,70),                                            C00054**2
               LENGTH=04,                                              C00054**2
               ATTRB=(PROT,NORM,NUM),                                  C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(10,75),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  REFUND AMOUNT                                           00009   
        DFHMDF POS=(12,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ORIG REFUND AMT:'                               00037   
ARFDAMT DFHMDF POS=(12,18),                                            C00054**2
               LENGTH=08,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE,                                             C00056   
               PICOUT='ZZZZZ.99'                                        00056   
        DFHMDF POS=(12,27),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  ADJUSTED REFUND AMOUNT                                  00009   
        DFHMDF POS=(12,31),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ADJ. REFUND AMT:'                               00037   
AADJAMT DFHMDF POS=(12,48),                                            C00054**2
               LENGTH=08,                                              C00054**2
               ATTRB=(UNPROT,NORM,NUM),                                C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN,                                            C00056   
               PICOUT='ZZZZZ.ZZ'                                                
        DFHMDF POS=(12,57),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  CORP EJ                                                 00009   
        DFHMDF POS=(14,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CORP EJ CHECKED:'                               00037   
ACORPEJ DFHMDF POS=(14,18),                                            C00054**2
               LENGTH=02,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,21),                                            C00035   
               LENGTH=21,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CHECK SYSTEM CHECKED:'                          00037   
ACHKSYS DFHMDF POS=(14,44),                                            C00054**2
               LENGTH=02,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,47),                                            C00035   
               LENGTH=22,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='GIFT REGISTRY CHECKED:'                         00037   
AGIFTCK DFHMDF POS=(14,71),                                            C00054**2
               LENGTH=02,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,74),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  APPROVAL CODE                                           00009   
        DFHMDF POS=(16,01),                                            C00035   
               LENGTH=16,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STATUS CODE....:'                               00037   
ASTATCD DFHMDF POS=(16,18),                                            C00054**2
               LENGTH=01,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
ACDEDES DFHMDF POS=(16,20),                                            C00054**2
               LENGTH=10,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(16,31),                                            C00035   
               LENGTH=19,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STATUS CHANGE DATE:'                            00037   
ACNGDTE DFHMDF POS=(16,52),                                            C00054**2
               LENGTH=10,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(16,63),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************  CHECK DATE                                              00009   
        DFHMDF POS=(18,01),                                            C00035   
               LENGTH=11,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CHECK DATE:'                                    00037   
ACKDATE DFHMDF POS=(18,13),                                            C00054**2
               LENGTH=10,                                              C00054**2
               ATTRB=(PROT,NORM),                                      C00054**2
               COLOR=BLUE                                               00056   
        DFHMDF POS=(18,24),                                            C00035   
               LENGTH=07,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CHECK#:'                                        00037   
ACHKNBR DFHMDF POS=(18,32),                                            C00054**2
               LENGTH=07,                                              C00054**2
               ATTRB=(PROT,NORM,NUM),                                  C00054**2
               COLOR=BLUE,                                             C00056   
               PICOUT='ZZZZZZZ'                                         00056   
        DFHMDF POS=(18,40),                                            C00035   
               LENGTH=05,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='KMRC:'                                          00037   
AKMRCNO DFHMDF POS=(18,46),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(18,77),LENGTH=01,ATTRB=(ASKIP)                      00056   
**************                                                          00270   
        DFHMSD TYPE=FINAL                                               00269   
        END                                                             00271   
