*          DATA SET RDKM034                                                     
        PRINT  NOGEN                                                    00002   
RDKM034 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
RD034A   DFHMDI LINE=2,                                                X00019**2
               COLUMN=1,                                               X00020   
               SIZE=(19,80),                                           X00021   
               JUSTIFY=FIRST,                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
         DFHMDF ATTRB=(PROT,BRT),                                      X00025   
               INITIAL='SPECIFY CRITERIA FOR REQUEST',                 X00026**2
               LENGTH=28,                                              X00027**2
               COLOR=NEUTRAL,                                          X00028   
               POS=(02,01)                                              00029**2
**************  DRIVERS LICENSE                                         00009   
        DFHMDF POS=(04,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DRIVER LICENSE...:'                             00037   
ADRVLIC DFHMDF POS=(04,21),                                            C00054**2
               LENGTH=25,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,47),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  SOCIAL SECURITY                                         00009   
        DFHMDF POS=(05,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='SOCIAL SECURITY #:'                             00037   
ASSNNBR DFHMDF POS=(05,21),                                            C00054**2
               LENGTH=09,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,31),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  LAST NAME                                               00009   
        DFHMDF POS=(06,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='LAST NAME........:'                             00037   
ALSTNM  DFHMDF POS=(06,21),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,52),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  FIRST NAME                                              00009   
        DFHMDF POS=(07,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='FIRST NAME.......:'                             00037   
AFRSTNM DFHMDF POS=(07,21),                                            C00054**2
               LENGTH=30,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,52),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  RECEIPT DATE                                            00009   
        DFHMDF POS=(09,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='RECEIPT DATE.....:'                             00037   
AREQDTE DFHMDF POS=(09,21),                                            C00054**2
               LENGTH=08,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,30),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
        DFHMDF POS=(09,32),                                            C00035   
               LENGTH=08,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='MMDDCCYY'                                       00037   
**************  STORE                                                   00009   
        DFHMDF POS=(10,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STORE............:'                             00037   
ASTRNBR DFHMDF POS=(10,21),                                            C00054**2
               LENGTH=05,                                              C00054**2
               ATTRB=(UNPROT,NORM,NUM),                                C00054**2
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZZ9',                                         C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,27),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  TERMINAL                                                00009   
        DFHMDF POS=(11,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='TERMINAL.........:'                             00037   
ASTRRGT DFHMDF POS=(11,21),                                            C00054**2
               LENGTH=04,                                              C00054**2
               ATTRB=(UNPROT,NORM,NUM),                                C00054**2
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZ9',                                          C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,26),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  TRANSACTION                                             00009   
        DFHMDF POS=(12,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='TRANSACTION......:'                             00037   
ARGTTRN DFHMDF POS=(12,21),                                            C00054**2
               LENGTH=04,                                              C00054**2
               ATTRB=(UNPROT,NORM,NUM),                                C00054**2
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZ9',                                          C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(12,26),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  ADDRESS                                                 00009   
        DFHMDF POS=(14,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='ADDRESS..........:'                             00037   
AADDRSS DFHMDF POS=(14,21),                                            C00054**2
               LENGTH=40,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(14,62),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
**************  APPROVAL CODE                                           00009   
        DFHMDF POS=(16,01),                                            C00035   
               LENGTH=18,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STATUS CODE......:'                             00037   
ASTATCD DFHMDF POS=(16,21),                                            C00054**2
               LENGTH=01,                                              C00054**2
               ATTRB=(UNPROT,NORM),                                    C00054**2
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                              00056   
        DFHMDF POS=(16,23),                                            C00057   
               LENGTH=01,                                              C00057   
               ATTRB=(ASKIP),                                          C00035   
               COLOR=NEUTRAL                                            00036   
        DFHMDF POS=(16,25),                                            C00035   
               LENGTH=46,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL=' A-APPROVED     P-PENDING     M-KMRC         '  00037   
        DFHMDF POS=(17,25),                                            C00035   
               LENGTH=46,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL=' E-MDSE XCHNG   B-BANK CARD   V-VOID         '  00037   
        DFHMDF POS=(18,25),                                            C00035   
               LENGTH=46,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL=' K-KOHLS CHRG   O-ORIG MDSE   D-DENIED       '  00037   
        DFHMDF POS=(19,25),                                            C00035   
               LENGTH=46,                                              C00035   
               ATTRB=(ASKIP,NORM),                                     C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL=' C-CASH PAID    S-STORE HANDLED              '  00037   
**************                                                          00270   
        DFHMSD TYPE=FINAL                                               00269   
        END                                                             00271   
