*          DATA SET RDKM027    AT LEVEL 001 AS OF 11/20/96                      
*-------------------------------------------------------------------*   00001   
*                                                                   *   00002   
*        MAPSET  RDKM027                                            *   00003   
*        MAP     RD027A                                             *   00004   
*        PROGRAM RDKCS027                                           *   00005   
*        TRANSID U027 - COMMENT SCREEN                              *   00006   
*        SYSTEM  RD - REFUND                                        *   00007   
*                                                                   *   00008   
*-------------------------------------------------------------------*   00009   
        PRINT  NOGEN                                                    00010   
RDKM027 DFHMSD TYPE=DSECT,                                             C00011   
               LANG=COBOL,                                             C00012   
               MODE=INOUT,                                             C00013   
               STORAGE=AUTO,                                           C00014   
               TERM=3270-2,                                            C00015   
               TIOAPFX=YES                                              00016   
**************                                                          00017   
RD027A  DFHMDI LINE=2,COLUMN=1,                                        C00018   
               SIZE=(19,80),                                           C00019   
               CTRL=(FREEKB),                                          C00020   
               MAPATTS=(COLOR,HILIGHT),                                C00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
**************                                                          00023   
        DFHMDF POS=(02,03),LENGTH=08,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='CARD ID:'                         00025   
ACARDID DFHMDF POS=(02,12),LENGTH=13,ATTRB=(ASKIP,BRT),                C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
ADATE01 DFHMDF POS=(04,03),LENGTH=17,ATTRB=(ASKIP,BRT),                C00043   
               COLOR=BLUE                                               00044   
AURID01 DFHMDF POS=(04,36),LENGTH=08,ATTRB=(ASKIP,BRT),                C00049   
               COLOR=NEUTRAL                                            00050   
AUSER01 DFHMDF POS=(04,45),LENGTH=08,ATTRB=(ASKIP,BRT),                C00052   
               COLOR=BLUE                                               00053   
*                                                                       00048   
ALIN101 DFHMDF POS=(05,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00077   
               INITIAL=' ',                                            C00078   
               LENGTH=1,                                               C00079   
               POS=(05,73)                                              00080   
ALIN201 DFHMDF POS=(06,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00077   
               INITIAL=' ',                                            C00078   
               LENGTH=1,                                               C00079   
               POS=(06,73)                                              00080   
ALIN301 DFHMDF POS=(07,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00077   
               INITIAL=' ',                                            C00078   
               LENGTH=1,                                               C00079   
               POS=(07,73)                                              00080   
ALIN401 DFHMDF POS=(08,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
        DFHMDF ATTRB=(ASKIP,DRK),                                      C00077   
               INITIAL=' ',                                            C00078   
               LENGTH=1,                                               C00079   
               POS=(08,73)                                              00080   
*                                                                       00048   
ADATE02 DFHMDF POS=(09,03),LENGTH=17,ATTRB=(ASKIP,BRT),                C00043   
               COLOR=BLUE                                               00044   
AURID02 DFHMDF POS=(09,36),LENGTH=08,ATTRB=(ASKIP,BRT),                C00049   
               COLOR=NEUTRAL                                            00050   
AUSER02 DFHMDF POS=(09,45),LENGTH=08,ATTRB=(ASKIP,BRT),                C00052   
               COLOR=BLUE                                               00053   
*                                                                       00048   
ALIN102 DFHMDF POS=(10,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN202 DFHMDF POS=(11,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN302 DFHMDF POS=(12,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN402 DFHMDF POS=(13,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
*                                                                       00048   
ADATE03 DFHMDF POS=(14,03),LENGTH=17,ATTRB=(ASKIP,BRT),                C00043   
               COLOR=BLUE                                               00044   
AURID03 DFHMDF POS=(14,36),LENGTH=08,ATTRB=(ASKIP,BRT),                C00049   
               COLOR=NEUTRAL                                            00050   
AUSER03 DFHMDF POS=(14,45),LENGTH=08,ATTRB=(ASKIP,BRT),                C00052   
               COLOR=BLUE                                               00053   
*                                                                       00048   
ALIN103 DFHMDF POS=(15,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN203 DFHMDF POS=(16,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN303 DFHMDF POS=(17,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
ALIN403 DFHMDF POS=(18,07),LENGTH=65,ATTRB=(ASKIP,BRT),                C00063   
               COLOR=BLUE                                               00064   
*                                                                       00048   
*                                                                       00113   
**************                                                          00313   
        DFHMSD TYPE=FINAL                                               00314   
**************                                                          00315   
        END                                                             00316   
