  PRINT  NOGEN                                                          00001   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00002   
*                                                                       00003   
*    MAPSET   RDKM021                                                   00004**2
*    MAP      RD021A                                                    00005**2
*    PROGRAM  RDKCS021                                                  00006**2
*    TRANSID  U021                                                      00007**2
*    SYSTEM   RD - CASH REFUND                                          00008   
*                                                                       00009   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00010   
RDKM021  DFHMSD TYPE=&SYSPARM,                                         X        
               CTRL=(FREEKB),                                          X        
               TERM=3270-2,                                            X        
               EXTATT=YES,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               STORAGE=AUTO                                             00018   
RD021A   DFHMDI LINE=2,                                                X        
               COLUMN=1,                                               X        
               SIZE=(19,80),                                           X        
               JUSTIFY=FIRST,                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                   00024   
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='SPECIFY THE REQUESTED CONTROL NUMBERS',        X        
               LENGTH=37,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(04,1)                                               00029**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' CARD TYPE.......:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(05,08)                                              00034**2
ACRDTYP  DFHMDF ATTRB=(PROT),                                          X        
               LENGTH=20,                                              X        
               COLOR=BLUE,                                             X        
               POS=(05,27)                                              00039**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(05,48),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' CARD NUMBER.....:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,08)                                              00034**2
ADNBFR   DFHMDF ATTRB=(UNPROT,IC),                                     X        
               LENGTH=30,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(06,27)                                              00039**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(06,58),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                         
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='THRU',                                         X        
               LENGTH=04,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,61)                                              00044**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(06,67),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
ADNBTO   DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=30,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(07,27)                                              00049**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(07,58),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' CONTROL NUMBER..:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(08,08)                                              00034**2
ADCDFR   DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=14,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZZZZZZZZZ',                                X        
               POS=(08,27)                                              00039**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(08,42),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='THRU',                                         X        
               LENGTH=04,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(08,47)                                              00044**2
ADCDTO   DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=14,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZZZZZZZZZ',                                X        
               POS=(08,53)                                              00049**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(08,68),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' NUMBER REQUESTED:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(09,08)                                              00034**2
ANBRREQ  DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=06,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZZZ',                                        X        
               POS=(09,27)                                              00039**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(09,34),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='SPECIFY THE STORE TO BE',                      X        
               LENGTH=23,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,01)                                              00058**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='ASSIGNED TO THE ABOVE RANGE',                  X        
               LENGTH=27,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,25)                                              00063**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' REQUESTED STORE.:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(12,08)                                              00068**2
ADSTR    DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=5,                                               X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(12,27)                                              00073**2
ADSTRN   DFHMDF ATTRB=(PROT),                                          X        
               LENGTH=20,                                              X        
               COLOR=BLUE,                                             X        
               POS=(12,33)                                              00077**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(12,54),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='SPECIFY THE FOLLOWING TO ACTIVATE/ISSUE',      X        
               LENGTH=39,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(14,01)                                              00058**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL='THE ABOVE RANGE',                              X        
               LENGTH=15,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(14,41)                                              00063**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ISSUE STORE.....:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(15,08)                                              00068**2
AISUSTR  DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=5,                                               X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(15,27)                                              00073**2
ASTRDES  DFHMDF ATTRB=(PROT),                                          X        
               LENGTH=20,                                              X        
               COLOR=BLUE,                                             X        
               POS=(15,33)                                              00077**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(15,54),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' TERMINAL........:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(16,08)                                              00068**2
ATERM    DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=4,                                               X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZ9',                                          X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,27)                                              00073**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(16,32),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' TRANSACTION.....:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(17,08)                                              00068**2
ATRAN    DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=4,                                               X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZ9',                                          X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,27)                                              00073**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(17,32),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMDF ATTRB=(PROT,BRT),                                      X        
               INITIAL=' ISSUE AMOUNT....:',                           X        
               LENGTH=18,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(18,08)                                              00068**2
AISUAMT  DFHMDF ATTRB=(UNPROT),                                        X        
               LENGTH=7,                                               X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='ZZZZ.99',                                       X        
               POS=(18,27)                                              00073**2
         DFHMDF ATTRB=(ASKIP),                                         X        
               POS=(18,35),                                            X        
               INITIAL=' ',                                            X        
               LENGTH=1                                                 00053**2
         DFHMSD TYPE=FINAL                                              00078   
         END                                                            00079   
