*          DATA SET RDKM000    AT LEVEL 007 AS OF 02/25/92                      
*********************************************************************** 00001**6
*                                                                       00002   
*       MAPSET  - RDKM000                                               00003**6
*       MAP     - RD000A                                                00004**6
*       SYSTEM  - CASH REFUND AUTHORIZATION                             00005**6
*       PROGRAM - RDKCS000 - MAIN MENU                                  00006**6
*       TRANSID - U000                                                  00007**6
*                                                                       00008   
*********************************************************************** 00009**6
        PRINT NOGEN                                                     00010   
RDKM000 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00011**2
RD000A  DFHMDI SIZE=(24,80),CTRL=(FREEKB,FRSET),LINE=1,COLUMN=1,       X00012**2
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT),         X00013   
               EXTATT=YES                                               00014   
*********************************************************************** 00015**6
ADATE   DFHMDF POS=(1,2),LENGTH=8,ATTRB=(ASKIP,BRT)                     00016**7
        DFHMDF POS=(1,18),LENGTH=25,ATTRB=(ASKIP,BRT),                 X00017**7
               INITIAL='KOHLS DEPARTMENT STORES -'                      00018   
        DFHMDF POS=(1,44),LENGTH=11,ATTRB=(ASKIP,BRT),                 X00019**7
               INITIAL='CASH REFUND'                                    00020**2
        DFHMDF POS=(1,71),LENGTH=8,ATTRB=(ASKIP,BRT,FSET),             X00021**7
               INITIAL='RDKCS000'                                       00022**2
*********************************************************************** 00023**6
ATIME   DFHMDF POS=(2,2),LENGTH=5,ATTRB=(ASKIP,BRT)                     00024**7
        DFHMDF POS=(2,32),LENGTH=9,ATTRB=(ASKIP,BRT),                  X00025**7
               INITIAL='MAIN MENU'                                      00026   
ATERM   DFHMDF POS=(2,75),LENGTH=4,ATTRB=(ASKIP,BRT)                    00027**7
*********************************************************************** 00028**6
ACPERR  DFHMDF POS=(4,51),LENGTH=28,ATTRB=(ASKIP,BRT),COLOR=YELLOW,    X00029**7
               HILIGHT=BLINK                                            00030   
*********************************************************************** 00031**6
        DFHMDF POS=(5,23),LENGTH=8,ATTRB=(ASKIP,BRT),                  X00032**7
               INITIAL='FUNCTION'                                       00033   
*********************************************************************** 00034**6
        DFHMDF POS=(7,27),LENGTH=35,ATTRB=(ASKIP,BRT),                 X00035**7
               INITIAL='1.   CUSTOMER REFERENCE INQUIRY    '            00036**2
*********************************************************************** 00037**6
        DFHMDF POS=(8,27),LENGTH=35,ATTRB=(ASKIP,BRT),                 X00038**7
               INITIAL='2.   CUSTOMER REFERENCE MAINTENANCE'            00039**2
*********************************************************************** 00040**6
        DFHMDF POS=(9,27),LENGTH=35,ATTRB=(ASKIP,BRT),                 X00041**7
               INITIAL='3.   REFUND HISTORY INQUIRY        '            00042**2
*********************************************************************** 00043**6
        DFHMDF POS=(10,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00044**7
               INITIAL='4.   MANUAL CASH REFUND            '            00045**2
*********************************************************************** 00046**6
        DFHMDF POS=(11,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00047**7
               INITIAL='5.   NAME SEARCH                   '            00048**2
*********************************************************************** 00049**6
        DFHMDF POS=(12,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00050**7
               INITIAL='6.   ADDRESS SEARCH                '            00051**2
*********************************************************************** 00052**6
        DFHMDF POS=(13,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00053**7
               INITIAL='7.   CONTROLS MAINTENANCE          '            00054   
*********************************************************************** 00055**6
        DFHMDF POS=(14,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00056**7
               INITIAL='8.   DISPLAY ERRORS                '            00057**2
*********************************************************************** 00058**6
        DFHMDF POS=(15,27),LENGTH=35,ATTRB=(ASKIP,BRT),                X00059**7
               INITIAL='9.   REFERRALS NEEDING ACTION      '            00060**6
*********************************************************************** 00061**6
FUNCT   DFHMDF POS=(20,27),LENGTH=2,ATTRB=UNPROT,HILIGHT=UNDERLINE      00062**7
        DFHMDF POS=(20,30),LENGTH=24,ATTRB=(ASKIP,BRT),                X00063**7
               INITIAL='ENTER FUNCTION SELECTION'                       00064   
        DFHMDF POS=(20,56),LENGTH=1,ATTRB=ASKIP                         00065   
*********************************************************************** 00066**6
        DFHMDF POS=(23,1),LENGTH=8,ATTRB=(ASKIP,BRT),                  X00067**7
               INITIAL='PF4=EXIT'                                       00068**5
*********************************************************************** 00069**6
AMSG    DFHMDF POS=(24,1),ATTRB=(ASKIP,BRT),LENGTH=75,COLOR=RED         00070**7
*********************************************************************** 00071**6
        DFHMSD TYPE=FINAL                                               00072   
        PRINT NOGEN                                                     00073   
        END                                                             00074   
