*-------------------------------------------------------------------*   00001   
*                                                                   *   00002   
*        MAPSET  RDKM026                                            *   00003   
*        MAP     RD026A                                             *   00004   
*        PROGRAM RDKCS026                                           *   00005   
*        TRANSID U026 - KMC DETAIL INQUIRY SCREEN                   *   00006   
*        SYSTEM  RD - REFUND                                        *   00007   
*                                                                   *   00008   
*-------------------------------------------------------------------*   00009   
        PRINT  NOGEN                                                    00010   
RDKM026 DFHMSD TYPE=DSECT,                                             C00011   
               LANG=COBOL,                                             C00012   
               MODE=INOUT,                                             C00013   
               STORAGE=AUTO,                                           C00014   
               TERM=3270-2,                                            C00015   
               TIOAPFX=YES                                              00016   
**************                                                          00017   
RD026A  DFHMDI LINE=2,COLUMN=1,                                        C00018   
               SIZE=(19,80),                                           C00019   
               CTRL=(FREEKB),                                          C00020   
               MAPATTS=(COLOR,HILIGHT),                                C00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
**************                                                          00023   
        DFHMDF POS=(02,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='CARD ID......:'                   00025   
ACARDID DFHMDF POS=(02,16),LENGTH=13,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(02,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='CARD TYPE......:'                 00025   
ACRDTYP DFHMDF POS=(02,59),LENGTH=1,ATTRB=(ASKIP,NORM),                C00026   
               COLOR=BLUE                                               00027   
ACRDDES DFHMDF POS=(02,61),LENGTH=10,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(03,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='CONTROL......:'                   00025   
ACNTLID DFHMDF POS=(03,16),LENGTH=14,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(04,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='ACTIVITY TYPE:'                   00025   
AACTTYP DFHMDF POS=(04,16),LENGTH=01,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
AACTTDS DFHMDF POS=(04,18),LENGTH=07,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(04,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='ACTIVITY STATUS:'                 00025   
AACTSTA DFHMDF POS=(04,59),LENGTH=01,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
AACTSDS DFHMDF POS=(04,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(05,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='AUTH DTE/TIME:'                   00025   
AAUTHDT DFHMDF POS=(05,16),LENGTH=26,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(06,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='REVERSAL IND.:'                   00025   
AREVIND DFHMDF POS=(06,16),LENGTH=01,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
AREVDES DFHMDF POS=(06,18),LENGTH=08,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(06,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='VOID IND.......:'                 00025   
AVOIDIN DFHMDF POS=(06,59),LENGTH=01,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
AVOIDDS DFHMDF POS=(06,61),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(07,01),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='DRIVERS LICENSE:'                 00025   
ADRVLIC DFHMDF POS=(07,18),LENGTH=50,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(08,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='POS DATE.....:'                   00025   
APOSDTE DFHMDF POS=(08,16),LENGTH=10,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(08,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='POSTING DATE...:'                 00025   
APSTDTE DFHMDF POS=(08,59),LENGTH=10,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(09,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='STORE........:'                   00025   
ASTRNBR DFHMDF POS=(09,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
ASTRNAM DFHMDF POS=(09,21),LENGTH=25,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(10,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='TERMINAL.....:'                   00025   
ATERMNL DFHMDF POS=(10,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(11,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='TRANSACTION..:'                   00025   
ATRANS  DFHMDF POS=(11,16),LENGTH=04,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(12,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='OPERATOR ID..:'                   00025   
AOPERID DFHMDF POS=(12,16),LENGTH=11,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
        DFHMDF POS=(12,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='USERID.........:'                 00025   
AUSERID DFHMDF POS=(12,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
        DFHMDF POS=(13,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='APPROVED AMT.:'                   00025   
AAPPAMT DFHMDF POS=(13,16),LENGTH=11,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE,PICOUT='ZZZZZZZ.99-'                          00027   
        DFHMDF POS=(13,42),LENGTH=16,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='ORIGINAL AMOUNT:'                 00025   
AORGAMT DFHMDF POS=(13,59),LENGTH=11,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE,PICOUT='ZZZZZZZ.99-'                          00027   
*                                                                       00042   
        DFHMDF POS=(14,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00042   
               COLOR=NEUTRAL,INITIAL='ORDER NUMBER.:'                   00042   
AORDNBR DFHMDF POS=(14,16),LENGTH=40,ATTRB=(ASKIP,NORM),               C00042   
               COLOR=BLUE                                               00042   
*                                                                       00042   
        DFHMDF POS=(17,01),LENGTH=08,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL,INITIAL='COMMENT:'                         00025   
ACOMNT1 DFHMDF POS=(17,10),LENGTH=65,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00042   
ACOMNT2 DFHMDF POS=(18,10),LENGTH=65,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=BLUE                                               00027   
*                                                                       00113   
*                                                                       00308   
**************                                                          00313   
        DFHMSD TYPE=FINAL                                               00314   
**************                                                          00315   
        END                                                             00316   
