  PRINT  NOGEN                                                          00010   
*.-.-.-.-.-.-.-.-.-.-.-.--.-.-.-.-*                                     00001   
*                                 *                                     00001   
*    MAPSET   RDKM028             *                                     00003   
*    MAP      RD028A              *                                     00004   
*    PROGRAM  RDKCS028            *                                     00005   
*    TRANSID  U028                *                                     00006   
*    SYSTEM   RD - CASH REFUND    *                                     00007   
*                                 *                                     00007   
*.-.-.-.-.-.-.-.-.-.-.-.--.-.-.-.-*                                     00001   
RDKM028 DFHMSD TYPE=&SYSPARM,                                          C00011   
               CTRL=(FREEKB),                                          C00015   
               TERM=3270-2,                                            C00015   
               EXTATT=YES,                                             C00015   
               LANG=COBOL,                                             C00012   
               MODE=INOUT,                                             C00013   
               TIOAPFX=YES,                                            C00016   
               STORAGE=AUTO                                             00014   
RD028A  DFHMDI LINE=2,COLUMN=1,                                        C00018   
               SIZE=(19,80),                                           C00019   
               JUSTIFY=FIRST,                                          C00019   
               MAPATTS=(COLOR,HILIGHT),                                C00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
        DFHMDF POS=(3,2),                                              C00030   
               LENGTH=23,                                              C00031   
               INITIAL='ENTER DRIVERS LICENSE: ',                      C00032   
               ATTRB=(PROT,BRT),                                       C00034   
               COLOR=NEUTRAL                                            00035   
ADRLCN  DFHMDF POS=(3,26),                                             C00026   
               LENGTH=50,                                              C        
               ATTRB=UNPROT,                                           C        
               HILIGHT=UNDERLINE                                                
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(3,77)                                               00087**3
*                                                                       00148   
         DFHMSD TYPE=FINAL                                              00472   
         END                                                            00473   
