  PRINT  NOGEN                                                          00001   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00002   
*                                                                       00003   
*    MAPSET   RDKM032                                                   00004**2
*    MAP      RD032A                                                    00005**2
*    PROGRAM  RDKCS032                                                  00006**2
*    TRANSID  U032                                                      00007**2
*    SYSTEM   RD - CASH REFUND                                          00008   
*                                                                       00009   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00010   
RDKM032 DFHMSD TYPE=DSECT,                                             C00010   
               LANG=COBOL,                                             C00011   
               MODE=INOUT,                                             C00012   
               STORAGE=AUTO,                                           C00013   
               TERM=3270-2,                                            C00014   
               TIOAPFX=YES                                              00015   
RD032A  DFHMDI LINE=2,COLUMN=1,                                        C00016   
               SIZE=(19,80),                                           C00017   
               CTRL=(FREEKB),                                          C00018   
               MAPATTS=(COLOR,HILIGHT),                                C00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
*                                                                               
*************                                                                   
* CARD I.D. *                                                                   
*************                                                                   
        DFHMDF POS=(04,07),                                            X00026   
               LENGTH=16,                                              X00028   
               INITIAL='CARD ID........:',                             X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CRDID   DFHMDF POS=(04,24),                                            X00044**3
               LENGTH=12,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(04,37),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
*************                                                                   
* CARD TYPE *                                                                   
*************                                                                   
        DFHMDF POS=(04,47),                                            X00026   
               LENGTH=11,                                              X00028   
               INITIAL='CARD TYPE.:',                                  X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CRDTYP  DFHMDF POS=(04,59),                                            X00044**3
               LENGTH=10,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
*                                                                               
*******************                                                             
* CARD STOCK TYPE *                                                             
*******************                                                             
CRDSTTP DFHMDF POS=(04,70),                                            X        
               LENGTH=8,                                               X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(04,79),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
************************                                                        
* CONTROL NUMBER RANGE *                                                        
************************                                                        
        DFHMDF POS=(06,07),                                            X00026   
               LENGTH=16,                                              X00028   
               INITIAL='CONTROL NUMBERS:',                             X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CNTRLFM DFHMDF POS=(06,24),                                            X00044**3
               LENGTH=14,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(06,39),                                            X        
               LENGTH=4,                                               X        
               INITIAL='THRU',                                         X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                                
CNTRLTO DFHMDF POS=(06,44),                                            X        
               LENGTH=14,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(06,59),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
******************************                                                  
* STATUS CHANGE INSTRUCTIONS *                                                  
******************************                                                  
        DFHMDF POS=(09,03),                                            X00026   
               LENGTH=59,                                              X00028   
               INITIAL='SPECIFY THE NEW STATUS TO BE ASSIGNED TO THE ABX00027   
               OVE CARD(S):',                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
*                                                                               
******************                                                              
* CURRENT STATUS *                                                              
******************                                                              
        DFHMDF POS=(10,07),                                            X00026   
               LENGTH=16,                                              X00028   
               INITIAL='CURRENT STATUS.:',                             X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CRSTAT  DFHMDF POS=(10,24),                                            X00044**3
               LENGTH=2,                                               X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
*                                                                               
******************************                                                  
* CURRENT STATUS DESCRIPTION *                                                  
******************************                                                  
CRSTATD DFHMDF POS=(10,27),                                            X00044**3
               LENGTH=10,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(10,38),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
**************                                                                  
* NEW STATUS *                                                                  
**************                                                                  
        DFHMDF POS=(10,47),                                            X00026   
               LENGTH=11,                                              X00028   
               INITIAL='NEW STATUS:',                                  X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
NWSTAT  DFHMDF POS=(10,59),                                            X00044**3
               LENGTH=2,                                               X00045**2
               COLOR=GREEN,                                            X00046**2
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=UNPROT                                             00048**2
*                                                                               
**************************                                                      
* NEW STATUS DESCRIPTION *                                                      
**************************                                                      
NWSTATD DFHMDF POS=(10,62),                                            X        
               LENGTH=10,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(10,73),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
*****************************                                                   
* STORE CHANGE INSTRUCTIONS *                                                   
*****************************                                                   
        DFHMDF POS=(12,03),                                            X00026   
               LENGTH=53,                                              X00028   
               INITIAL='SPECIFY THE STORE TO BE UPDATED ON THE ABOVE CAX00027   
               RD(S):',                                                X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
*                                                                               
*****************                                                               
* CURRENT STORE *                                                               
*****************                                                               
        DFHMDF POS=(13,07),                                            X00026   
               LENGTH=16,                                              X00028   
               INITIAL='CURRENT STORE..:',                             X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CRSTR   DFHMDF POS=(13,24),                                            X00044**3
               LENGTH=4,                                               X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
*                                                                               
*****************************                                                   
* CURRENT STORE DESCRIPTION *                                                   
*****************************                                                   
CRSTRD  DFHMDF POS=(13,29),                                            X        
               LENGTH=10,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(13,40),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
*************                                                                   
* NEW STORE *                                                                   
*************                                                                   
        DFHMDF POS=(13,47),                                            X00026   
               LENGTH=11,                                              X00028   
               INITIAL='NEW STORE.:',                                  X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
NWSTR   DFHMDF POS=(13,59),                                            X00044**3
               LENGTH=4,                                               X00045**2
               COLOR=GREEN,                                            X00046**2
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=UNPROT                                             00048**2
*                                                                               
*************************                                                       
* NEW STORE DESCRIPTION *                                                       
*************************                                                       
NWSTRD  DFHMDF POS=(13,64),                                            X        
               LENGTH=10,                                              X00045**2
               COLOR=BLUE,                                             X00046**2
               ATTRB=(PROT,BRT)                                         00048**2
        DFHMDF POS=(13,75),                                            X00049**4
               LENGTH=1,                                               X00050**2
               ATTRB=(ASKIP,DRK)                                        00051**2
*                                                                               
*****************                                                               
* COMMENT LINES *                                                               
*****************                                                               
        DFHMDF POS=(16,03),                                            X00026   
               LENGTH=8,                                               X00028   
               INITIAL='COMMENT:',                                     X00027   
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT)                                        00029   
CMNT1   DFHMDF POS=(16,12),                                            X00044**3
               LENGTH=65,                                              X00045**2
               COLOR=GREEN,                                            X00046**2
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=UNPROT                                             00048**2
        DFHMDF POS=(16,78),                                            X        
               LENGTH=1,                                               X        
               ATTRB=(ASKIP,DRK)                                                
CMNT2   DFHMDF POS=(17,12),                                            X        
               LENGTH=65,                                              X00045**2
               COLOR=GREEN,                                            X00046**2
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=UNPROT                                             00048**2
        DFHMDF POS=(17,78),                                            X        
               LENGTH=1,                                               X        
               ATTRB=(ASKIP,DRK)                                                
*                                                                               
         DFHMSD TYPE=FINAL                                              00078   
         END                                                            00079   
