*          DATA SET RDKM033    AT LEVEL 005 AS OF 01/08/97                      
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  RDKM033                                            *           
*        MAP     RD033A                                             *           
*        PROGRAM RDKCS033                                           *           
*        TRANSID U033 - KMC USED CARD CORP CHECK-IN                 *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*-------------------------------------------------------------------*           
RDKM033 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=(FREEKB)                                                    
RD033A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER CARD ID TO CHECK-IN',                    X        
               LENGTH=25,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(03,03)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='CARD ID NUMBER:',                              X        
               LENGTH=15,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,12)                                                      
ACRDNUM DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=30,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(06,29)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,60)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
