  PRINT  NOGEN                                                          00001   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00002**2
*                                                                       00003**2
*    MAPSET   RDKM020                                                   00004**2
*    MAP      RD020A                                                    00005**2
*    PROGRAM  RDKCS020                                                  00006**2
*    TRANSID  U020                                                      00007**2
*    SYSTEM   RD - CASH REFUND                                          00008**2
*                                                                       00009**2
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00010**2
RDKM020  DFHMSD TYPE=&SYSPARM,                                         X00011**2
               CTRL=(FREEKB),                                          X00012   
               TERM=3270-2,                                            X00013   
               EXTATT=YES,                                             X00014   
               LANG=COBOL,                                             X00015   
               MODE=INOUT,                                             X00016   
               TIOAPFX=YES,                                            X00017   
               STORAGE=AUTO                                             00018   
RD020A   DFHMDI LINE=2,                                                X00019**2
               COLUMN=1,                                               X00020   
               SIZE=(19,80),                                           X00021   
               JUSTIFY=FIRST,                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
         DFHMDF ATTRB=(PROT,BRT),                                      X00025   
               INITIAL='SPECIFY THE CRITERIA TO BE USED',              X00026**2
               LENGTH=31,                                              X00027**2
               COLOR=NEUTRAL,                                          X00028   
               POS=(02,1)                                               00029**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00030**2
               INITIAL='TO ESTABLISH A CONTROL NUMBER RANGE',          X00031**2
               LENGTH=35,                                              X00032**2
               COLOR=NEUTRAL,                                          X00033**2
               POS=(02,33)                                              00034**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00035**2
               INITIAL='CONTROL NUMBER:',                              X00036**2
               LENGTH=15,                                              X00037**2
               COLOR=NEUTRAL,                                          X00038**2
               POS=(04,09)                                              00039**2
ADCNFR   DFHMDF ATTRB=(PROT),                                          X00040**2
               LENGTH=14,                                              X00041**2
               COLOR=BLUE,                                             X00042**2
               POS=(04,25)                                              00043**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00044   
               INITIAL='THRU',                                         X00045**2
               LENGTH=04,                                              X00046**2
               COLOR=NEUTRAL,                                          X00047   
               POS=(04,41)                                              00048**2
ADCNTO   DFHMDF ATTRB=(PROT),                                          X00049**2
               LENGTH=14,                                              X00050**2
               COLOR=BLUE,                                             X00051**2
               POS=(04,46)                                              00052**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00053**2
               INITIAL='NUMBER REQUESTED......:',                      X00054**2
               LENGTH=23,                                              X00055**2
               COLOR=NEUTRAL,                                          X00056**2
               POS=(06,01)                                              00057**2
ANBRREQ  DFHMDF ATTRB=(UNPROT,NORM),                                   X00058**2
               LENGTH=6,                                               X00059**2
               COLOR=GREEN,                                            X00060   
               HILIGHT=UNDERLINE,                                      X00061   
               POS=(06,25)                                              00062**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(06,32),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00067**2
               INITIAL='CARD PRODUCED AT......:',                      X00068**2
               LENGTH=23,                                              X00069**2
               COLOR=NEUTRAL,                                          X00070**2
               POS=(08,01)                                              00071**2
APRDR    DFHMDF ATTRB=(UNPROT,NORM),                                   X00072**2
               LENGTH=01,                                              X00073**2
               COLOR=GREEN,                                            X00060   
               HILIGHT=UNDERLINE,                                      X00061   
               POS=(08,25)                                              00075**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(08,27),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
         DFHMDF POS=(08,32),LENGTH=30,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='K - KOHLS           I - INCOMM'                 00037   
         DFHMDF POS=(09,32),LENGTH=28,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='L - VALID           M - MTL '                   00037   
         DFHMDF POS=(10,32),LENGTH=27,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='G - GIFT CERTIFICATE CENTER'                    00037   
         DFHMDF POS=(11,32),LENGTH=38,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='P - PLI CARD        B - BLACKHAWK     '         00037   
         DFHMDF POS=(12,32),LENGTH=38,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='O - OPTIMUM         J - JET LITHO     '         00037   
         DFHMDF POS=(13,32),LENGTH=18,ATTRB=(PROT,NORM),               X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='V - VIRTUAL CORP  '                             00037   
         DFHMDF ATTRB=(PROT,BRT),                                      X00067**2
               INITIAL='CARD TYPE.............:',                      X00068**2
               LENGTH=23,                                              X00069**2
               COLOR=NEUTRAL,                                          X00070**2
               POS=(14,01)                                              00071**2
ACRDTYP  DFHMDF ATTRB=(PROT,NORM),                                     X00072**2
               LENGTH=01,                                              X00073**2
               COLOR=BLUE,                                             X00060   
               POS=(14,25)                                              00075**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(14,27),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
ACRDDES  DFHMDF ATTRB=(PROT),                                          X00076**2
               LENGTH=20,                                              X00077**2
               COLOR=BLUE,                                             X00078**2
               POS=(16,29)                                              00079**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00067**2
               INITIAL='PRE-DENOMINATED AMOUNT:',                      X00068**2
               LENGTH=23,                                              X00069**2
               COLOR=NEUTRAL,                                          X00070**2
               POS=(16,01)                                              00071**2
APREAMT  DFHMDF ATTRB=(PROT,NORM),                                     X00072**2
               LENGTH=07,                                              X00073**2
               COLOR=BLUE,                                             X00060   
               PICOUT='ZZZ9.99',                                       X00061   
               POS=(16,25)                                              00075**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(16,33),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00067**2
               INITIAL='PRE-PAID CARD STOCK ID:',                      X00068**2
               LENGTH=23,                                              X00069**2
               COLOR=NEUTRAL,                                          X00070**2
               POS=(18,01)                                              00071**2
ASTKID   DFHMDF ATTRB=(PROT,NORM),                                     X00072**2
               LENGTH=08,                                              X00073**2
               COLOR=BLUE,                                             X00060   
               POS=(18,25)                                              00075**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(18,34),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
         DFHMDF ATTRB=(PROT,BRT),                                      X00067**2
               INITIAL='DESCRIPTION:',                                 X00068**2
               LENGTH=12,                                              X00069**2
               COLOR=NEUTRAL,                                          X00070**2
               POS=(18,36)                                              00071**2
ASTKDES  DFHMDF ATTRB=(PROT,NORM),                                     X00072**2
               LENGTH=25,                                              X00073**2
               COLOR=BLUE,                                             X00060   
               POS=(18,49)                                              00075**2
         DFHMDF ATTRB=(ASKIP),                                         X00063**2
               POS=(18,75),                                            X00064**2
               INITIAL=' ',                                            X00065**2
               LENGTH=1                                                 00066**2
         DFHMSD TYPE=FINAL                                              00080   
         END                                                            00081   
