001700******************************************************************00170000
001800* LAYOUT FOR CHECKPOINT RESTART PROGRAMS                          00180001
001900******************************************************************00190000
002000 01  RD039-RECORD.                                                00200001
002100     05 RD039-CUST-ID              PIC S9(10)V    COMP-3          00210002
002200                                               VALUE ZERO.        00220001
002300     05 RD039-STR-RGST-ID          PIC  9(04)  VALUE ZERO.        00230003
002400     05 RD039-RGST-TRN-NBR         PIC  9(04)  VALUE ZERO.        00240002
002500     05 RD039-RFND-SEQ-NBR         PIC  9(03)  VALUE ZERO.        00250003
002600     05 RD039-CHECK-NBR            PIC  9(09)  VALUE ZERO.        00260002
002700     05 RD039-CHECK-DATE           PIC  X(10)  VALUE SPACE.       00270002
002800******************************************************************00280004
