000100******************************************************************00010000
000200**  THIS IS THE OUTPUT RECORD LAYOUT FOR THE CHECK              **00020000
000300**  RECONCILIATION FILE SENT TO THE BANK.                       **00030000
000400**                                                              **00040000
000500**  RECORD LENGTH:  80 BYTES                                    **00050000
000600**  RECORD FORMAT:  SEQUENTIAL                                  **00060000
000700******************************************************************00070000
000800 01  RD040-DETAIL-RECORD.                                         00080000
000900     05  RD040-CHECK-NUMBER     PIC  9(06)  VALUE ZERO.           00090000
001000     05  RD040-STORNO           PIC  9(03)  VALUE ZERO.           00100001
001100     05  FILLER                 PIC  9(05)  VALUE ZERO.           00110000
001200     05  FILLER                 PIC  X(01)  VALUE SPACE.          00120000
001300     05  RD040-DUNSNO           PIC  X(09)  VALUE SPACES.         00130000
001400     05  RD040-VENDOR-NAME      PIC  X(24)  VALUE SPACES.         00140000
001500     05  RD040-FULL-CHECK-DATE PIC   9(06)  VALUE ZERO.           00150000
001600     05  FILLER                 REDEFINES RD040-FULL-CHECK-DATE.  00160000
001700         10  RD040-FULL-MONTH   PIC  9(02).                       00170000
001800         10  RD040-FULL-DAY     PIC  9(02).                       00180000
001900         10  RD040-FULL-YEAR    PIC  9(02).                       00190000
002000     05  RD040-ACCOUNT-NUMBER   PIC  9(08)  VALUE ZERO.           00200000
002100     05  FILLER                 PIC  X(04)  VALUE SPACES.         00210000
002200     05  RD040-CHECK-AMOUNT     PIC  9(07)V9(02)                  00220000
002300                                            VALUE 0.              00230000
002400     05  FILLER                 PIC  X(05)  VALUE SPACES.         00240000
002500                                                                  00250000
