00001 *                                                                 03/03/95
00002 *  THIS IS THE RECORD DEFINITION FOR THE COMMMUNICATION AREAS     RDRD000I
00003 *  AMONG THE CASH REFUND AUTHORIZATION ONLINE PROGRAMS.              LV004
00004 *                                                                    CL**1
00005 *  IF THERE ARE ANY ADDITIONAL DATA SPECIFIC TO THE PROGRAM          CL**1
00006 *  (FOR EXAMPLE THE SCREEN FIELDS) THAT HAS TO BE ADDED TO THE       CL**1
00007 *  COMMAREA, ADD IT AFTER THIS COPYBOOK AS AN '05' LEVEL AND         CL**1
00008 *  CHANGE THE VALUE OF RD000-CA-LENGTH TO THE NEW LENGTH.            CL**1
00009 *                                                                    CL**1
00010 *  THE LENGTH OF RD000I-DATA IS 105 BYTES.                           CL**1
00011 *                                                                    CL**1
00012                                                                      CL**1
00013  01  RD000I-COMMUNICATION-AREA.                                      CL**1
00014      05  RD000I-DATA.                                                CL**1
00015          10  RD000I-TRANSACTION-SCREEN     PIC X(01).                CL**1
00016              88  RD000I-INITIALIZE-SCREEN            VALUE 'S'.      CL**1
00017              88  RD000I-PROCESS-SCREEN               VALUE 'R'.      CL**1
00018          10  RD000I-LAST-PROGRAM           PIC X(08).                CL**1
00019          10  RD000I-HISTORY-KEY.                                     CL**1
00020              15  RD000I-DRIVER-LCNSE-NMBR  PIC X(21).                CL**1
00021              15  RD000I-REFERL-TMESTP      PIC X(26).                CL**1
00022          10  RD000I-LAST-NAME              PIC X(15).                CL**1
00023          10  RD000I-ADDRESS-LINE1          PIC X(30).                CL**1
00024          10  RD000I-RDKCS011-START-SW      PIC X(01)                 CL**3
00025                                                      VALUE 'Y'.      CL**1
00026              88  RD000I-RDKCS011-START               VALUE 'Y'.      CL**4
00027          10  FILLER                        PIC X(03).                CL**1
