00001 ******************************************************************10/10/91
00002 *  THIS IS THE LAYOUT FOR CASH REFUND PROCESSOR TEMPORARY         RDRD009I
00003 *  STORAGE QUEUE (INPUT USAGE), INCLUDING ALL RECORD TYPES, AND      LV005
00004 *  QUEUE DEFINITION INFORMATION.  THE FIRST ENTRY IN THE QUEUE       CL**2
00005 *  WILL ALWAYS BE THE ERROR SUMMARY RECORD, IF ANY ERRORS HAVE       CL**2
00006 *  BEEN POSTED DURING THE CURRENT CICS SESSION.                      CL**2
00007 ******************************************************************RDRD009I
00008                                                                   RDRD009I
00009  01  RD009I-REF-PROCESSOR-ERR-AREA.                                  CL**3
00010      05  RD009I-QUEUE-NAME       PIC X(8)     VALUE 'RDERRORQ'.      CL**5
00011      05  RD009I-QUEUE-NAME-LENGTH                                    CL**2
00012                                  PIC S9(4)    VALUE +8            RDRD009I
00013                                  COMP SYNC.                       RDRD009I
00014      05  RD009I-QUEUE-LENGTH     PIC S9(4)    VALUE +417             CL**4
00015                                  COMP SYNC.                       RDRD009I
00016      05  RD009I-REF-PROCESSOR-ERROR-RCD.                             CL**3
00017          10  RD009I-RECORD-TYPE  PIC X(1)     VALUE SPACE.           CL**2
00018              88  RD009I-ERROR-SUMMARY-RCD-TYPE                       CL**2
00019                                               VALUE 'S'.          RDRD009I
00020              88  RD009I-ERROR-DETAIL-RCD-TYPE VALUE 'D'.             CL**2
00021          10  RD009I-ERROR-STATUS PIC X(1)     VALUE SPACE.           CL**2
00022              88  RD009I-UNRESOLVED-ERROR      VALUE 'U'.             CL**2
00023              88  RD009I-RESOLVED-ERROR        VALUE 'R'.             CL**2
00024          10  FILLER              PIC X(415)   VALUE SPACES.          CL**4
00025      05  RD009I-ERROR-SUMMARY-RECORD                                 CL**2
00026                                  REDEFINES                        RDRD009I
00027                                   RD009I-REF-PROCESSOR-ERROR-RCD.    CL**3
00028          10  FILLER              PIC X(2).                        RDRD009I
00029          10  RD009I-UNRESOLVED-ERROR-COUNT                           CL**2
00030                                  PIC 9(7).                        RDRD009I
00031          10  FILLER              PIC X(1).                        RDRD009I
00032          10  RD009I-RESOLVED-ERROR-COUNT                             CL**2
00033                                  PIC 9(7).                        RDRD009I
00034          10  FILLER              PIC X(400).                         CL**4
00035      05  RD009I-ERROR-DETAIL-RECORD                                  CL**2
00036                                  REDEFINES                        RDRD009I
00037                                   RD009I-REF-PROCESSOR-ERROR-RCD.    CL**3
00038          10  FILLER              PIC X(2).                        RDRD009I
00039          10  RD009I-ERROR-RCD-TRANS-DETAIL.                          CL**2
00040              15  RD009I-ERROR-DATE-YYYYMMDD                          CL**2
00041                                  PIC 9999/99/99.                  RDRD009I
00042              15  RD009I-ERROR-DATE-YYYYMMDD-X                        CL**2
00043                                  REDEFINES                        RDRD009I
00044                                      RD009I-ERROR-DATE-YYYYMMDD      CL**2
00045                                  PIC X(10).                       RDRD009I
00046              15  FILLER          PIC X(1).                        RDRD009I
00047              15  RD009I-ERROR-TIME                                   CL**2
00048                                  PIC X(8).                        RDRD009I
00049              15  FILLER          PIC X(1).                        RDRD009I
00050              15  RD009I-STORE-NUMBER                                 CL**2
00051                                  PIC X(4).                        RDRD009I
00052              15  FILLER          PIC X(1).                        RDRD009I
00053              15  RD009I-TERMINAL-NUMBER                              CL**2
00054                                  PIC X(4).                        RDRD009I
00055              15  FILLER          PIC X(1).                        RDRD009I
00056              15  RD009I-TRANSACTION-NUMBER                           CL**2
00057                                  PIC X(4).                        RDRD009I
00058              15  FILLER          PIC X(1).                        RDRD009I
00059              15  RD009I-QUAL-CODE                                    CL**2
00060                                  PIC X(2).                        RDRD009I
00061              15  FILLER          PIC X(1).                        RDRD009I
00062              15  RD009I-DRIVERS-LICENSE-NUMBER                       CL**2
00063                                  PIC X(21).                       RDRD009I
00064              15  FILLER          PIC X(1).                        RDRD009I
00065              15  RD009I-REFUND-AMOUNT                                CL**2
00066                                  PIC Z(9)9.99.                    RDRD009I
00067              15  RD009I-REFUND-AMOUNT-X                              CL**2
00068                                  REDEFINES RD009I-REFUND-AMOUNT      CL**2
00069                                  PIC X(13).                       RDRD009I
00070              15  FILLER          PIC X(1).                        RDRD009I
00071              15  RD009I-ERROR-TYPE                                   CL**2
00072                                  PIC X(1).                        RDRD009I
00073                  88  RD009I-DB2-ERROR         VALUE 'D'.             CL**2
00074                  88  RD009I-AUTH-MESSAGE-ERROR                       CL**2
00075                                               VALUE 'M'.          RDRD009I
00076                  88  RD009I-SYSTEM-ERROR      VALUE 'S'.             CL**2
00077                  88  RD009I-TEMPORARY-STORAGE-ERROR                  CL**2
00078                                               VALUE 'T'.          RDRD009I
00079              15  FILLER          PIC X(1).                        RDRD009I
00080          10  RD009I-ERROR-RCD-DESCRIPTION.                           CL**2
00081              15  RD009I-ERROR-MESSAGE-1                              CL**2
00082                                  PIC X(77).                       RDRD009I
00083              15  FILLER          PIC X(1).                        RDRD009I
00084              15  RD009I-ERROR-MESSAGE-2                              CL**2
00085                                  PIC X(77).                       RDRD009I
00086              15  FILLER          PIC X(1).                        RDRD009I
00087              15  RD009I-ERROR-MESSAGE-3                              CL**2
00088                                  PIC X(77).                       RDRD009I
00089              15  FILLER          PIC X(1).                        RDRD009I
00090              15  RD009I-ERROR-MESSAGE-4                              CL**2
00091                                  PIC X(77).                       RDRD009I
00092          10  RD009I-RESOLUTION-INFORMATION.                          CL**2
00093              15  RD009I-RESOLVED-BY-USERID                           CL**2
00094                                  PIC X(8).                        RDRD009I
00095              15  FILLER          PIC X(1).                        RDRD009I
00096              15  RD009I-RESLUTN-DATE-YYYYMMDD                        CL**2
00097                                  PIC 9999/99/99.                  RDRD009I
00098              15  RD009I-RESLUTN-DATE-YYYYMMDD-X                      CL**2
00099                                  REDEFINES                        RDRD009I
00100                                      RD009I-RESLUTN-DATE-YYYYMMDD    CL**2
00101                                  PIC X(10).                       RDRD009I
00102              15  FILLER          PIC X(1).                        RDRD009I
00103              15  RD009I-RESLUTN-TIME                                 CL**2
00104                                  PIC X(8).                        RDRD009I
