000100******************************************************************00010000
000200**                        RDWS020                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  REFUND AUTHORIZATION CRITERIA SPECIFICATION.                **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  RD020-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC X(01).        00100000
001100             15  RD020-CARD-ID                  PIC 9(13).        00110000
001200             15  RD020-CARD-TYPE                PIC 9(01).        00120000
001300             15  RD020-ACTIVITY-TYPE            PIC 9(01).        00130000
001400             15  RD020-POS-DATE-ISO             PIC X(10).        00140000
001500             15  RD020-STORE-NBR                PIC 9(04).        00150000
001600             15  RD020-TERMINAL                 PIC 9(04).        00160000
001700             15  RD020-TRANSACTION              PIC 9(04).        00170000
001800             15  RD020-AMOUNT                   PIC 9(07)V99.     00180000
001900             15  RD020-DRIVERS-LICENSE          PIC X(21).        00190000
001910             15  RD020-30-DIGIT-CARD-NBR        PIC 9(30).        00200000
001900             15  RD020-DRIVERS-LICENSE-LONG     PIC X(50).        00210001
002000             15  FILLER                         PIC X(52).        00220001
