00001 *----------------------------------------------------------------*02/17/93
00002 *                         RDWS025                                *DPWS057 
00003 *                                                                *   LV007
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *DPWS057 
00005 *   MAINTENANCE PROGRAMS TO PASS THE MESSAGE NUMBER.             *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00008                                                                   DPWS057 
00009  01  RD025-CARD-SEL-REC.                                             CL**4
00010        05  RD025-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  RD025-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00013        05  RD025-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY RD025-IDX.        CL**2
00016                15  RD025-ITEM           PIC S9(09)  COMP-3.          CL**7
00022                15  RD025-KEY-DATA.                                   CL**6
00023                    20  RD025-CARD-ID    PIC X(12).                   CL**6
