000100******************************************************************00010000
000200**                        RDWS023                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT USED WITH     **00040001
000500**  THE KMRC COMMENT ADD/INQUIRY SCREEN.                        **00050001
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  RD023-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC X(01).        00100000
001100             15  RD023-CARD-ID                  PIC 9(13).        00110002
001200             15  RD023-CARD-TYPE                PIC 9(01).        00120002
001300             15  FILLER                         PIC X(53).        00130003
001400             15  RD023-30-DIGIT-CARD-NBR        PIC 9(30).        00140004
001500             15  FILLER                         PIC X(102).       00150003
