000100****************************************************************  00010000
000200* RDWS010                                                      *  00020000
000300* CASH REFUND CONSTANTS                                        *  00030050
000400*     THIS COPYLIB CONTAINS ALL THE CASH REFUND CONSTANTS.     *  00040050
000500****************************************************************  00050000
000600*  8/24/96 AJR - REMOVED THE STATUS 'CR' CREATE REQUESTED.     *  00060000
000700****************************************************************  00070000
000800*  5/27/97 CLM - WR5220 GIFT CARDS                             *  00080000
000900*                ADDED RD010-GIFT-CRD-TYP & RD010-GIFT-CRD-DESC*  00090000
001000*                CHANGED ALL GIFT-CRT REFERENCES TO GIFT-CRD   *  00100000
001100****************************************************************  00110000
001200*  7/11/97 AJR - ADDED A DATE IN WHICH THE CONTROL NUMBERS     *  00120000
001300*                CHANGED FROM 10 TO 12 DIGITS.                 *  00130000
001400****************************************************************  00140000
001500*  1/13/98 AJR - ADDED EXPIRED STATUS                          *  00150000
001600****************************************************************  00160000
001700* 11/25/98 DGM - ADDED CARD INITIALIZATION DATE   *               00170043
001800****************************************************************  00180000
001900* 01/06/00 TKMA490 - ADDED SERVICE FEES DEFAULT DATE AND AMOUNT*  00190000
002000*                    AND ACTIVITY TYPE NUMBER.                 *  00200000
002100****************************************************************  00210000
002200* 08/01/00 TKMA625 - FIXED RD010-CARD-STATUS-TABLE BUG         *  00220042
002300*                    STATUS TYPES 'BP' & 'RD' STILL HAD DESC   *  00230042
002400*                    AND OCCURS STILL SAID 8                   *  00240042
002500****************************************************************  00250042
002600* 07/29/03 BARB ERTL - ADDED CONSTANTS FOR REFUND STATUS CODE. *  00260053
002700*                      REMOVED STORED VALUE CONSTANTS.         *  00270050
002800****************************************************************  00280044
002810* 07/01/05 BARB ERTL - ADDED CONSTANTS FOR CORP REFUND REASON  *  00281055
002820*                      CODES.                                  *  00282055
002830****************************************************************  00283055
002900*   WORK AREAS                                                    00290000
003000***************************************************************   00300000
003100 01  RD010-REFUND-CODE-VALUE     PIC  X(01)  VALUE SPACES.        00310000
003200     88  RD010-VALID-REFUND-CODE             VALUE 'C' 'D' 'M'    00320000
003300                                                   'R' 'S' 'B'.   00330000
003400     88  RD010-CASH-REFUND-VALUE             VALUE 'C'.           00340000
003500     88  RD010-DISHONEST-EMPL-VALUE          VALUE 'D'.           00350000
003600     88  RD010-MAIL-REFUND-VALUE             VALUE 'M'.           00360000
003700     88  RD010-REFUSE-REFUND-VALUE           VALUE 'R'.           00370000
003800     88  RD010-SHOPLIFTER-VALUE              VALUE 'S'.           00380000
003900     88  RD010-DUEBILL-EXPLOITER-VALUE       VALUE 'B'.           00390000
004000                                                                  00400000
004100 01  RD010-REFUND-CODE-CONSTANTS.                                 00410000
004200     05  RD010-CASH-REFUND-CONST PIC  X(01)  VALUE 'C'.           00420000
004300     05  RD010-DISHONEST-EMPL-CONST                               00430000
004400                                 PIC  X(01)  VALUE 'D'.           00440000
004500     05  RD010-MAIL-REFUND-CONST PIC  X(01)  VALUE 'M'.           00450000
004600     05  RD010-REFUSE-REFUND-CONST                                00460000
004700                                 PIC  X(01)  VALUE 'R'.           00470000
004800     05  RD010-SHOPLIFTER-CONST  PIC  X(01)  VALUE 'S'.           00480000
004900     05  RD010-DUEBILL-EXPLOITER-CONST                            00490000
005000                                 PIC  X(01)  VALUE 'B'.           00500000
005100                                                                  00510000
005200 01  RD010-REFUND-CODE-DESC.                                      00520000
005300     05  RD010-CASH-REFUND-DESC  PIC  X(14)  VALUE                00530000
005400         'CASH REFUND   '.                                        00540000
005500     05  RD010-DISHONST-EMP-DESC PIC  X(14)  VALUE                00550000
005600         'DISHONEST EMPL'.                                        00560000
005700     05  RD010-MAIL-REFUND-DESC  PIC  X(14)  VALUE                00570000
005800         'MAIL REFUND   '.                                        00580000
005900     05  RD010-REFUSE-REFND-DESC PIC  X(14)  VALUE                00590000
006000         'REFUSE REFUND '.                                        00600000
006100     05  RD010-SHOPLIFTER-DESC   PIC  X(14)  VALUE                00610000
006200         'SHOPLIFTER    '.                                        00620000
006300     05  RD010-DUEB-EXPLOIT-DESC PIC  X(14)  VALUE                00630000
006400         'KMRC EXPLOITER'.                                        00640000
006500     05  RD010-UNKNOWN-CODE-DESC PIC  X(14)  VALUE                00650000
006600         'UNKNOWN       '.                                        00660000
006610                                                                  00661055
006611****************************************************************  00661159
006612*  THESE REASON CODES ARE USED IN THE AUTHORIZATION PROGRAM TO    00661259
006613*  INDICATE THE REASON A CORPORATE REFUND IS GIVEN.               00661359
006616****************************************************************  00661659
006719 01  RD010-CORP-RFND-RSN-DESC.                                    00671958
006721     05  RD010-GIFT-RCPT-ALREADY-RET PIC X(06) VALUE '800001'.    00672160
006722     05  RD010-RSN-800001-DESC       PIC X(30) VALUE              00672260
006723                         'GIFT RCPT ALREADY RETURNED    '.        00672358
006724     05  RD010-OTR-AMT-IS-ZERO       PIC X(06) VALUE '800002'.    00672460
006725     05  RD010-RSN-800002-DESC       PIC X(30) VALUE              00672560
006726                         'OTR AMT IS ZERO               '.        00672658
006727     05  RD010-CHK-K-AND-OVR25       PIC X(06) VALUE '800003'.    00672760
006728     05  RD010-RSN-800003-DESC       PIC X(30) VALUE              00672860
006729                         'CHK K AND OVER 25             '.        00672958
006730     05  RD010-CHK-G-OVR50-LT-10DAYS PIC X(06) VALUE '800004'.    00673062
006731     05  RD010-RSN-800004-DESC       PIC X(30) VALUE              00673162
006732                         'CHK G AND OVER 50 LT 10 DAYS  '.        00673262
006733     05  RD010-RETURNS-AT-ECOMM      PIC X(06) VALUE '800005'.    00673362
006734     05  RD010-RSN-800005-DESC       PIC X(30) VALUE              00673462
006735                         'RETURNS AT ECOMM STORE        '.        00673562
006736     05  RD010-CHK-D-YNSF-OVER25     PIC X(06) VALUE '800007'.    00673662
006737     05  RD010-RSN-800007-DESC       PIC X(30) VALUE              00673762
006738                         'CHK D YNSF AND OVER 25        '.        00673862
006739     05  RD010-DUMMY-ID-PRESENTED    PIC X(06) VALUE '800010'.    00673962
006740     05  RD010-RSN-800010-DESC       PIC X(30) VALUE              00674062
006741                         'DUMMY ID PRESENTED            '.        00674162
006742     05  RD010-MAIL-RFND-PRIV        PIC X(06) VALUE '800011'.    00674262
006743     05  RD010-RSN-800011-DESC       PIC X(30) VALUE              00674362
006744                         'MAIL REFUND                   '.        00674463
006745     05  RD010-DISHONEST-ASSOC-PRIV  PIC X(06) VALUE '800012'.    00674562
006746     05  RD010-RSN-800012-DESC       PIC X(30) VALUE              00674662
006747                         'DISHONEST ASSOCOCIATE         '.        00674763
006748     05  RD010-SHOPLIFTER-PRIV       PIC X(06) VALUE '800013'.    00674862
006749     05  RD010-RSN-800013-DESC       PIC X(30) VALUE              00674962
006750                         'SHOPLIFTER                    '.        00675063
006751     05  RD010-REFUSE-RFND-PRIV      PIC X(06) VALUE '800014'.    00675162
006752     05  RD010-RSN-800014-DESC       PIC X(30) VALUE              00675262
006753                         'REFUSE REFUND                 '.        00675363
006754     05  RD010-KMRC-EXPLOITER-PRIV   PIC X(06) VALUE '800015'.    00675462
006755     05  RD010-RSN-800015-DESC       PIC X(30) VALUE              00675562
006756                         'KMRC EXPLOITER                '.        00675663
006757     05  RD010-PD-RFND-CNT-GT-MAX    PIC X(06) VALUE '800016'.    00675762
006758     05  RD010-RSN-800016-DESC       PIC X(30) VALUE              00675862
006759                         'PERIOD RFND CNT GT MAX        '.        00675962
006760     05  RD010-PD-RFND-AMT-GT-MAX    PIC X(06) VALUE '800017'.    00676062
006761     05  RD010-RSN-800017-DESC       PIC X(30) VALUE              00676162
006762                         'PERIOD RFND AMT GT MAX        '.        00676262
006763     05  RD010-DAY-RFND-CNT-GT-MAX   PIC X(06) VALUE '800018'.    00676362
006764     05  RD010-RSN-800018-DESC       PIC X(30) VALUE              00676462
006765                         'DAY RFND CNT GT MAT           '.        00676562
006766     05  RD010-DAY-RFND-AMT-GT-MAX   PIC X(06) VALUE '800019'.    00676662
006767     05  RD010-RSN-800019-DESC       PIC X(30) VALUE              00676762
006768                         'DAY RFND AMT GT MAX           '.        00676862
006769     05  RD010-DAY-STR-CNT-GT-MAX    PIC X(06) VALUE '800020'.    00676962
006770     05  RD010-RSN-800020-DESC       PIC X(30) VALUE              00677062
006771                         'DAY STORE CNT GT MAX          '.        00677162
006772     05  RD010-RFND-AMT-GT-KMRC-MAX  PIC X(06) VALUE '800021'.    00677262
006773     05  RD010-RSN-800021-DESC       PIC X(30) VALUE              00677362
006774                         'RFND AMT GT KMRC MAX          '.        00677462
006775     05  RD010-TRAINING-TEST-ACCT    PIC X(06) VALUE '800022'.    00677562
006776     05  RD010-RSN-800022-DESC       PIC X(30) VALUE              00677662
006777                         'TRAINING/TEST ACCT DENIAL     '.        00677762
006778                                                                  00677862
006779 01  RD010-CORP-REFUND-REASON-TABLE                               00677962
006780     REDEFINES RD010-CORP-RFND-RSN-DESC.                          00678062
006781     05  RD010-REFUND-REASON-CODE-OCC OCCURS 19 TIMES             00678162
006782                                 INDEXED BY RD010-RFND-RSN-IDX.   00678262
006783         10  RD010-REFUND-REASON-CDE PIC X(06).                   00678362
006784         10  RD010-REFUND-REASON-DESC PIC X(30).                  00678462
006785                                                                  00678562
006786 01  RD010-REFUND-REASON-CODE-MAX PIC S9(04) COMP VALUE +19.      00678662
006790****************************************************************  00679058
006800*  THESE CODES RELATE TO THE RFND_STAT_CDE ON RDT-MAL-CK-RFND.    00680046
006900*  THERE ARE CHECK CONSTRAINTS ON THE TABLE WITH THESE CODES      00690046
007000*  AS THE ONLY CODES ALLOWED.  IF ANY CHANGES NEED TO BE MADE,    00700046
007100*  THE CHECK CONSTRAINTS ON THE TABLE ALSO NEED TO BE CHANGED.    00710046
007200****************************************************************  00720046
007300 01  RD010-REFUND-STATUS-CODE.                                    00730048
007400     05  RD010-DENIED            PIC  X(01)  VALUE 'D'.           00740044
007500     05  RD010-DENIED-DESC       PIC  X(12)  VALUE                00750044
007600         'DENIED      '.                                          00760044
007700     05  RD010-DENY-SETTLE-FLAG  PIC  X(01)  VALUE 'N'.           00770044
007800     05  RD010-DENY-SETTLE-DESC  PIC  X(12)  VALUE SPACES.        00780044
007900     05  RD010-PENDING           PIC  X(01)  VALUE 'P'.           00790044
008000     05  RD010-PENDING-DESC      PIC  X(12)  VALUE                00800044
008100         'PENDING     '.                                          00810044
008200     05  RD010-PEND-SETTLE-FLAG  PIC  X(01)  VALUE 'N'.           00820044
008300     05  RD010-PEND-SETTLE-DESC  PIC  X(12)  VALUE SPACES.        00830044
008400     05  RD010-CASH-PAID         PIC  X(01)  VALUE 'C'.           00840053
008500     05  RD010-CASH-PAID-DESC    PIC  X(12)  VALUE                00850044
008600         'CASH PAID   '.                                          00860044
008700     05  RD010-CASH-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           00870044
008800     05  RD010-CASH-SETTLE-DESC  PIC  X(12)  VALUE 'CASH PAID'.   00880044
008810     05  RD010-STORE-HANDLE      PIC  X(01)  VALUE 'S'.           00881053
008820     05  RD010-STORE-HANDLE-DESC PIC  X(12)  VALUE                00882053
008830         'STORE HANDLE'.                                          00883053
008840     05  RD010-STORE-SETTLE-FLAG PIC  X(01)  VALUE 'Y'.           00884053
008850     05  RD010-STORE-SETTLE-DESC PIC  X(12)  VALUE 'STORE HANDLE'.00885053
008900     05  RD010-VOID              PIC  X(01)  VALUE 'V'.           00890044
009000     05  RD010-VOID-DESC         PIC  X(12)  VALUE                00900044
009100         'VOIDED      '.                                          00910044
009200     05  RD010-VOID-SETTLE-FLAG  PIC  X(01)  VALUE 'N'.           00920044
009300     05  RD010-VOID-SETTLE-DESC  PIC  X(12)  VALUE SPACES.        00930044
009400     05  RD010-APPROVED          PIC  X(01)  VALUE 'A'.           00940044
009500     05  RD010-APPROVED-DESC     PIC  X(12)  VALUE                00950044
009600         'APPROVED    '.                                          00960044
009700     05  RD010-APRV-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           00970044
009800     05  RD010-APRV-SETTLE-DESC  PIC  X(12)  VALUE 'CHECK'.       00980044
009900     05  RD010-KMRC              PIC  X(01)  VALUE 'M'.           00990044
010000     05  RD010-KMRC-DESC         PIC  X(12)  VALUE                01000044
010100         'KMRC        '.                                          01010044
010200     05  RD010-KMRC-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           01020044
010300     05  RD010-KMRC-SETTLE-DESC  PIC  X(12)  VALUE 'KMRC '.       01030044
010400     05  RD010-BANKCARD          PIC  X(01)  VALUE 'B'.           01040044
010500     05  RD010-BANKCARD-DESC     PIC  X(12)  VALUE                01050044
010600         'BANKCARD    '.                                          01060044
010700     05  RD010-BNKD-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           01070044
010800     05  RD010-BNKD-SETTLE-DESC  PIC  X(12)  VALUE 'BANKCARD'.    01080044
010900     05  RD010-KOHLS-CHARGE      PIC  X(01)  VALUE 'K'.           01090044
011000     05  RD010-KOHLS-CHARGE-DESC PIC  X(12)  VALUE                01100044
011100         'KOHLS CHARGE'.                                          01110044
011200     05  RD010-KCHG-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           01120044
011300     05  RD010-KCHG-SETTLE-DESC  PIC  X(12)  VALUE 'KOHLS CHARGE'.01130044
011400     05  RD010-MDSE-EXCHANGE     PIC  X(01)  VALUE 'E'.           01140044
011500     05  RD010-MDSE-EXCH-DESC    PIC  X(12)  VALUE                01150044
011600         'MDSE EXCH   '.                                          01160044
011700     05  RD010-EXCH-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           01170044
011800     05  RD010-EXCH-SETTLE-DESC  PIC  X(12)  VALUE 'MDSE EXCH   '.01180044
011900     05  RD010-ORIG-MDSE         PIC  X(01)  VALUE 'O'.           01190044
012000     05  RD010-ORIG-MDSE-DESC    PIC  X(12)  VALUE                01200044
012100         'ORIG MDSE   '.                                          01210044
012200     05  RD010-ORIG-SETTLE-FLAG  PIC  X(01)  VALUE 'Y'.           01220044
012300     05  RD010-ORIG-SETTLE-DESC  PIC  X(12)  VALUE 'ORIG MDSE   '.01230044
012400                                                                  01240044
012500 01  RD010-REFUND-STATUS-CODE-TABLE                               01250048
012600     REDEFINES RD010-REFUND-STATUS-CODE.                          01260048
012700     05  RD010-REFUND-STATUS-CODE-OCC OCCURS 11 TIMES             01270053
012800                                 INDEXED BY RD010-RFND-STAT-IDX.  01280049
012900         10  RD010-REFUND-STATUS-CDE PIC X(01).                   01290048
013000         10  RD010-REFUND-STATUS-DESC PIC X(12).                  01300048
013100         10  RD010-SETTLE-FLAG   PIC  X(01).                      01310044
013200         10  RD010-SETTLE-DESC   PIC  X(12).                      01320044
013300 01  RD010-REFUND-STATUS-CODE-MAX PIC S9(04) COMP VALUE +11.      01330054
