000100******************************************************************00010000
000200**                        RDWS030                               **00020011
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040001
000500**  KMC CHECK-IN/STORE ASSIGN/ISSUE SCREEN.                     **00050002
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  RD030-INTER-APPL-COMMAREA  REDEFINES                 00080002
000900             INTER-APPL-COMM-AREA.                                00090000
001000             15  FILLER                         PIC  X(01).       00100007
001100             15  RD030-CARD-NUMBER              PIC  9(13).       00110017
001200             15  RD030-FROM-CNTL-NUMBER         PIC  9(14).       00120014
001300             15  RD030-TO-CNTL-NUMBER           PIC  9(14).       00130015
001400             15  FILLER                         PIC  X(26).       00140021
001500             15  RD030-FROM-30-DIGT-CRD-NBR     PIC  9(30).       00150019
001600             15  RD030-TO-30-DIGT-CRD-NBR       PIC  9(30).       00160019
001700             15  FILLER                         PIC  X(72).       00170021
