00002 **                        RDWS034                               **DPWS054 
00003 **                                                              **   LV001
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **DPWS054 
00005 **  CORP REFUND REQUEST LIST.                                   **DPWS054 
00006 **  LENGTH:  200 BYTES                                          **DPWS054 
00007 ******************************************************************DPWS054 
00008          10  RD034-INTER-APPL-COMMAREA  REDEFINES                 DPWS054 
00009              INTER-APPL-COMM-AREA.                                DPWS054 
00010              15  FILLER                         PIC X(001).       DPWS054 
00011              15  RD034-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
00012                                                     COMP-3.       DPWS056 
00013              15  RD034-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
00014                                                     COMP-3.          CL**8
                   15  RD034-SEL-QUEUE-NAME           PIC X(008).               
00011              15  RD034-CUST-ID                  PIC S9(010)       DPWS054 
00011                                                       COMP-3.     DPWS054 
00011              15  RD034-MAIL-CK-REFUND-ID.                         DPWS054 
00011                  20  RD034-TERMINAL             PIC S9(004)       DPWS054 
00011                                                       COMP-3.     DPWS054 
00011                  20  RD034-TRANSACTION          PIC S9(004)       DPWS054 
00011                                                       COMP-3.     DPWS054 
00011                  20  RD034-SEQ-NBR              PIC S9(004)       DPWS054 
00011                                                       COMP-3.     DPWS054 
00015              15  FILLER                         PIC X(168).       DPWS054 
