00001 *----------------------------------------------------------------*02/17/93
00002 *                         RDWS035                                *DPWS057 
00003 *                                                                *   LV007
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *DPWS057 
00005 *   MAINTENANCE PROGRAMS TO PASS DATA WITHIN THE CASH REFUND     *DPWS057 
00005 *   SYSTEM.                                                      *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00007                                                                   DPWS057 
00009  01  RD035-SEL-REC.                                                  CL**4
00010        05  RD035-SELECTED-ITEMS               PIC S9(05)  COMP-3     CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  RD035-MAX-ITEMS                    PIC  9(02)             CL**2
00012                                                     VALUE 20.        CL**2
00013        05  RD035-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY RD035-IDX.        CL**2
00016                15  RD035-ITEM                 PIC S9(09)  COMP-3.    CL**7
00017                15  RD035-ACTION-SW            PIC  X(01).            CL**6
00018                    88  RD035-INQ                    VALUE 'I'.       CL**6
00019                    88  RD035-UPD                    VALUE 'U'.       CL**6
00020                    88  RD035-DEL                    VALUE 'D'.       CL**6
00021                    88  RD035-ERR                    VALUE 'E'.       CL**6
00022                15  RD035-KEY-DATA.                                   CL**6
                         20  RD035-CUST-ID          PIC S9(10)  COMP-3.         
                         20  RD035-TERMINAL         PIC S9(04)  COMP.           
                         20  RD035-TRANSACTION      PIC S9(04)  COMP.           
                         20  RD035-SEQ-NBR          PIC S9(04)  COMP.           
                     15  RD035-STORE-NBR            PIC S9(04)  COMP.           
                     15  RD035-RECEIPT-DTE          PIC  X(10).                 
                     15  RD035-REFUND               PIC S9(05)V99               
                                                                COMP.           
                     15  RD035-APPRVL-CDE           PIC  X(01).                 
                     15  RD035-STATDESC             PIC  X(07).                 
                     15  RD035-CHGDATE              PIC  X(10).                 
                     15  RD035-CKDATE               PIC  X(10).                 
                     15  RD035-CKNBR                PIC S9(07)  COMP-3.         
