      **************************************************************    00010000
      * DERIVE THE CORRECT DESCRIPTION FOR STATUS CODE                  00020000
      * INPUT-OUTPUTS:                                                  00021001
      *     RFWS008-SKU-STATUS-CODE                                     00022001
      * INPUTS:                                                         00022101
      *     RFWS008-UNT-RTL-CHG-DTE                                     00023001
      *     RFWS008-UPC-STAT-CHG-DTE                                    00024001
      * OUTPUTS:                                                        00025001
      *     RFWS008-SKU-STATUS-DESC                                     00026001
      **************************************************************    00030000
       RFPD008-MOVE-STATUS-DATA.                                        00040000
           IF RFWS008-SKU-STATUS-CODE = RFWS008-MIXED-STATUS            00050001
               MOVE RFWS008-ACTIVE-STATUS                               00060001
                                       TO RFWS008-SKU-STATUS-CODE       00070001
           END-IF.                                                      00130000
                                                                        00140000
           EVALUATE RFWS008-SKU-STATUS-CODE                             00150001
               WHEN 10                                                  00160001
                    MOVE 'NEW'         TO RFWS008-SKU-STATUS-DESC       00170001
               WHEN 20                                                  00180001
                    MOVE 'ACTIVE'      TO RFWS008-SKU-STATUS-DESC       00190001
               WHEN 30                                                  00220001
                    IF RFWS008-UNT-RTL-CHG-DTE >                        00230001
                            RFWS008-UPC-STAT-CHG-DTE                    00240001
                        MOVE 'RED TICKET'                               00250000
                                       TO RFWS008-SKU-STATUS-DESC       00260001
                    ELSE                                                00270000
                        MOVE 'YELLOW TKT'                               00280000
                                       TO RFWS008-SKU-STATUS-DESC       00290001
                    END-IF                                              00300000
               WHEN 40                                                  00310001
                    MOVE 'SPECIALPUR'  TO RFWS008-SKU-STATUS-DESC       00320001
               WHEN 90                                                  00330001
                    MOVE 'DISCONTINU'  TO RFWS008-SKU-STATUS-DESC       00340001
               WHEN 98                                                  00350001
                    MOVE 'RENUMBERED'  TO RFWS008-SKU-STATUS-DESC       00360001
               WHEN OTHER                                               00370000
                    MOVE 'UNKNOWN'     TO RFWS008-SKU-STATUS-DESC       00380001
           END-EVALUATE.                                                00390000
