      ***************************************************************** 00010030
      *    RECORD PURPOSE: ADD ITEM RESPONSE                          * 00020030
      *    RECORD LENGTH:  206 BYTES                                  * 00030030
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040030
      ***************************************************************** 00050030
       01  RFRD103-TO-CLIENT-RECORD.                                    00060030
           05  RFRD103-TOT-REC-LENGTH          PIC  9(04)  VALUE ZEROS. 00070030
           05  RFRD103-MATCHING-NBR-FIELD      PIC  9(08)  VALUE ZEROS. 00080030
           05  RFRD103-ERR-TYP-IND             PIC  X(01)  VALUE SPACE. 00090030
           05  RFRD103-ERR-MSG                 PIC  X(70)  VALUE SPACE. 00100030
           05  RFRD103-ERR-ITEM                PIC  X(01)  VALUE SPACE. 00110030
           05  RFRD103-ONHAND-QTY              PIC  ---9.               00110230
           05  RFRD103-ONHAND-QTY-X REDEFINES RFRD103-ONHAND-QTY        00110330
                                               PIC  ZZZ9.               00110429
           05  RFRD103-ENROUTE-QTY             PIC  ---9.               00110530
           05  RFRD103-ENROUTE-QTY-X REDEFINES RFRD103-ENROUTE-QTY      00110630
                                               PIC  ZZZ9.               00110727
           05  RFRD103-INTRANSIT-QTY           PIC  ---9.               00110830
           05  RFRD103-INTRANSIT-QTY-X REDEFINES RFRD103-INTRANSIT-QTY  00110930
                                               PIC  ZZZ9.               00111027
           05  RFRD103-SKU-DESC                PIC  X(20)  VALUE SPACE. 00150030
           05  RFRD103-LABEL                   PIC  X(20)  VALUE SPACE. 00160030
           05  RFRD103-VENDOR-STYLE            PIC  X(20)  VALUE SPACE. 00170030
           05  RFRD103-COLOR                   PIC  X(10)  VALUE SPACE. 00180030
           05  RFRD103-BOX-NBR                 PIC  X(10)  VALUE SPACE. 00190030
           05  RFRD103-SIZE                    PIC  X(10)  VALUE SPACE. 00200030
           05  RFRD103-SKU-STATUS-CODE         PIC  X(02)  VALUE SPACE. 00210030
           05  RFRD103-SKU-STATUS-DESC         PIC  X(10)  VALUE SPACE. 00220030
           05  RFRD103-CURRENT-QTY             PIC  9(04)  VALUE ZEROS. 00230030
           05  RFRD103-TOTAL-ITEMS             PIC  9(04)  VALUE ZEROS. 00240030
