000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN BUS GROUPS REQUEST    * 00020018
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF116-FROM-CLIENT-RECORD.                                    00060018
000700     05  RF116-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070018
000800     05  RF116-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080018
000900     05  RF116-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090018
001000     05  RF116-STR-NBR                   PIC  9(04)  VALUE ZEROS. 00100018
000900     05  RF116-LIST-STATUS-CODE          PIC  X(01)  VALUE SPACE. 00110018
           05  FILLER                          PIC X(4102) VALUE SPACE. 00120016
003300     05  RF116-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00130018
003400         88  RF116-MQ-INDICATOR-N                    VALUE 'N'.   00140018
003400         88  RF116-MQ-INDICATOR-Y                    VALUE 'Y'.   00150018
000900     05  RF116-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00160018
000900     05  RF116-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00170018
000900     05  RF116-MSGID                     PIC  X(24)  VALUE SPACE. 00180018
