00001 ***************************************************************** 10/11/95
00002 *    RECORD PURPOSE: TELXON PTC VERSION SYNCHRONIZATION         * RFRD009 
00003 *    RECORD LENGTH:  835  BYTES                                 *    LV017
00004 *    RECORD FORMAT:  SEQUENTIAL                                 * RFRD009 
00005 * ------------------------------------------------------------- * RFRD009 
00006 * CHANGE                                                        * RFRD009 
00007 * DATE     ANALYST       CHANGE DESCRIPTION                     * RFRD009 
00008 *                                                               * RFRD009 
00009 ***************************************************************** RFRD009 
00010  01  RF009-PTC-VSYNC-TSQ-RECORD.                                     CL*14
00011      05 RF009-TOT-REC-LENGTH           PIC 9(04) VALUE ZEROS.        CL*14
00012      05 RF009-MATCHING-NBR-FIELD       PIC 9(08) VALUE ZEROS.        CL*14
00013      05 RF009-ERROR-FLAG               PIC X(01) VALUE SPACES.       CL*14
00014      05 RF009-ERROR-MESSAGE            PIC X(70) VALUE SPACES.       CL*14
00015      05 RF009-OBJECT-COUNT             PIC 9(02) VALUE ZEROES.       CL*14
00016      05 RF009-OBJECT-INFO.                                           CL*14
00017         10 RF009-OBJECT-DATA OCCURS 1 TO 10 TIMES                    CL*14
00018                              DEPENDING ON RF009-OBJECT-COUNT.        CL*14
00019            15 RF009-OBJECT-NAME        PIC X(12) VALUE SPACES.       CL*14
00020            15 RF009-SOFTWARE-RLSE-NBR  PIC X(07) VALUE SPACES.       CL*14
00021            15 RF009-SERVER-ALIAS       PIC X(15) VALUE SPACES.       CL*16
00022            15 RF009-SERVICE-ALIAS      PIC X(15) VALUE SPACES.       CL*16
00023            15 RF009-CREATION-DATE      PIC 9(08) VALUE ZEROES.       CL*17
00024            15 RF009-CREATION-TIME      PIC 9(06) VALUE ZEROES.       CL*17
00025            15 RF009-OBJECT-SIZE        PIC 9(08) VALUE ZEROS.        CL*14
00026            15 RF009-CRC-NUMBER         PIC S9(09) VALUE ZEROS        CL*14
00027                                               COMP.                  CL*14
