000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN BY LISTS              * 00020024
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF122-FROM-CLIENT-RECORD.                                    00060024
000700     05  RF122-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070024
000800     05  RF122-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080024
000900     05  RF122-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090024
001000     05  RF122-STR-NBR                   PIC  9(04)  VALUE ZEROS. 00100024
001310     05  RF122-EXCLUDE-COMPLETED-LISTS   PIC  X(01)  VALUE SPACE. 00110029
               88 RF122-EXCLUDE-LISTS-N                    VALUE 'N'.   00120030
               88 RF122-EXCLUDE-LISTS-Y                    VALUE 'Y'.   00130030
           05  RF122-NBR-OF-OCCURS             PIC  9(04)  VALUE ZEROS. 00131028
           05  FILLER                          PIC X(4098) VALUE SPACE. 00140027
003300     05  RF122-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00150024
003400         88  RF122-MQ-INDICATOR-N                    VALUE 'N'.   00160024
003400         88  RF122-MQ-INDICATOR-Y                    VALUE 'Y'.   00170024
000900     05  RF122-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00180024
000900     05  RF122-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00190024
000900     05  RF122-MSGID                     PIC  X(24)  VALUE SPACE. 00200024
