000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPDATE SIMILAR ITEM RESPONSE               * 00020019
000300*    RECORD LENGTH:  87 BYTES                                   * 00030020
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000700 01  RF107-TO-CLIENT-RECORD.                                      00060018
000900     05  RF107-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070018
001000     05  RF107-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080018
001100     05  RF107-ERR-TYP-IND               PIC  X(01)  VALUE SPACE. 00090018
001200     05  RF107-ERR-MSG                   PIC  X(70)  VALUE SPACE. 00100018
000900     05  RF107-TOTAL-ITEMS               PIC  9(04)  VALUE ZEROS. 00110020
