000100***************************************************************** 00010000
000200*    RECORD PURPOSE: VERSION SYNCHRONIZATION INQUIRY REQUEST    * 00020002
000300*    RECORD LENGTH:  35 BYTES                                   * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF008-VER-SNYC-INQ-RECORD.                                   00060002
000700     05  RF008-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070000
000800     05  RF008-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080000
000900     05  RF008-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090008
001000     05  RF008-OBJECT-COUNT              PIC  X(02)  VALUE SPACE. 00100002
001100     05  RF008-APPL-ID                   PIC  X(12)  VALUE SPACE. 00110002
001200     05  RF008-PLATFORM-ID               PIC  X(08)  VALUE SPACE. 00120005
      *    05  FILLER                          PIC X(4085) VALUE SPACE. 00121008
