000100***************************************************************** 00010000
000200*    RECORD PURPOSE: CREATE PICK LIST REQUEST                   * 00020014
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF100-FROM-CLIENT-RECORD.                                    00060007
000700     05  RF100-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070007
000800     05  RF100-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080007
000900     05  RF100-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090007
001000     05  RF100-STR-NBR                   PIC  9(04)  VALUE ZEROS. 00100007
000900     05  RF100-LIST-DESC                 PIC  X(10)  VALUE SPACE. 00120011
000900     05  RF100-TABLE-TOWER-IND           PIC  X(01)  VALUE SPACE. 00130012
               88  RF100-TABLE-TOWER-Y                     VALUE 'Y'.   00140013
               88  RF100-TABLE-TOWER-N                     VALUE 'N'.   00150013
001000     05  RF100-UPC-NBR                   PIC  9(15)  VALUE ZEROS. 00151016
           05  FILLER                          PIC X(4077) VALUE SPACE. 00160015
003300     05  RF100-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00170007
003400         88  RF100-MQ-INDICATOR-N                    VALUE 'N'.   00180007
003400         88  RF100-MQ-INDICATOR-Y                    VALUE 'Y'.   00190007
000900     05  RF100-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00200007
000900     05  RF100-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00210007
000900     05  RF100-MSGID                     PIC  X(24)  VALUE SPACE. 00220007
