000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN BARCODE RESPONSE      * 00020029
000300*    RECORD LENGTH:  149 BYTES                                  * 00030038
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000700 01  RF121-TO-CLIENT-RECORD.                                      00060029
000900     05  RF121-TOT-REC-LENGTH         PIC  9(04)  VALUE ZEROS.    00070029
001000     05  RF121-MATCHING-NBR-FIELD     PIC  9(08)  VALUE ZEROS.    00080029
001100     05  RF121-ERR-TYP-IND            PIC  X(01)  VALUE SPACE.    00090029
001200     05  RF121-ERR-MSG                PIC  X(70)  VALUE SPACE.    00100029
001310     05  RF121-LIST-STATUS-DESC       PIC  X(20)  VALUE SPACE.    00110035
001310     05  RF121-BUS-GRP-DESC           PIC  X(10)  VALUE SPACE.    00120033
001300     05  RF121-LIST-DESC              PIC  X(10)  VALUE SPACE.    00130029
001300     05  RF121-LIST-DATE              PIC  X(10)  VALUE SPACE.    00140029
001300     05  RF121-LIST-TIME              PIC  X(07)  VALUE SPACE.    00150029
001300     05  RF121-LOCKED-STATUS          PIC  X(01)  VALUE SPACE.    00160029
               88 RF121-LOCKED-STATUS-Y                 VALUE 'Y'.      00170030
               88 RF121-LOCKED-STATUS-N                 VALUE 'N'.      00180030
001300     05  RF121-LIST-STATUS-CODE       PIC  X(01)  VALUE SPACE.    00190036
001300     05  RF121-BUS-GRP-NBR            PIC  9(03)  VALUE ZEROS.    00200036
001300     05  RF121-TOTAL-ITEMS            PIC  9(04)  VALUE ZEROS.    00210038
