000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN STATUS CODES REQUEST  * 00020018
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF114-FROM-CLIENT-RECORD.                                    00060016
000700     05  RF114-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070016
000800     05  RF114-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080016
000900     05  RF114-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090016
001000     05  RF114-STR-NBR                   PIC  9(04)  VALUE ZEROS. 00100016
           05  FILLER                          PIC X(4103) VALUE SPACE. 00110018
003300     05  RF114-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00120016
003400         88  RF114-MQ-INDICATOR-N                    VALUE 'N'.   00130016
003400         88  RF114-MQ-INDICATOR-Y                    VALUE 'Y'.   00140016
000900     05  RF114-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00150016
000900     05  RF114-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00160016
000900     05  RF114-MSGID                     PIC  X(24)  VALUE SPACE. 00170016
