      ***************************************************************** 00010041
      *    RECORD PURPOSE: STOCK PICK LIST RESPONSE                   * 00020041
      *    RECORD LENGTH:  2536 BYTES                                 * 00030041
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040041
      ***************************************************************** 00050041
       01  RFRD109-TO-CLIENT-RECORD.                                    00060041
           05  RFRD109-TO-CLIENT-FIXED-DATA.                            00070041
               10 RFRD109-TOT-REC-LENGTH       PIC  9(04)  VALUE ZEROS. 00080041
               10 RFRD109-MATCHING-NBR-FIELD   PIC  9(08)  VALUE ZEROS. 00090041
               10 RFRD109-ERR-TYP-IND          PIC  X(01)  VALUE SPACE. 00100041
               10 RFRD109-ERR-MSG              PIC  X(70)  VALUE SPACE. 00110041
               10 RFRD109-TOTAL-ITEMS          PIC  9(04)  VALUE ZEROS. 00120041
               10 RFRD109-TOTAL-QTY            PIC  9(04)  VALUE ZEROS. 00130041
               10 RFRD109-NBR-OF-OCCURS        PIC  9(04)  VALUE ZEROS. 00140041
               10 RFRD109-MORE-DATA-IND        PIC  X(01)  VALUE SPACE. 00150041
                   88 RFRD109-NO-MORE-DATA                 VALUE 'N'.   00160041
                   88 RFRD109-MORE-DATA                    VALUE 'Y'.   00170041
                                                                        00180028
           05  RFRD109-TO-CLIENT-VAR-DATA.                              00190041
               10  RFRD109-RECORD-TYPE         PIC X(2440) VALUE SPACE. 00200041
                                                                        00210041
               10  RFRD109-UPC-RECORDS REDEFINES RFRD109-RECORD-TYPE.   00220041
                   15  RFRD109-UPC-TBL OCCURS 20 TIMES                  00230041
                                 INDEXED BY UPC-IDX.                    00240041
                       20  RFRD109-UPC-NBR     PIC  9(15).              00250041
                       20  RFRD109-PICKED-IND  PIC  X(01).              00260041
                           88 RFRD109-PICKED-N      VALUE 'N'.          00270041
                           88 RFRD109-PICKED-Y      VALUE 'Y'.          00280041
                       20  RFRD109-SKU-DESC    PIC  X(20).              00290041
                       20  RFRD109-LABEL       PIC  X(20).              00300041
                       20  RFRD109-VENDOR-STYLE                         00310041
                                               PIC  X(20).              00311041
                       20  RFRD109-COLOR       PIC  X(10).              00320041
                       20  RFRD109-BOX-NBR     PIC  X(10).              00330041
                       20  RFRD109-SIZE        PIC  X(10).              00340041
                       20  RFRD109-ONHAND-QTY  PIC  ---9.               00341041
                       20  RFRD109-ONHAND-QTY-X REDEFINES               00341141
                           RFRD109-ONHAND-QTY  PIC  ZZZ9.               00341241
                       20  RFRD109-ENROUTE-QTY PIC  ---9.               00341341
                       20  RFRD109-ENROUTE-QTY-X REDEFINES              00341441
                           RFRD109-ENROUTE-QTY PIC  ZZZ9.               00341541
                       20  RFRD109-INTRANSIT-QTY                        00341641
                                               PIC  ---9.               00341741
                       20  RFRD109-INTRANSIT-QTY-X REDEFINES            00341841
                           RFRD109-INTRANSIT-QTY                        00341941
                                               PIC  ZZZ9.               00342041
                       20  RFRD109-QTY         PIC  9(04).              00380041
