000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPDATE ITEMS                               * 00020033
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030006
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  RF124-FROM-CLIENT-RECORD.                                    00060033
002300     05  RF124-FROM-CLIENT-FIXED-DATA.                            00070033
000700         10 RF124-TOT-REC-LENGTH         PIC  9(04)  VALUE ZEROS. 00080033
000800         10 RF124-MATCHING-NBR-FIELD     PIC  9(08)  VALUE ZEROS. 00090033
000900         10 RF124-LISTENER-CODE          PIC  X(01)  VALUE SPACE. 00100033
001000         10 RF124-STR-NBR                PIC  9(04)  VALUE ZEROS. 00110033
001000         10 RF124-LIST-ID                PIC  9(09)  VALUE ZEROS. 00120033
001310         10 RF124-NBR-OF-OCCURS          PIC  9(04)  VALUE ZEROS. 00130033
                                                                        00170021
002300     05  RF124-FROM-CLIENT-VARIABLE-DAT.                          00180033
002400         10  RF124-RECORD-TYPE         PIC X(1450) VALUE SPACE.   00190037
002600         10  RF124-UPC-RECORDS REDEFINES RF124-RECORD-TYPE.       00200033
002700             15  RF124-UPC-TBL OCCURS 50 TIMES                    00210035
002800                           INDEXED BY UPC-IDX.                    00220016
001310                 20  RF124-INTR-UPC-ID   PIC 9(10).               00221037
001310                 20  RF124-UPC-NBR       PIC 9(15).               00230033
001310                 20  RF124-QTY           PIC 9(04).               00270033
           05  FILLER                          PIC X(2640) VALUE SPACE. 00280037
003300     05  RF124-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00290033
003400         88  RF124-MQ-INDICATOR-N                    VALUE 'N'.   00300033
003400         88  RF124-MQ-INDICATOR-Y                    VALUE 'Y'.   00310033
000900     05  RF124-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00320033
000900     05  RF124-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00330033
000900     05  RF124-MSGID                     PIC  X(24)  VALUE SPACE. 00340033
