000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPDATE ITEMS RESPONSE                      * 00020024
000300*    RECORD LENGTH:  87 BYTES                                   * 00030026
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000700 01  RF125-TO-CLIENT-RECORD.                                      00060024
000900     05  RF125-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070024
001000     05  RF125-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080024
001100     05  RF125-ERR-TYP-IND               PIC  X(01)  VALUE SPACE. 00090024
001200     05  RF125-ERR-MSG                   PIC  X(70)  VALUE SPACE. 00100024
001200     05  RF125-TOTAL-ITEMS               PIC  9(04)  VALUE ZEROS. 00110027
