      ***************************************************************** 00010001
      **RECORD PURPOSE: TELXON PTC VERSION SYNCHRONIZATION              00020001
      **RECORD LENGTH:  835  BYTES                                      00030001
      ***************************************************************** 00040001
       01  RF137-PTC-VSYNC-TSQ-RECORD.                                  00050001
           05  RF137-TOT-REC-LENGTH             PIC 9(04) VALUE ZEROS.  00060002
           05  RF137-MATCHING-NBR-FIELD         PIC 9(08) VALUE ZEROS.  00070002
           05  RF137-ERROR-FLAG                 PIC X(01) VALUE SPACES. 00080002
           05  RF137-ERROR-MESSAGE              PIC X(70) VALUE SPACES. 00090002
           05  RF137-OBJECT-COUNT               PIC 9(02) VALUE ZEROES. 00100002
           05  RF137-OBJECT-INFO.                                       00110002
               10  RF137-OBJECT-DATA OCCURS 10 TIMES.                   00120005
                  15  RF137-OBJECT-NAME          PIC X(12) VALUE SPACES.00130002
                  15  RF137-SFTWRE-NBR.                                 00140003
                      20  RF137-SFTWRE-DIRTRY-ID PIC X(01) VALUE SPACES.00150002
                      20  RF137-SFTWRE-VER-NBR   PIC X(02) VALUE SPACES.00160002
                      20  RF137-SFTWRE-RLSE-NBR  PIC X(02) VALUE SPACES.00170002
                      20  RF137-SFTWRE-QKFX-NBR  PIC X(02) VALUE SPACES.00180002
                  15  RF137-SERVER-ALIAS         PIC X(15) VALUE SPACES.00190002
                  15  RF137-SERVICE-ALIAS        PIC X(15) VALUE SPACES.00200002
                  15  RF137-CREATION-DATE.                              00210002
                      20  RF137-CREATE-DATE-CCYY PIC 9(04) VALUE ZEROS. 00220002
                      20  RF137-CREATE-DATE-MM   PIC 9(02) VALUE ZEROS. 00230002
                      20  RF137-CREATE-DATE-DD   PIC 9(02) VALUE ZEROS. 00240002
                  15  RF137-CREATION-TIME.                              00250002
                      20  RF137-CREATE-TIME-HH   PIC 9(02) VALUE ZEROS. 00260002
                      20  RF137-CREATE-TIME-MM   PIC 9(02) VALUE ZEROS. 00270002
                      20  RF137-CREATE-TIME-SS   PIC 9(02) VALUE ZEROS. 00280002
                  15  RF137-OBJECT-SIZE          PIC 9(08) VALUE ZEROS. 00290002
                  15  RF137-CRC-NUMBER           PIC S9(09) VALUE ZEROS 00300002
                                                    COMP.               00310001
