      ***************************************************************** 00010021
      *    RECORD PURPOSE: STOCK PICK LIST REQUEST                    * 00020021
      *    RECORD LENGTH:  4241 BYTES                                 * 00030021
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040021
      ***************************************************************** 00050021
       01  RFRD108-FROM-CLIENT-RECORD.                                  00060021
           05  RFRD108-TOT-REC-LENGTH          PIC  9(04)  VALUE ZEROS. 00070021
           05  RFRD108-MATCHING-NBR-FIELD      PIC  9(08)  VALUE ZEROS. 00080021
           05  RFRD108-LISTENER-CODE           PIC  X(01)  VALUE SPACE. 00090021
           05  RFRD108-STR-NBR                 PIC  9(04)  VALUE ZEROS. 00100021
           05  RFRD108-LIST-ID                 PIC  9(09)  VALUE ZEROS. 00110021
           05  RFRD108-NBR-OF-OCCURS           PIC  9(04)  VALUE ZEROS. 00120021
           05  FILLER                          PIC X(4090) VALUE SPACE. 00130020
           05  RFRD108-MQ-INDICATOR            PIC  X(01)  VALUE SPACE. 00140021
               88  RFRD108-MQ-INDICATOR-N                  VALUE 'N'.   00150021
               88  RFRD108-MQ-INDICATOR-Y                  VALUE 'Y'.   00160021
           05  RFRD108-REPLYTOQ                PIC  X(48)  VALUE SPACE. 00170021
           05  RFRD108-REPLYTOQMGR             PIC  X(48)  VALUE SPACE. 00180021
           05  RFRD108-MSGID                   PIC  X(24)  VALUE SPACE. 00190021
