      ***************************************************************** 00010024
      *    RECORD PURPOSE: ADD ITEM REQUEST                           * 00020024
      *    RECORD LENGTH:  4241 BYTES                                 * 00030024
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040024
      ***************************************************************** 00050024
       01  RFRD102-FROM-CLIENT-RECORD.                                  00060024
           05  RFRD102-TOT-REC-LENGTH          PIC  9(04)  VALUE ZEROS. 00070024
           05  RFRD102-MATCHING-NBR-FIELD      PIC  9(08)  VALUE ZEROS. 00080024
           05  RFRD102-LISTENER-CODE           PIC  X(01)  VALUE SPACE. 00090024
           05  RFRD102-STR-NBR                 PIC  9(04)  VALUE ZEROS. 00100024
           05  RFRD102-LIST-ID                 PIC  9(09)  VALUE ZEROS. 00110024
           05  RFRD102-CURRENT-UPC             PIC  9(15)  VALUE ZEROS. 00120024
           05  RFRD102-PREVIOUS-UPC            PIC  9(15)  VALUE ZEROS. 00130024
           05  RFRD102-PREVIOUS-QTY            PIC  9(04)  VALUE ZEROS. 00140024
           05  FILLER                          PIC X(4060) VALUE SPACE. 00150023
           05  RFRD102-MQ-INDICATOR            PIC  X(01)  VALUE SPACE. 00160024
               88  RFRD102-MQ-INDICATOR-N                  VALUE 'N'.   00170024
               88  RFRD102-MQ-INDICATOR-Y                  VALUE 'Y'.   00180024
           05  RFRD102-REPLYTOQ                PIC  X(48)  VALUE SPACE. 00190024
           05  RFRD102-REPLYTOQMGR             PIC  X(48)  VALUE SPACE. 00200024
           05  RFRD102-MSGID                   PIC  X(24)  VALUE SPACE. 00210024
