000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN BUS GROUP RESPONSE    * 00020026
000300*    RECORD LENGTH:  1387 BYTES                                 * 00030028
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000700 01  RF117-TO-CLIENT-RECORD.                                      00060026
002300     05  RF117-TO-CLIENT-FIXED-DATA.                              00070027
000900         10 RF117-TOT-REC-LENGTH         PIC  9(04)  VALUE ZEROS. 00080027
001000         10 RF117-MATCHING-NBR-FIELD     PIC  9(08)  VALUE ZEROS. 00090027
001100         10 RF117-ERR-TYP-IND            PIC  X(01)  VALUE SPACE. 00100027
001200         10 RF117-ERR-MSG                PIC  X(70)  VALUE SPACE. 00110027
001310         10 RF117-NBR-OF-OCCURS          PIC  9(04)  VALUE ZEROS. 00120027
                                                                        00130027
002300     05  RF117-TO-CLIENT-VARIABLE-DATA.                           00140026
002400         10  RF117-RECORD-TYPE           PIC X(1300) VALUE SPACE. 00150028
002500                                                                  00160022
002600         10  RF117-GRP-RECORDS REDEFINES RF117-RECORD-TYPE.       00170026
002700             15  RF117-BUSINESS-GRP-TBL OCCURS 100 TIMES          00180026
002800                           INDEXED BY BUS-GRP-IDX.                00190029
001310                 20  RF117-BUS-GRP-NBR  PIC 9(03).                00200030
001310                 20  RF117-BUS-GRP-DESC PIC X(10).                00210030
