000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RESUME STOCK FILL-IN STATUS CODES RESPONSE * 00020026
000300*    RECORD LENGTH:  507 BYTES                                  * 00030029
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000700 01  RF115-TO-CLIENT-RECORD.                                      00060022
002300     05  RF115-TO-CLIENT-FIXED-DATA.                              00070028
000900         10 RF115-TOT-REC-LENGTH         PIC  9(04)  VALUE ZEROS. 00080028
001000         10 RF115-MATCHING-NBR-FIELD     PIC  9(08)  VALUE ZEROS. 00090028
001100         10 RF115-ERR-TYP-IND            PIC  X(01)  VALUE SPACE. 00100028
001200         10 RF115-ERR-MSG                PIC  X(70)  VALUE SPACE. 00110028
001310         10 RF115-NBR-OF-OCCURS          PIC  9(04)  VALUE ZEROS. 00120028
                                                                        00130028
002300     05  RF115-TO-CLIENT-VARIABLE-DATA.                           00140022
002400         10  RF115-RECORD-TYPE           PIC X(420)  VALUE SPACE. 00150029
002500                                                                  00160022
002600         10  RF115-STATUS-CODE-RECORDS                            00170026
                                       REDEFINES RF115-RECORD-TYPE.     00180026
002700             15  RF115-STATUS-CODE-TBL OCCURS 20 TIMES            00190026
002800                           INDEXED BY STAT-CDE-IDX.               00200030
001310                20  RF115-LIST-STATUS-CODE PIC X(01).             00210031
001310                20  RF115-LIST-STATUS-DESC PIC X(20).             00220031
