      ***************************************************************** 00001000
      * FIELDS USED TO DERIVE STATUS, STATUS DESCRIPTION AND EFFECTIVE  00002000
      * DATE FOR AN ITEM                                                00002100
      ***************************************************************** 00002200
       01  RFWS006-FIELDS.                                              00006302
           05  RFWS006-IN-FIELDS.                                       00006402
      *            PLUG IN XST_SKU_LOC.LOC_SKU_STAT_CDE                 00006502
               10  RFWS006-LOC-SKU-STAT-CDE            PIC  X(02)       00006602
                                                       VALUE SPACES.    00006702
      *            PLUG IN XST_SKU_LOC.UPC_STAT_CHG_DTE                 00006802
               10  RFWS006-UPC-STAT-CHG-DTE            PIC  X(10)       00006902
                                                       VALUE SPACES.    00007002
               10  RFWS006-UPC-STAT-CHG-DTE-X  REDEFINES                00007102
                       RFWS006-UPC-STAT-CHG-DTE.                        00007202
                   15  RFWS006-UPC-STAT-CHG-YEAR       PIC  X(04).      00007302
                   15  FILLER                          PIC  X(01).      00007402
                   15  RFWS006-UPC-STAT-CHG-MONTH      PIC  X(02).      00007505
                   15  FILLER                          PIC  X(01).      00007602
                   15  RFWS006-UPC-STAT-CHG-DAY        PIC  X(02).      00007702
      *            PLUG IN XST_SKU_LOC.UNT_RTL_CHG_DTE                  00007802
               10  RFWS006-UNT-RTL-CHG-DTE             PIC  X(10)       00007902
                                                       VALUE SPACES.    00008002
               10  RFWS006-UNT-RTL-CHG-DTE-X  REDEFINES                 00008102
                       RFWS006-UNT-RTL-CHG-DTE.                         00008202
                   15  RFWS006-UNT-RTL-CHG-YEAR        PIC  X(04).      00008302
                   15  FILLER                          PIC  X(01).      00008402
                   15  RFWS006-UNT-RTL-CHG-MONTH       PIC  X(02).      00008504
                   15  FILLER                          PIC  X(01).      00008602
                   15  RFWS006-UNT-RTL-CHG-DAY         PIC  X(02).      00008702
           05  RFWS006-OUT-FIELDS.                                      00008802
               10  RFWS006-SKU-STATUS-CODE             PIC  X(02)       00008902
                                                       VALUE SPACES.    00009002
               10  RFWS006-SKU-STATUS-DESC             PIC  X(12)       00009102
                                                       VALUE SPACES.    00009202
               10  RFWS006-SKU-EFF-DATE.                                00009302
                   15  RFWS006-SKU-EFF-YEAR            PIC  X(04)       00009402
                                                       VALUE SPACES.    00009502
                   15  RFWS006-SKU-EFF-MONTH           PIC  X(02)       00009602
                                                       VALUE SPACES.    00009702
                   15  RFWS006-SKU-EFF-DAY             PIC  X(02)       00009802
                                                       VALUE SPACES.    00010002
                                                                        00011003
       01  RFWS006-CODE-NEW                            PIC  X(02)       00020003
                                                       VALUE '10'.      00030003
       01  RFWS006-DESC-NEW                            PIC  X(12)       00040003
                                                       VALUE            00050003
               'NEW         '.                                          00060003
       01  RFWS006-CODE-ACTIVE                         PIC  X(02)       00070003
                                                       VALUE '20'.      00080003
       01  RFWS006-DESC-ACTIVE                         PIC  X(12)       00090003
                                                       VALUE            00100003
               'ACTIVE      '.                                          00110003
       01  RFWS006-CODE-MIXED                          PIC  X(02)       00120003
                                                       VALUE '25'.      00130003
       01  RFWS006-CODE-CLEARANCE                      PIC  X(02)       00140003
                                                       VALUE '30'.      00150003
       01  RFWS006-DESC-RED-TICKET                     PIC  X(12)       00160003
                                                       VALUE            00170003
               'RED TICKET  '.                                          00180003
       01  RFWS006-DESC-YELLOW-TICKET                  PIC  X(12)       00190003
                                                       VALUE            00200003
               'YELLOW TKT  '.                                          00210003
       01  RFWS006-CODE-SPECIAL-PURCHASE               PIC  X(02)       00220003
                                                       VALUE '40'.      00230003
       01  RFWS006-DESC-SPECIAL-PURCHASE               PIC  X(12)       00240003
                                                       VALUE            00250003
               'SPECIAL PUR '.                                          00260003
       01  RFWS006-CODE-DISCONTINUED                   PIC  X(02)       00270003
                                                       VALUE '90'.      00280003
       01  RFWS006-DESC-DISCONTINUED                   PIC  X(12)       00290003
                                                       VALUE            00300003
               'DISCONTINUED'.                                          00310003
       01  RFWS006-CODE-RENUMBERED                     PIC  X(02)       00320003
                                                       VALUE '98'.      00330003
       01  RFWS006-DESC-RENUMBERED                     PIC  X(12)       00340003
                                                       VALUE            00350003
               'RENUMBERED  '.                                          00360003
       01  RFWS006-DESC-UNKNOWN                        PIC  X(12)       00370003
                                                       VALUE            00380003
               'UNKNOWN     '.                                          00390003
