      ***************************************************************** 00001000
      * DERIVE STATUS DESCRIPTION FROM STATUS CODE                      00002000
      ***************************************************************** 00002200
       01  RFWS008-FIELDS.                                              00002300
           05  RFWS008-SKU-STATUS-CODE  PIC  9(02)      VALUE ZEROS.    00002800
           05  RFWS008-ACTIVE-STATUS    PIC  9(02)      VALUE 20.       00003000
           05  RFWS008-MIXED-STATUS     PIC  9(02)      VALUE 25.       00003102
           05  RFWS008-UNT-RTL-CHG-DTE  PIC  X(10)      VALUE SPACES.   00003201
           05  RFWS008-UPC-STAT-CHG-DTE PIC  X(10)      VALUE SPACES.   00003301
           05  RFWS008-SKU-STATUS-DESC  PIC  X(10)      VALUE SPACES.   00004000
