       01  RFWS005-ITEM-COMMAREA.                                               
           05  RFWS005-SEND-FIELDS.                                             
               10  RFWS005-INTR-UPC-ID      PIC S9(15)V  COMP-3.                
           05  RFWS005-RETURN-FIELDS.                                           
               10  RFWS005-ORIG-UNIT-RTL-AMT                                    
                                            PIC S9(7)V99 COMP-3.                
               10  RFWS005-RETURN-FLAGS.                                        
                   15 RFWS005-RETURN-SQL          PIC X(01).                    
                       88 RFWS005-SUCCESSFUL      VALUE 'Y'.                    
                       88 RFWS005-NOT-SUCCESSFUL  VALUE 'N'.                    
