      ***************************************************************** 00010000
      * RFWS001 -  WORKING STORAGE FOR DETERMINING LISTENER QUEUE     * 00020000
      *            NAME                                               * 00021000
      ***************************************************************** 00030000
       01  PV-QUEUE-NAME-TABLE.                                         00040000
           05  PV-QUEUE-PARM           PIC X(1).                        00041000
               88  PV-VALID-PARM       VALUE '1' THRU '9'.              00042000
           05  PV-QUEUE-PARM-N   REDEFINES  PV-QUEUE-PARM   PIC 9(1).   00043000
           05  PV-QUEUE-NAMES.                                          00050000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR1'.      00060000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR2'.      00070000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR3'.      00080000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR4'.      00090000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR5'.      00100000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR6'.      00110000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR7'.      00120000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR8'.      00130000
               10  FILLER              PIC X(8)  VALUE 'TCPIPPR9'.      00140000
           05  PV-QUEUE-NAME-R   REDEFINES  PV-QUEUE-NAMES.             00160000
               10  PV-QUEUE-NAME       OCCURS 9 TIMES                   00170000
                                       PIC X(8).                        00171002
