000100******************************************************************00010000
000200*  INFOPAC VERSION EXTRACT.  THE RECORD LENGTH IS 100 BYTES.     *00020000
000210******************************************************************00021000
000220                                                                  00022000
000230 01  RM010-VERSION-EXTR-RECORD.                                   00023000
000240     05  RM010-REPORT-ID         PIC X(10)    VALUE SPACES.       00024000
000250     05  RM010-REPORT-TIMESTAMP  PIC 9(14)    VALUE ZEROS.        00025000
000251     05  FILLER                  REDEFINES RM010-REPORT-TIMESTAMP.00025100
000260         10  RM010-RT-YEAR       PIC 9(4).                        00026001
000261         10  RM010-RT-MONTH      PIC 9(2).                        00026101
000262         10  RM010-RT-DAY        PIC 9(2).                        00026201
000263         10  RM010-RT-HOUR       PIC 9(2).                        00026301
000264         10  RM010-RT-MINUTE     PIC 9(2).                        00026401
000265         10  RM010-RT-SECOND     PIC 9(2).                        00026501
000266     05  FILLER                  REDEFINES RM010-REPORT-TIMESTAMP.00026600
000267         10  RM010-RT-DATE       PIC 9(8).                        00026701
000268         10  RM010-RT-TIME       PIC 9(6).                        00026801
000269     05  RM010-NUMBER-OF-PAGES   PIC 9(11)    VALUE ZEROS.        00026900
000310     05  RM010-REPORT-STATUS-CODE                                 00031000
000320                                 PIC X(1)     VALUE SPACES.       00032000
000321         88  RM010-RS-ACTIVE                  VALUE 'A'.          00032100
000322         88  RM010-RS-DELETED                 VALUE 'D'.          00032200
000323         88  RM010-RS-MIGRATED                VALUE 'M'.          00032300
000370     05  RM010-DATASET-NAME      PIC X(44)    VALUE SPACES.       00037000
000400     05  FILLER                  PIC X(20)    VALUE SPACES.       00040000
