000100******************************************************************00010000
000200*  INFOPAC SUMMARY XREF FILE FOR ALL DYNAMIC DISTRIBUTION TYPES  *00020001
000210*  AND KEY VALUES.  THE RECORD LENGTH IS 150 BYTES.              *00021006
000230******************************************************************00023000
000240                                                                  00024000
000250 01  RM004-INFOPAC-SUM-XREF-RECORD.                               00025000
000260     05  RM004-XREF-TYPE         PIC X(7)     VALUE SPACES.       00026002
000261         88  RM004-XT-DEPT-BYR                VALUE 'DEPTBYR'.    00026102
000262         88  RM004-XT-DEPT-DMM                VALUE 'DEPTDMM'.    00026202
000263         88  RM004-XT-DEPT-GMM                VALUE 'DEPTGMM'.    00026302
000264         88  RM004-XT-BUYER-BYR               VALUE 'BYRBYR_'.    00026402
000265         88  RM004-XT-BUYER                   VALUE 'BUYER__'.    00026502
000266         88  RM004-XT-BUYER-DMM               VALUE 'BYRDMM_'.    00026602
000267         88  RM004-XT-BUYER-GMM               VALUE 'BYRGMM_'.    00026702
000268         88  RM004-XT-DMM-BYR                 VALUE 'DMMBYR_'.    00026802
000269         88  RM004-XT-DMM                     VALUE 'DMM____'.    00026902
000270         88  RM004-XT-GMM                     VALUE 'GMM____'.    00027002
000271         88  RM004-XT-DEPT-ANL                VALUE 'DEPTANL'.    00027103
000272         88  RM004-XT-BUYER-ANL               VALUE 'BYRANL_'.    00027203
000273         88  RM004-XT-ANALYST                 VALUE 'ANALYST'.    00027303
000274         88  RM004-XT-STORE                   VALUE 'STORE__'.    00027403
000275         88  RM004-XT-STORE-MANAGER           VALUE 'STORMGR'.    00027503
000276         88  RM004-XT-STORE-LP-MANAGER        VALUE 'STORLPM'.    00027603
000277         88  RM004-XT-STORE-DIST-MANAGER      VALUE 'STORDMG'.    00027703
000278         88  RM004-XT-STORE-DIST-LP-MANAGER   VALUE 'STORDLP'.    00027803
000279         88  RM004-XT-STORE-DIST-AUDITOR      VALUE 'STORDAU'.    00027905
000280         88  RM004-XT-DIST-LP-MANAGER         VALUE 'DISTLPM'.    00028005
000281         88  RM004-XT-DIST-MANAGER            VALUE 'DISTMGR'.    00028105
000282         88  RM004-XT-DIST-STORE              VALUE 'DISTSTR'.    00028205
000283         88  RM004-XT-DIST-AUDITOR            VALUE 'DISTAUD'.    00028305
000284         88  RM004-XT-PERS-OPS                VALUE 'PERS/OP'.    00028406
000285         88  RM004-XT-AREA-SUPERVISOR         VALUE 'AA     '.    00028506
000286         88  RM004-XT-STORE-ADMIN             VALUE 'STRADM '.    00028606
000287         88  RM004-XT-DISTRICT-ADMIN          VALUE 'DISTADM'.    00028706
000288         88  RM004-XT-CFH                     VALUE 'CFH    '.    00028806
000289         88  RM004-XT-LP-SUPERVISOR           VALUE 'LPS    '.    00028906
000290         88  RM004-XT-LP-OFFICER              VALUE 'LPO    '.    00029006
000291         88  RM004-XT-LP-MANAGER              VALUE 'LPM    '.    00029106
000292         88  RM004-XT-DISTRICT-AUDITOR        VALUE 'DAUDTR '.    00029206
000300     05  FILLER                  PIC X(2)     VALUE SPACES.       00030006
000500     05  RM004-XREF-KEY          PIC X(10)    VALUE SPACES.       00050001
000750     05  RM004-XREF-USERID       PIC X(8)     VALUE SPACES.       00075001
000760     05  FILLER                  PIC X(12)    VALUE SPACES.       00076001
000770     05  RM004-XREF-STORE-KEY    PIC X(18)    VALUE SPACES.       00077007
000771     05  FILLER                  REDEFINES RM004-XREF-STORE-KEY.  00077110
000772         10  RM004-XREF-SK-STORE-NBR                              00077207
000773                                 PIC X(4).                        00077307
000774         10  FILLER              PIC X(14).                       00077407
000775     05  RM004-XREF-SK-STORE-NAME                                 00077507
000776                                 REDEFINES RM004-XREF-STORE-KEY   00077609
000777                                 PIC X(14).                       00077707
000780     05  FILLER                  PIC X(93)    VALUE SPACES.       00078007
