000100******************************************************************00010000
000200*  INFOPAC VERSION FILE LAYOUT.  THE RECORD LENGTH IS VARIABLE,  *00020000
000210*  WITH A MAXIMUM RECORD LENGTH OF 1060.  ONLY TABLE IDS WITH    *00021000
000211*  KOHL'S REQUIREMENTS, AND ONLY FIELDS WITHIN THE TABLE WITH    *00021100
000213*  KOHL'S REQUIREMENTS ARE DEFINED HERE.                         *00021300
000214*                                                                *00021400
000215*  SUBSTITUTING THE CURRENT VERSION ABBREVIATIONS, THE VENDOR    *00021500
000216*  MASTER DEFINITIONS CAN BE FOUND IN:                           *00021600
000217*                                                                *00021700
000218*  TKMS.INFOPAC.V#.COPYCOB(INVERH01) - REPORT VERSION            *00021800
000230******************************************************************00023000
000240                                                                  00024000
000250 01  RM006-INFOPAC-VERSION-RECORD.                                00025000
000260     05  RM006-TABLE-ID          PIC X(2)     VALUE SPACES.       00026000
000261         88  RM006-TI-REPORT-VERSION          VALUE '61'.         00026100
000264     05  RM006-VERSION-RECORD    PIC X(1058)  VALUE SPACES.       00026400
000266     05  RM006-REPORT-VERSION-RECORD                              00026600
000267                                 REDEFINES RM006-VERSION-RECORD.  00026700
000268         10  RM006-RV-REPORT-ID  PIC X(10).                       00026800
000269         10  RM006-RV-INVERTED-TIMESTAMP                          00026900
000270                                 PIC 9(14).                       00027000
000271         10  FILLER              PIC X(34).                       00027100
000272         10  RM006-RV-NUMBER-OF-PAGES                             00027200
000273                                 PIC S9(8)                        00027300
000274                                 COMP.                            00027400
000275         10  FILLER              PIC X(14).                       00027500
000276         10  RM006-RV-REPORT-STATUS-CODE                          00027600
000277                                 PIC X(1).                        00027700
000280                 88  RM006-RV-RS-ACTIVE       VALUE 'A'.          00028000
000281                 88  RM006-RV-RS-DELETED      VALUE 'D'.          00028100
000282                 88  RM006-RV-RS-MIGRATED     VALUE 'M'.          00028200
000283         10  FILLER              PIC X(47).                       00028302
000284         10  RM006-RV-DATASET-NAME                                00028400
003900                                 PIC X(44).                       00390000
003910         10  FILLER              PIC X(222).                      00391001
004000         10  FILLER              PIC X(668).                      00400001
