000100******************************************************************00010000
000200*  INFOPAC COPY EXTRACT.  THE RECORD LENGTH IS 150 BYTES.        *00020000
000210******************************************************************00021000
000220                                                                  00022000
000230 01  RM008-COPY-EXTR-RECORD.                                      00023000
000231     05  RM008-COPY-TYPE-CODE    PIC X(1)     VALUE SPACES.       00023100
000233         88  RM008-CT-PACKET-DEFN             VALUE '1'.          00023300
000234         88  RM008-CT-PACKET-DEFN-OVER        VALUE '2'.          00023400
000235         88  RM008-CT-COMPLETE-REPORT         VALUE '3'.          00023500
000236         88  RM008-CT-SELECTIVE-DIST          VALUE '4'.          00023600
000237         88  RM008-CT-GENERAL-DIST            VALUE '5'.          00023700
000238         88  RM008-CT-GENERAL-DIST-OVER       VALUE '6'.          00023800
000240         88  RM008-CT-COMPLETE-TOPIC          VALUE '7'.          00024000
000241         88  RM008-CT-SELECTIVE-TOPIC         VALUE '8'.          00024100
000242     05  RM008-REPORT-ID         PIC X(10)    VALUE SPACES.       00024200
000243     05  RM008-HIERARCHY-CODE    PIC X(30)    VALUE SPACES.       00024300
000245     05  RM008-REPORT-GROUP-ID   PIC X(4)     VALUE SPACES.       00024500
000247     05  RM008-RECIPIENT-ID      PIC X(10)    VALUE SPACES.       00024700
000254     05  RM008-NUMBER-OF-COPIES  PIC 9(2)     VALUE ZEROS.        00025401
000255     05  RM008-COPY-COMMENTS     PIC X(60)    VALUE SPACES.       00025500
000256     05  FILLER                  REDEFINES RM008-COPY-COMMENTS.   00025604
000257         10  FILLER              PIC X(11).                       00025704
000258         10  FILLER              PIC X(3).                        00025804
000259             88  RM008-CC-DYNAM-DISTRIB-IND   VALUE 'MBS'.        00025904
000260         10  FILLER              PIC X(1).                        00026004
000261         10  RM008-CC-DYNAM-DISTRIB-KEY                           00026104
000262                                 PIC X(11).                       00026204
000263         10  FILLER              PIC X(34).                       00026304
000264     05  RM008-VIEW-ACCESS-IND   PIC X(1)     VALUE SPACES.       00026404
000265         88  RM008-VA-VIEWING-ACCESS          VALUE 'Y'.          00026504
000270         88  RM008-VA-NO-VIEWING-ACCESS       VALUE 'N'.          00027000
000280     05  RM008-DYNAMIC-DISTRIBUTION-KEY.                          00028003
000290         10  RM008-DD-XREF-TYPE  PIC X(7)     VALUE SPACES.       00029003
000300         10  RM008-DD-XREF-KEY   PIC X(4)     VALUE SPACES.       00030003
001800     05  FILLER                  PIC X(21)    VALUE SPACES.       00180003
