000100******************************************************************00010000
000200*  INFOPAC DISTRIBUTION FILE LAYOUT.  THE RECORD IS VARIABLE,    *00020010
000210*  WITH A MAXIMUM RECORD LENGTH OF 2060.  ONLY TABLE IDS WITH    *00021010
000211*  KOHL'S REQUIREMENTS, AND ONLY FIELDS WITHIN THE TABLE WITH    *00021110
000221*  KOHL'S REQUIREMENTS ARE DEFINED HERE.                         *00022110
000222*                                                                *00022205
000223*  SUBSTITUTING THE CURRENT VERSION ABBREVIATIONS, THE VENDOR    *00022305
000224*  MASTER DEFINITIONS CAN BE FOUND IN:                           *00022405
000225*                                                                *00022505
000226*  TKMS.INFOPAC.V#.COPYCOB(INRECP01) - RECIPIENT                 *00022605
000227*  TKMS.INFOPAC.V#.COPYCOB(INCOPY01) - COPY                      *00022705
000228*  TKMS.INFOPAC.V#.COPYCOB(INREPT01) - REPORT                    *00022805
000230******************************************************************00023000
000240                                                                  00024000
000250 01  RM005-INFOPAC-DISTRIB-RECORD.                                00025000
000260     05  RM005-TABLE-ID          PIC X(2)     VALUE SPACES.       00026000
000261         88  RM005-TI-RECIPIENT               VALUE '04'.         00026100
000262         88  RM005-TI-COPY                    VALUE '01'.         00026200
000263         88  RM005-TI-REPORT                  VALUE '05'.         00026300
000264     05  RM005-DISTRIB-RECORD    PIC X(2058)  VALUE SPACES.       00026408
000290     05  RM005-RECIPIENT-RECORD  REDEFINES RM005-DISTRIB-RECORD.  00029005
000500         10  RM005-RR-RECIPIENT-ID                                00050005
000510                                 PIC X(10).                       00051005
000600         10  FILLER              PIC X(48).                       00060001
000800         10  RM005-RR-RECIPIENT-NAME                              00080005
000810                                 PIC X(35).                       00081001
000900         10  RM005-RR-RECIPIENT-TITLE                             00090005
000910                                 PIC X(35).                       00091001
001000         10  RM005-RR-RECIPIENT-ADDR-LINE-1                       00100005
001010                                 PIC X(35).                       00101001
001020         10  RM005-RR-RECIPIENT-ADDR-LINE-2                       00102005
001030                                 PIC X(35).                       00103001
001040         10  RM005-RR-RECIPIENT-ADDR-LINE-3                       00104005
001050                                 PIC X(35).                       00105001
001060         10  RM005-RR-RECIPIENT-ADDR-LINE-4                       00106005
001070                                 PIC X(35).                       00107001
001080         10  RM005-RR-RECIPIENT-ID-SEQUENCE                       00108005
001800                                 PIC S9(4)                        00180005
001801                                 COMP.                            00180105
001810*                                   DEFAULT 5000                  00181001
001900         10  RM005-RR-REMOTE-ID  PIC X(8).                        00190005
002000         10  RM005-RR-UPDATE-AUTHORITY-INFO.                      00200005
002001             15  RM005-RR-UA-ACCESS-CODE                          00200105
002010                                 PIC X(1).                        00201001
002300                 88  RM005-RR-UA-AC-NORMAL    VALUE 'Y'.          00230005
002310                 88  RM005-RR-UA-AC-GLOBAL    VALUE 'G'.          00231005
002320                 88  RM005-RR-UA-AC-NO-ACCESS VALUE 'N'.          00232005
002600             15  FILLER          PIC X(7).                        00260001
002900         10  RM005-RR-VIEWER-AUTHORITY-INFO.                      00290005
002910             15  RM005-RR-VA-ACCESS-CODE                          00291005
002920                                 PIC X(1).                        00292001
002930                 88  RM005-RR-VA-AC-NORMAL    VALUE 'Y'.          00293005
002940                 88  RM005-RR-VA-AC-GLOBAL    VALUE 'G'.          00294005
002950                 88  RM005-RR-VA-AC-NO-ACCESS VALUE 'N'.          00295005
002960             15  FILLER          PIC X(7).                        00296001
004500         10  FILLER              PIC X(16).                       00450001
004600         10  RM005-RR-JCL-ID     PIC X(10).                       00460005
004610         10  RM005-RR-PRINTER-ID PIC X(8).                        00461005
004800         10  FILLER              PIC X(18).                       00480001
004810         10  RM005-RR-TOPIC-ACCESS-CODE                           00481005
004820                                 PIC X(1).                        00482001
004830             88  RM005-RR-TA-NORMAL           VALUE 'Y'.          00483005
004840             88  RM005-RR-TA-GLOBAL           VALUE 'G'.          00484005
004850             88  RM005-RR-TA-NO-ACCESS        VALUE 'N'.          00485005
006100         10  FILLER              PIC X(51).                       00610001
006200         10  FILLER              PIC X(1660).                     00620008
006300     05  RM005-COPY-RECORD       REDEFINES RM005-DISTRIB-RECORD.  00630005
007700         10  RM005-CR-COPY-TYPE-CODE                              00770005
007710                                 PIC X(1).                        00771005
007720             88  RM005-CR-CT-PACKET-DEFN      VALUE '1'.          00772005
007740             88  RM005-CR-CT-PACKET-DEFN-OVER VALUE '2'.          00774005
007760             88  RM005-CR-CT-COMPLETE-REPORT  VALUE '3'.          00776005
007780             88  RM005-CR-CT-SELECTIVE-DIST   VALUE '4'.          00778005
007791             88  RM005-CR-CT-GENERAL-DIST     VALUE '5'.          00779105
007792             88  RM005-CR-CT-GENERAL-DIST-OVER                    00779205
007793                                              VALUE '6'.          00779305
007796             88  RM005-CR-CT-COMPLETE-TOPIC   VALUE '7'.          00779605
007798             88  RM005-CR-CT-SELECTIVE-TOPIC  VALUE '8'.          00779805
008600         10  RM005-CR-REPORT-ID  PIC X(10).                       00860005
008900         10  RM005-CR-HIERARCHY-CODE                              00890005
008910                                 PIC X(30).                       00891005
009200         10  RM005-CR-REPORT-GROUP-ID                             00920005
009210                                 PIC X(4).                        00921005
009300         10  RM005-CR-RECIPIENT-ID                                00930005
009310                                 PIC X(10).                       00931005
009400         10  FILLER              PIC X(3).                        00940005
009410         10  RM005-CR-COPY-SEQUENCE                               00941005
009420                                 PIC S9(4)                        00942005
009430                                 COMP SYNC.                       00943005
009431*                                   DEFAULT 5000                  00943105
009440         10  RM005-CR-NUMBER-OF-COPIES                            00944005
009450                                 PIC S9(4)                        00945005
009460                                 COMP SYNC.                       00946005
009800         10  FILLER              PIC X(6).                        00980005
010200         10  RM005-CR-COPY-COMMENTS                               01020005
010210                                 PIC X(60).                       01021005
010300         10  FILLER              PIC X(3).                        01030005
010400         10  RM005-CR-VIEW-ACCESS-IND                             01040005
010500                                 PIC X(1).                        01050005
011000             88  RM005-CR-VA-VIEWING-ACCESS   VALUE 'Y'.          01100005
011010             88  RM005-CR-VA-NO-VIEWING-ACCESS                    01101005
011011                                              VALUE 'N'.          01101105
011020         10  FILLER              PIC X(141).                      01102005
017700         10  FILLER              PIC X(1785).                     01770008
017710     05  RM005-REPORT-RECORD     REDEFINES RM005-DISTRIB-RECORD.  01771006
017720         10  RM005-TR-REPORT-ID  PIC X(10).                       01772006
019800         10  FILLER              PIC X(48).                       01980006
019810         10  RM005-TR-REPORT-NAME                                 01981006
019820                                 PIC X(60).                       01982006
019830         10  FILLER              PIC X(240).                      01983006
021200         10  RM005-TR-HIERARCHY-ID                                02120006
021210                                 PIC X(4).                        02121006
021220         10  RM005-TR-HIER-CODE-EDITOR                            02122006
021230                                 PIC X(8).                        02123006
021240         10  RM005-TR-GENERIC-HIER-CODE-IND                       02124006
021250                                 PIC X(1).                        02125006
021260             88  RM005-TR-GH-GENERIC-HIERARCHY                    02126006
021270                                              VALUE 'Y'.          02127006
021280         10  RM005-TR-HIER-EDITOR-TYPE                            02128006
021290                                 PIC X(1).                        02129006
021300             88  RM005-TR-HE-PROGRAM          VALUE 'P' ' '.      02130006
021400             88  RM005-TR-HE-COMMAND-PROC     VALUE 'C'.          02140006
022210         10  FILLER              PIC X(76).                       02221006
029700         10  RM005-TR-PURGE-QUANTITY                              02970007
029710                                 PIC S9(4)                        02971007
029720                                 COMP SYNC.                       02972007
029730         10  FILLER              PIC X(24).                       02973009
029740         10  RM005-TR-PAGE-ROW-START-1                            02974008
029750                                 PIC S9(4)                        02975008
029760                                 COMP SYNC.                       02976008
029770         10  FILLER              PIC X(332).                      02977009
029780         10  FILLER              PIC X(1250).                     02978008
