000100******************************************************************00010000
000200*  INFOPAC RECIPIENT EXTRACT.  THE RECORD LENGTH IS 150 BYTES.   *00020001
000229******************************************************************00022900
000230                                                                  00023000
000240 01  RM007-RECIPIENT-EXTR-RECORD.                                 00024000
000265     05  RM007-RECIPIENT-ID      PIC X(10)    VALUE SPACES.       00026500
000268     05  RM007-RECIPIENT-NAME    PIC X(35)    VALUE SPACES.       00026800
000269     05  RM007-RECIPIENT-TITLE   PIC X(35)    VALUE SPACES.       00026900
000290     05  RM007-RECIPIENT-ADDR-LINE-1                              00029000
000300                                 PIC X(35)    VALUE SPACES.       00030000
001000     05  RM007-RECIPIENT-ID-SEQUENCE                              00100000
001100                                 PIC 9(4)     VALUE ZEROS.        00110000
001200     05  RM007-RECIPIENT-PRINTER-ID                               00120000
001400                                 PIC X(8)     VALUE SPACES.       00140002
001600     05  RM007-UPDATE-ACCESS-CODE                                 00160000
001700                                 PIC X(1)     VALUE SPACES.       00170002
001800         88  RM007-UA-NORMAL                  VALUE 'Y'.          00180000
001810         88  RM007-UA-GLOBAL                  VALUE 'G'.          00181000
001820         88  RM007-UA-NO-ACCESS               VALUE 'N'.          00182000
001830     05  RM007-VIEWER-ACCESS-CODE                                 00183000
001840                                 PIC X(1)     VALUE SPACES.       00184002
001850         88  RM007-VA-NORMAL                  VALUE 'Y'.          00185000
001860         88  RM007-VA-GLOBAL                  VALUE 'G'.          00186000
001870         88  RM007-VA-NO-ACCESS               VALUE 'N'.          00187000
003000     05  RM007-JCL-ID            PIC X(10)    VALUE SPACES.       00300002
003010         88  RM007-DEFAULT-PRINT-JCL          VALUE 'ARCHPRNT'.   00301000
003020     05  FILLER                  PIC X(11)    VALUE SPACES.       00302002
