*          DATA SET RVKM100    AT LEVEL 001 AS OF 11/25/95                      
*          DATA SET RVKM100    AT LEVEL 009 AS OF 01/04/93              00001   
*****************************************************************       00002   
*       MAPSET  RVKM100                                                 00003   
*       MAP     RV100A                                                  00004   
*       PROGRAM RVKCS100                                                00005   
*       TRANSID T100                                                    00006   
*       SYSTEM  CICS ARCHTECTURE - RTV                                  00007   
*****************************************************************       00008   
        PRINT  NOGEN                                                    00009   
RVKM100 DFHMSD TYPE=DSECT,                                             C00010   
               LANG=COBOL,                                             C00011   
               MODE=INOUT,                                             C00012   
               STORAGE=AUTO,                                           C00013   
               TERM=3270-2,                                            C00014   
               TIOAPFX=YES                                              00015   
**************                                                          00016   
RV100A  DFHMDI SIZE=(24,80),                                           C00017   
               CTRL=(FREEKB),                                          C00018   
               MAPATTS=(COLOR,HILIGHT),                                C00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
**************                                                          00021   
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,NORM),               C00022   
               COLOR=NEUTRAL                                            00023   
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL                                            00025   
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00026   
               COLOR=NEUTRAL                                            00027   
ANETNAM DFHMDF POS=(01,61),LENGTH=08,ATTRB=(ASKIP,NORM),               C00028   
               COLOR=NEUTRAL                                            00029   
AMNEMIC DFHMDF POS=(01,71),LENGTH=08,ATTRB=(ASKIP,NORM),               C00030   
               COLOR=NEUTRAL                                            00031   
AOBJECT DFHMDF POS=(03,39),LENGTH=10,ATTRB=(ASKIP,NORM),               C00032   
               COLOR=NEUTRAL                                            00033   
ASTRTIT DFHMDF POS=(03,52),LENGTH=05,ATTRB=(NUM,UNPROT,NORM,IC),       C00034   
               COLOR=GREEN,                                            C00035   
               HILIGHT=UNDERLINE,                                      C00036   
               PICOUT='ZZZZ9'                                           00037   
        DFHMDF POS=(03,58),LENGTH=02,ATTRB=(ASKIP,NORM),               C00038   
               COLOR=NEUTRAL,                                          C00039   
               INITIAL='TO'                                             00040   
AENDIT  DFHMDF POS=(03,62),LENGTH=05,ATTRB=(ASKIP,NORM,FSET),          C00041   
               COLOR=BLUE,                                             C00042   
               PICOUT='ZZZZ9'                                           00043   
        DFHMDF POS=(03,69),LENGTH=02,ATTRB=(ASKIP,NORM),               C00044   
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='OF'                                             00046   
ATOTIT  DFHMDF POS=(03,73),LENGTH=05,ATTRB=(ASKIP,NORM),               C00047   
               COLOR=BLUE,                                             C00048   
               PICOUT='ZZZZ9'                                           00049   
*                                                                       00050   
        DFHMDF POS=(04,12),LENGTH=05,ATTRB=(PROT,NORM),                C00051   
               COLOR=NEUTRAL,                                          C00052   
               INITIAL='ORDER'                                          00053   
        DFHMDF POS=(04,49),LENGTH=06,ATTRB=(PROT,NORM),                C00054   
               COLOR=NEUTRAL,                                          C00055   
               INITIAL='CREATE'                                         00056   
*                                                                       00057   
        DFHMDF POS=(05,02),LENGTH=03,ATTRB=(PROT,NORM),                C00058   
               COLOR=NEUTRAL,                                          C00059   
               INITIAL='SEL'                                            00060   
        DFHMDF POS=(05,06),LENGTH=10,ATTRB=(PROT,NORM),                C00061   
               COLOR=NEUTRAL,                                          C00062   
               INITIAL='ACT TYP/ST'                                     00063   
        DFHMDF POS=(05,18),LENGTH=06,ATTRB=(PROT,NORM),                C00064   
               COLOR=NEUTRAL,                                          C00065   
               INITIAL='REQ RA'                                         00066   
        DFHMDF POS=(05,30),LENGTH=11,ATTRB=(PROT,NORM),                C00067   
               COLOR=NEUTRAL,                                          C00068   
               INITIAL='VENDOR NAME'                                    00069   
        DFHMDF POS=(05,50),LENGTH=04,ATTRB=(PROT,NORM),                C00070   
               COLOR=NEUTRAL,                                          C00071   
               INITIAL='DATE'                                           00072   
        DFHMDF POS=(05,63),LENGTH=05,ATTRB=(PROT,NORM),                C00073   
               COLOR=NEUTRAL,                                          C00074   
               INITIAL='BUYER'                                          00075   
        DFHMDF POS=(05,73),LENGTH=06,ATTRB=(PROT,NORM),                C00076   
               COLOR=NEUTRAL,                                          C00077   
               INITIAL='DUNS #'                                         00078   
*                                                                       00079   
ASEL01  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00080   
               HILIGHT=UNDERLINE,                                      C00081   
               COLOR=GREEN                                              00082   
        DFHMDF POS=(06,04),LENGTH=01,ATTRB=(ASKIP)                      00083   
AACT01  DFHMDF POS=(06,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00084   
               COLOR=BLUE                                               00085   
ASTAT01 DFHMDF POS=(06,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00086   
               COLOR=BLUE                                               00087   
ATYPE01 DFHMDF POS=(06,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00088   
               COLOR=BLUE                                               00089   
ARQRA01 DFHMDF POS=(06,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00090   
               COLOR=BLUE                                               00091   
AVNAM01 DFHMDF POS=(06,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00092   
               COLOR=BLUE                                               00093   
ACDTE01 DFHMDF POS=(06,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00094   
               COLOR=BLUE                                               00095   
ABUYR01 DFHMDF POS=(06,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00096   
               COLOR=BLUE                                               00097   
ADUNS01 DFHMDF POS=(06,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00098   
               COLOR=BLUE                                               00099   
*                                                                       00100   
ASEL02  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00101   
               HILIGHT=UNDERLINE,                                      C00102   
               COLOR=GREEN                                              00103   
        DFHMDF POS=(07,04),LENGTH=01,ATTRB=(ASKIP)                      00104   
AACT02  DFHMDF POS=(07,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00105   
               COLOR=BLUE                                               00106   
ASTAT02 DFHMDF POS=(07,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00107   
               COLOR=BLUE                                               00108   
ATYPE02 DFHMDF POS=(07,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00109   
               COLOR=BLUE                                               00110   
ARQRA02 DFHMDF POS=(07,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00111   
               COLOR=BLUE                                               00112   
AVNAM02 DFHMDF POS=(07,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00113   
               COLOR=BLUE                                               00114   
ACDTE02 DFHMDF POS=(07,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00115   
               COLOR=BLUE                                               00116   
ABUYR02 DFHMDF POS=(07,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00117   
               COLOR=BLUE                                               00118   
ADUNS02 DFHMDF POS=(07,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00119   
               COLOR=BLUE                                               00120   
*                                                                       00121   
ASEL03  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00122   
               HILIGHT=UNDERLINE,                                      C00123   
               COLOR=GREEN                                              00124   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00125   
AACT03  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00126   
               COLOR=BLUE                                               00127   
ASTAT03 DFHMDF POS=(08,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00128   
               COLOR=BLUE                                               00129   
ATYPE03 DFHMDF POS=(08,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00130   
               COLOR=BLUE                                               00131   
ARQRA03 DFHMDF POS=(08,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00132   
               COLOR=BLUE                                               00133   
AVNAM03 DFHMDF POS=(08,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00134   
               COLOR=BLUE                                               00135   
ACDTE03 DFHMDF POS=(08,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00136   
               COLOR=BLUE                                               00137   
ABUYR03 DFHMDF POS=(08,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00138   
               COLOR=BLUE                                               00139   
ADUNS03 DFHMDF POS=(08,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00140   
               COLOR=BLUE                                               00141   
*                                                                       00142   
ASEL04  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00143   
               HILIGHT=UNDERLINE,                                      C00144   
               COLOR=GREEN                                              00145   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00146   
AACT04  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00147   
               COLOR=BLUE                                               00148   
ASTAT04 DFHMDF POS=(09,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00149   
               COLOR=BLUE                                               00150   
ATYPE04 DFHMDF POS=(09,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00151   
               COLOR=BLUE                                               00152   
ARQRA04 DFHMDF POS=(09,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00153   
               COLOR=BLUE                                               00154   
AVNAM04 DFHMDF POS=(09,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00155   
               COLOR=BLUE                                               00156   
ACDTE04 DFHMDF POS=(09,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00157   
               COLOR=BLUE                                               00158   
ABUYR04 DFHMDF POS=(09,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00159   
               COLOR=BLUE                                               00160   
ADUNS04 DFHMDF POS=(09,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00161   
               COLOR=BLUE                                               00162   
*                                                                       00163   
ASEL05  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00164   
               HILIGHT=UNDERLINE,                                      C00165   
               COLOR=GREEN                                              00166   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00167   
AACT05  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00168   
               COLOR=BLUE                                               00169   
ASTAT05 DFHMDF POS=(10,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00170   
               COLOR=BLUE                                               00171   
ATYPE05 DFHMDF POS=(10,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00172   
               COLOR=BLUE                                               00173   
ARQRA05 DFHMDF POS=(10,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00174   
               COLOR=BLUE                                               00175   
AVNAM05 DFHMDF POS=(10,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00176   
               COLOR=BLUE                                               00177   
ACDTE05 DFHMDF POS=(10,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00178   
               COLOR=BLUE                                               00179   
ABUYR05 DFHMDF POS=(10,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00180   
               COLOR=BLUE                                               00181   
ADUNS05 DFHMDF POS=(10,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00182   
               COLOR=BLUE                                               00183   
*                                                                       00184   
ASEL06  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00185   
               HILIGHT=UNDERLINE,                                      C00186   
               COLOR=GREEN                                              00187   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00188   
AACT06  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00189   
               COLOR=BLUE                                               00190   
ASTAT06 DFHMDF POS=(11,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00191   
               COLOR=BLUE                                               00192   
ATYPE06 DFHMDF POS=(11,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00193   
               COLOR=BLUE                                               00194   
ARQRA06 DFHMDF POS=(11,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00195   
               COLOR=BLUE                                               00196   
AVNAM06 DFHMDF POS=(11,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00197   
               COLOR=BLUE                                               00198   
ACDTE06 DFHMDF POS=(11,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00199   
               COLOR=BLUE                                               00200   
ABUYR06 DFHMDF POS=(11,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00201   
               COLOR=BLUE                                               00202   
ADUNS06 DFHMDF POS=(11,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00203   
               COLOR=BLUE                                               00204   
*                                                                       00205   
ASEL07  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00206   
               HILIGHT=UNDERLINE,                                      C00207   
               COLOR=GREEN                                              00208   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00209   
AACT07  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00210   
               COLOR=BLUE                                               00211   
ASTAT07 DFHMDF POS=(12,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00212   
               COLOR=BLUE                                               00213   
ATYPE07 DFHMDF POS=(12,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00214   
               COLOR=BLUE                                               00215   
ARQRA07 DFHMDF POS=(12,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00216   
               COLOR=BLUE                                               00217   
AVNAM07 DFHMDF POS=(12,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00218   
               COLOR=BLUE                                               00219   
ACDTE07 DFHMDF POS=(12,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00220   
               COLOR=BLUE                                               00221   
ABUYR07 DFHMDF POS=(12,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00222   
               COLOR=BLUE                                               00223   
ADUNS07 DFHMDF POS=(12,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00224   
               COLOR=BLUE                                               00225   
*                                                                       00226   
ASEL08  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00227   
               HILIGHT=UNDERLINE,                                      C00228   
               COLOR=GREEN                                              00229   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00230   
AACT08  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00231   
               COLOR=BLUE                                               00232   
ASTAT08 DFHMDF POS=(13,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00233   
               COLOR=BLUE                                               00234   
ATYPE08 DFHMDF POS=(13,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00235   
               COLOR=BLUE                                               00236   
ARQRA08 DFHMDF POS=(13,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00237   
               COLOR=BLUE                                               00238   
AVNAM08 DFHMDF POS=(13,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00239   
               COLOR=BLUE                                               00240   
ACDTE08 DFHMDF POS=(13,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00241   
               COLOR=BLUE                                               00242   
ABUYR08 DFHMDF POS=(13,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00243   
               COLOR=BLUE                                               00244   
ADUNS08 DFHMDF POS=(13,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00245   
               COLOR=BLUE                                               00246   
*                                                                       00247   
ASEL09  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00248   
               HILIGHT=UNDERLINE,                                      C00249   
               COLOR=GREEN                                              00250   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00251   
AACT09  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00252   
               COLOR=BLUE                                               00253   
ASTAT09 DFHMDF POS=(14,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00254   
               COLOR=BLUE                                               00255   
ATYPE09 DFHMDF POS=(14,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00256   
               COLOR=BLUE                                               00257   
ARQRA09 DFHMDF POS=(14,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00258   
               COLOR=BLUE                                               00259   
AVNAM09 DFHMDF POS=(14,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00260   
               COLOR=BLUE                                               00261   
ACDTE09 DFHMDF POS=(14,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00262   
               COLOR=BLUE                                               00263   
ABUYR09 DFHMDF POS=(14,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00264   
               COLOR=BLUE                                               00265   
ADUNS09 DFHMDF POS=(14,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=BLUE                                               00267   
*                                                                       00268   
ASEL10  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00269   
               HILIGHT=UNDERLINE,                                      C00270   
               COLOR=GREEN                                              00271   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00272   
AACT10  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00273   
               COLOR=BLUE                                               00274   
ASTAT10 DFHMDF POS=(15,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00275   
               COLOR=BLUE                                               00276   
ATYPE10 DFHMDF POS=(15,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00277   
               COLOR=BLUE                                               00278   
ARQRA10 DFHMDF POS=(15,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00279   
               COLOR=BLUE                                               00280   
AVNAM10 DFHMDF POS=(15,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00281   
               COLOR=BLUE                                               00282   
ACDTE10 DFHMDF POS=(15,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00283   
               COLOR=BLUE                                               00284   
ABUYR10 DFHMDF POS=(15,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00285   
               COLOR=BLUE                                               00286   
ADUNS10 DFHMDF POS=(15,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00287   
               COLOR=BLUE                                               00288   
*                                                                       00289   
ASEL11  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00290   
               HILIGHT=UNDERLINE,                                      C00291   
               COLOR=GREEN                                              00292   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00293   
AACT11  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00294   
               COLOR=BLUE                                               00295   
ASTAT11 DFHMDF POS=(16,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00296   
               COLOR=BLUE                                               00297   
ATYPE11 DFHMDF POS=(16,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00298   
               COLOR=BLUE                                               00299   
ARQRA11 DFHMDF POS=(16,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00300   
               COLOR=BLUE                                               00301   
AVNAM11 DFHMDF POS=(16,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00302   
               COLOR=BLUE                                               00303   
ACDTE11 DFHMDF POS=(16,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00304   
               COLOR=BLUE                                               00305   
ABUYR11 DFHMDF POS=(16,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00306   
               COLOR=BLUE                                               00307   
ADUNS11 DFHMDF POS=(16,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00308   
               COLOR=BLUE                                               00309   
*                                                                       00310   
ASEL12  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00311   
               HILIGHT=UNDERLINE,                                      C00312   
               COLOR=GREEN                                              00313   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00314   
AACT12  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00315   
               COLOR=BLUE                                               00316   
ASTAT12 DFHMDF POS=(17,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00317   
               COLOR=BLUE                                               00318   
ATYPE12 DFHMDF POS=(17,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00319   
               COLOR=BLUE                                               00320   
ARQRA12 DFHMDF POS=(17,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00321   
               COLOR=BLUE                                               00322   
AVNAM12 DFHMDF POS=(17,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00323   
               COLOR=BLUE                                               00324   
ACDTE12 DFHMDF POS=(17,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00325   
               COLOR=BLUE                                               00326   
ABUYR12 DFHMDF POS=(17,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00327   
               COLOR=BLUE                                               00328   
ADUNS12 DFHMDF POS=(17,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00329   
               COLOR=BLUE                                               00330   
*                                                                       00331   
ASEL13  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00332   
               HILIGHT=UNDERLINE,                                      C00333   
               COLOR=GREEN                                              00334   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00335   
AACT13  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00336   
               COLOR=BLUE                                               00337   
ASTAT13 DFHMDF POS=(18,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00338   
               COLOR=BLUE                                               00339   
ATYPE13 DFHMDF POS=(18,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00340   
               COLOR=BLUE                                               00341   
ARQRA13 DFHMDF POS=(18,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00342   
               COLOR=BLUE                                               00343   
AVNAM13 DFHMDF POS=(18,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00344   
               COLOR=BLUE                                               00345   
ACDTE13 DFHMDF POS=(18,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00346   
               COLOR=BLUE                                               00347   
ABUYR13 DFHMDF POS=(18,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00348   
               COLOR=BLUE                                               00349   
ADUNS13 DFHMDF POS=(18,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00350   
               COLOR=BLUE                                               00351   
*                                                                       00352   
ASEL14  DFHMDF POS=(19,02),LENGTH=01,ATTRB=(UNPROT,NORM,FSET),         C00353   
               HILIGHT=UNDERLINE,                                      C00354   
               COLOR=GREEN                                              00355   
        DFHMDF POS=(19,04),LENGTH=01,ATTRB=(ASKIP)                      00356   
AACT14  DFHMDF POS=(19,06),LENGTH=03,ATTRB=(ASKIP,NORM),               C00357   
               COLOR=BLUE                                               00358   
ASTAT14 DFHMDF POS=(19,11),LENGTH=01,ATTRB=(ASKIP,NORM),               C00359   
               COLOR=BLUE                                               00360   
ATYPE14 DFHMDF POS=(19,14),LENGTH=01,ATTRB=(ASKIP,NORM),               C00361   
               COLOR=BLUE                                               00362   
ARQRA14 DFHMDF POS=(19,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00363   
               COLOR=BLUE                                               00364   
AVNAM14 DFHMDF POS=(19,31),LENGTH=15,ATTRB=(ASKIP,NORM),               C00365   
               COLOR=BLUE                                               00366   
ACDTE14 DFHMDF POS=(19,49),LENGTH=08,ATTRB=(ASKIP,NORM),               C00367   
               COLOR=BLUE                                               00368   
ABUYR14 DFHMDF POS=(19,60),LENGTH=10,ATTRB=(ASKIP,NORM),               C00369   
               COLOR=BLUE                                               00370   
ADUNS14 DFHMDF POS=(19,71),LENGTH=09,ATTRB=(ASKIP,NORM),               C00371   
               COLOR=BLUE                                               00372   
*                                                                       00373   
        DFHMDF POS=(20,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00374   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00375   
ASELIT  DFHMDF POS=(20,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00376   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00377   
*                                                                       00378   
AMSG    DFHMDF POS=(21,01),LENGTH=78,ATTRB=(ASKIP,BRT),                C00379   
               COLOR=NEUTRAL                                            00380   
        DFHMDF POS=(22,01),LENGTH=11,ATTRB=(PROT,BRT),                 C00381   
               COLOR=NEUTRAL,                                          C00382   
               INITIAL='COMMAND===>'                                    00383   
ANAVCMD DFHMDF POS=(22,14),LENGTH=08,ATTRB=(UNPROT,NORM),              C00384   
               COLOR=GREEN,                                            C00385   
               HILIGHT=UNDERLINE                                        00386   
        DFHMDF POS=(22,23),LENGTH=01,ATTRB=(ASKIP)                      00387   
        DFHMDF POS=(22,25),LENGTH=07,ATTRB=(PROT,BRT),                 C00388   
               COLOR=NEUTRAL,                                          C00389   
               INITIAL='KEY===>'                                        00390   
ANAVKEY DFHMDF POS=(22,33),LENGTH=25,ATTRB=(UNPROT,NORM,FSET),         C00391   
               COLOR=GREEN,                                            C00392   
               HILIGHT=UNDERLINE                                        00393   
        DFHMDF POS=(22,59),LENGTH=01,ATTRB=(ASKIP)                      00394   
        DFHMDF POS=(22,63),LENGTH=16,ATTRB=(PROT,NORM),                C00395   
               INITIAL='PA2=OTHER F KEYS',                             C00396   
               COLOR=NEUTRAL                                            00397   
AFKLIN1 DFHMDF POS=(23,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00398   
               COLOR=NEUTRAL                                            00399   
AFKLIN2 DFHMDF POS=(24,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00400   
               COLOR=NEUTRAL                                            00401   
**************                                                          00402   
        DFHMSD TYPE=FINAL                                               00403   
**************                                                          00404   
        END                                                             00405   
