*          DATA SET RVKM115    AT LEVEL 008 AS OF 03/22/95                      
        PRINT NOGEN                                                     00001   
RVKM150 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES               00002   
RV115A  DFHMDI SIZE=(19,80),CTRL=(FREEKB,FRSET),LINE=2,COLUMN=1,       X00003   
               MAPATTS=(COLOR,HILIGHT),DSATTS=(COLOR,HILIGHT)           00004   
*********************************************************************** 00005   
        DFHMDF POS=(4,14),LENGTH=33,ATTRB=(ASKIP,BRT),                 X00006   
               INITIAL='THE FOLLOWING FIELDS ARE REQUIRED'              00007   
*********************************************************************** 00008   
        DFHMDF POS=(6,19),LENGTH=22,ATTRB=(ASKIP,BRT),                 X00009   
               INITIAL='RTV LOCATION.........:'                         00010   
AOPUID  DFHMDF POS=(6,42),LENGTH=04,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00011**5
               PICOUT='ZZZZ'                                            00012**5
AOPDESC DFHMDF POS=(6,47),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=025           00013**5
*********************************************************************** 00014   
        DFHMDF POS=(7,19),LENGTH=22,ATTRB=(ASKIP,BRT),                 X00015   
               INITIAL='STARTING/ENDING DATES:'                         00016   
ASMONTH DFHMDF POS=(7,42),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00017**2
               PICOUT='XX'                                              00018**8
ASDAY   DFHMDF POS=(7,45),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00019**2
               PICOUT='XX'                                              00020**8
ASYEAR  DFHMDF POS=(7,48),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00021   
               PICOUT='XX'                                              00022**8
        DFHMDF POS=(7,51),LENGTH=07,ATTRB=(ASKIP,BRT),                 X00023   
               INITIAL='THROUGH'                                        00024   
AEMONTH DFHMDF POS=(7,59),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00025   
               PICOUT='XX'                                              00026**8
AEDAY   DFHMDF POS=(7,62),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00027   
               PICOUT='XX'                                              00028**8
AEYEAR  DFHMDF POS=(7,65),LENGTH=02,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00029   
               PICOUT='XX'                                              00030**8
        DFHMDF POS=(7,68),LENGTH=1,ATTRB=ASKIP                          00031**2
*********************************************************************** 00032**3
        DFHMDF POS=(8,19),LENGTH=22,ATTRB=(ASKIP,BRT),                 X00033**3
               INITIAL='PRINTER DESTINATION..:'                         00034**3
ADEST   DFHMDF POS=(8,42),LENGTH=06,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00035**3
               PICOUT='XXXXXX'                                          00036**3
        DFHMDF POS=(8,49),LENGTH=1,ATTRB=ASKIP                          00037**3
*********************************************************************** 00038   
        DFHMDF POS=(9,19),LENGTH=22,ATTRB=(ASKIP,BRT),                 X00039**3
               INITIAL='REPORT COPIES........:'                         00040**3
ARPTCPY DFHMDF POS=(9,42),LENGTH=01,ATTRB=UNPROT,HILIGHT=UNDERLINE,    X00041**3
               PICOUT='Z'                                               00042**3
        DFHMDF POS=(9,44),LENGTH=1,ATTRB=ASKIP                          00043**3
*********************************************************************** 00038   
        DFHMDF POS=(10,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00039**3
               INITIAL='REPORT TYPE..........:'                         00040**3
ARPTTYP DFHMDF POS=(10,42),LENGTH=01,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00041**3
               PICOUT='X'                                               00042**3
ARTDESC DFHMDF POS=(10,44),COLOR=BLUE,ATTRB=ASKIP,LENGTH=025            00043**3
*********************************************************************** 00044**3
        DFHMDF POS=(12,14),LENGTH=42,ATTRB=(ASKIP,BRT),                X00045**3
               INITIAL='PLEASE ENTER ONE OR MORE OF THE FOLLOWING:'     00046**3
*********************************************************************** 00047**3
        DFHMDF POS=(14,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00048**3
               INITIAL='LISTING TYPE.........:'                         00049**3
ALTYPE  DFHMDF POS=(14,42),LENGTH=01,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00050**3
               PICOUT='X'                                               00051**3
ALTDESC DFHMDF POS=(14,44),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=025          00052**3
*********************************************************************** 00053**3
        DFHMDF POS=(15,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00054**3
               INITIAL='LISTING STATUS.......:'                         00055**3
ALSTAT  DFHMDF POS=(15,42),LENGTH=01,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00056**3
               PICOUT='X'                                               00057**3
ALSDESC DFHMDF POS=(15,44),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=025          00058**3
*********************************************************************** 00059**3
        DFHMDF POS=(16,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00060**3
               INITIAL='STORAGE LOCATION.....:'                         00061**3
ALOC    DFHMDF POS=(16,42),LENGTH=13,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00062**3
               PICOUT='XXXXXXXXXXXXX'                                   00063**3
        DFHMDF POS=(16,56),ATTRB=(ASKIP),LENGTH=01                      00064**3
*********************************************************************** 00065**3
        DFHMDF POS=(17,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00066**3
               INITIAL='BUYER NUMBER.........:'                         00067**3
ABUYER  DFHMDF POS=(17,42),LENGTH=03,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00068**3
               PICOUT='XXX'                                             00069**8
ABYRDES DFHMDF POS=(17,46),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=032          00070**6
*********************************************************************** 00071**3
        DFHMDF POS=(18,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00072**3
               INITIAL='DEPARTMENT NUMBER....:'                         00073**3
ADEPT   DFHMDF POS=(18,42),LENGTH=03,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00074**3
               PICOUT='XXX'                                             00075**8
ADPTDES DFHMDF POS=(18,46),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=025          00076**3
*********************************************************************** 00077**3
        DFHMDF POS=(19,19),LENGTH=22,ATTRB=(ASKIP,BRT),                X00078**3
               INITIAL='VENDOR NUMBER........:'                         00079**3
AVENDOR DFHMDF POS=(19,42),LENGTH=09,ATTRB=UNPROT,HILIGHT=UNDERLINE,   X00080**4
               PICOUT='XXXXXXXXX'                                       00081**8
AVNDDES DFHMDF POS=(19,52),COLOR=BLUE,ATTRB=(ASKIP),LENGTH=025          00082**3
*********************************************************************** 00083**3
        DFHMSD TYPE=FINAL                                               00084   
        PRINT NOGEN                                                     00085   
        END                                                             00086   
