*********************************************************************** 00006   
*       MAPSET  RVKM101                                                 00007   
*       MAP     RV101A                                                  00008   
*       PROGRAM RVKCS101 - REQ RA HEADER UPDATE                         00009   
*       TRANSID T101                                                    00010   
*       SYSTEM  CICS ARCHITECTURE                                       00011   
*********************************************************************** 00012   
        PRINT  NOGEN                                                    00013   
RVKM101 DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES,             C00014   
               CTRL=(FREEKB)                                            00015   
RV101A  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),                   C00016   
               DSATTS=(COLOR,HILIGHT)                                   00017   
ADATE   DFHMDF POS=(1,2),LENGTH=10,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00018   
ATIME   DFHMDF POS=(1,14),LENGTH=8,ATTRB=(PROT,BRT),COLOR=NEUTRAL       00019   
ATITLE  DFHMDF POS=(1,25),LENGTH=31,ATTRB=(PROT,BRT),COLOR=NEUTRAL,    C00020   
               INITIAL='       RA HEADER UPDATE        '                00021   
ANETNAM DFHMDF POS=(1,61),LENGTH=08,ATTRB=(PROT,BRT),COLOR=NEUTRAL      00022   
AMNEMIC DFHMDF POS=(01,71),LENGTH=08,ATTRB=(PROT,BRT),COLOR=NEUTRAL     00023   
*                                                                       00024   
        DFHMDF POS=(03,01),LENGTH=13,INITIAL='REQ LIST NUM:',          C00025   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00026   
ARRANBR DFHMDF POS=(03,16),LENGTH=12,ATTRB=(PROT,NORM),COLOR=BLUE,     C00027   
               PICOUT='ZZZZZZZZZZZZ'                                            
*                                                                       00028   
        DFHMDF POS=(03,41),LENGTH=13,                                  C00029**2
               INITIAL='  ORDER TYPE:',                                C00030   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00031   
ATYPE   DFHMDF POS=(03,55),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE       00032**2
*                                                                       00033**3
        DFHMDF POS=(04,01),LENGTH=13,                                  C00034**3
               INITIAL='LOCATION....:',                                C00035**3
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00036**3
ARLOCTN DFHMDF POS=(04,16),LENGTH=15,ATTRB=(PROT,NORM),COLOR=BLUE       00037**6
        DFHMDF POS=(04,32),LENGTH=01,ATTRB=(ASKIP)                      00038**6
*                                                                       00039   
        DFHMDF POS=(04,41),LENGTH=13,                                  C00040**2
               INITIAL='      STATUS:',                                C00041**4
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00042   
ASTATUS DFHMDF POS=(04,55),LENGTH=08,ATTRB=(PROT,NORM),COLOR=BLUE       00043**2
*                                                                       00044**4
        DFHMDF POS=(05,41),LENGTH=13,                                  C00045**4
               INITIAL=' STATUS DATE:',                                C00046**4
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00047**4
ASTDATE DFHMDF POS=(05,55),LENGTH=10,ATTRB=(PROT,NORM),COLOR=BLUE       00048**4
*                                                                       00049   
        DFHMDF POS=(06,01),LENGTH=13,                                  C00050**3
               INITIAL='BUYER.......:',                                C00051**3
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00052   
ARBUYER DFHMDF POS=(06,16),LENGTH=15,ATTRB=(PROT,NORM),COLOR=BLUE       00053**3
*                                                                       00054   
        DFHMDF POS=(07,01),LENGTH=13,                                  C00055   
               INITIAL='VENDOR DUNS#:',                                C00056   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00057   
ARIVNRN DFHMDF POS=(07,16),LENGTH=09,ATTRB=(PROT,NORM),COLOR=BLUE       00058   
*                                                                       00059   
ARIVNRD DFHMDF POS=(08,16),LENGTH=25,ATTRB=(PROT,NORM),COLOR=BLUE       00060   
*                                                                       00061   
        DFHMDF POS=(10,01),LENGTH=13,                                  C00062   
               INITIAL='ATTN NAME...:',                                C00063   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00064   
ARANAME DFHMDF POS=(10,16),LENGTH=25,ATTRB=(UNPROT,IC),                C00065   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00066   
        DFHMDF POS=(10,42),LENGTH=01,ATTRB=(ASKIP)                      00067   
*                                                                       00068   
        DFHMDF POS=(11,43),LENGTH=11,                                  C00069   
               INITIAL='TOT QTY...:',                                  C00070   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00071   
ARTOTQT DFHMDF POS=(11,55),LENGTH=09,ATTRB=(PROT,NORM),COLOR=BLUE       00072   
*                                                                       00073   
        DFHMDF POS=(12,01),LENGTH=13,                                  C00074   
               INITIAL='VENDOR ADDR.:',                                C00075   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00076   
ARVADDR DFHMDF POS=(12,16),LENGTH=25,ATTRB=(UNPROT),                   C00077   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00078   
        DFHMDF POS=(12,42),LENGTH=01,ATTRB=(ASKIP)                      00079   
*                                                                       00080   
        DFHMDF POS=(13,01),LENGTH=13,                                  C00081   
               INITIAL='CITY........:',                                C00082   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00083   
ARVCITY DFHMDF POS=(13,16),LENGTH=15,ATTRB=(UNPROT),                   C00084   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00085   
        DFHMDF POS=(13,32),LENGTH=01,ATTRB=(ASKIP)                      00086   
*                                                                       00087   
        DFHMDF POS=(13,43),LENGTH=11,                                  C00088   
               INITIAL='TOT RETAIL:',                                  C00089   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00090   
ARTOTRT DFHMDF POS=(13,55),LENGTH=13,ATTRB=(PROT,NORM),COLOR=BLUE       00091   
*                                                                       00092   
        DFHMDF POS=(14,01),LENGTH=13,                                  C00093   
               INITIAL='STATE.......:',                                C00094   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00095   
ARSTATE DFHMDF POS=(14,16),LENGTH=02,ATTRB=(UNPROT),                   C00096   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00097   
        DFHMDF POS=(14,19),LENGTH=01,ATTRB=(ASKIP)                      00098   
*                                                                       00099   
        DFHMDF POS=(14,43),LENGTH=11,                                  C00100   
               INITIAL='TOT COST..:',                                  C00101   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00102   
ARTOTCT DFHMDF POS=(14,55),LENGTH=13,ATTRB=(PROT,NORM),COLOR=BLUE       00103   
*                                                                       00104   
        DFHMDF POS=(15,01),LENGTH=13,                                  C00105   
               INITIAL='ZIP CODE....:',                                C00106   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00107   
ARZIPCD DFHMDF POS=(15,16),LENGTH=05,ATTRB=(UNPROT,NORM,NUM),          C00108   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00109   
        DFHMDF POS=(15,22),LENGTH=1,                                   C00110   
               INITIAL='-',                                            C00111   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00112   
ARZIPSF DFHMDF POS=(15,24),LENGTH=04,ATTRB=(UNPROT,NORM,NUM),          C00113   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00114   
        DFHMDF POS=(15,29),LENGTH=01,ATTRB=(ASKIP)                      00115   
*                                                                       00116   
        DFHMDF POS=(16,40),LENGTH=20,                                  C00117   
               INITIAL='PRINTING PARAMETERS:',                         C00118   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00119   
*                                                                       00120   
        DFHMDF POS=(17,01),LENGTH=13,                                  C00121   
               INITIAL='PHONE.......:',                                C00122   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00123   
        DFHMDF POS=(17,16),LENGTH=1,                                   C00124   
               INITIAL='(',                                            C00125   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00126   
ARPHACD DFHMDF POS=(17,18),LENGTH=3,ATTRB=(UNPROT,NORM,NUM),           C00127   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='999'               00128   
*                                                                       00129   
        DFHMDF POS=(17,22),LENGTH=1,                                   C00130   
               INITIAL=')',                                            C00131   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00132   
ARPHECD DFHMDF POS=(17,24),LENGTH=3,ATTRB=(UNPROT,NORM,NUM),           C00133   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='999'               00134   
*                                                                       00135   
        DFHMDF POS=(17,28),LENGTH=1,                                   C00136   
               INITIAL='-',                                            C00137   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00138   
ARPHNBR DFHMDF POS=(17,30),LENGTH=4,ATTRB=(UNPROT,NORM,NUM),           C00139   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='9999'              00140   
        DFHMDF POS=(17,35),LENGTH=01,ATTRB=(ASKIP)                      00141   
*                                                                       00142   
        DFHMDF POS=(17,43),LENGTH=23,                                  C00143   
               INITIAL='PRINTER DESTINATION...:',                      C00144   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00145   
ARPRNTR DFHMDF POS=(17,67),LENGTH=05,ATTRB=(UNPROT),                   C00146   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00147   
        DFHMDF POS=(17,73),LENGTH=01,ATTRB=(ASKIP)                      00148   
*                                                                       00149   
        DFHMDF POS=(18,01),LENGTH=13,                                  C00150   
               INITIAL='FAX PHONE...:',                                C00151   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00152   
        DFHMDF POS=(18,16),LENGTH=1,                                   C00153   
               INITIAL='(',                                            C00154   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00155   
ARFXACD DFHMDF POS=(18,18),LENGTH=3,ATTRB=(UNPROT,NORM,NUM),           C00156   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='999'               00157   
*                                                                       00158   
        DFHMDF POS=(18,22),LENGTH=1,                                   C00159   
               INITIAL=')',                                            C00160   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00161   
ARFXECD DFHMDF POS=(18,24),LENGTH=3,ATTRB=(UNPROT,NORM,NUM),           C00162   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='999'               00163   
*                                                                       00164   
        DFHMDF POS=(18,28),LENGTH=1,                                   C00165   
               INITIAL='-',                                            C00166   
               ATTRB=(ASKIP,NORM),COLOR=GREEN                           00167   
ARFXNBR DFHMDF POS=(18,30),LENGTH=4,ATTRB=(UNPROT,NORM,NUM),           C00168   
               HILIGHT=UNDERLINE,COLOR=GREEN,PICOUT='9999'              00169   
        DFHMDF POS=(18,35),LENGTH=01,ATTRB=(ASKIP)                      00170   
*                                                                       00171   
ARPRMSG DFHMDF POS=(20,5),LENGTH=75,ATTRB=(PROT,NORM),COLOR=YELLOW      00172   
*                                                                       00173   
AMSG    DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,NORM),COLOR=RED         00174   
        DFHMDF POS=(22,1),LENGTH=11,INITIAL='COMMAND==>',              C00175   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00176   
ANAVCMD DFHMDF POS=(22,13),LENGTH=8,ATTRB=(UNPROT),                    C00177   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00178   
        DFHMDF POS=(22,22),LENGTH=1,ATTRB=(ASKIP)                       00179   
        DFHMDF POS=(22,24),LENGTH=7,INITIAL='KEY===>',                 C00180   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00181   
ANAVKEY DFHMDF POS=(22,32),LENGTH=25,ATTRB=(UNPROT),                   C00182   
               HILIGHT=UNDERLINE,COLOR=GREEN                            00183   
        DFHMDF POS=(22,58),LENGTH=1,ATTRB=(ASKIP)                       00184   
        DFHMDF POS=(22,63),LENGTH=16,INITIAL='PA2=OTHER FKEYS',        C00185   
               ATTRB=(PROT,NORM),COLOR=NEUTRAL                          00186   
AFKLIN1 DFHMDF POS=(23,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00187   
               COLOR=NEUTRAL                                            00188   
AFKLIN2 DFHMDF POS=(24,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00189   
               COLOR=NEUTRAL                                            00190   
        DFHMSD TYPE=FINAL                                               00191   
        END                                                             00192   
