*          DATA SET RVKM105    AT LEVEL 009 AS OF 12/18/95                      
*          DATA SET RVKM105    AT LEVEL 011 AS OF 01/05/93              00001   
*          DATA SET RVKM105A1  AT LEVEL 009 AS OF 12/14/92              00002   
*          DATA SET RVKM105A1  AT LEVEL 003 AS OF 12/14/92              00003   
*****************************************************************       00004   
*       MAPSET  RVKM105                                                 00005   
*       MAP     RV105A                                                  00006   
*       PROGRAM RVKCS105                                                00007   
*       TRANSID T105                                                    00008   
*       SYSTEM  CICS ARCHTECTURE - RTV                                  00009   
*****************************************************************       00010   
        PRINT  NOGEN                                                    00011   
RVKM105 DFHMSD TYPE=DSECT,                                             C00012   
               LANG=COBOL,                                             C00013   
               MODE=INOUT,                                             C00014   
               STORAGE=AUTO,                                           C00015   
               TERM=3270-2,                                            C00016   
               TIOAPFX=YES                                              00017   
**************                                                          00018   
RV105A  DFHMDI SIZE=(24,80),                                           C00019   
               CTRL=(FREEKB),                                          C00020   
               MAPATTS=(COLOR,HILIGHT),                                C00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
**************                                                          00023   
ADATE   DFHMDF POS=(01,02),LENGTH=10,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=NEUTRAL                                            00025   
ATIME   DFHMDF POS=(01,14),LENGTH=08,ATTRB=(ASKIP,NORM),               C00026   
               COLOR=NEUTRAL                                            00027   
ATITLE  DFHMDF POS=(01,25),LENGTH=30,ATTRB=(ASKIP,BRT),                C00028   
               COLOR=NEUTRAL                                            00029   
ANETNAM DFHMDF POS=(01,61),LENGTH=08,ATTRB=(ASKIP,NORM),               C00030   
               COLOR=NEUTRAL                                            00031   
AMNEMIC DFHMDF POS=(01,71),LENGTH=08,ATTRB=(ASKIP,NORM),               C00032   
               COLOR=NEUTRAL                                            00033   
*                                                                       00034   
        DFHMDF POS=(03,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='REQ RA NUMBER:'                                 00037   
ARANBR  DFHMDF POS=(03,17),LENGTH=12,ATTRB=(ASKIP,NORM),               C00038   
               COLOR=BLUE,PICOUT='ZZZZZZZZZZZZ'                         00039   
ASTRTIT DFHMDF POS=(03,52),LENGTH=05,ATTRB=(NUM,PROT,NORM),            C00044   
               COLOR=BLUE,                                             C00045   
               PICOUT='ZZZZ9'                                           00046   
        DFHMDF POS=(03,58),LENGTH=02,ATTRB=(ASKIP,NORM),               C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='TO'                                             00049   
AENDIT  DFHMDF POS=(03,62),LENGTH=05,ATTRB=(ASKIP,NORM,FSET),          C00050   
               COLOR=BLUE,                                             C00051   
               PICOUT='ZZZZ9'                                           00052   
        DFHMDF POS=(03,69),LENGTH=02,ATTRB=(ASKIP,NORM),               C00053   
               COLOR=NEUTRAL,                                          C00054   
               INITIAL='OF'                                             00055   
ATOTIT  DFHMDF POS=(03,73),LENGTH=05,ATTRB=(ASKIP,NORM),               C00056   
               COLOR=BLUE,                                             C00057   
               PICOUT='ZZZZ9'                                           00058   
*                                                                       00059   
        DFHMDF POS=(04,01),LENGTH=14,ATTRB=(ASKIP,NORM),               C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='ORDER TYPE...:'                                 00036   
AORTYPE DFHMDF POS=(04,17),LENGTH=08,ATTRB=(ASKIP,NORM),               C00039**6
               COLOR=BLUE                                               00040   
AORSTAT DFHMDF POS=(04,28),LENGTH=08,ATTRB=(ASKIP,NORM),               C00041**7
               COLOR=BLUE                                               00042**5
        DFHMDF POS=(05,01),LENGTH=14,ATTRB=(PROT,NORM),                C00060   
               COLOR=NEUTRAL,                                          C00061   
               INITIAL='VENDOR.......:'                                 00062   
AVENUM  DFHMDF POS=(05,17),LENGTH=09,ATTRB=(ASKIP,NORM),               C00063   
               COLOR=BLUE                                               00064   
        DFHMDF POS=(05,53),LENGTH=11,ATTRB=(PROT,NORM),                C00065   
               COLOR=NEUTRAL,                                          C00066   
               INITIAL='TOT COST..:'                                    00067   
ATCOST  DFHMDF POS=(05,65),LENGTH=13,ATTRB=(ASKIP,NORM),               C00068   
               COLOR=BLUE,PICOUT='ZZ,ZZZ,ZZZ.99'                        00069   
*                                                                       00070   
AVENAME DFHMDF POS=(06,01),LENGTH=25,ATTRB=(ASKIP,NORM),               C00071   
               COLOR=BLUE                                               00072   
        DFHMDF POS=(06,53),LENGTH=11,ATTRB=(PROT,NORM),                C00073   
               COLOR=NEUTRAL,                                          C00074   
               INITIAL='TOT RETAIL:'                                    00075   
ATRET   DFHMDF POS=(06,65),LENGTH=13,ATTRB=(ASKIP,NORM),               C00076   
               COLOR=BLUE,PICOUT='ZZ,ZZZ,ZZZ.99'                        00077   
*                                                                       00078   
        DFHMDF POS=(08,01),LENGTH=02,ATTRB=(PROT,NORM),                C00079**9
               COLOR=NEUTRAL,                                          C00080**9
               INITIAL='ST'                                             00081**9
        DFHMDF POS=(08,05),LENGTH=07,ATTRB=(PROT,NORM),                C00082**9
               COLOR=NEUTRAL,                                          C00083**9
               INITIAL='AUTH ID'                                        00084**9
        DFHMDF POS=(08,15),LENGTH=04,ATTRB=(PROT,NORM),                C00085**9
               COLOR=NEUTRAL,                                          C00086   
               INITIAL='DEPT'                                           00087   
        DFHMDF POS=(08,24),LENGTH=10,ATTRB=(PROT,NORM),                C00085**9
               COLOR=NEUTRAL,                                          C00086   
               INITIAL='UPC NUMBER'                                     00087   
        DFHMDF POS=(08,39),LENGTH=16,ATTRB=(PROT,NORM),                C00091**9
               COLOR=NEUTRAL,                                          C00092   
               INITIAL='ITEM DESCRIPTION'                               00093   
        DFHMDF POS=(08,64),LENGTH=04,ATTRB=(PROT,NORM),                C00094**9
               COLOR=NEUTRAL,                                          C00095   
               INITIAL='COST'                                           00096**9
        DFHMDF POS=(08,73),LENGTH=06,ATTRB=(PROT,NORM),                C00097**9
               COLOR=NEUTRAL,                                          C00098**9
               INITIAL='RETAIL'                                         00099**9
*                                                                       00100   
ASTAT01 DFHMDF POS=(09,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00101**9
               COLOR=BLUE                                               00102**9
AAUTH01 DFHMDF POS=(09,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00103**9
               COLOR=BLUE                                               00104**9
ADEPT01 DFHMDF POS=(09,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00105**9
               COLOR=BLUE                                               00106   
AUPC01  DFHMDF POS=(09,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00105**9
               COLOR=BLUE                                               00106   
ADESC01 DFHMDF POS=(09,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00109**9
               COLOR=BLUE                                               00110   
AUCST01 DFHMDF POS=(09,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00111**9
               COLOR=BLUE                                               00112   
AURET01 DFHMDF POS=(09,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00113**9
               COLOR=BLUE                                               00114   
*                                                                       00115**4
ASTAT02 DFHMDF POS=(10,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00116**9
               COLOR=BLUE                                               00117**9
AAUTH02 DFHMDF POS=(10,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00118**9
               COLOR=BLUE                                               00119**9
ADEPT02 DFHMDF POS=(10,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00120**9
               COLOR=BLUE                                               00121**4
AUPC02  DFHMDF POS=(10,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00120**9
               COLOR=BLUE                                               00121**4
ADESC02 DFHMDF POS=(10,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00124**9
               COLOR=BLUE                                               00125**4
AUCST02 DFHMDF POS=(10,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00126**9
               COLOR=BLUE                                               00127**4
AURET02 DFHMDF POS=(10,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00128**9
               COLOR=BLUE                                               00129**4
*                                                                       00130**4
ASTAT03 DFHMDF POS=(11,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00131**9
               COLOR=BLUE                                               00132**9
AAUTH03 DFHMDF POS=(11,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00133**9
               COLOR=BLUE                                               00134**9
ADEPT03 DFHMDF POS=(11,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00135**9
               COLOR=BLUE                                               00136**4
AUPC03  DFHMDF POS=(11,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00135**9
               COLOR=BLUE                                               00136**4
ADESC03 DFHMDF POS=(11,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00139**9
               COLOR=BLUE                                               00140**4
AUCST03 DFHMDF POS=(11,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00141**9
               COLOR=BLUE                                               00142**4
AURET03 DFHMDF POS=(11,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00143**9
               COLOR=BLUE                                               00144**4
*                                                                       00145**4
ASTAT04 DFHMDF POS=(12,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00146**9
               COLOR=BLUE                                               00147**9
AAUTH04 DFHMDF POS=(12,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00148**9
               COLOR=BLUE                                               00149**9
ADEPT04 DFHMDF POS=(12,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00150**9
               COLOR=BLUE                                               00151**4
AUPC04  DFHMDF POS=(12,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00150**9
               COLOR=BLUE                                               00151**4
ADESC04 DFHMDF POS=(12,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00154**9
               COLOR=BLUE                                               00155**4
AUCST04 DFHMDF POS=(12,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00156**9
               COLOR=BLUE                                               00157**4
AURET04 DFHMDF POS=(12,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00158**9
               COLOR=BLUE                                               00159**4
*                                                                       00160**4
ASTAT05 DFHMDF POS=(13,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00161**9
               COLOR=BLUE                                               00162**9
AAUTH05 DFHMDF POS=(13,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00163**9
               COLOR=BLUE                                               00164**9
ADEPT05 DFHMDF POS=(13,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00165**9
               COLOR=BLUE                                               00166**4
AUPC05  DFHMDF POS=(13,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00165**9
               COLOR=BLUE                                               00166**4
ADESC05 DFHMDF POS=(13,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00169**9
               COLOR=BLUE                                               00170**4
AUCST05 DFHMDF POS=(13,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00171**9
               COLOR=BLUE                                               00172**4
AURET05 DFHMDF POS=(13,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00173**9
               COLOR=BLUE                                               00174**4
*                                                                       00175**4
ASTAT06 DFHMDF POS=(14,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00176**9
               COLOR=BLUE                                               00177**9
AAUTH06 DFHMDF POS=(14,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00178**9
               COLOR=BLUE                                               00179**9
ADEPT06 DFHMDF POS=(14,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00180**9
               COLOR=BLUE                                               00181**4
AUPC06  DFHMDF POS=(14,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00180**9
               COLOR=BLUE                                               00181**4
ADESC06 DFHMDF POS=(14,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00184**9
               COLOR=BLUE                                               00185**4
AUCST06 DFHMDF POS=(14,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00186**9
               COLOR=BLUE                                               00187**4
AURET06 DFHMDF POS=(14,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00188**9
               COLOR=BLUE                                               00189**4
*                                                                       00190**4
ASTAT07 DFHMDF POS=(15,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00191**9
               COLOR=BLUE                                               00192**9
AAUTH07 DFHMDF POS=(15,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00193**9
               COLOR=BLUE                                               00194**9
ADEPT07 DFHMDF POS=(15,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00195**9
               COLOR=BLUE                                               00196**4
AUPC07  DFHMDF POS=(15,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00195**9
               COLOR=BLUE                                               00196**4
ADESC07 DFHMDF POS=(15,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00199**9
               COLOR=BLUE                                               00200**4
AUCST07 DFHMDF POS=(15,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00201**9
               COLOR=BLUE                                               00202**4
AURET07 DFHMDF POS=(15,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00203**9
               COLOR=BLUE                                               00204**4
*                                                                       00205**4
ASTAT08 DFHMDF POS=(16,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00206**9
               COLOR=BLUE                                               00207**9
AAUTH08 DFHMDF POS=(16,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00208**9
               COLOR=BLUE                                               00209**9
ADEPT08 DFHMDF POS=(16,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00210**9
               COLOR=BLUE                                               00211**4
AUPC08  DFHMDF POS=(16,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00210**9
               COLOR=BLUE                                               00211**4
ADESC08 DFHMDF POS=(16,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00214**9
               COLOR=BLUE                                               00215**4
AUCST08 DFHMDF POS=(16,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00216**9
               COLOR=BLUE                                               00217**4
AURET08 DFHMDF POS=(16,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00218**9
               COLOR=BLUE                                               00219**4
*                                                                       00220**4
ASTAT09 DFHMDF POS=(17,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00221**9
               COLOR=BLUE                                               00222**9
AAUTH09 DFHMDF POS=(17,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00223**9
               COLOR=BLUE                                               00224**9
ADEPT09 DFHMDF POS=(17,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00225**9
               COLOR=BLUE                                               00226**4
AUPC09  DFHMDF POS=(17,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00225**9
               COLOR=BLUE                                               00226**4
ADESC09 DFHMDF POS=(17,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00229**9
               COLOR=BLUE                                               00230**4
AUCST09 DFHMDF POS=(17,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00231**9
               COLOR=BLUE                                               00232**4
AURET09 DFHMDF POS=(17,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00233**9
               COLOR=BLUE                                               00234**4
*                                                                       00235**4
ASTAT10 DFHMDF POS=(18,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00236**9
               COLOR=BLUE                                               00237**9
AAUTH10 DFHMDF POS=(18,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00238**9
               COLOR=BLUE                                               00239**9
ADEPT10 DFHMDF POS=(18,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00240**9
               COLOR=BLUE                                               00241**4
AUPC10  DFHMDF POS=(18,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00240**9
               COLOR=BLUE                                               00241**4
ADESC10 DFHMDF POS=(18,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00244**9
               COLOR=BLUE                                               00245**4
AUCST10 DFHMDF POS=(18,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00246**9
               COLOR=BLUE                                               00247**4
AURET10 DFHMDF POS=(18,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00248**9
               COLOR=BLUE                                               00249**4
*                                                                       00250**4
ASTAT11 DFHMDF POS=(19,01),LENGTH=01,ATTRB=(ASKIP,NORM),               C00251**9
               COLOR=BLUE                                               00252**9
AAUTH11 DFHMDF POS=(19,03),LENGTH=11,ATTRB=(ASKIP,NORM),               C00253**9
               COLOR=BLUE                                               00254**9
ADEPT11 DFHMDF POS=(19,16),LENGTH=03,ATTRB=(ASKIP,NORM),               C00255**9
               COLOR=BLUE                                               00256**4
AUPC11  DFHMDF POS=(19,21),LENGTH=15,ATTRB=(ASKIP,NORM),               C00255**9
               COLOR=BLUE                                               00256**4
ADESC11 DFHMDF POS=(19,38),LENGTH=20,ATTRB=(ASKIP,NORM),               C00259**9
               COLOR=BLUE                                               00260**4
AUCST11 DFHMDF POS=(19,60),LENGTH=09,ATTRB=(ASKIP,NORM),               C00261**9
               COLOR=BLUE                                               00262**4
AURET11 DFHMDF POS=(19,70),LENGTH=09,ATTRB=(ASKIP,NORM),               C00263**9
               COLOR=BLUE                                               00264**4
*                                                                       00265   
        DFHMDF POS=(20,50),LENGTH=22,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=NEUTRAL,                                          C00267   
               INITIAL='TOTAL NUMBER OF ITEMS:'                         00268   
ATOTAL  DFHMDF POS=(20,74),LENGTH=05,ATTRB=(ASKIP,NORM),               C00269   
               COLOR=BLUE,                                             C00270   
               PICOUT='ZZZZ9'                                           00271   
*                                                                       00272   
AMSG    DFHMDF POS=(21,01),LENGTH=78,ATTRB=(ASKIP,BRT),                C00273   
               COLOR=NEUTRAL                                            00274   
        DFHMDF POS=(22,01),LENGTH=11,ATTRB=(PROT,BRT),                 C00275   
               COLOR=NEUTRAL,                                          C00276   
               INITIAL='COMMAND===>'                                    00277   
ANAVCMD DFHMDF POS=(22,14),LENGTH=08,ATTRB=(UNPROT,NORM),              C00278   
               COLOR=GREEN,                                            C00279   
               HILIGHT=UNDERLINE                                        00280   
        DFHMDF POS=(22,23),LENGTH=01,ATTRB=(ASKIP)                      00281   
        DFHMDF POS=(22,25),LENGTH=07,ATTRB=(PROT,BRT),                 C00282   
               COLOR=NEUTRAL,                                          C00283   
               INITIAL='KEY===>'                                        00284   
ANAVKEY DFHMDF POS=(22,33),LENGTH=25,ATTRB=(UNPROT,NORM,FSET),         C00285   
               COLOR=GREEN,                                            C00286   
               HILIGHT=UNDERLINE                                        00287   
        DFHMDF POS=(22,59),LENGTH=01,ATTRB=(ASKIP)                      00288   
        DFHMDF POS=(22,63),LENGTH=16,ATTRB=(PROT,NORM),                C00289   
               INITIAL='PA2=OTHER F KEYS',                             C00290   
               COLOR=NEUTRAL                                            00291   
AFKLIN1 DFHMDF POS=(23,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00292   
               COLOR=NEUTRAL                                            00293   
AFKLIN2 DFHMDF POS=(24,01),LENGTH=78,ATTRB=(ASKIP,NORM),               C00294   
               COLOR=NEUTRAL                                            00295   
**************                                                          00296   
        DFHMSD TYPE=FINAL                                               00297   
**************                                                          00298   
        END                                                             00299   
