      ******************************************************************        
      *                         RVRD026                                *        
      *                                                                *        
      *   RTV INVENTORY INTERFACE SUMMARY INFO FOR REPORT              *        
      *   CREATED IN RVKUT024                                          *        
      *                                                                *        
      *   LENGTH: 611 BYTES                            5/23/2007       *        
      ******************************************************************        
       01  RV026-GENCO-INV-SUMMARY-RCD.                                         
           05  RV026-RUN-DATE                        PIC X(10).                 
           05  RV026-GENCO-MOS-TOT-CNT               PIC 9(10).                 
           05  RV026-GENCO-MOS-TOT-RTL               PIC S9(13)V99.             
           05  RV026-GENCO-MOS-TOT-COST              PIC S9(13)V99.             
           05  RV026-GENCO-RTV-TOT-CNT               PIC 9(10).                 
           05  RV026-GENCO-RTV-TOT-RTL               PIC S9(13)V99.             
           05  RV026-GENCO-RTV-TOT-COST              PIC S9(13)V99.             
           05  RV026-GENCO-DND-TOT-CNT               PIC 9(10).                 
           05  RV026-GENCO-DND-TOT-RTL               PIC S9(13)V99.             
           05  RV026-GENCO-DND-TOT-COST              PIC S9(13)V99.             
           05  RV026-GENCO-CBK-TOT-CNT               PIC 9(10).                 
           05  RV026-GENCO-CBK-TOT-RTL               PIC S9(13)V99.             
           05  RV026-GENCO-CBK-TOT-COST              PIC S9(13)V99.             
           05  RV026-GENCO-GRAND-TOT-CNT             PIC 9(11).                 
           05  RV026-GENCO-GRAND-TOT-RTL             PIC S9(13)V99.             
           05  RV026-GENCO-GRAND-TOT-COST            PIC S9(13)V99.             
           05  RV026-KOHLS-MOS-TOT-CNT               PIC 9(10).                 
           05  RV026-KOHLS-MOS-TOT-RTL               PIC S9(13)V99.             
           05  RV026-KOHLS-MOS-TOT-COST              PIC S9(13)V99.             
           05  RV026-KOHLS-RTV-TOT-CNT               PIC 9(10).                 
           05  RV026-KOHLS-RTV-TOT-RTL               PIC S9(13)V99.             
           05  RV026-KOHLS-RTV-TOT-COST              PIC S9(13)V99.             
           05  RV026-KOHLS-DND-TOT-CNT               PIC 9(10).                 
           05  RV026-KOHLS-DND-TOT-RTL               PIC S9(13)V99.             
           05  RV026-KOHLS-DND-TOT-COST              PIC S9(13)V99.             
           05  RV026-KOHLS-CBK-TOT-CNT               PIC 9(10).                 
           05  RV026-KOHLS-CBK-TOT-RTL               PIC S9(13)V99.             
           05  RV026-KOHLS-CBK-TOT-COST              PIC S9(13)V99.             
           05  RV026-KOHLS-GRAND-TOT-CNT             PIC 9(10).                 
           05  RV026-KOHLS-GRAND-TOT-RTL             PIC S9(13)V99.             
           05  RV026-KOHLS-GRAND-TOT-COST            PIC S9(13)V99.             
           05  RV026-MOS-TOT-CNT-DIF                 PIC 9(10).                 
           05  RV026-MOS-TOT-RTL-DIF                 PIC S9(13)V99.             
           05  RV026-MOS-TOT-COST-DIF                PIC S9(13)V99.             
           05  RV026-RTV-TOT-CNT-DIF                 PIC 9(10).                 
           05  RV026-RTV-TOT-RTL-DIF                 PIC S9(13)V99.             
           05  RV026-RTV-TOT-COST-DIF                PIC S9(13)V99.             
           05  RV026-DND-TOT-CNT-DIF                 PIC 9(10).                 
           05  RV026-DND-TOT-RTL-DIF                 PIC S9(13)V99.             
           05  RV026-DND-TOT-COST-DIF                PIC S9(13)V99.             
           05  RV026-CBK-TOT-CNT-DIF                 PIC 9(10).                 
           05  RV026-CBK-TOT-RTL-DIF                 PIC S9(13)V99.             
           05  RV026-CBK-TOT-COST-DIF                PIC S9(13)V99.             
           05  RV026-GRAND-TOT-CNT-DIF               PIC 9(10).                 
           05  RV026-GRAND-TOT-RTL-DIF               PIC S9(13)V99.             
           05  RV026-GRAND-TOT-COST-DIF              PIC S9(13)V99.             
