000001******************************************************************        
000002*                         RVRV064                                *        
000003*                                                                *        
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM ITEM     *        
000005*       EXTRACT FILE                                             *        
000006*                                                                *        
000007*   LENGTH: 316 BYTES                                            *        
000008*   PRB0049074: ADDED RV064-WEB-EXCLUSIVE-IND    PIC X(01)       *        
000009*               DECREASED THE FILLER SIZE FROM X(19) TO X(18)    *        
000010*               LENGHT REMAINS SAME                              *        
000011******************************************************************        
000012 01  RV064-ITEM-RECORD.                                                   
000013     05  RV064-ACD-INDICATOR                 PIC  X(01).                  
000014     05  RV064-SKU-NBR                       PIC  X(10).                  
000015     05  RV064-UPC-NBR                       PIC  X(15).                  
000016     05  RV064-STYL-ID                       PIC  X(20).                  
000017     05  RV064-STYL-DESC                     PIC  X(30).                  
000018     05  RV064-NRF-CLOR-CDE                  PIC  X(20).                  
000019     05  RV064-CSTM-CLOR-DESC                PIC  X(30).                  
000020     05  RV064-KOHLS-SIZE-CDE                PIC  X(20).                  
000021     05  RV064-SIZE-DESC                     PIC  X(30).                  
000022     05  RV064-RTL-COST-SIGN                 PIC  X(01).                  
000023     05  RV064-RTL-COST-AMT                  PIC  9(09)V9999.             
000024     05  RV064-UNT-COST-SIGN                 PIC  X(01).                  
000025     05  RV064-UNT-COST-AMT                  PIC  9(09)V9999.             
000026     05  RV064-UPC-TYPE                      PIC  X(01).                  
000027     05  RV064-PREPK-IND                     PIC  X(01).                  
000028     05  RV064-VS-NBR                        PIC  X(20).                  
000029     05  RV064-BUY-UM                        PIC  X(03).                  
000030     05  RV064-SELL-UM                       PIC  X(03).                  
000031     05  RV064-SKU-LEAD-TIME                 PIC  X(03).                  
000032     05  RV064-STATUS-FLAG                   PIC  X(01).                  
000033     05  RV064-PRO-NMFC                      PIC  X(06).                  
000034     05  RV064-DEPT-NBR                      PIC  X(10).                  
000035     05  RV064-MAJ-CL-NBR                    PIC  X(10).                  
000036     05  RV064-SUB-CL-NBR                    PIC  X(10).                  
000037     05  RV064-SKU-STAT-CDE                  PIC  X(02).                  
000038     05  RV064-ENT-ID                        PIC  X(10).                  
000039     05  RV064-SKU-STAT-DESC                 PIC  X(10).                  
000040     05  RV064-PRIMARY-UPC-FL                PIC  X(01).                  
000050     05  RV064-VENDOR-TYPE                   PIC  X(01).                  
000060         88  RV064-VENDOR-REGULAR            VALUE 'R'.                   
000070         88  RV064-VENDOR-PRIVATE-LABEL      VALUE 'P'.                   
000080         88  RV064-VENDOR-EXCLUSIVE          VALUE 'E'.                   
000081     05  RV064-WEB-EXCLUSIVE-IND             PIC  X(01).                  
000082     05  RV064-ORIG-UNIT-RTL-AMT             PIC  9(05)V99.               
000083     05  FILLER                              PIC  X(11).                  
000084     05  RV064-ANCHOR-CONSTANT               PIC  X(01).                  
