      ******************************************************************00010000
      *                         RVRD063                                *00020001
      *                                                                *00030000
      *   THIS LAYOUT IS FOR THE EXTRACT FILE CREATED BY PROGRAM       *00040001
      *   RVKUT035                                                     *00050001
      *                                                                *00060000
      *   CREATED: 10/30/2011 FOR GENCO / RTV UPGRADE PROJECT - 3219   *00061007
      *   WR/IR#:  WR40134                                             *00070007
      *   LENGTH:  138 BYTES                                           *00071007
      ******************************************************************00080000
         02 RV063-RECORD.                                               00090006
           10 RV063-DFCT-ORD-ID             PIC  S9(6)V COMP-3.         00100002
           10 RV063-VENDOR-DUNS-NBR         PIC   X(9).                 00110002
           10 RV063-ORD-DTE                 PIC   X(10).                00120002
           10 RV063-DFCT-UID-NBR            PIC   X(8).                 00130002
           10 RV063-VEND-ATTN-NAME          PIC   X(25).                00140002
           10 RV063-VEND-NAME               PIC   X(25).                00150002
           10 RV063-OPER-UNT-ID             PIC  S9(4) COMP.            00260002
           10 RV063-LOC-ID                  PIC   X(15).                00270002
           10 RV063-DFCT-ORD-ID-CDE         PIC   X(1).                 00280002
           10 RV063-STATUS-CHG-DTE          PIC   X(10).                00290002
           10 RV063-DFCT-ORD-STAT-CDE       PIC   X(1).                 00300002
           10 RV063-DFCT-SHIPT-ID           PIC  S9(9) COMP.            00310002
           10 RV063-VND-AUTH-ID             PIC   X(10).                00320002
           10 RV063-VND-AUTH-DTE            PIC   X(10).                00330002
           10 RV063-CART-QTY                PIC  S9(9) COMP.            00360002
