000100*****************************************************************         
000200*    RECORD PURPOSE: OUTPUT  RECORD OF MOS INFORMATION THAT     *         
000300*                    WILL BE INSERTED INTO TSTRPPC & TSPPCDT    *         
000400*                                                               *         
000500*    RECORD LENGTH:  260 BYTES                                  *         
000600*    RECORD FORMAT:  SEQUENTIAL                      RVRD056    *         
000700*****************************************************************         
000800 01  RV056-HDR-DTL-RECORD.                                                
000900     05 RV056-COMMON-FIELDS.                                              
000900        10 RV056-RECORD-TYPE          PIC   X(01).                        
000900           88 RV056-HEADER               VALUE '1'.                       
000900           88 RV056-DETAIL               VALUE '2'.                       
000900        10 RV056-DEST-LOC-NBR         PIC  S9(04) COMP.                   
001000        10 RV056-DOC-NBR              PIC  S9(07)V COMP-3.                
001400        10 RV056-ROW-NBR              PIC  S9(04) COMP.                   
000900     05 RV056-HEADER-FIELDS.                                              
001100        10 RV056-DOC-TYP-CDE          PIC   X(01).                        
001200        10 RV056-EFF-DTE              PIC   X(10).                        
001300        10 RV056-PR-CHG-CPL-NAME      PIC   X(30).                        
001400        10 RV056-RSN-CDE              PIC  S9(02)V COMP-3.                
001500        10 RV056-TYP-CDE              PIC   X(01).                        
001600        10 RV056-STATUS-CDE           PIC   X(02).                        
001700        10 RV056-PREV-STATUS-CDE      PIC   X(02).                        
001800        10 RV056-DEPT-AREA-DEST       PIC   X(40).                        
001900        10 RV056-ORGN-LOC-NBR         PIC  S9(04) COMP.                   
002000        10 RV056-CRE-DTE              PIC   X(10).                        
002100        10 RV056-CRE-ID               PIC   X(08).                        
002200        10 RV056-CAN-DTE              PIC   X(10).                        
002300        10 RV056-CAN-ID               PIC   X(08).                        
002400        10 RV056-ENTR-DTE             PIC   X(10).                        
002500        10 RV056-ENTR-TIME            PIC   X(08).                        
002600        10 RV056-ENTR-TIME            PIC   X(08).                        
002700        10 RV056-ENTR-ID              PIC   X(08).                        
002800        10 RV056-MGMT-APPRVL-DTE      PIC   X(10).                        
002900        10 RV056-MGMT-APPRVL-ID       PIC   X(08).                        
003000        10 RV056-MGMT-APPRVL-NAME     PIC   X(30).                        
003100        10 RV056-REJ-DTE              PIC   X(10).                        
003200        10 RV056-REJ-ID               PIC   X(08).                        
003300        10 RV056-CPL-DTE              PIC   X(10).                        
003400        10 RV056-CPL-TIME             PIC   X(08).                        
003500        10 RV056-TOT-ACT-PR-CHG-AMT   PIC  S9(07)V9(02) COMP-3.           
003600        10 RV056-PGS-TO-PRT-NBR       PIC  S9(04) COMP.                   
000900     05 RV056-DETAIL-FIELDS REDEFINES RV056-HEADER-FIELDS.                
001300        10 RV056-SKU-NBR              PIC  S9(08)V COMP-3.                
001500        10 RV056-ACTL-PR-CHG-QTY      PIC  S9(09) COMP.                   
001600        10 RV056-OLD-PR               PIC  S9(07)V9(02) COMP-3.           
001700        10 RV056-NEW-PR               PIC  S9(07)V9(02) COMP-3.           
001800        10 RV056-ACTL-PR-CHG-AMT      PIC  S9(07)V9(02) COMP-3.           
001900        10 RV056-UPC-NBR              PIC  S9(15)V COMP-3.                
002000        10 RV056-ITEM-NBR             PIC  S9(15)V COMP-3.                
002100        10 RV056-INV-DKEY             PIC  S9(09) COMP.                   
002200        10 RV056-DEPT-NBR             PIC  S9(04)V COMP-3.                
002300        10 RV056-MAJ-CL-NBR           PIC  S9(04)V COMP-3.                
002400        10 RV056-SUB-CL-NBR           PIC  S9(04)V COMP-3.                
002500        10 FILLER                     PIC   X(198).                       
