00001 ******************************************************************        
00002 *                         RVRD002                                *        
00003 *                                                                *        
00004 *   THE LAYOUT OF THE VENDOR RETURN AGREEMENT RPT EXTRACT FILE   *        
00005 *   THE FIRST RECORD WILL BE THE DATE RECORD (RECORD TYPE = 1)  *         
00006 *   AND ALL THE REST OF THE RECORDS WILL BE DETAIL RECORDS       *        
00007 *   (RECORD TYPE = 2)                                            *        
00008 *                                                                *        
00009 *   LENGTH: 200 BYTES                                            *        
00010 ******************************************************************        
00011  01  RV002-RETURN-AGREE-EXTRACT-REC.                                      
00012      05  RV002-DETAIL-DATA.                                               
00013          10  RV002-RECORD-TYPE       PIC  X(01)    VALUE SPACE.           
00014              88  RV002-HEADER-REC    VALUE '1'.                           
00015              88  RV002-DETAIL-REC    VALUE '2'.                           
00016          10  RV002-VENDOR-DUNNS      PIC  9(09)    VALUE 0.               
00017          10  RV002-VENDOR-NAME       PIC  X(20)    VALUE SPACES.          
00018          10  RV002-VENDOR-RANK       PIC S9(09)    VALUE +0 COMP.         
00019              88 RV002-ZERO-VENDOR-RANK           VALUE +999999998.        
00020              88 RV002-UNKOWN-VENDOR-RANK         VALUE +999999999.        
00021          10  RV002-DEPT-NMBR         PIC  9(03)    VALUE 0.               
00022          10  RV002-DEPT-DESC         PIC  X(20)    VALUE SPACES.          
00023          10  RV002-BUYER-NAME        PIC  X(30)    VALUE SPACES.          
00024          10  RV002-BUYER-NMBR        PIC  X(03)    VALUE SPACES.          
00025          10  RV002-DMM-NAME          PIC  X(30)    VALUE SPACES.          
00026          10  RV002-DMM-NMBR          PIC  X(02)    VALUE SPACES.          
00027          10  RV002-GMM-NAME          PIC  X(30)    VALUE SPACES.          
00028          10  RV002-GMM-NMBR          PIC  X(02)    VALUE SPACES.          
00029          10  RV002-RETURN-AGREEMENTS.                                     
00030              15  RV002-D-AND-R       PIC  X(01)    VALUE ' '.             
00031                  88 RV002-DEBIT-AND-RETURN         VALUE 'X'.             
00032                  88 RV002-NO-DEBIT-AND-RETURN      VALUE ' '.             
00033              15  RV002-D-AND-D       PIC  X(01)    VALUE ' '.             
00034                  88 RV002-DEBIT-AND-DISPOSE        VALUE 'X'.             
00035                  88 RV002-NO-DEBIT-AND-DISPOSE     VALUE ' '.             
00036              15  RV002-MOS           PIC  X(01)    VALUE ' '.             
00037                  88 RV002-MARK-OUT-OF-STOCK        VALUE 'X'.             
00038                  88 RV002-NO-MARK-OUT-OF-STOCK     VALUE ' '.             
00039          10  RV002-PURCH-COST        PIC S9(13)V99 VALUE +0 COMP.         
00040          10  RV002-RETURN-COST       PIC S9(13)V99 VALUE +0 COMP.         
00041          10  RV002-NEGOTIATED-PCT    PIC  9(04)V9999.                     
00042          10  FILLER                  PIC  X(19).                          
00043      05  RV002-DATE-RECORD REDEFINES RV002-DETAIL-DATA.                   
00044          10  FILLER                  PIC  X(01).                          
00045          10  RV002-BEGIN-DATE.                                            
00046              15  RV002-BEGIN-CC      PIC  X(02).                          
00047              15  RV002-BEGIN-YY      PIC  X(02).                          
00048              15  FILLER              PIC  X.                              
00049              15  RV002-BEGIN-MM      PIC  X(02).                          
00050              15  FILLER              PIC  X.                              
00051              15  RV002-BEGIN-DD      PIC  X(02).                          
00052          10  RV002-END-DATE.                                              
00053              15  RV002-END-CC        PIC  X(02).                          
00054              15  RV002-END-YY        PIC  X(02).                          
00055              15  FILLER              PIC  X.                              
00056              15  RV002-END-MM        PIC  X(02).                          
00057              15  FILLER              PIC  X.                              
00058              15  RV002-END-DD        PIC  X(02).                          
00059          10  RV002-CURR-DATE.                                             
00060              15  RV002-CURR-CC       PIC  X(02).                          
00061              15  RV002-CURR-YY       PIC  X(02).                          
00062              15  FILLER              PIC  X.                              
00063              15  RV002-CURR-MM       PIC  X(02).                          
00064              15  FILLER              PIC  X.                              
00065              15  RV002-CURR-DD       PIC  X(02).                          
00066          10  RV002-RPT-TYPE          PIC  X.                              
00067          10  FILLER                  PIC  X(168).                         
