000001******************************************************************10/18/95
000002*                         RVRD029                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE GENCO SYSTEM MARKER FILE              *RVWS010 
000006*   LENGTH: 78  BYTES                                            *RVWS010 
000007******************************************************************RVWS010 
000008 01  RV029-MARKER-RECORD.                                                 
000009     05  RV029-FILE-NAME                     PIC  X(50).                  
000010     05  RV029-RECORD-COUNT                  PIC  9(13).                  
000011*****  BUILD DATE YYYYMMDD *****                                          
000012     05  RV029-BUILD-DATE                    PIC  X(08).                  
000013*****  BUILD TIME HHMMSS   *****                                          
000014     05  RV029-BUILD-TIME                    PIC  X(06).                  
000015     05  RV029-ANCHOR-CONSTANT               PIC  X(01).                  
