000001******************************************************************        
000002*    RECORD PURPOSE: RTV SKU INFO FOR INVENTORY                  *        
000003*    RECORD LENGTH:  175 BYTES                                   *        
000004*    RECORD FORMAT:  SEQUENTIAL                                  *        
000005*    THIS IS A CLONE OF CERD010 (CENTRAL STOCK SKU INFO)         *        
000006*    ONLY THE FIELDS THAT NEED TO BE SENT TO INVENTORY ARE NAMED,*        
000007*    THE OTHER FIELDS HAVE BEEN REPLACED BY FILLER.              *        
000008******************************************************************        
000009 01  RV024-SKU-RECORD.                                                    
000010     05  FILLER                      PIC X(15).                           
000011     05  RV024-DEPT                  PIC X(03).                           
000012     05  FILLER                      PIC X(01).                           
000013     05  RV024-CLASS                 PIC X(02).                           
000014     05  FILLER                      PIC X(53).                           
000015     05  RV024-CUR-UNIT-RTL-AMT      PIC S9(05)V99 COMP-3.                
000016     05  FILLER                      PIC X(10).                           
000017     05  RV024-AVAILABLE             PIC 9(09).                           
000018     05  FILLER                      PIC X(18).                           
000019     05  RV024-CNTRL-STK-ID          PIC X(04).                           
000020     05  FILLER                      PIC X(20).                           
000021     05  RV024-SKU-NBR               PIC 9(08).                           
000022     05  FILLER                      PIC X(28).                           
