      ******************************************************************00010009
      *                         RVRD061                                *00020009
      *                                                                *00030009
      *   THIS LAYOUT IS FOR THE GENCO SYSTEM TRANSFER                 *00040009
      *       DAILY ADJUSTMENTS REPORT                                 *00050009
      *                                                                *00060009
      *   LENGTH: 75 BYTES                      10/30/11               *00070010
      ******************************************************************00080009
       01  RV061-TRNSFR-REPORT-RECORD.                                  00090009
           05  RV061-BATCH-NBR                  PIC  9(04).             00100009
           05  RV061-TO-LOC-NBR                 PIC  9(04).             00110009
           05  RV061-TRANSFER-TYPE              PIC  X(01)  VALUE SPACE.00120009
               88  RV061-DEF-DMG-SRT1               VALUE 'A'.          00130009
               88  RV061-DEF-DMG-SRT2               VALUE 'B'.          00140009
               88  RV061-CALLBACK                   VALUE 'C'.          00150009
           05  RV061-ACD-INDICATOR              PIC  X(01).             00160009
           05  RV061-EXTENDED-RETAIL            PIC  9(10)V99.          00170006
           05  FILLER                           PIC  X(53).             00180009
