000100***************************************************************** 00010024
000200*    RECORD PURPOSE: INPUT RECORD FOR THE INTERFACE OF GENCO    * 00020024
000300*                    DETAIL FILE TO RTV DETAIL TABLE TDFMEIT.   * 00030024
000400*                    DATE FORMAT : CCYY-MM-DD                   * 00040024
000500*    RECORD LENGTH:  200 BYTES                                  * 00050024
000600*    RECORD FORMAT:  SEQUENTIAL                      RVRD051    * 00060024
000700***************************************************************** 00070024
000800                                                                  00080024
000900 01  RV051-GENCO-RTV-DETAIL-RECORD.                               00090024
001000     05  RV051-DFCT-ORD-ID                      PIC 9(12).        00100027
001100     05  RV051-DFCT-ORD-ID-X  REDEFINES                           00110026
001200         RV051-DFCT-ORD-ID                      PIC X(12).        00120027
001300     05  RV051-SEQ-NBR                          PIC 9(09).        00130024
001400     05  RV051-SEQ-NBR-X      REDEFINES                           00140024
001500         RV051-SEQ-NBR                          PIC X(09).        00150024
001600     05  RV051-SKU                              PIC X(10).        00160024
001700     05  RV051-UPC                              PIC 9(15).        00170024
001800     05  RV051-DFCT-RET-DTE                     PIC X(10).        00180024
001900     05  RV051-RTL-COST-AMT                     PIC 9(07)V99.     00190024
002000     05  RV051-UNIT-COST-AMT                    PIC 9(07)V99.     00200024
002100     05  RV051-MKOUT-ORD-ID                     PIC 9(11).        00210024
002200     05  RV051-MKOUT-ORD-STAT-CDE               PIC X(01).        00220024
002300     05  RV051-DEPT-NBR                         PIC X(10).        00230024
002400     05  RV051-SUB-CLASS-NBR                    PIC X(10).        00240024
002500     05  RV051-LOC-NBR                          PIC X(05).        00250024
002600     05  RV051-DTL-RETURN-TYPE                  PIC X(01).        00260024
002800     05  RV051-TO-LOC-NBR                       PIC 9(4).         00280025
002900     05  RV051-FILLER                           PIC X(84).        00290027
