000001******************************************************************10/18/95
000002*                         RVRD030                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE GENCO SYSTEM SITE                     *RVWS010 
000005*   (LOCATION) EXTRACT FILE                                      *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 314 BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  RV030-SITE-RECORD.                                                   
000010     05  RV030-ACD-INDICATOR                 PIC  X(01).                  
000011     05  RV030-LOCATION-NBR                  PIC  X(10).                  
000012     05  RV030-LOCATION-NAME                 PIC  X(30).                  
000014     05  RV030-ADDRESS-LINE-1                PIC  X(40).                  
000014     05  RV030-ADDRESS-LINE-2                PIC  X(40).                  
000014     05  RV030-ADDRESS-LINE-3                PIC  X(40).                  
000014     05  RV030-CITY                          PIC  X(30).                  
000014     05  RV030-STATE                         PIC  X(02).                  
000014     05  RV030-ZIP-CODE                      PIC  X(10).                  
000014     05  RV030-PHONE-NBR                     PIC  X(13).                  
000014     05  RV030-FAX-NBR                       PIC  X(13).                  
000014     05  RV030-DISTRICT-NBR                  PIC  X(03).                  
000014     05  RV030-REGION-NBR                    PIC  X(03).                  
000014     05  RV030-COMPANY-NAME                  PIC  X(30).                  
000014     05  RV030-SITE-OPEN-DATE                PIC  X(08).                  
000014     05  RV030-SITE-CLOSE-DATE               PIC  X(08).                  
000014     05  RV030-SITE-SHIP-START-DATE          PIC  X(08).                  
000014     05  RV030-SITE-SHIP-STOP-DATE           PIC  X(08).                  
000016     05  RV030-BUSINESS-UNIT                 PIC  X(03).                  
000016     05  RV030-DROP-LOCATION                 PIC  X(10).                  
000016     05  RV030-TERR-NBR                      PIC  X(03).                  
000017     05  RV030-ANCHOR-CONSTANT               PIC  X(01).                  
