000100***************************************************************** 00010016
000200*    RECORD PURPOSE: INPUT RECORD FOR THE INTERFACE OF GENCO    * 00020016
000300*                    HEADER FILE TO RTV HEADER TABLE TDFCTOR.   * 00030016
000400*                    DATE FORMAT : CCYY-MM-DD                   * 00040016
000500*    RECORD LENGTH:  550 BYTES                                  * 00050016
000600*    RECORD FORMAT:  SEQUENTIAL                      RVRD050    * 00060016
000700***************************************************************** 00070016
000800                                                                  00080016
000900 01  RV050-GENCO-RTV-HEADER-RECORD.                               00090016
001000     05  RV050-DFCT-ORD-ID                      PIC 9(12).        00100017
001010     05  RV050-DFCT-ORD-ID-X  REDEFINES                           00101016
001020         RV050-DFCT-ORD-ID                      PIC X(12).        00102017
001300     05  RV050-VENDOR-DUNS-NBR                  PIC X(09).        00130016
001400     05  RV050-VEND-NAME                        PIC X(25).        00140016
001500     05  RV050-RETURN-TYPE                      PIC X(01).        00150016
001600     05  RV050-ORD-DTE                          PIC X(10).        00160016
001700     05  RV050-OPER-UNT-ID                      PIC 9(04).        00170016
001800     05  RV050-LOC-ID                           PIC X(15).        00180016
001900     05  RV050-STATUS-CHG-DTE                   PIC X(10).        00190016
002000     05  RV050-DFCT-ORD-STAT-CDE                PIC X(01).        00200016
002100     05  RV050-DFCT-SHIPT-ID                    PIC 9(10).        00210016
002200     05  RV050-SHIPT-DTE                        PIC X(10).        00220016
002300     05  RV050-SHIPT-STAT-CDE                   PIC X(01).        00230016
002400     05  RV050-CART-QTY                         PIC 9(08).        00240016
002500     05  RV050-VND-AUTH-NBR                     PIC X(10).        00250016
002600     05  RV050-VND-AUTH-DTE                     PIC X(10).        00260016
002700     05  RV050-INBD-RET-FRGT-SIGN               PIC X(01).        00270016
002800     05  RV050-INBD-RET-FRGT-AMT                PIC 9(06)V99.     00280016
002900     05  RV050-OTBND-RET-FRGT-SIGN              PIC X(01).        00290016
003000     05  RV050-OTBND-RET-FRGT-AMT               PIC 9(06)V99.     00300016
003100     05  RV050-DED-CHRG-SIGN                    PIC X(01).        00310016
003200     05  RV050-DED-CHRG-AMT                     PIC 9(06)V99.     00320016
003300     05  RV050-DISC-PCT-SIGN                    PIC X(01).        00330016
003400     05  RV050-DISC-PCT                         PIC 9(03)V99.     00340016
003500     05  RV050-DISC-AMT-SIGN                    PIC X(01).        00350016
003600     05  RV050-DISC-AMT                         PIC 9(05)V99.     00360016
003700     05  RV050-WEIGHT                           PIC 9(10).        00370016
003800     05  RV050-RET-RSN-CDE                      PIC X(01).        00380016
003900     05  RV050-PAYT-TYP-CDE                     PIC X(01).        00390016
004000     05  RV050-CARR-TRKG-ID                     PIC X(25).        00400016
004100     05  RV050-USR-ID                           PIC X(10).        00410016
004200     05  RV050-TRLR-ID                          PIC X(12).        00420016
004300     05  RV050-SCAC-CDE                         PIC X(04).        00430016
004400     05  RV050-VEND-ATTN-NAME                   PIC X(25).        00440016
004500     05  RV050-VEND-ADDR-DESC                   PIC X(25).        00450016
004600     05  RV050-CITY                             PIC X(15).        00460016
004700     05  RV050-STATE-CDE                        PIC X(02).        00470016
004800     05  RV050-ZIPCODE                          PIC 9(09).        00480016
004900     05  RV050-PHN-AREA-CDE                     PIC 9(03).        00490016
005000     05  RV050-PHN-EXCH-NBR                     PIC 9(03).        00500016
005100     05  RV050-PHN-NBR                          PIC 9(04).        00510016
005200     05  RV050-FAX-PHN-AREA-CDE                 PIC 9(03).        00520016
005300     05  RV050-FAX-EXCH-NBR                     PIC 9(03).        00530016
005400     05  RV050-FAX-PHN-NBR                      PIC 9(04).        00540016
005500     05  RV050-VND-EMAIL-ADDR                   PIC X(100).       00550016
005600     05  RV050-FILLER                           PIC X(114).       00560017
