000001******************************************************************10/18/95
000002*                         RVRD999                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM ITEM     *RVWS010 
000005*       EXTRACT FILE                                             *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 117 BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  RV999-ITEM-RECORD.                                                   
           05  RV999-SUB-CL-NBR                    PIC S9(04)V COMP-3.          
           05  RV999-DEPT-NBR                      PIC S9(04)V COMP-3.          
           05  RV999-SKU-NBR                       PIC S9(08)V COMP-3.          
000013     05  RV999-UPC-NBR                       PIC S9(15)V COMP-3.          
           05  RV999-SKU-DESC                      PIC  X(30).                  
           05  RV999-VS-NBR                        PIC  X(20).                  
           05  RV999-NRF-CLOR-CDE                  PIC  X(03).                  
           05  RV999-CSTM-CLOR-DESC                PIC  X(10).                  
           05  RV999-SIZE-DESC                     PIC  X(10).                  
           05  RV999-KOHLS-SIZE-CDE                PIC S9(09)  COMP.            
           05  RV999-INNR-PK-QTY                   PIC S9(04)  COMP.            
           05  RV999-QTY-OF-MEASURE                PIC  X(02).                  
           05  RV999-DUNS-NBR                      PIC  X(09).                  
           05  RV999-ITM-NBR                       PIC S9(15)V COMP-3.          
