000001******************************************************************        
000002*    COPY MEMBER:  RVRD006                       LRECL = 500     *        
000003*                                                                *        
000004*    THIS MEMBER IS USED AS A FILE LAYOUT FOR THE EXTRACT FILE   *        
000005*    CONTAINING INFORMATION TO BE PASSED TO AP FOR FREIGHT       *        
000006*    PAYMENTS FOR RTV TYPE TRANSACTIONS                          *        
000007*                                                                *        
000008******************************************************************        
000009 01  RV006-RECORD.                                                        
000010     05  RV006-CARRIER                    PIC  X(04).                     
000011     05  RV006-TRACKING-NBR               PIC  X(25).                     
P49473*    05  RV006-DEBIT-NBR                  PIC  X(06).                     
P49473     05  RV006-DEBIT-NBR                  PIC  X(16).                     
000013     05  RV006-DEPT-NBR                   PIC  X(04).                     
000014     05  RV006-MAJ-CLASS                  PIC  9(04).                     
000015     05  RV006-TRAILER-NBR                PIC  X(12).                     
000016     05  RV006-CARTONS                    PIC  9(09).                     
000017     05  RV006-INB-FRGT-AMT               PIC S9(07)V99.                  
000018     05  RV006-OUTB-FRGT-AMT              PIC S9(07)V99.                  
P49473*    05  RV006-FILLER                     PIC  X(118).                    
P49473     05  RV006-FILLER                     PIC  X(108).                    
