      ******************************************************************00010002
      *                         RVRD062                                *00020002
      *                                                                *00030002
      *   THIS LAYOUT IS FOR THE LISTING STATUS UPDATE REPORT          *00040002
      *                                                                *00050002
      *                                                                *00060002
      *   LENGTH: 125 BYTES                      10/30/11              *00070007
      ******************************************************************00080002
       01  RV062-LISTING-REPORT-RECORD.                                 00090002
           05  RV062-RTV-LOCATION           PIC  9(04).                 00100003
           05  RV062-LISTING-NBR            PIC  X(12) VALUE SPACES.    00110008
           05  RV062-VENDOR-NAME            PIC  X(27) VALUE SPACES.    00120002
           05  RV062-LISTING-TYPE           PIC  X(07) VALUE SPACES.    00130002
           05  RV062-CURRENT-STATUS         PIC  X(08) VALUE SPACES.    00140002
           05  RV062-STATUS-CHG-DATE        PIC  X(12) VALUE SPACES.    00150002
           05  RV062-TOT-RTL-CST-AMT        PIC  9(11)V99.              00160002
           05  RV062-TOT-UNT-CST-AMT        PIC  9(11)V99.              00170002
           05  RV062-TDFCTOR-UPDATE-COUNT   PIC  9(7).                  00180003
           05  FILLER                       PIC  X(22).                 00190008
