000001******************************************************************10/18/95
000002*                         RVRD021                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE GENCO SYSTEM VENDOR AGREEMENT         *RVWS010 
000005*       EXTRACT FILE                                             *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 53  BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  RV021-VNDAGR-RECORD.                                                 
000010     05  RV021-ACD-INDICATOR                 PIC  X(01).                  
000011     05  RV021-VENDOR-NUMBER                 PIC  X(10).                  
000011     05  RV021-DEPT-NBR                      PIC  X(10).                  
000011     05  RV021-RTV-RA-REQD-IND               PIC  X(01).                  
000011     05  RV021-RTV-NO-RA-REQD-IND            PIC  X(01).                  
000011     05  RV021-DEBIT-DESTROY-IND             PIC  X(01).                  
000011     05  RV021-MARKOUT-IND                   PIC  X(01).                  
000011     05  RV021-RETURN-AUTH-ID                PIC  X(10).                  
000011     05  RV021-KOHLS-FRGT-PCT                PIC  999V99.                 
000011     05  RV021-VND-FRGT-PCT                  PIC  999V99.                 
000011     05  RV021-NEGOTIATED-PCT                PIC  999V9999.               
000015     05  RV021-ANCHOR-CONSTANT               PIC  X(01).                  
