000001******************************************************************10/18/95
000002*                         RVRD040                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE GENCO VENDOR EXTRACT FILE             *RVWS010 
000005*       EXTRACT FILE                                             *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 114 BYTES                                             RVWS010 
000008******************************************************************RVWS010 
000009 01  RV040-VENDOR-RECORD.                                                 
000010     05  RV040-ACD-INDICATOR                 PIC  X(01).                  
000011     05  RV040-VENDOR-NUMBER                 PIC  X(10).                  
000012     05  RV040-VENDOR-NAME                   PIC  X(35).                  
000013     05  RV040-EIN                           PIC  X(20).                  
000014     05  RV040-DUN-NUMBER                    PIC  X(20).                  
000015     05  RV040-FACTOR-NUMBER                 PIC  X(10).                  
000016     05  RV040-FRT-PAYMENT-TYPE              PIC  X(10).                  
000017     05  RV040-CURRENCY-CODE                 PIC  X(03).                  
000018     05  RV040-SCAC                          PIC  X(04).                  
000019     05  RV040-ANCHOR-CONSTANT               PIC  X(01).                  
