00001 ******************************************************************        
00002 *                         RVWS010                                *        
00003 *                                                                *        
00004 *   THIS IS LAYOUT OF THE RTV REPORTING EXTRACT FILE.            *        
00005 *   THIS FIRST RECORD WILL BE THE DATE RECORD (RECORD TYPE = 1)  *        
00006 *   AND ALL THE REST OF THE RECORDS WILL BE DETAIL RECORDS       *        
00007 *   (RECORD TYPE = 2)                                            *        
00008 *                                                                *        
00009 *   LENGTH: 200 BYTES                                            *        
00010 ******************************************************************        
00011  01  RV010-EXTRACT-RECORD.                                                
00012      05  RV010-DETAIL-DATA.                                               
00013          10  RV010-RECORD-TYPE       PIC  X(01)    VALUE SPACE.           
00014              88  RV010-HEADER-REC    VALUE '1'.                           
00015              88  RV010-DETAIL-REC    VALUE '2'.                           
00016          10  RV010-ITEM-NBR          PIC S9(15)    VALUE +0               
00017                                                    COMP-3.                
00018          10  RV010-RTL-COST-AMT      PIC S9(05)V99 VALUE +0               
00019                                                    COMP-3.                
00020          10  RV010-DPT-NBR           PIC  X(03)    VALUE SPACES.          
00020          10  RV010-DPT-NBR-N                                              
                   REDEFINES RV010-DPT-NBR PIC  9(03).                          
00021          10  RV010-DPT-DESC          PIC  X(25)    VALUE SPACES.          
00022          10  RV010-OPER-UNT-ID       PIC S9(04)    VALUE +0               
00023                                                    COMP.                  
00024          10  RV010-FCLTY-NAME        PIC  X(25)    VALUE SPACES.          
00025          10  RV010-LIST-STAT-CDE     PIC  X(01)    VALUE SPACES.          
00026              88  RV010-DR-REC        VALUE 'S'.                           
00027              88  RV010-MO-REC        VALUE 'A'.                           
00028              88  RV010-DD-REC        VALUE 'D'.                           
00029          10  RV010-DUNS-NBR          PIC  X(09)    VALUE SPACES.          
00020          10  RV010-DUNS-NBR-N REDEFINES                                   
                   RV010-DUNS-NBR          PIC  9(09).                          
00030          10  RV010-VND-NAME          PIC  X(30)    VALUE SPACES.          
00031          10  RV010-DMM-NAME          PIC  X(32)    VALUE SPACES.          
00032          10  RV010-DMM-NBR           PIC  X(03)    VALUE SPACES.          
00033          10  RV010-FCLTY-ABBR        PIC  X(10)    VALUE SPACES.          
00018          10  RV010-UNIT-COST-AMT     PIC S9(11)V99 VALUE +0               
00019                                                    COMP-3.                
00038          10  RV010-RETURN-DATE.                                           
00039              15  RV010-RETURN-CC     PIC  X(02).                          
00040              15  RV010-RETURN-YY     PIC  X(02).                          
00041              15  FILLER              PIC  X.                              
00042              15  RV010-RETURN-MM     PIC  X(02).                          
00043              15  FILLER              PIC  X.                              
00044              15  RV010-RETURN-DD     PIC  X(02).                          
00194          10 RV010-LIST-TYPE-CDE      PIC X.                               
                   88  RV010-RTV-TYPE      VALUE 'R'.                           
                   88  RV010-DD-TYPE       VALUE 'D'.                           
                   88  RV010-MO-TYPE       VALUE 'M'.                           
00034          10  FILLER                  PIC  X(29)    VALUE SPACES.          
00035                                                                           
00036      05  RV010-DATE-RECORD REDEFINES RV010-DETAIL-DATA.                   
00037          10  FILLER                  PIC  X(01).                          
00038          10  RV010-BEGIN-DATE.                                            
00039              15  RV010-BEGIN-CC      PIC  X(02).                          
00040              15  RV010-BEGIN-YY      PIC  X(02).                          
00041              15  FILLER              PIC  X.                              
00042              15  RV010-BEGIN-MM      PIC  X(02).                          
00043              15  FILLER              PIC  X.                              
00044              15  RV010-BEGIN-DD      PIC  X(02).                          
00045          10  RV010-END-DATE.                                              
00046              15  RV010-END-CC        PIC  X(02).                          
00047              15  RV010-END-YY        PIC  X(02).                          
00048              15  FILLER              PIC  X.                              
00049              15  RV010-END-MM        PIC  X(02).                          
00050              15  FILLER              PIC  X.                              
00051              15  RV010-END-DD        PIC  X(02).                          
00052          10  RV010-CURR-DATE.                                             
00053              15  RV010-CURR-CC       PIC  X(02).                          
00054              15  RV010-CURR-YY       PIC  X(02).                          
00055              15  FILLER              PIC  X.                              
00056              15  RV010-CURR-MM       PIC  X(02).                          
00057              15  FILLER              PIC  X.                              
00058              15  RV010-CURR-DD       PIC  X(02).                          
00059          10  RV010-RPT-TYPE          PIC  X(1).                           
00060          10  RV010-DR-TOTAL-QTY      PIC S9(06)    COMP-3.                
00061          10  RV010-DR-TOTAL-COST     PIC S9(08)V99 COMP-3.                
00061          10  RV010-DR-TOTAL-RETAIL   PIC S9(08)V99 COMP-3.                
00062          10  RV010-DD-TOTAL-QTY      PIC S9(06)    COMP-3.                
00063          10  RV010-DD-TOTAL-COST     PIC S9(08)V99 COMP-3.                
00063          10  RV010-DD-TOTAL-RETAIL   PIC S9(08)V99 COMP-3.                
00064          10  RV010-MO-TOTAL-QTY      PIC S9(06)    COMP-3.                
00065          10  RV010-MO-TOTAL-COST     PIC S9(08)V99 COMP-3.                
00065          10  RV010-MO-TOTAL-RETAIL   PIC S9(08)V99 COMP-3.                
00193          10 RV010-BEGIN-FISCAL-DATE.                                      
00194              15 RV010-BEGIN-FISCAL-YEAR  PIC  9(02).                      
00194              15 RV010-BEGIN-FISCAL-MONTH PIC  9(02).                      
00194          10 RV010-END-FISCAL-DATE.                                        
00194              15 RV010-END-FISCAL-YEAR    PIC  9(02).                      
00194              15 RV010-END-FISCAL-MONTH   PIC  9(02).                      
00066          10  FILLER                  PIC  X(112).                         
