000100*----------------------------------------------------------------*00010004
000200*                         RVWS009                                *00020004
000300*                                                                *00030004
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE RTV SHIPMENT LIST *00040004
000500*   PROGRAM TO PASS THE SELECTED SHIPMENT NUMBER INFORMATION.    *00050004
000600*                                                                *00060004
000700*----------------------------------------------------------------*00070004
000800                                                                  00080004
000900 01  RV009-LINE-SEL-REC.                                          00090004
001000       05  RV009-SELECTED-ITEMS              PIC S9(05)  COMP-3   00100004
001100                                                    VALUE ZERO.   00110004
001200       05  RV009-MAX-ITEMS                   PIC  9(02)  VALUE 20.00120004
001300       05  RV009-SELECTED-ITEM-ARRAY.                             00130004
001400           10  FILLER                        OCCURS 20 TIMES      00140004
001500                                             INDEXED BY RV009-IDX.00150004
001600               15  RV009-ITEM                PIC S9(09)  COMP-3.  00160004
001700               15  RV009-ACTION-SW           PIC  X(01).          00170004
001800                   88  RV009-INQ                    VALUE 'I'.    00180004
001900                   88  RV009-UPD                    VALUE 'U'.    00190004
002000                   88  RV009-DEL                    VALUE 'D'.    00200004
002100                   88  RV009-ERR                    VALUE 'E'.    00210004
002200               15  RV009-KEY-DATA.                                00220004
002300                   20  RV009-SCAC-CDE        PIC  X(04).          00230004
002400                   20  RV009-DFCT-SHIPT-ID   PIC  9(12).          00240005
002500                   20  RV009-TRLR-ID         PIC  X(12).          00250004
028800                   20  RV009-CARR-TRKG-ID    PIC  X(25).          02880004
028900                   20  RV009-SHIPT-DATE      PIC  X(10).          02890004
029000                   20  RV009-DFCT-ORD-ID     PIC  9(06).          02900004
029100                   20  RV009-VEND-NAME       PIC  X(25).          02910004
