00001 ***************************************************************   12/04/92
00002 *                                                             *   RVWS101 
00003 *     THIS IS THE LAYOUT FOR THE TS QUEUE RECORD(S) THAT ARE  *      LV008
00004 *     CREATED IN RVKCS100 - REQUEST RA LIST.  THESE RECORDS   *   RVWS101 
00005 *     ARE PASSED TO RVKCSXXX FOR UPDATE PURPOSES.             *   RVWS101 
00006 *                                                             *   RVWS101 
00007 ***************************************************************   RVWS101 
00008                                                                   RVWS101 
00009  01  RV101-RA-REQUEST-RECORD.                                     RVWS101 
00010       05  RV101-RA-SELECTED-ITEMS  PIC 999            VALUE 0.       CL**8
00011       05  RV101-RA-MAX-ITEMS       PIC S9(3)  COMP-3  VALUE 100.     CL**3
00012                                                                      CL**3
00013       05  RV101-RA-ARRAY           OCCURS 100 TIMES               RVWS101 
00014                                    INDEXED BY RV101-IDX.             CL**8
00015           10  RV101-ITEM           PIC 9(9)   COMP-3.                CL**3
00016           10  RV101-ACTION         PIC X.                            CL**3
00017               88  RV101-UPD                           VALUE 'U'.     CL**3
00018               88  RV101-DEL                           VALUE 'D'.     CL**3
00019               88  RV101-INQ                           VALUE 'I'.     CL**3
00020               88  RV101-ERR                           VALUE 'E'.     CL**3
00021           10  RV101-RA-NUMBER      PIC S9(12) COMP-3.                CL**8
00022 *                                                                 RVWS101 
