00001 ******************************************************************        
00002 *                         RVWS100                                *        
00003 *                                                                *        
00004 *   THIS IS THE INTER APPLICATION COMMAREA FOR: RVKCS100         *        
00005 *                                             THROUGH  RVKCS111. *        
00006 *                                                                *        
00007 *   LENGTH:  200  BYTES                                          *        
00008 ******************************************************************        
00009          10  RV100-INTER-APPL-COMMAREA  REDEFINES                         
00010                  INTER-APPL-COMM-AREA.                                    
00011              15  FILLER                         PIC X(01).                
00012              15  RV100-INTER-APPL-FORMAT-CODE   PIC X(04).                
00013              15  RV100-INTER-APPL-ACKNLG-CODE   PIC X(04).                
00014                                                                           
00015              15  RV100-CO-NUMBER                PIC X(02).                
00016              15  RV100-RA-NUMBER                PIC S9(12)                
00017                                                     COMP-3.               
00018              15  RV100-DEPT-NUMBER              PIC X(3).                 
00019              15  RV100-TYPE-CDE                 PIC X(1).                 
00020                  88 RV100-VALID-TYPE-CDE        VALUE                     
00021                     'M', 'R', 'D', 'C'.                                   
00022                  88 RV100-MARKOUT-TYPE          VALUE 'M'.                
00023                  88 RV100-RTV-TYPE              VALUE 'R'.                
00024                  88 RV100-D-AND-D-TYPE          VALUE 'D'.                
00024                  88 RV100-CALLBACK              VALUE 'C'.                
00025              15  RV100-STATUS-CDE               PIC X(1).                 
00026                  88 RV100-VALID-STATUS-CDE      VALUE                     
00027                     'O', 'C', 'S', 'P', 'A', 'D', 'N'.                    
00028                  88 RV100-VALID-MKOUT-STATUS    VALUE                     
00029                     'N', 'O', 'P', 'A'.                                   
00030                  88 RV100-VALID-D-AND-D-STATUS  VALUE                     
00031                     'N', 'D', 'A', 'C', 'S'.                              
00032                  88 RV100-VALID-RTV-STATUS      VALUE                     
00033                     'N', 'O', 'C', 'S', 'A'.                              
00032                  88 RV100-VALID-CALBK-STATUS    VALUE                     
00033                     'N', 'O', 'C', 'S', 'A'.                              
00034                  88 RV100-NEW-STAT              VALUE 'N'.                
00035                  88 RV100-OPEN-STAT             VALUE 'O'.                
00036                  88 RV100-CLOSE-STAT            VALUES 'C', 'D'.          
00037                  88 RV100-SHIP-STAT             VALUE 'S'.                
00038                  88 RV100-PEND-STAT             VALUE 'P'.                
00039                  88 RV100-APPROVE-STAT          VALUE 'A'.                
00040                  88 RV100-D-AND-D-STAT          VALUE 'D'.                
00041                                                                           
00042              15  RV100-VENDOR-NAME              PIC X(25).                
00043                                                                           
00044              15  RV100-NUMBER-SELECTED-ITEMS    PIC S9(09)                
00045                                                     COMP-3.               
00046              15  RV100-NUMBER-PROCESSED-ITEMS   PIC S9(09)                
00047                                                     COMP-3.               
00048                                                                           
00049              15  RV100-TSQB-QUEUE-NAME          PIC X(8).                 
00050              15  RV100-TSQB-QUEUE-LENGTH        PIC S9(4)                 
00051                                                     COMP.                 
00052              15  RV100-RECORD-UPDATED-SW        PIC X(1).                 
00053                  88  RV100-RECORD-UPDATED       VALUE 'Y'.                
00054                  88  RV100-RECORD-NOT-UPDATED   VALUE 'N'.                
00055                                                                           
00056              15  RV100-UPDATE-KEYS.                                       
00057                  20  RV100-UK-RA-NUMBER         PIC S9(12)                
00058                                                     COMP-3.               
00059                  20  RV100-UK-DEBIT-NUMBER      PIC S9(12)                
00060                                                     COMP-3.               
00061              15  RV100-OPER-UNT-ID              PIC S9(04)                
00062                                                     COMP.                 
00063              15  RV100-LOCATION                 PIC X(15).                
00064              15  RV100-PRINTER-DEST             PIC X(08).                
00065              15  RV100-BUYER-NAME               PIC X(15).                
00065              15  RV100-TOTAL-RETAIL             PIC S9(09)V99.            
00065              15  RV100-TOTAL-COST               PIC S9(09)V99.            
00065              15  RV100-ENT-ID                   PIC S9(09) COMP.          
00066              15  FILLER                         PIC X(51).                
