        PRINT  NOGEN                                                            
SAKM426 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
**************                                                                  
SA426A  DFHMDI LINE=2,COLUMN=1,                                        C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
**************                                                                  
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZ9'                                                   
*                                                                               
AVARON  DFHMDF POS=(03,55),LENGTH=02,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='ON'                                                     
*                                                                               
        DFHMDF POS=(04,01),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='SEL'                                                    
        DFHMDF POS=(04,05),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='ACT'                                                    
        DFHMDF POS=(04,10),LENGTH=10,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='SALES DATE'                                             
        DFHMDF POS=(04,22),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='STR'                                                    
        DFHMDF POS=(04,28),LENGTH=03,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='REG'                                                    
        DFHMDF POS=(04,34),LENGTH=04,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL,                                          C        
               INITIAL='TRAN'                                                   
AVARHDR DFHMDF POS=(04,40),LENGTH=40,ATTRB=(PROT,NORM),                C        
               COLOR=NEUTRAL                                                    
*                                                                               
ASEL01  DFHMDF POS=(05,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(05,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT01  DFHMDF POS=(05,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE01 DFHMDF POS=(05,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR01 DFHMDF POS=(05,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG01  DFHMDF POS=(05,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN01 DFHMDF POS=(05,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR01  DFHMDF POS=(05,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL02  DFHMDF POS=(06,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(06,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT02  DFHMDF POS=(06,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE02 DFHMDF POS=(06,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR02 DFHMDF POS=(06,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG02  DFHMDF POS=(06,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN02 DFHMDF POS=(06,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR02  DFHMDF POS=(06,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL03  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(07,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT03  DFHMDF POS=(07,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE03 DFHMDF POS=(07,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR03 DFHMDF POS=(07,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG03  DFHMDF POS=(07,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN03 DFHMDF POS=(07,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR03  DFHMDF POS=(07,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL04  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(08,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT04  DFHMDF POS=(08,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE04 DFHMDF POS=(08,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR04 DFHMDF POS=(08,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG04  DFHMDF POS=(08,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN04 DFHMDF POS=(08,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR04  DFHMDF POS=(08,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL05  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(09,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT05  DFHMDF POS=(09,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE05 DFHMDF POS=(09,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR05 DFHMDF POS=(09,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG05  DFHMDF POS=(09,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN05 DFHMDF POS=(09,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR05  DFHMDF POS=(09,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL06  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(10,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT06  DFHMDF POS=(10,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE06 DFHMDF POS=(10,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR06 DFHMDF POS=(10,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG06  DFHMDF POS=(10,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN06 DFHMDF POS=(10,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR06  DFHMDF POS=(10,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL07  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(11,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT07  DFHMDF POS=(11,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE07 DFHMDF POS=(11,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR07 DFHMDF POS=(11,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG07  DFHMDF POS=(11,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN07 DFHMDF POS=(11,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR07  DFHMDF POS=(11,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL08  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(12,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT08  DFHMDF POS=(12,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE08 DFHMDF POS=(12,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR08 DFHMDF POS=(12,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG08  DFHMDF POS=(12,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN08 DFHMDF POS=(12,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR08  DFHMDF POS=(12,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL09  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(13,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT09  DFHMDF POS=(13,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE09 DFHMDF POS=(13,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR09 DFHMDF POS=(13,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG09  DFHMDF POS=(13,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN09 DFHMDF POS=(13,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR09  DFHMDF POS=(13,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL10  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(14,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT10  DFHMDF POS=(14,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE10 DFHMDF POS=(14,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR10 DFHMDF POS=(14,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG10  DFHMDF POS=(14,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN10 DFHMDF POS=(14,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR10  DFHMDF POS=(14,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL11  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(15,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT11  DFHMDF POS=(15,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE11 DFHMDF POS=(15,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR11 DFHMDF POS=(15,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG11  DFHMDF POS=(15,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN11 DFHMDF POS=(15,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR11  DFHMDF POS=(15,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL12  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(16,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT12  DFHMDF POS=(16,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE12 DFHMDF POS=(16,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR12 DFHMDF POS=(16,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG12  DFHMDF POS=(16,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN12 DFHMDF POS=(16,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR12  DFHMDF POS=(16,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL13  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(17,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT13  DFHMDF POS=(17,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE13 DFHMDF POS=(17,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR13 DFHMDF POS=(17,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG13  DFHMDF POS=(17,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN13 DFHMDF POS=(17,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR13  DFHMDF POS=(17,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
ASEL14  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C        
               HILIGHT=UNDERLINE,                                      C        
               COLOR=GREEN                                                      
        DFHMDF POS=(18,04),LENGTH=00,ATTRB=(ASKIP)                              
AACT14  DFHMDF POS=(18,05),LENGTH=03,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ADATE14 DFHMDF POS=(18,10),LENGTH=10,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ASTOR14 DFHMDF POS=(18,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AREG14  DFHMDF POS=(18,28),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
ATRAN14 DFHMDF POS=(18,34),LENGTH=04,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
AVAR14  DFHMDF POS=(18,40),LENGTH=40,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE                                                       
*                                                                               
        DFHMDF POS=(19,41),LENGTH=25,ATTRB=(ASKIP,NORM),               C        
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'                
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C        
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                                      
**************                                                                  
        DFHMSD TYPE=FINAL                                                       
**************                                                                  
        END                                                                     
