*********************************************************************** 00010000
*  THIS SCREEN IS INVOKED BY TRANSACTION S405, PROGRAM SAKCS405.  IT  * 00020001
*  REPRESENTS A NON-SELECTABLE LIST.  IT WILL LIST TENDERS RELATED TO * 00030001
*  A TRANSACTION.                                                     * 00040001
*********************************************************************** 00050000
        PRINT  NOGEN                                                    00060000
SAKM405 DFHMSD TYPE=DSECT,                                             C00070001
               LANG=COBOL,                                             C00080000
               MODE=INOUT,                                             C00090000
               STORAGE=AUTO,                                           C00100000
               TERM=3270-2,                                            C00110000
               TIOAPFX=YES                                              00120000
**************                                                          00130000
SA405A  DFHMDI LINE=2,COLUMN=1,                                        C00140001
               SIZE=(19,80),                                           C00150000
               CTRL=(FREEKB),                                          C00160000
               MAPATTS=(COLOR,HILIGHT),                                C00170000
               DSATTS=(COLOR,HILIGHT)                                   00180000
**************                                                          00190000
        DFHMDF POS=(02,01),                                            C00200000
               LENGTH=11,                                              C00210000
               COLOR=NEUTRAL,                                          C00220000
               ATTRB=(ASKIP,NORM),                                     C00230000
               INITIAL='SALES DATE:'                                    00240000
ASLSDTE DFHMDF POS=(02,13),                                            C00250000
               LENGTH=10,                                              C00260000
               ATTRB=(ASKIP,NORM)                                       00270000
*                                                                       00280000
        DFHMDF POS=(02,24),                                            C00290000
               LENGTH=5,                                               C00300000
               COLOR=NEUTRAL,                                          C00310000
               ATTRB=(ASKIP,NORM),                                     C00320000
               INITIAL='TIME:'                                          00330000
ATIMEHH DFHMDF POS=(02,30),                                            C00340000
               LENGTH=02,                                              C00350000
               ATTRB=(ASKIP,NORM)                                       00360000
        DFHMDF POS=(02,33),                                            C00370000
               LENGTH=1,                                               C00380000
               COLOR=NEUTRAL,                                          C00390000
               ATTRB=(ASKIP,NORM),                                     C00400000
               INITIAL=':'                                              00410000
ATIMEMM DFHMDF POS=(02,35),                                            C00420000
               LENGTH=2,                                               C00430000
               ATTRB=(ASKIP,NORM)                                       00440000
ATIMEAP DFHMDF POS=(02,38),                                            C00450000
               LENGTH=1,                                               C00460000
               ATTRB=(ASKIP,NORM)                                       00470000
*                                                                       00480000
        DFHMDF POS=(02,40),                                            C00490000
               LENGTH=6,                                               C00500000
               COLOR=NEUTRAL,                                          C00510000
               ATTRB=(ASKIP,NORM),                                     C00520000
               INITIAL='STORE:'                                         00530000
ASTORE  DFHMDF POS=(02,47),                                            C00540000
               LENGTH=5,                                               C00550000
               ATTRB=(ASKIP,NORM),                                     C00560000
               PICOUT='ZZ999'                                           00570000
*                                                                       00580000
        DFHMDF POS=(02,53),                                            C00590000
               LENGTH=4,                                               C00600000
               COLOR=NEUTRAL,                                          C00610000
               ATTRB=(ASKIP,NORM),                                     C00620000
               INITIAL='REG:'                                           00630000
AREG    DFHMDF POS=(02,58),                                            C00640000
               LENGTH=4,                                               C00650000
               ATTRB=(ASKIP,NORM)                                       00660000
*                                                                       00670000
        DFHMDF POS=(02,63),                                            C00680000
               LENGTH=6,                                               C00690000
               COLOR=NEUTRAL,                                          C00700000
               ATTRB=(ASKIP,NORM),                                     C00710000
               INITIAL='TRANS:'                                         00720000
ATRANS  DFHMDF POS=(02,70),                                            C00730000
               LENGTH=4,                                               C00740000
               ATTRB=(ASKIP,NORM)                                       00750000
*                                                                       00751002
        DFHMDF POS=(03,01),                                            C00752002
               LENGTH=9,                                               C00753002
               COLOR=NEUTRAL,                                          C00754002
               ATTRB=(ASKIP,NORM),                                     C00755002
               INITIAL='ASSOC ID:'                                      00756002
AASSCID DFHMDF POS=(03,13),                                            C00757004
               LENGTH=9,                                               C00758004
               ATTRB=(ASKIP,NORM)                                       00759002
*                                                                       00759102
        DFHMDF POS=(05,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00770000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00780000
ASTRTIT DFHMDF POS=(05,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00790000
               COLOR=GREEN,                                            C00800000
               HILIGHT=UNDERLINE,                                      C00810000
               PICOUT='ZZZZ9'                                           00820000
        DFHMDF POS=(05,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00830000
               COLOR=NEUTRAL,                                          C00840000
               INITIAL='TO'                                             00850000
AENDIT  DFHMDF POS=(05,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00860000
               COLOR=BLUE,                                             C00870000
               PICOUT='ZZZZ9'                                           00880000
        DFHMDF POS=(05,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00890000
               COLOR=NEUTRAL,                                          C00900000
               INITIAL='OF'                                             00910000
ATOTIT  DFHMDF POS=(05,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00920000
               COLOR=BLUE,                                             C00930000
               PICOUT='ZZZZ9'                                           00940000
*                                                                       00950000
AHEAD   DFHMDF POS=(06,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C00960000
               COLOR=NEUTRAL                                            00970000
*                                                                       00980000
ASCRL01 DFHMDF POS=(07,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C00990000
               COLOR=BLUE                                               01000000
*                                                                       01010000
ASCRL02 DFHMDF POS=(08,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01020000
               COLOR=BLUE                                               01030000
*                                                                       01040000
ASCRL03 DFHMDF POS=(09,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01050000
               COLOR=BLUE                                               01060000
*                                                                       01070000
ASCRL04 DFHMDF POS=(10,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01080000
               COLOR=BLUE                                               01090000
*                                                                       01100000
ASCRL05 DFHMDF POS=(11,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01110000
               COLOR=BLUE                                               01120000
*                                                                       01130000
ASCRL06 DFHMDF POS=(12,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01140000
               COLOR=BLUE                                               01150000
*                                                                       01160000
ASCRL07 DFHMDF POS=(13,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01170000
               COLOR=BLUE                                               01180000
*                                                                       01190000
ASCRL08 DFHMDF POS=(14,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01200000
               COLOR=BLUE                                               01210000
*                                                                       01220000
ASCRL09 DFHMDF POS=(15,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01230000
               COLOR=BLUE                                               01240000
*                                                                       01250000
ASCRL10 DFHMDF POS=(16,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C01260000
               COLOR=BLUE                                               01270000
*                                                                       01280000
**************                                                          01290000
        DFHMSD TYPE=FINAL                                               01300000
**************                                                          01310000
        END                                                             01320000
