000100 IDENTIFICATION DIVISION.                                         00010000
000200                                                                  00020000
000300 PROGRAM-ID.      SAKUT048.                                       00030000
000400 AUTHOR.          STEVEN NOWAK.                                   00040000
000500 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00050000
000600 DATE-WRITTEN.    04/15/09.                                       00060000
000700 DATE-COMPILED.                                                   00070000
000800                                                                  00080000
000900******************************************************************00090000
001000*  MODULE TYPE:   COBOL2 BATCH.                                   00100005
001100*                                                                 00110005
001200* THIS PROGRAM PREPARES THE TSAADSU UPDATE FILE TO BE PROCESSED   00120000
001300* BY SAKUP005 UNDER THE DB2 CHECKPOINT RESTART SYSTEM.            00130000
001400*                                                                 00140000
001500* THE PROGRAM READS THE TSAADSU UPDATE FILE, REFORMATS THE        00150000
001600* RECORDS AND SETS A CHECKPOINT INDICATOR ON THE RECORD BASED     00160000
001700* ON HOW CHECKPOINTS WILL BE TAKEN BY THE MAINTENANCE PROGRAM.    00170000
001800* AFTER A RECORD HAS BEEN REFORMATTED IT IS PASSED TO THE         00180000
001900* TRANSACTION PREPARATION MODULE (DPKUT900) WHICH DOES SOME MORE  00190000
002000* PROCESSING ON THE RECORDS AND WRITES THE REFORMATTED RECORDS    00200000
002100* OUT TO A SEQUENTIAL FILE.                                       00210000
002200*                                                                 00220000
002300* THE PROGRAM COMMUNICATES WITH THE TRANSACTION PREPARATION       00230000
002400* MODULE USING FUNCTION CODES (OPEN, WRITE, & CLOSE) AND CHECKS   00240000
002500* THE RETURN CODE AFTER EACH REQUEST.  IF AN INVALID RETURN CODE  00250000
002600* IS RECEIVED, ANY INFORMATION THAT MAY BE HELPFUL IN RESOLVING   00260000
002700* THE BAD RETURN CODE IS DISPLAYED ON SYSOUT AND THE PROGRAM      00270000
002800* ABENDS.                                                         00280000
002900*                                                                 00290005
003000*========================== CHANGE LOG ===========================00300005
003100*  AUTH              BY       DATE     DESCRIPTION                00310015
003200*=================================================================00320005
003300* WR36527         TKMA409   04-15-09   CREATE PROGRAM             00330015
003400*                                                                 00340005
260107* CHG0260107   JIM HUNTER   08-16-21   ADD COPYBOOK DPWS990 TO    00341017
260107*                                      MAKE DPKUT900 CALL DYNAMIC.00342016
003500******************************************************************00350005
003600                                                                  00360000
003700 ENVIRONMENT DIVISION.                                            00370000
003800 CONFIGURATION SECTION.                                           00380000
003900                                                                  00390000
004000 SOURCE-COMPUTER.    IBM-3090.                                    00400000
004100 OBJECT-COMPUTER.    IBM-3090.                                    00410000
004200                                                                  00420000
004300 INPUT-OUTPUT SECTION.                                            00430000
004400 FILE-CONTROL.                                                    00440000
004500                                                                  00450000
004600     SELECT UPDATE-FILE   ASSIGN TO INP01.                        00460000
004700                                                                  00470000
004800 DATA DIVISION.                                                   00480000
004900 FILE SECTION.                                                    00490000
005000                                                                  00500000
005100 FD  UPDATE-FILE                                                  00510000
005200     RECORDING MODE IS F                                          00520000
005300     BLOCK CONTAINS 0 RECORDS                                     00530000
005400     LABEL RECORDS ARE OMITTED.                                   00540000
005500                                                                  00550000
005600 01  UPDATE-REC                       PIC  X(28).                 00560000
005700                                                                  00570000
005800***************************************************************** 00580000
005900*                       WORKING STORAGE                           00590000
006000***************************************************************** 00600000
006100 WORKING-STORAGE SECTION.                                         00610000
006200                                                                  00620000
006300 01  W-START                          PIC  X(40)                  00630004
006400     VALUE 'SAKUT048 - WORKING STORAGE BEGINS HERE'.              00640000
006500                                                                  00650000
006600                                                                  00660000
006700***************************************************************** 00670000
006800*                         SWITCHES                                00680000
006900***************************************************************** 00690000
007000 01  PROGRAM-SWITCHES.                                            00700000
007100     05  PS-INPUT-UPDATE-EOF-SW       PIC  X(01) VALUE 'N'.       00710004
007200         88  PS-INPUT-UPDATE-EOF                 VALUE 'Y'.       00720000
007300     05  PS-FIRST-TRANS-READ-SW       PIC  X(01) VALUE 'Y'.       00730004
007400         88  FIRST-TRANS-READ                    VALUE 'Y'.       00740000
007500                                                                  00750000
007600******************************************************************00760000
007700*                       ACCUMULATORS                              00770000
007800******************************************************************00780000
007900 01  PROGRAM-ACCUMULATORS.                                        00790000
008000     05  PA-READ                      PIC  9(11) VALUE ZEROS.     00800000
008100     05  PA-WRITTEN                   PIC  9(11) VALUE ZEROS.     00810000
008200                                                                  00820000
008300******************************************************************00830000
008400*                           CONSTANTS                             00840000
008500******************************************************************00850000
008600 01  PROGRAM-CONSTANTS.                                           00860000
008700     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'SAKUT048'.00870000
008800                                                                  00880000
008900     05  PC-TRAN-PREP-FUNC-CODES.                                 00890000
009000         10  PC-TRAN-PREP-FUNC-OPEN   PIC  X(05) VALUE 'OPEN '.   00900000
009100         10  PC-TRAN-PREP-FUNC-WRITE  PIC  X(05) VALUE 'WRITE'.   00910000
009200         10  PC-TRAN-PREP-FUNC-CLOSE  PIC  X(05) VALUE 'CLOSE'.   00920000
009300                                                                  00930000
009400     05  PC-JOB-NAME                  PIC  X(08) VALUE 'SAK051  '.00940007
009500     05  PC-PLAN-NAME                 PIC  X(08) VALUE 'SAKUP005'.00950007
009600     05  PC-TRANS-RECORD-LENGTH       PIC S9(04) VALUE +28 COMP.  00960001
009700                                                                  00970000
009800******************************************************************00980000
009900*                          VARIABLES                              00990000
010000******************************************************************01000000
010100 01  PROGRAM-VARIABLES.                                           01010000
010200     05  PV-PARAGRAPH-NAME            PIC  X(30) VALUE SPACES.    01020004
010300     05  PV-OPERATION-MSG             PIC  X(60) VALUE SPACES.    01030004
010400     05  PV-RET-CODE                  PIC  9(04) VALUE ZEROS.     01040008
010500                                                                  01050001
010600     05  PV-CHECKPOINT-TYPE           PIC  X(01) VALUE SPACE.     01060004
010700         88  CONTROL-BREAK                       VALUE 'C'.       01070004
010800         88  LOGICAL-TRANSACTION                 VALUE 'L'.       01080004
010900         88  TIME-INTERVAL                       VALUE 'T'.       01090004
011000         88  REQUESTED-BY-PROGRAM                VALUE 'R'.       01100004
011100                                                                  01110000
011200     05  PV-HOLD-STORE-NBR            PIC  9(04) VALUE ZERO.      01120004
011300                                                                  01130000
011400******************************************************************01140001
011500*               SYSTEM TIME AND DATE VARIABLES                    01150001
011600******************************************************************01160001
011700 01  SYS-DATE-TIME.                                               01170001
011800     05  SYS-DATE                     PIC  X(08) VALUE SPACES.    01180004
011900     05  SYS-TIME                     PIC  X(08) VALUE SPACES.    01190004
012000                                                                  01200001
012100 01  ST-BEG-TIME.                                                 01210001
012200     05  ST-BEG-HR                    PIC  9(02) VALUE ZEROS.     01220004
012300     05  FILLER                       PIC  X(01) VALUE ':'.       01230004
012400     05  ST-BEG-MN                    PIC  9(02) VALUE ZEROS.     01240004
012500                                                                  01250001
012600 01  ST-END-TIME.                                                 01260001
012700     05  ST-END-HR                    PIC  9(02) VALUE ZEROS.     01270004
012800     05  FILLER                       PIC  X(01) VALUE ':'.       01280004
012900     05  ST-END-MN                    PIC  9(02) VALUE ZEROS.     01290004
013000                                                                  01300001
013100 01  SD-EDIT-DATE.                                                01310001
013200     05  SD-MONTH                     PIC  9(02) VALUE ZEROS.     01320004
013300     05  FILLER                       PIC  X(01) VALUE '-'.       01330004
013400     05  SD-DAY                       PIC  9(02) VALUE ZEROS.     01340004
013500     05  FILLER                       PIC  X(01) VALUE '-'.       01350004
013600     05  SD-CENT                      PIC  9(02) VALUE ZEROS.     01360004
013700     05  SD-YEAR                      PIC  9(02) VALUE ZEROS.     01370004
013800                                                                  01380001
013900******************************************************************01390000
014000*                        ERROR HANDLING                           01400000
014100******************************************************************01410000
014200 01  ABEND-CODE                       PIC S9(04) VALUE ZEROS      01420004
014300                                                 COMP SYNC.       01430004
014400     88  ABEND-4002-READ-ERROR             VALUE +4002.           01440001
014500     88  ABEND-4019-CAL-SUB-ERROR          VALUE +4019.           01450008
014600                                                                  01460000
014700                                                                  01470000
014800******************************************************************01480000
014900*  TSAADSU - STORE TOTALS RECORD LAYOUT                           01490001
015000******************************************************************01500000
015100     COPY SARD007.                                                01510001
015200                                                                  01520000
015300******************************************************************01530000
015400*  TRANSACTION PREPARATION MODULE LINKAGE SECTION                 01540000
015500******************************************************************01550000
260107     COPY DPWS990.                                                01551016
015700                                                                  01552013
015700     COPY DPLS000.                                                01560015
015700                                                                  01570000
015800******************************************************************01580000
015900*  SQL COMMUNICATIONS WORK AREA                                   01590000
016000******************************************************************01600000
016100     COPY SQLCA2.                                                 01610000
016200                                                                  01620000
016300                                                                  01630000
016400                                                                  01640000
016500                                                                  01650000
016600 PROCEDURE DIVISION.                                              01660000
016700******************************************************************01670000
016800* MAINLINE-PROCESSING                                             01680000
016900******************************************************************01690000
017000                                                                  01700000
017100     PERFORM A100-INITIALIZE.                                     01710000
017200                                                                  01720000
017300     PERFORM B100-PROCESS-UPDATE-INPUT-FILE                       01730000
017400       UNTIL PS-INPUT-UPDATE-EOF.                                 01740000
017500                                                                  01750000
017600     PERFORM Z990-END-OF-JOB-ROUTINE.                             01760005
017700                                                                  01770000
017800     GOBACK.                                                      01780000
017900                                                                  01790000
018000                                                                  01800000
018100******************************************************************01810000
018200* PREFORMS TASK INITIATION                                        01820000
018300******************************************************************01830000
018400 A100-INITIALIZE.                                                 01840000
018500                                                                  01850000
018600     OPEN INPUT UPDATE-FILE.                                      01860000
018700                                                                  01870000
018800     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 01880000
018900                                                                  01890000
019000     MOVE SYS-TIME (1:2) TO ST-BEG-HR.                            01900000
019100     MOVE SYS-TIME (3:2) TO ST-BEG-MN.                            01910000
019200                                                                  01920000
019300     MOVE SYS-DATE (1:2) TO SD-CENT.                              01930000
019400     MOVE SYS-DATE (3:2) TO SD-YEAR.                              01940000
019500     MOVE SYS-DATE (5:2) TO SD-MONTH.                             01950000
019600     MOVE SYS-DATE (7:2) TO SD-DAY.                               01960000
019700                                                                  01970000
019800     PERFORM C100-ISSUE-OPEN-REQUEST.                             01980000
019900                                                                  01990000
020000     PERFORM C200-READ-UPDATE-INPUT-FILE.                         02000000
020100                                                                  02010000
020200     IF PS-INPUT-UPDATE-EOF                                       02020001
020300         MOVE 'C200-READ-UPDATE-INPUT-FILE' TO PV-PARAGRAPH-NAME  02030001
020400         MOVE '** EMPTY UPDATE FILE - NO DATA **'                 02040001
020500                                            TO PV-OPERATION-MSG   02050001
020600         SET ABEND-4002-READ-ERROR TO TRUE                        02060001
020700         PERFORM Z200-ABEND                                       02070008
020800     END-IF.                                                      02080001
020900                                                                  02090001
021000                                                                  02100000
021100******************************************************************02110000
021200* PROCESS THE UPDATE FILE. IF A RECORD IS READ, GATHER WHATEVER   02120000
021300* OTHER DATA IS NECESSARY TO TAKE CHECKPOINTS BASED ON THE TYPE OF02130000
021400* CHECKPOINTS BEING TAKEN BY SAKUP005 AND ISSUE A WRITE REQUEST   02140000
021500* TO THE TRANSACTION PREPARATION PROGRAM.                         02150000
021600******************************************************************02160000
021700 B100-PROCESS-UPDATE-INPUT-FILE.                                  02170000
021800                                                                  02180000
021900     IF FIRST-TRANS-READ                                          02190000
022000         MOVE SA007-STR-NBR   TO PV-HOLD-STORE-NBR                02200001
022100         MOVE 'N'             TO PS-FIRST-TRANS-READ-SW           02210000
022200     END-IF.                                                      02220000
022300                                                                  02230000
022400     IF CONTROL-BREAK                                             02240000
022500         PERFORM C300-CKPT-BY-CNTL-BREAK                          02250000
022600     ELSE                                                         02260000
022700         IF LOGICAL-TRANSACTION                                   02270000
022800             PERFORM C400-CKPT-BY-LOGICAL-TRANS                   02280000
022900         ELSE                                                     02290000
023000             PERFORM C500-CKPT-BY-TIME-OR-REQUEST                 02300000
023100         END-IF                                                   02310000
023200     END-IF.                                                      02320000
023300                                                                  02330000
023400     PERFORM C200-READ-UPDATE-INPUT-FILE.                         02340000
023500                                                                  02350000
023600                                                                  02360000
023700******************************************************************02370000
023800* ISSUE AN 'OPEN' REQUEST TO THE TRANSACTION PREPARATION MODULE   02380000
023900******************************************************************02390000
024000 C100-ISSUE-OPEN-REQUEST.                                         02400000
024100                                                                  02410000
024200     MOVE PC-TRAN-PREP-FUNC-OPEN TO DP000-FUNC-CODE.              02420000
024300     MOVE PC-JOB-NAME            TO DP000-JOB-NAME.               02430000
024400     MOVE PC-PLAN-NAME           TO DP000-PLAN-NAME.              02440000
024500                                                                  02450000
024600     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02460008
024700                                                                  02470000
024800     MOVE DP000-CKPT-TYPE-CODE   TO PV-CHECKPOINT-TYPE.           02480000
024900                                                                  02490000
025000                                                                  02500000
025100******************************************************************02510000
025200* READ THE UPDATE INPUT FILE                                      02520000
025300******************************************************************02530000
025400 C200-READ-UPDATE-INPUT-FILE.                                     02540000
025500                                                                  02550000
025600     READ UPDATE-FILE INTO SA007-TSAADSU-REC                      02560001
025700       AT END SET PS-INPUT-UPDATE-EOF TO TRUE.                    02570000
025800                                                                  02580000
025900     IF PS-INPUT-UPDATE-EOF                                       02590000
026000         CONTINUE                                                 02600000
026100     ELSE                                                         02610000
026200         ADD +1 TO PA-READ                                        02620000
026300     END-IF.                                                      02630000
026400                                                                  02640000
026500                                                                  02650000
026600******************************************************************02660000
026700* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACATION  02670000
026800* RECORD "ON" IF THERE IS A CHANGE IN THE STORE NUMBER. AFTER     02680000
026900* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02690000
027000* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02700000
027100*                                                                 02710000
027200* NOTE: AT THIS TIME CONTROL/LOGIC BREAK PROCESSING IS IDENTICAL. 02720000
027300******************************************************************02730000
027400 C300-CKPT-BY-CNTL-BREAK.                                         02740000
027500                                                                  02750000
027600     IF SA007-STR-NBR = PV-HOLD-STORE-NBR                         02760005
027700         MOVE 'N' TO DP000-CHECKPOINT-IND                         02770000
027800     ELSE                                                         02780000
027900         MOVE 'Y' TO DP000-CHECKPOINT-IND                         02790000
028000         MOVE SA007-STR-NBR  TO PV-HOLD-STORE-NBR                 02800001
028100     END-IF.                                                      02810000
028200                                                                  02820000
028300     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      02830000
028400     MOVE SA007-TSAADSU-REC       TO DP000-TRANS-REC.             02840001
028500     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             02850000
028600     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              02860000
028700     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             02870000
028800                                                                  02880000
028900     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02890008
029000                                                                  02900000
029100     ADD +1 TO PA-WRITTEN.                                        02910000
029200                                                                  02920000
029300                                                                  02930000
029400******************************************************************02940000
029500* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACTION   02950000
029600* RECORD "ON".  THE UPDATE PROGRAM WILL CHECK THE CHECKPOINT      02960000
029700* FREQUENCY TO KNOW WHETHER A CHECKPOINT SHOULD BE TAKEN. AFTER   02970000
029800* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02980000
029900* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02990000
030000******************************************************************03000000
030100 C400-CKPT-BY-LOGICAL-TRANS.                                      03010000
030200                                                                  03020000
030300     IF SA007-STR-NBR = PV-HOLD-STORE-NBR                         03030005
030400         MOVE 'N' TO DP000-CHECKPOINT-IND                         03040005
030500     ELSE                                                         03050005
030600         MOVE 'Y' TO DP000-CHECKPOINT-IND                         03060005
030700         MOVE SA007-STR-NBR  TO PV-HOLD-STORE-NBR                 03070005
030800     END-IF.                                                      03080005
030900                                                                  03090000
031000     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      03100000
031100     MOVE SA007-TSAADSU-REC       TO DP000-TRANS-REC.             03110001
031200     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             03120000
031300     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03130000
031400     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03140000
031500                                                                  03150000
031600     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03160008
031700                                                                  03170000
031800     ADD +1 TO PA-WRITTEN.                                        03180000
031900                                                                  03190000
032000                                                                  03200000
032100******************************************************************03210000
032200* THIS ROUTINE BUILDS THE TRANSACTION RECORD AND ISSUES A WRITE   03220000
032300* REQUEST TO THE TRANSACTION PREPARATION MODULE IF CHECKPOINTS ARE03230000
032400* TAKEN BY TIME INTERVAL (SECONDS) OR REQUESTED BY THE MAINTENANCE03240000
032500* PROGRAM.                                                        03250000
032600******************************************************************03260000
032700 C500-CKPT-BY-TIME-OR-REQUEST.                                    03270000
032800                                                                  03280000
032900     MOVE 'N'                     TO DP000-CHECKPOINT-IND.        03290000
033000                                                                  03300005
033100     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      03310000
033200     MOVE SA007-TSAADSU-REC       TO DP000-TRANS-REC.             03320001
033300     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             03330000
033400     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03340000
033500     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03350000
033600                                                                  03360000
033700     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03370008
033800                                                                  03380000
033900     ADD +1 TO PA-WRITTEN.                                        03390000
034000                                                                  03400000
034100                                                                  03410000
034200******************************************************************03420000
034300* ISSUE A 'CLOSE' REQUEST TO THE TRANSACTION PREPARATION MODULE   03430000
034400******************************************************************03440000
034500 C600-ISSUE-CLOSE-REQUEST.                                        03450000
034600                                                                  03460000
034700     MOVE PC-TRAN-PREP-FUNC-CLOSE TO DP000-FUNC-CODE.             03470000
034800     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03480000
034900     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03490000
035000                                                                  03500000
035100     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03510008
035200                                                                  03520000
035300                                                                  03530000
035400******************************************************************03540008
035500* VERIFY THE RETURN CODE ON THE CALLED MODULE                     03550008
035600******************************************************************03560008
035700 Z100-CALL-TRANS-PREP-MODULE.                                     03570008
035800                                                                  03580008
035900     PERFORM Z900-CALL-TRANS-PREP-MODULE.                         03590008
036000                                                                  03600008
036100     IF  DP000-GOOD-RET-CODE                                      03610008
036200         CONTINUE                                                 03620008
036300                                                                  03630008
036400     ELSE                                                         03640008
036500         MOVE 'Z100-CALL-TRANS-PREP-MODULE' TO PV-PARAGRAPH-NAME  03650008
036600         MOVE '** BAD CALL TO TRANS PREP MODULE **'               03660008
036700                                            TO PV-OPERATION-MSG   03670008
036800         MOVE DP000-RET-CODE                TO PV-RET-CODE        03680008
036900                                                                  03690008
037000         SET ABEND-4019-CAL-SUB-ERROR TO TRUE                     03700008
037100                                                                  03710008
037200         PERFORM Z200-ABEND                                       03720008
037300     END-IF.                                                      03730008
037400                                                                  03740008
037500                                                                  03750008
037600******************************************************************03760008
037700* NON-DB2 ABEND                                                   03770008
037800******************************************************************03780008
037900 Z200-ABEND.                                                      03790008
038000                                                                  03800008
038100     PERFORM Z999-CONTROLS.                                       03810008
038200                                                                  03820008
038300     DISPLAY '                     '.                             03830008
038400     DISPLAY '** ABEND           **'.                             03840008
038500     DISPLAY '** PROGRAM         ** = ' PC-PROGRAM-NAME.          03850008
038600     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        03860008
038700     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG.         03870008
038800     DISPLAY '** RETURN CODE     ** = ' PV-RET-CODE.              03880008
038900                                                                  03890008
039000     CALL 'ILBOABN0' USING ABEND-CODE.                            03900008
039100                                                                  03910008
039200                                                                  03920008
039300******************************************************************03930000
039400* PREFORMS TASK TERMINATION PROCESSING                            03940000
039500******************************************************************03950000
039600 Z990-END-OF-JOB-ROUTINE.                                         03960005
039700                                                                  03970000
039800     CLOSE UPDATE-FILE.                                           03980000
039900                                                                  03990000
040000     PERFORM C600-ISSUE-CLOSE-REQUEST.                            04000000
040100                                                                  04010000
040200     PERFORM Z999-CONTROLS.                                       04020000
040300                                                                  04030000
040400                                                                  04040000
040500******************************************************************04050000
040600* DISPLAY CONTROLS FROM THE PROGRAM                               04060000
040700******************************************************************04070000
040800 Z999-CONTROLS.                                                   04080000
040900                                                                  04090000
041000     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 04100000
041100                                                                  04110000
041200     MOVE SYS-TIME (1:2) TO ST-END-HR.                            04120000
041300     MOVE SYS-TIME (3:2) TO ST-END-MN.                            04130000
041400                                                                  04140000
041500     DISPLAY '                    '.                              04150000
041600     DISPLAY '**********************'.                            04160000
041700     DISPLAY '   SAKUT048 CONTROLS  '.                            04170000
041800     DISPLAY '**********************'.                            04180000
041900     DISPLAY 'RUN DATE  = ' SD-EDIT-DATE.                         04190000
042000     DISPLAY 'BEG TIME  = ' ST-BEG-TIME.                          04200000
042100     DISPLAY 'END TIME  = ' ST-END-TIME.                          04210000
042200     DISPLAY '======================'.                            04220000
042300     DISPLAY 'RECORDS READ    = ' PA-READ.                        04230000
042400     DISPLAY '                  '.                                04240000
042500     DISPLAY 'RECORDS WRITTEN = ' PA-WRITTEN.                     04250000
042600     DISPLAY '                  '.                                04260000
042700                                                                  04270000
042800                                                                  04280000
042900******************************************************************04290000
043000* TRANSACTION PREPARATION MODULE CALL AND ERROR ROUTINES          04300000
043100******************************************************************04310000
043200     COPY DPPD000.                                                04320015
043300                                                                  04330000
043400                                                                  04340000
