      ******************************************************************        
      **                        SARD028                               **        
      **==============================================================**        
      **  CORPORATE DATA WAREHOUSE COSA EXTRACT                       **        
      **  TRANSACTION RECORD LAYOUT                                   **        
      **  SOURCE TABLE: TEPTRN                                        **        
      **  RECORD LENGTH: 200                                          **        
      **  KEY LENGTH: 38                                              **        
      ******************************************************************        
       01 SA028-CORP-WAREHOUSE-TRN-REC.                                         
          05 SA028-TRN-SLS-DTE           PIC X(10).                             
          05 SA028-TRN-COSA-KEY.                                                
             10 SA028-TRN-PARTN-NBR      PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
             10 SA028-TRN-STR-NBR        PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
             10 SA028-TRN-RGST-ID        PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
             10 SA028-TRN-TRN-NBR        PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
             10 SA028-TRN-STRT-TM        PIC X(8).                              
                                                                                
             10 SA028-TRN-SLS-CORR-SEQ-NBR                                      
                                         PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
          05 SA028-TRN-VOID-ABRT-CDE     PIC X(1).                              
          05 SA028-TRN-TRN-STAT-CDE      PIC X(2).                              
          05 SA028-TRN-TYP-CDE           PIC X(2).                              
          05 SA028-TRN-PRCG-DTE          PIC X(10).                             
          05 SA028-TRN-TRN-DTE           PIC X(10).                             
          05 SA028-TRN-TRN-TOT-AMT       PIC +9(7).99.                          
          05 SA028-TRN-SLS-TX-AMT        PIC +9(7).99.                          
          05 SA028-TRN-SRVR-ONLN-IND     PIC X(1).                              
          05 SA028-TRN-QUAL-CDE          PIC X(2).                              
          05 SA028-TRN-ACCM-TOT-AMT      PIC +9(7).99.                          
          05 SA028-TRN-END-TM            PIC X(8).                              
          05 SA028-TRN-POS-CPBL-LVL-NBR  PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
          05 SA028-TRN-ASSOC-ID          PIC S9(10)   SIGN LEADING              
                                                      SEPARATE.                 
          05 SA028-TRN-ORIG-OTR-AMT      PIC +9(7).99.                          
          05 SA028-TRN-ACCM-RET-TOT-AMT  PIC +9(7).99.                          
          05 SA028-TRN-RGST-BANK-NBR     PIC S9(5)    SIGN LEADING              
                                                      SEPARATE.                 
          05 SA028-TRN-CRE-TMST          PIC X(26).                             
          05 SA028-TRN-FIN-SEQ-STRT-TM   PIC X(8).                              
          05 SA028-TRN-RCPT-TYP-CDE      PIC X(1).                              
          05 SA028-TRN-ASSOC-ID-SRC-CDE  PIC X(1).                              
          05 SA028-TRN-EMAIL-CAPTURE-IND PIC X(1).                              
          05 SA028-TRN-EMAIL-PROMPT-IND  PIC X(1).                              
                                                                                
