000100******************************************************************        
000200*                      SARD009  LRECL=21                                  
000300*                RECORD LAYOUT FOR TSASUM UPDATE                          
000400******************************************************************        
000500 01  SA009-TSASUM-REC.                                                    
000600     05  SA009-PARTN-NBR       PIC S9(04) COMP      VALUE ZEROS.  001-002 
000700     05  SA009-STR-NBR         PIC S9(04) COMP      VALUE ZEROS.  003-004 
000800     05  SA009-RGST-ID         PIC S9(04) COMP      VALUE ZEROS.  005-006 
000900     05  SA009-SUM-TYP-CDE     PIC  X(01)           VALUE SPACES. 007-007 
001000     05  SA009-SUM-CTG-CDE     PIC  X(03)           VALUE SPACES. 008-010 
001100     05  SA009-CTG-AMT         PIC S9(07)V99 COMP-3 VALUE ZEROS.  011-015 
001200     05  SA009-CTG-NBR-OF-ITM  PIC S9(09) COMP      VALUE ZEROS.  016-020 
001300     05  SA009-CTG-SRC-CDE     PIC  X(01)           VALUE SPACES. 021-021 
001500                                                                          
