00001 ****************************************************************          
00002 *                                                              *          
00003 * SALES FILE LAYOUT FOR PROMO EXTRACT.                         *          
00004 *                                                              *          
00006 ****************************************************************          
00007 *                                                                         
00008 *                                                                         
00009  01  SA046-PM-SALES-RESULTS-REC.                                          
00013      05  SA046-STR-NBR                  PIC   9(04).                      
00022      05  SA046-RGST-ID                  PIC   9(04).                      
00023      05  SA046-TRN-NBR                  PIC   9(04).                      
00014      05  SA046-SLS-DTE                  PIC   X(10).                      
00017      05  SA046-SKU-NBR                  PIC   9(08).                      
           05  SA046-DEPT-NBR                 PIC   9(04).                      
00018      05  SA046-MAJ-CL-NBR               PIC   9(04).                      
           05  SA046-SUB-CL-NBR               PIC   9(04).                      
00021      05  SA046-ITM-STAT-CDE             PIC   X(02).                      
00024      05  SA046-LNE-ITM-SEQ-NBR          PIC   9(04).                      
           05  SA046-LIV-RSLU-CDE             PIC   X(01).                      
           05  SA046-SAL-RET-CDE              PIC   X(01).                      
00028      05  SA046-SLD-QTY                  PIC  S9(07).                      
00026      05  SA046-REG-RTL-AMT              PIC  S9(05)V99.                   
00027      05  SA046-OWND-UNT-RTL-AMT         PIC  S9(05)V99.                   
00029      05  SA046-UNT-COST-AMT             PIC  S9(04)V99.                   
00030      05  SA046-CUST-CHRGD-AMT           PIC  S9(07)V99.                   
           05  SA046-NET-CHRGD-AMT            PIC  S9(07)V99.                   
           05  SA046-PM-PROMO-INTFC-ID        PIC   9(10).                      
           05  SA046-PM-SCHM-CDE              PIC   9(04).                      
           05  SA046-PM-MKDN-AMT              PIC  S9(05)V99.                   
           05  SA046-PM-DISC-PCT              PIC  S9(02)V999.                  
           05  SA046-TIERED-INTFC-SUB-ID      PIC   9(10).                      
           05  SA046-TIERED-SCHM-CDE          PIC   9(04).                      
           05  SA046-TIERED-MKDN-AMT          PIC  S9(05)V99.                   
           05  SA046-TIERED-DISC-PCT          PIC  S9(02)V999.                  
           05  SA046-ADOAPO-PROMO-INTFC-ID    PIC   9(10).                      
           05  SA046-ADOAPO-SCHM-CDE          PIC   9(04).                      
           05  SA046-ADOAPO-MKDN-AMT          PIC  S9(05)V99.                   
           05  SA046-APO-DISC-PCT             PIC  S9(02)V999.                  
           05  SA046-GWPPWP-INTFC-ID          PIC   9(10).                      
           05  SA046-GWPPWP-INTFC-SUB-ID      PIC   9(10).                      
           05  SA046-GWPPWP-SCHM-CDE          PIC   9(04).                      
           05  SA046-GWPPWP-GET-MKDN-AMT      PIC  S9(05)V99.                   
           05  SA046-BOGO-INTFC-ID            PIC   9(10).                      
           05  SA046-BOGO-SCHM-CDE            PIC   9(04).                      
           05  SA046-BOGO-PRORTD-MKDN-AMT     PIC  S9(05)V99.                   
           05  FILLER                         PIC   X(25).                      
