000100***********************************************************       00010000
000200**                        SAWS039                        **       00020000
000300**                                                       **       00030000
000400**  THIS IS THE RECORD LAYOUT FOR THE EVEN EXCHANGE      **       00040000
000500**  MARKUP/MARKDOWN FILE.                                **       00050000
000600***********************************************************       00060000
000700 01  SA039-EVEN-EXCHNG-EXTR-RECORD.                               00070000
000800   05  SA039-POS-DATE-YMD                   PIC S9(007)           00080000
000900                                             VALUE ZEROES         00090000
001000                                             COMP-3.              00100000
001100   05  SA039-KOHLS-ACCT-MONTH               PIC  9(002)           00110000
001200                                             VALUE ZEROES.        00120000
001300   05  SA039-STORE-NUMBER                   PIC  X(004)           00130000
001400                                             VALUE ZEROES.        00140000
001900   05  SA039-TERMINAL-NUMBER                PIC  9(004)           00190000
002000                                             VALUE ZEROES.        00200000
002100   05  SA039-TRANSACTION-NUMBER             PIC  9(004)           00210000
002200                                             VALUE ZEROES.        00220000
002300   05  SA039-ITEM-SEQUENCE                  PIC S9(005)           00230000
002400                                             VALUE ZEROES         00240000
002500                                             COMP-3.              00250000
002600   05  SA039-RETURN-ITEM.                                         00260000
002700     10  SA039-RI-SKU                       PIC  X(008)           00270000
002800                                             VALUE ZEROES.        00280000
003400     10  SA039-RI-STATUS-CODE               PIC S9(003)           00290000
003500                                             VALUE ZEROES         00300000
003600                                             COMP-3.              00310000
003700     10  SA039-RI-UNIT-QTY                  PIC S9(005)           00320000
003800                                             VALUE ZEROES         00330000
003900                                             COMP-3.              00340000
004000     10  SA039-RI-UNIT-CUST-CHARGED-AMT     PIC S9(005)V99        00350000
004100                                             VALUE ZEROES         00360000
004200                                             COMP-3.              00370000
004300     10  SA039-RI-UNIT-NET-AMT-CHARGED      PIC S9(005)V99        00380000
004400                                             VALUE ZEROES         00390000
004500                                             COMP-3.              00400000
004600     10  SA039-RI-UNIT-RETAIL-AMT           PIC S9(005)V99        00410000
004700                                             VALUE ZEROES         00420000
004800                                             COMP-3.              00430000
004900     10  SA039-RI-UNIT-OWNED-RETAIL-AMT     PIC S9(005)V99        00440000
005000                                             VALUE ZEROES         00450000
005100                                             COMP-3.              00460000
005110     10  SA039-RI-SKU-DTA-ATTRIB.                                 00470000
005120         15  SA039-RI-DEPT-CLASS       PIC  X(05) VALUE ZEROS.    00480000
005130         15  SA039-RI-DEPT-CLASS-NUM  REDEFINES                   00490000
005140             SA039-RI-DEPT-CLASS.                                 00500000
005150             20  SA039-RI-DEPT-NBR     PIC  9(03).                00510000
005160             20  SA039-RI-CLASS-NBR    PIC  9(02).                00511000
005170         15  SA039-RI-MAJ-CLASS        PIC  X(04) VALUE ZEROS.    00512000
005180                                                                  00513000
005200   05  SA039-SALE-ITEM.                                           00514000
005300     10  SA039-SI-SKU                       PIC  X(008)           00515000
005400                                             VALUE ZEROES.        00516000
006000     10  SA039-SI-STATUS-CODE               PIC S9(003)           00517000
006100                                             VALUE ZEROES         00518000
006200                                             COMP-3.              00519000
006300     10  SA039-SI-UNIT-QTY                  PIC S9(005)           00520000
006400                                             VALUE ZEROES         00530000
006500                                             COMP-3.              00540000
006600     10  SA039-SI-UNIT-CUST-CHARGED-AMT     PIC S9(005)V99        00550000
006700                                             VALUE ZEROES         00560000
006800                                             COMP-3.              00570000
006900     10  SA039-SI-UNIT-NET-AMT-CHARGED      PIC S9(005)V99        00580000
007000                                             VALUE ZEROES         00590000
007100                                             COMP-3.              00600000
007200     10  SA039-SI-UNIT-RETAIL-AMT           PIC S9(005)V99        00610000
007300                                             VALUE ZEROES         00620000
007400                                             COMP-3.              00630000
007500     10  SA039-SI-UNIT-OWNED-RETAIL-AMT     PIC S9(005)V99        00640000
007600                                             VALUE ZEROES         00650000
007700                                             COMP-3.              00660000
007710     10  SA039-SI-SKU-DTA-ATTRIB.                                 00670000
007720         15  SA039-SI-DEPT-CLASS       PIC  X(05) VALUE ZEROS.    00680000
007730         15  SA039-SI-DEPT-CLASS-NUM  REDEFINES                   00690000
007740             SA039-SI-DEPT-CLASS.                                 00700000
007750             20  SA039-SI-DEPT-NBR     PIC  9(03).                00710000
007760             20  SA039-SI-CLASS-NBR    PIC  9(02).                00720000
007770         15  SA039-SI-MAJ-CLASS        PIC  X(04) VALUE ZEROS.    00730000
021811     10  SA039-STRT-TM             PIC   X(08).                   00750005
021811     10  SA039-SLS-CORR-SEQ-NBR    PIC  S9(04) VALUE ZEROS        00760005
021811                                               COMP-3.            00761005
031511     10  SA039-PC-DTE-YEAR         PIC   9(04) VALUE ZEROS.       00762007
031511   05  FILLER                               PIC  X(003) VALUE     00770006
021811                                                        SPACES.   00780005
