      *****************************************************************         
      *    RECORD PURPOSE: EXTRACT RECORD LAYOUT FOR TRUCK PROJECTED  *         
      *                    CANCELLED DELIVERIES FOR THE EDW SYSTEM.   *         
      *    RECORD LENGTH.: 80                                         *         
      *    RECORD FORMAT.: FIXED LENGTH                               *         
      *****************************************************************         
       01  SDRD173-EXTRACT-RECORD.                                              
           05  SDRD173-STR-NBR            PIC 9(04).                            
           05  SDRD173-DELIMITER-1        PIC X(01).                            
           05  SDRD173-TRLR-ARRVL-DTE     PIC X(10).                            
           05  SDRD173-DELIMITER-2        PIC X(01).                            
           05  SDRD173-BGTD-TYP-CDE       PIC X(02).                            
           05  SDRD173-DELIMITER-3        PIC X(01).                            
           05  SDRD173-LAST-UPD-USR-ID    PIC X(08).                            
           05  SDRD173-DELIMITER-4        PIC X(01).                            
           05  SDRD173-LAST-UPD-TMST      PIC X(26).                            
           05  SDRD173-DELIMITER-5        PIC X(01).                            
           05  SDRD173-CURRENT-DATE       PIC X(10).                            
           05  SDRD173-DELIMITER-6        PIC X(01).                            
           05  SDRD173-TRIP-QTY           PIC 9(04).                            
           05  FILLER                     PIC X(10).                            
                                                                                
      *****************************************************************         
