      ****************************************************************  00001002
      *    SDRD155 - TOTAL LENGTH - 80 AS OF 2004-12-08              *  00003003
      *    SDRD155 - TOTAL LENGTH - 91 AS OF 2007-03-12              *  00003108
      *                                                              *  00003208
      *    USED BY SDKUT155. FILE USING LAYOUT IS CREATED BY         *  00003308
      *    DFKUT075 IN PROC DFK1101.  MATCHES DFRD025 COPYBOOK.      *  00003408
      ****************************************************************  00003508
                                                                        00003608
       01  PR155-ACTUAL-SALES-AREA.                                     00010000
           05  PR155-AS-STORE-NUM          PIC X(04) VALUE SPACES.      00020004
           05  FILLER                      PIC X(01) VALUE SPACES.      00030000
           05  PR155-AS-STORE-NAME         PIC X(10) VALUE SPACES.      00040000
           05  FILLER                      PIC X(01) VALUE SPACES.      00050000
031207**   05  PR155-AS-WK1-AMT            PIC 9(07) VALUE ZEROES.      00060009
031207     05  PR155-AS-WK1-AMT            PIC 9(09) VALUE ZEROES.      00060109
           05  FILLER                      PIC X(01) VALUE SPACES.      00061001
           05  PR155-AS-WK1-CENTS          PIC 9(02) VALUE ZEROES.      00062001
           05  FILLER                      PIC X(01) VALUE SPACES.      00070000
031207**   05  PR155-AS-WK2-AMT            PIC 9(07) VALUE ZEROES.      00080009
031207     05  PR155-AS-WK2-AMT            PIC 9(09) VALUE ZEROES.      00080109
           05  FILLER                      PIC X(01) VALUE SPACES.      00081001
           05  PR155-AS-WK2-CENTS          PIC 9(02) VALUE ZEROES.      00082001
           05  FILLER                      PIC X(01) VALUE SPACES.      00090000
031207**   05  PR155-AS-WK3-AMT            PIC 9(07) VALUE ZEROES.      00100009
031207     05  PR155-AS-WK3-AMT            PIC 9(09) VALUE ZEROES.      00100109
           05  FILLER                      PIC X(01) VALUE SPACES.      00101001
           05  PR155-AS-WK3-CENTS          PIC 9(02) VALUE ZEROES.      00102001
           05  FILLER                      PIC X(01) VALUE SPACES.      00110000
031207**   05  PR155-AS-WK4-AMT            PIC 9(07) VALUE ZEROES.      00120009
031207     05  PR155-AS-WK4-AMT            PIC 9(09) VALUE ZEROES.      00120109
           05  FILLER                      PIC X(01) VALUE SPACES.      00121001
           05  PR155-AS-WK4-CENTS          PIC 9(02) VALUE ZEROES.      00122001
           05  FILLER                      PIC X(01) VALUE SPACES.      00130000
031207*    05  PR155-AS-WK5-AMT            PIC 9(07) VALUE ZEROES.      00140009
031207     05  PR155-AS-WK5-AMT            PIC 9(09) VALUE ZEROES.      00140109
           05  FILLER                      PIC X(01) VALUE SPACES.      00141001
           05  PR155-AS-WK5-CENTS          PIC 9(02) VALUE ZEROES.      00142001
031207*    05  FILLER                      PIC X(10) VALUE SPACES.      00150009
031207     05  FILLER                      PIC X(11) VALUE SPACES.      00160009
