      *****************************************************************         
      *    RECORD PURPOSE: EXTRACT RECORD LAYOUT FOR TRUCK PROJECTED  *         
      *                    NON-CANCELLED DELIVERIES FOR EDW.          *         
      *    RECORD LENGTH.: 80                                         *         
      *    RECORD FORMAT.: FIXED LENGTH                               *         
      *****************************************************************         
       01  SDRD175-EXTRACT-RECORD.                                              
           05  SDRD175-STR-NBR            PIC 9(04).                            
           05  SDRD175-DELIMITER-1        PIC X(01).                            
           05  SDRD175-TRLR-ARRVL-DTE     PIC X(10).                            
           05  SDRD175-DELIMITER-2        PIC X(01).                            
           05  SDRD175-CURRENT-DATE       PIC X(10).                            
           05  SDRD175-DELIMITER-3        PIC X(01).                            
           05  SDRD175-TRIP-QTY           PIC 9(02).                            
           05  SDRD175-DELIMITER-4        PIC X(01).                            
           05  SDRD175-CHANGE-ACTN-CDE    PIC X(01).                            
           05  FILLER                     PIC X(49).                            
                                                                                
      *****************************************************************         
