000100*************************                                         00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300*************************                                         00030000
000400 PROGRAM-ID.      SEKRP003.                                       00040016
000500 AUTHOR.          MIKE SOMMERS.                                   00050000
000600 DATE-WRITTEN.    FEBRUARY 2005.                                  00060000
000700                                                                  00070000
000800*        READ AN IDENTITY MANAGEMENT EXTRACT FILE AND LIST        00080000
000900*        ASSOCIATES WITH POTENTIALLY DUPLICATE RECORDS            00090000
001000*        BASED ON A COMPARISON OF LAST NAME, FIRST INITIAL        00100019
001010*        AND FIRST FOUR DIGITS OF THE DEPARTMENT NUMBER.          00101027
001100                                                                  00110000
001200 ENVIRONMENT DIVISION.                                            00120000
001300 CONFIGURATION SECTION.                                           00130000
001400 SOURCE-COMPUTER. IBM-3090.                                       00140000
001500 OBJECT-COMPUTER. IBM-3090.                                       00150000
001600                                                                  00160000
001700 INPUT-OUTPUT SECTION.                                            00170000
001800 FILE-CONTROL.                                                    00180000
001900     SELECT ID-MGMT-EXTRACT-FILE       ASSIGN TO INP01.           00190000
002200     SELECT PRINT-FILE                 ASSIGN TO RPT01.           00220000
002400     EJECT                                                        00240000
002500***************                                                   00250000
002600 DATA DIVISION.                                                   00260000
002700***************                                                   00270000
002800 FILE SECTION.                                                    00280000
003700 FD  ID-MGMT-EXTRACT-FILE                                         00370000
003800                             BLOCK CONTAINS 0 RECORDS,            00380000
003900                             RECORD CONTAINS 242 CHARACTERS,      00390030
004000                             RECORDING MODE IS F,                 00400000
004100                             LABEL RECORDS ARE STANDARD,          00410000
004200                             DATA RECORD IS ID-MGMT-REC.          00420000
004300 01  ID-MGMT-REC             PIC X(242).                          00430030
004400                                                                  00440000
005300 FD  PRINT-FILE                                                   00530000
005400                             BLOCK CONTAINS 0 RECORDS,            00540000
005500                             RECORD CONTAINS 132 CHARACTERS,      00550006
005600                             RECORDING MODE IS F,                 00560000
005700                             LABEL RECORDS ARE STANDARD,          00570000
005800                             DATA RECORD IS PRINT-REC.            00580000
005900 01  PRINT-REC               PIC X(132).                          00590006
006800     EJECT                                                        00680000
006900*************************                                         00690000
007000 WORKING-STORAGE SECTION.                                         00700000
007100*************************                                         00710000
007200******************************************************************00720000
007300*   IDENTITY MANAGEMENT EXTRACT RECORD LAYOUT                     00730000
007400******************************************************************00740000
007500     COPY SERD005.                                                00750000
007600                                                                  00760000
010400                                                                  01040000
010410******************************************************************01041020
010420*   REPORT RECORD                                                 01042021
010430******************************************************************01043020
010500 01  RR-REPORT-RECORD.                                            01050000
010600     05  FILLER                      PIC X(1)      VALUE SPACES.  01060000
010700     05  RR-MESSAGE                  PIC X(31)     VALUE SPACES.  01070012
010800     05  FILLER                      PIC X(2)      VALUE '  '.    01080012
010900     05  RR-EMPLOYEE-ID              PIC X(7)      VALUE SPACES.  01090000
011000     05  FILLER                      PIC X(4)      VALUE SPACES.  01100000
011010     05  RR-EMPLOYEE-USER-ID         PIC X(7)      VALUE SPACES.  01101000
011020     05  FILLER                      PIC X(4)      VALUE SPACES.  01102000
011100     05  RR-NAME                     PIC X(36)     VALUE SPACES.  01110000
011800     05  FILLER                      PIC X(4)      VALUE SPACES.  01180000
011900     05  RR-EMPLOYEE-DEPARTMENT      PIC X(7)      VALUE SPACES.  01190001
011901     05  FILLER                      PIC X(4)      VALUE SPACES.  01190112
011902     05  RR-EMPLOYEE-LOCATION        PIC X(4)      VALUE SPACES.  01190212
011910     05  FILLER                      PIC X(4)      VALUE SPACES.  01191006
011920     05  RR-PERSON-TYPE              PIC X(16)     VALUE SPACES.  01192006
012000                                                                  01200000
012100 01  SL-SEPARATOR-LINE.                                           01210013
012101     05  FILLER                      PIC X(1)      VALUE SPACES.  01210114
012102     05  FILLER                      PIC X(131)    VALUE ALL '-'. 01210214
012110                                                                  01211013
012120 01  TR1-TOTAL-RECORD-1.                                          01212013
012200     05  FILLER                      PIC X(4)      VALUE SPACES.  01220000
012300     05  FILLER                      PIC X(16)     VALUE          01230017
012400         'TOTAL NUMBER OF '.                                      01240017
012401     05  TR1-TOTAL-TYPE              PIC X(15)     VALUE SPACES.  01240128
012410     05  FILLER                      PIC X(25)     VALUE          01241017
012420         ' WITH POSSIBLE DUPLICATE '.                             01242017
012500     05  FILLER                      PIC X(9)      VALUE          01250000
012600         'RECORDS: '.                                             01260000
012700     05  TR1-HR-TOTAL                PIC ZZZ,ZZ9   VALUE ZEROES.  01270028
012800     05  FILLER                      PIC X(56)     VALUE SPACES.  01280028
014700     EJECT                                                        01470000
014800 01  HEADING-LINE1.                                               01480000
014900     05  HL1-DATE.                                                01490000
015000         10  HL1-MM              PIC 9(2)    VALUE ZEROES.        01500000
015100         10  FILLER              PIC X(1)    VALUE '-'.           01510000
015200         10  HL1-DD              PIC 9(2)    VALUE ZEROES.        01520000
015300         10  FILLER              PIC X(1)    VALUE '-'.           01530000
015400         10  HL1-YY              PIC 9(2)    VALUE ZEROES.        01540000
015500     05  FILLER                  PIC X(2)    VALUE SPACES.        01550000
015600     05  HL1-TIME.                                                01560000
015700         10  HL1-HR              PIC 9(2)    VALUE ZEROES.        01570000
015800         10  FILLER              PIC X(1)    VALUE ':'.           01580000
015900         10  HL1-MN              PIC 9(2)    VALUE ZEROES.        01590000
016000         10  FILLER              PIC X(1)    VALUE ':'.           01600000
016100         10  HL1-SC              PIC 9(2)    VALUE ZEROES.        01610000
016200     05  FILLER                  PIC X(23)   VALUE SPACES.        01620007
016300     05  FILLER                  PIC X(48)                        01630000
016400         VALUE 'K O H L '' S   D E P A R T M E N T   S T O R E S'.01640000
016500     05  FILLER                  PIC X(22)   VALUE SPACES.        01650007
016600     05  FILLER                  PIC X(9)    VALUE 'SEKRP003-'.   01660016
016700     05  HL1-RPTNO               PIC 9(1)    VALUE 1.             01670000
016800     05  FILLER                  PIC X(7)    VALUE '  PAGE '.     01680000
016900     05  HL1-PAGE                PIC ZZZ9    VALUE ZEROES.        01690000
017000                                                                  01700000
017100 01  HEADING-LINE2.                                               01710000
017200     05  FILLER                  PIC X(33)      VALUE SPACES.     01720016
017300     05  FILLER                  PIC X(42)      VALUE             01730000
017400         'ASSOCIATES WITH POSSIBLE DUPLICATE RECORDS'.            01740000
017410     05  FILLER                  PIC X(23)      VALUE             01741016
017420         ' IN IDENTITY MANAGEMENT'.                               01742016
017500     05  FILLER                  PIC X(34)      VALUE SPACES.     01750016
018200                                                                  01820000
018300 01  HEADING-LINE3.                                               01830000
018400     05  FILLER                  PIC X(52)      VALUE             01840007
018500         ' MESSAGE                          EMPL ID    USER ID'.  01850007
018800     05  FILLER                  PIC X(52)      VALUE             01880000
018900         '    NAME                                    DEPT    '.  01890012
019000     05  FILLER                  PIC X(34)      VALUE             01900000
019100         '   LOC     PERSON TYPE            '.                    01910012
019200     05  FILLER                  PIC X(10)      VALUE SPACES.     01920000
019300     EJECT                                                        01930000
019400 01  WS-WORKING-STORAGE.                                          01940000
019800     05  WS-PAGE-CNT              PIC 9(3) COMP  VALUE ZEROES.    01980027
019900     05  WS-LINE-CNT              PIC 9(2)       VALUE 80.        01990027
019910     05  WS-DEPARTMENT-PARTS.                                     01991027
019920         10  WS-DEPARTMENT-4      PIC X(4)       VALUE SPACES.    01992027
019930         10  WS-DEPARTMENT-3      PIC X(3)       VALUE SPACES.    01993027
019940     05  WS-HOLD-DEPARTMENT-PARTS.                                01994027
019950         10  WS-HOLD-DEPARTMENT-4 PIC X(4)       VALUE SPACES.    01995027
019960         10  WS-HOLD-DEPARTMENT-3 PIC X(3)       VALUE SPACES.    01996027
020000     05  WS-HOLD-NAME             PIC X(18)      VALUE SPACES.    02000027
020020     05  WS-HOLD-FIRST-INITIAL    PIC X(1)       VALUE SPACES.    02002027
020100     05  WS-HOLD-DEPARTMENT       PIC X(7)       VALUE SPACES.    02010027
020107     05  WS-HOLD-LOCATION         PIC X(4)       VALUE SPACES.    02010727
020108     05  WS-HOLD-COMMON-NAME      PIC X(40)      VALUE SPACES.    02010827
020110     05  WS-HOLD-ASSOC-ID         PIC X(7)       VALUE SPACES.    02011027
020120     05  WS-HOLD-ASSOC-USR-ID     PIC X(7)       VALUE SPACES.    02012027
020200     05  WS-DUP-EMP-REC-CNT       PIC 9(7) COMP  VALUE ZEROES.    02020028
020300     05  WS-DUP-STR-EMP-REC-CNT   PIC 9(7) COMP  VALUE ZEROES.    02030028
020310     05  WS-DUP-VDR-REC-CNT       PIC 9(7) COMP  VALUE ZEROES.    02031028
020400     05  WS-DUP-CONTR-REC-CNT     PIC 9(7) COMP  VALUE ZEROES.    02040028
020500     05  WS-DUP-VDR-USR-REC-CNT   PIC 9(7) COMP  VALUE ZEROES.    02050028
020600     05  WS-CLASSIFICATION        PIC X(16)      VALUE SPACES.    02060027
020700         88  WSC-EMPLOYEE                        VALUE            02070027
020800             'KOHLS_EMPLOYEE  '.                                  02080017
020810         88  WSC-STORE-EMPLOYEE                  VALUE            02081028
020820             'KOHLS_STORE_EMPL'.                                  02082028
020900         88  WSC-CONTRACTOR                      VALUE            02090027
021000             'KOHLS_CONTRACTOR'.                                  02100017
021100         88  WSC-VENDOR                          VALUE            02110027
021200             'kohlsvendor     '.                                  02120017
021300         88  WSC-VENDOR-USER                     VALUE            02130027
021400             'kohlsvendoruser '.                                  02140017
021800     05  WS-DATE.                                                 02180000
021900         10  WS-YR                PIC 9(2)       VALUE ZEROES.    02190027
022000         10  WS-MO                PIC 9(2)       VALUE ZEROES.    02200027
022100         10  WS-DY                PIC 9(2)       VALUE ZEROES.    02210027
022200     05  WS-TIME.                                                 02220000
022300         10  WS-HR                PIC 9(2)       VALUE ZEROES.    02230027
022400         10  WS-MIN               PIC 9(2)       VALUE ZEROES.    02240027
022500         10  WS-SEC               PIC 9(2)       VALUE ZEROES.    02250027
022600         10  WS-HSEC              PIC 9(2)       VALUE ZEROES.    02260027
022700     05  WS-NAME.                                                 02270002
022710         10  WS-LAST-NAME         PIC X(18)      VALUE SPACES.    02271027
022720         10  WS-NAME-LEFT-OVER.                                   02272002
022730             15  WS-NAME-LEFT-OVER-1                              02273002
022740                                  PIC X(1)       VALUE SPACES.    02274027
022750             15  WS-NAME-LEFT-OVER-2                              02275002
022760                                  PIC X(12)      VALUE SPACES.    02276027
022800     05  WS-LAST-CHARACTER        PIC X          VALUE SPACES.    02280027
022900     05  WS-LAST-NUMBER           PIC 9   COMP   VALUE ZEROES.    02290027
023000     05  WS-COMBINE-NAME.                                         02300000
023100         10  WS-FULL-NAME         PIC X(60)      VALUE SPACES.    02310027
023200         10  WS-WORKING-FULL-NAME                                 02320000
023300                 REDEFINES WS-FULL-NAME.                          02330000
023400             15  WS-F-LETTERS OCCURS 60 TIMES INDEXED BY          02340000
023500                 X-F-NAME         PIC X.                          02350027
023600     05  WS-DIVIDE-NAME.                                          02360000
023700         10  WS-PART-NAME         PIC X(60)      VALUE SPACES.    02370027
023800         10  WS-WORKING-PART-NAME                                 02380000
023900                 REDEFINES WS-PART-NAME.                          02390000
024000             15  WS-P-LETTERS OCCURS 60 TIMES INDEXED BY          02400000
024100                 X-P-NAME         PIC X.                          02410027
024200     05  WS-DIVIDE-NAME-2.                                        02420000
024300         10  WS-2-NAME            PIC X(60)      VALUE SPACES.    02430027
024400         10  WS-WORKING-2-NAME                                    02440000
024500                 REDEFINES WS-2-NAME.                             02450000
024600             15  WS-2-LETTERS OCCURS 60 TIMES INDEXED BY          02460000
024700                 X-2-NAME         PIC X.                          02470027
025000 01  ID-MGMT-EXTRACT-FILE-EOF     PIC 9(1)       VALUE ZEROES.    02500027
025100     88 IMEF-EOF                                 VALUE 1.         02510027
025200                                                                  02520000
025300 01  ABEND-CODE                   PIC 9(2) COMP  VALUE ZEROES.    02530027
025400     EJECT                                                        02540000
025500********************                                              02550000
025600 PROCEDURE DIVISION.                                              02560000
025700********************                                              02570000
025800     DISPLAY '****************************'                       02580000
025900     DISPLAY '** BEGIN PROGRAM SEKRP003 **'                       02590016
026000     DISPLAY '****************************'                       02600000
026100     DISPLAY ' '.                                                 02610000
026200                                                                  02620000
026300     ACCEPT WS-TIME FROM TIME.                                    02630000
026400     ACCEPT WS-DATE FROM DATE.                                    02640000
026500     MOVE WS-HR  TO HL1-HR.                                       02650000
026600     MOVE WS-MIN TO HL1-MN.                                       02660000
026700     MOVE WS-SEC TO HL1-SC.                                       02670000
026800     MOVE WS-MO  TO HL1-MM.                                       02680000
026900     MOVE WS-DY  TO HL1-DD.                                       02690000
027000     MOVE WS-YR  TO HL1-YY.                                       02700000
027100                                                                  02710000
027300     OPEN INPUT  ID-MGMT-EXTRACT-FILE.                            02730000
027500     OPEN OUTPUT PRINT-FILE.                                      02750000
027700                                                                  02770000
027900     PERFORM A200-READ-ID-MGMT-EXTRACT-FILE.                      02790000
028000     PERFORM B000-COMPARE-NAMES                                   02800000
028100         UNTIL IMEF-EOF.                                          02810000
028200     PERFORM Y900-WRITE-TOTALS.                                   02820000
028300                                                                  02830000
028500     CLOSE ID-MGMT-EXTRACT-FILE                                   02850000
028700           PRINT-FILE.                                            02870000
028900                                                                  02890000
029000     DISPLAY ' '.                                                 02900000
029100     DISPLAY '****************************'                       02910000
029200     DISPLAY '**  END PROGRAM SEKRP003  **'                       02920016
029300     DISPLAY '****************************'                       02930000
029400     STOP RUN.                                                    02940000
029500                                                                  02950000
030700********************************                                  03070000
030800 A200-READ-ID-MGMT-EXTRACT-FILE.                                  03080000
030900********************************                                  03090000
031000     IF IMEF-EOF                                                  03100000
031100         CONTINUE                                                 03110000
031200     ELSE                                                         03120000
031300         READ ID-MGMT-EXTRACT-FILE INTO SE005-LDAP-EXTRACT        03130004
031400             AT END                                               03140000
031500              MOVE 1 TO ID-MGMT-EXTRACT-FILE-EOF                  03150000
031600     END-IF.                                                      03160000
031700                                                                  03170000
031800********************                                              03180000
031900 B000-COMPARE-NAMES.                                              03190000
032000********************                                              03200000
032001     MOVE SE005-DEPT-NBR           TO WS-DEPARTMENT-PARTS.        03200127
032010     PERFORM F000-SPLIT-NAME.                                     03201000
032100     IF WS-LAST-NAME        = WS-HOLD-NAME           AND          03210004
032400        WS-NAME-LEFT-OVER-1 = WS-HOLD-FIRST-INITIAL  AND          03240022
032410        WS-DEPARTMENT-4     = WS-HOLD-DEPARTMENT-4                03241027
032500         PERFORM R000-MOVE-FIELDS-TO-REPORT                       03250000
032900         MOVE WS-LAST-NAME         TO WS-HOLD-NAME                03290002
032902         MOVE WS-NAME-LEFT-OVER-1  TO WS-HOLD-FIRST-INITIAL       03290204
032903         MOVE SE005-DEPT-NBR       TO WS-HOLD-DEPARTMENT          03290309
032904                                      WS-HOLD-DEPARTMENT-PARTS    03290427
032906         MOVE SE005-LOC-NBR        TO WS-HOLD-LOCATION            03290611
032907         MOVE SE005-ASSOC-ID       TO WS-HOLD-ASSOC-ID            03290711
032908         MOVE SE005-ASSOC-USR-ID   TO WS-HOLD-ASSOC-USR-ID        03290811
032909         MOVE SE005-COMMON-NAME    TO WS-HOLD-COMMON-NAME         03290911
032910         PERFORM A200-READ-ID-MGMT-EXTRACT-FILE                   03291000
033000     ELSE                                                         03300000
033100         MOVE WS-LAST-NAME         TO WS-HOLD-NAME                03310009
033101         MOVE WS-NAME-LEFT-OVER-1  TO WS-HOLD-FIRST-INITIAL       03310109
033102         MOVE SE005-DEPT-NBR       TO WS-HOLD-DEPARTMENT          03310210
033103                                      WS-HOLD-DEPARTMENT-PARTS    03310327
033104         MOVE SE005-LOC-NBR        TO WS-HOLD-LOCATION            03310411
033110         MOVE SE005-ASSOC-ID       TO WS-HOLD-ASSOC-ID            03311009
033120         MOVE SE005-ASSOC-USR-ID   TO WS-HOLD-ASSOC-USR-ID        03312009
033121         MOVE SE005-COMMON-NAME    TO WS-HOLD-COMMON-NAME         03312111
033130         PERFORM A200-READ-ID-MGMT-EXTRACT-FILE                   03313009
033710     END-IF.                                                      03371001
033800                                                                  03380000
037100                                                                  03710000
037110*****************                                                 03711000
037200 F000-SPLIT-NAME.                                                 03720000
037210*****************                                                 03721000
037220     UNSTRING SE005-COMMON-NAME DELIMITED BY ','                  03722002
037230         INTO WS-LAST-NAME                                        03723002
037240              WS-NAME-LEFT-OVER.                                  03724002
041000                                                                  04100000
054700****************************                                      05470000
054800 R000-MOVE-FIELDS-TO-REPORT.                                      05480000
054900****************************                                      05490000
055000     INITIALIZE RR-REPORT-RECORD.                                 05500000
055100     MOVE 'POSSIBLE DUPLICATE RECORDS FOR:'                       05510012
055200                                       TO RR-MESSAGE.             05520000
055300     MOVE SE005-ASSOC-ID               TO RR-EMPLOYEE-ID.         05530011
055400     MOVE SE005-ASSOC-USR-ID           TO RR-EMPLOYEE-USER-ID.    05540011
055600     MOVE SE005-COMMON-NAME            TO RR-NAME.                05560000
055700     MOVE SE005-LOC-NBR                TO RR-EMPLOYEE-LOCATION.   05570000
055800     MOVE SE005-DEPT-NBR               TO RR-EMPLOYEE-DEPARTMENT. 05580000
055900     MOVE SE005-CLASSIFICATION         TO RR-PERSON-TYPE.         05590006
056400     PERFORM Y000-WRITE-REPORT-RECORD.                            05640004
056401                                                                  05640111
056420     MOVE SPACES                       TO RR-MESSAGE.             05642011
056440     MOVE WS-HOLD-ASSOC-ID             TO RR-EMPLOYEE-ID.         05644011
056480     MOVE WS-HOLD-ASSOC-USR-ID         TO RR-EMPLOYEE-USER-ID.    05648011
056492     MOVE WS-HOLD-COMMON-NAME          TO RR-NAME.                05649211
056493     MOVE WS-HOLD-LOCATION             TO RR-EMPLOYEE-LOCATION.   05649311
056494     MOVE WS-HOLD-DEPARTMENT           TO RR-EMPLOYEE-DEPARTMENT. 05649411
056495     MOVE SPACES                       TO RR-PERSON-TYPE.         05649511
056496     PERFORM Y000-WRITE-REPORT-RECORD.                            05649611
056497     PERFORM Y200-WRITE-SEPARATOR-LINE.                           05649713
056500                                                                  05650000
056501     MOVE SE005-CLASSIFICATION         TO WS-CLASSIFICATION.      05650117
056502     IF WSC-EMPLOYEE                                              05650217
056510         ADD 1 TO WS-DUP-EMP-REC-CNT                              05651017
056511     END-IF.                                                      05651128
056512     IF WSC-STORE-EMPLOYEE                                        05651228
056513         ADD 1 TO WS-DUP-STR-EMP-REC-CNT                          05651328
056520     END-IF.                                                      05652017
056530     IF WSC-VENDOR                                                05653017
056540         ADD 1 TO WS-DUP-VDR-REC-CNT                              05654017
056550     END-IF.                                                      05655017
056551     IF WSC-VENDOR-USER                                           05655117
056552         ADD 1 TO WS-DUP-VDR-USR-REC-CNT                          05655217
056553     END-IF.                                                      05655317
056560     IF WSC-CONTRACTOR                                            05656017
056570         ADD 1 TO WS-DUP-CONTR-REC-CNT                            05657017
056580     END-IF.                                                      05658017
056600                                                                  05660000
058100**************************                                        05810000
058200 Y000-WRITE-REPORT-RECORD.                                        05820000
058300**************************                                        05830000
058400     IF WS-LINE-CNT > 59                                          05840015
058500         PERFORM Z100-HEADINGS                                    05850004
058600     END-IF.                                                      05860000
058700     IF IMEF-EOF                                                  05870000
058800         MOVE SPACES TO PRINT-REC                                 05880003
058900         WRITE PRINT-REC                                          05890003
059000             AFTER ADVANCING 1 LINE                               05900000
059100         ADD 1 TO WS-LINE-CNT                                     05910003
059200     END-IF.                                                      05920000
059300     WRITE PRINT-REC FROM RR-REPORT-RECORD                        05930003
059400         AFTER ADVANCING 1 LINE.                                  05940000
059500     ADD 1 TO WS-LINE-CNT.                                        05950003
059600                                                                  05960000
059601                                                                  05960113
059602***************************                                       05960213
059603 Y200-WRITE-SEPARATOR-LINE.                                       05960313
059604***************************                                       05960413
059605     IF WS-LINE-CNT > 58                                          05960515
059606         PERFORM Z100-HEADINGS                                    05960615
059607     END-IF.                                                      05960715
059610     WRITE PRINT-REC FROM SL-SEPARATOR-LINE                       05961013
059620         AFTER ADVANCING 1 LINE.                                  05962013
059630     ADD 1 TO WS-LINE-CNT.                                        05963013
059700                                                                  05970000
061500*******************                                               06150000
061600 Y900-WRITE-TOTALS.                                               06160000
061700*******************                                               06170000
061900     IF WS-LINE-CNT > 53                                          06190028
062000         PERFORM Z100-HEADINGS                                    06200000
062100     END-IF.                                                      06210000
062200     MOVE SPACES TO PRINT-REC.                                    06220000
062300                                                                  06230028
063713     MOVE WS-DUP-VDR-REC-CNT     TO TR1-HR-TOTAL.                 06371317
063720     MOVE 'VENDORS     '         TO TR1-TOTAL-TYPE.               06372017
063721     WRITE PRINT-REC FROM TR1-TOTAL-RECORD-1                      06372117
063722         AFTER ADVANCING 1 LINE.                                  06372217
063723                                                                  06372318
063724     MOVE WS-DUP-VDR-USR-REC-CNT TO TR1-HR-TOTAL.                 06372417
063730     MOVE 'VENDOR USERS'         TO TR1-TOTAL-TYPE.               06373017
063740     WRITE PRINT-REC FROM TR1-TOTAL-RECORD-1                      06374017
063750         AFTER ADVANCING 1 LINE.                                  06375017
063751                                                                  06375118
063752     MOVE WS-DUP-CONTR-REC-CNT   TO TR1-HR-TOTAL.                 06375218
063753     MOVE 'CONTRACTORS '         TO TR1-TOTAL-TYPE.               06375318
063754     WRITE PRINT-REC FROM TR1-TOTAL-RECORD-1                      06375418
063755         AFTER ADVANCING 1 LINE.                                  06375518
063756                                                                  06375618
063760     MOVE WS-DUP-EMP-REC-CNT     TO TR1-HR-TOTAL.                 06376018
063770     MOVE 'EMPLOYEES   '         TO TR1-TOTAL-TYPE.               06377018
063780     WRITE PRINT-REC FROM TR1-TOTAL-RECORD-1                      06378018
063790         AFTER ADVANCING 1 LINE.                                  06379018
063791                                                                  06379128
063792     MOVE WS-DUP-STR-EMP-REC-CNT TO TR1-HR-TOTAL.                 06379228
063794     MOVE 'STORE EMPLOYEES'      TO TR1-TOTAL-TYPE.               06379428
063795     WRITE PRINT-REC FROM TR1-TOTAL-RECORD-1                      06379528
063796         AFTER ADVANCING 1 LINE.                                  06379628
063797                                                                  06379728
063800     MOVE SPACES TO RR-REPORT-RECORD.                             06380000
063900     MOVE '** END OF REPORT **'  TO RR-NAME.                      06390028
064000     WRITE PRINT-REC FROM RR-REPORT-RECORD                        06400003
064100         AFTER ADVANCING 1 LINE.                                  06410000
064500                                                                  06450000
064600                                                                  06460000
064700***************                                                   06470000
064800 Z100-HEADINGS.                                                   06480000
064900***************                                                   06490000
065000     ADD 1                 TO WS-PAGE-CNT.                        06500000
065100     MOVE 1                TO HL1-RPTNO.                          06510000
065200     MOVE WS-PAGE-CNT      TO HL1-PAGE.                           06520000
065300     MOVE SPACES           TO PRINT-REC.                          06530000
065400     WRITE PRINT-REC FROM HEADING-LINE1                           06540000
065500         AFTER ADVANCING PAGE.                                    06550000
065600     WRITE PRINT-REC FROM HEADING-LINE2                           06560000
065700         AFTER ADVANCING 1 LINE.                                  06570000
065800     WRITE PRINT-REC FROM HEADING-LINE3                           06580000
065900         AFTER ADVANCING 2 LINES.                                 06590000
066000     MOVE SPACES TO PRINT-REC.                                    06600000
066100     WRITE PRINT-REC                                              06610000
066200         AFTER ADVANCING 1 LINE.                                  06620000
066300     MOVE ZEROES TO WS-LINE-CNT.                                  06630000
