000100******************************************************************00020001
000200*   THIS IS THE RECORD LAYOUT FOR THE UPS FILE                   *00030001
000200*   LRECL = 885                                                  *00040001
000900******************************************************************00050001
001000 01  SE010-UPS-DETAIL.                                            00060001
001100     05  SE010-USERID            PIC X(20)  VALUE SPACES.         00070001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00080001
001500     05  SE010-CAMPUS            PIC X(35)  VALUE SPACES.         00090001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00100001
001800     05  SE010-DEFAULT-CAMPUS    PIC X(35)  VALUE SPACES.         00110001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00120001
001800     05  SE010-FNAME             PIC X(17)  VALUE SPACES.         00130001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00140001
001800     05  SE010-LNAME             PIC X(17)  VALUE SPACES.         00150001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00160001
001800     05  SE010-PASSWORD          PIC X(20)  VALUE SPACES.         00170001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00180001
001800     05  SE010-ADDR1             PIC X(35)  VALUE SPACES.         00190001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00200001
001800     05  SE010-ADDR2             PIC X(35)  VALUE SPACES.         00210001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00220001
001800     05  SE010-ADDR3             PIC X(35)  VALUE SPACES.         00230001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00240001
001800     05  SE010-CITY              PIC X(30)  VALUE SPACES.         00250001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00260001
001800     05  SE010-STATE             PIC X(02)  VALUE SPACES.         00270001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00280001
001800     05  SE010-POSTAL-CODE       PIC X(10)  VALUE SPACES.         00290001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00300001
001800     05  SE010-COUNTRY-CODE      PIC X(02)  VALUE SPACES.         00310001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00320001
001800     05  SE010-EMAIL             PIC X(50)  VALUE SPACES.         00330001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00340001
001800     05  SE010-PHONE             PIC X(15)  VALUE SPACES.         00350001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00360001
001800     05  SE010-IDLEVEL           PIC X(02)  VALUE SPACES.         00370001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00380001
001800     05  SE010-GL-ACCOUNT        PIC X(50)  VALUE SPACES.         00390001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00400001
001800     05  SE010-DEPARTMENT        PIC X(50)  VALUE SPACES.         00410001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00420001
001800     05  SE010-CUSTOM-3          PIC X(50)  VALUE SPACES.         00430001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00440001
001800     05  SE010-CUSTOM-4          PIC X(50)  VALUE SPACES.         00450001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00460001
001800     05  SE010-CUSTOM-5          PIC X(50)  VALUE SPACES.         00470001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00480001
001800     05  SE010-CUSTOM-6          PIC X(50)  VALUE SPACES.         00490001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00500001
001800     05  SE010-CUSTOM-7          PIC X(50)  VALUE SPACES.         00510001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00520001
001800     05  SE010-CUSTOM-8          PIC X(50)  VALUE SPACES.         00530001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00540001
001800     05  SE010-CUSTOM-9          PIC X(50)  VALUE SPACES.         00550001
001100     05  FILLER                  PIC X(01)  VALUE ','.            00560001
001800     05  SE010-CUSTOM-10         PIC X(50)  VALUE SPACES.         00570001
