000100***************************************************************** 00010015
000200* COPYBOOK SERD001      RECORD LENGTH = 383                     * 00020029
000300* THIS IS A COPYBOOK FOR THE E-MAIL ASSOCIATE FILE FOR          * 00030029
000500* BUSINESS CONTINUITY.                                          * 00050029
000600***************************************************************** 00060015
000700                                                                  00070015
000800 01  SE001-FORMATTED-OUTPUT-RECORD.                               00080021
000900     05  SE001-EMPLOYEE-USER-ID         PIC X(08) VALUE SPACES.   00090025
000910     05  FILLER                         REDEFINES                 00091030
000920                                          SE001-EMPLOYEE-USER-ID. 00092030
000930         10  SE001-EMPLOYEE-USER-ID-STD PIC X(07).                00093030
000940         10  FILLER                     PIC X(01).                00094031
001000     05  SE001-NAME.                                              00100021
001100         10  SE001-FIRST-NAME           PIC X(16) VALUE SPACES.   00110021
001200         10  SE001-LAST-NAME            PIC X(20) VALUE SPACES.   00120021
001300     05  SE001-LOCATION.                                          00130021
001400         10  SE001-LOCATION-NBR         PIC X(04) VALUE SPACES.   00140022
001500         10  SE001-LOCATION-NAME        PIC X(22) VALUE SPACES.   00150021
001600     05  SE001-JOB-TITLE                PIC X(75) VALUE SPACES.   00160021
001700     05  SE001-WORK-PHONE               PIC X(12) VALUE SPACES.   00170021
001800     05  SE001-CELL-PHONE               PIC X(16) VALUE SPACES.   00180027
001900     05  SE001-PAGER-PIN                PIC X(60) VALUE SPACES.   00190021
002000     05  SE001-WORK-EMAIL-ADDRESS       PIC X(60) VALUE SPACES.   00200029
002100     05  SE001-SUPERVISOR               PIC X(60) VALUE SPACES.   00210021
002200     05  SE001-STR-GP-TYP-DESC          PIC X(30) VALUE SPACES.   00220028
