      ******************************************************************        
      **  COPYBOOK SERD005                                            **        
      **  THIS IS THE RECORD LAYOUT FOR THE ID MGMT LDAP EXTRACT.     **        
      **                                                              **        
      **  FORMAT:  FLAT                                               **        
      **   LRECL:  242 BYTES                                          **        
      ******************************************************************        
       01  SE005-LDAP-EXTRACT.                                                  
           05  SE005-CLASSIFICATION            PIC  X(16).                      
           05  SE005-ASSOC-ID                  PIC  X(07).                      
           05  SE005-ASSOC-USR-ID              PIC  X(07).                      
           05  SE005-COMMON-NAME               PIC  X(40).                      
           05  SE005-DEPT-NBR                  PIC  X(07).                      
           05  SE005-LOC-NBR                   PIC  X(04).                      
           05  SE005-EMAIL                     PIC  X(60).                      
           05  SE005-JOB-CODE                  PIC  X(06).                      
           05  SE005-JOB-CODE-NAME             PIC  X(30).                      
           05  SE005-BUSINESS-TITLE            PIC  X(30).                      
           05  SE005-DEPT-NAME                 PIC  X(35).                      
