000100******************************************************************00020001
000200*   THIS IS THE RECORD LAYOUT FOR THE ITIM INPUT FILE FOR UPS    *00030001
000200*   LRECL = 960                                                  *00040001
000900******************************************************************00050001
001000 01  SE009-ITIM-HEADER.                                           00060001
001100     05  SE009-HEADER            PIC X(960) VALUE SPACES.         00070001
001000 01  SE009-ITIM-DETAIL.                                           00080001
001100     05  SE009-KHREG-NUM         PIC X(06)  VALUE SPACES.         00090001
001500     05  SE009-SUP-NAME          PIC X(50)  VALUE SPACES.         00100001
001800     05  SE009-JOBACTION         PIC X(03)  VALUE SPACES.         00110001
001800     05  SE009-CELL-PHONE        PIC X(12)  VALUE SPACES.         00120001
001800     05  SE009-PAGER             PIC X(12)  VALUE SPACES.         00130001
001800     05  SE009-KHEMPL-ID         PIC X(07)  VALUE SPACES.         00140001
001800     05  SE009-KHMIDDLE-INITIAL  PIC X(01)  VALUE SPACES.         00150001
001800     05  SE009-EMAIL             PIC X(40)  VALUE SPACES.         00160001
001800     05  SE009-LOC-ZIP           PIC X(05)  VALUE SPACES.         00170001
001800     05  SE009-ORIG-HIRE-DATE    PIC X(10)  VALUE SPACES.         00180001
001800     05  SE009-HOME-FAX-NBR      PIC X(12)  VALUE SPACES.         00190001
001800     05  SE009-LOC-ADDR          PIC X(30)  VALUE SPACES.         00200001
001800     05  SE009-EMP-TERM-CODE     PIC X(01)  VALUE SPACES.         00210001
001800     05  SE009-KH-DEPT-ID        PIC X(06)  VALUE SPACES.         00220001
001800     05  SE009-KH-ROLE           PIC X(30)  VALUE SPACES.         00230001
001800     05  SE009-KH-COMPANY        PIC X(03)  VALUE SPACES.         00240001
001800     05  SE009-DEPT-NAME         PIC X(30)  VALUE SPACES.         00250001
001800     05  SE009-TERR-NUM          PIC X(04)  VALUE SPACES.         00260001
001800     05  SE009-DEPT-BEG-DATE     PIC X(10)  VALUE SPACES.         00270001
001800     05  SE009-JOB-ACTION        PIC X(03)  VALUE SPACES.         00280001
001800     05  SE009-TELEX-NUM         PIC X(07)  VALUE SPACES.         00290001
001800     05  SE009-GADS-USER-TYPE    PIC X(10)  VALUE SPACES.         00300001
001800     05  SE009-HOME-PHONE        PIC X(12)  VALUE SPACES.         00310001
001800     05  SE009-HIRE-DATE         PIC X(10)  VALUE SPACES.         00320001
001800     05  SE009-KH-LOC-NUM        PIC X(04)  VALUE SPACES.         00330001
001800     05  SE009-POS-BEG-DATE      PIC X(10)  VALUE SPACES.         00340001
001800     05  SE009-EMPL-TYP-CODE     PIC X(01)  VALUE SPACES.         00350001
001800     05  SE009-POSITION-NAME     PIC X(30)  VALUE SPACES.         00360001
001800     05  SE009-NAME              PIC X(50)  VALUE SPACES.         00370001
001800     05  SE009-PERSON-TYPE       PIC X(01)  VALUE SPACES.         00380001
001800     05  SE009-KH-TITLE          PIC X(30)  VALUE SPACES.         00390001
001800     05  SE009-SHIFT             PIC X(01)  VALUE SPACES.         00400001
001800     05  SE009-LOC-STATE         PIC X(02)  VALUE SPACES.         00410001
001800     05  SE009-GADS-LAST-NAME    PIC X(20)  VALUE SPACES.         00420001
001800     05  SE009-ALIAS-TK          PIC X(40)  VALUE SPACES.         00430001
001800     05  SE009-EMP-CATEGORY      PIC X(01)  VALUE SPACES.         00440001
001800     05  SE009-DISPLAY-NAME      PIC X(20)  VALUE SPACES.         00450001
001800     05  SE009-PAY-GROUP         PIC X(03)  VALUE SPACES.         00460001
001800     05  SE009-LOC-NAME          PIC X(30)  VALUE SPACES.         00470001
001800     05  SE009-JOB-ACT-NAME      PIC X(40)  VALUE SPACES.         00480001
001800     05  SE009-JOB-CODE          PIC X(06)  VALUE SPACES.         00490001
001800     05  SE009-LOC-CITY          PIC X(30)  VALUE SPACES.         00500001
001800     05  SE009-FIRST-NAME        PIC X(20)  VALUE SPACES.         00510001
001800     05  SE009-JOB-CODE-NAME     PIC X(30)  VALUE SPACES.         00520001
001800     05  SE009-KH-USER-TYPE      PIC X(30)  VALUE SPACES.         00530001
001800     05  SE009-TK-NUMBER         PIC X(07)  VALUE SPACES.         00540001
001800     05  SE009-HAS-MAIL-ACCT     PIC X(01)  VALUE SPACES.         00550001
001800     05  SE009-JOB-BEG-DATE      PIC X(10)  VALUE SPACES.         00560001
001800     05  SE009-JOB-ACT-DATE      PIC X(10)  VALUE SPACES.         00570001
001800     05  SE009-POSN-NUM          PIC X(05)  VALUE SPACES.         00580001
001800     05  SE009-WORK-PHONE        PIC X(12)  VALUE SPACES.         00590001
001800     05  SE009-EMPL-STATUS       PIC X(01)  VALUE SPACES.         00600001
001800     05  SE009-ACC-CRD-NBR       PIC X(30)  VALUE SPACES.         00610001
001800     05  SE009-HAS-APPS-ACCESS   PIC X(10)  VALUE SPACES.         00620001
001800     05  SE009-EMPL-INITIALS     PIC X(03)  VALUE SPACES.         00630001
001800     05  SE009-DEVICE-NBRS       PIC X(01)  VALUE SPACES.         00640001
001800     05  SE009-LAST-DAY-WORKED   PIC X(10)  VALUE SPACES.         00650001
001800     05  SE009-LOC-TYPE          PIC X(20)  VALUE SPACES.         00660001
001800     05  SE009-POS-TRAINED       PIC X(05)  VALUE SPACES.         00670001
001800     05  SE009-RECORD-TYPE       PIC X(10)  VALUE SPACES.         00680001
001800     05  SE009-TERM-DATE         PIC X(10)  VALUE SPACES.         00690001
001800     05  SE009-SUPERVISOR-ID     PIC X(50)  VALUE SPACES.         00700001
001800     05  SE009-SN                PIC X(20)  VALUE SPACES.         00710001
001800     05  SE009-UID               PIC X(07)  VALUE SPACES.         00720001
001800     05  SE009-KHDISTNUM         PIC X(04)  VALUE SPACES.         00730001
001800     05  FILLER                  PIC X(21)  VALUE SPACES.         00740001
