000100******************************************************************00010000
000200*  ORGANIZATION HIERARCHY EXTRACT FOR IDENTITY MANAGEMENT.       *00020003
000210*  EACH FILE WILL BE A COMPLETE POINT-IN-TIME SNAPSHOT OF THE    *00021003
000220*  HIERARCHY RELATIONSHIPS FOR ALL DEFINED, BUT NOT FINANCIALLY  *00022003
000300*  CLOSED, DEPARTMENT STORE LOCATIONS.  THE RECORD LENGTH IS     *00030003
000310*  40 BYTES.                                                     *00031003
000400******************************************************************00040000
000500                                                                  00050000
000600 01  SE006-ORG-HIER-EXTRACT-RECORD.                               00060000
000700     05  SE006-LOC-NBR           PIC X(5)     VALUE SPACES.       00070000
000800     05  SE006-LOC-NBR-N         REDEFINES SE006-LOC-NBR          00080000
000900                                 PIC 9(5).                        00090000
002500     05  SE006-DIST-NBR          PIC X(4)     VALUE SPACES.       00250002
002600         88  SE006-DIST-UNKNOWN               VALUE '????'.       00260002
002700     05  SE006-DIST-NBR-N        REDEFINES SE006-DIST-NBR         00270002
002800                                 PIC 9(4).                        00280002
002900     05  SE006-REGN-NBR          PIC X(4)     VALUE SPACES.       00290002
003000         88  SE006-REGN-UNKNOWN               VALUE '????'.       00300002
003100     05  SE006-REGN-NBR-N        REDEFINES SE006-REGN-NBR         00310002
003200                                 PIC 9(4).                        00320000
003300     05  SE006-TERR-NBR          PIC X(4)     VALUE SPACES.       00330000
003400         88  SE006-TERR-UNKNOWN               VALUE '????'.       00340000
003500     05  SE006-TERR-NBR-N        REDEFINES SE006-TERR-NBR         00350000
003600                                 PIC 9(4).                        00360000
004100     05  SE006-PREV-DIST-NBR     PIC X(4)     VALUE SPACES.       00410000
004200         88  SE006-PREV-DIST-UNKNOWN          VALUE '????'.       00420000
004300         88  SE006-PREV-DIST-UNCHANGED        VALUE SPACES.       00430001
004400     05  SE006-PREV-DIST-NBR-N   REDEFINES SE006-PREV-DIST-NBR    00440001
004500                                 PIC 9(4).                        00450001
004600     05  SE006-PREV-REGN-NBR     PIC X(4)     VALUE SPACES.       00460001
004700         88  SE006-PREV-REGN-UNKNOWN          VALUE '????'.       00470001
004800         88  SE006-PREV-REGN-UNCHANGED        VALUE SPACES.       00480001
004900     05  SE006-PREV-REGN-NBR-N   REDEFINES SE006-PREV-REGN-NBR    00490001
005000                                 PIC 9(4).                        00500001
005100     05  SE006-PREV-TERR-NBR     PIC X(4)     VALUE SPACES.       00510001
005200         88  SE006-PREV-TERR-UNKNOWN          VALUE '????'.       00520001
005300         88  SE006-PREV-TERR-UNCHANGED        VALUE SPACES.       00530001
005400     05  SE006-PREV-TERR-NBR-N   REDEFINES SE006-PREV-TERR-NBR    00540001
005500                                 PIC 9(4).                        00550001
005600     05  FILLER                  PIC X(11)    VALUE SPACES.       00560004
