      ***************************************************************** 00010007
      **T750 - FREIGHT PROCESSING FROM CLIENT RECORD                    00020009
      ***************************************************************** 00030007
       01  SFRD006-FROM-CLIENT-RECORD.                                  00040007
           05  SFRD006-TOT-REC-LENGTH          PIC 9(04)   VALUE ZEROS. 00050007
           05  SFRD006-MATCHING-NBR            PIC 9(08)   VALUE ZEROS. 00060007
           05  SFRD006-LISTENER-CODE           PIC X(01)   VALUE SPACES.00070007
           05  SFRD006-LOC-NBR                 PIC 9(05)   VALUE ZEROS. 00080007
           05  SFRD006-UPC-NBR                 PIC 9(15)   VALUE ZEROS. 00090007
      **THIS FILLER VARIES BASED ON OTHER DATA IN COPYBOOK MUST EQUAL   00100007
      **     4241                                                       00110007
           05  FILLER                          PIC X(4087) VALUE SPACE. 00120010
           05  SFRD006-MQ-INDICATOR            PIC X(01)   VALUE SPACE. 00130008
               88  SFRD006-MQ-INDICATOR-N                  VALUE 'N'.   00140008
               88  SFRD006-MQ-INDICATOR-Y                  VALUE 'Y'.   00150008
           05  SFRD006-REPLYTOQ                PIC X(48)   VALUE SPACE. 00160008
           05  SFRD006-REPLYTOQMGR             PIC X(48)   VALUE SPACE. 00170008
           05  SFRD006-MSGID                   PIC X(24)   VALUE SPACE. 00180008
