000100***************************************************************** 00010000
000200* PURPOSE: SEQUENTIAL FILE LAYOUT FOR RESTOCK REPORT              00020000
000300* LENGTH : 785                                                    00030011
000400* FORMAT : SEQUENTIAL                                             00040000
000500***************************************************************** 00050000
000600 01  SF002-RESTOCKING-RECORD.                                     00060010
000700*                                                                 00070000
000800* REPORT ITEM DESCRIPTIONS AND INFORMATION                        00080000
000900*                                                                 00090000
002400     05  SF002-UPC-NBR                  PIC  9(015) VALUE ZEROS.  00240010
003230     05  SF002-CURR-DAY-UNITS-SOLD      PIC S9(005) VALUE ZEROS.  00323010
004100     05  SF002-SKU-STATUS               PIC  X(003) VALUE SPACES. 00410010
004130*                                                                 00413000
004131* USED TO STORE VALUES FROM NON DOMAIN TABLE TMDARVS              00413100
004132*                                                                 00413200
004133     05  SF002-VS-DESC                  PIC  X(030) VALUE SPACES. 00413310
004134*                                                                 00413403
004135* ON HAND VALUES FROM API CALL TO NON DOMAIN TABLES               00413503
004136*                                                                 00413603
004137     05  SF002-ONHAND-QTY               PIC  9(005) VALUE ZEROES. 00413710
004138*                                                                 00413807
004139* USED TO STORE VALUES EXTARCTED FROM THE XST_BUG_AREA TABLE      00413907
004140*                                                                 00414007
004141     05  SF002-XSBA-BUS-AREA-ID         PIC  9(003) VALUE ZEROES. 00414110
004142     05  SF002-XSBA-BUS-AREA-DESC       PIC  X(025) VALUE SPACES. 00414210
004143     05  SF002-XSBA-SOR-LAST-MSG-TMST   PIC  X(026) VALUE SPACES. 00414310
004144*                                                                 00414400
004145* USED TO STORE VALUES EXTARCTED FROM THE XST_BUS_GP TABLE        00414500
004146*                                                                 00414600
004147     05  SF002-XSBG-BUS-GP-NBR          PIC  9(004) VALUE ZEROES. 00414710
004148     05  SF002-XSBG-BUS-GP-DESC         PIC  X(025) VALUE SPACES. 00414810
004149     05  SF002-XSBG-BUS-AREA-ID         PIC  9(003) VALUE ZEROES. 00414910
004150     05  SF002-XSBG-SOR-LAST-MSG-TMST   PIC  X(026) VALUE SPACES. 00415010
004152*                                                                 00415204
004153* USED TO STORE VALUES EXTARCTED FROM THE XS_LOC TABLE            00415304
004154*                                                                 00415404
004155     05  SF002-XSLC-LOC-NBR            PIC  9(005) VALUE ZEROES.  00415510
004156     05  SF002-XSLC-LOC-10-ABBR-NM     PIC  X(010) VALUE SPACES.  00415610
004157*                                                                 00415702
004158* USED TO STORE VALUES EXTARCTED FROM THE XS_SUB_CL TABLE         00415802
004159*                                                                 00415902
004160     05  SF002-XSSC-DEPT-NBR            PIC  9(005) VALUE ZEROES. 00416010
004161     05  SF002-XSSC-MAJ-CL-NBR          PIC  9(005) VALUE ZEROES. 00416110
004162     05  SF002-XSSC-SUB-CL-NBR          PIC  9(005) VALUE ZEROES. 00416210
004163     05  SF002-XSSC-SUB-CL-NM           PIC  X(020) VALUE SPACES. 00416310
004164     05  SF002-XSSC-POS-MDSE-DESC       PIC  X(030) VALUE SPACES. 00416410
004165     05  SF002-XSSC-TAX-DFLT-IND        PIC  X(001) VALUE SPACES. 00416510
004166     05  SF002-XSSC-DISC-ELIG-IND       PIC  X(001) VALUE SPACES. 00416610
004167     05  SF002-XSSC-CRE-TMST            PIC  X(026) VALUE SPACES. 00416710
004168     05  SF002-XSSC-LAST-UPD-TMST       PIC  X(026) VALUE SPACES. 00416810
004169     05  SF002-XSSC-SOR-LAST-MSG-TMST   PIC  X(026) VALUE SPACES. 00416910
004170*                                                                 00417000
004171* USED TO STORE VALUES EXTARCTED FROM THE XS_VND_STYL TABLE       00417100
004172*                                                                 00417200
004173     05  SF002-XSVS-STYL-ID             PIC  9(009) VALUE ZEROS.  00417310
004174     05  SF002-XSVS-DEPT-NBR            PIC  9(005) VALUE ZEROS.  00417410
004175     05  SF002-XSVS-MAJ-CL-NBR          PIC  9(005) VALUE ZEROS.  00417510
004176     05  SF002-XSVS-SUB-CL-NBR          PIC  9(005) VALUE ZEROS.  00417610
004177     05  SF002-XSVS-VS-ID               PIC  9(010) VALUE ZEROS.  00417710
004178     05  SF002-XSVS-VS-NBR              PIC  X(020) VALUE SPACES. 00417810
004179     05  SF002-XSVS-ENT-ID              PIC  9(010) VALUE ZEROS.  00417910
004180     05  SF002-XSVS-STKR-NBR            PIC  9(010) VALUE ZEROS.  00418010
004181     05  SF002-XSVS-RTL-CLSN-DESC       PIC  X(020) VALUE SPACES. 00418110
004182     05  SF002-XSVS-LBL-NM              PIC  X(020) VALUE SPACES. 00418210
004183     05  SF002-XSVS-ESL-IND             PIC  X(020) VALUE SPACES. 00418310
004184     05  SF002-XSVS-HNG-FOLD-DESC       PIC  X(020) VALUE SPACES. 00418410
004185     05  SF002-XSVS-LAST-UPD-TMST       PIC  X(026) VALUE SPACES. 00418510
004186     05  SF002-XSVS-SOR-LAST-MSG-TMST   PIC  X(026) VALUE SPACES. 00418610
004700*                                                                 00470000
004710* USED TO STORE VALUES EXTRACTED FROM THE XST_SKU TABLE           00471000
004711*                                                                 00471100
004721     05  SF002-XSSK-INTR-UPC-ID         PIC  9(010) VALUE ZEROES. 00472110
004722     05  SF002-XSSK-STYL-ID             PIC  9(009) VALUE ZEROES. 00472210
004723     05  SF002-XSSK-SKU-NBR             PIC  9(009) VALUE ZEROES. 00472310
004724     05  SF002-XSSK-SKU-DESC            PIC  X(030) VALUE SPACES. 00472410
004725     05  SF002-XSSK-REGN-PRIC-IND       PIC  X(001) VALUE SPACES. 00472510
004726     05  SF002-XSSK-KOHLS-SIZE-CDE      PIC  9(010) VALUE ZEROES. 00472610
004727     05  SF002-XSSK-TX-PRD-CDE-DESC     PIC  X(020) VALUE SPACES. 00472710
004728     05  SF002-XSSK-SIZE-DESC           PIC  X(010) VALUE SPACES. 00472810
004729     05  SF002-XSSK-NRF-CLOR-CDE        PIC  X(003) VALUE SPACES. 00472910
004730     05  SF002-XSSK-E-BUS-ITM-IND       PIC  X(001) VALUE SPACES. 00473010
004731     05  SF002-XSSK-CSTM-CLOR-DESC      PIC  X(010) VALUE SPACES. 00473110
004732     05  SF002-XSSK-E-BUS-PRD-GP-NBR    PIC  9(009) VALUE ZEROES. 00473210
004733     05  SF002-XSSK-WT-UM-CDE           PIC  X(002) VALUE SPACES. 00473310
004734     05  SF002-XSSK-WT-UM-QTY           PIC  9(006)V9(3) VALUE    00473410
004735                                                         ZEROES.  00473500
004736     05  SF002-XSSK-SIZE-UM-CDE         PIC  X(002) VALUE SPACES. 00473610
004737     05  SF002-XSSK-WD-UM-QTY           PIC  9(005)V9(3) VALUE    00473710
004738                                                         ZEROES.  00473800
004739     05  SF002-XSSK-HT-UM-QTY           PIC  9(005)V9(3) VALUE    00473910
004740                                                         ZEROES.  00474000
004741     05  SF002-XSSK-DPTH-UM-QTY         PIC  9(005)V9(3) VALUE    00474110
004742                                                         ZEROES.  00474200
004743     05  SF002-XSSK-CRE-TMST            PIC  X(026) VALUE SPACES. 00474310
004744     05  SF002-XSSK-LAST-UPD-TMST       PIC  X(026) VALUE SPACES. 00474410
004745     05  SF002-XSSK-NRF-CLOR-DESC       PIC  X(010) VALUE SPACES. 00474510
004746     05  SF002-XSSK-SOR-LAST-MSG-TMST   PIC  X(026) VALUE SPACES. 00474610
004747*                                                                 00474708
004748* USED TO HOLD CLASSIFICATION INDICATOR                           00474808
004749*                                                                 00474908
004750     05  SF002-CLASS-SEQUENCE-IND       PIC  9(002) VALUE ZEROES. 00475010
