      ***************************************************************** 00010004
      **SFRD045 - REFORMAT OF TRUCKS FILE                               00020029
      ***************************************************************** 00030004
       01  SFRD045-REFORMAT-MANIFEST-FILE.                              00040029
           05  SFRD045-LOC-NBR                PIC S9(04) COMP           00050030
                                                         VALUE ZEROS.   00060030
           05  SFRD045-INTR-UPC-ID            PIC S9(09) COMP           00070030
                                                         VALUE ZEROS.   00080030
           05  SFRD045-DEPT-NBR               PIC S9(04)V COMP-3        00090030
                                                         VALUE ZEROS.   00100030
           05  SFRD045-MNFST-QTY              PIC S9(04) COMP-3         00110030
                                                         VALUE ZEROS.   00120030
           05  SFRD045-BUS-GP-NBR             PIC S9(04)V COMP-3        00130030
                                                         VALUE ZEROS.   00140030
           05  SFRD045-MAJ-CL-NBR             PIC S9(04)V COMP-3        00150030
                                                         VALUE ZEROS.   00160030
