000100***************************************************************** 00010001
000200**  SFRD020 - EXTRACT OF SALES/RETURNS FROM COSA - LRECL 18       00020001
000210**            SUMMARIZED BY STORE/SKU                             00021001
000300***************************************************************** 00022001
000400 01  SF020-SUMMED-EXTRACT-RECORD.                                 00023001
000500     05  SF020-STR-NBR                  PIC S9(04) COMP.          00024001
000700     05  SF020-SKU-NBR                  PIC S9(08) COMP-3.        00025001
000700     05  SF020-ITM-STAT-CDE             PIC  X(02).               00025101
000900     05  SF020-SLD-QTY                  PIC S9(04) COMP.          00026002
000900     05  SF020-SAL-RET-CDE              PIC  X(01).               00026101
001000     05  SF020-UPC-NBR                  PIC S9(15) COMP-3.        00027001
