000100******************************************************************00010000
000200**                        SURD104                               **00020001
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT OF THE MESSAGE BEING SENT TO MLS WHEN    **00040000
000500**  OUTBOUND TRAILERS ARE OPENED AT THE STORES. THIS DEFINES    **00050001
000500**  ALL NUMERIC FIELDS AS NOT PACKED.                           **00051001
000700******************************************************************00070000
000800 01  SF104-EXTRACT-RECORD.                                        00080005
000801     05  SF104-DEST-LOC-NBR            PIC  9(05)  VALUE 0.       00080105
000810     05  SF104-OTBND-TRIP-ID           PIC  9(09)  VALUE 0.       00081005
000811     05  SF104-SHIPPED-TMST            PIC  X(26)  VALUE SPACES.  00081105
000814     05  SF104-TRIP-STAT-CDE           PIC  X(02)  VALUE SPACES.  00081405
