000100 01  SN006-CONTROL-RECORD.                                        00010000
000200     05  SN006-DAT-XFER-CNTL-ID       PIC  S9(9) COMP.            00020000
000300     05  SN006-STAT-CDE               PIC  X(01).                 00020000
000300     05  FILLER                       PIC  X(15).                 00020000
