000100***************************************************************** 00010013
000200*    RECORD PURPOSE: INPUT RECORD FOR THE ADVANCE SHIP          * 00020013
000300*                    NOTICE DETAIL FILE. THIS FILE CONTAINS     * 00030013
000400*                    SHIP NOTICE INFORMATION RECEIVED FROM A    * 00040013
000500*                    VENDOR AND PROCESSED THROUGH EDI*CENTRAL   * 00050013
000600*    RECORD LENGTH:  350 BYTES                                  * 00060013
000700*    RECORD FORMAT:  SEQUENTIAL                                 * 00070013
000800***************************************************************** 00080013
000900                                                                  00090013
001000 01  ADVANCE-SHIP-NOTICE-DTL-RECORD.                              00100013
001100     05  SN001I-SHIP-NOTICE-DTL-RECORD.                           00110013
001200         10  SN001I-REC-TYP-CDE                 PIC X(3).         00120013
001300             88  ID-IDENTIFICATION-REC          VALUE 'ID '.      00130013
001400             88  HL-HIERARCHICAL-REC            VALUE 'HL '.      00140013
001500             88  PO4-ITEM-PHYSICAL-DTL-REC      VALUE 'PO4'.      00150013
001600             88  TD1-CARRIER-QTY-WGHT-REC       VALUE 'TD1'.      00160013
001700             88  TD5-CARRIER-RTE-TRNST-REC      VALUE 'TD5'.      00170013
001710             88  TD4-CARRIER-SPECIAL-HAND       VALUE 'TD4'.      00171013
001800             88  TD3-CARRIER-EQUIPMENT-REC      VALUE 'TD3'.      00172013
001900             88  REF-REFERENCE-NUMBERS-REC      VALUE 'REF'.      00173013
002000             88  DTM-DTE-TME-REFERENCE-REC      VALUE 'DTM'.      00174013
002100             88  FOB-FOB-RELATED-INSTR-REC      VALUE 'FOB'.      00175013
002200             88  N1-NAME-REC                    VALUE 'N1 '.      00176013
002300             88  N2-ADDITIONAL-NAME-REC         VALUE 'N2 '.      00177013
002400             88  N3-ADDRESS-REC                 VALUE 'N3 '.      00178013
002500             88  N4-GEOGRAPHIC-LOC-REC          VALUE 'N4 '.      00179013
002600             88  PRF-PURCHASE-ORDER-REF-REC     VALUE 'PRF'.      00180013
002700             88  CUR-CURRENCY-REC               VALUE 'CUR'.      00190013
002800             88  PKG-MRKG-PCKG-LDG-REC          VALUE 'PKG'.      00200013
002900             88  MAN-MARKS-NUMBERS-REC          VALUE 'MAN'.      00210013
003000             88  LIN-ITEM-IDENTIFICATION-REC    VALUE 'LIN'.      00220013
003100             88  SN1-ITEM-DETAIL-REC            VALUE 'SN1'.      00230013
003200             88  SLN-SUBITEM-DETAIL-REC         VALUE 'SLN'.      00240013
003300         10  SN001I-FILLER-1                    PIC X(24).        00250013
003400         10  SN001I-LVL-CDE                     PIC X(2).         00260013
003500             88  SHIPMENT-LEVEL                 VALUE 'S '.       00270013
003600             88  ORDER-LEVEL                    VALUE 'O '.       00280013
003700             88  PACK-LEVEL                     VALUE 'P '.       00290013
003800             88  ITEM-LEVEL                     VALUE 'I '.       00300013
003900         10  SN001I-CHILD-CDE                   PIC X(1).         00310013
004000             88  STD-PACK                       VALUE '1'.        00320013
004100             88  NO-CARTON                      VALUE '0' ' '.    00330013
004200         10  SN001I-FILLER-2                    PIC X(320).       00340013
004300*                                                                 00350013
004400     05  SN001I-HEADER-LEVEL-RECORD                               00360013
004500                                     REDEFINES                    00370013
004600         SN001I-SHIP-NOTICE-DTL-RECORD.                           00380013
004700         10  SN001I-HEADER-LEVEL-ID             PIC XXX.          00390013
004800         10  SN001I-EDI-VEND-ID.                                  00400013
004900             15  SN001I-VEND-DUNNS-NBR          PIC X(9).         00410013
005000             15  SN001I-VEND-ID-FILLER          PIC X(8).         00420013
005100         10  SN001I-BSN01-TRANS-CDE             PIC X(2).         00430013
005200         10  SN001I-BSN02-SHIPT-ID              PIC X(30).        00440013
005300         10  SN001I-BSN03-SHIPT-DTE             PIC 9(6).         00450013
005400         10  SN001I-BSN04-SHIPT-TIME            PIC 9(4).         00460013
005500         10  SN001I-RECYCLE-DATE.                                 00470013
005600             15  SN001I-RECYCLE-YY              PIC 9(2).         00480013
005700             15  SN001I-RECYCLE-MM              PIC 9(2).         00490013
005800             15  SN001I-RECYCLE-DD              PIC 9(2).         00500013
005900         10  SN001I-STRUC-CDE                   PIC X(4).         00510013
006000         10  SN001I-ISA-CNTL-NBR                PIC 9(9).         00520013
006100         10  SN001I-GS-CNTL-NBR                 PIC 9(9).         00530013
006200         10  SN001I-ST-CNTL-NBR                 PIC X(9).         00540013
006300         10  SN001I-ISA-TMST                    PIC X(26).        00550013
006400         10  SN001I-SESSION-NBR                 PIC 9(6).         00560013
006500         10  SN001I-ISA-ID-QUAL                 PIC X(2).         00570013
006600         10  SN001I-ISA-ID                      PIC X(15).        00580013
006700         10  SN001I-FILLER                      PIC X(202).       00590013
006800*                                                                 00600013
006900     05  SN001I-HL-SEGMENT                                        00610013
007000                                     REDEFINES                    00620013
007100         SN001I-SHIP-NOTICE-DTL-RECORD.                           00630013
007200         10  SN001I-HL-ID                       PIC XXX.          00640013
007300         10  SN001I-HL01-ID-NBR                 PIC X(12).        00650013
007400         10  SN001I-HL02-PARENT-ID              PIC X(12).        00660013
007500         10  SN001I-HL03-LVL-CDE                PIC X(2).         00670013
007600         10  SN001I-HL04-CHILD-CDE              PIC X(1).         00680013
007700         10  SN001I-HL-FILLER                   PIC X(320).       00690013
007800*                                                                 00700013
007900     05  SN001I-PO4-SEGMENT                                       00710013
008000                                     REDEFINES                    00720013
008100         SN001I-SHIP-NOTICE-DTL-RECORD.                           00730013
008200         10  SN001I-PO4-ID                      PIC XXX.          00740013
008300         10  SN001I-PO401-PKG-SIZE-QTY          PIC S9(7)         00750013
008400                                      COMP-3.                     00760013
008500         10  SN001I-PO402-SIZE-MSMT             PIC S9(9)V9(2)    00770013
008600                                      COMP-3.                     00780013
008700         10  SN001I-PO403-SIZE-UM-CDE           PIC X(2).         00790013
008800         10  SN001I-PO405-WGHT-QUAL-CDE         PIC X(2).         00800013
008900         10  SN001I-PO406-GRO-WGHT-MSMT         PIC S9(9)V9(2)    00810013
009000                                      COMP-3.                     00820013
009100         10  SN001I-PO407-WGHT-UM-CDE           PIC X(2).         00830013
009200         10  SN001I-PO408-GRO-VOL-MSMT          PIC S9(9)V9(2)    00840013
009300                                      COMP-3.                     00850013
009400         10  SN001I-PO409-VOL-UM-CDE            PIC X(2).         00860013
009500         10  SN001I-PO410-LEN-MSMT              PIC S9(9)V9(2)    00870013
009600                                      COMP-3.                     00880013
009700         10  SN001I-PO411-WDTH-MSMT             PIC S9(9)V9(2)    00890013
009800                                      COMP-3.                     00900013
009900         10  SN001I-PO412-HT-MSMT               PIC S9(9)V9(2)    00910013
010000                                      COMP-3.                     00920013
010100         10  SN001I-PO413-UM-CDE                PIC X(2).         00930013
010200         10  SN001I-PO414-INPK-EA-QTY           PIC 9(6).         00940013
010300         10  SN001I-PO4-FILLER                  PIC X(291).       00950013
010400*                                                                 00960013
010500     05  SN001I-TD1-SEGMENT                                       00970013
010600                                     REDEFINES                    00980013
010700         SN001I-SHIP-NOTICE-DTL-RECORD.                           00990013
010800         10  SN001I-TD1-ID                      PIC XXX.          01000013
010900         10  SN001I-TD101-PKG-CDE               PIC X(5).         01010013
011000         10  SN001I-TD102-SHIPT-QTY             PIC S9(7)         01020013
011100                                      COMP-3.                     01030013
011200         10  SN001I-TD106-WGHT-QUAL-CDE         PIC X(2).         01040013
011300         10  SN001I-TD107-WGHT-MSMT             PIC S9(9)V9(2)    01050013
011400                                      COMP-3.                     01060013
011500         10  SN001I-TD108-UM-CDE                PIC X(2).         01070013
011600         10  SN001I-TD1-FILLER                  PIC X(328).       01080013
011700*                                                                 01090013
011800     05  SN001I-TD4-SEGMENT                                       01100013
011900                                     REDEFINES                    01110013
012000         SN001I-SHIP-NOTICE-DTL-RECORD.                           01120013
012100         10  SN001I-TD4-ID                      PIC XXX.          01130013
012200         10  SN001I-TD401-CARR-SPECIAL-HAND     PIC X(3).         01140013
013100         10  SN001I-TD4-FILLER                  PIC X(344).       01150013
013110*                                                                 01160013
013120     05  SN001I-TD5-SEGMENT                                       01170013
013130                                     REDEFINES                    01180013
013140         SN001I-SHIP-NOTICE-DTL-RECORD.                           01190013
013150         10  SN001I-TD5-ID                      PIC XXX.          01200013
013160         10  SN001I-TD501-RTE-SEQ-CDE           PIC X(2).         01210013
013170         10  SN001I-TD502-CARR-ID-QUAL-CDE      PIC X(2).         01220013
013180         10  SN001I-TD503-CARR-ID-CDE           PIC X(17).        01230013
013190         10  SN001I-TD504-TRANS-MTHD-CDE        PIC X(2).         01240013
013191         10  SN001I-TD505-CARR-NME              PIC X(35).        01250013
013192         10  SN001I-TD506-STATUS-CDE            PIC X(2).         01260013
013193         10  SN001I-TD507-LOC-QUAL              PIC X(2).         01270013
013194         10  SN001I-TD508-LOC-ID                PIC X(30).        01280013
013195         10  SN001I-TD510-TRNS-TME-QUAL-CDE     PIC X(2).         01290013
013196         10  SN001I-TD511-TRNST-TIME            PIC S9(4)V9(5)    01300013
013197                                      COMP-3.                     01310013
013198         10  SN001I-TD5-FILLER                  PIC X(248).       01311013
013200*                                                                 01312013
013300     05  SN001I-TD3-SEGMENT                                       01313013
013400                                     REDEFINES                    01314013
013500         SN001I-SHIP-NOTICE-DTL-RECORD.                           01315013
013600         10  SN001I-TD3-ID                      PIC XXX.          01316013
013700         10  SN001I-TD301-EQUIP-CDE             PIC X(2).         01317013
013800         10  SN001I-TD302-EQUIP-INIT-CDE        PIC X(4).         01318013
013900         10  SN001I-TD303-EQUIP-NBR             PIC X(10).        01319013
014000         10  SN001I-TD3-FILLER                  PIC X(331).       01320013
014100*                                                                 01330013
014200     05  SN001I-REF-SEGMENT                                       01340013
014300                                     REDEFINES                    01350013
014400         SN001I-SHIP-NOTICE-DTL-RECORD.                           01360013
014500         10  SN001I-REF-ID                      PIC XXX.          01370013
014600         10  SN001I-REF01-NBR-QUAL-CDE          PIC X(2).         01380013
014700         10  SN001I-REF02-NBR                   PIC X(30).        01390013
014800         10  SN001I-REF-FILLER                  PIC X(315).       01400013
014900*                                                                 01410013
015000     05  SN001I-DTM-SEGMENT                                       01420013
015100                                     REDEFINES                    01430013
015200         SN001I-SHIP-NOTICE-DTL-RECORD.                           01440013
015300         10  SN001I-DTM-ID                      PIC XXX.          01450013
015400         10  SN001I-DTM01-DTE-QUAL-CDE          PIC X(3).         01460013
015500         10  SN001I-DTM02-DTE                   PIC 9(6).         01470013
015600         10  SN001I-DTM03-SHIP-TIME             PIC 9(4).         01480013
015700         10  SN001I-DTM-FILLER                  PIC X(334).       01490013
015800*                                                                 01500013
015900     05  SN001I-FOB-SEGMENT                                       01510013
016000                                     REDEFINES                    01520013
016100         SN001I-SHIP-NOTICE-DTL-RECORD.                           01530013
016200         10  SN001I-FOB-ID                      PIC XXX.          01540013
016300         10  SN001I-FOB01-SHIP-PAYT-TRM-CDE     PIC X(2).         01550013
016400         10  SN001I-FOB02-RESPBL-LOC-CDE        PIC X(2).         01560013
016500         10  SN001I-FOB03-RESPBL-LOC-DESC       PIC X(80).        01570013
016600         10  SN001I-FOB-FILLER                  PIC X(263).       01580013
016700*                                                                 01590013
016800     05  SN001I-N1-SEGMENT                                        01600013
016900                                     REDEFINES                    01610013
017000         SN001I-SHIP-NOTICE-DTL-RECORD.                           01620013
017100         10  SN001I-N1-ID                       PIC XXX.          01630013
017200         10  SN001I-N101-ID-CDE                 PIC X(2).         01640013
017300         10  SN001I-N102-CUST-NME               PIC X(35).        01650013
017400         10  SN001I-N103-NME-ID-QUAL-CDE        PIC X(2).         01660013
017500         10  SN001I-N104-NME-ID-CDE             PIC X(17).        01670013
017600         10  SN001I-N1-FILLER                   PIC X(291).       01680013
017700*                                                                 01690013
017800     05  SN001I-N2-SEGMENT                                        01700013
017900                                     REDEFINES                    01710013
018000         SN001I-SHIP-NOTICE-DTL-RECORD.                           01720013
018100         10  SN001I-N2-ID                       PIC XXX.          01730013
018200         10  SN001I-N201-NME1-TXT               PIC X(35).        01740013
018300         10  SN001I-N202-NME2-TXT               PIC X(35).        01750013
018400         10  SN001I-N2-FILLER                   PIC X(277).       01760013
018500*                                                                 01770013
018600     05  SN001I-N3-SEGMENT                                        01780013
018700                                     REDEFINES                    01790013
018800         SN001I-SHIP-NOTICE-DTL-RECORD.                           01800013
018900         10  SN001I-N3-ID                       PIC XXX.          01810013
019000         10  SN001I-N301-ADR1-TXT               PIC X(35).        01820013
019100         10  SN001I-N302-ADR2-TXT               PIC X(35).        01830013
019200         10  SN001I-N3-FILLER                   PIC X(277).       01840013
019300*                                                                 01850013
019400     05  SN001I-N4-SEGMENT                                        01860013
019500                                     REDEFINES                    01870013
019600         SN001I-SHIP-NOTICE-DTL-RECORD.                           01880013
019700         10  SN001I-N4-ID                       PIC XXX.          01890013
019800         10  SN001I-N401-CTY-NAME               PIC X(19).        01900013
019900         10  SN001I-N402-ST-CDE                 PIC X(2).         01910013
020000         10  SN001I-N403-ZIP-CDE                PIC X(9).         01920013
020100         10  SN001I-N404-CNTRY-CDE              PIC X(2).         01930013
020200         10  SN001I-N4-FILLER                   PIC X(315).       01940013
020300*                                                                 01950013
020400     05  SN001I-PRF-SEGMENT                                       01960013
020500                                     REDEFINES                    01970013
020600         SN001I-SHIP-NOTICE-DTL-RECORD.                           01980013
020700         10  SN001I-PRF-ID                      PIC XXX.          01990013
020800         10  SN001I-PRF01-PO-NBR                PIC X(22).        02000013
020900         10  SN001I-PRF03-PO-SEQ-NBR            PIC X(8).         02010013
021000         10  SN001I-PRF04-PO-DTE                PIC 9(6).         02020013
021100         10  SN001I-PRF-FILLER                  PIC X(311).       02030013
021200*                                                                 02040013
021300     05  SN001I-CUR-SEGMENT                                       02050013
021400                                     REDEFINES                    02060013
021500         SN001I-SHIP-NOTICE-DTL-RECORD.                           02070013
021600         10  SN001I-CUR-ID                      PIC XXX.          02080013
021700         10  SN001I-CUR01-ID-CDE                PIC X(2).         02090013
021800         10  SN001I-CUR02-CURR-CDE              PIC X(3).         02100013
021900         10  SN001I-CUR03-EXCH-FCTR             PIC S9(6)V9(5)    02110013
022000                                      COMP-3.                     02120013
022100         10  SN001I-CUR04-ID-CDE                PIC X(2).         02130013
022200         10  SN001I-CUR05-CURR-CDE              PIC X(3).         02140013
022300         10  SN001I-CUR-FILLER                  PIC X(331).       02150013
022400*                                                                 02160013
022500     05  SN001I-PKG-SEGMENT                                       02170013
022600                                     REDEFINES                    02180013
022700         SN001I-SHIP-NOTICE-DTL-RECORD.                           02190013
022800         10  SN001I-PKG-ID                      PIC XXX.          02200013
022900         10  SN001I-PKG01-TYP-CDE               PIC X(1).         02210013
023000         10  SN001I-PKG02-PKG-CDE               PIC X(5).         02220013
023100         10  SN001I-PKG03-QUAL-CDE              PIC X(2).         02230013
023200         10  SN001I-PKG04-DESC-CDE              PIC X(7).         02240013
023300         10  SN001I-PKG-FILLER                  PIC X(332).       02250013
023400*                                                                 02260013
023500     05  SN001I-MAN-SEGMENT                                       02270013
023600                                     REDEFINES                    02280013
023700         SN001I-SHIP-NOTICE-DTL-RECORD.                           02290013
023800         10  SN001I-MAN-ID                      PIC XXX.          02300013
023900         10  SN001I-MAN01-NBR-QUAL-CDE          PIC X(2).         02310013
024000         10  SN001I-MAN02-NBR                   PIC X(45).        02320013
024001*                                                                 02330013
024002* DMH 03/07/16 BEGIN (ADDED FOR OUTLET UPS TRACKING)              02340013
024010         10  SN001I-MAN04-NBR-QUAL-CDE          PIC X(2).         02350013
024020         10  SN001I-MAN05-NBR                   PIC X(45).        02360013
024100         10  SN001I-MAN-FILLER                  PIC X(253).       02370013
024110* DMH 03/07/16 END   (ADDED FOR OUTLET UPS TRACKING)              02380013
024200*                                                                 02390013
024300     05  SN001I-LIN-SEGMENT                                       02400013
024400                                     REDEFINES                    02410013
024500         SN001I-SHIP-NOTICE-DTL-RECORD.                           02420013
024600         10  SN001I-LIN-ID                      PIC XXX.          02430013
024700         10  SN001I-LIN01-ID-CDE                PIC X(6).         02440013
024800         10  SN001I-PROD-ID-GROUP  OCCURS    10.                  02450013
024900             15  SN001I-LIN02-PROD-ID-QUAL-CDE  PIC X(2).         02460013
025000             15  SN001I-LIN03-PROD-ID           PIC X(30).        02470013
025100         10  SN001I-FILLER                      PIC X(21).        02480013
025200*                                                                 02490013
025300     05  SN001I-SN1-SEGMENT                                       02500013
025400                                     REDEFINES                    02510013
025500         SN001I-SHIP-NOTICE-DTL-RECORD.                           02520013
025600         10  SN001I-SN1-ID                      PIC XXX.          02530013
025700         10  SN001I-SN101-ID-CDE                PIC X(6).         02540013
025800         10  SN001I-SN102-SHIP-QTY              PIC S9(7)         02550013
025900                                      COMP-3.                     02560013
026000         10  SN001I-SN103-SHIP-UM-CDE           PIC X(2).         02570013
026100         10  SN001I-SN104-SHIPT-DTE-QTY         PIC S9(7)         02580013
026200                                      COMP-3.                     02590013
026300         10  SN001I-SN105-ORD-QTY               PIC S9(7)         02600013
026400                                      COMP-3.                     02610013
026500         10  SN001I-SN106-ORD-UM-CDE            PIC X(2).         02620013
026600         10  SN001I-SN1-FILLER                  PIC X(325).       02630013
026700*                                                                 02640013
026800     05  SN001I-SLN-SEGMENT                                       02650013
026900                                     REDEFINES                    02660013
027000         SN001I-SHIP-NOTICE-DTL-RECORD.                           02670013
027100         10  SN001I-SLN-ID                      PIC XXX.          02680013
027200         10  SN001I-SLN01-ID                    PIC X(6).         02690013
027300         10  SN001I-SLN03-CONFIG-CDE            PIC X(1).         02700013
027400         10  SN001I-SLN04-QTY                   PIC S9(7)         02710013
027500                                      COMP-3.                     02720013
027600         10  SN001I-SLN05-UM-CDE                PIC X(2).         02730013
027700         10  SN001I-SLN06-UNIT-PRICE-AMT        PIC S9(9)V9(2)    02740013
027800                                      COMP-3.                     02750013
027900         10  SN001I-SLN07-UNIT-PRICE-CDE        PIC X(2).         02760013
028000         10  SN001I-SLN08-PRICE-CD              PIC X(1).         02770013
028100         10  SN001I-PROD-ID-GROUP  OCCURS    10.                  02780013
028200             15  SN001I-SLN09-PROD-ID-QUAL-CDE  PIC X(2).         02790013
028300             15  SN001I-SLN10-PROD-ID           PIC X(30).        02800013
028400         10  SN001I-SLN-FILLER                  PIC X(05).        02810013
028500                                                                  02820013
028600                                                                  02830013
