00001 ***************************************************************** 06/28/93
00002 *    RECORD PURPOSE: OUTPUT RECORD FOR THE ADVANCE SHIP NOTICE  * SNRD002O
00003 *                    NUMBERS THAT ARE READY FOR DELETION        *    LV002
00004 *    RECORD LENGTH:  5  BYTES                                   * SNRD002O
00005 *    RECORD FORMAT:  SEQUENTIAL                                 * SNRD002O
00006 ***************************************************************** SNRD002O
00007                                                                   SNRD002O
00008  01  SN002O-ASN-DELETE-RECORD.                                    SNRD002O
00009      05  SN002O-ASNHDR-ID        PIC S9(09) COMP.                    CL**2
00010      05  FILLER                  PIC X(01).                       SNRD002O
