00001 ***************************************************************** 06/29/93
00002 *    RECORD PURPOSE: OUTPUT RECORD FOR THE ADVANCE SHIP NOTICE  * SNRD002I
00003 *                    NUMBERS THAT ARE READY FOR DELETION        *    LV001
00004 *    RECORD LENGTH:  5  BYTES                                   * SNRD002I
00005 *    RECORD FORMAT:  SEQUENTIAL                                 * SNRD002I
00006 ***************************************************************** SNRD002I
00007                                                                   SNRD002I
00008  01  SN002I-ASN-DELETE-RECORD.                                    SNRD002I
00009      05  SN002I-ASNHDR-ID        PIC S9(09) COMP.                 SNRD002I
00010      05  FILLER                  PIC X(01).                       SNRD002I
