00001  01  SQLCA2.                                                      10/05/87
00002      05  SQLCODE2                PIC Z(8)9-.                      SQLCA2  
00003      05  SQLERRD3                PIC Z(8)9-.                         LV001
