      ***************************************************************   00010000
      * SSRD020 - RECORD LAYOUT FOR FILE TRN-CTG-SUM-FILE               00020005
      ***************************************************************   00030000
       01  SS020-TRN-CTG-SUM-RECORD.                                    00040002
           10 SS020-TRN-PARTN-NBR           PIC  S9(4) COMP.            00050002
           10 SS020-TRN-SUM-TYP-CDE         PIC  X(1).                  00060002
           10 SS020-TRN-SUM-CTG-CDE         PIC  X(3).                  00070002
           10 SS020-TRN-SUM-STRT-TM         PIC  X(8).                  00080002
           10 SS020-TRN-STR-NBR             PIC  S9(4) COMP.            00090002
C27938     10 SS020-TRN-DTE                 PIC  X(10).                 00100004
           10 SS020-TRN-SUM-END-TM          PIC  X(8).                  00110003
           10 SS020-TRN-CTG-TRN-QTY         PIC  S9(9) COMP.            00120002
           10 SS020-TRN-CTG-ITM-QTY         PIC  S9(9) COMP.            00130002
           10 SS020-TRN-CTG-AMT             PIC  S9(7)V9(2) COMP-3.     00140002
