000100 01  STORE-EXTRACT-LINE.                                          00010011
000200     05  SE-REGION                   PIC  X(02).                  00020011
000300     05  SE-STORE                    PIC  9(03).                  00030011
000400     05  SE-DIVISION-SEQNO           PIC  X(03).                  00040011
000500     05  SE-DEPT                     PIC  9(03).                  00050011
000600     05  SE-KEYREC                   PIC  X(08).                  00060011
000700     05  SE-PO                       PIC  9(08).                  00070011
000800     05  SE-INVOICE                  PIC  X(10).                  00080011
000900     05  SE-DATE-VERIFIED-COUNT      PIC  9(06).                  00090011
001000     05  FILLER REDEFINES SE-DATE-VERIFIED-COUNT.                 00100011
001100         10  SE-DV-MM                PIC  9(02).                  00110011
001200         10  SE-DV-DD                PIC  9(02).                  00120011
001300         10  SE-DV-YY                PIC  9(02).                  00130011
001400     05  SE-DATE-RECEIVED            PIC  9(06).                  00140011
001500     05  FILLER REDEFINES SE-DATE-RECEIVED.                       00150011
001600         10  SE-DR-MM                PIC  9(02).                  00160011
001700         10  SE-DR-DD                PIC  9(02).                  00170011
001800         10  SE-DR-YY                PIC  9(02).                  00180011
001900     05  SE-CLASS                    PIC  X(03).                  00190011
002000     05  SE-VENDOR-NAME-INHOUSE      PIC  X(25).                  00200011
002100     05  SE-VENDOR-NO-INHOUSE        PIC  X(03).                  00210011
002200     05  SE-VENDOR-NAME-DUNNS        PIC  X(25).                  00220011
002300     05  SE-VENDOR-NO-DUNNS          PIC  X(09).                  00230011
002400     05  SE-STYLE.                                                00240011
002500         10  FILLER                  PIC  X(01).                  00250011
002600         10  SE-SKU-SEQ              PIC  X(03).                  00260011
002700         10  FILLER                  PIC  X(01).                  00270011
002800     05  SE-UNIT-RETAIL              PIC  S9(07)V99.              00280011
002900     05  SE-LOWEST-RETAIL            PIC  S9(07)V99.              00290011
003000     05  SE-RETAIL-UNITS-ORDER       PIC  S9(06).                 00300011
003100     05  SE-RETAIL-UNITS-RECVD       PIC  S9(06).                 00310011
003200     05  SE-RETAIL-UNITS-MARK        PIC  S9(06).                 00320011
003300     05  SE-COST-EXTENSION           PIC  S9(07)V99.              00330011
003400     05  SE-RETAIL-EXTENSION         PIC  S9(07)V99.              00340011
003500     05  SE-PROCESSING-AREA          PIC  X(04).                  00350011
003600     05  SE-INVOICE-QTY-RETAIL       PIC  S9(06).                 00360011
003700     05  SE-CASH-DISCOUNT            PIC  X(04).                  00370011
003800     05  SE-DISCOUNT-DAYS            PIC  9(03).                  00380011
003900     05  SE-DISCOUNT-TERMS           PIC  X(01).                  00390011
004000     05  SE-EOM-INDICATOR            PIC  X(01).                  00400011
004100     05  SE-EXTEND-DATING            PIC  X(03).                  00410011
004200     05  SE-FREIGHT                  PIC  X(01).                  00420011
004300     05  SE-RECEIVING-LOCATION       PIC  X(02).                  00430011
004400     05  SE-POLINENO                 PIC  9(03).                  00440011
004500     05  SE-REC-SEQ-NBR              PIC  9(09).                  00450011
004600     05  SE-PROCESSING-AREA6         PIC  X(06).                  00460011
004700     05  SE-NOTIF-NBR                PIC  S9(9) COMP.             00470011
004800     05  SE-REC-SRC-CDE              PIC  X(1).                   00480011
004900         88 SE-ORIGINAL-RECEIPT     VALUE 'R'.                    00490011
005000         88 SE-ADJUSTMENT           VALUE 'A'.                    00500011
005100     05  SE-ADJ-CYC-NBR              PIC  S9(9) COMP.             00510011
005200     05  SE-OPER-UNT-ID              PIC  S9(4) COMP.             00520011
005300     05  SE-FCLTY-ID                 PIC  S9(4) COMP.             00530011
005400     05  SE-CURR-OPER-UNT-ID         PIC  S9(4) COMP.             00540011
005500     05  SE-CURR-FCLTY-ID            PIC  S9(4) COMP.             00550011
005600     05  SE-ACTL-UNIT-BK-DATE        PIC  X(10).                  00560011
005700     05  SE-PO-TYP-CDE               PIC  X(02).                  00570011
005800     05  SE-ENROUTE-IND              PIC  X(01).                  00580011
005900         88  SE-NO-INCL-ENROUTE                 VALUE IS 'N'.     00590011
006000     05  SE-SKU-NBR                  PIC  X(08).                  00600011
006100* THE FOLLOWING FIELD HAS BEEN ADDED TO HOLD THE EXPANDED         00610011
006200* STORE NUMBER - WHAT WAS PUT IN SE-STORE                         00620011
006300     05  SE-LOC-NBR                  PIC S9(04) COMP.             00630011
006400     05  SE-REC-TYP-CDE              PIC  X(02).                  00640011
006500         88  SE-REC-TYP-MDSE                    VALUE 'MR'.       00650011
006510         88  SE-REC-TYP-AP-CORRECT              VALUE 'AP'.       00651011
006520         88  SE-REC-TYP-DC-CREATE               VALUE 'DC'.       00652011
006530         88  SE-REC-TYP-EXPENSE                 VALUE 'EX'.       00653011
006540     05  SE-1ST-COST-EXTENSION       PIC  S9(07)V99.              00654011
006541     05  SE-CS-CONVRSON-IND          PIC  X(01).                  00654111
006542         88  SE-CS-CONVRSON                     VALUE IS 'Y'.     00654211
006550     05  FILLER                      PIC  X(32).                  00654311
