*********************************************************************** 00030001
*  TRAILER HISTORY LIST SCREEN                                          00030101
*********************************************************************** 00031001
        PRINT  NOGEN                                                    00040001
SUKM560 DFHMSD TYPE=DSECT,                                             X00050001
               LANG=COBOL,                                             X00060001
               MODE=INOUT,                                             X00070001
               STORAGE=AUTO,                                           X00080001
               TERM=3270-2,                                            X00090001
               TIOAPFX=YES                                              00100001
*********************************************************************** 00110001
SU560A  DFHMDI LINE=2,COLUMN=1,                                        X00120001
               SIZE=(19,80),                                           X00130001
               CTRL=(FREEKB),                                          X00140001
               MAPATTS=(COLOR,HILIGHT),                                X00150001
               DSATTS=(COLOR,HILIGHT)                                   00160001
*********************************************************************** 00170001
        DFHMDF POS=(02,01),                                            X00180001
               LENGTH=08,                                              X00190010
               ATTRB=(ASKIP,NORM),                                     X00200001
               COLOR=NEUTRAL,                                          X00210001
               INITIAL='OPER ID:'                                       00220010
AOPER   DFHMDF POS=(02,10),                                            X00230010
               LENGTH=04,                                              X00240001
               ATTRB=(ASKIP,NORM),                                     X00250001
               COLOR=BLUE                                               00260001
        DFHMDF POS=(02,16),                                            X00301011
               LENGTH=17,                                              X00302001
               ATTRB=(ASKIP,NORM),                                     X00303001
               COLOR=NEUTRAL,                                          X00304001
               INITIAL='TRAILER SERIAL #:'                              00304101
ATRLR   DFHMDF POS=(02,34),                                            X00305011
               LENGTH=09,                                              X00306001
               ATTRB=(ASKIP,NORM),                                     X00307001
               COLOR=BLUE                                               00308001
        DFHMDF POS=(02,45),                                            X00309011
               LENGTH=13,                                              X00309101
               ATTRB=(ASKIP,NORM),                                     X00309201
               COLOR=NEUTRAL,                                          X00309301
               INITIAL='SCAC/TRLR ID:'                                  00309401
ASCAC   DFHMDF POS=(02,59),                                            X00309511
               LENGTH=17,                                              X00309611
               ATTRB=(ASKIP,NORM),                                     X00309701
               COLOR=BLUE                                               00309801
        DFHMDF POS=(02,80),                                            X00310001
               LENGTH=01,                                              X00320001
               ATTRB=(ASKIP)                                            00330001
*********************************************************************** 00340001
        DFHMDF POS=(03,49),                                            X00350001
               LENGTH=05,                                              X00360001
               ATTRB=(ASKIP,NORM),                                     X00370001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00380001
ASTRTIT DFHMDF POS=(03,55),                                            X00390001
               LENGTH=05,                                              X00400001
               ATTRB=(NUM,UNPROT,NORM),                                X00410001
               COLOR=GREEN,                                            X00420001
               PICOUT='ZZZZ9',                                         X00430001
               HILIGHT=UNDERLINE                                        00440001
        DFHMDF POS=(03,61),                                            X00450001
               LENGTH=02,                                              X00460001
               ATTRB=(ASKIP,NORM),                                     X00470001
               COLOR=NEUTRAL,                                          X00480001
               INITIAL='TO'                                             00490001
AENDIT  DFHMDF POS=(03,64),                                            X00500001
               LENGTH=05,                                              X00510001
               ATTRB=(ASKIP,NORM),                                     X00520001
               COLOR=BLUE,                                             X00530001
               PICOUT='ZZZZ9'                                           00540001
        DFHMDF POS=(03,70),                                            X00550001
               LENGTH=02,                                              X00560001
               ATTRB=(ASKIP,NORM),                                     X00570001
               COLOR=NEUTRAL,                                          X00580001
               INITIAL='OF'                                             00590001
ATOTIT  DFHMDF POS=(03,73),                                            X00600001
               LENGTH=05,                                              X00610001
               ATTRB=(ASKIP,NORM),                                     X00620001
               COLOR=BLUE,                                             X00630001
               PICOUT='ZZZZ9'                                           00640001
*********************************************************************** 00650001
        DFHMDF POS=(05,08),                                            X00660001
               LENGTH=12,                                              X00670001
               ATTRB=(ASKIP,NORM),                                     X00680001
               COLOR=NEUTRAL,                                          X00690001
               INITIAL='OUTBOUND'                                       00700001
        DFHMDF POS=(05,42),                                            X00710001
               LENGTH=16,                                              X00720001
               ATTRB=(ASKIP,NORM),                                     X00730001
               COLOR=NEUTRAL,                                          X00740001
               INITIAL='-----STATUS-----'                               00750001
        DFHMDF POS=(05,68),                                            X00760004
               LENGTH=05,                                              X00770006
               ATTRB=(ASKIP,NORM),                                     X00780001
               COLOR=NEUTRAL,                                          X00790001
               INITIAL='DOOR/'                                          00800001
        DFHMDF POS=(05,75),                                            X00810001
               LENGTH=04,                                              X00820001
               ATTRB=(ASKIP,NORM),                                     X00830001
               COLOR=NEUTRAL,                                          X00840001
               INITIAL='DEST'                                           00850001
*********************************************************************** 00910001
        DFHMDF POS=(06,01),                                            X00920001
               LENGTH=27,                                              X00930001
               ATTRB=(ASKIP,NORM),                                     X00940001
               COLOR=NEUTRAL,                                          X00950001
               INITIAL='S ACT    TRIP   TRIP STATUS'                    00960001
        DFHMDF POS=(06,45),                                            X00970001
               LENGTH=33,                                              X00980001
               ATTRB=(ASKIP,NORM),                                     X00990001
               COLOR=NEUTRAL,                                          X01050001
               INITIAL='DATE    TIME  USER ID  SLOT   NBR'              01060001
*********************************************************************** 01070001
ASEL01  DFHMDF POS=(07,01),                                            X01080002
               LENGTH=01,                                              X01090001
               ATTRB=(UNPROT,NORM),                                    X01100001
               HILIGHT=UNDERLINE,                                      X01110001
               COLOR=GREEN                                              01120001
AACT01  DFHMDF POS=(07,03),                                            X01130002
               LENGTH=03,                                              X01140001
               ATTRB=(ASKIP,NORM),                                     X01150001
               COLOR=BLUE                                               01160001
ATRIP01 DFHMDF POS=(07,07),                                            X01220005
               LENGTH=09,                                              X01230001
               ATTRB=(ASKIP,NORM),                                     X01240001
               PICOUT='ZZZZZZZZZ',                                     X01250001
               COLOR=BLUE                                               01260001
ASTAT01 DFHMDF POS=(07,17),                                            X01270002
               LENGTH=24,                                              X01280008
               ATTRB=(ASKIP,NORM),                                     X01290001
               COLOR=BLUE                                               01300001
ADATE01 DFHMDF POS=(07,42),                                            X01310008
               LENGTH=10,                                              X01320001
               ATTRB=(ASKIP,NORM),                                     X01330001
               COLOR=BLUE                                               01340001
ATIME01 DFHMDF POS=(07,53),                                            X01350009
               LENGTH=05,                                              X01360001
               ATTRB=(ASKIP,NORM),                                     X01370001
               COLOR=BLUE                                               01380001
AUSER01 DFHMDF POS=(07,59),                                            X01390009
               LENGTH=08,                                              X01400001
               ATTRB=(ASKIP,NORM),                                     X01410001
               COLOR=BLUE                                               01430001
ADOOR01 DFHMDF POS=(07,68),                                            X01431009
               LENGTH=06,                                              X01432001
               ATTRB=(ASKIP,NORM),                                     X01433001
               COLOR=BLUE                                               01434001
ADEST01 DFHMDF POS=(07,75),                                            X01435009
               LENGTH=04,                                              X01436001
               ATTRB=(ASKIP,NORM),                                     X01437001
               COLOR=BLUE                                               01438001
*********************************************************************** 01439001
ASEL02  DFHMDF POS=(08,01),                                            X01439101
               LENGTH=01,                                              X01439201
               ATTRB=(UNPROT,NORM),                                    X01439301
               HILIGHT=UNDERLINE,                                      X01439401
               COLOR=GREEN                                              01439501
AACT02  DFHMDF POS=(08,03),                                            X01439601
               LENGTH=03,                                              X01439701
               ATTRB=(ASKIP,NORM),                                     X01439801
               COLOR=BLUE                                               01439901
ATRIP02 DFHMDF POS=(08,07),                                            X01440005
               LENGTH=09,                                              X01441001
               ATTRB=(ASKIP,NORM),                                     X01442001
               PICOUT='ZZZZZZZZZ',                                     X01443001
               COLOR=BLUE                                               01444001
ASTAT02 DFHMDF POS=(08,17),                                            X01445001
               LENGTH=24,                                              X01446008
               ATTRB=(ASKIP,NORM),                                     X01447001
               COLOR=BLUE                                               01448001
ADATE02 DFHMDF POS=(08,42),                                            X01449008
               LENGTH=10,                                              X01449101
               ATTRB=(ASKIP,NORM),                                     X01449201
               COLOR=BLUE                                               01449301
ATIME02 DFHMDF POS=(08,53),                                            X01449409
               LENGTH=05,                                              X01449501
               ATTRB=(ASKIP,NORM),                                     X01449601
               COLOR=BLUE                                               01449701
AUSER02 DFHMDF POS=(08,59),                                            X01449809
               LENGTH=08,                                              X01449901
               ATTRB=(ASKIP,NORM),                                     X01450001
               COLOR=BLUE                                               01451001
ADOOR02 DFHMDF POS=(08,68),                                            X01452009
               LENGTH=06,                                              X01453001
               ATTRB=(ASKIP,NORM),                                     X01454001
               COLOR=BLUE                                               01455001
ADEST02 DFHMDF POS=(08,75),                                            X01456009
               LENGTH=04,                                              X01457001
               ATTRB=(ASKIP,NORM),                                     X01458001
               COLOR=BLUE                                               01459001
*********************************************************************** 01459101
ASEL03  DFHMDF POS=(09,01),                                            X01459201
               LENGTH=01,                                              X01459301
               ATTRB=(UNPROT,NORM),                                    X01459401
               HILIGHT=UNDERLINE,                                      X01459501
               COLOR=GREEN                                              01459601
AACT03  DFHMDF POS=(09,03),                                            X01459701
               LENGTH=03,                                              X01459801
               ATTRB=(ASKIP,NORM),                                     X01459901
               COLOR=BLUE                                               01460001
ATRIP03 DFHMDF POS=(09,07),                                            X01461005
               LENGTH=09,                                              X01462001
               ATTRB=(ASKIP,NORM),                                     X01463001
               PICOUT='ZZZZZZZZZ',                                     X01464001
               COLOR=BLUE                                               01465001
ASTAT03 DFHMDF POS=(09,17),                                            X01466001
               LENGTH=24,                                              X01467008
               ATTRB=(ASKIP,NORM),                                     X01468001
               COLOR=BLUE                                               01469001
ADATE03 DFHMDF POS=(09,42),                                            X01469108
               LENGTH=10,                                              X01469201
               ATTRB=(ASKIP,NORM),                                     X01469301
               COLOR=BLUE                                               01469401
ATIME03 DFHMDF POS=(09,53),                                            X01469509
               LENGTH=05,                                              X01469601
               ATTRB=(ASKIP,NORM),                                     X01469701
               COLOR=BLUE                                               01469801
AUSER03 DFHMDF POS=(09,59),                                            X01469909
               LENGTH=08,                                              X01470001
               ATTRB=(ASKIP,NORM),                                     X01471001
               COLOR=BLUE                                               01472001
ADOOR03 DFHMDF POS=(09,68),                                            X01473009
               LENGTH=06,                                              X01474001
               ATTRB=(ASKIP,NORM),                                     X01475001
               COLOR=BLUE                                               01476001
ADEST03 DFHMDF POS=(09,75),                                            X01477009
               LENGTH=04,                                              X01478001
               ATTRB=(ASKIP,NORM),                                     X01479001
               COLOR=BLUE                                               01479101
*********************************************************************** 01479201
ASEL04  DFHMDF POS=(10,01),                                            X01479301
               LENGTH=01,                                              X01479401
               ATTRB=(UNPROT,NORM),                                    X01479501
               HILIGHT=UNDERLINE,                                      X01479601
               COLOR=GREEN                                              01479701
AACT04  DFHMDF POS=(10,03),                                            X01479801
               LENGTH=03,                                              X01479901
               ATTRB=(ASKIP,NORM),                                     X01480001
               COLOR=BLUE                                               01481001
ATRIP04 DFHMDF POS=(10,07),                                            X01482005
               LENGTH=09,                                              X01483001
               ATTRB=(ASKIP,NORM),                                     X01484001
               PICOUT='ZZZZZZZZZ',                                     X01485001
               COLOR=BLUE                                               01486001
ASTAT04 DFHMDF POS=(10,17),                                            X01487001
               LENGTH=24,                                              X01488008
               ATTRB=(ASKIP,NORM),                                     X01489001
               COLOR=BLUE                                               01489101
ADATE04 DFHMDF POS=(10,42),                                            X01489208
               LENGTH=10,                                              X01489301
               ATTRB=(ASKIP,NORM),                                     X01489401
               COLOR=BLUE                                               01489501
ATIME04 DFHMDF POS=(10,53),                                            X01489609
               LENGTH=05,                                              X01489701
               ATTRB=(ASKIP,NORM),                                     X01489801
               COLOR=BLUE                                               01489901
AUSER04 DFHMDF POS=(10,59),                                            X01490009
               LENGTH=08,                                              X01491001
               ATTRB=(ASKIP,NORM),                                     X01492001
               COLOR=BLUE                                               01493001
ADOOR04 DFHMDF POS=(10,68),                                            X01494009
               LENGTH=06,                                              X01495001
               ATTRB=(ASKIP,NORM),                                     X01496001
               COLOR=BLUE                                               01497001
ADEST04 DFHMDF POS=(10,75),                                            X01498009
               LENGTH=04,                                              X01499001
               ATTRB=(ASKIP,NORM),                                     X01499101
               COLOR=BLUE                                               01499201
*********************************************************************** 01499301
ASEL05  DFHMDF POS=(11,01),                                            X01499401
               LENGTH=01,                                              X01499501
               ATTRB=(UNPROT,NORM),                                    X01499601
               HILIGHT=UNDERLINE,                                      X01499701
               COLOR=GREEN                                              01499801
AACT05  DFHMDF POS=(11,03),                                            X01499901
               LENGTH=03,                                              X01500001
               ATTRB=(ASKIP,NORM),                                     X01501001
               COLOR=BLUE                                               01502001
ATRIP05 DFHMDF POS=(11,07),                                            X01503005
               LENGTH=09,                                              X01504001
               ATTRB=(ASKIP,NORM),                                     X01505001
               PICOUT='ZZZZZZZZZ',                                     X01506001
               COLOR=BLUE                                               01507001
ASTAT05 DFHMDF POS=(11,17),                                            X01508001
               LENGTH=24,                                              X01509008
               ATTRB=(ASKIP,NORM),                                     X01509101
               COLOR=BLUE                                               01509201
ADATE05 DFHMDF POS=(11,42),                                            X01509308
               LENGTH=10,                                              X01509401
               ATTRB=(ASKIP,NORM),                                     X01509501
               COLOR=BLUE                                               01509601
ATIME05 DFHMDF POS=(11,53),                                            X01509709
               LENGTH=05,                                              X01509801
               ATTRB=(ASKIP,NORM),                                     X01509901
               COLOR=BLUE                                               01510001
AUSER05 DFHMDF POS=(11,59),                                            X01511009
               LENGTH=08,                                              X01512001
               ATTRB=(ASKIP,NORM),                                     X01513001
               COLOR=BLUE                                               01514001
ADOOR05 DFHMDF POS=(11,68),                                            X01515009
               LENGTH=06,                                              X01516001
               ATTRB=(ASKIP,NORM),                                     X01517001
               COLOR=BLUE                                               01518001
ADEST05 DFHMDF POS=(11,75),                                            X01519009
               LENGTH=04,                                              X01519101
               ATTRB=(ASKIP,NORM),                                     X01519201
               COLOR=BLUE                                               01519301
*********************************************************************** 01519401
ASEL06  DFHMDF POS=(12,01),                                            X01519501
               LENGTH=01,                                              X01519601
               ATTRB=(UNPROT,NORM),                                    X01519701
               HILIGHT=UNDERLINE,                                      X01519801
               COLOR=GREEN                                              01519901
AACT06  DFHMDF POS=(12,03),                                            X01520001
               LENGTH=03,                                              X01521001
               ATTRB=(ASKIP,NORM),                                     X01522001
               COLOR=BLUE                                               01523001
ATRIP06 DFHMDF POS=(12,07),                                            X01524005
               LENGTH=09,                                              X01525001
               ATTRB=(ASKIP,NORM),                                     X01526001
               PICOUT='ZZZZZZZZZ',                                     X01527001
               COLOR=BLUE                                               01528001
ASTAT06 DFHMDF POS=(12,17),                                            X01529001
               LENGTH=24,                                              X01529108
               ATTRB=(ASKIP,NORM),                                     X01529201
               COLOR=BLUE                                               01529301
ADATE06 DFHMDF POS=(12,42),                                            X01529408
               LENGTH=10,                                              X01529501
               ATTRB=(ASKIP,NORM),                                     X01529601
               COLOR=BLUE                                               01529701
ATIME06 DFHMDF POS=(12,53),                                            X01529809
               LENGTH=05,                                              X01529901
               ATTRB=(ASKIP,NORM),                                     X01530001
               COLOR=BLUE                                               01531001
AUSER06 DFHMDF POS=(12,59),                                            X01532009
               LENGTH=08,                                              X01533001
               ATTRB=(ASKIP,NORM),                                     X01534001
               COLOR=BLUE                                               01535001
ADOOR06 DFHMDF POS=(12,68),                                            X01536009
               LENGTH=06,                                              X01537001
               ATTRB=(ASKIP,NORM),                                     X01538001
               COLOR=BLUE                                               01539001
ADEST06 DFHMDF POS=(12,75),                                            X01539109
               LENGTH=04,                                              X01539201
               ATTRB=(ASKIP,NORM),                                     X01539301
               COLOR=BLUE                                               01539401
*********************************************************************** 01539501
ASEL07  DFHMDF POS=(13,01),                                            X01539601
               LENGTH=01,                                              X01539701
               ATTRB=(UNPROT,NORM),                                    X01539801
               HILIGHT=UNDERLINE,                                      X01539901
               COLOR=GREEN                                              01540001
AACT07  DFHMDF POS=(13,03),                                            X01541001
               LENGTH=03,                                              X01542001
               ATTRB=(ASKIP,NORM),                                     X01543001
               COLOR=BLUE                                               01544001
ATRIP07 DFHMDF POS=(13,07),                                            X01545005
               LENGTH=09,                                              X01546001
               ATTRB=(ASKIP,NORM),                                     X01547001
               PICOUT='ZZZZZZZZZ',                                     X01548001
               COLOR=BLUE                                               01549001
ASTAT07 DFHMDF POS=(13,17),                                            X01549101
               LENGTH=24,                                              X01549208
               ATTRB=(ASKIP,NORM),                                     X01549301
               COLOR=BLUE                                               01549401
ADATE07 DFHMDF POS=(13,42),                                            X01549508
               LENGTH=10,                                              X01549601
               ATTRB=(ASKIP,NORM),                                     X01549701
               COLOR=BLUE                                               01549801
ATIME07 DFHMDF POS=(13,53),                                            X01549909
               LENGTH=05,                                              X01550001
               ATTRB=(ASKIP,NORM),                                     X01551001
               COLOR=BLUE                                               01552001
AUSER07 DFHMDF POS=(13,59),                                            X01553009
               LENGTH=08,                                              X01554001
               ATTRB=(ASKIP,NORM),                                     X01555001
               COLOR=BLUE                                               01556001
ADOOR07 DFHMDF POS=(13,68),                                            X01557009
               LENGTH=06,                                              X01558001
               ATTRB=(ASKIP,NORM),                                     X01559001
               COLOR=BLUE                                               01559101
ADEST07 DFHMDF POS=(13,75),                                            X01559209
               LENGTH=04,                                              X01559301
               ATTRB=(ASKIP,NORM),                                     X01559401
               COLOR=BLUE                                               01559501
*********************************************************************** 01559601
ASEL08  DFHMDF POS=(14,01),                                            X01559701
               LENGTH=01,                                              X01559801
               ATTRB=(UNPROT,NORM),                                    X01559901
               HILIGHT=UNDERLINE,                                      X01560001
               COLOR=GREEN                                              01561001
AACT08  DFHMDF POS=(14,03),                                            X01562001
               LENGTH=03,                                              X01563001
               ATTRB=(ASKIP,NORM),                                     X01564001
               COLOR=BLUE                                               01565001
ATRIP08 DFHMDF POS=(14,07),                                            X01566005
               LENGTH=09,                                              X01567001
               ATTRB=(ASKIP,NORM),                                     X01568001
               PICOUT='ZZZZZZZZZ',                                     X01569001
               COLOR=BLUE                                               01569101
ASTAT08 DFHMDF POS=(14,17),                                            X01569201
               LENGTH=24,                                              X01569308
               ATTRB=(ASKIP,NORM),                                     X01569401
               COLOR=BLUE                                               01569501
ADATE08 DFHMDF POS=(14,42),                                            X01569608
               LENGTH=10,                                              X01569701
               ATTRB=(ASKIP,NORM),                                     X01569801
               COLOR=BLUE                                               01569901
ATIME08 DFHMDF POS=(14,53),                                            X01570009
               LENGTH=05,                                              X01571001
               ATTRB=(ASKIP,NORM),                                     X01572001
               COLOR=BLUE                                               01573001
AUSER08 DFHMDF POS=(14,59),                                            X01574009
               LENGTH=08,                                              X01575001
               ATTRB=(ASKIP,NORM),                                     X01576001
               COLOR=BLUE                                               01577001
ADOOR08 DFHMDF POS=(14,68),                                            X01578009
               LENGTH=06,                                              X01579001
               ATTRB=(ASKIP,NORM),                                     X01579101
               COLOR=BLUE                                               01579201
ADEST08 DFHMDF POS=(14,75),                                            X01579309
               LENGTH=04,                                              X01579401
               ATTRB=(ASKIP,NORM),                                     X01579501
               COLOR=BLUE                                               01579601
*********************************************************************** 01579701
ASEL09  DFHMDF POS=(15,01),                                            X01579801
               LENGTH=01,                                              X01579901
               ATTRB=(UNPROT,NORM),                                    X01580001
               HILIGHT=UNDERLINE,                                      X01581001
               COLOR=GREEN                                              01582001
AACT09  DFHMDF POS=(15,03),                                            X01583001
               LENGTH=03,                                              X01584001
               ATTRB=(ASKIP,NORM),                                     X01585001
               COLOR=BLUE                                               01586001
ATRIP09 DFHMDF POS=(15,07),                                            X01587005
               LENGTH=09,                                              X01588001
               ATTRB=(ASKIP,NORM),                                     X01589001
               PICOUT='ZZZZZZZZZ',                                     X01589101
               COLOR=BLUE                                               01589201
ASTAT09 DFHMDF POS=(15,17),                                            X01589301
               LENGTH=24,                                              X01589408
               ATTRB=(ASKIP,NORM),                                     X01589501
               COLOR=BLUE                                               01589601
ADATE09 DFHMDF POS=(15,42),                                            X01589708
               LENGTH=10,                                              X01589801
               ATTRB=(ASKIP,NORM),                                     X01589901
               COLOR=BLUE                                               01590001
ATIME09 DFHMDF POS=(15,53),                                            X01591009
               LENGTH=05,                                              X01592001
               ATTRB=(ASKIP,NORM),                                     X01593001
               COLOR=BLUE                                               01594001
AUSER09 DFHMDF POS=(15,59),                                            X01595009
               LENGTH=08,                                              X01596001
               ATTRB=(ASKIP,NORM),                                     X01597001
               COLOR=BLUE                                               01598001
ADOOR09 DFHMDF POS=(15,68),                                            X01599009
               LENGTH=06,                                              X01599101
               ATTRB=(ASKIP,NORM),                                     X01599201
               COLOR=BLUE                                               01599301
ADEST09 DFHMDF POS=(15,75),                                            X01599409
               LENGTH=04,                                              X01599501
               ATTRB=(ASKIP,NORM),                                     X01599601
               COLOR=BLUE                                               01599701
*********************************************************************** 01599801
ASEL10  DFHMDF POS=(16,01),                                            X01599901
               LENGTH=01,                                              X01600001
               ATTRB=(UNPROT,NORM),                                    X01601001
               HILIGHT=UNDERLINE,                                      X01602001
               COLOR=GREEN                                              01603001
AACT10  DFHMDF POS=(16,03),                                            X01604001
               LENGTH=03,                                              X01605001
               ATTRB=(ASKIP,NORM),                                     X01606001
               COLOR=BLUE                                               01607001
ATRIP10 DFHMDF POS=(16,07),                                            X01608005
               LENGTH=09,                                              X01609001
               ATTRB=(ASKIP,NORM),                                     X01609101
               PICOUT='ZZZZZZZZZ',                                     X01609201
               COLOR=BLUE                                               01609301
ASTAT10 DFHMDF POS=(16,17),                                            X01609401
               LENGTH=24,                                              X01609508
               ATTRB=(ASKIP,NORM),                                     X01609601
               COLOR=BLUE                                               01609701
ADATE10 DFHMDF POS=(16,42),                                            X01609808
               LENGTH=10,                                              X01609901
               ATTRB=(ASKIP,NORM),                                     X01610001
               COLOR=BLUE                                               01611001
ATIME10 DFHMDF POS=(16,53),                                            X01612009
               LENGTH=05,                                              X01613001
               ATTRB=(ASKIP,NORM),                                     X01614001
               COLOR=BLUE                                               01615001
AUSER10 DFHMDF POS=(16,59),                                            X01616009
               LENGTH=08,                                              X01617001
               ATTRB=(ASKIP,NORM),                                     X01618001
               COLOR=BLUE                                               01619001
ADOOR10 DFHMDF POS=(16,68),                                            X01619109
               LENGTH=06,                                              X01619201
               ATTRB=(ASKIP,NORM),                                     X01619301
               COLOR=BLUE                                               01619401
ADEST10 DFHMDF POS=(16,75),                                            X01619509
               LENGTH=04,                                              X01619601
               ATTRB=(ASKIP,NORM),                                     X01619701
               COLOR=BLUE                                               01619801
*********************************************************************** 01619901
ASEL11  DFHMDF POS=(17,01),                                            X01620001
               LENGTH=01,                                              X01621001
               ATTRB=(UNPROT,NORM),                                    X01622001
               HILIGHT=UNDERLINE,                                      X01623001
               COLOR=GREEN                                              01624001
AACT11  DFHMDF POS=(17,03),                                            X01625001
               LENGTH=03,                                              X01626001
               ATTRB=(ASKIP,NORM),                                     X01627001
               COLOR=BLUE                                               01628001
ATRIP11 DFHMDF POS=(17,07),                                            X01629005
               LENGTH=09,                                              X01629101
               ATTRB=(ASKIP,NORM),                                     X01629201
               PICOUT='ZZZZZZZZZ',                                     X01629301
               COLOR=BLUE                                               01629401
ASTAT11 DFHMDF POS=(17,17),                                            X01629501
               LENGTH=24,                                              X01629608
               ATTRB=(ASKIP,NORM),                                     X01629701
               COLOR=BLUE                                               01629801
ADATE11 DFHMDF POS=(17,42),                                            X01629908
               LENGTH=10,                                              X01630001
               ATTRB=(ASKIP,NORM),                                     X01631001
               COLOR=BLUE                                               01632001
ATIME11 DFHMDF POS=(17,53),                                            X01633009
               LENGTH=05,                                              X01634001
               ATTRB=(ASKIP,NORM),                                     X01635001
               COLOR=BLUE                                               01636001
AUSER11 DFHMDF POS=(17,59),                                            X01637009
               LENGTH=08,                                              X01638001
               ATTRB=(ASKIP,NORM),                                     X01639001
               COLOR=BLUE                                               01639101
ADOOR11 DFHMDF POS=(17,68),                                            X01639209
               LENGTH=06,                                              X01639301
               ATTRB=(ASKIP,NORM),                                     X01639401
               COLOR=BLUE                                               01639501
ADEST11 DFHMDF POS=(17,75),                                            X01639609
               LENGTH=04,                                              X01639701
               ATTRB=(ASKIP,NORM),                                     X01639801
               COLOR=BLUE                                               01639901
*********************************************************************** 01640001
ASEL12  DFHMDF POS=(18,01),                                            X01641001
               LENGTH=01,                                              X01642001
               ATTRB=(UNPROT,NORM),                                    X01643001
               HILIGHT=UNDERLINE,                                      X01644001
               COLOR=GREEN                                              01645001
AACT12  DFHMDF POS=(18,03),                                            X01646001
               LENGTH=03,                                              X01647001
               ATTRB=(ASKIP,NORM),                                     X01648001
               COLOR=BLUE                                               01649001
ATRIP12 DFHMDF POS=(18,07),                                            X01649105
               LENGTH=09,                                              X01649201
               ATTRB=(ASKIP,NORM),                                     X01649301
               PICOUT='ZZZZZZZZZ',                                     X01649401
               COLOR=BLUE                                               01649501
ASTAT12 DFHMDF POS=(18,17),                                            X01649601
               LENGTH=24,                                              X01649708
               ATTRB=(ASKIP,NORM),                                     X01649801
               COLOR=BLUE                                               01649901
ADATE12 DFHMDF POS=(18,42),                                            X01650008
               LENGTH=10,                                              X01651001
               ATTRB=(ASKIP,NORM),                                     X01652001
               COLOR=BLUE                                               01653001
ATIME12 DFHMDF POS=(18,53),                                            X01654009
               LENGTH=05,                                              X01655001
               ATTRB=(ASKIP,NORM),                                     X01656001
               COLOR=BLUE                                               01657001
AUSER12 DFHMDF POS=(18,59),                                            X01658009
               LENGTH=08,                                              X01659001
               ATTRB=(ASKIP,NORM),                                     X01659101
               COLOR=BLUE                                               01659201
ADOOR12 DFHMDF POS=(18,68),                                            X01659309
               LENGTH=06,                                              X01659401
               ATTRB=(ASKIP,NORM),                                     X01659501
               COLOR=BLUE                                               01659601
ADEST12 DFHMDF POS=(18,75),                                            X01659709
               LENGTH=04,                                              X01659801
               ATTRB=(ASKIP,NORM),                                     X01659901
               COLOR=BLUE                                               01660001
*********************************************************************** 01670001
*********************************************************************** 05510001
*********************************************************************** 05520001
        DFHMDF POS=(19,45),                                            X05530001
               LENGTH=25,                                              X05540001
               ATTRB=(ASKIP,NORM),                                     X05550001
               COLOR=NEUTRAL,                                          X05560001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      05570001
ASELIT  DFHMDF POS=(19,72),                                            X05580001
               LENGTH=07,                                              X05590007
               ATTRB=(ASKIP,NORM),                                     X05600001
               COLOR=BLUE,                                             X05610001
               PICOUT='ZZZ,ZZ9'                                         05620001
        DFHMSD TYPE=FINAL                                               05630001
        END                                                             05640001
