*          DATA SET SUKM573    AT LEVEL 002 AS OF 04/13/00              00030001
        PRINT  NOGEN                                                    00040001
*-------------------------------------------------------------------*   00050001
*                                                                   *   00060001
*        MAPSET  SUKM573                                            *   00070001
*        MAP     SUK573                                             *   00080001
*        PROGRAM SUKCS573                                           *   00090001
*        TRANSID S573 - OUTBOUND TRIP ASSOCIATE LIST SCREEN         *   00100001
*                                                                   *   00110001
*-------------------------------------------------------------------*   00120001
SUKM573 DFHMSD TYPE=DSECT,                                             X00130001
               LANG=COBOL,                                             X00140001
               MODE=INOUT,                                             X00150001
               STORAGE=AUTO,                                           X00160001
               TERM=3270-2,                                            X00170001
               TIOAPFX=YES                                              00180001
*********************************************************************** 00190001
SU573A  DFHMDI LINE=2,COLUMN=1,                                        X00200001
               SIZE=(19,80),                                           X00210001
               CTRL=(FREEKB),                                          X00220001
               MAPATTS=(COLOR,HILIGHT),                                X00230001
               DSATTS=(COLOR,HILIGHT)                                   00240001
*********************************************************************** 00250001
        DFHMDF POS=(02,02),                                            X00260001
               LENGTH=12,                                              X00270001
               ATTRB=(ASKIP,NORM),                                     X00280001
               COLOR=NEUTRAL,                                          X00290001
               INITIAL='OPER ID....:'                                   00300001
AOPER   DFHMDF POS=(02,15),                                            X00310001
               LENGTH=04,                                              X00320001
               ATTRB=(ASKIP,NORM),                                     X00330001
               COLOR=BLUE                                               00340001
        DFHMDF POS=(02,26),                                            X00350018
               LENGTH=07,                                              X00360018
               ATTRB=(ASKIP,NORM),                                     X00370001
               COLOR=NEUTRAL,                                          X00380001
               INITIAL='SCAC..:'                                        00390018
ASCAC   DFHMDF POS=(02,34),                                            X00400018
               LENGTH=04,                                              X00410001
               ATTRB=(ASKIP,NORM),                                     X00420001
               COLOR=BLUE                                               00430001
        DFHMDF POS=(02,65),                                            X00440001
               LENGTH=08,                                              X00450001
               ATTRB=(ASKIP,NORM),                                     X00460001
               COLOR=NEUTRAL,                                          X00470001
               INITIAL='MANL LD:'                                       00480001
AMANUAL DFHMDF POS=(02,74),                                            X00490001
               LENGTH=06,                                              X00500001
               ATTRB=(ASKIP,NORM),                                     X00510001
               PICOUT='ZZZZZZ',                                        X00520001
               COLOR=BLUE                                               00530001
*********************************************************************** 00640001
        DFHMDF POS=(03,02),                                            X00650001
               LENGTH=12,                                              X00660001
               ATTRB=(ASKIP,NORM),                                     X00670001
               COLOR=NEUTRAL,                                          X00680001
               INITIAL='TRLR SRL #.:'                                   00690001
ATRLR   DFHMDF POS=(03,15),                                            X00700001
               LENGTH=09,                                              X00710001
               ATTRB=(ASKIP,NORM),                                     X00720001
               COLOR=BLUE                                               00730001
        DFHMDF POS=(03,26),                                            X00740018
               LENGTH=07,                                              X00750018
               ATTRB=(ASKIP,NORM),                                     X00760001
               COLOR=NEUTRAL,                                          X00770001
               INITIAL='TRLR..:'                                        00780018
ATRLRID DFHMDF POS=(03,34),                                            X00790018
               LENGTH=12,                                              X00800015
               ATTRB=(ASKIP,NORM),                                     X00810001
               COLOR=BLUE                                               00820001
        DFHMDF POS=(03,65),                                            X01021002
               LENGTH=08,                                              X01022001
               ATTRB=(ASKIP,NORM),                                     X01023001
               COLOR=NEUTRAL,                                          X01024001
               INITIAL='DVRT ON:'                                       01025001
ADIVERT DFHMDF POS=(03,74),                                            X01026002
               LENGTH=06,                                              X01027001
               ATTRB=(ASKIP,NORM),                                     X01028001
               PICOUT='ZZZZZZ',                                        X01029001
               COLOR=BLUE                                               01029101
*********************************************************************** 01030001
        DFHMDF POS=(04,02),                                            X01040001
               LENGTH=12,                                              X01050001
               ATTRB=(ASKIP,NORM),                                     X01060001
               COLOR=NEUTRAL,                                          X01070001
               INITIAL='OUTBND TRIP:'                                   01080001
ATRIP   DFHMDF POS=(04,15),                                            X01090001
               LENGTH=09,                                              X01100001
               ATTRB=(ASKIP,NORM),                                     X01110001
               COLOR=BLUE                                               01120001
        DFHMDF POS=(04,26),                                            X01121018
               LENGTH=07,                                              X01122018
               ATTRB=(ASKIP,NORM),                                     X01123001
               COLOR=NEUTRAL,                                          X01124001
               INITIAL='DOOR..:'                                        01125018
ADOOR   DFHMDF POS=(04,34),                                            X01170018
               LENGTH=06,                                              X01180001
               ATTRB=(ASKIP,NORM),                                     X01190001
               COLOR=BLUE                                               01200001
ADESC   DFHMDF POS=(04,42),                                            X01210018
               LENGTH=20,                                              X01220001
               ATTRB=(ASKIP,NORM),                                     X01230001
               COLOR=BLUE                                               01240001
        DFHMDF POS=(04,65),                                            X01250001
               LENGTH=08,                                              X01260001
               ATTRB=(ASKIP,NORM),                                     X01270001
               COLOR=NEUTRAL,                                          X01280001
               INITIAL='TOTAL..:'                                       01290001
ATOTAL  DFHMDF POS=(04,74),                                            X01300001
               LENGTH=06,                                              X01310001
               ATTRB=(ASKIP,NORM),                                     X01320001
               PICOUT='ZZZZZZ',                                        X01330001
               COLOR=BLUE                                               01340001
*********************************************************************** 01350001
        DFHMDF POS=(05,02),                                            X01360001
               LENGTH=12,                                              X01370001
               ATTRB=(ASKIP,NORM),                                     X01380001
               COLOR=NEUTRAL,INITIAL='TRIP DEST..:'                     01390001
ATRPDST DFHMDF POS=(05,15),                                            X01400001
               LENGTH=04,                                              X01410001
               ATTRB=(ASKIP,NORM),                                     X01420001
               COLOR=BLUE,                                             X01430001
               PICOUT='9999'                                            01440001
        DFHMDF POS=(05,26),                                            X01441018
               LENGTH=07,                                              X01442018
               ATTRB=(ASKIP,NORM),                                     X01443018
               COLOR=NEUTRAL,                                          X01444018
               INITIAL='STATUS:'                                        01445018
ASTAT   DFHMDF POS=(05,34),                                            X01446018
               LENGTH=15,                                              X01447018
               ATTRB=(ASKIP,NORM),                                     X01448018
               COLOR=BLUE                                               01449018
        DFHMDF POS=(05,51),                                            X01450018
               LENGTH=05,                                              X01460001
               ATTRB=(ASKIP,NORM),                                     X01470001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01480001
ASTRTIT DFHMDF POS=(05,57),                                            X01490018
               LENGTH=05,                                              X01500001
               ATTRB=(NUM,UNPROT,NORM),                                X01510001
               COLOR=GREEN,                                            X01520001
               PICOUT='ZZZZ9',                                         X01530001
               HILIGHT=UNDERLINE                                        01540001
        DFHMDF POS=(05,63),                                            X01550018
               LENGTH=02,                                              X01560001
               ATTRB=(ASKIP,NORM),                                     X01570001
               COLOR=NEUTRAL,                                          X01580001
               INITIAL='TO'                                             01590001
AENDIT  DFHMDF POS=(05,66),                                            X01600018
               LENGTH=05,                                              X01610001
               ATTRB=(ASKIP,NORM),                                     X01620001
               COLOR=BLUE,                                             X01630001
               PICOUT='ZZZZ9'                                           01640001
        DFHMDF POS=(05,72),                                            X01650018
               LENGTH=02,                                              X01660001
               ATTRB=(ASKIP,NORM),                                     X01670001
               COLOR=NEUTRAL,                                          X01680001
               INITIAL='OF'                                             01690001
ATOTIT  DFHMDF POS=(05,75),                                            X01700018
               LENGTH=05,                                              X01710001
               ATTRB=(ASKIP,NORM),                                     X01720001
               COLOR=BLUE,                                             X01730001
               PICOUT='ZZZZ9'                                           01740001
*********************************************************************** 01750001
        DFHMDF POS=(07,02),                                            X01760006
               LENGTH=07,                                              X01770016
               ATTRB=(ASKIP,NORM),                                     X01780001
               COLOR=NEUTRAL,                                          X01790001
               INITIAL='USER ID'                                        01800011
        DFHMDF POS=(07,13),                                            X01810016
               LENGTH=04,                                              X01820013
               ATTRB=(ASKIP,NORM),                                     X01830001
               COLOR=NEUTRAL,                                          X01840001
               INITIAL='NAME'                                           01850013
        DFHMDF POS=(07,48),                                            X01851016
               LENGTH=08,                                              X01852016
               ATTRB=(ASKIP,NORM),                                     X01853016
               COLOR=NEUTRAL,                                          X01854016
               INITIAL='FUNCTION'                                       01855016
        DFHMDF POS=(07,65),                                            X01860016
               LENGTH=14,                                              X01870016
               ATTRB=(ASKIP,NORM),                                     X01880013
               COLOR=NEUTRAL,                                          X01881013
               INITIAL='DATE      TIME'                                 01882016
*********************************************************************** 01890001
AUSER01 DFHMDF POS=(08,02),                                            X02150011
               LENGTH=08,                                              X02160001
               ATTRB=(ASKIP,NORM),                                     X02170001
               COLOR=BLUE                                               02180001
ANAME01 DFHMDF POS=(08,12),                                            X02181016
               LENGTH=30,                                              X02182013
               ATTRB=(ASKIP,NORM),                                     X02183013
               COLOR=BLUE                                               02184013
AFUNC01 DFHMDF POS=(08,45),                                            X02185016
               LENGTH=15,                                              X02186017
               ATTRB=(ASKIP,NORM),                                     X02187016
               COLOR=BLUE                                               02188016
ADATE01 DFHMDF POS=(08,62),                                            X02190016
               LENGTH=10,                                              X02200001
               ATTRB=(ASKIP,NORM),                                     X02210001
               COLOR=BLUE                                               02220001
ATIME01 DFHMDF POS=(08,75),                                            X02230016
               LENGTH=05,                                              X02240001
               ATTRB=(ASKIP,NORM),                                     X02250001
               COLOR=BLUE                                               02260001
*********************************************************************** 02270016
AUSER02 DFHMDF POS=(09,02),                                            X02280016
               LENGTH=08,                                              X02290016
               ATTRB=(ASKIP,NORM),                                     X02300016
               COLOR=BLUE                                               02310016
ANAME02 DFHMDF POS=(09,12),                                            X02320016
               LENGTH=30,                                              X02330016
               ATTRB=(ASKIP,NORM),                                     X02340016
               COLOR=BLUE                                               02350016
AFUNC02 DFHMDF POS=(09,45),                                            X02360016
               LENGTH=15,                                              X02370017
               ATTRB=(ASKIP,NORM),                                     X02380016
               COLOR=BLUE                                               02390016
ADATE02 DFHMDF POS=(09,62),                                            X02400016
               LENGTH=10,                                              X02410016
               ATTRB=(ASKIP,NORM),                                     X02420016
               COLOR=BLUE                                               02430016
ATIME02 DFHMDF POS=(09,75),                                            X02440016
               LENGTH=05,                                              X02450016
               ATTRB=(ASKIP,NORM),                                     X02460016
               COLOR=BLUE                                               02470016
*********************************************************************** 02480016
AUSER03 DFHMDF POS=(10,02),                                            X02490016
               LENGTH=08,                                              X02500016
               ATTRB=(ASKIP,NORM),                                     X02510016
               COLOR=BLUE                                               02520016
ANAME03 DFHMDF POS=(10,12),                                            X02530016
               LENGTH=30,                                              X02540016
               ATTRB=(ASKIP,NORM),                                     X02550016
               COLOR=BLUE                                               02560016
AFUNC03 DFHMDF POS=(10,45),                                            X02570016
               LENGTH=15,                                              X02580017
               ATTRB=(ASKIP,NORM),                                     X02590016
               COLOR=BLUE                                               02600016
ADATE03 DFHMDF POS=(10,62),                                            X02610016
               LENGTH=10,                                              X02620016
               ATTRB=(ASKIP,NORM),                                     X02630016
               COLOR=BLUE                                               02640016
ATIME03 DFHMDF POS=(10,75),                                            X02650016
               LENGTH=05,                                              X02660016
               ATTRB=(ASKIP,NORM),                                     X02670016
               COLOR=BLUE                                               02680016
*********************************************************************** 02690016
AUSER04 DFHMDF POS=(11,02),                                            X02700016
               LENGTH=08,                                              X02710016
               ATTRB=(ASKIP,NORM),                                     X02720016
               COLOR=BLUE                                               02730016
ANAME04 DFHMDF POS=(11,12),                                            X02740016
               LENGTH=30,                                              X02750016
               ATTRB=(ASKIP,NORM),                                     X02760016
               COLOR=BLUE                                               02770016
AFUNC04 DFHMDF POS=(11,45),                                            X02780016
               LENGTH=15,                                              X02790017
               ATTRB=(ASKIP,NORM),                                     X02800016
               COLOR=BLUE                                               02810016
ADATE04 DFHMDF POS=(11,62),                                            X02820016
               LENGTH=10,                                              X02830016
               ATTRB=(ASKIP,NORM),                                     X02840016
               COLOR=BLUE                                               02850016
ATIME04 DFHMDF POS=(11,75),                                            X02860016
               LENGTH=05,                                              X02870016
               ATTRB=(ASKIP,NORM),                                     X02880016
               COLOR=BLUE                                               02890016
*********************************************************************** 02900016
AUSER05 DFHMDF POS=(12,02),                                            X02910016
               LENGTH=08,                                              X02920016
               ATTRB=(ASKIP,NORM),                                     X02930016
               COLOR=BLUE                                               02940016
ANAME05 DFHMDF POS=(12,12),                                            X02950016
               LENGTH=30,                                              X02960016
               ATTRB=(ASKIP,NORM),                                     X02970016
               COLOR=BLUE                                               02980016
AFUNC05 DFHMDF POS=(12,45),                                            X02990016
               LENGTH=15,                                              X03000017
               ATTRB=(ASKIP,NORM),                                     X03010016
               COLOR=BLUE                                               03020016
ADATE05 DFHMDF POS=(12,62),                                            X03030016
               LENGTH=10,                                              X03040016
               ATTRB=(ASKIP,NORM),                                     X03050016
               COLOR=BLUE                                               03060016
ATIME05 DFHMDF POS=(12,75),                                            X03070016
               LENGTH=05,                                              X03080016
               ATTRB=(ASKIP,NORM),                                     X03090016
               COLOR=BLUE                                               03100016
*********************************************************************** 03110016
AUSER06 DFHMDF POS=(13,02),                                            X03120016
               LENGTH=08,                                              X03130016
               ATTRB=(ASKIP,NORM),                                     X03140016
               COLOR=BLUE                                               03150016
ANAME06 DFHMDF POS=(13,12),                                            X03160016
               LENGTH=30,                                              X03170016
               ATTRB=(ASKIP,NORM),                                     X03180016
               COLOR=BLUE                                               03190016
AFUNC06 DFHMDF POS=(13,45),                                            X03200016
               LENGTH=15,                                              X03210017
               ATTRB=(ASKIP,NORM),                                     X03220016
               COLOR=BLUE                                               03230016
ADATE06 DFHMDF POS=(13,62),                                            X03240016
               LENGTH=10,                                              X03250016
               ATTRB=(ASKIP,NORM),                                     X03260016
               COLOR=BLUE                                               03270016
ATIME06 DFHMDF POS=(13,75),                                            X03280016
               LENGTH=05,                                              X03290016
               ATTRB=(ASKIP,NORM),                                     X03300016
               COLOR=BLUE                                               03310016
*********************************************************************** 03320016
AUSER07 DFHMDF POS=(14,02),                                            X03330016
               LENGTH=08,                                              X03340016
               ATTRB=(ASKIP,NORM),                                     X03350016
               COLOR=BLUE                                               03360016
ANAME07 DFHMDF POS=(14,12),                                            X03370016
               LENGTH=30,                                              X03380016
               ATTRB=(ASKIP,NORM),                                     X03390016
               COLOR=BLUE                                               03400016
AFUNC07 DFHMDF POS=(14,45),                                            X03410016
               LENGTH=15,                                              X03420017
               ATTRB=(ASKIP,NORM),                                     X03430016
               COLOR=BLUE                                               03440016
ADATE07 DFHMDF POS=(14,62),                                            X03450016
               LENGTH=10,                                              X03460016
               ATTRB=(ASKIP,NORM),                                     X03470016
               COLOR=BLUE                                               03480016
ATIME07 DFHMDF POS=(14,75),                                            X03490016
               LENGTH=05,                                              X03500016
               ATTRB=(ASKIP,NORM),                                     X03510016
               COLOR=BLUE                                               03520016
*********************************************************************** 03530016
AUSER08 DFHMDF POS=(15,02),                                            X03540016
               LENGTH=08,                                              X03550016
               ATTRB=(ASKIP,NORM),                                     X03560016
               COLOR=BLUE                                               03570016
ANAME08 DFHMDF POS=(15,12),                                            X03580016
               LENGTH=30,                                              X03590016
               ATTRB=(ASKIP,NORM),                                     X03600016
               COLOR=BLUE                                               03610016
AFUNC08 DFHMDF POS=(15,45),                                            X03620016
               LENGTH=15,                                              X03630017
               ATTRB=(ASKIP,NORM),                                     X03640016
               COLOR=BLUE                                               03650016
ADATE08 DFHMDF POS=(15,62),                                            X03660016
               LENGTH=10,                                              X03670016
               ATTRB=(ASKIP,NORM),                                     X03680016
               COLOR=BLUE                                               03690016
ATIME08 DFHMDF POS=(15,75),                                            X03700016
               LENGTH=05,                                              X03710016
               ATTRB=(ASKIP,NORM),                                     X03720016
               COLOR=BLUE                                               03730016
*********************************************************************** 03740016
AUSER09 DFHMDF POS=(16,02),                                            X03750016
               LENGTH=08,                                              X03760016
               ATTRB=(ASKIP,NORM),                                     X03770016
               COLOR=BLUE                                               03780016
ANAME09 DFHMDF POS=(16,12),                                            X03790016
               LENGTH=30,                                              X03800016
               ATTRB=(ASKIP,NORM),                                     X03810016
               COLOR=BLUE                                               03820016
AFUNC09 DFHMDF POS=(16,45),                                            X03830016
               LENGTH=15,                                              X03840017
               ATTRB=(ASKIP,NORM),                                     X03850016
               COLOR=BLUE                                               03860016
ADATE09 DFHMDF POS=(16,62),                                            X03870016
               LENGTH=10,                                              X03880016
               ATTRB=(ASKIP,NORM),                                     X03890016
               COLOR=BLUE                                               03900016
ATIME09 DFHMDF POS=(16,75),                                            X03910016
               LENGTH=05,                                              X03920016
               ATTRB=(ASKIP,NORM),                                     X03930016
               COLOR=BLUE                                               03940016
*********************************************************************** 03950016
AUSER10 DFHMDF POS=(17,02),                                            X03960016
               LENGTH=08,                                              X03970016
               ATTRB=(ASKIP,NORM),                                     X03980016
               COLOR=BLUE                                               03990016
ANAME10 DFHMDF POS=(17,12),                                            X04000016
               LENGTH=30,                                              X04010016
               ATTRB=(ASKIP,NORM),                                     X04020016
               COLOR=BLUE                                               04030016
AFUNC10 DFHMDF POS=(17,45),                                            X04040016
               LENGTH=15,                                              X04050017
               ATTRB=(ASKIP,NORM),                                     X04060016
               COLOR=BLUE                                               04070016
ADATE10 DFHMDF POS=(17,62),                                            X04080016
               LENGTH=10,                                              X04090016
               ATTRB=(ASKIP,NORM),                                     X04100016
               COLOR=BLUE                                               04110016
ATIME10 DFHMDF POS=(17,75),                                            X04120016
               LENGTH=05,                                              X04130016
               ATTRB=(ASKIP,NORM),                                     X04140016
               COLOR=BLUE                                               04150016
*********************************************************************** 04160016
AUSER11 DFHMDF POS=(18,02),                                            X04170016
               LENGTH=08,                                              X04180016
               ATTRB=(ASKIP,NORM),                                     X04190016
               COLOR=BLUE                                               04200016
ANAME11 DFHMDF POS=(18,12),                                            X04210016
               LENGTH=30,                                              X04220016
               ATTRB=(ASKIP,NORM),                                     X04230016
               COLOR=BLUE                                               04240016
AFUNC11 DFHMDF POS=(18,45),                                            X04250016
               LENGTH=15,                                              X04260017
               ATTRB=(ASKIP,NORM),                                     X04270016
               COLOR=BLUE                                               04280016
ADATE11 DFHMDF POS=(18,62),                                            X04290016
               LENGTH=10,                                              X04300016
               ATTRB=(ASKIP,NORM),                                     X04310016
               COLOR=BLUE                                               04320016
ATIME11 DFHMDF POS=(18,75),                                            X04330016
               LENGTH=05,                                              X04340016
               ATTRB=(ASKIP,NORM),                                     X04350016
               COLOR=BLUE                                               04360016
*********************************************************************** 04470001
*********************************************************************** 07120001
        DFHMDF POS=(19,45),                                            X07130001
               LENGTH=25,                                              X07140001
               ATTRB=(ASKIP,NORM),                                     X07150001
               COLOR=NEUTRAL,                                          X07160001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      07170001
ASELIT  DFHMDF POS=(19,72),                                            X07180001
               LENGTH=07,                                              X07190001
               ATTRB=(ASKIP,NORM),                                     X07200001
               COLOR=BLUE,                                             X07210001
               PICOUT='ZZZ,ZZ9'                                         07220001
        DFHMSD TYPE=FINAL                                               07230001
        END                                                             07240001
