*          DATA SET SUKM794                                             00010000
        PRINT  NOGEN                                                    00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  SUKM794                                            *   00050000
*        MAP     SUK794                                             *   00060000
*        PROGRAM SUKCS794                                           *   00070000
*        TRANSID S794 - PRINT AND APPLY DOOR TRIP LIST              *   00080000
*                                                                   *   00090000
*-------------------------------------------------------------------*   00100000
SUKM794 DFHMSD TYPE=DSECT,                                             X00110000
               LANG=COBOL,                                             X00120000
               MODE=INOUT,                                             X00130000
               STORAGE=AUTO,                                           X00140000
               TERM=3270-2,                                            X00150000
               TIOAPFX=YES                                              00160000
**********************************************************************  00170000
SUK794  DFHMDI LINE=2,COLUMN=1,                                        X00180000
               SIZE=(19,80),                                           X00190000
               CTRL=(FREEKB),                                          X00200000
               MAPATTS=(COLOR,HILIGHT),                                X00210000
               DSATTS=(COLOR,HILIGHT)                                   00220000
**********************************************************************  00230000
**********************************************************************  00240000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00250000
               INITIAL='OPER UNIT..............:',                     X00260000
               COLOR=NEUTRAL,                                          X00270000
               LENGTH=24,                                              X00280000
               POS=(02,02)                                              00290000
AOPRUNT  DFHMDF POS=(02,27),                                           X00300000
               LENGTH=4,                                               X00310000
               COLOR=BLUE,                                             X00320000
               ATTRB=(ASKIP)                                            00330000
AOPRNME  DFHMDF POS=(02,34),                                           X00340000
               LENGTH=25,                                              X00350000
               COLOR=BLUE,                                             X00360000
               ATTRB=(ASKIP)                                            00370000
        DFHMDF ATTRB=(ASKIP),                                          X00380000
               LENGTH=1,                                               X00390000
               POS=(02,61)                                              00400000
*******************************************************************     00410000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00420000
               INITIAL='PRINT AND APPLY STATION:',                     X00430000
               COLOR=NEUTRAL,                                          X00440000
               LENGTH=24,                                              X00450000
               POS=(03,02)                                              00460000
ASTANBR  DFHMDF POS=(03,27),                                           X00470000
               LENGTH=4,                                               X00480000
               COLOR=BLUE,                                             X00490000
               ATTRB=(ASKIP)                                            00500000
*******************************************************************     00510000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00520000
               INITIAL='CHOSEN DATE RANGE......: BEGIN',               X00530000
               COLOR=NEUTRAL,                                          X00540000
               LENGTH=30,                                              X00550000
               POS=(04,02)                                              00560000
ABEGDTE  DFHMDF POS=(04,33),                                           X00570000
               LENGTH=10,                                              X00580000
               COLOR=BLUE,                                             X00590000
               ATTRB=(ASKIP)                                            00600000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00610000
               INITIAL='END ',                                         X00620000
               COLOR=NEUTRAL,                                          X00630000
               LENGTH=04,                                              X00640000
               POS=(04,48)                                              00650000
AENDDTE  DFHMDF POS=(04,53),                                           X00660000
               LENGTH=10,                                              X00670000
               COLOR=BLUE,                                             X00680000
               ATTRB=(ASKIP)                                            00690000
*******************************************************************     00700000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00710000
               INITIAL='YELLOW INDICATES.......:',                     X00720000
               COLOR=YELLOW,                                           X00730000
               LENGTH=24,                                              X00740000
               POS=(05,02)                                              00750000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00760000
               INITIAL='TRIP ID = MULTIPLE USER ID"S WORKED',          X00770000
               COLOR=YELLOW,                                           X00780000
               LENGTH=35,                                              X00790000
               POS=(05,27)                                              00800000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00810000
               INITIAL='THIS TRAILER',                                 X00820000
               COLOR=YELLOW,                                           X00830000
               LENGTH=12,                                              X00840000
               POS=(05,63)                                              00850000
*******************************************************************     00860000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00870000
               INITIAL='TRAILER = AVAILABLE FOR ASSIGNMENT',           X00880000
               COLOR=YELLOW,                                           X00890000
               LENGTH=34,                                              X00900000
               POS=(06,27)                                              00910000
*******************************************************************     00920000
         DFHMDF POS=(07,51),                                           X00930000
               LENGTH=05,                                              X00940000
               ATTRB=(ASKIP,NORM),                                     X00950000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00960000
ASTRTIT  DFHMDF POS=(07,57),                                           X00970000
               LENGTH=05,                                              X00980000
               ATTRB=(NUM,UNPROT,NORM),                                X00990000
               COLOR=GREEN,                                            X01000000
               PICOUT='ZZZZ9',                                         X01010000
               HILIGHT=UNDERLINE                                        01020000
         DFHMDF POS=(07,63),                                           X01030000
               LENGTH=02,                                              X01040000
               ATTRB=(ASKIP,NORM),                                     X01050000
               COLOR=NEUTRAL,                                          X01060000
               INITIAL='TO'                                             01070000
AENDIT   DFHMDF POS=(07,66),                                           X01080000
               LENGTH=05,                                              X01090000
               ATTRB=(ASKIP,NORM),                                     X01100000
               COLOR=BLUE,                                             X01110000
               PICOUT='ZZZZ9'                                           01120000
         DFHMDF POS=(07,72),                                           X01130000
               LENGTH=02,                                              X01140000
               ATTRB=(ASKIP,NORM),                                     X01150000
               COLOR=NEUTRAL,                                          X01160000
               INITIAL='OF'                                             01170000
ATOTIT  DFHMDF POS=(07,75),                                            X01180000
               LENGTH=05,                                              X01190000
               ATTRB=(ASKIP,NORM),                                     X01200000
               COLOR=BLUE,                                             X01210000
               PICOUT='ZZZZ9'                                           01220000
*******************************************************************     01230000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01240000
               INITIAL='       DOOR                ACTV         ',     X01250000
               COLOR=NEUTRAL,                                          X01260000
               LENGTH=40,                                              X01270000
               POS=(08,02)                                              01280000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01290000
               INITIAL=' DOOR ASSIGNED      DOOR UNASSIGNED  ',        X01300000
               COLOR=NEUTRAL,                                          X01310000
               LENGTH=37,                                              X01320000
               POS=(08,43)                                              01330000
*******************************************************************     01340000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01350000
               INITIAL='S   ACT  ID  SCAC  TRAILER  IND TRIP ID ',     X01360000
               COLOR=NEUTRAL,                                          X01370000
               LENGTH=40,                                              X01380000
               POS=(09,01)                                              01390000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X01400000
               INITIAL='--DATE-- --TIME--  --DATE-- --TIME-- ',        X01410000
               COLOR=NEUTRAL,                                          X01420000
               LENGTH=37,                                              X01430000
               POS=(09,42)                                              01440000
**********************************************************************  01450000
ASEL01  DFHMDF POS=(10,001),                                           X01460000
               COLOR=GREEN,                                            X01470000
               HILIGHT=UNDERLINE,                                      X01480000
               ATTRB=(UNPROT,NORM),                                    X01490000
               LENGTH=001                                               01500000
        DFHMDF POS=(10,003),                                           X01510000
               ATTRB=(ASKIP,NORM),                                     X01520000
               LENGTH=001                                               01530000
AACT01  DFHMDF POS=(10,005),                                           X01540000
               ATTRB=(ASKIP,NORM),                                     X01550000
               LENGTH=003                                               01560000
ADRID01 DFHMDF POS=(10,009),                                           X01570000
               COLOR=BLUE,                                             X01580000
               ATTRB=(ASKIP,NORM),                                     X01590000
               LENGTH=004                                               01600000
ASCAC01 DFHMDF POS=(10,014),                                           X01610000
               COLOR=BLUE,                                             X01620000
               ATTRB=(ASKIP,NORM),                                     X01630000
               LENGTH=004                                               01640000
ATRLR01 DFHMDF POS=(10,019),                                           X01650000
               COLOR=BLUE,                                             X01660000
               ATTRB=(ASKIP,NORM),                                     X01670000
               LENGTH=010                                               01680000
AACTV01 DFHMDF POS=(10,030),                                           X01690000
               COLOR=BLUE,                                             X01700000
               ATTRB=(ASKIP,NORM),                                     X01710000
               LENGTH=001                                               01720000
ATRIP01 DFHMDF POS=(10,032),                                           X01730000
               COLOR=BLUE,                                             X01740000
               ATTRB=(ASKIP,NORM),                                     X01750000
               LENGTH=009                                               01760000
ADTEA01 DFHMDF POS=(10,042),                                           X01770000
               COLOR=BLUE,                                             X01780000
               ATTRB=(ASKIP,NORM),                                     X01790000
               LENGTH=008                                               01800000
ATMEA01 DFHMDF POS=(10,051),                                           X01810000
               COLOR=BLUE,                                             X01820000
               ATTRB=(ASKIP,NORM),                                     X01830000
               LENGTH=008                                               01840000
ADTEU01 DFHMDF POS=(10,061),                                           X01850000
               COLOR=BLUE,                                             X01860000
               ATTRB=(ASKIP,NORM),                                     X01870000
               LENGTH=008                                               01880000
ATMEU01 DFHMDF POS=(10,070),                                           X01890000
               COLOR=BLUE,                                             X01900000
               ATTRB=(ASKIP,NORM),                                     X01910000
               LENGTH=008                                               01920000
**********************************************************************  01930000
ASEL02  DFHMDF POS=(11,001),                                           X01940000
               COLOR=GREEN,                                            X01950000
               HILIGHT=UNDERLINE,                                      X01960000
               ATTRB=(UNPROT,NORM),                                    X01970000
               LENGTH=001                                               01980000
        DFHMDF POS=(11,003),                                           X01990000
               ATTRB=(ASKIP,NORM),                                     X02000000
               LENGTH=001                                               02010000
AACT02  DFHMDF POS=(11,005),                                           X02020000
               ATTRB=(ASKIP),                                          X02030000
               LENGTH=003                                               02040000
ADRID02 DFHMDF POS=(11,009),                                           X02050000
               COLOR=BLUE,                                             X02060000
               ATTRB=(ASKIP,NORM),                                     X02070000
               LENGTH=004                                               02080000
ASCAC02 DFHMDF POS=(11,014),                                           X02090000
               COLOR=BLUE,                                             X02100000
               ATTRB=(ASKIP,NORM),                                     X02110000
               LENGTH=004                                               02120000
ATRLR02 DFHMDF POS=(11,019),                                           X02130000
               COLOR=BLUE,                                             X02140000
               ATTRB=(ASKIP,NORM),                                     X02150000
               LENGTH=010                                               02160000
AACTV02 DFHMDF POS=(11,030),                                           X02170000
               COLOR=BLUE,                                             X02180000
               ATTRB=(ASKIP,NORM),                                     X02190000
               LENGTH=001                                               02200000
ATRIP02 DFHMDF POS=(11,032),                                           X02210000
               COLOR=BLUE,                                             X02220000
               ATTRB=(ASKIP,NORM),                                     X02230000
               LENGTH=009                                               02240000
ADTEA02 DFHMDF POS=(11,042),                                           X02250000
               COLOR=BLUE,                                             X02260000
               ATTRB=(ASKIP,NORM),                                     X02270000
               LENGTH=008                                               02280000
ATMEA02 DFHMDF POS=(11,051),                                           X02290000
               COLOR=BLUE,                                             X02300000
               ATTRB=(ASKIP,NORM),                                     X02310000
               LENGTH=008                                               02320000
ADTEU02 DFHMDF POS=(11,061),                                           X02330000
               COLOR=BLUE,                                             X02340000
               ATTRB=(ASKIP,NORM),                                     X02350000
               LENGTH=008                                               02360000
ATMEU02 DFHMDF POS=(11,070),                                           X02370000
               COLOR=BLUE,                                             X02380000
               ATTRB=(ASKIP,NORM),                                     X02390000
               LENGTH=008                                               02400000
**********************************************************************  02410000
ASEL03  DFHMDF POS=(12,001),                                           X02420000
               COLOR=GREEN,                                            X02430000
               HILIGHT=UNDERLINE,                                      X02440000
               ATTRB=(UNPROT,NORM),                                    X02450000
               LENGTH=001                                               02460000
        DFHMDF POS=(12,003),                                           X02470000
               ATTRB=(ASKIP,NORM),                                     X02480000
               LENGTH=001                                               02490000
AACT03  DFHMDF POS=(12,005),                                           X02500000
               ATTRB=(ASKIP),                                          X02510000
               LENGTH=003                                               02520000
ADRID03 DFHMDF POS=(12,009),                                           X02530000
               COLOR=BLUE,                                             X02540000
               ATTRB=(ASKIP,NORM),                                     X02550000
               LENGTH=004                                               02560000
ASCAC03 DFHMDF POS=(12,014),                                           X02570000
               COLOR=BLUE,                                             X02580000
               ATTRB=(ASKIP,NORM),                                     X02590000
               LENGTH=004                                               02600000
ATRLR03 DFHMDF POS=(12,019),                                           X02610000
               COLOR=BLUE,                                             X02620000
               ATTRB=(ASKIP,NORM),                                     X02630000
               LENGTH=010                                               02640000
AACTV03 DFHMDF POS=(12,030),                                           X02650000
               COLOR=BLUE,                                             X02660000
               ATTRB=(ASKIP,NORM),                                     X02670000
               LENGTH=001                                               02680000
ATRIP03 DFHMDF POS=(12,032),                                           X02690000
               COLOR=BLUE,                                             X02700000
               ATTRB=(ASKIP,NORM),                                     X02710000
               LENGTH=009                                               02720000
ADTEA03 DFHMDF POS=(12,042),                                           X02730000
               COLOR=BLUE,                                             X02740000
               ATTRB=(ASKIP,NORM),                                     X02750000
               LENGTH=008                                               02760000
ATMEA03 DFHMDF POS=(12,051),                                           X02770000
               COLOR=BLUE,                                             X02780000
               ATTRB=(ASKIP,NORM),                                     X02790000
               LENGTH=008                                               02800000
ADTEU03 DFHMDF POS=(12,061),                                           X02810000
               COLOR=BLUE,                                             X02820000
               ATTRB=(ASKIP,NORM),                                     X02830000
               LENGTH=008                                               02840000
ATMEU03 DFHMDF POS=(12,070),                                           X02850000
               COLOR=BLUE,                                             X02860000
               ATTRB=(ASKIP,NORM),                                     X02870000
               LENGTH=008                                               02880000
**********************************************************************  02890000
ASEL04  DFHMDF POS=(13,001),                                           X02900000
               COLOR=GREEN,                                            X02910000
               HILIGHT=UNDERLINE,                                      X02920000
               ATTRB=(UNPROT,NORM),                                    X02930000
               LENGTH=001                                               02940000
        DFHMDF POS=(13,003),                                           X02950000
               ATTRB=(ASKIP,NORM),                                     X02960000
               LENGTH=001                                               02970000
AACT04  DFHMDF POS=(13,005),                                           X02980000
               ATTRB=(ASKIP),                                          X02990000
               LENGTH=003                                               03000000
ADRID04 DFHMDF POS=(13,009),                                           X03010000
               COLOR=BLUE,                                             X03020000
               ATTRB=(ASKIP,NORM),                                     X03030000
               LENGTH=004                                               03040000
ASCAC04 DFHMDF POS=(13,014),                                           X03050000
               COLOR=BLUE,                                             X03060000
               ATTRB=(ASKIP,NORM),                                     X03070000
               LENGTH=004                                               03080000
ATRLR04 DFHMDF POS=(13,019),                                           X03090000
               COLOR=BLUE,                                             X03100000
               ATTRB=(ASKIP,NORM),                                     X03110000
               LENGTH=010                                               03120000
AACTV04 DFHMDF POS=(13,030),                                           X03130000
               COLOR=BLUE,                                             X03140000
               ATTRB=(ASKIP,NORM),                                     X03150000
               LENGTH=001                                               03160000
ATRIP04 DFHMDF POS=(13,032),                                           X03170000
               COLOR=BLUE,                                             X03180000
               ATTRB=(ASKIP,NORM),                                     X03190000
               LENGTH=009                                               03200000
ADTEA04 DFHMDF POS=(13,042),                                           X03210000
               COLOR=BLUE,                                             X03220000
               ATTRB=(ASKIP,NORM),                                     X03230000
               LENGTH=008                                               03240000
ATMEA04 DFHMDF POS=(13,051),                                           X03250000
               COLOR=BLUE,                                             X03260000
               ATTRB=(ASKIP,NORM),                                     X03270000
               LENGTH=008                                               03280000
ADTEU04 DFHMDF POS=(13,061),                                           X03290000
               COLOR=BLUE,                                             X03300000
               ATTRB=(ASKIP,NORM),                                     X03310000
               LENGTH=008                                               03320000
ATMEU04 DFHMDF POS=(13,070),                                           X03330000
               COLOR=BLUE,                                             X03340000
               ATTRB=(ASKIP,NORM),                                     X03350000
               LENGTH=008                                               03360000
**********************************************************************  03370000
ASEL05  DFHMDF POS=(14,001),                                           X03380000
               COLOR=GREEN,                                            X03390000
               HILIGHT=UNDERLINE,                                      X03400000
               ATTRB=(UNPROT,NORM),                                    X03410000
               LENGTH=001                                               03420000
        DFHMDF POS=(14,003),                                           X03430000
               ATTRB=(ASKIP,NORM),                                     X03440000
               LENGTH=001                                               03450000
AACT05  DFHMDF POS=(14,005),                                           X03460000
               ATTRB=(ASKIP),                                          X03470000
               LENGTH=003                                               03480000
ADRID05 DFHMDF POS=(14,009),                                           X03490000
               COLOR=BLUE,                                             X03500000
               ATTRB=(ASKIP,NORM),                                     X03510000
               LENGTH=004                                               03520000
ASCAC05 DFHMDF POS=(14,014),                                           X03530000
               COLOR=BLUE,                                             X03540000
               ATTRB=(ASKIP,NORM),                                     X03550000
               LENGTH=004                                               03560000
ATRLR05 DFHMDF POS=(14,019),                                           X03570000
               COLOR=BLUE,                                             X03580000
               ATTRB=(ASKIP,NORM),                                     X03590000
               LENGTH=010                                               03600000
AACTV05 DFHMDF POS=(14,030),                                           X03610000
               COLOR=BLUE,                                             X03620000
               ATTRB=(ASKIP,NORM),                                     X03630000
               LENGTH=001                                               03640000
ATRIP05 DFHMDF POS=(14,032),                                           X03650000
               COLOR=BLUE,                                             X03660000
               ATTRB=(ASKIP,NORM),                                     X03670000
               LENGTH=009                                               03680000
ADTEA05 DFHMDF POS=(14,042),                                           X03690000
               COLOR=BLUE,                                             X03700000
               ATTRB=(ASKIP,NORM),                                     X03710000
               LENGTH=008                                               03720000
ATMEA05 DFHMDF POS=(14,051),                                           X03730000
               COLOR=BLUE,                                             X03740000
               ATTRB=(ASKIP,NORM),                                     X03750000
               LENGTH=008                                               03760000
ADTEU05 DFHMDF POS=(14,061),                                           X03770000
               COLOR=BLUE,                                             X03780000
               ATTRB=(ASKIP,NORM),                                     X03790000
               LENGTH=008                                               03800000
ATMEU05 DFHMDF POS=(14,070),                                           X03810000
               COLOR=BLUE,                                             X03820000
               ATTRB=(ASKIP,NORM),                                     X03830000
               LENGTH=008                                               03840000
**********************************************************************  03850000
ASEL06  DFHMDF POS=(15,001),                                           X03860000
               COLOR=GREEN,                                            X03870000
               HILIGHT=UNDERLINE,                                      X03880000
               ATTRB=(UNPROT,NORM),                                    X03890000
               LENGTH=001                                               03900000
        DFHMDF POS=(15,003),                                           X03910000
               ATTRB=(ASKIP,NORM),                                     X03920000
               LENGTH=001                                               03930000
AACT06  DFHMDF POS=(15,005),                                           X03940000
               ATTRB=(ASKIP),                                          X03950000
               LENGTH=003                                               03960000
ADRID06 DFHMDF POS=(15,009),                                           X03970000
               COLOR=BLUE,                                             X03980000
               ATTRB=(ASKIP,NORM),                                     X03990000
               LENGTH=004                                               04000000
ASCAC06 DFHMDF POS=(15,014),                                           X04010000
               COLOR=BLUE,                                             X04020000
               ATTRB=(ASKIP,NORM),                                     X04030000
               LENGTH=004                                               04040000
ATRLR06 DFHMDF POS=(15,019),                                           X04050000
               COLOR=BLUE,                                             X04060000
               ATTRB=(ASKIP,NORM),                                     X04070000
               LENGTH=010                                               04080000
AACTV06 DFHMDF POS=(15,030),                                           X04090000
               COLOR=BLUE,                                             X04100000
               ATTRB=(ASKIP,NORM),                                     X04110000
               LENGTH=001                                               04120000
ATRIP06 DFHMDF POS=(15,032),                                           X04130000
               COLOR=BLUE,                                             X04140000
               ATTRB=(ASKIP,NORM),                                     X04150000
               LENGTH=009                                               04160000
ADTEA06 DFHMDF POS=(15,042),                                           X04170000
               COLOR=BLUE,                                             X04180000
               ATTRB=(ASKIP,NORM),                                     X04190000
               LENGTH=008                                               04200000
ATMEA06 DFHMDF POS=(15,051),                                           X04210000
               COLOR=BLUE,                                             X04220000
               ATTRB=(ASKIP,NORM),                                     X04230000
               LENGTH=008                                               04240000
ADTEU06 DFHMDF POS=(15,061),                                           X04250000
               COLOR=BLUE,                                             X04260000
               ATTRB=(ASKIP,NORM),                                     X04270000
               LENGTH=008                                               04280000
ATMEU06 DFHMDF POS=(15,070),                                           X04290000
               COLOR=BLUE,                                             X04300000
               ATTRB=(ASKIP,NORM),                                     X04310000
               LENGTH=008                                               04320000
**********************************************************************  04330000
ASEL07  DFHMDF POS=(16,001),                                           X04340000
               COLOR=GREEN,                                            X04350000
               HILIGHT=UNDERLINE,                                      X04360000
               ATTRB=(UNPROT,NORM),                                    X04370000
               LENGTH=001                                               04380000
        DFHMDF POS=(16,003),                                           X04390000
               ATTRB=(ASKIP,NORM),                                     X04400000
               LENGTH=001                                               04410000
AACT07  DFHMDF POS=(16,005),                                           X04420000
               ATTRB=(ASKIP),                                          X04430000
               LENGTH=003                                               04440000
ADRID07 DFHMDF POS=(16,009),                                           X04450000
               COLOR=BLUE,                                             X04460000
               ATTRB=(ASKIP,NORM),                                     X04470000
               LENGTH=004                                               04480000
ASCAC07 DFHMDF POS=(16,014),                                           X04490000
               COLOR=BLUE,                                             X04500000
               ATTRB=(ASKIP,NORM),                                     X04510000
               LENGTH=004                                               04520000
ATRLR07 DFHMDF POS=(16,019),                                           X04530000
               COLOR=BLUE,                                             X04540000
               ATTRB=(ASKIP,NORM),                                     X04550000
               LENGTH=010                                               04560000
AACTV07 DFHMDF POS=(16,030),                                           X04570000
               COLOR=BLUE,                                             X04580000
               ATTRB=(ASKIP,NORM),                                     X04590000
               LENGTH=001                                               04600000
ATRIP07 DFHMDF POS=(16,032),                                           X04610000
               COLOR=BLUE,                                             X04620000
               ATTRB=(ASKIP,NORM),                                     X04630000
               LENGTH=009                                               04640000
ADTEA07 DFHMDF POS=(16,042),                                           X04650000
               COLOR=BLUE,                                             X04660000
               ATTRB=(ASKIP,NORM),                                     X04670000
               LENGTH=008                                               04680000
ATMEA07 DFHMDF POS=(16,051),                                           X04690000
               COLOR=BLUE,                                             X04700000
               ATTRB=(ASKIP,NORM),                                     X04710000
               LENGTH=008                                               04720000
ADTEU07 DFHMDF POS=(16,061),                                           X04730000
               COLOR=BLUE,                                             X04740000
               ATTRB=(ASKIP,NORM),                                     X04750000
               LENGTH=008                                               04760000
ATMEU07 DFHMDF POS=(16,070),                                           X04770000
               COLOR=BLUE,                                             X04780000
               ATTRB=(ASKIP,NORM),                                     X04790000
               LENGTH=008                                               04800000
**********************************************************************  04810000
ASEL08  DFHMDF POS=(17,001),                                           X04820000
               COLOR=GREEN,                                            X04830000
               HILIGHT=UNDERLINE,                                      X04840000
               ATTRB=(UNPROT,NORM),                                    X04850000
               LENGTH=001                                               04860000
        DFHMDF POS=(17,003),                                           X04870000
               ATTRB=(ASKIP,NORM),                                     X04880000
               LENGTH=001                                               04890000
AACT08  DFHMDF POS=(17,005),                                           X04900000
               ATTRB=(ASKIP),                                          X04910000
               LENGTH=003                                               04920000
ADRID08 DFHMDF POS=(17,009),                                           X04930000
               COLOR=BLUE,                                             X04940000
               ATTRB=(ASKIP,NORM),                                     X04950000
               LENGTH=004                                               04960000
ASCAC08 DFHMDF POS=(17,014),                                           X04970000
               COLOR=BLUE,                                             X04980000
               ATTRB=(ASKIP,NORM),                                     X04990000
               LENGTH=004                                               05000000
ATRLR08 DFHMDF POS=(17,019),                                           X05010000
               COLOR=BLUE,                                             X05020000
               ATTRB=(ASKIP,NORM),                                     X05030000
               LENGTH=010                                               05040000
AACTV08 DFHMDF POS=(17,030),                                           X05050000
               COLOR=BLUE,                                             X05060000
               ATTRB=(ASKIP,NORM),                                     X05070000
               LENGTH=001                                               05080000
ATRIP08 DFHMDF POS=(17,032),                                           X05090000
               COLOR=BLUE,                                             X05100000
               ATTRB=(ASKIP,NORM),                                     X05110000
               LENGTH=009                                               05120000
ADTEA08 DFHMDF POS=(17,042),                                           X05130000
               COLOR=BLUE,                                             X05140000
               ATTRB=(ASKIP,NORM),                                     X05150000
               LENGTH=008                                               05160000
ATMEA08 DFHMDF POS=(17,051),                                           X05170000
               COLOR=BLUE,                                             X05180000
               ATTRB=(ASKIP,NORM),                                     X05190000
               LENGTH=008                                               05200000
ADTEU08 DFHMDF POS=(17,061),                                           X05210000
               COLOR=BLUE,                                             X05220000
               ATTRB=(ASKIP,NORM),                                     X05230000
               LENGTH=008                                               05240000
ATMEU08 DFHMDF POS=(17,070),                                           X05250000
               COLOR=BLUE,                                             X05260000
               ATTRB=(ASKIP,NORM),                                     X05270000
               LENGTH=008                                               05280000
**********************************************************************  05290000
ASEL09  DFHMDF POS=(18,001),                                           X05300000
               COLOR=GREEN,                                            X05310000
               HILIGHT=UNDERLINE,                                      X05320000
               ATTRB=(UNPROT,NORM),                                    X05330000
               LENGTH=001                                               05340000
        DFHMDF POS=(18,003),                                           X05350000
               ATTRB=(ASKIP,NORM),                                     X05360000
               LENGTH=001                                               05370000
AACT09  DFHMDF POS=(18,005),                                           X05380000
               ATTRB=(ASKIP),                                          X05390000
               LENGTH=003                                               05400000
ADRID09 DFHMDF POS=(18,009),                                           X05410000
               COLOR=BLUE,                                             X05420000
               ATTRB=(ASKIP,NORM),                                     X05430000
               LENGTH=004                                               05440000
ASCAC09 DFHMDF POS=(18,014),                                           X05450000
               COLOR=BLUE,                                             X05460000
               ATTRB=(ASKIP,NORM),                                     X05470000
               LENGTH=004                                               05480000
ATRLR09 DFHMDF POS=(18,019),                                           X05490000
               COLOR=BLUE,                                             X05500000
               ATTRB=(ASKIP,NORM),                                     X05510000
               LENGTH=010                                               05520000
AACTV09 DFHMDF POS=(18,030),                                           X05530000
               COLOR=BLUE,                                             X05540000
               ATTRB=(ASKIP,NORM),                                     X05550000
               LENGTH=001                                               05560000
ATRIP09 DFHMDF POS=(18,032),                                           X05570000
               COLOR=BLUE,                                             X05580000
               ATTRB=(ASKIP,NORM),                                     X05590000
               LENGTH=009                                               05600000
ADTEA09 DFHMDF POS=(18,042),                                           X05610000
               COLOR=BLUE,                                             X05620000
               ATTRB=(ASKIP,NORM),                                     X05630000
               LENGTH=008                                               05640000
ATMEA09 DFHMDF POS=(18,051),                                           X05650000
               COLOR=BLUE,                                             X05660000
               ATTRB=(ASKIP,NORM),                                     X05670000
               LENGTH=008                                               05680000
ADTEU09 DFHMDF POS=(18,061),                                           X05690000
               COLOR=BLUE,                                             X05700000
               ATTRB=(ASKIP,NORM),                                     X05710000
               LENGTH=008                                               05720000
ATMEU09 DFHMDF POS=(18,070),                                           X05730000
               COLOR=BLUE,                                             X05740000
               ATTRB=(ASKIP,NORM),                                     X05750000
               LENGTH=008                                               05760000
**********************************************************************  05770000
**********************************************************************  05780000
         DFHMDF POS=(19,045),                                          X05790000
               COLOR=NEUTRAL,                                          X05800000
               ATTRB=(ASKIP,NORM),                                     X05810000
               LENGTH=025,                                             X05820000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      05830000
ASELIT   DFHMDF POS=(19,072),                                          X05840000
               COLOR=BLUE,                                             X05850000
               ATTRB=(ASKIP,NORM),                                     X05860000
               LENGTH=007,                                             X05870000
               PICOUT='ZZZ,ZZ9'                                         05880000
         DFHMSD TYPE=FINAL                                              05890000
         END                                                            05900000
