***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
SUKM577 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
**********************************************************************          
SUK577  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
**********************************************************************          
**********************************************************************          
ASTRTIT DFHMDF POS=(03,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(03,055),                                          X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(03,58),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(03,064),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(03,67),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
**********************************************************************          
        DFHMDF POS=(04,12),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='AUDIT'                                                  
        DFHMDF POS=(04,21),                                            X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='AUDIT RANK'                                             
        DFHMDF POS=(04,54),                                            X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='- RANK SETTINGS -'                                      
**********************************************************************          
**********************************************************************          
        DFHMDF POS=(05,002),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SEL'                                                    
        DFHMDF POS=(05,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ACT'                                                    
        DFHMDF POS=(05,013),                                           X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='RANK'                                                   
        DFHMDF POS=(05,021),                                           X        
               LENGTH=011,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DESCRIPTION'                                            
        DFHMDF POS=(05,054),                                           X        
               LENGTH=022,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='BLK/CSE PREPK PBS RFID'                                 
**********************************************************************          
ASEL01  DFHMDF POS=(06,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(06,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT01  DFHMDF POS=(06,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK01 DFHMDF POS=(06,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC01 DFHMDF POS=(06,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS01  DFHMDF POS=(06,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK01 DFHMDF POS=(06,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS01  DFHMDF POS=(06,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID01 DFHMDF POS=(06,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL02  DFHMDF POS=(07,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(07,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT02  DFHMDF POS=(07,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK02 DFHMDF POS=(07,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC02 DFHMDF POS=(07,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS02  DFHMDF POS=(07,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK02 DFHMDF POS=(07,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS02  DFHMDF POS=(07,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID02 DFHMDF POS=(07,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL03  DFHMDF POS=(08,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(08,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT03  DFHMDF POS=(08,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK03 DFHMDF POS=(08,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC03 DFHMDF POS=(08,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS03  DFHMDF POS=(08,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK03 DFHMDF POS=(08,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS03  DFHMDF POS=(08,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID03 DFHMDF POS=(08,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL04  DFHMDF POS=(09,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(09,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT04  DFHMDF POS=(09,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK04 DFHMDF POS=(09,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC04 DFHMDF POS=(09,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS04  DFHMDF POS=(09,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK04 DFHMDF POS=(09,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS04  DFHMDF POS=(09,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID04 DFHMDF POS=(09,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL05  DFHMDF POS=(10,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(10,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT05  DFHMDF POS=(10,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK05 DFHMDF POS=(10,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC05 DFHMDF POS=(10,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS05  DFHMDF POS=(10,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK05 DFHMDF POS=(10,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS05  DFHMDF POS=(10,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID05 DFHMDF POS=(10,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL06  DFHMDF POS=(11,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(11,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT06  DFHMDF POS=(11,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK06 DFHMDF POS=(11,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC06 DFHMDF POS=(11,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS06  DFHMDF POS=(11,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK06 DFHMDF POS=(11,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS06  DFHMDF POS=(11,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID06 DFHMDF POS=(11,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL07  DFHMDF POS=(12,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(12,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT07  DFHMDF POS=(12,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK07 DFHMDF POS=(12,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC07 DFHMDF POS=(12,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS07  DFHMDF POS=(12,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK07 DFHMDF POS=(12,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS07  DFHMDF POS=(12,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID07 DFHMDF POS=(12,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL08  DFHMDF POS=(13,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(13,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT08  DFHMDF POS=(13,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK08 DFHMDF POS=(13,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC08 DFHMDF POS=(13,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS08  DFHMDF POS=(13,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK08 DFHMDF POS=(13,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS08  DFHMDF POS=(13,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID08 DFHMDF POS=(13,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL09  DFHMDF POS=(14,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(14,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT09  DFHMDF POS=(14,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK09 DFHMDF POS=(14,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC09 DFHMDF POS=(14,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS09  DFHMDF POS=(14,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK09 DFHMDF POS=(14,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS09  DFHMDF POS=(14,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID09 DFHMDF POS=(14,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL10  DFHMDF POS=(15,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(15,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT10  DFHMDF POS=(15,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK10 DFHMDF POS=(15,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC10 DFHMDF POS=(15,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS10  DFHMDF POS=(15,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK10 DFHMDF POS=(15,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS10  DFHMDF POS=(15,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID10 DFHMDF POS=(15,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL11  DFHMDF POS=(16,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(16,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT11  DFHMDF POS=(16,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK11 DFHMDF POS=(16,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC11 DFHMDF POS=(16,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS11  DFHMDF POS=(16,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK11 DFHMDF POS=(16,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS11  DFHMDF POS=(16,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID11 DFHMDF POS=(16,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL12  DFHMDF POS=(17,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(17,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT12  DFHMDF POS=(17,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK12 DFHMDF POS=(17,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC12 DFHMDF POS=(17,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS12  DFHMDF POS=(17,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK12 DFHMDF POS=(17,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS12  DFHMDF POS=(17,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID12 DFHMDF POS=(17,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
ASEL13  DFHMDF POS=(18,003),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
         DFHMDF POS=(18,005),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=000                                                       
AACT13  DFHMDF POS=(18,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARANK13 DFHMDF POS=(18,012),                                           X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADESC13 DFHMDF POS=(18,021),                                           X        
               LENGTH=030,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ABCS13  DFHMDF POS=(18,057),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APRPK13 DFHMDF POS=(18,064),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APBS13  DFHMDF POS=(18,069),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ARFID13 DFHMDF POS=(18,073),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
         DFHMDF POS=(19,039),                                          X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT   DFHMDF POS=(19,065),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
**********************************************************************          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
