***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
SUKM598 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
**********************************************************************          
SU598A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(20,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
**********************************************************************          
        DFHMDF POS=(03,01),                                            X        
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO/RCVR.....:'                                          
APORCVR  DFHMDF POS=(03,015),                                          X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVNDRNM  DFHMDF POS=(03,029),                                          X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,49),                                            X        
               LENGTH=19,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PACKAGE TYPE......:'                                    
APCKG   DFHMDF POS=(03,69),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
        DFHMDF POS=(04,01),                                            X        
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='RCVR STATUS.:'                                          
ARCVRST  DFHMDF POS=(04,015),                                          X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE    DFHMDF POS=(04,020),                                          X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME    DFHMDF POS=(04,031),                                          X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AUSRID   DFHMDF POS=(04,039),                                          X        
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(04,49),                                            X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='RCVR INBND CTN CNT:'                                    
AINBCTN  DFHMDF POS=(04,069),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZ9'                                                 
**********************************************************************          
        DFHMDF POS=(05,01),                                            X        
               LENGTH=13,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CURR OPER ID:'                                          
AOPER   DFHMDF POS=(05,15),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZ99'                                                    
ANAME   DFHMDF POS=(05,20),                                            X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(05,049),                                           X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=19,                                              X        
               INITIAL='TOT OUTBND CTN CNT:'                                    
AOTBCTN  DFHMDF POS=(05,069),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZ9'                                                 
**********************************************************************          
ACNSTK  DFHMDF POS=(06,01),                                            X        
               LENGTH=13,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL                                                    
ACSOPER DFHMDF POS=(06,15),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZ99'                                                    
        DFHMDF POS=(07,001),                                           X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=13,                                              X        
               INITIAL='DEST STORE..:'                                          
ASTORE  DFHMDF POS=(07,15),                                            X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
ASTNAME  DFHMDF POS=(06,020),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=025                                                       
        DFHMDF POS=(06,49),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ITEMS'                                                  
ASTRTIT DFHMDF POS=(06,55),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(06,061),                                          X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(06,64),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(06,070),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(06,73),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
        DFHMDF POS=(07,45),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL'                                                  
        DFHMDF POS=(07,53),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL'                                                  
        DFHMDF POS=(07,60),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL'                                                  
        DFHMDF POS=(07,66),                                            X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOT CTN'                                                
**********************************************************************          
        DFHMDF POS=(08,11),                                            X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO'                                                     
        DFHMDF POS=(08,15),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='LINE'                                                   
        DFHMDF POS=(08,20),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ACTUAL'                                                 
        DFHMDF POS=(08,28),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='UNITS'                                                  
        DFHMDF POS=(08,37),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='UNIT'                                                   
        DFHMDF POS=(08,46),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CTNS'                                                   
        DFHMDF POS=(08,54),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CTNS'                                                   
        DFHMDF POS=(08,61),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CTNS'                                                   
        DFHMDF POS=(08,66),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MANUAL'                                                 
        DFHMDF POS=(08,73),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PROC'                                                   
**********************************************************************          
        DFHMDF POS=(09,01),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SEL'                                                    
        DFHMDF POS=(09,06),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ACT'                                                    
        DFHMDF POS=(09,10),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='LINE'                                                   
        DFHMDF POS=(09,15),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STAT'                                                   
        DFHMDF POS=(09,20),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL=' QTY  '                                                 
        DFHMDF POS=(09,27),                                            X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='MANFSTD'                                                
        DFHMDF POS=(09,35),                                            X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='VARIANC'                                                
        DFHMDF POS=(09,44),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='W/LINE'                                                 
        DFHMDF POS=(09,51),                                            X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SHIPPED'                                                
        DFHMDF POS=(09,59),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DIVERT'                                                 
        DFHMDF POS=(09,66),                                            X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='LOADED'                                                 
        DFHMDF POS=(09,73),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CODE'                                                   
**********************************************************************          
ASEL01  DFHMDF POS=(10,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(10,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT01  DFHMDF POS=(10,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE01 DFHMDF POS=(10,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT01 DFHMDF POS=(10,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD01 DFHMDF POS=(10,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN01 DFHMDF POS=(10,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY01 DFHMDF POS=(10,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE01 DFHMDF POS=(10,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP01 DFHMDF POS=(10,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT01 DFHMDF POS=(10,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD01 DFHMDF POS=(10,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC01 DFHMDF POS=(10,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL02  DFHMDF POS=(11,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(11,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT02  DFHMDF POS=(11,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE02 DFHMDF POS=(11,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT02 DFHMDF POS=(11,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD02 DFHMDF POS=(11,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN02 DFHMDF POS=(11,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY02 DFHMDF POS=(11,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE02 DFHMDF POS=(11,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP02 DFHMDF POS=(11,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT02 DFHMDF POS=(11,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD02 DFHMDF POS=(11,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC02 DFHMDF POS=(11,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL03  DFHMDF POS=(12,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(12,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT03  DFHMDF POS=(12,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE03 DFHMDF POS=(12,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT03 DFHMDF POS=(12,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD03 DFHMDF POS=(12,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN03 DFHMDF POS=(12,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY03 DFHMDF POS=(12,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE03 DFHMDF POS=(12,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP03 DFHMDF POS=(12,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT03 DFHMDF POS=(12,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD03 DFHMDF POS=(12,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC03 DFHMDF POS=(12,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL04  DFHMDF POS=(13,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(13,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT04  DFHMDF POS=(13,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE04 DFHMDF POS=(13,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT04 DFHMDF POS=(13,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD04 DFHMDF POS=(13,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN04 DFHMDF POS=(13,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY04 DFHMDF POS=(13,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE04 DFHMDF POS=(13,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP04 DFHMDF POS=(13,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT04 DFHMDF POS=(13,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD04 DFHMDF POS=(13,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC04 DFHMDF POS=(13,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL05  DFHMDF POS=(14,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(14,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT05  DFHMDF POS=(14,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE05 DFHMDF POS=(14,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT05 DFHMDF POS=(14,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD05 DFHMDF POS=(14,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN05 DFHMDF POS=(14,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY05 DFHMDF POS=(14,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE05 DFHMDF POS=(14,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP05 DFHMDF POS=(14,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT05 DFHMDF POS=(14,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD05 DFHMDF POS=(14,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC05 DFHMDF POS=(14,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL06  DFHMDF POS=(15,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(15,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT06  DFHMDF POS=(15,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE06 DFHMDF POS=(15,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT06 DFHMDF POS=(15,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD06 DFHMDF POS=(15,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN06 DFHMDF POS=(15,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY06 DFHMDF POS=(15,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE06 DFHMDF POS=(15,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP06 DFHMDF POS=(15,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT06 DFHMDF POS=(15,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD06 DFHMDF POS=(15,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC06 DFHMDF POS=(15,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL07  DFHMDF POS=(16,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(16,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT07  DFHMDF POS=(16,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE07 DFHMDF POS=(16,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT07 DFHMDF POS=(16,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD07 DFHMDF POS=(16,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN07 DFHMDF POS=(16,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY07 DFHMDF POS=(16,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE07 DFHMDF POS=(16,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP07 DFHMDF POS=(16,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT07 DFHMDF POS=(16,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD07 DFHMDF POS=(16,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC07 DFHMDF POS=(16,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL08  DFHMDF POS=(17,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(17,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT08  DFHMDF POS=(17,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE08 DFHMDF POS=(17,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT08 DFHMDF POS=(17,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD08 DFHMDF POS=(17,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN08 DFHMDF POS=(17,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY08 DFHMDF POS=(17,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE08 DFHMDF POS=(17,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP08 DFHMDF POS=(17,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT08 DFHMDF POS=(17,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD08 DFHMDF POS=(17,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC08 DFHMDF POS=(17,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL09  DFHMDF POS=(18,002),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
        DFHMDF POS=(18,004),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
AACT09  DFHMDF POS=(18,006),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ALINE09 DFHMDF POS=(18,010),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                                    
ASTAT09 DFHMDF POS=(18,016),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AVRFD09 DFHMDF POS=(18,020),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ACRTN09 DFHMDF POS=(18,028),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
AVQTY09 DFHMDF POS=(18,036),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X        
               PICOUT='ZZZZZ9'                                                  
AWLNE09 DFHMDF POS=(18,044),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ASHIP09 DFHMDF POS=(18,052),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ADVRT09 DFHMDF POS=(18,059),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
ALOAD09 DFHMDF POS=(18,066),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
APROC09 DFHMDF POS=(18,073),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(19,045),                                          X00728   
               LENGTH=025,                                             X00731   
               ATTRB=(ASKIP,NORM),                                     X00730   
               COLOR=NEUTRAL,                                          X00729   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,072),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
