        PRINT NOGEN                                                     00001   
SUKM521  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU521A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='UPC'                                            00015*29
*                                                                       00011   
AUPC     DFHMDF POS=(01,05),                                           X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00011   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='SKU'                                            00015*29
*                                                                       00011   
ASKU     DFHMDF POS=(02,05),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00016   
         DFHMDF POS=(02,14),                                           X00012**5
               LENGTH=000,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=000,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00011   
         DFHMDF POS=(04,02),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='F2 - SKU LOOKUP  '                              00015*29
*                                                                       00016   
         DFHMDF POS=(05,02),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='F4 - NO SKU      '                              00015*29
*                                                                       00068   
ACARTON  DFHMDF POS=(07,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00016   
AMSGLN   DFHMDF POS=(08,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
