*          DATA SET SUKM505    AT LEVEL 030 AS OF 06/17/91                      
        PRINT NOGEN                                                     00001   
SUKM505  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
SU505A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,06),                                           X00012**5
               LENGTH=009,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='NOT FOUND'                                      00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00016   
         DFHMDF POS=(03,04),                                           X00012**5
               LENGTH=017,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='SERIAL SHIP CODE:'                              00015*29
*                                                                       00016   
ACARTN   DFHMDF POS=(04,02),                                           X00034*22
               LENGTH=018,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00015   
         DFHMDF POS=(06,003),                                          X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               LENGTH=014,                                             X00036   
               INITIAL='PRESS ENTER TO'                                 00014   
*                                                                       00015   
         DFHMDF POS=(07,001),                                          X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               LENGTH=018,                                             X00036   
               INITIAL='IGNORE OR F2 - ADD'                             00014   
*                                                                       00015   
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
