*   MANIFESTING PROJECT - SHIPPING DOOR STATUS SCREENS                  00010000
*   D. HAHN    (TASK 3.5)                                               00020000
*********************************************************************** 00030001
*  TRAILER HISTORY LIST SCREEN                                          00040001
*********************************************************************** 00050001
        PRINT  NOGEN                                                    00060001
SUKM563 DFHMSD TYPE=DSECT,                                             X00070001
               LANG=COBOL,                                             X00080001
               MODE=INOUT,                                             X00090001
               STORAGE=AUTO,                                           X00100001
               TERM=3270-2,                                            X00110001
               TIOAPFX=YES                                              00120001
*********************************************************************** 00130001
SU563A  DFHMDI LINE=2,COLUMN=1,                                        X00140001
               SIZE=(19,80),                                           X00150001
               CTRL=(FREEKB),                                          X00160001
               MAPATTS=(COLOR,HILIGHT),                                X00170001
               DSATTS=(COLOR,HILIGHT)                                   00180001
*********************************************************************** 00190001
        DFHMDF POS=(02,01),                                            X00200001
               LENGTH=08,                                              X00210001
               ATTRB=(ASKIP,NORM),                                     X00220001
               COLOR=NEUTRAL,                                          X00230001
               INITIAL='OPER ID:'                                       00240001
AOPER   DFHMDF POS=(02,10),                                            X00250001
               LENGTH=04,                                              X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               COLOR=BLUE                                               00280001
AOPRNME DFHMDF POS=(02,16),                                            X00281004
               LENGTH=25,                                              X00282004
               ATTRB=(ASKIP,NORM),                                     X00283001
               COLOR=BLUE                                               00284001
*********************************************************************** 00285005
        DFHMDF POS=(03,01),                                            X00286005
               LENGTH=08,                                              X00287005
               ATTRB=(ASKIP,NORM),                                     X00288005
               COLOR=NEUTRAL,                                          X00289005
               INITIAL='SCAC...:'                                       00290005
ASCAC   DFHMDF POS=(03,10),                                            X00300005
               LENGTH=04,                                              X00310005
               ATTRB=(ASKIP,NORM),                                     X00320005
               COLOR=BLUE                                               00330005
ASCACDS DFHMDF POS=(03,16),                                            X00340006
               LENGTH=30,                                              X00350006
               ATTRB=(ASKIP,NORM),                                     X00360005
               COLOR=BLUE                                               00370005
*********************************************************************** 00500001
        DFHMDF POS=(04,49),                                            X00510005
               LENGTH=05,                                              X00520001
               ATTRB=(ASKIP,NORM),                                     X00530001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00540001
ASTRTIT DFHMDF POS=(04,55),                                            X00550005
               LENGTH=05,                                              X00560001
               ATTRB=(NUM,UNPROT,NORM),                                X00570001
               COLOR=GREEN,                                            X00580001
               PICOUT='ZZZZ9',                                         X00590001
               HILIGHT=UNDERLINE                                        00600001
        DFHMDF POS=(04,61),                                            X00610005
               LENGTH=02,                                              X00620001
               ATTRB=(ASKIP,NORM),                                     X00630001
               COLOR=NEUTRAL,                                          X00640001
               INITIAL='TO'                                             00650001
AENDIT  DFHMDF POS=(04,64),                                            X00660005
               LENGTH=05,                                              X00670001
               ATTRB=(ASKIP,NORM),                                     X00680001
               COLOR=BLUE,                                             X00690001
               PICOUT='ZZZZ9'                                           00700001
        DFHMDF POS=(04,70),                                            X00710005
               LENGTH=02,                                              X00720001
               ATTRB=(ASKIP,NORM),                                     X00730001
               COLOR=NEUTRAL,                                          X00740001
               INITIAL='OF'                                             00750001
ATOTIT  DFHMDF POS=(04,73),                                            X00760005
               LENGTH=05,                                              X00770001
               ATTRB=(ASKIP,NORM),                                     X00780001
               COLOR=BLUE,                                             X00790001
               PICOUT='ZZZZ9'                                           00800001
*********************************************************************** 00810001
        DFHMDF POS=(05,07),                                            X00820003
               LENGTH=07,                                              X00830001
               ATTRB=(ASKIP,NORM),                                     X00840001
               COLOR=NEUTRAL,                                          X00850001
               INITIAL='TRAILER'                                        00860001
        DFHMDF POS=(05,27),                                            X00870003
               LENGTH=04,                                              X00880001
               ATTRB=(ASKIP,NORM),                                     X00890001
               COLOR=NEUTRAL,                                          X00900001
               INITIAL='DEST'                                           00910001
        DFHMDF POS=(05,63),                                            X00920001
               LENGTH=06,                                              X00930001
               ATTRB=(ASKIP,NORM),                                     X00940001
               COLOR=NEUTRAL,                                          X00950001
               INITIAL='STATUS'                                         00960001
*********************************************************************** 01020001
        DFHMDF POS=(06,01),                                            X01030001
               LENGTH=29,                                              X01040001
               ATTRB=(ASKIP,NORM),                                     X01050001
               COLOR=NEUTRAL,                                          X01060001
               INITIAL='S ACT SERIAL #  TRIP ID   NBR'                  01070001
        DFHMDF POS=(06,32),                                            X01080001
               LENGTH=36,                                              X01090001
               ATTRB=(ASKIP,NORM),                                     X01100001
               COLOR=NEUTRAL,                                          X01110001
               INITIAL='TRAILER SEAL ID      STATUS     DATE'           01120001
        DFHMDF POS=(06,72),                                            X01121001
               LENGTH=07,                                              X01122001
               ATTRB=(ASKIP,NORM),                                     X01123001
               COLOR=NEUTRAL,                                          X01124001
               INITIAL='USER ID'                                        01125001
*********************************************************************** 01130001
ASEL01  DFHMDF POS=(07,01),                                            X01140001
               LENGTH=01,                                              X01150001
               ATTRB=(UNPROT,NORM),                                    X01160001
               HILIGHT=UNDERLINE,                                      X01170001
               COLOR=GREEN                                              01180001
AACT01  DFHMDF POS=(07,03),                                            X01190001
               LENGTH=03,                                              X01200001
               ATTRB=(ASKIP,NORM),                                     X01210001
               COLOR=BLUE                                               01220001
ATRLR01 DFHMDF POS=(07,07),                                            X01230001
               LENGTH=09,                                              X01240001
               ATTRB=(ASKIP,NORM),                                     X01250001
               PICOUT='ZZZZZZZZZ',                                     X01260001
               COLOR=BLUE                                               01270001
ATRIP01 DFHMDF POS=(07,17),                                            X01280001
               LENGTH=09,                                              X01290001
               ATTRB=(ASKIP,NORM),                                     X01300001
               PICOUT='ZZZZZZZZZ',                                     X01301001
               COLOR=BLUE                                               01310001
ADEST01 DFHMDF POS=(07,27),                                            X01320001
               LENGTH=04,                                              X01330001
               ATTRB=(ASKIP,NORM),                                     X01340001
               COLOR=BLUE                                               01350001
ASEAL01 DFHMDF POS=(07,32),                                            X01360001
               LENGTH=20,                                              X01370004
               ATTRB=(ASKIP,NORM),                                     X01380001
               COLOR=BLUE                                               01390001
ASTAT01 DFHMDF POS=(07,53),                                            X01400002
               LENGTH=07,                                              X01410001
               ATTRB=(ASKIP,NORM),                                     X01420001
               COLOR=BLUE                                               01430001
ADATE01 DFHMDF POS=(07,61),                                            X01440002
               LENGTH=10,                                              X01450001
               ATTRB=(ASKIP,NORM),                                     X01460001
               COLOR=BLUE                                               01470001
AUSER01 DFHMDF POS=(07,72),                                            X01480001
               LENGTH=08,                                              X01490001
               ATTRB=(ASKIP,NORM),                                     X01500001
               COLOR=BLUE                                               01510001
*********************************************************************** 01511001
ASEL02  DFHMDF POS=(08,01),                                            X01512001
               LENGTH=01,                                              X01513001
               ATTRB=(UNPROT,NORM),                                    X01514001
               HILIGHT=UNDERLINE,                                      X01515001
               COLOR=GREEN                                              01516001
AACT02  DFHMDF POS=(08,03),                                            X01517001
               LENGTH=03,                                              X01518001
               ATTRB=(ASKIP,NORM),                                     X01519001
               COLOR=BLUE                                               01519101
ATRLR02 DFHMDF POS=(08,07),                                            X01519201
               LENGTH=09,                                              X01519301
               ATTRB=(ASKIP,NORM),                                     X01519401
               PICOUT='ZZZZZZZZZ',                                     X01519501
               COLOR=BLUE                                               01519601
ATRIP02 DFHMDF POS=(08,17),                                            X01519701
               LENGTH=09,                                              X01519801
               ATTRB=(ASKIP,NORM),                                     X01519901
               PICOUT='ZZZZZZZZZ',                                     X01520001
               COLOR=BLUE                                               01521001
ADEST02 DFHMDF POS=(08,27),                                            X01522001
               LENGTH=04,                                              X01523001
               ATTRB=(ASKIP,NORM),                                     X01524001
               COLOR=BLUE                                               01525001
ASEAL02 DFHMDF POS=(08,32),                                            X01526001
               LENGTH=20,                                              X01527004
               ATTRB=(ASKIP,NORM),                                     X01528001
               COLOR=BLUE                                               01529001
ASTAT02 DFHMDF POS=(08,53),                                            X01529102
               LENGTH=07,                                              X01529201
               ATTRB=(ASKIP,NORM),                                     X01529301
               COLOR=BLUE                                               01529401
ADATE02 DFHMDF POS=(08,61),                                            X01529502
               LENGTH=10,                                              X01529601
               ATTRB=(ASKIP,NORM),                                     X01529701
               COLOR=BLUE                                               01529801
AUSER02 DFHMDF POS=(08,72),                                            X01529901
               LENGTH=08,                                              X01530001
               ATTRB=(ASKIP,NORM),                                     X01531001
               COLOR=BLUE                                               01532001
*********************************************************************** 01533001
ASEL03  DFHMDF POS=(09,01),                                            X01534001
               LENGTH=01,                                              X01535001
               ATTRB=(UNPROT,NORM),                                    X01536001
               HILIGHT=UNDERLINE,                                      X01537001
               COLOR=GREEN                                              01538001
AACT03  DFHMDF POS=(09,03),                                            X01539001
               LENGTH=03,                                              X01539101
               ATTRB=(ASKIP,NORM),                                     X01539201
               COLOR=BLUE                                               01539301
ATRLR03 DFHMDF POS=(09,07),                                            X01539401
               LENGTH=09,                                              X01539501
               ATTRB=(ASKIP,NORM),                                     X01539601
               PICOUT='ZZZZZZZZZ',                                     X01539701
               COLOR=BLUE                                               01539801
ATRIP03 DFHMDF POS=(09,17),                                            X01539901
               LENGTH=09,                                              X01540001
               ATTRB=(ASKIP,NORM),                                     X01541001
               PICOUT='ZZZZZZZZZ',                                     X01542001
               COLOR=BLUE                                               01543001
ADEST03 DFHMDF POS=(09,27),                                            X01544001
               LENGTH=04,                                              X01545001
               ATTRB=(ASKIP,NORM),                                     X01546001
               COLOR=BLUE                                               01547001
ASEAL03 DFHMDF POS=(09,32),                                            X01548001
               LENGTH=20,                                              X01549004
               ATTRB=(ASKIP,NORM),                                     X01549101
               COLOR=BLUE                                               01549201
ASTAT03 DFHMDF POS=(09,53),                                            X01549302
               LENGTH=07,                                              X01549401
               ATTRB=(ASKIP,NORM),                                     X01549501
               COLOR=BLUE                                               01549601
ADATE03 DFHMDF POS=(09,61),                                            X01549702
               LENGTH=10,                                              X01549801
               ATTRB=(ASKIP,NORM),                                     X01549901
               COLOR=BLUE                                               01550001
AUSER03 DFHMDF POS=(09,72),                                            X01551001
               LENGTH=08,                                              X01552001
               ATTRB=(ASKIP,NORM),                                     X01553001
               COLOR=BLUE                                               01554001
*********************************************************************** 01555001
ASEL04  DFHMDF POS=(10,01),                                            X01556001
               LENGTH=01,                                              X01557001
               ATTRB=(UNPROT,NORM),                                    X01558001
               HILIGHT=UNDERLINE,                                      X01559001
               COLOR=GREEN                                              01559101
AACT04  DFHMDF POS=(10,03),                                            X01559201
               LENGTH=03,                                              X01559301
               ATTRB=(ASKIP,NORM),                                     X01559401
               COLOR=BLUE                                               01559501
ATRLR04 DFHMDF POS=(10,07),                                            X01559601
               LENGTH=09,                                              X01559701
               ATTRB=(ASKIP,NORM),                                     X01559801
               PICOUT='ZZZZZZZZZ',                                     X01559901
               COLOR=BLUE                                               01560001
ATRIP04 DFHMDF POS=(10,17),                                            X01561001
               LENGTH=09,                                              X01562001
               ATTRB=(ASKIP,NORM),                                     X01563001
               PICOUT='ZZZZZZZZZ',                                     X01564001
               COLOR=BLUE                                               01565001
ADEST04 DFHMDF POS=(10,27),                                            X01566001
               LENGTH=04,                                              X01567001
               ATTRB=(ASKIP,NORM),                                     X01568001
               COLOR=BLUE                                               01569001
ASEAL04 DFHMDF POS=(10,32),                                            X01569101
               LENGTH=20,                                              X01569204
               ATTRB=(ASKIP,NORM),                                     X01569301
               COLOR=BLUE                                               01569401
ASTAT04 DFHMDF POS=(10,53),                                            X01569502
               LENGTH=07,                                              X01569601
               ATTRB=(ASKIP,NORM),                                     X01569701
               COLOR=BLUE                                               01569801
ADATE04 DFHMDF POS=(10,61),                                            X01569902
               LENGTH=10,                                              X01570001
               ATTRB=(ASKIP,NORM),                                     X01571001
               COLOR=BLUE                                               01572001
AUSER04 DFHMDF POS=(10,72),                                            X01573001
               LENGTH=08,                                              X01574001
               ATTRB=(ASKIP,NORM),                                     X01575001
               COLOR=BLUE                                               01576001
*********************************************************************** 01577001
ASEL05  DFHMDF POS=(11,01),                                            X01578001
               LENGTH=01,                                              X01579001
               ATTRB=(UNPROT,NORM),                                    X01579101
               HILIGHT=UNDERLINE,                                      X01579201
               COLOR=GREEN                                              01579301
AACT05  DFHMDF POS=(11,03),                                            X01579401
               LENGTH=03,                                              X01579501
               ATTRB=(ASKIP,NORM),                                     X01579601
               COLOR=BLUE                                               01579701
ATRLR05 DFHMDF POS=(11,07),                                            X01579801
               LENGTH=09,                                              X01579901
               ATTRB=(ASKIP,NORM),                                     X01580001
               PICOUT='ZZZZZZZZZ',                                     X01581001
               COLOR=BLUE                                               01582001
ATRIP05 DFHMDF POS=(11,17),                                            X01583001
               LENGTH=09,                                              X01584001
               ATTRB=(ASKIP,NORM),                                     X01585001
               PICOUT='ZZZZZZZZZ',                                     X01586001
               COLOR=BLUE                                               01587001
ADEST05 DFHMDF POS=(11,27),                                            X01588001
               LENGTH=04,                                              X01589001
               ATTRB=(ASKIP,NORM),                                     X01589101
               COLOR=BLUE                                               01589201
ASEAL05 DFHMDF POS=(11,32),                                            X01589301
               LENGTH=20,                                              X01589404
               ATTRB=(ASKIP,NORM),                                     X01589501
               COLOR=BLUE                                               01589601
ASTAT05 DFHMDF POS=(11,53),                                            X01589702
               LENGTH=07,                                              X01589801
               ATTRB=(ASKIP,NORM),                                     X01589901
               COLOR=BLUE                                               01590001
ADATE05 DFHMDF POS=(11,61),                                            X01591002
               LENGTH=10,                                              X01592001
               ATTRB=(ASKIP,NORM),                                     X01593001
               COLOR=BLUE                                               01594001
AUSER05 DFHMDF POS=(11,72),                                            X01595001
               LENGTH=08,                                              X01596001
               ATTRB=(ASKIP,NORM),                                     X01597001
               COLOR=BLUE                                               01598001
*********************************************************************** 01599001
ASEL06  DFHMDF POS=(12,01),                                            X01599101
               LENGTH=01,                                              X01599201
               ATTRB=(UNPROT,NORM),                                    X01599301
               HILIGHT=UNDERLINE,                                      X01599401
               COLOR=GREEN                                              01599501
AACT06  DFHMDF POS=(12,03),                                            X01599601
               LENGTH=03,                                              X01599701
               ATTRB=(ASKIP,NORM),                                     X01599801
               COLOR=BLUE                                               01599901
ATRLR06 DFHMDF POS=(12,07),                                            X01600001
               LENGTH=09,                                              X01601001
               ATTRB=(ASKIP,NORM),                                     X01602001
               PICOUT='ZZZZZZZZZ',                                     X01603001
               COLOR=BLUE                                               01604001
ATRIP06 DFHMDF POS=(12,17),                                            X01605001
               LENGTH=09,                                              X01606001
               ATTRB=(ASKIP,NORM),                                     X01607001
               PICOUT='ZZZZZZZZZ',                                     X01608001
               COLOR=BLUE                                               01609001
ADEST06 DFHMDF POS=(12,27),                                            X01609101
               LENGTH=04,                                              X01609201
               ATTRB=(ASKIP,NORM),                                     X01609301
               COLOR=BLUE                                               01609401
ASEAL06 DFHMDF POS=(12,32),                                            X01609501
               LENGTH=20,                                              X01609604
               ATTRB=(ASKIP,NORM),                                     X01609701
               COLOR=BLUE                                               01609801
ASTAT06 DFHMDF POS=(12,53),                                            X01609902
               LENGTH=07,                                              X01610001
               ATTRB=(ASKIP,NORM),                                     X01611001
               COLOR=BLUE                                               01612001
ADATE06 DFHMDF POS=(12,61),                                            X01613002
               LENGTH=10,                                              X01614001
               ATTRB=(ASKIP,NORM),                                     X01615001
               COLOR=BLUE                                               01616001
AUSER06 DFHMDF POS=(12,72),                                            X01617001
               LENGTH=08,                                              X01618001
               ATTRB=(ASKIP,NORM),                                     X01619001
               COLOR=BLUE                                               01619101
*********************************************************************** 01619201
ASEL07  DFHMDF POS=(13,01),                                            X01619301
               LENGTH=01,                                              X01619401
               ATTRB=(UNPROT,NORM),                                    X01619501
               HILIGHT=UNDERLINE,                                      X01619601
               COLOR=GREEN                                              01619701
AACT07  DFHMDF POS=(13,03),                                            X01619801
               LENGTH=03,                                              X01619901
               ATTRB=(ASKIP,NORM),                                     X01620001
               COLOR=BLUE                                               01621001
ATRLR07 DFHMDF POS=(13,07),                                            X01622001
               LENGTH=09,                                              X01623001
               ATTRB=(ASKIP,NORM),                                     X01624001
               PICOUT='ZZZZZZZZZ',                                     X01625001
               COLOR=BLUE                                               01626001
ATRIP07 DFHMDF POS=(13,17),                                            X01627001
               LENGTH=09,                                              X01628001
               ATTRB=(ASKIP,NORM),                                     X01629001
               PICOUT='ZZZZZZZZZ',                                     X01629101
               COLOR=BLUE                                               01629201
ADEST07 DFHMDF POS=(13,27),                                            X01629301
               LENGTH=04,                                              X01629401
               ATTRB=(ASKIP,NORM),                                     X01629501
               COLOR=BLUE                                               01629601
ASEAL07 DFHMDF POS=(13,32),                                            X01629701
               LENGTH=20,                                              X01629804
               ATTRB=(ASKIP,NORM),                                     X01629901
               COLOR=BLUE                                               01630001
ASTAT07 DFHMDF POS=(13,53),                                            X01631002
               LENGTH=07,                                              X01632001
               ATTRB=(ASKIP,NORM),                                     X01633001
               COLOR=BLUE                                               01634001
ADATE07 DFHMDF POS=(13,61),                                            X01635002
               LENGTH=10,                                              X01636001
               ATTRB=(ASKIP,NORM),                                     X01637001
               COLOR=BLUE                                               01638001
AUSER07 DFHMDF POS=(13,72),                                            X01639001
               LENGTH=08,                                              X01639101
               ATTRB=(ASKIP,NORM),                                     X01639201
               COLOR=BLUE                                               01639301
*********************************************************************** 01639401
ASEL08  DFHMDF POS=(14,01),                                            X01639501
               LENGTH=01,                                              X01639601
               ATTRB=(UNPROT,NORM),                                    X01639701
               HILIGHT=UNDERLINE,                                      X01639801
               COLOR=GREEN                                              01639901
AACT08  DFHMDF POS=(14,03),                                            X01640001
               LENGTH=03,                                              X01641001
               ATTRB=(ASKIP,NORM),                                     X01642001
               COLOR=BLUE                                               01643001
ATRLR08 DFHMDF POS=(14,07),                                            X01644001
               LENGTH=09,                                              X01645001
               ATTRB=(ASKIP,NORM),                                     X01646001
               PICOUT='ZZZZZZZZZ',                                     X01647001
               COLOR=BLUE                                               01648001
ATRIP08 DFHMDF POS=(14,17),                                            X01649001
               LENGTH=09,                                              X01649101
               ATTRB=(ASKIP,NORM),                                     X01649201
               PICOUT='ZZZZZZZZZ',                                     X01649301
               COLOR=BLUE                                               01649401
ADEST08 DFHMDF POS=(14,27),                                            X01649501
               LENGTH=04,                                              X01649601
               ATTRB=(ASKIP,NORM),                                     X01649701
               COLOR=BLUE                                               01649801
ASEAL08 DFHMDF POS=(14,32),                                            X01649901
               LENGTH=20,                                              X01650004
               ATTRB=(ASKIP,NORM),                                     X01651001
               COLOR=BLUE                                               01652001
ASTAT08 DFHMDF POS=(14,53),                                            X01653002
               LENGTH=07,                                              X01654001
               ATTRB=(ASKIP,NORM),                                     X01655001
               COLOR=BLUE                                               01656001
ADATE08 DFHMDF POS=(14,61),                                            X01657002
               LENGTH=10,                                              X01658001
               ATTRB=(ASKIP,NORM),                                     X01659001
               COLOR=BLUE                                               01659101
AUSER08 DFHMDF POS=(14,72),                                            X01659201
               LENGTH=08,                                              X01659301
               ATTRB=(ASKIP,NORM),                                     X01659401
               COLOR=BLUE                                               01659501
*********************************************************************** 01659601
ASEL09  DFHMDF POS=(15,01),                                            X01659701
               LENGTH=01,                                              X01659801
               ATTRB=(UNPROT,NORM),                                    X01659901
               HILIGHT=UNDERLINE,                                      X01660001
               COLOR=GREEN                                              01661001
AACT09  DFHMDF POS=(15,03),                                            X01662001
               LENGTH=03,                                              X01663001
               ATTRB=(ASKIP,NORM),                                     X01664001
               COLOR=BLUE                                               01665001
ATRLR09 DFHMDF POS=(15,07),                                            X01666001
               LENGTH=09,                                              X01667001
               ATTRB=(ASKIP,NORM),                                     X01668001
               PICOUT='ZZZZZZZZZ',                                     X01669001
               COLOR=BLUE                                               01669101
ATRIP09 DFHMDF POS=(15,17),                                            X01669201
               LENGTH=09,                                              X01669301
               ATTRB=(ASKIP,NORM),                                     X01669401
               PICOUT='ZZZZZZZZZ',                                     X01669501
               COLOR=BLUE                                               01669601
ADEST09 DFHMDF POS=(15,27),                                            X01669701
               LENGTH=04,                                              X01669801
               ATTRB=(ASKIP,NORM),                                     X01669901
               COLOR=BLUE                                               01670001
ASEAL09 DFHMDF POS=(15,32),                                            X01671001
               LENGTH=20,                                              X01672004
               ATTRB=(ASKIP,NORM),                                     X01673001
               COLOR=BLUE                                               01674001
ASTAT09 DFHMDF POS=(15,53),                                            X01675002
               LENGTH=07,                                              X01676001
               ATTRB=(ASKIP,NORM),                                     X01677001
               COLOR=BLUE                                               01678001
ADATE09 DFHMDF POS=(15,61),                                            X01679002
               LENGTH=10,                                              X01679101
               ATTRB=(ASKIP,NORM),                                     X01679201
               COLOR=BLUE                                               01679301
AUSER09 DFHMDF POS=(15,72),                                            X01679401
               LENGTH=08,                                              X01679501
               ATTRB=(ASKIP,NORM),                                     X01679601
               COLOR=BLUE                                               01679701
*********************************************************************** 01679801
ASEL10  DFHMDF POS=(16,01),                                            X01679901
               LENGTH=01,                                              X01680001
               ATTRB=(UNPROT,NORM),                                    X01681001
               HILIGHT=UNDERLINE,                                      X01682001
               COLOR=GREEN                                              01683001
AACT10  DFHMDF POS=(16,03),                                            X01684001
               LENGTH=03,                                              X01685001
               ATTRB=(ASKIP,NORM),                                     X01686001
               COLOR=BLUE                                               01687001
ATRLR10 DFHMDF POS=(16,07),                                            X01688001
               LENGTH=09,                                              X01689001
               ATTRB=(ASKIP,NORM),                                     X01689101
               PICOUT='ZZZZZZZZZ',                                     X01689201
               COLOR=BLUE                                               01689301
ATRIP10 DFHMDF POS=(16,17),                                            X01689401
               LENGTH=09,                                              X01689501
               ATTRB=(ASKIP,NORM),                                     X01689601
               PICOUT='ZZZZZZZZZ',                                     X01689701
               COLOR=BLUE                                               01689801
ADEST10 DFHMDF POS=(16,27),                                            X01689901
               LENGTH=04,                                              X01690001
               ATTRB=(ASKIP,NORM),                                     X01691001
               COLOR=BLUE                                               01692001
ASEAL10 DFHMDF POS=(16,32),                                            X01693001
               LENGTH=20,                                              X01694004
               ATTRB=(ASKIP,NORM),                                     X01695001
               COLOR=BLUE                                               01696001
ASTAT10 DFHMDF POS=(16,53),                                            X01697002
               LENGTH=07,                                              X01698001
               ATTRB=(ASKIP,NORM),                                     X01699001
               COLOR=BLUE                                               01699101
ADATE10 DFHMDF POS=(16,61),                                            X01699202
               LENGTH=10,                                              X01699301
               ATTRB=(ASKIP,NORM),                                     X01699401
               COLOR=BLUE                                               01699501
AUSER10 DFHMDF POS=(16,72),                                            X01699601
               LENGTH=08,                                              X01699701
               ATTRB=(ASKIP,NORM),                                     X01699801
               COLOR=BLUE                                               01699901
*********************************************************************** 01700001
ASEL11  DFHMDF POS=(17,01),                                            X01701001
               LENGTH=01,                                              X01702001
               ATTRB=(UNPROT,NORM),                                    X01703001
               HILIGHT=UNDERLINE,                                      X01704001
               COLOR=GREEN                                              01705001
AACT11  DFHMDF POS=(17,03),                                            X01706001
               LENGTH=03,                                              X01707001
               ATTRB=(ASKIP,NORM),                                     X01708001
               COLOR=BLUE                                               01709001
ATRLR11 DFHMDF POS=(17,07),                                            X01709101
               LENGTH=09,                                              X01709201
               ATTRB=(ASKIP,NORM),                                     X01709301
               PICOUT='ZZZZZZZZZ',                                     X01709401
               COLOR=BLUE                                               01709501
ATRIP11 DFHMDF POS=(17,17),                                            X01709601
               LENGTH=09,                                              X01709701
               ATTRB=(ASKIP,NORM),                                     X01709801
               PICOUT='ZZZZZZZZZ',                                     X01709901
               COLOR=BLUE                                               01710001
ADEST11 DFHMDF POS=(17,27),                                            X01711001
               LENGTH=04,                                              X01712001
               ATTRB=(ASKIP,NORM),                                     X01713001
               COLOR=BLUE                                               01714001
ASEAL11 DFHMDF POS=(17,32),                                            X01715001
               LENGTH=20,                                              X01716004
               ATTRB=(ASKIP,NORM),                                     X01717001
               COLOR=BLUE                                               01718001
ASTAT11 DFHMDF POS=(17,53),                                            X01719002
               LENGTH=07,                                              X01719101
               ATTRB=(ASKIP,NORM),                                     X01719201
               COLOR=BLUE                                               01719301
ADATE11 DFHMDF POS=(17,61),                                            X01719402
               LENGTH=10,                                              X01719501
               ATTRB=(ASKIP,NORM),                                     X01719601
               COLOR=BLUE                                               01719701
AUSER11 DFHMDF POS=(17,72),                                            X01719801
               LENGTH=08,                                              X01719901
               ATTRB=(ASKIP,NORM),                                     X01720001
               COLOR=BLUE                                               01721001
*********************************************************************** 01722001
ASEL12  DFHMDF POS=(18,01),                                            X01723001
               LENGTH=01,                                              X01724001
               ATTRB=(UNPROT,NORM),                                    X01725001
               HILIGHT=UNDERLINE,                                      X01726001
               COLOR=GREEN                                              01727001
AACT12  DFHMDF POS=(18,03),                                            X01728001
               LENGTH=03,                                              X01729001
               ATTRB=(ASKIP,NORM),                                     X01729101
               COLOR=BLUE                                               01729201
ATRLR12 DFHMDF POS=(18,07),                                            X01729301
               LENGTH=09,                                              X01729401
               ATTRB=(ASKIP,NORM),                                     X01729501
               PICOUT='ZZZZZZZZZ',                                     X01729601
               COLOR=BLUE                                               01729701
ATRIP12 DFHMDF POS=(18,17),                                            X01729801
               LENGTH=09,                                              X01729901
               ATTRB=(ASKIP,NORM),                                     X01730001
               PICOUT='ZZZZZZZZZ',                                     X01731001
               COLOR=BLUE                                               01732001
ADEST12 DFHMDF POS=(18,27),                                            X01733001
               LENGTH=04,                                              X01734001
               ATTRB=(ASKIP,NORM),                                     X01735001
               COLOR=BLUE                                               01736001
ASEAL12 DFHMDF POS=(18,32),                                            X01737001
               LENGTH=20,                                              X01738004
               ATTRB=(ASKIP,NORM),                                     X01739001
               COLOR=BLUE                                               01739101
ASTAT12 DFHMDF POS=(18,53),                                            X01739202
               LENGTH=07,                                              X01739301
               ATTRB=(ASKIP,NORM),                                     X01739401
               COLOR=BLUE                                               01739501
ADATE12 DFHMDF POS=(18,61),                                            X01739602
               LENGTH=10,                                              X01739701
               ATTRB=(ASKIP,NORM),                                     X01739801
               COLOR=BLUE                                               01739901
AUSER12 DFHMDF POS=(18,72),                                            X01740001
               LENGTH=08,                                              X01741001
               ATTRB=(ASKIP,NORM),                                     X01742001
               COLOR=BLUE                                               01743001
*********************************************************************** 01750001
*********************************************************************** 05820001
*********************************************************************** 05830001
        DFHMDF POS=(19,45),                                            X05840001
               LENGTH=25,                                              X05850001
               ATTRB=(ASKIP,NORM),                                     X05860001
               COLOR=NEUTRAL,                                          X05870001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      05880001
ASELIT  DFHMDF POS=(19,72),                                            X05890001
               LENGTH=07,                                              X05900001
               ATTRB=(ASKIP,NORM),                                     X05910001
               COLOR=BLUE,                                             X05920001
               PICOUT='ZZZ,ZZ9'                                         05930001
        DFHMSD TYPE=FINAL                                               05940001
        END                                                             05950001
