*          DATA SET SUKM765                                             00010000
        PRINT  NOGEN                                                    00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  SUKM765                                            *   00050000
*        MAP     SUK765                                             *   00060000
*        PROGRAM SUKCS765                                           *   00070000
*        TRANSID S765 - DIRECTIVE RELEASE CARTON LIST               *   00080000
*                                                                   *   00090000
*-------------------------------------------------------------------*   00100000
SUKM765 DFHMSD TYPE=DSECT,                                             X00110000
               LANG=COBOL,                                             X00120000
               MODE=INOUT,                                             X00130000
               STORAGE=AUTO,                                           X00140000
               TERM=3270-2,                                            X00150000
               TIOAPFX=YES                                              00160000
**********************************************************************  00170000
SUK765  DFHMDI LINE=2,COLUMN=1,                                        X00180000
               SIZE=(19,80),                                           X00190000
               CTRL=(FREEKB),                                          X00200000
               MAPATTS=(COLOR,HILIGHT),                                X00210000
               DSATTS=(COLOR,HILIGHT)                                   00220000
**********************************************************************  00230000
**********************************************************************  00240000
         DFHMDF POS=(03,02),                                           X00250018
               LENGTH=12,                                              X00260023
               ATTRB=(ASKIP,NORM),                                     X00270018
               COLOR=NEUTRAL,                                          X00280018
               INITIAL='OPER UNT ID:'                                   00290023
AOPRUNT  DFHMDF POS=(03,15),                                           X00300023
               LENGTH=04,                                              X00310018
               PICOUT='ZZZ9',                                          X00311025
               ATTRB=(ASKIP,NORM),                                     X00320018
               COLOR=BLUE                                               00330018
         DFHMDF POS=(03,31),                                           X00340018
               LENGTH=12,                                              X00350018
               ATTRB=(ASKIP,NORM),                                     X00360018
               COLOR=NEUTRAL,                                          X00370018
               INITIAL='PO/RCVR....:'                                   00380018
APORCVR  DFHMDF POS=(03,44),                                           X00390018
               LENGTH=12,                                              X00400018
               ATTRB=(ASKIP,NORM),                                     X00410018
               COLOR=BLUE                                               00420018
         DFHMDF POS=(03,57),                                           X00430018
               LENGTH=12,                                              X00440021
               ATTRB=(ASKIP,NORM),                                     X00450018
               COLOR=NEUTRAL,                                          X00460018
               INITIAL='PKG TYPE...:'                                   00470022
APCKTY   DFHMDF POS=(03,70),                                           X00480021
               LENGTH=10,                                              X00490021
               ATTRB=(ASKIP,NORM),                                     X00500018
               COLOR=BLUE                                               00510018
**********************************************************************  00520018
**********************************************************************  00530018
         DFHMDF POS=(04,02),                                           X00540018
               LENGTH=12,                                              X00550023
               ATTRB=(ASKIP,NORM),                                     X00560018
               COLOR=NEUTRAL,                                          X00570018
               INITIAL='SCAC/TRLR..:'                                   00580023
ASCAC    DFHMDF POS=(04,15),                                           X00590023
               LENGTH=04,                                              X00600018
               ATTRB=(ASKIP,NORM),                                     X00610018
               COLOR=BLUE                                               00620018
ATRLR    DFHMDF POS=(04,20),                                           X00630023
               LENGTH=10,                                              X00640018
               ATTRB=(ASKIP,NORM),                                     X00650018
               COLOR=BLUE                                               00660018
         DFHMDF POS=(04,31),                                           X00670018
               LENGTH=12,                                              X00680018
               ATTRB=(ASKIP,NORM),                                     X00690018
               COLOR=NEUTRAL,                                          X00700018
               INITIAL='TRIP ID....:'                                   00710018
ATRIPID  DFHMDF POS=(04,44),                                           X00720018
               LENGTH=09,                                              X00730018
               ATTRB=(ASKIP,NORM),                                     X00740018
               COLOR=BLUE                                               00750018
         DFHMDF POS=(04,57),                                           X00760018
               LENGTH=12,                                              X00770021
               ATTRB=(ASKIP,NORM),                                     X00780018
               COLOR=NEUTRAL,                                          X00790018
               INITIAL='ARR DATE...:'                                   00800022
AARRDAT  DFHMDF POS=(04,70),                                           X00810021
               LENGTH=08,                                              X00820021
               ATTRB=(ASKIP,NORM),                                     X00830018
               COLOR=BLUE                                               00840018
**********************************************************************  00850018
**********************************************************************  00860018
         DFHMDF POS=(05,02),                                           X00870018
               LENGTH=12,                                              X00880023
               ATTRB=(ASKIP,NORM),                                     X00890018
               COLOR=NEUTRAL,                                          X00900018
               INITIAL='TRLR STATUS:'                                   00910023
ATRLSTT  DFHMDF POS=(05,15),                                           X00920023
               LENGTH=09,                                              X00930018
               ATTRB=(ASKIP,NORM),                                     X00940018
               COLOR=BLUE                                               00950018
         DFHMDF POS=(05,31),                                           X00960018
               LENGTH=12,                                              X00970018
               ATTRB=(ASKIP,NORM),                                     X00980018
               COLOR=NEUTRAL,                                          X00990018
               INITIAL='EXP CTN CNT:'                                   01000018
AEXPCTN  DFHMDF POS=(05,44),                                           X01010018
               LENGTH=07,                                              X01020018
               PICOUT='ZZZZZZ9',                                       X01021025
               ATTRB=(ASKIP,NORM),                                     X01030018
               COLOR=BLUE                                               01040018
         DFHMDF POS=(05,57),                                           X01050018
               LENGTH=12,                                              X01060018
               ATTRB=(ASKIP,NORM),                                     X01070018
               COLOR=NEUTRAL,                                          X01080018
               INITIAL='DIR CTN CNT:'                                   01090018
ADIRCTN  DFHMDF POS=(05,70),                                           X01100018
               LENGTH=07,                                              X01110018
               PICOUT='ZZZZZZ9',                                       X01111025
               ATTRB=(ASKIP,NORM),                                     X01120018
               COLOR=BLUE                                               01130018
*******************************************************************     01440002
         DFHMDF POS=(06,51),                                           X01450002
               LENGTH=05,                                              X01460002
               ATTRB=(ASKIP,NORM),                                     X01470002
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01480002
ASTRTIT  DFHMDF POS=(06,57),                                           X01490002
               LENGTH=05,                                              X01500002
               ATTRB=(NUM,UNPROT,NORM),                                X01510002
               COLOR=GREEN,                                            X01520002
               PICOUT='ZZZZ9',                                         X01530002
               HILIGHT=UNDERLINE                                        01540002
         DFHMDF POS=(06,63),                                           X01550002
               LENGTH=02,                                              X01560002
               ATTRB=(ASKIP,NORM),                                     X01570002
               COLOR=NEUTRAL,                                          X01580002
               INITIAL='TO'                                             01590002
AENDIT   DFHMDF POS=(06,66),                                           X01600002
               LENGTH=05,                                              X01610002
               ATTRB=(ASKIP,NORM),                                     X01620002
               COLOR=BLUE,                                             X01630002
               PICOUT='ZZZZ9'                                           01640002
         DFHMDF POS=(06,72),                                           X01650002
               LENGTH=02,                                              X01660002
               ATTRB=(ASKIP,NORM),                                     X01670002
               COLOR=NEUTRAL,                                          X01680002
               INITIAL='OF'                                             01690002
ATOTIT  DFHMDF POS=(06,75),                                            X01700002
               LENGTH=05,                                              X01710002
               ATTRB=(ASKIP,NORM),                                     X01720002
               COLOR=BLUE,                                             X01730002
               PICOUT='ZZZZ9'                                           01740002
**********************************************************************  01770000
         DFHMDF POS=(07,08),                                           X01780000
               LENGTH=34,                                              X01790012
               ATTRB=(ASKIP,NORM),                                     X01800000
               COLOR=NEUTRAL,                                          X01810000
               INITIAL='  LINE                        ORIG'             01820013
         DFHMDF POS=(07,43),                                           X01821012
               LENGTH=36,                                              X01822012
               ATTRB=(ASKIP,NORM),                                     X01823000
               COLOR=NEUTRAL,                                          X01824000
               INITIAL='PROMPT   PROMPT    DIRECTIVE CREATED'           01825012
**********************************************************************  01840000
         DFHMDF POS=(08,02),                                           X01850000
               LENGTH=33,                                              X01860000
               ATTRB=(ASKIP,NORM),                                     X01870000
               COLOR=NEUTRAL,                                          X01880000
               INITIAL='S   ACT PACK SML / P2L DEST      '              01890024
         DFHMDF POS=(08,38),                                           X01910011
               LENGTH=22,                                              X01920000
               ATTRB=(ASKIP,NORM),                                     X01930000
               COLOR=NEUTRAL,                                          X01940000
               INITIAL='CASI AUD STAT AUD NBR'                          01950000
         DFHMDF POS=(08,62),                                           X02140011
               LENGTH=17,                                              X02150000
               ATTRB=(ASKIP,NORM),                                     X02160000
               COLOR=NEUTRAL,                                          X02170000
               INITIAL='--DATE-- --TIME--'                              02180000
**********************************************************************  02200000
ASEL01  DFHMDF POS=(09,002),                                           X02210000
               COLOR=GREEN,                                            X02220000
               HILIGHT=UNDERLINE,                                      X02230000
               ATTRB=(UNPROT,NORM),                                    X02240000
               LENGTH=001                                               02250000
         DFHMDF POS=(09,04),                                           X02251004
               ATTRB=(ASKIP,DRK),                                      X02252004
               LENGTH=001                                               02253004
AACT01  DFHMDF POS=(09,006),                                           X02260007
               ATTRB=(ASKIP,NORM),                                     X02270000
               LENGTH=003                                               02290000
ALINE01 DFHMDF POS=(09,010),                                           X02300007
               ATTRB=(ASKIP,NORM),                                     X02310000
               COLOR=BLUE,                                             X02311014
               LENGTH=004                                               02330000
ABAR01  DFHMDF POS=(09,015),                                           X02340007
               COLOR=BLUE,                                             X02350000
               ATTRB=(ASKIP,NORM),                                     X02360000
               LENGTH=022                                               02380000
ACASI01 DFHMDF POS=(09,040),                                           X02390011
               COLOR=BLUE,                                             X02400000
               ATTRB=(ASKIP,NORM),                                     X02410000
               LENGTH=001                                               02430000
AAUST01 DFHMDF POS=(09,043),                                           X02440011
               COLOR=BLUE,                                             X02450000
               ATTRB=(ASKIP,NORM),                                     X02460000
               LENGTH=008                                               02480000
AANBR01 DFHMDF POS=(09,052),                                           X02490011
               COLOR=BLUE,                                             X02500000
               ATTRB=(ASKIP,NORM),                                     X02510000
               LENGTH=009                                               02530000
ADATE01 DFHMDF POS=(09,062),                                           X02750000
               COLOR=BLUE,                                             X02760000
               ATTRB=(ASKIP,NORM),                                     X02770000
               LENGTH=008                                               02780000
ATIME01 DFHMDF POS=(09,071),                                           X02790000
               COLOR=BLUE,                                             X02800000
               ATTRB=(ASKIP,NORM),                                     X02810000
               LENGTH=008                                               02820000
**********************************************************************  02830005
ASEL02  DFHMDF POS=(10,002),                                           X02840006
               COLOR=GREEN,                                            X02850005
               HILIGHT=UNDERLINE,                                      X02860005
               ATTRB=(UNPROT,NORM),                                    X02870005
               LENGTH=001                                               02880005
         DFHMDF POS=(10,04),                                           X02890006
               ATTRB=(ASKIP,DRK),                                      X02900005
               LENGTH=001                                               02910005
AACT02  DFHMDF POS=(10,006),                                           X02920007
               ATTRB=(ASKIP,NORM),                                     X02930005
               LENGTH=003                                               02940005
ALINE02 DFHMDF POS=(10,010),                                           X02950007
               ATTRB=(ASKIP,NORM),                                     X02960005
               COLOR=BLUE,                                             X02961014
               LENGTH=004                                               02970005
ABAR02  DFHMDF POS=(10,015),                                           X02980007
               COLOR=BLUE,                                             X02990005
               ATTRB=(ASKIP,NORM),                                     X03000005
               LENGTH=022                                               03010005
ACASI02 DFHMDF POS=(10,040),                                           X03020011
               COLOR=BLUE,                                             X03030005
               ATTRB=(ASKIP,NORM),                                     X03040005
               LENGTH=001                                               03050005
AAUST02 DFHMDF POS=(10,043),                                           X03060011
               COLOR=BLUE,                                             X03070005
               ATTRB=(ASKIP,NORM),                                     X03080005
               LENGTH=008                                               03090005
AANBR02 DFHMDF POS=(10,052),                                           X03100011
               COLOR=BLUE,                                             X03110005
               ATTRB=(ASKIP,NORM),                                     X03120005
               LENGTH=009                                               03130005
ADATE02 DFHMDF POS=(10,062),                                           X03140006
               COLOR=BLUE,                                             X03150005
               ATTRB=(ASKIP,NORM),                                     X03160005
               LENGTH=008                                               03170005
ATIME02 DFHMDF POS=(10,071),                                           X03180006
               COLOR=BLUE,                                             X03190005
               ATTRB=(ASKIP,NORM),                                     X03200005
               LENGTH=008                                               03210005
**********************************************************************  03220005
ASEL03  DFHMDF POS=(11,002),                                           X03230006
               COLOR=GREEN,                                            X03240005
               HILIGHT=UNDERLINE,                                      X03250005
               ATTRB=(UNPROT,NORM),                                    X03260005
               LENGTH=001                                               03270005
         DFHMDF POS=(11,04),                                           X03280006
               ATTRB=(ASKIP,DRK),                                      X03290005
               LENGTH=001                                               03300005
AACT03  DFHMDF POS=(11,006),                                           X03310007
               ATTRB=(ASKIP,NORM),                                     X03320005
               LENGTH=003                                               03330005
ALINE03 DFHMDF POS=(11,010),                                           X03340007
               ATTRB=(ASKIP,NORM),                                     X03350005
               COLOR=BLUE,                                             X03351014
               LENGTH=004                                               03360005
ABAR03  DFHMDF POS=(11,015),                                           X03370007
               COLOR=BLUE,                                             X03380005
               ATTRB=(ASKIP,NORM),                                     X03390005
               LENGTH=022                                               03400005
ACASI03 DFHMDF POS=(11,040),                                           X03410011
               COLOR=BLUE,                                             X03420005
               ATTRB=(ASKIP,NORM),                                     X03430005
               LENGTH=001                                               03440005
AAUST03 DFHMDF POS=(11,043),                                           X03450011
               COLOR=BLUE,                                             X03460005
               ATTRB=(ASKIP,NORM),                                     X03470005
               LENGTH=008                                               03480005
AANBR03 DFHMDF POS=(11,052),                                           X03490011
               COLOR=BLUE,                                             X03500005
               ATTRB=(ASKIP,NORM),                                     X03510005
               LENGTH=009                                               03520005
ADATE03 DFHMDF POS=(11,062),                                           X03530006
               COLOR=BLUE,                                             X03540005
               ATTRB=(ASKIP,NORM),                                     X03550005
               LENGTH=008                                               03560005
ATIME03 DFHMDF POS=(11,071),                                           X03570006
               COLOR=BLUE,                                             X03580005
               ATTRB=(ASKIP,NORM),                                     X03590005
               LENGTH=008                                               03600005
**********************************************************************  03610005
ASEL04  DFHMDF POS=(12,002),                                           X03620006
               COLOR=GREEN,                                            X03630005
               HILIGHT=UNDERLINE,                                      X03640005
               ATTRB=(UNPROT,NORM),                                    X03650005
               LENGTH=001                                               03660005
         DFHMDF POS=(12,04),                                           X03670006
               ATTRB=(ASKIP,DRK),                                      X03680005
               LENGTH=001                                               03690005
AACT04  DFHMDF POS=(12,006),                                           X03700007
               ATTRB=(ASKIP,NORM),                                     X03710005
               LENGTH=003                                               03720005
ALINE04 DFHMDF POS=(12,010),                                           X03730007
               ATTRB=(ASKIP,NORM),                                     X03740005
               COLOR=BLUE,                                             X03741014
               LENGTH=004                                               03750005
ABAR04  DFHMDF POS=(12,015),                                           X03760007
               COLOR=BLUE,                                             X03770005
               ATTRB=(ASKIP,NORM),                                     X03780005
               LENGTH=022                                               03790005
ACASI04 DFHMDF POS=(12,040),                                           X03800011
               COLOR=BLUE,                                             X03810005
               ATTRB=(ASKIP,NORM),                                     X03820005
               LENGTH=001                                               03830005
AAUST04 DFHMDF POS=(12,043),                                           X03840011
               COLOR=BLUE,                                             X03850005
               ATTRB=(ASKIP,NORM),                                     X03860005
               LENGTH=008                                               03870005
AANBR04 DFHMDF POS=(12,052),                                           X03880011
               COLOR=BLUE,                                             X03890005
               ATTRB=(ASKIP,NORM),                                     X03900005
               LENGTH=009                                               03910005
ADATE04 DFHMDF POS=(12,062),                                           X03920006
               COLOR=BLUE,                                             X03930005
               ATTRB=(ASKIP,NORM),                                     X03940005
               LENGTH=008                                               03950005
ATIME04 DFHMDF POS=(12,071),                                           X03960006
               COLOR=BLUE,                                             X03970005
               ATTRB=(ASKIP,NORM),                                     X03980005
               LENGTH=008                                               03990005
**********************************************************************  04000005
ASEL05  DFHMDF POS=(13,002),                                           X04010006
               COLOR=GREEN,                                            X04020005
               HILIGHT=UNDERLINE,                                      X04030005
               ATTRB=(UNPROT,NORM),                                    X04040005
               LENGTH=001                                               04050005
         DFHMDF POS=(13,04),                                           X04060006
               ATTRB=(ASKIP,DRK),                                      X04070005
               LENGTH=001                                               04080005
AACT05  DFHMDF POS=(13,006),                                           X04090007
               ATTRB=(ASKIP,NORM),                                     X04100005
               LENGTH=003                                               04110005
ALINE05 DFHMDF POS=(13,010),                                           X04120007
               ATTRB=(ASKIP,NORM),                                     X04130005
               COLOR=BLUE,                                             X04131014
               LENGTH=004                                               04140005
ABAR05  DFHMDF POS=(13,015),                                           X04150007
               COLOR=BLUE,                                             X04160005
               ATTRB=(ASKIP,NORM),                                     X04170005
               LENGTH=022                                               04180005
ACASI05 DFHMDF POS=(13,040),                                           X04190011
               COLOR=BLUE,                                             X04200005
               ATTRB=(ASKIP,NORM),                                     X04210005
               LENGTH=001                                               04220005
AAUST05 DFHMDF POS=(13,043),                                           X04230011
               COLOR=BLUE,                                             X04240005
               ATTRB=(ASKIP,NORM),                                     X04250005
               LENGTH=008                                               04260005
AANBR05 DFHMDF POS=(13,052),                                           X04270011
               COLOR=BLUE,                                             X04280005
               ATTRB=(ASKIP,NORM),                                     X04290005
               LENGTH=009                                               04300005
ADATE05 DFHMDF POS=(13,062),                                           X04310006
               COLOR=BLUE,                                             X04320005
               ATTRB=(ASKIP,NORM),                                     X04330005
               LENGTH=008                                               04340005
ATIME05 DFHMDF POS=(13,071),                                           X04350006
               COLOR=BLUE,                                             X04360005
               ATTRB=(ASKIP,NORM),                                     X04370005
               LENGTH=008                                               04380005
**********************************************************************  04390005
ASEL06  DFHMDF POS=(14,002),                                           X04400006
               COLOR=GREEN,                                            X04410005
               HILIGHT=UNDERLINE,                                      X04420005
               ATTRB=(UNPROT,NORM),                                    X04430005
               LENGTH=001                                               04440005
         DFHMDF POS=(14,04),                                           X04450006
               ATTRB=(ASKIP,DRK),                                      X04460005
               LENGTH=001                                               04470005
AACT06  DFHMDF POS=(14,006),                                           X04480007
               ATTRB=(ASKIP,NORM),                                     X04490005
               LENGTH=003                                               04500005
ALINE06 DFHMDF POS=(14,010),                                           X04510007
               ATTRB=(ASKIP,NORM),                                     X04520005
               COLOR=BLUE,                                             X04521014
               LENGTH=004                                               04530005
ABAR06  DFHMDF POS=(14,015),                                           X04540007
               COLOR=BLUE,                                             X04550005
               ATTRB=(ASKIP,NORM),                                     X04560005
               LENGTH=022                                               04570005
ACASI06 DFHMDF POS=(14,040),                                           X04580011
               COLOR=BLUE,                                             X04590005
               ATTRB=(ASKIP,NORM),                                     X04600005
               LENGTH=001                                               04610005
AAUST06 DFHMDF POS=(14,043),                                           X04620011
               COLOR=BLUE,                                             X04630005
               ATTRB=(ASKIP,NORM),                                     X04640005
               LENGTH=008                                               04650005
AANBR06 DFHMDF POS=(14,052),                                           X04660011
               COLOR=BLUE,                                             X04670005
               ATTRB=(ASKIP,NORM),                                     X04680005
               LENGTH=009                                               04690005
ADATE06 DFHMDF POS=(14,062),                                           X04700006
               COLOR=BLUE,                                             X04710005
               ATTRB=(ASKIP,NORM),                                     X04720005
               LENGTH=008                                               04730005
ATIME06 DFHMDF POS=(14,071),                                           X04740006
               COLOR=BLUE,                                             X04750005
               ATTRB=(ASKIP,NORM),                                     X04760005
               LENGTH=008                                               04770005
**********************************************************************  04780005
ASEL07  DFHMDF POS=(15,002),                                           X04790006
               COLOR=GREEN,                                            X04800005
               HILIGHT=UNDERLINE,                                      X04810005
               ATTRB=(UNPROT,NORM),                                    X04820005
               LENGTH=001                                               04830005
         DFHMDF POS=(15,04),                                           X04840006
               ATTRB=(ASKIP,DRK),                                      X04850005
               LENGTH=001                                               04860005
AACT07  DFHMDF POS=(15,006),                                           X04870007
               ATTRB=(ASKIP,NORM),                                     X04880005
               LENGTH=003                                               04890005
ALINE07 DFHMDF POS=(15,010),                                           X04900007
               ATTRB=(ASKIP,NORM),                                     X04910005
               COLOR=BLUE,                                             X04911014
               LENGTH=004                                               04920005
ABAR07  DFHMDF POS=(15,015),                                           X04930007
               COLOR=BLUE,                                             X04940005
               ATTRB=(ASKIP,NORM),                                     X04950005
               LENGTH=022                                               04960005
ACASI07 DFHMDF POS=(15,040),                                           X04970011
               COLOR=BLUE,                                             X04980005
               ATTRB=(ASKIP,NORM),                                     X04990005
               LENGTH=001                                               05000005
AAUST07 DFHMDF POS=(15,043),                                           X05010011
               COLOR=BLUE,                                             X05020005
               ATTRB=(ASKIP,NORM),                                     X05030005
               LENGTH=008                                               05040005
AANBR07 DFHMDF POS=(15,052),                                           X05050011
               COLOR=BLUE,                                             X05060005
               ATTRB=(ASKIP,NORM),                                     X05070005
               LENGTH=009                                               05080005
ADATE07 DFHMDF POS=(15,062),                                           X05090006
               COLOR=BLUE,                                             X05100005
               ATTRB=(ASKIP,NORM),                                     X05110005
               LENGTH=008                                               05120005
ATIME07 DFHMDF POS=(15,071),                                           X05130006
               COLOR=BLUE,                                             X05140005
               ATTRB=(ASKIP,NORM),                                     X05150005
               LENGTH=008                                               05160005
**********************************************************************  05170005
ASEL08  DFHMDF POS=(16,002),                                           X05180006
               COLOR=GREEN,                                            X05190005
               HILIGHT=UNDERLINE,                                      X05200005
               ATTRB=(UNPROT,NORM),                                    X05210005
               LENGTH=001                                               05220005
         DFHMDF POS=(16,04),                                           X05230006
               ATTRB=(ASKIP,DRK),                                      X05240005
               LENGTH=001                                               05250005
AACT08  DFHMDF POS=(16,006),                                           X05260007
               ATTRB=(ASKIP,NORM),                                     X05270005
               LENGTH=003                                               05280005
ALINE08 DFHMDF POS=(16,010),                                           X05290007
               ATTRB=(ASKIP,NORM),                                     X05300005
               COLOR=BLUE,                                             X05301014
               LENGTH=004                                               05310005
ABAR08  DFHMDF POS=(16,015),                                           X05320007
               COLOR=BLUE,                                             X05330005
               ATTRB=(ASKIP,NORM),                                     X05340005
               LENGTH=022                                               05350005
ACASI08 DFHMDF POS=(16,040),                                           X05360011
               COLOR=BLUE,                                             X05370005
               ATTRB=(ASKIP,NORM),                                     X05380005
               LENGTH=001                                               05390005
AAUST08 DFHMDF POS=(16,043),                                           X05400011
               COLOR=BLUE,                                             X05410005
               ATTRB=(ASKIP,NORM),                                     X05420005
               LENGTH=008                                               05430005
AANBR08 DFHMDF POS=(16,052),                                           X05440011
               COLOR=BLUE,                                             X05450005
               ATTRB=(ASKIP,NORM),                                     X05460005
               LENGTH=009                                               05470005
ADATE08 DFHMDF POS=(16,062),                                           X05480006
               COLOR=BLUE,                                             X05490005
               ATTRB=(ASKIP,NORM),                                     X05500005
               LENGTH=008                                               05510005
ATIME08 DFHMDF POS=(16,071),                                           X05520006
               COLOR=BLUE,                                             X05530005
               ATTRB=(ASKIP,NORM),                                     X05540005
               LENGTH=008                                               05550005
**********************************************************************  05560005
ASEL09  DFHMDF POS=(17,002),                                           X05570006
               COLOR=GREEN,                                            X05580005
               HILIGHT=UNDERLINE,                                      X05590005
               ATTRB=(UNPROT,NORM),                                    X05600005
               LENGTH=001                                               05610005
         DFHMDF POS=(17,04),                                           X05620006
               ATTRB=(ASKIP,DRK),                                      X05630005
               LENGTH=001                                               05640005
AACT09  DFHMDF POS=(17,006),                                           X05650007
               ATTRB=(ASKIP,NORM),                                     X05660005
               LENGTH=003                                               05670005
ALINE09 DFHMDF POS=(17,010),                                           X05680007
               ATTRB=(ASKIP,NORM),                                     X05690005
               COLOR=BLUE,                                             X05691014
               LENGTH=004                                               05700005
ABAR09  DFHMDF POS=(17,015),                                           X05710007
               COLOR=BLUE,                                             X05720005
               ATTRB=(ASKIP,NORM),                                     X05730005
               LENGTH=022                                               05740005
ACASI09 DFHMDF POS=(17,040),                                           X05750011
               COLOR=BLUE,                                             X05760005
               ATTRB=(ASKIP,NORM),                                     X05770005
               LENGTH=001                                               05780005
AAUST09 DFHMDF POS=(17,043),                                           X05790011
               COLOR=BLUE,                                             X05800005
               ATTRB=(ASKIP,NORM),                                     X05810005
               LENGTH=008                                               05820005
AANBR09 DFHMDF POS=(17,052),                                           X05830011
               COLOR=BLUE,                                             X05840005
               ATTRB=(ASKIP,NORM),                                     X05850005
               LENGTH=009                                               05860005
ADATE09 DFHMDF POS=(17,062),                                           X05870006
               COLOR=BLUE,                                             X05880005
               ATTRB=(ASKIP,NORM),                                     X05890005
               LENGTH=008                                               05900005
ATIME09 DFHMDF POS=(17,071),                                           X05910006
               COLOR=BLUE,                                             X05920005
               ATTRB=(ASKIP,NORM),                                     X05930005
               LENGTH=008                                               05940005
**********************************************************************  06351200
**********************************************************************  06390300
         DFHMDF POS=(19,045),                                          X06390400
               COLOR=NEUTRAL,                                          X06390500
               ATTRB=(ASKIP,NORM),                                     X06390600
               LENGTH=025,                                             X06390700
               INITIAL='NUMBER OF SELECTED ITEMS:'                      06390800
ASELIT   DFHMDF POS=(19,072),                                          X06390900
               COLOR=BLUE,                                             X06391000
               ATTRB=(ASKIP,NORM),                                     X06391100
               LENGTH=007,                                             X06391200
               PICOUT='ZZZ,ZZ9'                                         06391300
**********************************************************************  06391400
         DFHMSD TYPE=FINAL                                              06392000
         END                                                            06400000
