*********************************************************************** 00030001
*                                                                       00040001
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON     00050001
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP              00060001
*********************************************************************** 00070001
*          DATA SET SUKM759                                             00080001
  PRINT  NOGEN                                                          00090001
*-------------------------------------------------------------------*   00100001
*                                                                   *   00110001
*        MAPSET  SUKM759                                            *   00120001
*        MAP     SU759A                                             *   00130001
*        PROGRAM SUKCS759                                           *   00140001
*        TRANSID S759 - SU-STORE UNIT ADJUSTMENT DETAIL             *   00150001
*        SYSTEM  SHIPPING UNIT (SU)                                 *   00160001
*                                                                   *   00170001
*-------------------------------------------------------------------*   00180001
SUKM759  DFHMSD TYPE=&&SYSPARM,                                        X00190001
               CTRL=(FREEKB),                                          X00200001
               LANG=COBOL,                                             X00210001
               MODE=INOUT,                                             X00220001
               TIOAPFX=YES                                              00230001
SU759A   DFHMDI SIZE=(19,080),                                         X00240001
               MAPATTS=(COLOR,HILIGHT),                                X00250001
               DSATTS=(COLOR,HILIGHT),                                 X00260001
               LINE=02,                                                X00270001
               COLUMN=01                                                00280001
*********************************************************************** 00290001
         DFHMDF POS=(02,001),                                          X00300001
               COLOR=NEUTRAL,                                          X00310001
               ATTRB=(ASKIP,BRT),                                      X00320001
               LENGTH=016,                                             X00330001
               INITIAL='OPER UNIT ID...:'                               00340001
AOPER    DFHMDF POS=(02,018),                                          X00350001
               COLOR=BLUE,                                             X00360003
               ATTRB=(ASKIP,NORM),                                     X00370003
               LENGTH=004                                               00380001
AOPNAME  DFHMDF POS=(02,023),                                          X00390001
               COLOR=BLUE,                                             X00390103
               ATTRB=(ASKIP,NORM),                                     X00390203
               LENGTH=025                                               00390507
         DFHMDF POS=(02,051),                                          X00391007
               COLOR=NEUTRAL,                                          X00392001
               ATTRB=(ASKIP,BRT),                                      X00393001
               LENGTH=017,                                             X00394001
               INITIAL='AUDIT INFORMATION'                              00395001
*********************************************************************** 00396001
         DFHMDF POS=(03,001),                                          X00397001
               COLOR=NEUTRAL,                                          X00398001
               ATTRB=(ASKIP,BRT),                                      X00399001
               LENGTH=016,                                             X00399101
               INITIAL='PO-RCVR-LINE...:'                               00399201
APORCVRL DFHMDF POS=(03,018),                                          X00399301
               COLOR=BLUE,                                             X00399403
               ATTRB=(ASKIP,NORM),                                     X00399503
               LENGTH=018                                               00399801
         DFHMDF POS=(03,051),                                          X00400107
               COLOR=NEUTRAL,                                          X00400201
               ATTRB=(ASKIP,BRT),                                      X00400301
               LENGTH=007,                                             X00400401
               INITIAL='NUMBER:'                                        00400501
ANUMBER  DFHMDF POS=(03,059),                                          X00400607
               COLOR=BLUE,                                             X00400703
               ATTRB=(ASKIP,NORM),                                     X00400803
               LENGTH=009                                               00401101
*********************************************************************** 00401201
         DFHMDF POS=(04,001),                                          X00401301
               COLOR=NEUTRAL,                                          X00401401
               ATTRB=(ASKIP,BRT),                                      X00401501
               LENGTH=016,                                             X00401601
               INITIAL='SKU/UPC NBR....:'                               00401715
ASKUUPC  DFHMDF POS=(04,018),                                          X00401815
               COLOR=BLUE,                                             X00401903
               ATTRB=(ASKIP,NORM),                                     X00402003
               LENGTH=024                                               00402315
         DFHMDF POS=(04,051),                                          X00402407
               COLOR=NEUTRAL,                                          X00402501
               ATTRB=(ASKIP,BRT),                                      X00402601
               LENGTH=007,                                             X00402701
               INITIAL='STATUS:'                                        00402801
ASTATUS  DFHMDF POS=(04,059),                                          X00402907
               COLOR=BLUE,                                             X00403003
               ATTRB=(ASKIP,NORM),                                     X00403103
               LENGTH=017                                               00403407
*********************************************************************** 00403501
         DFHMDF POS=(05,001),                                          X00403601
               COLOR=NEUTRAL,                                          X00403701
               ATTRB=(ASKIP,BRT),                                      X00403801
               LENGTH=016,                                             X00403901
               INITIAL='STORE DEST.....:'                               00404001
ASTORE   DFHMDF POS=(05,018),                                          X00404101
               COLOR=BLUE,                                             X00404203
               ATTRB=(ASKIP,NORM),                                     X00404303
               LENGTH=004                                               00404601
ASTRNAME DFHMDF POS=(05,023),                                          X00404701
               COLOR=BLUE,                                             X00404803
               ATTRB=(ASKIP,NORM),                                     X00404903
               LENGTH=025                                               00405207
         DFHMDF POS=(05,051),                                          X00405307
               COLOR=NEUTRAL,                                          X00405401
               ATTRB=(ASKIP,BRT),                                      X00405501
               LENGTH=007,                                             X00405601
               INITIAL='TYPE..:'                                        00405701
AAUDTYPE DFHMDF POS=(05,059),                                          X00405807
               COLOR=BLUE,                                             X00405903
               ATTRB=(ASKIP,NORM),                                     X00406003
               LENGTH=017                                               00407007
*********************************************************************** 00408014
         DFHMDF POS=(06,001),                                          X00409014
               COLOR=NEUTRAL,                                          X00410014
               ATTRB=(ASKIP,BRT),                                      X00420014
               LENGTH=016,                                             X00430014
               INITIAL='SML #..........:'                               00440014
ASMLNO   DFHMDF POS=(06,018),                                          X00450014
               COLOR=BLUE,                                             X00460014
               ATTRB=(ASKIP,NORM),                                     X00470014
               LENGTH=018                                               00480014
*********************************************************************** 00620001
         DFHMDF POS=(07,001),                                          X00630001
               COLOR=NEUTRAL,                                          X00640001
               ATTRB=(ASKIP,BRT),                                      X00650001
               LENGTH=022,                                             X00660001
               INITIAL='ADJUSTMENT INFORMATION'                         00670001
         DFHMDF POS=(07,051),                                          X00671016
               COLOR=NEUTRAL,                                          X00672016
               ATTRB=(ASKIP,BRT),                                      X00673016
               LENGTH=013,                                             X00674016
               INITIAL='PROCESS GRP.:'                                  00675016
AGROUP   DFHMDF POS=(07,065),                                          X00676016
               COLOR=BLUE,                                             X00677016
               ATTRB=(ASKIP,NORM),                                     X00678016
               LENGTH=015                                               00679016
*********************************************************************** 00680001
         DFHMDF POS=(08,001),                                          X00690001
               COLOR=NEUTRAL,                                          X00700001
               ATTRB=(ASKIP,BRT),                                      X00710001
               LENGTH=016,                                             X00720001
               INITIAL='USER ID/NAME...:'                               00730001
AUSERID  DFHMDF POS=(08,018),                                          X00740011
               COLOR=BLUE,                                             X00741003
               ATTRB=(ASKIP,NORM),                                     X00742003
               LENGTH=008                                               00770001
AUSRNAME DFHMDF POS=(08,027),                                          X00780012
               COLOR=BLUE,                                             X00781003
               ATTRB=(ASKIP,NORM),                                     X00782003
               LENGTH=021                                               00810010
         DFHMDF POS=(08,051),                                          X00820007
               COLOR=NEUTRAL,                                          X00830001
               ATTRB=(ASKIP,BRT),                                      X00840001
               LENGTH=013,                                             X00850001
               INITIAL='ADJ SOURCE..:'                                  00860014
AADJSRC  DFHMDF POS=(08,065),                                          X00870014
               COLOR=BLUE,                                             X00871003
               ATTRB=(ASKIP,NORM),                                     X00872003
               LENGTH=008                                               00900014
*********************************************************************** 00910001
         DFHMDF POS=(09,001),                                          X00920001
               COLOR=NEUTRAL,                                          X00930001
               ATTRB=(ASKIP,BRT),                                      X00940001
               LENGTH=016,                                             X00950001
               INITIAL='TYPE...........:'                               00960001
AADJTYPE DFHMDF POS=(09,018),                                          X00970001
               COLOR=BLUE,                                             X00971003
               ATTRB=(ASKIP,NORM),                                     X00972003
               LENGTH=030                                               01000001
         DFHMDF POS=(09,051),                                          X01010014
               COLOR=NEUTRAL,                                          X01020014
               ATTRB=(ASKIP,BRT),                                      X01030014
               LENGTH=013,                                             X01040014
               INITIAL='FAIL/SUCCESS:'                                  01041014
AFALSUCS DFHMDF POS=(09,065),                                          X01042014
               COLOR=BLUE,                                             X01043014
               ATTRB=(ASKIP,NORM),                                     X01044014
               LENGTH=011                                               01045014
*********************************************************************** 01140001
         DFHMDF POS=(10,001),                                          X01150001
               COLOR=NEUTRAL,                                          X01160001
               ATTRB=(ASKIP,BRT),                                      X01170001
               LENGTH=016,                                             X01180001
               INITIAL='DATE/TIME......:'                               01190001
AADJTMST DFHMDF POS=(10,018),                                          X01200006
               COLOR=BLUE,                                             X01210001
               ATTRB=(ASKIP,NORM),                                     X01220003
               LENGTH=021                                               01230005
         DFHMDF POS=(10,051),                                          X01240014
               COLOR=NEUTRAL,                                          X01250014
               ATTRB=(ASKIP,BRT),                                      X01260014
               LENGTH=013,                                             X01270014
               INITIAL='ERROR CODE..:'                                  01280014
AERRORCD DFHMDF POS=(10,065),                                          X01290014
               COLOR=BLUE,                                             X01300014
               ATTRB=(ASKIP,NORM),                                     X01310014
               LENGTH=011                                               01320014
*********************************************************************** 01440001
         DFHMDF POS=(11,051),                                          X01441007
               COLOR=NEUTRAL,                                          X01442007
               ATTRB=(ASKIP,BRT),                                      X01443007
               LENGTH=023,                                             X01444007
               INITIAL='ACKNOWLEDGE INFORMATION'                        01445007
*********************************************************************** 01446007
         DFHMDF POS=(12,001),                                          X01450001
               COLOR=NEUTRAL,                                          X01460001
               ATTRB=(ASKIP,BRT),                                      X01470001
               LENGTH=012,                                             X01480007
               INITIAL='BEFORE QTY.:'                                   01490007
ABEFQTY  DFHMDF POS=(12,015),                                          X01500007
               COLOR=BLUE,                                             X01501003
               ATTRB=(ASKIP,NORM),                                     X01502003
               LENGTH=007                                               01540007
AACTQTY  DFHMDF POS=(12,025),                                          X01550019
               COLOR=BLUE,                                             X01560019
               ATTRB=(ASKIP,NORM),                                     X01570019
               LENGTH=018                                               01580019
         DFHMDF POS=(12,051),                                          X01585107
               COLOR=NEUTRAL,                                          X01585207
               ATTRB=(ASKIP,BRT),                                      X01585307
               LENGTH=010,                                             X01585408
               INITIAL='USER ID..:'                                     01585507
AACKUSER DFHMDF POS=(12,062),                                          X01585607
               COLOR=BLUE,                                             X01585707
               ATTRB=(ASKIP,NORM),                                     X01585807
               LENGTH=008                                               01585907
*********************************************************************** 01586001
         DFHMDF POS=(13,001),                                          X01587018
               COLOR=NEUTRAL,                                          X01588018
               ATTRB=(ASKIP,BRT),                                      X01589018
               LENGTH=012,                                             X01590018
               INITIAL='NET ADJSMNT:'                                   01600018
ANETADJ  DFHMDF POS=(13,015),                                          X01610018
               COLOR=BLUE,                                             X01620018
               ATTRB=(ASKIP,NORM),                                     X01630018
               LENGTH=007                                               01640018
AVERQTY  DFHMDF POS=(13,025),                                          X01650019
               COLOR=BLUE,                                             X01660019
               ATTRB=(ASKIP,NORM),                                     X01670019
               LENGTH=018                                               01680019
         DFHMDF POS=(13,51),                                           X01720107
               LENGTH=10,                                              X01720207
               ATTRB=(ASKIP,BRT),                                      X01720307
               INITIAL='NAME.....:'                                     01720407
AACKNAME DFHMDF POS=(13,062),                                          X01721007
               COLOR=BLUE,                                             X01722007
               ATTRB=(ASKIP,NORM),                                     X01723007
               LENGTH=018                                               01724008
*********************************************************************** 01730001
         DFHMDF POS=(14,001),                                          X01731018
               COLOR=NEUTRAL,                                          X01732018
               ATTRB=(ASKIP,BRT),                                      X01733018
               LENGTH=012,                                             X01734018
               INITIAL='AFTER QTY..:'                                   01735018
AAFTQTY  DFHMDF POS=(14,015),                                          X01736018
               COLOR=BLUE,                                             X01737018
               ATTRB=(ASKIP,NORM),                                     X01738018
               LENGTH=007                                               01739018
ACURSTT  DFHMDF POS=(14,025),                                          X01740019
               COLOR=BLUE,                                             X01750019
               ATTRB=(ASKIP,NORM),                                     X01760019
               LENGTH=020                                               01770019
         DFHMDF POS=(14,051),                                          X02120007
               COLOR=NEUTRAL,                                          X02130001
               ATTRB=(ASKIP,BRT),                                      X02140001
               LENGTH=010,                                             X02150007
               INITIAL='DATE/TIME:'                                     02160007
AACKTMST DFHMDF POS=(14,062),                                          X02170007
               COLOR=BLUE,                                             X02171003
               ATTRB=(ASKIP,NORM),                                     X02172003
               LENGTH=018                                               02200007
*********************************************************************** 02210007
         DFHMDF POS=(16,001),                                          X02220007
               COLOR=NEUTRAL,                                          X02230007
               ATTRB=(ASKIP,BRT),                                      X02240007
               LENGTH=024,                                             X02250007
               INITIAL='ACKNOWLEDGEMENT COMMENT:'                       02260007
*********************************************************************** 02270007
ACOMMNT1 DFHMDF POS=(17,001),                                          X02280007
               COLOR=GREEN,                                            X02290007
               ATTRB=(UNPROT,NORM),                                    X02291008
               HILIGHT=UNDERLINE,                                      X02300007
               LENGTH=079                                               02310007
*********************************************************************** 02320007
ACOMMNT2 DFHMDF POS=(18,001),                                          X02330007
               COLOR=GREEN,                                            X02340007
               ATTRB=(UNPROT,NORM),                                    X02350008
               HILIGHT=UNDERLINE,                                      X02360007
               LENGTH=079                                               02370007
*********************************************************************** 02380007
ACOMMNT3 DFHMDF POS=(19,001),                                          X02390007
               COLOR=GREEN,                                            X02400007
               ATTRB=(UNPROT,NORM),                                    X02410008
               HILIGHT=UNDERLINE,                                      X02420007
               LENGTH=079                                               02430007
*********************************************************************** 02930001
*********************************************************************** 02940001
*********************************************************************** 02950001
         DFHMSD TYPE=FINAL                                              02960001
         END                                                            02970001
