*          DATA SET SUKM507    AT LEVEL 030 AS OF 06/17/91                      
        PRINT NOGEN                                                     00001   
SUKM507  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
SU507A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,04),                                           X00012**5
               LENGTH=014,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='WRONG FACILITY'                                 00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=017,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='SERIAL SHIP CODE:'                              00015*29
*                                                                       00016   
ACARTN   DFHMDF POS=(03,02),                                           X00034*22
               LENGTH=018,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00015   
         DFHMDF POS=(04,001),                                          X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               LENGTH=004,                                             X00036   
               INITIAL='PO: '                                           00014   
*                                                                       00015   
APO      DFHMDF POS=(04,006),                                          X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=008,                                             X00033   
               PICOUT='ZZZZZZZ9'                                                
*                                                                       00015   
         DFHMDF POS=(05,001),                                          X00034   
               ATTRB=(ASKIP,NORM),                                     X00035   
               LENGTH=004,                                             X00036   
               INITIAL='STR:'                                           00014   
*                                                                       00015   
ASTR     DFHMDF POS=(05,008),                                          X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=004,                                             X00033   
               PICOUT='ZZZ9'                                                    
*                                                                       00037   
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='FCLTY:'                                         00015*29
*                                                                       00068   
AFCLTY   DFHMDF POS=(06,08),                                           X00051   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=004,                                             X00052   
               PICOUT='ZZZ9'                                                    
*                                                                       00037   
         DFHMDF POS=(07,01),                                           X00034*22
               LENGTH=011,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F2- CONFIRM'                                    00015*29
*                                                                       00072**5
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
