        PRINT NOGEN                                                     00001   
SUKM523  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU523A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=011,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='AUDIT PRINT'                                    00015*29
*                                                                       00011   
AMORE    DFHMDF POS=(01,13),                                           X00012**5
               LENGTH=007,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASEL1    DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASEL2    DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASEL3    DFHMDF POS=(04,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASEL4    DFHMDF POS=(05,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASEL5    DFHMDF POS=(06,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00041*22
         DFHMDF POS=(07,01),                                           X00064**9
               LENGTH=003,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='RPT'                                            00067**5
*                                                                       00068   
ASELECT  DFHMDF POS=(07,05),                                           X00051   
               LENGTH=002,                                             X00052   
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00072**5
         DFHMDF POS=(07,08),                                           X00055   
               LENGTH=002,                                             X00056   
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='TO'                                             00067**5
*                                                                       00068   
ADEST    DFHMDF POS=(07,11),                                           X00051   
               LENGTH=008,                                             X00052   
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00072**5
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
