        PRINT NOGEN                                                     00001   
SUKM711  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU711A   DFHMDI SIZE=(11,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=012,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='RFID INFO:  '                                   00015*29
*                                                                       00011   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='UPC'                                            00015*29
*                                                                       00011   
AUPC     DFHMDF POS=(02,05),                                           X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=009,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='EPC TAG? '                                      00015*29
ALOGO    DFHMDF POS=(03,11),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(UNPROT,NORM,IC)                                   00014*24
         DFHMDF POS=(03,13),                                           X00012**5
               LENGTH=005,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='(Y/N)'                                          00015*29
*                                                                       00011   
         DFHMDF POS=(04,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='SIZE  '                                         00015*29
*                                                                       00011   
ASIZE    DFHMDF POS=(04,08),                                           X00012**5
               LENGTH=010,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(04,19),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='COLOR '                                         00015*29
*                                                                       00011   
ACOLOR   DFHMDF POS=(05,08),                                           X00012**5
               LENGTH=010,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(05,19),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(06,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='STYLE '                                         00015*29
*                                                                       00011   
ASTYLE   DFHMDF POS=(06,08),                                           X00012**5
               LENGTH=012,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(07,01),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='F2-CONT.'                                       00015*29
*                                                                       00016   
         DFHMDF POS=(08,01),                                           X00012**5
               LENGTH=013,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='NBR TAGS LEFT'                                  00015*29
*                                                                       00016   
         DFHMDF POS=(09,01),                                           X00012**5
               LENGTH=010,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='TO PROCESS'                                     00015*29
*                                                                       00068   
ATGSLFT  DFHMDF POS=(09,13),                                           X00073*22
               LENGTH=003,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00068   
AMSGLN   DFHMDF POS=(10,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00068   
AMSGLN2  DFHMDF POS=(11,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
