*          DATA SET SUKM793                                             00010006
        PRINT  NOGEN                                                    00020001
*-------------------------------------------------------------------*   00021001
*                                                                   *   00022001
*        MAPSET  SUKM793                                            *   00023001
*        MAP     SUK793                                             *   00024001
*        PROGRAM SUKCS793                                           *   00025001
*        TRANSID S793 - PRINT AND APPLY CRITERIA                    *   00026003
*                                                                   *   00027001
*-------------------------------------------------------------------*   00028001
SUKM793 DFHMSD TYPE=DSECT,                                             X00029001
               LANG=COBOL,                                             X00030001
               MODE=INOUT,                                             X00040001
               STORAGE=AUTO,                                           X00050001
               TERM=3270-2,                                            X00060001
               TIOAPFX=YES                                              00070001
**********************************************************************  00080001
SUK793  DFHMDI LINE=2,COLUMN=1,                                        X00090001
               SIZE=(19,80),                                           X00100001
               CTRL=(FREEKB),                                          X00110001
               MAPATTS=(COLOR,HILIGHT),                                X00120001
               DSATTS=(COLOR,HILIGHT)                                   00130001
**********************************************************************  00140001
**********************************************************************  00141002
         DFHMDF POS=(04,13),                                           X00142003
               LENGTH=36,                                              X00143014
               ATTRB=(ASKIP,NORM),                                     X00144002
               COLOR=NEUTRAL,                                          X00145002
               INITIAL='ENTER THE FOLLOWING TO CREATE A LIST'           00146014
         DFHMDF POS=(04,50),                                           X00147013
               LENGTH=12,                                              X00148002
               ATTRB=(ASKIP,NORM),                                     X00149002
               COLOR=NEUTRAL,                                          X00149102
               INITIAL='OF AVAILABLE'                                   00149202
**********************************************************************  00149302
         DFHMDF POS=(05,13),                                           X00149403
               LENGTH=41,                                              X00149503
               ATTRB=(ASKIP,NORM),                                     X00149602
               COLOR=NEUTRAL,                                          X00149702
               INITIAL='PRINT AND APPLY STATIONS FOR DC LOCATION:'      00149803
**********************************************************************  00151002
         DFHMDF POS=(07,13),                                           X00160003
               LENGTH=18,                                              X00170001
               ATTRB=(ASKIP,NORM),                                     X00180001
               COLOR=NEUTRAL,                                          X00190001
               INITIAL='OPER UNIT ID.....:'                             00200003
AOPRUNT  DFHMDF POS=(07,32),                                           X00210010
               LENGTH=04,                                              X00220001
               ATTRB=(UNPROT),                                         X00231012
               HILIGHT=UNDERLINE,                                      X00232012
               COLOR=GREEN                                              00233012
AOPRNME  DFHMDF POS=(07,37),                                           X00250010
               LENGTH=25,                                              X00260001
               ATTRB=(ASKIP,NORM),                                     X00270001
               COLOR=BLUE                                               00280001
         DFHMDF POS=(07,064),                                          X00290004
               ATTRB=(ASKIP,DRK),                                      X00300001
               LENGTH=001                                               00301001
**********************************************************************  00302001
         DFHMDF POS=(09,13),                                           X00303003
               LENGTH=15,                                              X00304002
               ATTRB=(ASKIP,NORM),                                     X00305001
               COLOR=NEUTRAL,                                          X00306001
               INITIAL='PRINT AND APPLY'                                00307002
**********************************************************************  00307102
         DFHMDF POS=(10,13),                                           X00307203
               LENGTH=18,                                              X00307302
               ATTRB=(ASKIP,NORM),                                     X00307402
               COLOR=NEUTRAL,                                          X00307502
               INITIAL='STATION NUMBER...:'                             00307611
ASTANBR  DFHMDF POS=(10,32),                                           X00308010
               LENGTH=04,                                              X00309001
               ATTRB=(UNPROT),                                         X00310001
               HILIGHT=UNDERLINE,                                      X00311001
               COLOR=GREEN                                              00312001
         DFHMDF POS=(10,037),                                          X00317005
               ATTRB=(ASKIP,DRK),                                      X00318001
               LENGTH=001                                               00319001
**********************************************************************  00320001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00330001
               INITIAL='ASSIGN BEGIN DATE:',                           X00340003
               COLOR=NEUTRAL,                                          X00350001
               LENGTH=18,                                              X00360001
               POS=(12,13)                                              00370003
ADATFMM  DFHMDF POS=(12,32),                                           X00380007
               LENGTH=2,                                               X00390003
               HILIGHT=UNDERLINE,                                      X00400001
               COLOR=GREEN,                                            X00410001
               ATTRB=(UNPROT)                                           00420001
ADATFDD  DFHMDF POS=(12,35),                                           X00421007
               LENGTH=2,                                               X00422003
               HILIGHT=UNDERLINE,                                      X00423003
               COLOR=GREEN,                                            X00424003
               ATTRB=(UNPROT)                                           00425003
ADATFYY  DFHMDF POS=(12,38),                                           X00426007
               LENGTH=4,                                               X00427003
               HILIGHT=UNDERLINE,                                      X00428003
               COLOR=GREEN,                                            X00429003
               ATTRB=(UNPROT)                                           00429103
         DFHMDF ATTRB=(ASKIP),                                         X00429203
               LENGTH=1,                                               X00429303
               POS=(12,43)                                              00429404
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00429503
               INITIAL='(MMDDYYYY)',                                   X00429603
               COLOR=NEUTRAL,                                          X00429703
               LENGTH=10,                                              X00429803
               POS=(12,45)                                              00429905
**********************************************************************  00430004
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00440004
               INITIAL='ASSIGN END DATE..:',                           X00450005
               COLOR=NEUTRAL,                                          X00451004
               LENGTH=18,                                              X00452004
               POS=(13,13)                                              00453005
ADATTMM  DFHMDF POS=(13,32),                                           X00454007
               LENGTH=2,                                               X00455004
               HILIGHT=UNDERLINE,                                      X00456004
               COLOR=GREEN,                                            X00457004
               ATTRB=(UNPROT)                                           00458004
ADATTDD  DFHMDF POS=(13,35),                                           X00459007
               LENGTH=2,                                               X00459104
               HILIGHT=UNDERLINE,                                      X00459204
               COLOR=GREEN,                                            X00459304
               ATTRB=(UNPROT)                                           00459404
ADATTYY  DFHMDF POS=(13,38),                                           X00459507
               LENGTH=4,                                               X00459604
               HILIGHT=UNDERLINE,                                      X00459704
               COLOR=GREEN,                                            X00459804
               ATTRB=(UNPROT)                                           00459904
         DFHMDF ATTRB=(ASKIP),                                         X00460004
               LENGTH=1,                                               X00461004
               POS=(13,43)                                              00462005
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00463004
               INITIAL='(MMDDYYYY)',                                   X00464004
               COLOR=NEUTRAL,                                          X00465004
               LENGTH=10,                                              X00466004
               POS=(13,45)                                              00467005
**********************************************************************  00470004
**********************************************************************  00580001
         DFHMSD TYPE=FINAL                                              00590001
         END                                                            00600001
