*          DATA SET SUKM775                                             00010000
        PRINT  NOGEN                                                    00020000
*-------------------------------------------------------------------*   00021000
*                                                                   *   00022000
*        MAPSET  SUKM775                                            *   00023000
*        MAP     SUK775                                             *   00024000
*        PROGRAM SUKCS775                                           *   00025000
*        TRANSID S775 - DIRECTIVE HISTORY CRIT SPEC                 *   00026000
*                                                                   *   00027000
*-------------------------------------------------------------------*   00028000
SUKM775 DFHMSD TYPE=DSECT,                                             X00029000
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               STORAGE=AUTO,                                           X00050000
               TERM=3270-2,                                            X00060000
               TIOAPFX=YES                                              00070000
**********************************************************************  00080000
SUK775  DFHMDI LINE=2,COLUMN=1,                                        X00090004
               SIZE=(19,80),                                           X00100000
               CTRL=(FREEKB),                                          X00110000
               MAPATTS=(COLOR,HILIGHT),                                X00120000
               DSATTS=(COLOR,HILIGHT)                                   00130000
**********************************************************************  00140000
**********************************************************************  00150803
         DFHMDF POS=(03,03),                                           X00150905
               LENGTH=46,                                              X00151003
               ATTRB=(ASKIP,NORM),                                     X00151103
               COLOR=NEUTRAL,                                          X00151203
               INITIAL='ENTER THE FOLLOWING TO VIEW LIST OF DIRECTIVES' 00151303
**********************************************************************  00151500
         DFHMDF POS=(05,03),                                           X00151605
               LENGTH=18,                                              X00152000
               ATTRB=(ASKIP,NORM),                                     X00160000
               COLOR=NEUTRAL,                                          X00170000
               INITIAL='OPER UNIT ID.....:'                             00180000
AOPRUNT  DFHMDF POS=(05,22),                                           X00190005
               LENGTH=04,                                              X00200000
               ATTRB=(UNPROT),                                         X00210000
               HILIGHT=UNDERLINE,                                      X00220000
               COLOR=GREEN                                              00230000
AOPRNME  DFHMDF POS=(05,27),                                           X00240005
               LENGTH=25,                                              X00250000
               ATTRB=(ASKIP,NORM),                                     X00260000
               COLOR=BLUE                                               00270000
         DFHMDF POS=(05,064),                                          X00280000
               ATTRB=(ASKIP,DRK),                                      X00290000
               LENGTH=001                                               00300000
**********************************************************************  00301000
         DFHMDF POS=(07,03),                                           X00302000
               LENGTH=18,                                              X00303000
               ATTRB=(ASKIP,NORM),                                     X00304000
               COLOR=NEUTRAL,                                          X00305000
               INITIAL='PURCHASE ORDER...:'                             00306000
APORDER  DFHMDF POS=(07,22),                                           X00307000
               LENGTH=08,                                              X00307135
               ATTRB=(UNPROT),                                         X00307200
               HILIGHT=UNDERLINE,                                      X00307300
               COLOR=GREEN                                              00307400
         DFHMDF POS=(07,31),                                           X00307535
               ATTRB=(ASKIP,DRK),                                      X00307600
               LENGTH=001                                               00307700
**********************************************************************  00307800
         DFHMDF POS=(08,03),                                           X00319101
               LENGTH=18,                                              X00319201
               ATTRB=(ASKIP,NORM),                                     X00319301
               COLOR=NEUTRAL,                                          X00319401
               INITIAL='RECEIVER SEQ NBR.:'                             00319501
ARCVSEQ  DFHMDF POS=(08,22),                                           X00319601
               LENGTH=04,                                              X00319709
               ATTRB=(UNPROT),                                         X00319801
               HILIGHT=UNDERLINE,                                      X00319901
               COLOR=GREEN                                              00320001
         DFHMDF POS=(08,27),                                           X00320109
               ATTRB=(ASKIP,DRK),                                      X00320201
               LENGTH=001                                               00320301
         DFHMDF POS=(08,34),                                           X00320401
               LENGTH=15,                                              X00320501
               ATTRB=(ASKIP,NORM),                                     X00320601
               COLOR=NEUTRAL,                                          X00320701
               INITIAL='RCVR PACK TYPE:'                                00320801
ARCVPTY  DFHMDF POS=(08,51),                                           X00320901
               LENGTH=14,                                              X00321001
               ATTRB=(ASKIP,NORM),                                     X00321206
               COLOR=BLUE                                               00321306
         DFHMDF POS=(08,66),                                           X00321402
               ATTRB=(ASKIP,DRK),                                      X00321501
               LENGTH=001                                               00321601
**********************************************************************  00322000
         DFHMDF POS=(09,03),                                           X00330000
               LENGTH=18,                                              X00340000
               ATTRB=(ASKIP,NORM),                                     X00350000
               COLOR=NEUTRAL,                                          X00360000
               INITIAL='LINE NUMBER......:'                             00370000
ALINENO  DFHMDF POS=(09,22),                                           X00380001
               LENGTH=04,                                              X00390000
               ATTRB=(UNPROT),                                         X00400000
               HILIGHT=UNDERLINE,                                      X00410000
               COLOR=GREEN                                              00420000
         DFHMDF POS=(09,27),                                           X00430008
               ATTRB=(ASKIP,DRK),                                      X00440000
               LENGTH=001                                               00450000
**********************************************************************  00451001
         DFHMDF POS=(10,03),                                           X00452001
               LENGTH=18,                                              X00453001
               ATTRB=(ASKIP,NORM),                                     X00454001
               COLOR=NEUTRAL,                                          X00455001
               INITIAL='PACK ID..........:'                             00456019
APACKID  DFHMDF POS=(10,22),                                           X00457002
               LENGTH=04,                                              X00458001
               ATTRB=(UNPROT),                                         X00459001
               HILIGHT=UNDERLINE,                                      X00459101
               COLOR=GREEN                                              00459201
         DFHMDF POS=(10,27),                                           X00459308
               ATTRB=(ASKIP,DRK),                                      X00459401
               LENGTH=001                                               00459501
**********************************************************************  00459601
         DFHMDF POS=(11,03),                                           X00459701
               LENGTH=18,                                              X00459801
               ATTRB=(ASKIP,NORM),                                     X00459901
               COLOR=NEUTRAL,                                          X00460001
               INITIAL='AUDIT NUMBER.....:'                             00460101
AAUDNUM  DFHMDF POS=(11,22),                                           X00460202
               LENGTH=09,                                              X00460301
               ATTRB=(UNPROT),                                         X00460401
               HILIGHT=UNDERLINE,                                      X00460501
               COLOR=GREEN                                              00460601
         DFHMDF POS=(11,032),                                          X00460701
               ATTRB=(ASKIP,DRK),                                      X00460801
               LENGTH=001                                               00460901
**********************************************************************  00461002
         DFHMDF POS=(12,03),                                           X00461102
               LENGTH=18,                                              X00461202
               ATTRB=(ASKIP,NORM),                                     X00461302
               COLOR=NEUTRAL,                                          X00461402
               INITIAL='SML / P2L DEST...:'                             00461531
ACARTID  DFHMDF POS=(12,22),                                           X00461602
               LENGTH=22,                                              X00461702
               ATTRB=(UNPROT),                                         X00461802
               HILIGHT=UNDERLINE,                                      X00461902
               COLOR=GREEN                                              00462002
         DFHMDF POS=(12,45),                                           X00462108
               ATTRB=(ASKIP,DRK),                                      X00462202
               LENGTH=001                                               00462302
**********************************************************************  00462401
         DFHMDF POS=(13,03),                                           X00462502
               LENGTH=18,                                              X00462601
               ATTRB=(ASKIP,NORM),                                     X00462701
               COLOR=NEUTRAL,                                          X00462801
               INITIAL='ORIGINAL CASI....:'                             00462902
AOCASI   DFHMDF POS=(13,22),                                           X00463002
               LENGTH=01,                                              X00463102
               ATTRB=(UNPROT),                                         X00463201
               HILIGHT=UNDERLINE,                                      X00463301
               COLOR=GREEN                                              00463401
         DFHMDF POS=(13,24),                                           X00463508
               ATTRB=(ASKIP,DRK),                                      X00463601
               LENGTH=001                                               00463701
**********************************************************************  00463802
         DFHMDF POS=(14,03),                                           X00463933
               LENGTH=18,                                              X00464033
               ATTRB=(ASKIP,NORM),                                     X00464133
               COLOR=NEUTRAL,                                          X00464233
               INITIAL='DIRECTIVE CODE...:'                             00464332
ADIRCDE  DFHMDF POS=(14,22),                                           X00464433
               LENGTH=3,                                               X00464533
               ATTRB=(UNPROT),                                         X00464633
               HILIGHT=UNDERLINE,                                      X00464734
               COLOR=GREEN                                              00464832
         DFHMDF POS=(14,26),                                           X00464933
               ATTRB=(ASKIP,DRK),                                      X00465033
               LENGTH=001                                               00465132
*********************************************************************** 00465232
         DFHMDF POS=(15,03),                                           X00465332
               LENGTH=18,                                              X00465402
               ATTRB=(ASKIP,NORM),                                     X00465502
               COLOR=NEUTRAL,                                          X00465602
               INITIAL='SET CODE.........:'                             00465734
ASETCDE  DFHMDF POS=(15,22),                                           X00465832
               LENGTH=05,                                              X00465934
               ATTRB=(UNPROT),                                         X00466002
               HILIGHT=UNDERLINE,                                      X00466102
               COLOR=GREEN                                              00466202
         DFHMDF POS=(15,28),                                           X00466332
               ATTRB=(ASKIP,DRK),                                      X00466402
               LENGTH=001                                               00466502
         DFHMDF POS=(15,34),                                           X00466632
               LENGTH=15,                                              X00466702
               ATTRB=(ASKIP,NORM),                                     X00466802
               COLOR=NEUTRAL,                                          X00466902
               INITIAL='SET YEAR......:'                                00467002
ASETYR   DFHMDF POS=(15,51),                                           X00467132
               LENGTH=04,                                              X00467202
               ATTRB=(UNPROT),                                         X00467302
               HILIGHT=UNDERLINE,                                      X00467402
               COLOR=GREEN                                              00467502
         DFHMDF POS=(15,56),                                           X00467632
               ATTRB=(ASKIP,DRK),                                      X00467702
               LENGTH=001                                               00467802
**********************************************************************  00467902
         DFHMDF POS=(16,03),                                           X00468032
               LENGTH=18,                                              X00468102
               ATTRB=(ASKIP,NORM),                                     X00468202
               COLOR=NEUTRAL,                                          X00468302
               INITIAL='DATE RANGE BEGIN.:'                             00468421
ADRBYR   DFHMDF POS=(16,22),                                           X00468532
               LENGTH=4,                                               X00468613
               HILIGHT=UNDERLINE,                                      X00468713
               COLOR=GREEN,                                            X00468813
               ATTRB=(UNPROT)                                           00468913
ADRBMT   DFHMDF POS=(16,27),                                           X00469032
               LENGTH=2,                                               X00469113
               HILIGHT=UNDERLINE,                                      X00469213
               COLOR=GREEN,                                            X00469313
               ATTRB=(UNPROT)                                           00469413
ADATFDY  DFHMDF POS=(16,30),                                           X00469532
               LENGTH=2,                                               X00469613
               HILIGHT=UNDERLINE,                                      X00469713
               COLOR=GREEN,                                            X00469813
               ATTRB=(UNPROT)                                           00469913
ADATFHH  DFHMDF POS=(16,33),                                           X00470032
               LENGTH=2,                                               X00470114
               HILIGHT=UNDERLINE,                                      X00470214
               COLOR=GREEN,                                            X00471014
               ATTRB=(UNPROT)                                           00472014
ADATFMM  DFHMDF POS=(16,36),                                           X00474332
               LENGTH=2,                                               X00474414
               HILIGHT=UNDERLINE,                                      X00474514
               COLOR=GREEN,                                            X00474614
               ATTRB=(UNPROT)                                           00474714
         DFHMDF POS=(16,39),                                           X00475232
               LENGTH=18,                                              X00475328
               ATTRB=(ASKIP,NORM),                                     X00475428
               COLOR=NEUTRAL,                                          X00475528
               INITIAL='(YYYY/MM/DD HH:MM)'                             00475628
         DFHMDF POS=(16,58),                                           X00475732
               ATTRB=(ASKIP,DRK),                                      X00475822
               LENGTH=001                                               00475922
*******************************************************************     00476023
         DFHMDF POS=(17,03),                                           X00477032
               LENGTH=18,                                              X00478030
               ATTRB=(ASKIP,NORM),                                     X00479030
               COLOR=NEUTRAL,                                          X00480030
               INITIAL='DATE RANGE END...:'                             00480130
ADREND   DFHMDF POS=(17,22),                                           X00480232
               LENGTH=4,                                               X00480330
               HILIGHT=UNDERLINE,                                      X00480430
               COLOR=GREEN,                                            X00480530
               ATTRB=(UNPROT)                                           00480630
ADREMT   DFHMDF POS=(17,27),                                           X00480732
               LENGTH=2,                                               X00480830
               HILIGHT=UNDERLINE,                                      X00480930
               COLOR=GREEN,                                            X00481030
               ATTRB=(UNPROT)                                           00481130
ADATEDY  DFHMDF POS=(17,30),                                           X00481232
               LENGTH=2,                                               X00481330
               HILIGHT=UNDERLINE,                                      X00481430
               COLOR=GREEN,                                            X00481530
               ATTRB=(UNPROT)                                           00481630
ADATEHH  DFHMDF POS=(17,33),                                           X00481732
               LENGTH=2,                                               X00481830
               HILIGHT=UNDERLINE,                                      X00481930
               COLOR=GREEN,                                            X00482030
               ATTRB=(UNPROT)                                           00482130
ADATEMM  DFHMDF POS=(17,36),                                           X00482232
               LENGTH=2,                                               X00482330
               HILIGHT=UNDERLINE,                                      X00482430
               COLOR=GREEN,                                            X00482530
               ATTRB=(UNPROT)                                           00482630
         DFHMDF POS=(17,39),                                           X00482732
               LENGTH=18,                                              X00482830
               ATTRB=(ASKIP,NORM),                                     X00482930
               COLOR=NEUTRAL,                                          X00483030
               INITIAL='(YYYY/MM/DD HH:MM)'                             00483130
         DFHMDF POS=(17,58),                                           X00483232
               ATTRB=(ASKIP,DRK),                                      X00483330
               LENGTH=001                                               00483430
**********************************************************************  00483522
**********************************************************************  00483622
         DFHMSD TYPE=FINAL                                              00484022
         END                                                            00490000
