*          DATA SET SUKM552    AT LEVEL 002 AS OF 02/10/00              00003   
        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  SUKM552                                            *   00007   
*        MAP     SUK552                                             *   00008   
*        PROGRAM SUKCS552                                           *   00009   
*        TRANSID S552 - PO/RECEIVER CHECK-IN STATUS                 *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
SUKM552 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SUK552  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(19,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=16,                                              X        
               INITIAL='OPER UNIT/FCLTY:'                               00020   
AOPER   DFHMDF POS=(02,19),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
AFCLTY  DFHMDF POS=(02,24),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
ANAME   DFHMDF POS=(02,30),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=028                                                       
AMESS   DFHMDF POS=(02,59),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=015                                                       
        DFHMDF POS=(03,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=16,                                              X        
               INITIAL='SCAC...........:'                               00020   
ASCAC   DFHMDF POS=(03,19),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
        DFHMDF POS=(03,30),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='TRAILER....:'                                   00020   
ATRLR   DFHMDF POS=(03,43),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=10                                                        
        DFHMDF POS=(03,58),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='TRIP ID....:'                                   00020   
ATRIP   DFHMDF POS=(03,71),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=9,                                               X        
               PICOUT='999999999'                                               
**********************************************************************          
        DFHMDF POS=(04,02),                                            X00023   
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOT EXP CRTNS..:'                               00025   
ATOTECRT DFHMDF POS=(04,019),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(04,30),                                            X00023   
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOT EXP SCN:'                                   00025   
ATOTESCN DFHMDF POS=(04,043),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(04,58),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='STATUS.....:'                                   00020   
ASTAT   DFHMDF POS=(04,71),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=02                                                        
*********************************************************************           
        DFHMDF POS=(05,02),                                            X00023   
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOT ACT CRTNS..:'                               00025   
ATOTACRT DFHMDF POS=(05,019),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(05,30),                                            X00023   
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOT ACT SCN:'                                   00025   
ATOTASCN DFHMDF POS=(05,043),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
        DFHMDF POS=(05,58),                                            X00023   
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TOTAL UNITS:'                                   00025   
ATOTUNT  DFHMDF POS=(05,071),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZZZZ9'                                         00737   
*******************************************************************             
        DFHMDF POS=(06,44),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(06,50),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(06,56),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(06,59),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(06,65),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(06,68),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
**********************************************************************  00011   
        DFHMDF POS=(07,02),                                            X00023   
               COLOR=YELLOW,                                           X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=032,                                             X        
               INITIAL='ITEMS IN YELLOW ARE FREE-ASTRAYS'               00025   
        DFHMDF POS=(07,045),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='P'                                              00025   
        DFHMDF POS=(07,48),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='EXP'                                            00025   
        DFHMDF POS=(07,53),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(07,58),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='EXP'                                            00025   
        DFHMDF POS=(07,63),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                            00025   
*******************************************************************             
        DFHMDF POS=(08,045),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='K'                                              00025   
        DFHMDF POS=(08,47),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='CART'                                           00025   
        DFHMDF POS=(08,52),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='CART'                                           00025   
        DFHMDF POS=(08,57),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='SCAN'                                           00025   
        DFHMDF POS=(08,62),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='SCAN'                                           00025   
        DFHMDF POS=(08,67),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='PRCENT'                                         00025   
        DFHMDF POS=(08,75),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='TOTAL'                                          00025   
**********************************************************************  00011   
        DFHMDF POS=(09,001),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='S'                                              00025   
        DFHMDF POS=(09,003),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(09,007),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=012,                                             X        
               INITIAL='PO/RECEIVER '                                   00025   
        DFHMDF POS=(09,020),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='ST'                                             00025   
        DFHMDF POS=(09,023),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=011,                                             X        
               INITIAL='VENDOR NAME'                                    00025   
        DFHMDF POS=(09,045),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='G'                                              00025   
        DFHMDF POS=(09,048),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='CNT'                                            00025   
        DFHMDF POS=(09,053),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='CNT'                                            00025   
        DFHMDF POS=(09,058),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='CNT'                                            00025   
        DFHMDF POS=(09,063),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='CNT'                                            00025   
        DFHMDF POS=(09,067),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='SCNNED'                                         00025   
        DFHMDF POS=(09,075),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='UNITS'                                          00025   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(10,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT01  DFHMDF POS=(10,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC01 DFHMDF POS=(10,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP01 DFHMDF POS=(10,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME01 DFHMDF POS=(10,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD01 DFHMDF POS=(10,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF01 DFHMDF POS=(10,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT01 DFHMDF POS=(10,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN01 DFHMDF POS=(10,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL01 DFHMDF POS=(10,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT01 DFHMDF POS=(10,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL01 DFHMDF POS=(10,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(11,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT02  DFHMDF POS=(11,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC02 DFHMDF POS=(11,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP02 DFHMDF POS=(11,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME02 DFHMDF POS=(11,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD02 DFHMDF POS=(11,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF02 DFHMDF POS=(11,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT02 DFHMDF POS=(11,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN02 DFHMDF POS=(11,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL02 DFHMDF POS=(11,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT02 DFHMDF POS=(11,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL02 DFHMDF POS=(11,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(12,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT03  DFHMDF POS=(12,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC03 DFHMDF POS=(12,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP03 DFHMDF POS=(12,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME03 DFHMDF POS=(12,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD03 DFHMDF POS=(12,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF03 DFHMDF POS=(12,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT03 DFHMDF POS=(12,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN03 DFHMDF POS=(12,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL03 DFHMDF POS=(12,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT03 DFHMDF POS=(12,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL03 DFHMDF POS=(12,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(13,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT04  DFHMDF POS=(13,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC04 DFHMDF POS=(13,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP04 DFHMDF POS=(13,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME04 DFHMDF POS=(13,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD04 DFHMDF POS=(13,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF04 DFHMDF POS=(13,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT04 DFHMDF POS=(13,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN04 DFHMDF POS=(13,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL04 DFHMDF POS=(13,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT04 DFHMDF POS=(13,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL04 DFHMDF POS=(13,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(14,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT05  DFHMDF POS=(14,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC05 DFHMDF POS=(14,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP05 DFHMDF POS=(14,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME05 DFHMDF POS=(14,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD05 DFHMDF POS=(14,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF05 DFHMDF POS=(14,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT05 DFHMDF POS=(14,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN05 DFHMDF POS=(14,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL05 DFHMDF POS=(14,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT05 DFHMDF POS=(14,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL05 DFHMDF POS=(14,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(15,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT06  DFHMDF POS=(15,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC06 DFHMDF POS=(15,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP06 DFHMDF POS=(15,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME06 DFHMDF POS=(15,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD06 DFHMDF POS=(15,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF06 DFHMDF POS=(15,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT06 DFHMDF POS=(15,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN06 DFHMDF POS=(15,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL06 DFHMDF POS=(15,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT06 DFHMDF POS=(15,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL06 DFHMDF POS=(15,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(16,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT07  DFHMDF POS=(16,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC07 DFHMDF POS=(16,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP07 DFHMDF POS=(16,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME07 DFHMDF POS=(16,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD07 DFHMDF POS=(16,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF07 DFHMDF POS=(16,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT07 DFHMDF POS=(16,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN07 DFHMDF POS=(16,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL07 DFHMDF POS=(16,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT07 DFHMDF POS=(16,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL07 DFHMDF POS=(16,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(17,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT08  DFHMDF POS=(17,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC08 DFHMDF POS=(17,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP08 DFHMDF POS=(17,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME08 DFHMDF POS=(17,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD08 DFHMDF POS=(17,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF08 DFHMDF POS=(17,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT08 DFHMDF POS=(17,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN08 DFHMDF POS=(17,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL08 DFHMDF POS=(17,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT08 DFHMDF POS=(17,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL08 DFHMDF POS=(17,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
ASEL09  DFHMDF POS=(18,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT09  DFHMDF POS=(18,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
APORC09 DFHMDF POS=(18,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=012                                               00140   
APKTP09 DFHMDF POS=(18,020),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=002                                               00140   
AVNME09 DFHMDF POS=(18,023),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=021                                               00140   
APKCD09 DFHMDF POS=(18,045),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=001                                               00140   
AMANF09 DFHMDF POS=(18,047),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACRT09 DFHMDF POS=(18,052),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASCAN09 DFHMDF POS=(18,057),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
AACTL09 DFHMDF POS=(18,062),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRCT09 DFHMDF POS=(18,067),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006                                               00140   
ATOTL09 DFHMDF POS=(18,074),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=006,                                             X00140   
               PICOUT='999999'                                          00033   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(19,040),                                          X00728   
               COLOR=NEUTRAL,                                          X00729   
               ATTRB=(ASKIP,NORM),                                     X00730   
               LENGTH=025,                                             X00731   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,067),                                          X00733   
               COLOR=BLUE,                                             X00734   
               ATTRB=(ASKIP,NORM),                                     X00735   
               LENGTH=007,                                             X00736   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
