***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                    00004   
SUKM599 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SU599A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(20,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(03,02),                                            X00018   
               LENGTH=13,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='MASTER SML..:'                                  00020   
AMASTER DFHMDF POS=(03,16),                                            X00021   
               LENGTH=20,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,37),                                            X00018   
               LENGTH=17,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='DEST STORE......:'                                      
AOPER   DFHMDF POS=(03,55),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='ZZZ9'                                                    
ANAME    DFHMDF POS=(03,060),                                          X00050   
               COLOR=BLUE,                                             X00051   
               ATTRB=(ASKIP),                                          X00052   
               LENGTH=019                                                       
**********************************************************************          
        DFHMDF POS=(04,02),                                            X        
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CRTN STATUS.:'                                          
ASTATUS  DFHMDF POS=(04,016),                                          X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(04,37),                                            X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL CHILDREN..:'                                      
ATCHLDN  DFHMDF POS=(04,055),                                          X        
               LENGTH=009,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
**********************************************************************  00011   
        DFHMDF POS=(05,002),                                           X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=13,                                              X        
               INITIAL='CREATE DT/TM:'                                  00020   
ADTETME DFHMDF POS=(05,16),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=19                                                        
        DFHMDF POS=(05,037),                                           X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='TOTAL UNITS MFST:'                              00020   
ATMANFST DFHMDF POS=(05,055),                                          X00733   
               LENGTH=011,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
**********************************************************************  00011   
        DFHMDF POS=(06,02),                                            X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='LINE PRINTER:'                                          
APRINT  DFHMDF POS=(06,016),                                           X00021   
               LENGTH=008,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               PICOUT='XXXXXXXX',                                      X        
               COLOR=GREEN                                              00022   
         DFHMDF POS=(06,025),                                          X00028**2
               COLOR=NEUTRAL,                                          X00029**2
               ATTRB=(ASKIP),                                          X00030**2
               LENGTH=001                                               00031**2
        DFHMDF POS=(06,49),                                            X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL=' ITEMS'                                                 
ASTRTIT DFHMDF POS=(06,56),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(06,062),                                          X00056   
               LENGTH=002,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00058   
               COLOR=NEUTRAL,                                          X00057   
               INITIAL='TO'                                             00060   
AENDIT  DFHMDF POS=(06,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(06,071),                                           X00067   
               LENGTH=002,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='OF'                                             00071   
ATOTIT  DFHMDF POS=(06,74),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
        DFHMDF POS=(07,26),                                            X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DEST'                                                   
        DFHMDF POS=(07,31),                                            X00023   
               LENGTH=023,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CRE STR  --- STATUS ---'                                
        DFHMDF POS=(07,56),                                            X00023   
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='UNITS'                                                  
        DFHMDF POS=(07,63),                                            X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CARTON'                                                 
        DFHMDF POS=(07,71),                                            X00023   
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='OUTBOUND'                                               
**********************************************************************  00011   
        DFHMDF POS=(08,001),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='S'                                                      
        DFHMDF POS=(08,003),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='A'                                                      
        DFHMDF POS=(08,013),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SML'                                                    
        DFHMDF POS=(08,026),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='NBR'                                            00025   
        DFHMDF POS=(08,031),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SRC'                                            00025   
        DFHMDF POS=(08,035),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SCAN'                                            00025  
        DFHMDF POS=(08,041),                                           X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DATE AND TIME'                                  00025   
        DFHMDF POS=(08,057),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='MFST'                                           00025   
        DFHMDF POS=(08,063),                                           X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='STATUS'                                         00025   
        DFHMDF POS=(08,073),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TRIP'                                           00025   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(09,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(09,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT01  DFHMDF POS=(09,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML01  DFHMDF POS=(09,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR01  DFHMDF POS=(09,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE01 DFHMDF POS=(09,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC01 DFHMDF POS=(09,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE01 DFHMDF POS=(09,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME01 DFHMDF POS=(09,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT01 DFHMDF POS=(09,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT01 DFHMDF POS=(09,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP01 DFHMDF POS=(09,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL02  DFHMDF POS=(10,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(10,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT02  DFHMDF POS=(10,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML02  DFHMDF POS=(10,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR02  DFHMDF POS=(10,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE02 DFHMDF POS=(10,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC02 DFHMDF POS=(10,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE02 DFHMDF POS=(10,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME02 DFHMDF POS=(10,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT02 DFHMDF POS=(10,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT02 DFHMDF POS=(10,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP02 DFHMDF POS=(10,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL03  DFHMDF POS=(11,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(11,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT03  DFHMDF POS=(11,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML03  DFHMDF POS=(11,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR03  DFHMDF POS=(11,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE03 DFHMDF POS=(11,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC03 DFHMDF POS=(11,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE03 DFHMDF POS=(11,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME03 DFHMDF POS=(11,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT03 DFHMDF POS=(11,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT03 DFHMDF POS=(11,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP03 DFHMDF POS=(11,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL04  DFHMDF POS=(12,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(12,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT04  DFHMDF POS=(12,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML04  DFHMDF POS=(12,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR04  DFHMDF POS=(12,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE04 DFHMDF POS=(12,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC04 DFHMDF POS=(12,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE04 DFHMDF POS=(12,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME04 DFHMDF POS=(12,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT04 DFHMDF POS=(12,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT04 DFHMDF POS=(12,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP04 DFHMDF POS=(12,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL05  DFHMDF POS=(13,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(13,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT05  DFHMDF POS=(13,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML05  DFHMDF POS=(13,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR05  DFHMDF POS=(13,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE05 DFHMDF POS=(13,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC05 DFHMDF POS=(13,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE05 DFHMDF POS=(13,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME05 DFHMDF POS=(13,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT05 DFHMDF POS=(13,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT05 DFHMDF POS=(13,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP05 DFHMDF POS=(13,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL06  DFHMDF POS=(14,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(14,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT06  DFHMDF POS=(14,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML06  DFHMDF POS=(14,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR06  DFHMDF POS=(14,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE06 DFHMDF POS=(14,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC06 DFHMDF POS=(14,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE06 DFHMDF POS=(14,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME06 DFHMDF POS=(14,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT06 DFHMDF POS=(14,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT06 DFHMDF POS=(14,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP06 DFHMDF POS=(14,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL07  DFHMDF POS=(15,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(15,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT07  DFHMDF POS=(15,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML07  DFHMDF POS=(15,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR07  DFHMDF POS=(15,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE07 DFHMDF POS=(15,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC07 DFHMDF POS=(15,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE07 DFHMDF POS=(15,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME07 DFHMDF POS=(15,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT07 DFHMDF POS=(15,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT07 DFHMDF POS=(15,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP07 DFHMDF POS=(15,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL08  DFHMDF POS=(16,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(16,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT08  DFHMDF POS=(16,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML08  DFHMDF POS=(16,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR08  DFHMDF POS=(16,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE08 DFHMDF POS=(16,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC08 DFHMDF POS=(16,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE08 DFHMDF POS=(16,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME08 DFHMDF POS=(16,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT08 DFHMDF POS=(16,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT08 DFHMDF POS=(16,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP08 DFHMDF POS=(16,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL09  DFHMDF POS=(17,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(17,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT09  DFHMDF POS=(17,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML09  DFHMDF POS=(17,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR09  DFHMDF POS=(17,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE09 DFHMDF POS=(17,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC09 DFHMDF POS=(17,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE09 DFHMDF POS=(17,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME09 DFHMDF POS=(17,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT09 DFHMDF POS=(17,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT09 DFHMDF POS=(17,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP09 DFHMDF POS=(17,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL10  DFHMDF POS=(18,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
        DFHMDF POS=(18,004),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,DRK)                                                
AACT10  DFHMDF POS=(18,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML10  DFHMDF POS=(18,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR10  DFHMDF POS=(18,026),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE10 DFHMDF POS=(18,031),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTSC10 DFHMDF POS=(18,035),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE10 DFHMDF POS=(18,040),                                           X00137   
               LENGTH=008,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME10 DFHMDF POS=(18,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT10 DFHMDF POS=(18,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT10 DFHMDF POS=(18,063),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP10 DFHMDF POS=(18,071),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
**********************************************************************          
         DFHMDF POS=(19,045),                                          X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT   DFHMDF POS=(19,072),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
**********************************************************************          
**********************************************************************          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
