  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  SUKM578                                            *   00004   
*        MAP     SU578A                                             *   00005   
*        PROGRAM SUKCS578                                           *   00006   
*        TRANSID S578 - VENDOR RATEING CRITERIA SPEC                *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
SUKM578 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
SU578A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER THE VENDOR OR VENDOR/DEPT TO MAINTAIN:', X00022   
               LENGTH=44,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026**2
*                                                                       00027**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='NOTE: USE * IN THE VENDOR NAME AS A WILDCARD', X00022   
               LENGTH=44,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(03,08)                                              00026**2
*                                                                       00027**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='VENDOR NAME:',                                 X00029**3
               LENGTH=12,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(05,07)                                              00032**3
AVENDNM DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(05,20)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(05,51)                                              00042**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='VENDOR ENT ID:',                               X00045   
               LENGTH=14,                                              X00046   
               COLOR=NEUTRAL,                                          X00047   
               POS=(05,55)                                              00048**3
AENTID  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00049   
               LENGTH=9,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(05,70),                                            X00053**3
               PICOUT='ZZZZZZZZZ'                                       00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(05,80)                                              00057**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00059   
               INITIAL='DEPARTMENT.:',                                 X00060   
               LENGTH=12,                                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               POS=(07,07)                                              00063**3
ADEPTNB DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00064   
               LENGTH=4,                                               X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               POS=(07,20)                                              00068**3
        DFHMDF ATTRB=(ASKIP),                                          X00069   
               LENGTH=1,                                               X00070   
               COLOR=NEUTRAL,                                          X00071   
               POS=(07,25)                                              00072**3
*                                                                       00073   
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
