***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                    00004   
SUKM596 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SU596A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(20,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(03,02),                                            X00018   
               LENGTH=13,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='PO/RCVR.....:'                                  00020   
APORCVR DFHMDF POS=(03,16),                                            X00021   
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,29),                                            X00018   
               LENGTH=12,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='LINE.......:'                                           
ALINE   DFHMDF POS=(03,43),                                            X00021   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,54),                                            X00018   
               LENGTH=18,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='UNITS EXPECTED...:'                                     
AVERIFD DFHMDF POS=(03,73),                                            X        
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
**********************************************************************          
        DFHMDF POS=(04,02),                                            X        
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NBR OF CRTNS:'                                          
ATOTCRTN DFHMDF POS=(04,016),                                          X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(04,29),                                            X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='LINE STATUS:'                                           
ASTATUS  DFHMDF POS=(04,044),                                          X        
               LENGTH=002,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
        DFHMDF POS=(04,54),                                            X00023   
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='UNITS MANIFESTED.:'                                     
AMANFSTD DFHMDF POS=(04,073),                                          X00733   
               LENGTH=006,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZ9'                                                  
**********************************************************************  00011   
        DFHMDF POS=(05,002),                                           X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=13,                                              X        
               INITIAL='CURR OPER ID:'                                  00020   
AOPER   DFHMDF POS=(05,16),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='ZZZ9'                                                    
ANAME    DFHMDF POS=(05,021),                                          X00050   
               COLOR=BLUE,                                             X00051   
               ATTRB=(ASKIP),                                          X00052   
               LENGTH=025                                                       
        DFHMDF POS=(05,054),                                           X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=18,                                              X        
               INITIAL='UNIT VARIANCE QTY:'                             00020   
AVARINCE DFHMDF POS=(05,073),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=YELLOW,                                           X00734   
               PICOUT='ZZZZZ9-'                                                 
**********************************************************************  00011   
        DFHMDF POS=(06,002),                                           X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=13,                                              X        
               INITIAL='PACKAGE TYPE:'                                  00020   
APACKAGE DFHMDF POS=(06,016),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
        DFHMDF POS=(06,49),                                            X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL=' ITEMS'                                                 
ASTRTIT DFHMDF POS=(06,56),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(06,062),                                          X00056   
               LENGTH=002,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00058   
               COLOR=NEUTRAL,                                          X00057   
               INITIAL='TO'                                             00060   
AENDIT  DFHMDF POS=(06,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(06,071),                                           X00067   
               LENGTH=002,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='OF'                                             00071   
ATOTIT  DFHMDF POS=(06,74),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
ACTNSTS DFHMDF POS=(07,01),                                            X        
               LENGTH=48,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW                                                     
**********************************************************************  00011   
        DFHMDF POS=(08,026),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='M'                                                      
        DFHMDF POS=(08,28),                                            X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DEST'                                                   
        DFHMDF POS=(08,33),                                            X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CRE'                                                    
        DFHMDF POS=(08,37),                                            X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='STR'                                                    
        DFHMDF POS=(08,42),                                            X00023   
               LENGTH=011,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='--STATUS --'                                            
        DFHMDF POS=(08,56),                                            X00023   
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='UNITS'                                                  
        DFHMDF POS=(08,63),                                            X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CARTON'                                                 
        DFHMDF POS=(08,71),                                            X00023   
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='OUTBOUND'                                               
**********************************************************************  00011   
        DFHMDF POS=(09,001),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='S'                                                      
        DFHMDF POS=(09,003),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='A'                                                      
        DFHMDF POS=(09,013),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SML'                                                    
        DFHMDF POS=(09,026),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='R'                                                      
        DFHMDF POS=(09,028),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='NBR'                                            00025   
        DFHMDF POS=(09,033),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SRC'                                            00025   
        DFHMDF POS=(09,037),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SCAN'                                           00025   
        DFHMDF POS=(09,043),                                           X00023   
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DATE  TIME'                                             
        DFHMDF POS=(09,057),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='MFST'                                                   
        DFHMDF POS=(09,063),                                           X00023   
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='STATUS'                                         00025   
        DFHMDF POS=(09,073),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TRIP'                                           00025   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(10,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT01  DFHMDF POS=(10,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML01  DFHMDF POS=(10,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST01  DFHMDF POS=(10,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR01  DFHMDF POS=(10,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE01 DFHMDF POS=(10,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN01  DFHMDF POS=(10,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE01 DFHMDF POS=(10,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME01 DFHMDF POS=(10,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT01 DFHMDF POS=(10,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT01 DFHMDF POS=(10,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP01 DFHMDF POS=(10,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL02  DFHMDF POS=(11,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT02  DFHMDF POS=(11,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML02  DFHMDF POS=(11,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST02  DFHMDF POS=(11,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR02  DFHMDF POS=(11,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE02 DFHMDF POS=(11,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN02  DFHMDF POS=(11,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE02 DFHMDF POS=(11,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME02 DFHMDF POS=(11,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT02 DFHMDF POS=(11,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT02 DFHMDF POS=(11,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP02 DFHMDF POS=(11,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL03  DFHMDF POS=(12,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT03  DFHMDF POS=(12,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML03  DFHMDF POS=(12,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST03  DFHMDF POS=(12,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR03  DFHMDF POS=(12,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE03 DFHMDF POS=(12,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN03  DFHMDF POS=(12,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE03 DFHMDF POS=(12,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME03 DFHMDF POS=(12,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT03 DFHMDF POS=(12,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT03 DFHMDF POS=(12,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP03 DFHMDF POS=(12,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL04  DFHMDF POS=(13,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT04  DFHMDF POS=(13,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML04  DFHMDF POS=(13,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST04  DFHMDF POS=(13,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR04  DFHMDF POS=(13,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE04 DFHMDF POS=(13,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN04  DFHMDF POS=(13,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE04 DFHMDF POS=(13,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME04 DFHMDF POS=(13,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT04 DFHMDF POS=(13,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT04 DFHMDF POS=(13,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP04 DFHMDF POS=(13,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL05  DFHMDF POS=(14,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT05  DFHMDF POS=(14,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML05  DFHMDF POS=(14,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST05  DFHMDF POS=(14,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR05  DFHMDF POS=(14,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE05 DFHMDF POS=(14,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN05  DFHMDF POS=(14,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE05 DFHMDF POS=(14,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME05 DFHMDF POS=(14,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT05 DFHMDF POS=(14,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT05 DFHMDF POS=(14,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP05 DFHMDF POS=(14,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL06  DFHMDF POS=(15,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT06  DFHMDF POS=(15,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML06  DFHMDF POS=(15,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST06  DFHMDF POS=(15,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR06  DFHMDF POS=(15,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE06 DFHMDF POS=(15,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN06  DFHMDF POS=(15,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE06 DFHMDF POS=(15,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME06 DFHMDF POS=(15,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT06 DFHMDF POS=(15,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT06 DFHMDF POS=(15,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP06 DFHMDF POS=(15,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL07  DFHMDF POS=(16,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT07  DFHMDF POS=(16,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML07  DFHMDF POS=(16,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST07  DFHMDF POS=(16,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR07  DFHMDF POS=(16,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE07 DFHMDF POS=(16,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN07  DFHMDF POS=(16,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE07 DFHMDF POS=(16,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME07 DFHMDF POS=(16,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT07 DFHMDF POS=(16,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT07 DFHMDF POS=(16,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP07 DFHMDF POS=(16,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL08  DFHMDF POS=(17,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT08  DFHMDF POS=(17,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML08  DFHMDF POS=(17,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST08  DFHMDF POS=(17,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR08  DFHMDF POS=(17,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE08 DFHMDF POS=(17,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN08  DFHMDF POS=(17,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE08 DFHMDF POS=(17,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME08 DFHMDF POS=(17,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT08 DFHMDF POS=(17,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT08 DFHMDF POS=(17,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP08 DFHMDF POS=(17,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************  00011   
ASEL09  DFHMDF POS=(18,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT09  DFHMDF POS=(18,003),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASML09  DFHMDF POS=(18,005),                                           X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AMST09  DFHMDF POS=(18,026),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASTR09  DFHMDF POS=(18,028),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACRTE09 DFHMDF POS=(18,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCN09  DFHMDF POS=(18,037),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ADATE09 DFHMDF POS=(18,042),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATIME09 DFHMDF POS=(18,048),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
AMNFT09 DFHMDF POS=(18,055),                                           X00137   
               LENGTH=006,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZZZ9'                                                  
ASTAT09 DFHMDF POS=(18,062),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
ATRIP09 DFHMDF POS=(18,070),                                           X00137   
               LENGTH=009,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
**********************************************************************          
         DFHMDF POS=(19,045),                                          X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT   DFHMDF POS=(19,072),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
**********************************************************************          
**********************************************************************          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
