*          DATA SET SUKM554    AT LEVEL 002 AS OF 04/13/00              00003   
        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  SUKM554                                            *   00007   
*        MAP     SUK554                                             *   00008   
*        PROGRAM SUKCS554                                           *   00009   
*        TRANSID S554 - PO/RECEIVER CARTON DETAIL LIST              *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
SUKM554 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SUK554  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(19,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='SERIAL SHIP CODE:'                              00020   
ASERSH  DFHMDF POS=(02,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=18                                                        
        DFHMDF POS=(02,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=15,                                              X        
               INITIAL='DEST STORE....:'                                00020   
ADEST   DFHMDF POS=(02,68),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=08                                                        
**********************************************************************          
        DFHMDF POS=(03,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='VENDOR NAME.....:'                              00020   
AVNME   DFHMDF POS=(03,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=30                                                        
        DFHMDF POS=(03,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=15,                                              X        
               INITIAL='PO/RCVR.......:'                                00020   
APORCV  DFHMDF POS=(03,68),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=12                                                        
**********************************************************************          
ASCACH  DFHMDF POS=(04,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='SCAC............:'                              00020   
ASCAC   DFHMDF POS=(04,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
ATRLRH  DFHMDF POS=(04,27),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=12,                                              X        
               INITIAL='TRAILER NBR:'                                   00020   
ATRLR   DFHMDF POS=(04,40),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=11                                                        
        DFHMDF POS=(04,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=15,                                              X        
               INITIAL='DEPT..........:'                                00020   
ADEPT   DFHMDF POS=(04,68),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=03                                                        
**********************************************************************          
ATRIPH  DFHMDF POS=(05,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='TRIP ID.........:'                              00020   
ATRIP   DFHMDF POS=(05,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=09,                                              X        
               PICOUT='999999999'                                               
        DFHMDF POS=(05,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=15,                                              X        
               INITIAL='TOT CRTN QTY..:'                                00020   
ATOTQT  DFHMDF POS=(05,68),                                            X00021   
               LENGTH=07,                                              X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               PICOUT='ZZZZZZ9'                                                 
**********************************************************************          
        DFHMDF POS=(06,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='CART CRE SOURCE.:'                              00020   
ACRESRC DFHMDF POS=(06,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=22                                                        
        DFHMDF POS=(06,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=15,                                              X        
               INITIAL='SCAN USER ID..:'                                00020   
AUSRID  DFHMDF POS=(06,68),                                            X00021   
               LENGTH=08,                                              X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM)                                               
**********************************************************************  00011   
        DFHMDF POS=(07,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17,                                              X        
               INITIAL='CREATE DATE/TIME:'                              00020   
ACREDTE DFHMDF POS=(07,20),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=10                                                        
ACRETME DFHMDF POS=(07,32),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=08                                                        
APKIDD  DFHMDF POS=(07,52),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=17                                                        
APKID   DFHMDF POS=(07,71),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04                                                        
**********************************************************************  00011   
AMLTCT  DFHMDF POS=(08,02),                                            X00021   
               COLOR=YELLOW,                                           X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=040                                                       
        DFHMDF POS=(08,44),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(08,50),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(08,56),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(08,59),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(08,65),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(08,68),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
        DFHMDF POS=(09,07),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='PO'                                             00025   
AINACTV DFHMDF POS=(09,12),                                            X00023   
               COLOR=RED,                                              X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=024,                                             X        
               INITIAL='LINES IN RED NOT ON RCVR'                       00025   
APKMSG  DFHMDF POS=(09,37),                                            X00023   
               COLOR=YELLOW,                                           X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=026,                                             X        
               INITIAL='SKUS IN YELLOW NOT ON PACK'                     00025   
APPK    DFHMDF POS=(09,71),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005                                                       
**********************************************************************  00011   
        DFHMDF POS=(10,006),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='LINE'                                           00025   
        DFHMDF POS=(10,011),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=012,                                             X        
               INITIAL='DPT CL   SKU'                                   00025   
        DFHMDF POS=(10,027),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='DESC'                                           00025   
        DFHMDF POS=(10,048),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='UPC'                                            00025   
        DFHMDF POS=(10,065),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='QTY'                                            00025   
ARATO   DFHMDF POS=(10,071),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005                                                       
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(11,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT01  DFHMDF POS=(11,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN01 DFHMDF POS=(11,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK01 DFHMDF POS=(11,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC01 DFHMDF POS=(11,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC01  DFHMDF POS=(11,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY01  DFHMDF POS=(11,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK01  DFHMDF POS=(11,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  10011   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(12,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT02  DFHMDF POS=(12,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN02 DFHMDF POS=(12,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK02 DFHMDF POS=(12,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC02 DFHMDF POS=(12,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC02  DFHMDF POS=(12,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY02  DFHMDF POS=(12,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK02  DFHMDF POS=(12,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(13,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT03  DFHMDF POS=(13,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN03 DFHMDF POS=(13,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK03 DFHMDF POS=(13,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC03 DFHMDF POS=(13,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC03  DFHMDF POS=(13,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY03  DFHMDF POS=(13,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK03  DFHMDF POS=(13,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(14,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT04  DFHMDF POS=(14,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN04 DFHMDF POS=(14,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK04 DFHMDF POS=(14,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC04 DFHMDF POS=(14,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC04  DFHMDF POS=(14,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY04  DFHMDF POS=(14,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK04  DFHMDF POS=(14,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(15,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT05  DFHMDF POS=(15,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN05 DFHMDF POS=(15,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK05 DFHMDF POS=(15,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC05 DFHMDF POS=(15,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC05  DFHMDF POS=(15,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY05  DFHMDF POS=(15,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK05  DFHMDF POS=(15,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(16,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT06  DFHMDF POS=(16,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN06 DFHMDF POS=(16,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK06 DFHMDF POS=(16,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC06 DFHMDF POS=(16,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC06  DFHMDF POS=(16,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY06  DFHMDF POS=(16,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK06  DFHMDF POS=(16,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(17,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT07  DFHMDF POS=(17,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN07 DFHMDF POS=(17,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK07 DFHMDF POS=(17,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC07 DFHMDF POS=(17,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC07  DFHMDF POS=(17,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY07  DFHMDF POS=(17,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK07  DFHMDF POS=(17,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(18,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT08  DFHMDF POS=(18,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN08 DFHMDF POS=(18,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK08 DFHMDF POS=(18,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC08 DFHMDF POS=(18,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC08  DFHMDF POS=(18,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY08  DFHMDF POS=(18,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK08  DFHMDF POS=(18,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL09  DFHMDF POS=(19,002),                                           X00021   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT09  DFHMDF POS=(19,004),                                           X00137   
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
APOLN09 DFHMDF POS=(19,006),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                                    
ADPCSK09 DFHMDF POS=(19,011),                                          X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015                                               00140   
ADESC09 DFHMDF POS=(19,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=020                                               00140   
AUPC09  DFHMDF POS=(19,048),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=015,                                             X00140   
               PICOUT='999999999999999'                                 00033   
AQTY09  DFHMDF POS=(19,064),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
APPK09  DFHMDF POS=(19,071),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=005,                                             X00140   
               PICOUT='ZZZZ9'                                           00033   
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
