        PRINT NOGEN                                                     00001   
SUKM517  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU517A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='VISUAL TKT INFO:  '                             00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=005,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='D/M/S'                                          00015*29
ADEPT    DFHMDF POS=(02,07),                                           X00012**5
               LENGTH=003,                                             X00013*29
               ATTRB=(UNPROT,NORM,IC)                                   00014*24
AMJCLS   DFHMDF POS=(02,11),                                           X00012**5
               LENGTH=002,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00014*24
ASBCLS   DFHMDF POS=(02,14),                                           X00012**5
               LENGTH=002,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00014*24
*                                                                       00011   
         DFHMDF POS=(02,17),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                               
         DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='RETAIL'                                         00015*29
*                                                                       00011   
ARETAIL  DFHMDF POS=(03,08),                                           X00012**5
               LENGTH=008,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(03,17),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(04,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='SIZE  '                                         00015*29
*                                                                       00011   
ASIZE    DFHMDF POS=(04,08),                                           X00012**5
               LENGTH=010,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(04,19),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='COLOR '                                         00015*29
*                                                                       00011   
ACOLOR   DFHMDF POS=(05,08),                                           X00012**5
               LENGTH=010,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(05,19),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(06,01),                                           X00012**5
               LENGTH=006,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='STYLE '                                         00015*29
*                                                                       00011   
ASTYLE   DFHMDF POS=(06,08),                                           X00012**5
               LENGTH=012,                                             X00013*29
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00011   
         DFHMDF POS=(07,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='F2-CONT. F9-TKT ERR'                            00015*29
*                                                                       00068   
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
