***********************************************************************         
*   DOOR CARTON DIVERT LIST SCREEN                                              
***********************************************************************         
        PRINT  NOGEN                                                    00004   
SUKM564 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SU564A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(20,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,01),                                            X00018   
               LENGTH=08,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='OPER ID:'                                       00020   
AOPER   DFHMDF POS=(02,10),                                            X00021   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X00022   
               PICOUT='9999'                                                    
AOPRNME DFHMDF POS=(02,15),                                            X00021   
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
        DFHMDF POS=(02,48),                                            X00018   
               LENGTH=19,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='OPEN TRLR SERIAL #:'                            00020   
ATRLR   DFHMDF POS=(02,68),                                            X00021   
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
**********************************************************************  00011   
        DFHMDF POS=(03,01),                                            X00023   
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DOOR...:'                                       00025   
ADOOR    DFHMDF POS=(03,10),                                           X00733   
               LENGTH=04,                                              X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
ADRDESC DFHMDF POS=(03,15),                                            X00021   
               LENGTH=30,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
        DFHMDF POS=(03,48),                                            X00023   
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='OPEN OTBND TRIP ID:'                            00025   
ATRIP   DFHMDF POS=(03,68),                                            X00021   
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
**********************************************************************  00011   
        DFHMDF POS=(04,01),                                            X00023   
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TYPE...:'                                       00025   
ADRTYP   DFHMDF POS=(04,10),                                           X00733   
               LENGTH=30,                                              X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE                                                       
        DFHMDF POS=(04,48),                                            X00023   
               LENGTH=19,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='OPEN OTB TRIP DEST:'                            00025   
ADEST   DFHMDF POS=(04,68),                                            X00021   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
        DFHMDF POS=(04,73),                                            X00023   
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM)                                               
**********************************************************************  00011   
        DFHMDF POS=(05,50),                                            X00023   
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ITEMS'                                          00025   
ASTRTIT DFHMDF POS=(05,56),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(05,62),                                           X00056   
               LENGTH=002,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00058   
               COLOR=NEUTRAL,                                          X00057   
               INITIAL='TO'                                             00060   
AENDIT  DFHMDF POS=(05,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(05,71),                                            X00067   
               LENGTH=002,                                             X00060   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='OF'                                             00071   
ATOTIT  DFHMDF POS=(05,74),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
        DFHMDF POS=(06,26),                                            X00023   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DEST'                                           00025   
        DFHMDF POS=(06,35),                                            X00023   
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='-----PO-----'                                   00025   
        DFHMDF POS=(06,48),                                            X00023   
               LENGTH=22,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='-------DIVERTED-------'                         00025   
        DFHMDF POS=(06,71),                                            X00023   
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TRAILER'                                        00025   
**********************************************************************  00011   
        DFHMDF POS=(07,01),                                            X00023   
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='S'                                              00025   
        DFHMDF POS=(07,03),                                            X00023   
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(07,007),                                           X00023   
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SML'                                            00025   
        DFHMDF POS=(07,26),                                            X00023   
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='NBR'                                                    
        DFHMDF POS=(07,31),                                            X00023   
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CRE'                                                    
        DFHMDF POS=(07,35),                                            X00023   
               LENGTH=06,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='NUMBER'                                         00025   
        DFHMDF POS=(07,43),                                            X00023   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='RCVR'                                           00025   
        DFHMDF POS=(07,48),                                            X00023   
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='STAT  I'                                        00025   
        DFHMDF POS=(07,57),                                            X00023   
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL=' DATE'                                                  
        DFHMDF POS=(07,65),                                            X00023   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TIME'                                           00025   
        DFHMDF POS=(07,71),                                            X00023   
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SERIAL #'                                       00025   
**********************************************************************  00021   
ASEL01  DFHMDF POS=(08,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT01  DFHMDF POS=(08,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML01  DFHMDF POS=(08,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST01 DFHMDF POS=(08,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE01  DFHMDF POS=(08,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC01 DFHMDF POS=(08,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT01 DFHMDF POS=(08,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV01 DFHMDF POS=(08,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE01 DFHMDF POS=(08,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME01 DFHMDF POS=(08,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR01 DFHMDF POS=(08,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00021   
ASEL02  DFHMDF POS=(09,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT02  DFHMDF POS=(09,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML02  DFHMDF POS=(09,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST02 DFHMDF POS=(09,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE02  DFHMDF POS=(09,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC02 DFHMDF POS=(09,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT02 DFHMDF POS=(09,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV02 DFHMDF POS=(09,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE02 DFHMDF POS=(09,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME02 DFHMDF POS=(09,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR02 DFHMDF POS=(09,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00021   
ASEL03  DFHMDF POS=(10,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT03  DFHMDF POS=(10,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML03  DFHMDF POS=(10,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST03 DFHMDF POS=(10,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE03  DFHMDF POS=(10,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC03 DFHMDF POS=(10,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT03 DFHMDF POS=(10,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV03 DFHMDF POS=(10,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE03 DFHMDF POS=(10,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME03 DFHMDF POS=(10,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR03 DFHMDF POS=(10,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00041   
ASEL04  DFHMDF POS=(11,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT04  DFHMDF POS=(11,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML04  DFHMDF POS=(11,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST04 DFHMDF POS=(11,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE04  DFHMDF POS=(11,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC04 DFHMDF POS=(11,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT04 DFHMDF POS=(11,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV04 DFHMDF POS=(11,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE04 DFHMDF POS=(11,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME04 DFHMDF POS=(11,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR04 DFHMDF POS=(11,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00021   
ASEL05  DFHMDF POS=(12,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT05  DFHMDF POS=(12,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML05  DFHMDF POS=(12,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST05 DFHMDF POS=(12,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE05  DFHMDF POS=(12,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC05 DFHMDF POS=(12,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT05 DFHMDF POS=(12,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV05 DFHMDF POS=(12,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE05 DFHMDF POS=(12,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME05 DFHMDF POS=(12,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR05 DFHMDF POS=(12,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00061   
ASEL06  DFHMDF POS=(13,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT06  DFHMDF POS=(13,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML06  DFHMDF POS=(13,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST06 DFHMDF POS=(13,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE06  DFHMDF POS=(13,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC06 DFHMDF POS=(13,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT06 DFHMDF POS=(13,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV06 DFHMDF POS=(13,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE06 DFHMDF POS=(13,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME06 DFHMDF POS=(13,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR06 DFHMDF POS=(13,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00021   
ASEL07  DFHMDF POS=(14,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT07  DFHMDF POS=(14,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML07  DFHMDF POS=(14,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST07 DFHMDF POS=(14,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE07  DFHMDF POS=(14,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC07 DFHMDF POS=(14,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT07 DFHMDF POS=(14,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV07 DFHMDF POS=(14,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE07 DFHMDF POS=(14,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME07 DFHMDF POS=(14,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR07 DFHMDF POS=(14,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00081   
ASEL08  DFHMDF POS=(15,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT08  DFHMDF POS=(15,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML08  DFHMDF POS=(15,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST08 DFHMDF POS=(15,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE08  DFHMDF POS=(15,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC08 DFHMDF POS=(15,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT08 DFHMDF POS=(15,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV08 DFHMDF POS=(15,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE08 DFHMDF POS=(15,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME08 DFHMDF POS=(15,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR08 DFHMDF POS=(15,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00091   
ASEL09  DFHMDF POS=(16,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT09  DFHMDF POS=(16,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML09  DFHMDF POS=(16,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST09 DFHMDF POS=(16,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE09  DFHMDF POS=(16,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC09 DFHMDF POS=(16,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT09 DFHMDF POS=(16,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV09 DFHMDF POS=(16,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE09 DFHMDF POS=(16,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME09 DFHMDF POS=(16,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR09 DFHMDF POS=(16,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00021   
ASEL10  DFHMDF POS=(17,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT10  DFHMDF POS=(17,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML10  DFHMDF POS=(17,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST10 DFHMDF POS=(17,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE10  DFHMDF POS=(17,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC10 DFHMDF POS=(17,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT10 DFHMDF POS=(17,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV10 DFHMDF POS=(17,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE10 DFHMDF POS=(17,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME10 DFHMDF POS=(17,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR10 DFHMDF POS=(17,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************  00111   
ASEL11  DFHMDF POS=(18,01),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT11  DFHMDF POS=(18,03),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASML11  DFHMDF POS=(18,07),                                            X        
               LENGTH=18,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADEST11 DFHMDF POS=(18,26),                                            X        
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ACRE11  DFHMDF POS=(18,31),                                            X        
               LENGTH=03,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
APORC11 DFHMDF POS=(18,35),                                            X        
               LENGTH=12,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT11 DFHMDF POS=(18,48),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
AACTV11 DFHMDF POS=(18,54),                                            X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADATE11 DFHMDF POS=(18,56),                                            X        
               LENGTH=08,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATIME11 DFHMDF POS=(18,65),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR11 DFHMDF POS=(18,71),                                            X        
               LENGTH=09,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
***********************************************************************         
***********************************************************************         
        DFHMDF POS=(19,45),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT  DFHMDF POS=(19,72),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
        DFHMSD TYPE=FINAL                                                       
        END                                                                     
