*          DATA SET SUKM768                                             00010000
        PRINT  NOGEN                                                    00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  SUKM768                                            *   00050000
*        MAP     SUK768                                             *   00060000
*        PROGRAM SUKCS768                                           *   00070000
*        TRANSID S768 - DIRECTIVE RELEASE BY PO LIST SCREEN         *   00080020
*                                                                   *   00090000
*-------------------------------------------------------------------*   00100000
SUKM768 DFHMSD TYPE=DSECT,                                             X00110000
               LANG=COBOL,                                             X00120000
               MODE=INOUT,                                             X00130000
               STORAGE=AUTO,                                           X00140000
               TERM=3270-2,                                            X00150000
               TIOAPFX=YES                                              00160000
**********************************************************************  00170000
SUK768  DFHMDI LINE=2,COLUMN=1,                                        X00180000
               SIZE=(19,80),                                           X00190000
               CTRL=(FREEKB),                                          X00200000
               MAPATTS=(COLOR,HILIGHT),                                X00210000
               DSATTS=(COLOR,HILIGHT)                                   00220000
**********************************************************************  00230000
**********************************************************************  00240000
         DFHMDF POS=(03,03),                                           X00250000
               LENGTH=13,                                              X00260000
               ATTRB=(ASKIP,NORM),                                     X00270000
               COLOR=NEUTRAL,                                          X00280000
               INITIAL='OPER UNIT ID:'                                  00290000
AOPRUNT  DFHMDF POS=(03,17),                                           X00300009
               LENGTH=04,                                              X00310000
               ATTRB=(ASKIP,NORM),                                     X00320013
               COLOR=BLUE                                               00340013
         DFHMDF POS=(03,22),                                           X00350000
               ATTRB=(ASKIP,DRK),                                      X00360000
               LENGTH=001                                               00370000
**********************************************************************  00380000
         DFHMDF POS=(03,25),                                           X00390000
               LENGTH=08,                                              X00400000
               ATTRB=(ASKIP,NORM),                                     X00410000
               COLOR=NEUTRAL,                                          X00420000
               INITIAL='PO.....:'                                       00430000
APONBR   DFHMDF POS=(03,34),                                           X00440001
               LENGTH=09,                                              X00450000
               ATTRB=(ASKIP,NORM),                                     X00451013
               COLOR=BLUE                                               00480013
         DFHMDF POS=(03,44),                                           X00490000
               ATTRB=(ASKIP,DRK),                                      X00500000
               LENGTH=001                                               00510000
*******************************************************************     00511008
         DFHMDF POS=(05,51),                                           X00512008
               LENGTH=05,                                              X00513008
               ATTRB=(ASKIP,NORM),                                     X00514008
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00515008
ASTRTIT  DFHMDF POS=(05,57),                                           X00516008
               LENGTH=05,                                              X00517008
               ATTRB=(NUM,UNPROT,NORM),                                X00518008
               COLOR=GREEN,                                            X00519008
               PICOUT='ZZZZ9',                                         X00519108
               HILIGHT=UNDERLINE                                        00519208
         DFHMDF POS=(05,63),                                           X00519308
               LENGTH=02,                                              X00519408
               ATTRB=(ASKIP,NORM),                                     X00519508
               COLOR=NEUTRAL,                                          X00519608
               INITIAL='TO'                                             00519708
AENDIT   DFHMDF POS=(05,66),                                           X00519808
               LENGTH=05,                                              X00519908
               ATTRB=(ASKIP,NORM),                                     X00520008
               COLOR=BLUE,                                             X00520108
               PICOUT='ZZZZ9'                                           00520208
         DFHMDF POS=(05,72),                                           X00520308
               LENGTH=02,                                              X00520408
               ATTRB=(ASKIP,NORM),                                     X00520508
               COLOR=NEUTRAL,                                          X00520608
               INITIAL='OF'                                             00520708
ATOTIT  DFHMDF POS=(05,75),                                            X00520808
               LENGTH=05,                                              X00520908
               ATTRB=(ASKIP,NORM),                                     X00521008
               COLOR=BLUE,                                             X00521108
               PICOUT='ZZZZ9'                                           00521208
**********************************************************************  00840001
         DFHMDF POS=(06,13),                                           X00850001
               LENGTH=01,                                              X00860001
               ATTRB=(ASKIP,NORM),                                     X00870001
               COLOR=NEUTRAL,                                          X00880001
               INITIAL='P'                                              00890001
         DFHMDF POS=(06,44),                                           X00900016
               LENGTH=16,                                              X00910001
               ATTRB=(ASKIP,NORM),                                     X00920001
               COLOR=NEUTRAL,                                          X00930001
               INITIAL='EXP   DIRTV RLSD'                               00940001
**********************************************************************  00950000
         DFHMDF POS=(07,13),                                           X00960001
               LENGTH=01,                                              X00970001
               ATTRB=(ASKIP,NORM),                                     X00980001
               COLOR=NEUTRAL,                                          X00990001
               INITIAL='K'                                              01000001
         DFHMDF POS=(07,30),                                           X01010016
               LENGTH=04,                                              X01020001
               ATTRB=(ASKIP,NORM),                                     X01030001
               COLOR=NEUTRAL,                                          X01040001
               INITIAL='TRLR'                                           01050001
         DFHMDF POS=(07,44),                                           X01060018
               LENGTH=16,                                              X01070001
               ATTRB=(ASKIP,NORM),                                     X01080001
               COLOR=NEUTRAL,                                          X01090001
               INITIAL='CRTN  CRTN  CRTN'                               01100001
         DFHMDF POS=(07,61),                                           X01110018
               LENGTH=18,                                              X01120003
               ATTRB=(ASKIP,NORM),                                     X01130001
               COLOR=NEUTRAL,                                          X01140001
               INITIAL='1ST DIRECTIVE CRE '                             01150020
*********************************************************************** 01160002
         DFHMDF POS=(08,02),                                           X01170002
               LENGTH=40,                                              X01180002
               ATTRB=(ASKIP,NORM),                                     X01190002
               COLOR=NEUTRAL,                                          X01200002
               INITIAL='S ACT RCVR G SCAC TRAILER   STAT  TRIP '        01210016
         DFHMDF POS=(08,43),                                           X01220002
               LENGTH=36,                                              X01230003
               ATTRB=(ASKIP,NORM),                                     X01240002
               COLOR=NEUTRAL,                                          X01250002
               INITIAL=' CNT   CNT   CNT  --DATE-- --TIME-- '           01260016
**********************************************************************  01270003
ASEL01  DFHMDF POS=(09,002),                                           X01280003
               COLOR=GREEN,                                            X01290003
               HILIGHT=UNDERLINE,                                      X01300003
               ATTRB=(UNPROT,NORM),                                    X01310003
               LENGTH=001                                               01320003
AACT01  DFHMDF POS=(09,004),                                           X01330003
               ATTRB=(ASKIP,NORM),                                     X01340003
               LENGTH=003                                               01360003
ARCVR01 DFHMDF POS=(09,008),                                           X01370003
               ATTRB=(ASKIP,NORM),                                     X01380003
               COLOR=BLUE,                                             X01381007
               LENGTH=004                                               01400003
APKGT01 DFHMDF POS=(09,013),                                           X01410003
               COLOR=BLUE,                                             X01420003
               ATTRB=(ASKIP,NORM),                                     X01430003
               LENGTH=001                                               01450003
ASCAC01 DFHMDF POS=(09,015),                                           X01460003
               COLOR=BLUE,                                             X01470003
               ATTRB=(ASKIP,NORM),                                     X01480003
               LENGTH=004                                               01500003
ATRLR01 DFHMDF POS=(09,020),                                           X01510003
               COLOR=BLUE,                                             X01520003
               ATTRB=(ASKIP,NORM),                                     X01530003
               LENGTH=010                                               01550014
ATRST01 DFHMDF POS=(09,031),                                           X01560015
               COLOR=BLUE,                                             X01570003
               ATTRB=(ASKIP,NORM),                                     X01580003
               LENGTH=002                                               01600003
ATRIP01 DFHMDF POS=(09,034),                                           X01610015
               COLOR=BLUE,                                             X01620003
               ATTRB=(ASKIP,NORM),                                     X01630003
               LENGTH=009                                               01650003
AECNT01 DFHMDF POS=(09,044),                                           X01660015
               COLOR=BLUE,                                             X01670003
               ATTRB=(ASKIP,NORM),                                     X01680003
               LENGTH=004                                               01700010
ADCNT01 DFHMDF POS=(09,050),                                           X01710019
               COLOR=BLUE,                                             X01720003
               ATTRB=(ASKIP,NORM),                                     X01730003
               LENGTH=004                                               01750010
ARCNT01 DFHMDF POS=(09,056),                                           X01760019
               COLOR=BLUE,                                             X01770003
               ATTRB=(ASKIP,NORM),                                     X01780003
               LENGTH=004                                               01800010
ADATE01 DFHMDF POS=(09,061),                                           X01810003
               COLOR=BLUE,                                             X01820003
               ATTRB=(ASKIP,NORM),                                     X01830003
               LENGTH=008                                               01840003
ATIME01 DFHMDF POS=(09,070),                                           X01850003
               COLOR=BLUE,                                             X01860003
               ATTRB=(ASKIP,NORM),                                     X01870003
               LENGTH=008                                               01880003
**********************************************************************  01890001
**********************************************************************  01890103
ASEL02  DFHMDF POS=(10,002),                                           X01890203
               COLOR=GREEN,                                            X01890303
               HILIGHT=UNDERLINE,                                      X01890403
               ATTRB=(UNPROT,NORM),                                    X01890503
               LENGTH=001                                               01890603
AACT02  DFHMDF POS=(10,004),                                           X01890703
               ATTRB=(ASKIP,NORM),                                     X01890803
               LENGTH=003                                               01891003
ARCVR02 DFHMDF POS=(10,008),                                           X01891103
               ATTRB=(ASKIP,NORM),                                     X01891203
               COLOR=BLUE,                                             X01891307
               LENGTH=004                                               01891503
APKGT02 DFHMDF POS=(10,013),                                           X01891603
               COLOR=BLUE,                                             X01891703
               ATTRB=(ASKIP,NORM),                                     X01891803
               LENGTH=001                                               01892003
ASCAC02 DFHMDF POS=(10,015),                                           X01892103
               COLOR=BLUE,                                             X01892203
               ATTRB=(ASKIP,NORM),                                     X01892303
               LENGTH=004                                               01892503
ATRLR02 DFHMDF POS=(10,020),                                           X01892603
               COLOR=BLUE,                                             X01892703
               ATTRB=(ASKIP,NORM),                                     X01892803
               LENGTH=010                                               01892914
ATRST02 DFHMDF POS=(10,031),                                           X01893115
               COLOR=BLUE,                                             X01893203
               ATTRB=(ASKIP,NORM),                                     X01893303
               LENGTH=002                                               01893503
ATRIP02 DFHMDF POS=(10,034),                                           X01893615
               COLOR=BLUE,                                             X01893703
               ATTRB=(ASKIP,NORM),                                     X01893803
               LENGTH=009                                               01894003
AECNT02 DFHMDF POS=(10,044),                                           X01894115
               COLOR=BLUE,                                             X01894203
               ATTRB=(ASKIP,NORM),                                     X01894303
               LENGTH=004                                               01894510
ADCNT02 DFHMDF POS=(10,050),                                           X01894619
               COLOR=BLUE,                                             X01894703
               ATTRB=(ASKIP,NORM),                                     X01894803
               LENGTH=004                                               01895010
ARCNT02 DFHMDF POS=(10,056),                                           X01895119
               COLOR=BLUE,                                             X01895203
               ATTRB=(ASKIP,NORM),                                     X01895303
               LENGTH=004                                               01895510
ADATE02 DFHMDF POS=(10,061),                                           X01895603
               COLOR=BLUE,                                             X01895703
               ATTRB=(ASKIP,NORM),                                     X01895803
               LENGTH=008                                               01895903
ATIME02 DFHMDF POS=(10,070),                                           X01896003
               COLOR=BLUE,                                             X01896103
               ATTRB=(ASKIP,NORM),                                     X01896203
               LENGTH=008                                               01896303
**********************************************************************  01896403
**********************************************************************  01921403
ASEL03  DFHMDF POS=(11,002),                                           X01921503
               COLOR=GREEN,                                            X01921603
               HILIGHT=UNDERLINE,                                      X01921703
               ATTRB=(UNPROT,NORM),                                    X01921803
               LENGTH=001                                               01921903
AACT03  DFHMDF POS=(11,004),                                           X01922003
               ATTRB=(ASKIP,NORM),                                     X01922103
               LENGTH=003                                               01922303
ARCVR03 DFHMDF POS=(11,008),                                           X01922403
               ATTRB=(ASKIP,NORM),                                     X01922503
               COLOR=BLUE,                                             X01922607
               LENGTH=004                                               01922803
APKGT03 DFHMDF POS=(11,013),                                           X01922903
               COLOR=BLUE,                                             X01923003
               ATTRB=(ASKIP,NORM),                                     X01923103
               LENGTH=001                                               01923303
ASCAC03 DFHMDF POS=(11,015),                                           X01923403
               COLOR=BLUE,                                             X01923503
               ATTRB=(ASKIP,NORM),                                     X01923603
               LENGTH=004                                               01923803
ATRLR03 DFHMDF POS=(11,020),                                           X01923903
               COLOR=BLUE,                                             X01924003
               ATTRB=(ASKIP,NORM),                                     X01924103
               LENGTH=010                                               01924214
ATRST03 DFHMDF POS=(11,031),                                           X01924415
               COLOR=BLUE,                                             X01924503
               ATTRB=(ASKIP,NORM),                                     X01924603
               LENGTH=002                                               01924803
ATRIP03 DFHMDF POS=(11,034),                                           X01924915
               COLOR=BLUE,                                             X01925003
               ATTRB=(ASKIP,NORM),                                     X01925103
               LENGTH=009                                               01925303
AECNT03 DFHMDF POS=(11,044),                                           X01925415
               COLOR=BLUE,                                             X01925503
               ATTRB=(ASKIP,NORM),                                     X01925603
               LENGTH=004                                               01925810
ADCNT03 DFHMDF POS=(11,050),                                           X01925919
               COLOR=BLUE,                                             X01926003
               ATTRB=(ASKIP,NORM),                                     X01926103
               LENGTH=004                                               01926310
ARCNT03 DFHMDF POS=(11,056),                                           X01926419
               COLOR=BLUE,                                             X01926503
               ATTRB=(ASKIP,NORM),                                     X01926603
               LENGTH=004                                               01926810
ADATE03 DFHMDF POS=(11,061),                                           X01926903
               COLOR=BLUE,                                             X01927003
               ATTRB=(ASKIP,NORM),                                     X01927103
               LENGTH=008                                               01927203
ATIME03 DFHMDF POS=(11,070),                                           X01927303
               COLOR=BLUE,                                             X01927403
               ATTRB=(ASKIP,NORM),                                     X01927503
               LENGTH=008                                               01927603
**********************************************************************  01927703
**********************************************************************  01927803
ASEL04  DFHMDF POS=(12,002),                                           X01927903
               COLOR=GREEN,                                            X01928003
               HILIGHT=UNDERLINE,                                      X01928103
               ATTRB=(UNPROT,NORM),                                    X01928203
               LENGTH=001                                               01928303
AACT04  DFHMDF POS=(12,004),                                           X01928403
               ATTRB=(ASKIP,NORM),                                     X01928503
               LENGTH=003                                               01928603
ARCVR04 DFHMDF POS=(12,008),                                           X01928703
               ATTRB=(ASKIP,NORM),                                     X01928803
               COLOR=BLUE,                                             X01928907
               LENGTH=004                                               01929103
APKGT04 DFHMDF POS=(12,013),                                           X01929203
               COLOR=BLUE,                                             X01929303
               ATTRB=(ASKIP,NORM),                                     X01929403
               LENGTH=001                                               01929603
ASCAC04 DFHMDF POS=(12,015),                                           X01929703
               COLOR=BLUE,                                             X01929803
               ATTRB=(ASKIP,NORM),                                     X01929903
               LENGTH=004                                               01930103
ATRLR04 DFHMDF POS=(12,020),                                           X01930203
               COLOR=BLUE,                                             X01930303
               ATTRB=(ASKIP,NORM),                                     X01930403
               LENGTH=010                                               01930514
ATRST04 DFHMDF POS=(12,031),                                           X01930715
               COLOR=BLUE,                                             X01930803
               ATTRB=(ASKIP,NORM),                                     X01930903
               LENGTH=002                                               01931103
ATRIP04 DFHMDF POS=(12,034),                                           X01931215
               COLOR=BLUE,                                             X01931303
               ATTRB=(ASKIP,NORM),                                     X01931403
               LENGTH=009                                               01931603
AECNT04 DFHMDF POS=(12,044),                                           X01931715
               COLOR=BLUE,                                             X01931803
               ATTRB=(ASKIP,NORM),                                     X01931903
               LENGTH=004                                               01932110
ADCNT04 DFHMDF POS=(12,050),                                           X01932219
               COLOR=BLUE,                                             X01932303
               ATTRB=(ASKIP,NORM),                                     X01932403
               LENGTH=004                                               01932610
ARCNT04 DFHMDF POS=(12,056),                                           X01932719
               COLOR=BLUE,                                             X01932803
               ATTRB=(ASKIP,NORM),                                     X01932903
               LENGTH=004                                               01933110
ADATE04 DFHMDF POS=(12,061),                                           X01933203
               COLOR=BLUE,                                             X01933303
               ATTRB=(ASKIP,NORM),                                     X01933403
               LENGTH=008                                               01933503
ATIME04 DFHMDF POS=(12,070),                                           X01933603
               COLOR=BLUE,                                             X01933703
               ATTRB=(ASKIP,NORM),                                     X01933803
               LENGTH=008                                               01933903
**********************************************************************  01934003
**********************************************************************  01934104
ASEL05  DFHMDF POS=(13,002),                                           X01934204
               COLOR=GREEN,                                            X01934304
               HILIGHT=UNDERLINE,                                      X01934404
               ATTRB=(UNPROT,NORM),                                    X01934504
               LENGTH=001                                               01934604
AACT05  DFHMDF POS=(13,004),                                           X01934704
               ATTRB=(ASKIP,NORM),                                     X01934804
               LENGTH=003                                               01934904
ARCVR05 DFHMDF POS=(13,008),                                           X01935004
               ATTRB=(ASKIP,NORM),                                     X01935104
               COLOR=BLUE,                                             X01935207
               LENGTH=004                                               01935404
APKGT05 DFHMDF POS=(13,013),                                           X01935504
               COLOR=BLUE,                                             X01935604
               ATTRB=(ASKIP,NORM),                                     X01935704
               LENGTH=001                                               01935904
ASCAC05 DFHMDF POS=(13,015),                                           X01936004
               COLOR=BLUE,                                             X01936104
               ATTRB=(ASKIP,NORM),                                     X01936204
               LENGTH=004                                               01936404
ATRLR05 DFHMDF POS=(13,020),                                           X01936504
               COLOR=BLUE,                                             X01936604
               ATTRB=(ASKIP,NORM),                                     X01936704
               LENGTH=010                                               01936814
ATRST05 DFHMDF POS=(13,031),                                           X01937015
               COLOR=BLUE,                                             X01937104
               ATTRB=(ASKIP,NORM),                                     X01937204
               LENGTH=002                                               01937404
ATRIP05 DFHMDF POS=(13,034),                                           X01937515
               COLOR=BLUE,                                             X01937604
               ATTRB=(ASKIP,NORM),                                     X01937704
               LENGTH=009                                               01937904
AECNT05 DFHMDF POS=(13,044),                                           X01938015
               COLOR=BLUE,                                             X01938104
               ATTRB=(ASKIP,NORM),                                     X01938204
               LENGTH=004                                               01938410
ADCNT05 DFHMDF POS=(13,050),                                           X01938519
               COLOR=BLUE,                                             X01938604
               ATTRB=(ASKIP,NORM),                                     X01938704
               LENGTH=004                                               01938910
ARCNT05 DFHMDF POS=(13,056),                                           X01939019
               COLOR=BLUE,                                             X01939104
               ATTRB=(ASKIP,NORM),                                     X01939204
               LENGTH=004                                               01939410
ADATE05 DFHMDF POS=(13,061),                                           X01939504
               COLOR=BLUE,                                             X01939604
               ATTRB=(ASKIP,NORM),                                     X01939704
               LENGTH=008                                               01939804
ATIME05 DFHMDF POS=(13,070),                                           X01939904
               COLOR=BLUE,                                             X01940004
               ATTRB=(ASKIP,NORM),                                     X01940104
               LENGTH=008                                               01940204
**********************************************************************  01940304
**********************************************************************  01940404
ASEL06  DFHMDF POS=(14,002),                                           X01940504
               COLOR=GREEN,                                            X01940604
               HILIGHT=UNDERLINE,                                      X01940704
               ATTRB=(UNPROT,NORM),                                    X01940804
               LENGTH=001                                               01940904
AACT06  DFHMDF POS=(14,004),                                           X01941004
               ATTRB=(ASKIP,NORM),                                     X01941104
               LENGTH=003                                               01941204
ARCVR06 DFHMDF POS=(14,008),                                           X01941304
               ATTRB=(ASKIP,NORM),                                     X01941404
               COLOR=BLUE,                                             X01941507
               LENGTH=004                                               01941704
APKGT06 DFHMDF POS=(14,013),                                           X01941804
               COLOR=BLUE,                                             X01941904
               ATTRB=(ASKIP,NORM),                                     X01942004
               LENGTH=001                                               01942204
ASCAC06 DFHMDF POS=(14,015),                                           X01942304
               COLOR=BLUE,                                             X01942404
               ATTRB=(ASKIP,NORM),                                     X01942504
               LENGTH=004                                               01942704
ATRLR06 DFHMDF POS=(14,020),                                           X01942804
               COLOR=BLUE,                                             X01942904
               ATTRB=(ASKIP,NORM),                                     X01943004
               LENGTH=010                                               01943114
ATRST06 DFHMDF POS=(14,031),                                           X01943315
               COLOR=BLUE,                                             X01943404
               ATTRB=(ASKIP,NORM),                                     X01943504
               LENGTH=002                                               01943704
ATRIP06 DFHMDF POS=(14,034),                                           X01943815
               COLOR=BLUE,                                             X01943904
               ATTRB=(ASKIP,NORM),                                     X01944004
               LENGTH=009                                               01944204
AECNT06 DFHMDF POS=(14,044),                                           X01944315
               COLOR=BLUE,                                             X01944404
               ATTRB=(ASKIP,NORM),                                     X01944504
               LENGTH=004                                               01944710
ADCNT06 DFHMDF POS=(14,050),                                           X01944819
               COLOR=BLUE,                                             X01944904
               ATTRB=(ASKIP,NORM),                                     X01945004
               LENGTH=004                                               01945210
ARCNT06 DFHMDF POS=(14,056),                                           X01945319
               COLOR=BLUE,                                             X01945404
               ATTRB=(ASKIP,NORM),                                     X01945504
               LENGTH=004                                               01945710
ADATE06 DFHMDF POS=(14,061),                                           X01945804
               COLOR=BLUE,                                             X01945904
               ATTRB=(ASKIP,NORM),                                     X01946004
               LENGTH=008                                               01946104
ATIME06 DFHMDF POS=(14,070),                                           X01946204
               COLOR=BLUE,                                             X01946304
               ATTRB=(ASKIP,NORM),                                     X01946404
               LENGTH=008                                               01946504
**********************************************************************  01946604
**********************************************************************  01946704
ASEL07  DFHMDF POS=(15,002),                                           X01946804
               COLOR=GREEN,                                            X01946904
               HILIGHT=UNDERLINE,                                      X01947004
               ATTRB=(UNPROT,NORM),                                    X01947104
               LENGTH=001                                               01947204
AACT07  DFHMDF POS=(15,004),                                           X01947304
               ATTRB=(ASKIP,NORM),                                     X01947404
               LENGTH=003                                               01947504
ARCVR07 DFHMDF POS=(15,008),                                           X01947604
               ATTRB=(ASKIP,NORM),                                     X01947704
               COLOR=BLUE,                                             X01947807
               LENGTH=004                                               01948004
APKGT07 DFHMDF POS=(15,013),                                           X01948104
               COLOR=BLUE,                                             X01948204
               ATTRB=(ASKIP,NORM),                                     X01948304
               LENGTH=001                                               01948504
ASCAC07 DFHMDF POS=(15,015),                                           X01948604
               COLOR=BLUE,                                             X01948704
               ATTRB=(ASKIP,NORM),                                     X01948804
               LENGTH=004                                               01949004
ATRLR07 DFHMDF POS=(15,020),                                           X01949104
               COLOR=BLUE,                                             X01949204
               ATTRB=(ASKIP,NORM),                                     X01949304
               LENGTH=010                                               01949414
ATRST07 DFHMDF POS=(15,031),                                           X01949615
               COLOR=BLUE,                                             X01949704
               ATTRB=(ASKIP,NORM),                                     X01949804
               LENGTH=002                                               01950004
ATRIP07 DFHMDF POS=(15,034),                                           X01950115
               COLOR=BLUE,                                             X01950204
               ATTRB=(ASKIP,NORM),                                     X01950304
               LENGTH=009                                               01950504
AECNT07 DFHMDF POS=(15,044),                                           X01950615
               COLOR=BLUE,                                             X01950704
               ATTRB=(ASKIP,NORM),                                     X01950804
               LENGTH=004                                               01951010
ADCNT07 DFHMDF POS=(15,050),                                           X01951119
               COLOR=BLUE,                                             X01951204
               ATTRB=(ASKIP,NORM),                                     X01951304
               LENGTH=004                                               01951510
ARCNT07 DFHMDF POS=(15,056),                                           X01951619
               COLOR=BLUE,                                             X01951704
               ATTRB=(ASKIP,NORM),                                     X01951804
               LENGTH=004                                               01952010
ADATE07 DFHMDF POS=(15,061),                                           X01952104
               COLOR=BLUE,                                             X01952204
               ATTRB=(ASKIP,NORM),                                     X01952304
               LENGTH=008                                               01952404
ATIME07 DFHMDF POS=(15,070),                                           X01952504
               COLOR=BLUE,                                             X01952604
               ATTRB=(ASKIP,NORM),                                     X01952704
               LENGTH=008                                               01952804
**********************************************************************  01952904
**********************************************************************  01953004
ASEL08  DFHMDF POS=(16,002),                                           X01953104
               COLOR=GREEN,                                            X01953204
               HILIGHT=UNDERLINE,                                      X01953304
               ATTRB=(UNPROT,NORM),                                    X01953404
               LENGTH=001                                               01953504
AACT08  DFHMDF POS=(16,004),                                           X01953604
               ATTRB=(ASKIP,NORM),                                     X01953704
               LENGTH=003                                               01953804
ARCVR08 DFHMDF POS=(16,008),                                           X01953904
               ATTRB=(ASKIP,NORM),                                     X01954004
               COLOR=BLUE,                                             X01954107
               LENGTH=004                                               01954304
APKGT08 DFHMDF POS=(16,013),                                           X01954404
               COLOR=BLUE,                                             X01954504
               ATTRB=(ASKIP,NORM),                                     X01954604
               LENGTH=001                                               01954804
ASCAC08 DFHMDF POS=(16,015),                                           X01954904
               COLOR=BLUE,                                             X01955004
               ATTRB=(ASKIP,NORM),                                     X01955104
               LENGTH=004                                               01955304
ATRLR08 DFHMDF POS=(16,020),                                           X01955404
               COLOR=BLUE,                                             X01955504
               ATTRB=(ASKIP,NORM),                                     X01955604
               LENGTH=010                                               01955714
ATRST08 DFHMDF POS=(16,031),                                           X01955915
               COLOR=BLUE,                                             X01956004
               ATTRB=(ASKIP,NORM),                                     X01956104
               LENGTH=002                                               01956304
ATRIP08 DFHMDF POS=(16,034),                                           X01956415
               COLOR=BLUE,                                             X01956504
               ATTRB=(ASKIP,NORM),                                     X01956604
               LENGTH=009                                               01956804
AECNT08 DFHMDF POS=(16,044),                                           X01956915
               COLOR=BLUE,                                             X01957004
               ATTRB=(ASKIP,NORM),                                     X01957104
               LENGTH=004                                               01957310
ADCNT08 DFHMDF POS=(16,050),                                           X01957419
               COLOR=BLUE,                                             X01957504
               ATTRB=(ASKIP,NORM),                                     X01957604
               LENGTH=004                                               01957810
ARCNT08 DFHMDF POS=(16,056),                                           X01957919
               COLOR=BLUE,                                             X01958004
               ATTRB=(ASKIP,NORM),                                     X01958104
               LENGTH=004                                               01958310
ADATE08 DFHMDF POS=(16,061),                                           X01958404
               COLOR=BLUE,                                             X01958504
               ATTRB=(ASKIP,NORM),                                     X01958604
               LENGTH=008                                               01958704
ATIME08 DFHMDF POS=(16,070),                                           X01958804
               COLOR=BLUE,                                             X01958904
               ATTRB=(ASKIP,NORM),                                     X01959004
               LENGTH=008                                               01959104
**********************************************************************  01959204
**********************************************************************  01959303
**********************************************************************  01959403
         DFHMDF POS=(19,045),                                          X01959503
               COLOR=NEUTRAL,                                          X01959603
               ATTRB=(ASKIP,NORM),                                     X01959703
               LENGTH=025,                                             X01959803
               INITIAL='NUMBER OF SELECTED ITEMS:'                      01959903
ASELIT   DFHMDF POS=(19,072),                                          X01960003
               COLOR=BLUE,                                             X01960103
               ATTRB=(ASKIP,NORM),                                     X01960203
               LENGTH=007,                                             X01960303
               PICOUT='ZZZ,ZZ9'                                         01960403
**********************************************************************  01960500
         DFHMSD TYPE=FINAL                                              01961000
         END                                                            01970000
