***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
SUKM534  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
SU534A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT)                                          
***********************************************************************         
         DFHMDF POS=(02,01),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='AUDIT NOW?'                                             
AAUDTIND DFHMDF POS=(02,12),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               INITIAL='Y'                                                      
         DFHMDF POS=(02,14),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP)                                                    
***********************************************************************         
         DFHMDF POS=(04,01),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='PREVIOUS FAILURE'                                       
APRVFAIL DFHMDF POS=(04,18),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(04,20),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP)                                                    
***********************************************************************         
         DFHMDF POS=(06,01),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='F2-CONT  F4-INFO'                                       
***********************************************************************         
         DFHMDF POS=(07,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='F5-TURN OFF PROMPT'                                     
***********************************************************************         
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
