*          DATA SET SUKM502    AT LEVEL 004 AS OF 01/27/94                      
SUKM502  DFHMSD TYPE=MAP,                                              X        
               CTRL=(FREEKB),                                          X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES                                                      
SU502A   DFHMDI SIZE=(08,020),                                         X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
ASCAC    DFHMDF POS=(01,002),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=015                                                       
*                                                                               
ACARTN   DFHMDF POS=(02,001),                                          X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=020                                                       
*                                                                               
         DFHMDF POS=(03,002),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='PO/RC:'                                                 
*                                                                               
APORCVR  DFHMDF POS=(03,009),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=012                                                       
*                                                                               
         DFHMDF POS=(04,002),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='STR:'                                                   
*                                                                               
ASTR     DFHMDF POS=(04,007),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004                                                       
*                                                                               
ALNEHDG  DFHMDF POS=(04,012),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='LN:'                                                    
*                                                                               
ALNE     DFHMDF POS=(04,016),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004                                                       
*                                                                               
         DFHMDF POS=(05,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ITM'                                                    
*                                                                               
AITEM    DFHMDF POS=(05,005),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=015                                                       
*                                                                               
AFKEY    DFHMDF POS=(06,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019                                                       
*                                                                               
AFKEY2   DFHMDF POS=(07,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019                                                       
*                                                                               
AMSGLN   DFHMDF POS=(08,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019                                                       
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
