        PRINT  NOGEN                                                    00002   
SUKM592 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
SU592A  DFHMDI LINE=2,COLUMN=1,                                        C00010**5
               SIZE=(19,80),                                           C00011**5
               CTRL=(FREEKB),                                          C00012   
               MAPATTS=(COLOR,HILIGHT),                                C00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,01),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='AUDIT NBR.:'                                    00037   
AAUDIT  DFHMDF POS=(02,13),LENGTH=09,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(02,33),LENGTH=09,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='REQ DATE:'                                      00037   
AREQDTE DFHMDF POS=(02,43),LENGTH=16,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(02,61),LENGTH=08,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STATUS.:'                                       00037   
AAUDSTA DFHMDF POS=(02,70),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(03,01),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='CARTON ID.:'                                    00037   
ACARTON DFHMDF POS=(03,13),LENGTH=18,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(03,33),LENGTH=09,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PO-RCVR.:'                                      00037   
APORCVR DFHMDF POS=(03,43),LENGTH=14,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(03,61),LENGTH=08,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='SOURCE.:'                                       00037   
ASOURCE DFHMDF POS=(03,70),LENGTH=06,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(04,01),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='OPER UNIT.:'                                    00037   
AOPRUNT DFHMDF POS=(04,18),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
AOPRDSC DFHMDF POS=(04,23),LENGTH=30,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(04,61),LENGTH=08,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PKG TYP:'                                       00037   
APKGTYP DFHMDF POS=(04,70),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(05,01),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='VENDOR ID.:'                                    00037   
AVENDID DFHMDF POS=(05,13),LENGTH=09,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
AVENDNM DFHMDF POS=(05,23),LENGTH=25,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(05,61),LENGTH=08,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='INP QTY:'                                       00037   
AINPKQT DFHMDF POS=(05,70),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(06,01),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DEPARTMENT:'                                    00037   
ADEPT   DFHMDF POS=(06,18),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
ADPTDSC DFHMDF POS=(06,23),LENGTH=25,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(06,61),LENGTH=08,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='STORE..:'                                       00037   
ASTORE  DFHMDF POS=(06,70),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
*                                                                       00034   
        DFHMDF POS=(08,01),LENGTH=36,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='S ACT      UPC        LINE EXPCT UNT'           00037   
        DFHMDF POS=(08,38),LENGTH=42,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='AUDIT UNT    PO RETAIL ERROR DESCRIPTN IND'     00049   
*                                                                       00053   
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT01  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC01  DFHMDF POS=(09,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE01 DFHMDF POS=(09,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT01 DFHMDF POS=(09,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT01 DFHMDF POS=(09,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL01 DFHMDF POS=(09,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC01 DFHMDF POS=(09,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC01 DFHMDF POS=(09,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT02  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC02  DFHMDF POS=(10,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE02 DFHMDF POS=(10,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT02 DFHMDF POS=(10,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT02 DFHMDF POS=(10,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL02 DFHMDF POS=(10,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC02 DFHMDF POS=(10,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC02 DFHMDF POS=(10,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT03  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC03  DFHMDF POS=(11,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE03 DFHMDF POS=(11,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT03 DFHMDF POS=(11,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT03 DFHMDF POS=(11,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL03 DFHMDF POS=(11,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC03 DFHMDF POS=(11,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC03 DFHMDF POS=(11,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT04  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC04  DFHMDF POS=(12,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE04 DFHMDF POS=(12,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT04 DFHMDF POS=(12,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT04 DFHMDF POS=(12,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL04 DFHMDF POS=(12,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC04 DFHMDF POS=(12,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC04 DFHMDF POS=(12,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT05  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC05  DFHMDF POS=(13,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE05 DFHMDF POS=(13,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT05 DFHMDF POS=(13,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT05 DFHMDF POS=(13,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL05 DFHMDF POS=(13,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC05 DFHMDF POS=(13,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC05 DFHMDF POS=(13,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT06  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC06  DFHMDF POS=(14,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE06 DFHMDF POS=(14,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT06 DFHMDF POS=(14,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT06 DFHMDF POS=(14,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL06 DFHMDF POS=(14,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC06 DFHMDF POS=(14,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC06 DFHMDF POS=(14,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT07  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC07  DFHMDF POS=(15,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE07 DFHMDF POS=(15,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT07 DFHMDF POS=(15,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT07 DFHMDF POS=(15,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL07 DFHMDF POS=(15,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC07 DFHMDF POS=(15,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC07 DFHMDF POS=(15,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT08  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC08  DFHMDF POS=(16,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE08 DFHMDF POS=(16,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT08 DFHMDF POS=(16,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT08 DFHMDF POS=(16,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL08 DFHMDF POS=(16,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC08 DFHMDF POS=(16,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC08 DFHMDF POS=(16,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT09  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC09  DFHMDF POS=(17,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE09 DFHMDF POS=(17,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT09 DFHMDF POS=(17,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT09 DFHMDF POS=(17,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL09 DFHMDF POS=(17,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC09 DFHMDF POS=(17,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC09 DFHMDF POS=(17,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL10  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AACT10  DFHMDF POS=(18,03),LENGTH=03,ATTRB=(ASKIP,NORM),               C00058**6
               COLOR=BLUE                                               00059   
AUPC10  DFHMDF POS=(18,07),LENGTH=15,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE                                               00061   
ALINE10 DFHMDF POS=(18,23),LENGTH=04,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AEUNT10 DFHMDF POS=(18,28),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AAUNT10 DFHMDF POS=(18,38),LENGTH=09,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARETL10 DFHMDF POS=(18,48),LENGTH=12,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AEDSC10 DFHMDF POS=(18,61),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AINDC10 DFHMDF POS=(18,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00263   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00264   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00265   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00267   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
