        PRINT NOGEN                                                     00001   
SUKM511  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU511A   DFHMDI SIZE=(09,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1,                                               X00010*12
               MAPATTS=(COLOR,HILIGHT)                                  00015   
*                                                                       00011   
         DFHMDF POS=(01,05),                                           X00012**5
               LENGTH=011,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               COLOR=BLUE,                                             X        
               INITIAL='OPEN CARTON'                                    00015*29
*                                                                       00016   
         DFHMDF POS=(02,02),                                           X00012**5
               LENGTH=017,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               COLOR=BLUE,                                             X        
               INITIAL='SERIAL SHIP CODE:'                              00015*29
*                                                                       00016   
ACARTN   DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=020,                                             X00035*22
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00016   
AUDTYP   DFHMDF POS=(04,02),                                           X00034*22
               LENGTH=019,                                             X00035*22
               COLOR=YELLOW,                                           X00734   
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00016   
         DFHMDF POS=(05,02),                                           X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               COLOR=BLUE,                                             X        
               INITIAL=' PO:  '                                         00015*29
*                                                                       00016   
APO      DFHMDF POS=(05,09),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               COLOR=BLUE,                                             X        
               PICOUT='99999999'                                        00042   
*                                                                       00016   
         DFHMDF POS=(05,18),                                           X00034*22
               LENGTH=0,                                               X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00041*22
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               COLOR=BLUE,                                             X        
               INITIAL='RCVR: '                                         00015*29
*                                                                       00016   
ARCVR    DFHMDF POS=(06,13),                                           X00034*22
               LENGTH=003,                                             X00035*22
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00041*22
         DFHMDF POS=(06,17),                                           X00034*22
               LENGTH=0,                                               X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00041*22
         DFHMDF POS=(07,01),                                           X00034*22
               LENGTH=006,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               COLOR=BLUE,                                             X        
               INITIAL=' STR: '                                         00015*29
*                                                                       00041*22
ASTR     DFHMDF POS=(07,12),                                           X00034*22
               LENGTH=004,                                             X00035*22
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00016   
         DFHMDF POS=(07,17),                                           X00034*22
               LENGTH=0,                                               X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                               
APFK     DFHMDF POS=(08,01),                                           X00064**9
               LENGTH=019,                                             X00065*10
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                       00066   
*                                                                       00068   
AMSGLN   DFHMDF POS=(09,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
