*          DATA SET SUKM796                                             00010001
        PRINT  NOGEN                                                    00020001
*-------------------------------------------------------------------*   00021001
*                                                                   *   00022001
*        MAPSET  SUKM796                                            *   00023001
*        MAP     SUK796                                             *   00024001
*        PROGRAM SUKCS796                                           *   00025001
*        TRANSID S796 - PRINT AND APPLY ASSIGN / LOGIN              *   00026001
*                                                                   *   00027001
*-------------------------------------------------------------------*   00028001
SUKM796 DFHMSD TYPE=DSECT,                                             X00029000
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               STORAGE=AUTO,                                           X00050000
               TERM=3270-2,                                            X00060000
               TIOAPFX=YES                                              00070001
*********************************************************************   00080002
SUK796  DFHMDI LINE=2,COLUMN=1,                                        X00090001
               SIZE=(19,80),                                           X00100001
               CTRL=(FREEKB),                                          X00110001
               MAPATTS=(COLOR,HILIGHT),                                X00120001
               DSATTS=(COLOR,HILIGHT)                                   00130001
*********************************************************************   00140002
*********************************************************************   00149902
         DFHMDF POS=(04,16),                                           X00150001
               LENGTH=19,                                              X00160001
               ATTRB=(ASKIP,NORM),                                     X00170001
               COLOR=NEUTRAL,                                          X00180001
               INITIAL='OPER UNIT ID......:'                            00190001
AOPRUNT  DFHMDF POS=(04,36),                                           X00200001
               LENGTH=04,                                              X00210001
               ATTRB=(ASKIP,NORM),                                     X00220001
               COLOR=BLUE                                               00230001
AOPRNME  DFHMDF POS=(04,42),                                           X00240001
               LENGTH=25,                                              X00250001
               ATTRB=(ASKIP,NORM),                                     X00260001
               COLOR=BLUE                                               00270001
         DFHMDF POS=(04,069),                                          X00280001
               ATTRB=(ASKIP,DRK),                                      X00290001
               LENGTH=001                                               00300001
*********************************************************************   00301002
         DFHMDF POS=(06,16),                                           X00302001
               LENGTH=15,                                              X00303001
               ATTRB=(ASKIP,NORM),                                     X00304001
               COLOR=NEUTRAL,                                          X00305001
               INITIAL='PRINT AND APPLY'                                00306001
*********************************************************************   00307002
         DFHMDF POS=(07,16),                                           X00307101
               LENGTH=19,                                              X00307201
               ATTRB=(ASKIP,NORM),                                     X00307301
               COLOR=NEUTRAL,                                          X00307401
               INITIAL='STATION NUMBER....:'                            00307501
ASTANBR  DFHMDF POS=(07,36),                                           X00307601
               LENGTH=04,                                              X00307701
               ATTRB=(ASKIP,NORM),                                     X00307801
               COLOR=BLUE                                               00307901
*********************************************************************   00311102
         DFHMDF POS=(09,16),                                           X00311201
               LENGTH=19,                                              X00311301
               ATTRB=(ASKIP,NORM),                                     X00311401
               COLOR=NEUTRAL,                                          X00311501
               INITIAL='DOOR ID...........:'                            00311601
ADOORID  DFHMDF POS=(09,36),                                           X00311701
               LENGTH=04,                                              X00311801
               ATTRB=(ASKIP,NORM),                                     X00311901
               COLOR=BLUE                                               00312001
*********************************************************************   00312502
         DFHMDF POS=(11,16),                                           X00312601
               LENGTH=19,                                              X00312701
               ATTRB=(ASKIP,NORM),                                     X00312801
               COLOR=NEUTRAL,                                          X00312901
               INITIAL='SCAC/TRLR/ARR DTE.:'                            00313001
ASCAC    DFHMDF POS=(11,36),                                           X00313101
               LENGTH=04,                                              X00313201
               ATTRB=(ASKIP,NORM),                                     X00313401
               COLOR=BLUE                                               00313501
ATRAILR  DFHMDF POS=(11,41),                                           X00313801
               LENGTH=10,                                              X00313901
               ATTRB=(ASKIP,NORM),                                     X00314001
               COLOR=BLUE                                               00314101
AARRDTE  DFHMDF POS=(11,53),                                           X00314501
               LENGTH=10,                                              X00314601
               ATTRB=(ASKIP,NORM),                                     X00314701
               COLOR=BLUE                                               00314801
*********************************************************************   00315002
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00315101
               INITIAL='TRIP ID...........:',                          X00315201
               COLOR=NEUTRAL,                                          X00315301
               LENGTH=19,                                              X00316001
               POS=(13,16)                                              00317001
ATRIPID  DFHMDF POS=(13,36),                                           X00318001
               LENGTH=9,                                               X00319001
               PICOUT='ZZZZZZZZZ',                                     X00319101
               HILIGHT=UNDERLINE,                                      X00320001
               COLOR=GREEN,                                            X00330001
               ATTRB=(UNPROT)                                           00340001
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00340101
               LENGTH=01,                                              X00340401
               POS=(13,46)                                              00340501
*********************************************************************   00340602
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00340701
               INITIAL='USER ID...........:',                          X00340801
               COLOR=NEUTRAL,                                          X00340901
               LENGTH=19,                                              X00341001
               POS=(15,16)                                              00341101
ATKPNBR  DFHMDF POS=(15,36),                                           X00341201
               LENGTH=8,                                               X00341301
               HILIGHT=UNDERLINE,                                      X00341401
               COLOR=GREEN,                                            X00341501
               ATTRB=(UNPROT)                                           00341601
AMULT    DFHMDF POS=(15,45),                                           X00342004
               LENGTH=04,                                              X00342101
               ATTRB=(ASKIP,NORM),                                     X00342201
               COLOR=BLUE                                               00342301
AFRSTNM  DFHMDF POS=(15,50),                                           X00342404
               LENGTH=10,                                              X00342503
               ATTRB=(ASKIP,NORM),                                     X00342603
               COLOR=BLUE                                               00342703
ALASTNM  DFHMDF POS=(15,61),                                           X00342804
               LENGTH=18,                                              X00342904
               ATTRB=(ASKIP,NORM),                                     X00343003
               COLOR=BLUE                                               00343103
*********************************************************************   00343202
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00343301
               INITIAL='CRTN EXCEPTIONS...:',                          X00343401
               COLOR=NEUTRAL,                                          X00343501
               LENGTH=19,                                              X00343601
               POS=(16,16)                                              00343701
ACRTNEX  DFHMDF POS=(16,36),                                           X00343801
               LENGTH=5,                                               X00343901
               ATTRB=(ASKIP,NORM),                                     X00344001
               COLOR=BLUE                                               00344101
*********************************************************************   00344202
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00344301
               INITIAL='PO',                                           X00345001
               COLOR=NEUTRAL,                                          X00346001
               LENGTH=02,                                              X00347001
               POS=(17,36)                                              00348001
APO      DFHMDF POS=(17,40),                                           X00350001
               LENGTH=4,                                               X00360001
               ATTRB=(ASKIP,NORM),                                     X00361001
               COLOR=BLUE                                               00362001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00391001
               INITIAL='VNDR',                                         X00392001
               COLOR=NEUTRAL,                                          X00393001
               LENGTH=04,                                              X00394001
               POS=(17,46)                                              00395001
AVENDOR  DFHMDF POS=(17,51),                                           X00400001
               LENGTH=4,                                               X00410001
               ATTRB=(ASKIP,NORM),                                     X00411001
               COLOR=BLUE                                               00412001
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00422101
               INITIAL='FIRST',                                        X00422201
               COLOR=NEUTRAL,                                          X00422301
               LENGTH=05,                                              X00422401
               POS=(17,57)                                              00422501
AFIRST   DFHMDF POS=(17,63),                                           X00422601
               LENGTH=4,                                               X00422701
               ATTRB=(ASKIP,NORM),                                     X00422801
               COLOR=BLUE                                               00422901
*********************************************************************   00429202
*********************************************************************   00460002
*********************************************************************   00470002
         DFHMSD TYPE=FINAL                                              00480001
         END                                                            00490001
