*********************************************************************** 00010000
*          DATA SET SUKM576                                             00020000
  PRINT  NOGEN                                                          00030000
*-------------------------------------------------------------------*   00040000
*                                                                   *   00050000
*        MAPSET  SUKM576                                            *   00060000
*        MAP     SU576A                                             *   00070000
*        PROGRAM SUKCS576                                           *   00080000
*        TRANSID S576 - SU - ADD/UPDATE AUDIT RANKINGS              *   00090000
*        SYSTEM  SHIPPING UNIT (SU)                                 *   00100000
*                                                                   *   00110000
*-------------------------------------------------------------------*   00120000
SUKM576  DFHMSD TYPE=&&SYSPARM,                                        X00130000
               CTRL=(FREEKB),                                          X00140000
               LANG=COBOL,                                             X00150000
               MODE=INOUT,                                             X00160000
               TIOAPFX=YES                                              00170000
SU576A   DFHMDI SIZE=(19,080),                                         X00180000
               MAPATTS=(COLOR,HILIGHT),                                X00190000
               DSATTS=(COLOR,HILIGHT),                                 X00200000
               LINE=02,                                                X00210000
               COLUMN=01                                                00220000
*********************************************************************** 00230000
         DFHMDF POS=(03,002),                                          X00300000
               COLOR=NEUTRAL,                                          X00310000
               ATTRB=(ASKIP,BRT),                                      X00320000
               LENGTH=023,                                             X00330000
               INITIAL='AUDIT RANK CODE.......:'                        00340000
ARANK    DFHMDF POS=(03,026),                                          X00350000
               COLOR=GREEN,                                            X00360000
               ATTRB=(UNPROT),                                         X00370000
               HILIGHT=UNDERLINE,                                      X00380000
               LENGTH=006                                               00390000
         DFHMDF POS=(03,33),                                           X00400000
               LENGTH=01,                                              X00410000
               ATTRB=(ASKIP,DRK)                                        00420000
*********************************************************************** 00420100
         DFHMDF POS=(04,002),                                          X00421000
               COLOR=NEUTRAL,                                          X00422000
               ATTRB=(ASKIP,BRT),                                      X00423000
               LENGTH=023,                                             X00424000
               INITIAL='AUDIT RANK DESCRIPTION:'                        00425000
ARNKDSC  DFHMDF POS=(04,26),                                           X00430000
               COLOR=GREEN,                                            X00450000
               ATTRB=(UNPROT),                                         X00460000
               HILIGHT=UNDERLINE,                                      X00461000
               LENGTH=030                                               00462000
         DFHMDF POS=(04,57),                                           X00470000
               LENGTH=01,                                              X00480000
               ATTRB=(ASKIP,DRK)                                        00490000
*********************************************************************** 00501000
         DFHMDF POS=(05,002),                                          X00501100
               COLOR=NEUTRAL,                                          X00501200
               ATTRB=(ASKIP,BRT),                                      X00501300
               LENGTH=023,                                             X00501400
               INITIAL='ADD/UPDATE SELECTION..:'                        00501500
         DFHMDF POS=(05,026),                                          X00501600
               COLOR=NEUTRAL,                                          X00501700
               ATTRB=(ASKIP,BRT),                                      X00501800
               LENGTH=13,                                              X00501900
               INITIAL='BULK/CASEPACK'                                  00502000
ABCSEL   DFHMDF POS=(05,040),                                          X00502100
               COLOR=GREEN,                                            X00502200
               HILIGHT=UNDERLINE,                                      X00502300
               ATTRB=(UNPROT,NORM),                                    X00502400
               LENGTH=01                                                00502500
         DFHMDF POS=(05,42),                                           X00502600
               LENGTH=00,                                              X00502700
               ATTRB=(ASKIP,DRK)                                        00502800
         DFHMDF POS=(05,044),                                          X00502900
               COLOR=NEUTRAL,                                          X00503000
               ATTRB=(ASKIP,BRT),                                      X00503100
               LENGTH=07,                                              X00503200
               INITIAL='PREPACK'                                        00503300
APPSEL   DFHMDF POS=(05,052),                                          X00503400
               COLOR=GREEN,                                            X00503500
               HILIGHT=UNDERLINE,                                      X00503600
               ATTRB=(UNPROT,NORM),                                    X00503700
               LENGTH=01                                                00503800
         DFHMDF POS=(05,54),                                           X00503900
               LENGTH=00,                                              X00504000
               ATTRB=(ASKIP,DRK)                                        00504100
         DFHMDF POS=(05,055),                                          X00504200
               COLOR=NEUTRAL,                                          X00504300
               ATTRB=(ASKIP,BRT),                                      X00504400
               LENGTH=13,                                              X00504500
               INITIAL='PACK BY STORE'                                  00504600
APSSEL   DFHMDF POS=(05,069),                                          X00504700
               COLOR=GREEN,                                            X00504800
               HILIGHT=UNDERLINE,                                      X00504900
               ATTRB=(UNPROT,NORM),                                    X00505000
               LENGTH=01                                                00505100
         DFHMDF POS=(05,071),                                          X00505200
               ATTRB=(ASKIP,DRK),                                      X00505300
               LENGTH=00                                                00505400
         DFHMDF POS=(05,072),                                          X00505500
               COLOR=NEUTRAL,                                          X00505600
               ATTRB=(ASKIP,BRT),                                      X00505700
               LENGTH=04,                                              X00505800
               INITIAL='RFID'                                           00505900
ARFSEL   DFHMDF POS=(05,077),                                          X00506000
               COLOR=GREEN,                                            X00506100
               HILIGHT=UNDERLINE,                                      X00506200
               ATTRB=(UNPROT,NORM),                                    X00506300
               LENGTH=01                                                00506400
         DFHMDF POS=(05,079),                                          X00506500
               ATTRB=(ASKIP,DRK),                                      X00506600
               LENGTH=01                                                00506700
*********************************************************************** 00506800
         DFHMDF POS=(07,026),                                          X00506900
               COLOR=NEUTRAL,                                          X00507000
               ATTRB=(ASKIP,BRT),                                      X00507100
               LENGTH=005,                                             X00507200
               INITIAL='BULK/'                                          00507300
         DFHMDF POS=(07,053),                                          X00507400
               COLOR=NEUTRAL,                                          X00507500
               ATTRB=(ASKIP,BRT),                                      X00507600
               LENGTH=007,                                             X00507700
               INITIAL='PACK BY'                                        00508000
*********************************************************************** 00509600
         DFHMDF POS=(08,025),                                          X00509800
               COLOR=NEUTRAL,                                          X00509900
               ATTRB=(ASKIP,BRT),                                      X00510000
               LENGTH=008,                                             X00510100
               INITIAL='CASEPACK'                                       00510200
         DFHMDF POS=(08,040),                                          X00510300
               COLOR=NEUTRAL,                                          X00510400
               ATTRB=(ASKIP,BRT),                                      X00510500
               LENGTH=007,                                             X00510600
               INITIAL='PREPACK'                                        00510700
         DFHMDF POS=(08,054),                                          X00510800
               COLOR=NEUTRAL,                                          X00510900
               ATTRB=(ASKIP,BRT),                                      X00511000
               LENGTH=005,                                             X00511100
               INITIAL='STORE'                                          00511200
         DFHMDF POS=(08,068),                                          X00511300
               COLOR=NEUTRAL,                                          X00511400
               ATTRB=(ASKIP,BRT),                                      X00511500
               LENGTH=004,                                             X00511600
               INITIAL='RFID'                                           00511700
*********************************************************************** 00511800
         DFHMDF POS=(09,002),                                          X00511900
               COLOR=NEUTRAL,                                          X00512000
               ATTRB=(ASKIP,BRT),                                      X00512100
               LENGTH=022,                                             X00512200
               INITIAL='% TO AUDIT...........:'                         00512300
APCAUDB  DFHMDF POS=(09,026),                                          X00512400
               COLOR=GREEN,                                            X00512500
               ATTRB=(UNPROT),                                         X00512600
               HILIGHT=UNDERLINE,                                      X00512700
               LENGTH=006                                               00512800
         DFHMDF POS=(09,33),                                           X00512900
               COLOR=NEUTRAL,                                          X00513000
               ATTRB=(ASKIP,BRT),                                      X00513100
               LENGTH=005,                                             X00513200
               INITIAL='(UNT)'                                          00513300
APCAUDP  DFHMDF POS=(09,040),                                          X00513400
               COLOR=GREEN,                                            X00513500
               ATTRB=(UNPROT),                                         X00513600
               HILIGHT=UNDERLINE,                                      X00513700
               LENGTH=006                                               00513800
         DFHMDF POS=(09,47),                                           X00514200
               COLOR=NEUTRAL,                                          X00514300
               ATTRB=(ASKIP,BRT),                                      X00514400
               LENGTH=005,                                             X00514500
               INITIAL='(PCK)'                                          00514600
APCAUDS  DFHMDF POS=(09,054),                                          X00514700
               COLOR=GREEN,                                            X00514800
               ATTRB=(UNPROT),                                         X00514900
               HILIGHT=UNDERLINE,                                      X00515000
               LENGTH=006                                               00515100
         DFHMDF POS=(09,61),                                           X00515200
               COLOR=NEUTRAL,                                          X00515300
               ATTRB=(ASKIP,BRT),                                      X00515400
               LENGTH=005,                                             X00515500
               INITIAL='(CTN)'                                          00515600
APCAUDR  DFHMDF POS=(09,068),                                          X00515700
               COLOR=GREEN,                                            X00515800
               ATTRB=(UNPROT),                                         X00515900
               HILIGHT=UNDERLINE,                                      X00516000
               LENGTH=006                                               00516100
         DFHMDF POS=(09,75),                                           X00516200
               COLOR=NEUTRAL,                                          X00516300
               ATTRB=(ASKIP,BRT),                                      X00516400
               LENGTH=005,                                             X00516500
               INITIAL='(CTN)'                                          00516600
*********************************************************************** 00516700
         DFHMDF POS=(10,002),                                          X00516800
               COLOR=NEUTRAL,                                          X00516900
               ATTRB=(ASKIP,BRT),                                      X00517000
               LENGTH=022,                                             X00517100
               INITIAL='% CHECKED TOLERANCE..:'                         00517200
APCTOLB  DFHMDF POS=(10,026),                                          X00517300
               COLOR=GREEN,                                            X00517400
               ATTRB=(UNPROT),                                         X00517500
               HILIGHT=UNDERLINE,                                      X00517600
               LENGTH=006                                               00517700
         DFHMDF POS=(10,33),                                           X00517800
               LENGTH=01,                                              X00517900
               ATTRB=(ASKIP,DRK)                                        00518000
APCTOLP  DFHMDF POS=(10,040),                                          X00518100
               COLOR=GREEN,                                            X00518200
               ATTRB=(UNPROT),                                         X00518300
               HILIGHT=UNDERLINE,                                      X00518400
               LENGTH=006                                               00518500
         DFHMDF POS=(10,47),                                           X00518600
               LENGTH=01,                                              X00518700
               ATTRB=(ASKIP,DRK)                                        00519000
*********************************************************************** 00519600
         DFHMDF POS=(11,002),                                          X00519800
               COLOR=NEUTRAL,                                          X00519900
               ATTRB=(ASKIP,BRT),                                      X00520000
               LENGTH=022,                                             X00520100
               INITIAL='NOT TO EXCEED QTY....:'                         00520200
ANEXCDB  DFHMDF POS=(11,026),                                          X00520300
               COLOR=GREEN,                                            X00520400
               ATTRB=(UNPROT),                                         X00520500
               HILIGHT=UNDERLINE,                                      X00520600
               LENGTH=004                                               00520700
         DFHMDF POS=(11,31),                                           X00520900
               LENGTH=01,                                              X00521000
               ATTRB=(ASKIP,DRK)                                        00521100
         DFHMDF POS=(11,33),                                           X00521200
               COLOR=NEUTRAL,                                          X00521300
               ATTRB=(ASKIP,BRT),                                      X00521400
               LENGTH=005,                                             X00521500
               INITIAL='(UNT)'                                          00521600
ANEXCDP  DFHMDF POS=(11,040),                                          X00521700
               COLOR=GREEN,                                            X00521800
               ATTRB=(UNPROT),                                         X00521900
               HILIGHT=UNDERLINE,                                      X00522000
               LENGTH=004                                               00522100
         DFHMDF POS=(11,45),                                           X00522300
               LENGTH=01,                                              X00522400
               ATTRB=(ASKIP,DRK)                                        00522500
         DFHMDF POS=(11,47),                                           X00522600
               COLOR=NEUTRAL,                                          X00522700
               ATTRB=(ASKIP,BRT),                                      X00522800
               LENGTH=005,                                             X00522900
               INITIAL='(UNT)'                                          00523000
         DFHMDF POS=(11,53),                                           X00523800
               LENGTH=01,                                              X00523900
               ATTRB=(ASKIP,DRK)                                        00524000
*********************************************************************** 00524600
         DFHMDF POS=(12,002),                                          X00524700
               COLOR=NEUTRAL,                                          X00524800
               ATTRB=(ASKIP,BRT),                                      X00524900
               LENGTH=022,                                             X00525000
               INITIAL='MAX CARTONS CHECKED..:'                         00525100
AMAXCKB  DFHMDF POS=(12,026),                                          X00525200
               COLOR=GREEN,                                            X00525300
               ATTRB=(UNPROT),                                         X00525400
               HILIGHT=UNDERLINE,                                      X00525500
               LENGTH=004                                               00525700
         DFHMDF POS=(12,31),                                           X00525900
               LENGTH=01,                                              X00526000
               ATTRB=(ASKIP,DRK)                                        00526100
AMAXCKP  DFHMDF POS=(12,040),                                          X00526200
               COLOR=GREEN,                                            X00526300
               ATTRB=(UNPROT),                                         X00526400
               HILIGHT=UNDERLINE,                                      X00526500
               LENGTH=004                                               00526600
         DFHMDF POS=(12,45),                                           X00526900
               LENGTH=01,                                              X00527000
               ATTRB=(ASKIP,DRK)                                        00527100
AMAXCKS  DFHMDF POS=(12,054),                                          X00527200
               COLOR=GREEN,                                            X00527300
               ATTRB=(UNPROT),                                         X00527400
               HILIGHT=UNDERLINE,                                      X00527500
               LENGTH=004                                               00527600
         DFHMDF POS=(12,59),                                           X00527900
               LENGTH=01,                                              X00528000
               ATTRB=(ASKIP,DRK)                                        00528100
AMAXCKR  DFHMDF POS=(12,068),                                          X00528200
               COLOR=GREEN,                                            X00528300
               ATTRB=(UNPROT),                                         X00528400
               HILIGHT=UNDERLINE,                                      X00528500
               LENGTH=004                                               00528600
         DFHMDF POS=(12,73),                                           X00528700
               LENGTH=01,                                              X00528800
               ATTRB=(ASKIP,DRK)                                        00528900
*********************************************************************** 00529000
         DFHMDF POS=(13,002),                                          X00529100
               COLOR=NEUTRAL,                                          X00529200
               ATTRB=(ASKIP,BRT),                                      X00529300
               LENGTH=022,                                             X00529400
               INITIAL='MIN CARTONS CHECKED..:'                         00529500
AMINCKB  DFHMDF POS=(13,026),                                          X00529600
               COLOR=GREEN,                                            X00529700
               ATTRB=(UNPROT),                                         X00529800
               HILIGHT=UNDERLINE,                                      X00529900
               LENGTH=004                                               00530000
         DFHMDF POS=(13,31),                                           X00530100
               LENGTH=01,                                              X00530200
               ATTRB=(ASKIP,DRK)                                        00530300
AMINCKP  DFHMDF POS=(13,040),                                          X00530400
               COLOR=GREEN,                                            X00530500
               ATTRB=(UNPROT),                                         X00530600
               HILIGHT=UNDERLINE,                                      X00530700
               LENGTH=004                                               00530800
         DFHMDF POS=(13,45),                                           X00530900
               LENGTH=01,                                              X00531000
               ATTRB=(ASKIP,DRK)                                        00531100
AMINCKS  DFHMDF POS=(13,054),                                          X00531200
               COLOR=GREEN,                                            X00531300
               ATTRB=(UNPROT),                                         X00531400
               HILIGHT=UNDERLINE,                                      X00531500
               LENGTH=004                                               00531600
         DFHMDF POS=(13,59),                                           X00531700
               LENGTH=01,                                              X00531800
               ATTRB=(ASKIP,DRK)                                        00531900
AMINCKR  DFHMDF POS=(13,068),                                          X00532000
               COLOR=GREEN,                                            X00532100
               ATTRB=(UNPROT),                                         X00532200
               HILIGHT=UNDERLINE,                                      X00532300
               LENGTH=004                                               00532400
         DFHMDF POS=(13,73),                                           X00532500
               LENGTH=01,                                              X00532600
               ATTRB=(ASKIP,DRK)                                        00532700
*********************************************************************** 00532800
         DFHMDF POS=(14,002),                                          X00532900
               COLOR=NEUTRAL,                                          X00533000
               ATTRB=(ASKIP,BRT),                                      X00533100
               LENGTH=022,                                             X00533200
               INITIAL='# OF DC S TO CHECK...:'                         00533300
ADCCHKB  DFHMDF POS=(14,026),                                          X00533400
               COLOR=GREEN,                                            X00533500
               ATTRB=(UNPROT),                                         X00533600
               HILIGHT=UNDERLINE,                                      X00533700
               LENGTH=004                                               00533800
         DFHMDF POS=(14,31),                                           X00533900
               LENGTH=01,                                              X00534000
               ATTRB=(ASKIP,DRK)                                        00534100
ADCCHKP  DFHMDF POS=(14,040),                                          X00534200
               COLOR=GREEN,                                            X00534300
               ATTRB=(UNPROT),                                         X00534400
               HILIGHT=UNDERLINE,                                      X00534500
               LENGTH=004                                               00534600
         DFHMDF POS=(14,45),                                           X00534700
               LENGTH=01,                                              X00534800
               ATTRB=(ASKIP,DRK)                                        00534900
ADCCHKS  DFHMDF POS=(14,054),                                          X00535000
               COLOR=GREEN,                                            X00535100
               ATTRB=(UNPROT),                                         X00535200
               HILIGHT=UNDERLINE,                                      X00535300
               LENGTH=004                                               00535400
         DFHMDF POS=(14,59),                                           X00535500
               LENGTH=01,                                              X00535600
               ATTRB=(ASKIP,DRK)                                        00535700
ADCCHKR  DFHMDF POS=(14,068),                                          X00535800
               COLOR=GREEN,                                            X00535900
               ATTRB=(UNPROT),                                         X00536000
               HILIGHT=UNDERLINE,                                      X00536100
               LENGTH=004                                               00536200
         DFHMDF POS=(14,73),                                           X00536300
               LENGTH=01,                                              X00536400
               ATTRB=(ASKIP,DRK)                                        00536500
*********************************************************************** 00536600
         DFHMDF POS=(15,002),                                          X00536700
               COLOR=NEUTRAL,                                          X00536800
               ATTRB=(ASKIP,BRT),                                      X00536900
               LENGTH=022,                                             X00537000
               INITIAL='MAX PO-LINES TO CHECK:'                         00537100
AMXPOLB  DFHMDF POS=(15,026),                                          X00537200
               COLOR=GREEN,                                            X00537300
               ATTRB=(UNPROT),                                         X00537400
               HILIGHT=UNDERLINE,                                      X00537500
               LENGTH=004                                               00537600
         DFHMDF POS=(15,31),                                           X00537700
               LENGTH=01,                                              X00537800
               ATTRB=(ASKIP,DRK)                                        00537900
*********************************************************************** 00538000
         DFHMDF POS=(16,002),                                          X00538100
               COLOR=NEUTRAL,                                          X00538200
               ATTRB=(ASKIP,BRT),                                      X00538300
               LENGTH=022,                                             X00538400
               INITIAL='RECHK AFTER # OF DAYS:'                         00538500
ACHKDYB  DFHMDF POS=(16,026),                                          X00538600
               COLOR=GREEN,                                            X00538700
               ATTRB=(UNPROT),                                         X00538800
               HILIGHT=UNDERLINE,                                      X00538900
               LENGTH=004                                               00539000
         DFHMDF POS=(16,31),                                           X00539100
               LENGTH=01,                                              X00539200
               ATTRB=(ASKIP,DRK)                                        00539300
ACHKDYP  DFHMDF POS=(16,040),                                          X00539400
               COLOR=GREEN,                                            X00539500
               ATTRB=(UNPROT),                                         X00539600
               HILIGHT=UNDERLINE,                                      X00539700
               LENGTH=004                                               00539800
         DFHMDF POS=(16,45),                                           X00539900
               LENGTH=01,                                              X00540000
               ATTRB=(ASKIP,DRK)                                        00540100
ACHKDYS  DFHMDF POS=(16,054),                                          X00540200
               COLOR=GREEN,                                            X00540300
               ATTRB=(UNPROT),                                         X00540400
               HILIGHT=UNDERLINE,                                      X00540500
               LENGTH=004                                               00540600
         DFHMDF POS=(16,59),                                           X00540900
               LENGTH=01,                                              X00541000
               ATTRB=(ASKIP,DRK)                                        00542000
ACHKDYR  DFHMDF POS=(16,068),                                          X00542100
               COLOR=GREEN,                                            X00542200
               ATTRB=(UNPROT),                                         X00542300
               HILIGHT=UNDERLINE,                                      X00542400
               LENGTH=004                                               00542500
         DFHMDF POS=(16,73),                                           X00542600
               LENGTH=01,                                              X00542700
               ATTRB=(ASKIP,DRK)                                        00542800
*********************************************************************** 00543000
         DFHMDF POS=(18,002),                                          X00543100
               COLOR=NEUTRAL,                                          X00543200
               ATTRB=(ASKIP,BRT),                                      X00543300
               LENGTH=045,                                             X00543400
               INITIAL='NOTE: PERCENTS SHOULD BE ENTERED AS FOLLOWS -'  00543500
         DFHMDF POS=(18,048),                                          X00543600
               COLOR=NEUTRAL,                                          X00543700
               ATTRB=(ASKIP,BRT),                                      X00543800
               LENGTH=023,                                             X00543900
               INITIAL='(4% = 4.0) (1/2% = 0.5)'                        00544000
*********************************************************************** 00544200
         DFHMSD TYPE=FINAL                                              00545000
         END                                                            00550000
