  PRINT  NOGEN                                                          00003*11
*-------------------------------------------------------------------*   00004*11
*        MAPSET  SUKM571                                            *   00006*11
*        MAP     SU571A                                             *   00007*11
*        PROGRAM SUKCS571                                           *   00008*11
*        TRANSID S571 - TRAILER BUSINESS GROUP SUMMARY              *           
*-------------------------------------------------------------------*   00012*11
SUKM571 DFHMSD TYPE=DSECT,                                             X00013*11
               MODE=INOUT,                                             X00014*11
               LANG=COBOL,                                             X00015*11
               STORAGE=AUTO,                                           X00016*11
               TIOAPFX=YES,                                            X00017*11
               TERM=3270-2                                              00018*11
SU571A  DFHMDI LINE=2,COLUMN=1,                                        X00019*11
               SIZE=(19,80),                                           X00020*11
               MAPATTS=(COLOR,HILIGHT),                                X00021*11
               DSATTS=(COLOR,HILIGHT),                                 X00022*11
               CTRL=(FREEKB)                                            00023*11
*                                                                       00024*11
        DFHMDF POS=(02,01),                                            X00025*11
               LENGTH=17,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='STORE NUMBER....:'                              00029*11
ASTORE  DFHMDF POS=(02,19),                                            X00030*11
               LENGTH=04,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               PICOUT='9999',                                          X00032*11
               COLOR=BLUE                                               00033*11
ASTNME  DFHMDF POS=(02,24),                                            X00030*11
               LENGTH=25,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
*                                                                       00024*11
        DFHMDF POS=(03,01),                                            X00025*11
               LENGTH=17,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='TRAILER SERIAL #:'                              00029*11
ASERIAL DFHMDF POS=(03,19),                                            X00025*11
               LENGTH=09,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
        DFHMDF POS=(03,42),                                            X00025*11
               LENGTH=15,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='CURRENT STATUS:'                                00029*11
ASTATUS DFHMDF POS=(03,58),                                            X00025*11
               LENGTH=20,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
*                                                                               
        DFHMDF POS=(04,01),                                            X00025*11
               LENGTH=17,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='SCAC/TRAILER ID.:'                              00029*11
ASCAC   DFHMDF POS=(04,19),                                            X00025*11
               LENGTH=04,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
        DFHMDF POS=(04,24),                                            X00025*11
               LENGTH=01,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='-'                                              00029*11
ATRLR   DFHMDF POS=(04,26),                                            X00025*11
               LENGTH=12,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
        DFHMDF POS=(04,42),                                            X00025*11
               LENGTH=15,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='SERVICING DC..:'                                00029*11
AOPER   DFHMDF POS=(04,58),                                            X00025*11
               LENGTH=20,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
*                                                                               
        DFHMDF POS=(05,01),                                            X00025*11
               LENGTH=17,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='TOTAL CARTONS...:'                              00029*11
ACTNS   DFHMDF POS=(05,19),                                            X00025*11
               LENGTH=07,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               PICOUT='ZZZ,ZZZ',                                       X        
               COLOR=BLUE                                               00028*11
        DFHMDF POS=(05,42),                                            X00025*11
               LENGTH=15,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='SUMMARY AS OF.:'                                00029*11
ASUMDTE DFHMDF POS=(05,58),                                            X00025*11
               LENGTH=10,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
ASUMTME DFHMDF POS=(05,69),                                            X00025*11
               LENGTH=08,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
*                                                                               
        DFHMDF POS=(06,01),                                            X00025*11
               LENGTH=17,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='TOTAL UNITS.....:'                              00029*11
AUNITS  DFHMDF POS=(06,19),                                            X00025*11
               LENGTH=07,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               PICOUT='ZZZ,ZZZ',                                       X        
               COLOR=BLUE                                               00028*11
        DFHMDF POS=(06,42),                                            X00025*11
               LENGTH=15,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='PRINTER ID....:'                                00029*11
APRTID  DFHMDF POS=(06,58),                                            X00025*11
               COLOR=GREEN,                                            X00091   
               ATTRB=(UNPROT),                                         X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               LENGTH=08,                                              X00026*11
               INITIAL='          '                                     00089   
         DFHMDF POS=(06,67),                                           X00096   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
*                                                                               
ASEQ    DFHMDF POS=(07,01),                                            X00025*11
               LENGTH=20,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=YELLOW                                             00028*11
        DFHMDF POS=(07,45),                                            X00044*11
               LENGTH=05,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='ITEMS'                                          00048*11
ASTRTIT DFHMDF POS=(07,51),                                            X00049*11
               LENGTH=05,                                              X00050*11
               ATTRB=(NUM,UNPROT,NORM),                                X00051*11
               COLOR=GREEN,                                            X00052*11
               HILIGHT=UNDERLINE,                                      X00053*11
               PICOUT='ZZZZ9'                                           00054*11
        DFHMDF POS=(07,57),                                            X00055*11
               LENGTH=02,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               COLOR=NEUTRAL,                                          X00058*11
               INITIAL='TO'                                             00059*11
AENDIT  DFHMDF POS=(07,60),                                            X00060*11
               LENGTH=05,                                              X00061*11
               ATTRB=(ASKIP,NORM),                                     X00062*11
               COLOR=BLUE,                                             X00063*11
               PICOUT='ZZZZ9'                                           00064*11
        DFHMDF POS=(07,66),                                            X00065*11
               LENGTH=02,                                              X00066*11
               ATTRB=(ASKIP,NORM),                                     X00067*11
               COLOR=NEUTRAL,                                          X00068*11
               INITIAL='OF'                                             00069*11
ATOTIT  DFHMDF POS=(07,69),                                            X00070*11
               LENGTH=05,                                              X00071*11
               ATTRB=(ASKIP,NORM),                                     X00072*11
               COLOR=BLUE,                                             X00073*11
               PICOUT='ZZZZ9'                                           00074*11
*                                                                       00075*11
        DFHMDF POS=(08,01),                                            X00076*12
               LENGTH=38,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='SEL ACT  AREA   AREA DESCRIPTION      '         00080*11
        DFHMDF POS=(08,40),                                            X00076*12
               LENGTH=33,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='   CARTONS    UNITS  SKU CNT   AD'              00080*11
*                                                                       00127*11
ASEL01  DFHMDF POS=(09,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT01  DFHMDF POS=(09,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP01  DFHMDF POS=(09,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES01 DFHMDF POS=(09,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS01 DFHMDF POS=(09,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT01 DFHMDF POS=(09,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS01 DFHMDF POS=(09,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND01 DFHMDF POS=(09,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL02  DFHMDF POS=(10,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT02  DFHMDF POS=(10,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP02  DFHMDF POS=(10,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES02 DFHMDF POS=(10,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS02 DFHMDF POS=(10,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT02 DFHMDF POS=(10,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS02 DFHMDF POS=(10,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND02 DFHMDF POS=(10,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL03  DFHMDF POS=(11,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT03  DFHMDF POS=(11,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP03  DFHMDF POS=(11,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES03 DFHMDF POS=(11,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS03 DFHMDF POS=(11,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT03 DFHMDF POS=(11,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS03 DFHMDF POS=(11,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND03 DFHMDF POS=(11,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL04  DFHMDF POS=(12,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT04  DFHMDF POS=(12,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP04  DFHMDF POS=(12,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES04 DFHMDF POS=(12,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS04 DFHMDF POS=(12,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT04 DFHMDF POS=(12,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS04 DFHMDF POS=(12,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND04 DFHMDF POS=(12,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL05  DFHMDF POS=(13,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT05  DFHMDF POS=(13,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP05  DFHMDF POS=(13,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES05 DFHMDF POS=(13,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS05 DFHMDF POS=(13,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT05 DFHMDF POS=(13,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS05 DFHMDF POS=(13,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND05 DFHMDF POS=(13,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL06  DFHMDF POS=(14,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT06  DFHMDF POS=(14,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP06  DFHMDF POS=(14,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES06 DFHMDF POS=(14,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS06 DFHMDF POS=(14,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT06 DFHMDF POS=(14,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS06 DFHMDF POS=(14,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND06 DFHMDF POS=(14,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL07  DFHMDF POS=(15,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT07  DFHMDF POS=(15,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP07  DFHMDF POS=(15,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES07 DFHMDF POS=(15,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS07 DFHMDF POS=(15,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT07 DFHMDF POS=(15,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS07 DFHMDF POS=(15,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND07 DFHMDF POS=(15,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL08  DFHMDF POS=(16,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT08  DFHMDF POS=(16,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP08  DFHMDF POS=(16,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES08 DFHMDF POS=(16,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS08 DFHMDF POS=(16,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT08 DFHMDF POS=(16,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS08 DFHMDF POS=(16,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND08 DFHMDF POS=(16,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL09  DFHMDF POS=(17,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT09  DFHMDF POS=(17,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP09  DFHMDF POS=(17,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES09 DFHMDF POS=(17,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS09 DFHMDF POS=(17,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT09 DFHMDF POS=(17,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS09 DFHMDF POS=(17,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND09 DFHMDF POS=(17,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00127*11
ASEL10  DFHMDF POS=(18,02),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM),                                    X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT10  DFHMDF POS=(18,04),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGRP10  DFHMDF POS=(18,10),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AGDES10 DFHMDF POS=(18,15),                                            X00136*12
               LENGTH=25,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ACTNS10 DFHMDF POS=(18,42),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AUNIT10 DFHMDF POS=(18,51),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASKUS10 DFHMDF POS=(18,61),                                            X00136*12
               LENGTH=07,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
AAIND10 DFHMDF POS=(18,71),                                            X00136*12
               LENGTH=01,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
*                                                                       00224   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               X00225   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00226   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               X00227   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00228   
**************                                                          00747*11
        DFHMSD TYPE=FINAL                                               00748*11
**************                                                          00749*11
        END                                                             00750*11
