*          DATA SET SUKM797                                             00010000
        PRINT  NOGEN                                                    00020000
*-------------------------------------------------------------------*   00021000
*                                                                   *   00022000
*        MAPSET  SUKM797                                            *   00023000
*        MAP     SUK797                                             *   00024000
*        PROGRAM SUKCS797                                           *   00025000
*        TRANSID S797 - PRINT AND APPLY ASSOCIATE HISTORY           *   00026000
*                                                                   *   00027000
*-------------------------------------------------------------------*   00028000
SUKM797 DFHMSD TYPE=DSECT,                                             X00029000
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               STORAGE=AUTO,                                           X00050000
               TERM=3270-2,                                            X00060000
               TIOAPFX=YES                                              00070000
**********************************************************************  00080000
SUK797  DFHMDI LINE=2,COLUMN=1,                                        X00090000
               SIZE=(19,80),                                           X00100000
               CTRL=(FREEKB),                                          X00110000
               MAPATTS=(COLOR,HILIGHT),                                X00120000
               DSATTS=(COLOR,HILIGHT)                                   00130000
**********************************************************************  00140000
**********************************************************************  00150000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00160000
               INITIAL='OPER UNIT..............:',                     X00170000
               COLOR=NEUTRAL,                                          X00180000
               LENGTH=024,                                             X00190000
               POS=(03,02)                                              00200000
AOPRUNT  DFHMDF POS=(03,27),                                           X00210000
               LENGTH=004,                                             X00220000
               COLOR=BLUE,                                             X00230000
               ATTRB=(ASKIP)                                            00240000
AOPRNME  DFHMDF POS=(03,34),                                           X00250000
               LENGTH=025,                                             X00260000
               COLOR=BLUE,                                             X00270000
               ATTRB=(ASKIP)                                            00280000
        DFHMDF ATTRB=(ASKIP),                                          X00290000
               LENGTH=001,                                             X00300000
               POS=(03,61)                                              00310000
*******************************************************************     00320000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00321000
               INITIAL='PRINT AND APPLY STATION:',                     X00322000
               COLOR=NEUTRAL,                                          X00323000
               LENGTH=024,                                             X00324000
               POS=(04,02)                                              00325000
ASTANBR  DFHMDF POS=(04,27),                                           X00326000
               LENGTH=004,                                             X00327000
               COLOR=BLUE,                                             X00328000
               ATTRB=(ASKIP)                                            00329000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00329100
               INITIAL='DOOR ID:',                                     X00329200
               COLOR=NEUTRAL,                                          X00329300
               LENGTH=008,                                             X00329400
               POS=(04,42)                                              00329500
ADOORID  DFHMDF POS=(04,51),                                           X00329600
               LENGTH=009,                                             X00329700
               COLOR=BLUE,                                             X00329800
               ATTRB=(ASKIP)                                            00329900
*******************************************************************     00330000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00330100
               INITIAL='SCAC/TRAILER...........:',                     X00330200
               COLOR=NEUTRAL,                                          X00330300
               LENGTH=024,                                             X00330400
               POS=(05,02)                                              00330500
ASCAC    DFHMDF POS=(05,27),                                           X00330600
               LENGTH=004,                                             X00330700
               COLOR=BLUE,                                             X00330800
               ATTRB=(ASKIP)                                            00330900
ATRAILR  DFHMDF POS=(05,32),                                           X00331000
               LENGTH=009,                                             X00331100
               COLOR=BLUE,                                             X00331200
               ATTRB=(ASKIP)                                            00331300
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00331400
               INITIAL='TRIP ID:',                                     X00331500
               COLOR=NEUTRAL,                                          X00331600
               LENGTH=008,                                             X00331700
               POS=(05,42)                                              00331800
ATRIPID  DFHMDF POS=(05,51),                                           X00331900
               LENGTH=009,                                             X00332000
               COLOR=BLUE,                                             X00332100
               ATTRB=(ASKIP)                                            00332200
*******************************************************************     00332300
        DFHMDF POS=(07,51),                                            X00332400
               LENGTH=05,                                              X00332500
               ATTRB=(ASKIP,NORM),                                     X00332600
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00332700
ASTRTIT DFHMDF POS=(07,57),                                            X00332800
               LENGTH=05,                                              X00332900
               ATTRB=(NUM,UNPROT,NORM),                                X00333000
               COLOR=GREEN,                                            X00333100
               PICOUT='ZZZZ9',                                         X00333200
               HILIGHT=UNDERLINE                                        00333300
        DFHMDF POS=(07,63),                                            X00333400
               LENGTH=02,                                              X00333500
               ATTRB=(ASKIP,NORM),                                     X00333600
               COLOR=NEUTRAL,                                          X00333700
               INITIAL='TO'                                             00333800
AENDIT  DFHMDF POS=(07,66),                                            X00333900
               LENGTH=05,                                              X00334000
               ATTRB=(ASKIP,NORM),                                     X00334100
               COLOR=BLUE,                                             X00334200
               PICOUT='ZZZZ9'                                           00334300
        DFHMDF POS=(07,72),                                            X00334400
               LENGTH=02,                                              X00334500
               ATTRB=(ASKIP,NORM),                                     X00334600
               COLOR=NEUTRAL,                                          X00334700
               INITIAL='OF'                                             00334800
ATOTIT  DFHMDF POS=(07,75),                                            X00334900
               LENGTH=05,                                              X00335000
               ATTRB=(ASKIP,NORM),                                     X00335100
               COLOR=BLUE,                                             X00335200
               PICOUT='ZZZZ9'                                           00335300
*******************************************************************     00335400
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00335500
               INITIAL='   USER ID  ACTV       LOGIN  ',               X00335600
               COLOR=NEUTRAL,                                          X00335700
               LENGTH=30,                                              X00335800
               POS=(08,01)                                              00335900
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00336000
               INITIAL='         LOGOUT     ',                         X00336100
               COLOR=NEUTRAL,                                          X00336200
               LENGTH=20,                                              X00336300
               POS=(08,33)                                              00336400
*******************************************************************     00336500
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00336600
               INITIAL='   ASSIGND  IND   --DATE-- --TIME--',          X00336700
               COLOR=NEUTRAL,                                          X00336800
               LENGTH=35,                                              X00336900
               POS=(09,01)                                              00337000
         DFHMDF ATTRB=(ASKIP,NORM),                                    X00337100
               INITIAL='--DATE-- --TIME--   ',                         X00337200
               COLOR=NEUTRAL,                                          X00337300
               LENGTH=20,                                              X00337400
               POS=(09,37)                                              00337500
**********************************************************************  00338000
ATKTP01 DFHMDF POS=(10,004),                                           X00360000
               COLOR=BLUE,                                             X00361000
               ATTRB=(ASKIP,NORM),                                     X00362000
               LENGTH=008                                               00380000
AACTV01 DFHMDF POS=(10,014),                                           X00390000
               COLOR=BLUE,                                             X00400000
               ATTRB=(ASKIP,NORM),                                     X00410000
               LENGTH=001                                               00420000
AINDT01 DFHMDF POS=(10,019),                                           X00430000
               COLOR=BLUE,                                             X00440000
               ATTRB=(ASKIP,NORM),                                     X00450000
               LENGTH=008                                               00460000
AINTM01 DFHMDF POS=(10,028),                                           X00470000
               COLOR=BLUE,                                             X00480000
               ATTRB=(ASKIP,NORM),                                     X00490000
               LENGTH=008                                               00500000
AOTDT01 DFHMDF POS=(10,038),                                           X00501000
               COLOR=BLUE,                                             X00502000
               ATTRB=(ASKIP,NORM),                                     X00503000
               LENGTH=008                                               00504000
AOTTM01 DFHMDF POS=(10,047),                                           X00505000
               COLOR=BLUE,                                             X00506000
               ATTRB=(ASKIP,NORM),                                     X00507000
               LENGTH=008                                               00508000
**********************************************************************  00509000
ATKTP02 DFHMDF POS=(11,004),                                           X00510000
               COLOR=BLUE,                                             X00511000
               ATTRB=(ASKIP,NORM),                                     X00512000
               LENGTH=008                                               00530000
AACTV02 DFHMDF POS=(11,014),                                           X00540000
               COLOR=BLUE,                                             X00550000
               ATTRB=(ASKIP,NORM),                                     X00560000
               LENGTH=001                                               00570000
AINDT02 DFHMDF POS=(11,019),                                           X00580000
               COLOR=BLUE,                                             X00590000
               ATTRB=(ASKIP,NORM),                                     X00600000
               LENGTH=008                                               00610000
AINTM02 DFHMDF POS=(11,028),                                           X00620000
               COLOR=BLUE,                                             X00630000
               ATTRB=(ASKIP,NORM),                                     X00640000
               LENGTH=008                                               00650000
AOTDT02 DFHMDF POS=(11,038),                                           X00660000
               COLOR=BLUE,                                             X00670000
               ATTRB=(ASKIP,NORM),                                     X00680000
               LENGTH=008                                               00690000
AOTTM02 DFHMDF POS=(11,047),                                           X00700000
               COLOR=BLUE,                                             X00710000
               ATTRB=(ASKIP,NORM),                                     X00720000
               LENGTH=008                                               00730000
**********************************************************************  00740000
ATKTP03 DFHMDF POS=(12,004),                                           X00741000
               COLOR=BLUE,                                             X00741100
               ATTRB=(ASKIP,NORM),                                     X00741200
               LENGTH=008                                               00743000
AACTV03 DFHMDF POS=(12,014),                                           X00744000
               COLOR=BLUE,                                             X00745000
               ATTRB=(ASKIP,NORM),                                     X00746000
               LENGTH=001                                               00747000
AINDT03 DFHMDF POS=(12,019),                                           X00748000
               COLOR=BLUE,                                             X00749000
               ATTRB=(ASKIP,NORM),                                     X00749100
               LENGTH=008                                               00749200
AINTM03 DFHMDF POS=(12,028),                                           X00749300
               COLOR=BLUE,                                             X00749400
               ATTRB=(ASKIP,NORM),                                     X00749500
               LENGTH=008                                               00749600
AOTDT03 DFHMDF POS=(12,038),                                           X00749700
               COLOR=BLUE,                                             X00749800
               ATTRB=(ASKIP,NORM),                                     X00749900
               LENGTH=008                                               00750000
AOTTM03 DFHMDF POS=(12,047),                                           X00751000
               COLOR=BLUE,                                             X00752000
               ATTRB=(ASKIP,NORM),                                     X00753000
               LENGTH=008                                               00754000
**********************************************************************  00755000
ATKTP04 DFHMDF POS=(13,004),                                           X00756000
               COLOR=BLUE,                                             X00756100
               ATTRB=(ASKIP,NORM),                                     X00756200
               LENGTH=008                                               00758000
AACTV04 DFHMDF POS=(13,014),                                           X00759000
               COLOR=BLUE,                                             X00759100
               ATTRB=(ASKIP,NORM),                                     X00759200
               LENGTH=001                                               00759300
AINDT04 DFHMDF POS=(13,019),                                           X00759400
               COLOR=BLUE,                                             X00759500
               ATTRB=(ASKIP,NORM),                                     X00759600
               LENGTH=008                                               00759700
AINTM04 DFHMDF POS=(13,028),                                           X00759800
               COLOR=BLUE,                                             X00759900
               ATTRB=(ASKIP,NORM),                                     X00760000
               LENGTH=008                                               00761000
AOTDT04 DFHMDF POS=(13,038),                                           X00762000
               COLOR=BLUE,                                             X00763000
               ATTRB=(ASKIP,NORM),                                     X00764000
               LENGTH=008                                               00765000
AOTTM04 DFHMDF POS=(13,047),                                           X00766000
               COLOR=BLUE,                                             X00767000
               ATTRB=(ASKIP,NORM),                                     X00768000
               LENGTH=008                                               00769000
**********************************************************************  00769100
ATKTP05 DFHMDF POS=(14,004),                                           X00769200
               COLOR=BLUE,                                             X00769300
               ATTRB=(ASKIP,NORM),                                     X00769400
               LENGTH=008                                               00769600
AACTV05 DFHMDF POS=(14,014),                                           X00769700
               COLOR=BLUE,                                             X00769800
               ATTRB=(ASKIP,NORM),                                     X00769900
               LENGTH=001                                               00770000
AINDT05 DFHMDF POS=(14,019),                                           X00770100
               COLOR=BLUE,                                             X00770200
               ATTRB=(ASKIP,NORM),                                     X00771000
               LENGTH=008                                               00772000
AINTM05 DFHMDF POS=(14,028),                                           X00773000
               COLOR=BLUE,                                             X00774000
               ATTRB=(ASKIP,NORM),                                     X00775000
               LENGTH=008                                               00776000
AOTDT05 DFHMDF POS=(14,038),                                           X00777000
               COLOR=BLUE,                                             X00778000
               ATTRB=(ASKIP,NORM),                                     X00779000
               LENGTH=008                                               00779100
AOTTM05 DFHMDF POS=(14,047),                                           X00779200
               COLOR=BLUE,                                             X00779300
               ATTRB=(ASKIP,NORM),                                     X00779400
               LENGTH=008                                               00779500
**********************************************************************  00779600
ATKTP06 DFHMDF POS=(15,004),                                           X00779700
               COLOR=BLUE,                                             X00779800
               ATTRB=(ASKIP,NORM),                                     X00779900
               LENGTH=008                                               00780100
AACTV06 DFHMDF POS=(15,014),                                           X00780200
               COLOR=BLUE,                                             X00781000
               ATTRB=(ASKIP,NORM),                                     X00782000
               LENGTH=001                                               00783000
AINDT06 DFHMDF POS=(15,019),                                           X00784000
               COLOR=BLUE,                                             X00785000
               ATTRB=(ASKIP,NORM),                                     X00786000
               LENGTH=008                                               00787000
AINTM06 DFHMDF POS=(15,028),                                           X00788000
               COLOR=BLUE,                                             X00789000
               ATTRB=(ASKIP,NORM),                                     X00789100
               LENGTH=008                                               00789200
AOTDT06 DFHMDF POS=(15,038),                                           X00789300
               COLOR=BLUE,                                             X00789400
               ATTRB=(ASKIP,NORM),                                     X00789500
               LENGTH=008                                               00789600
AOTTM06 DFHMDF POS=(15,047),                                           X00789700
               COLOR=BLUE,                                             X00789800
               ATTRB=(ASKIP,NORM),                                     X00789900
               LENGTH=008                                               00790000
**********************************************************************  00791000
ATKTP07 DFHMDF POS=(16,004),                                           X00792000
               COLOR=BLUE,                                             X00792100
               ATTRB=(ASKIP,NORM),                                     X00792200
               LENGTH=008                                               00794000
AACTV07 DFHMDF POS=(16,014),                                           X00795000
               COLOR=BLUE,                                             X00796000
               ATTRB=(ASKIP,NORM),                                     X00797000
               LENGTH=001                                               00798000
AINDT07 DFHMDF POS=(16,019),                                           X00799000
               COLOR=BLUE,                                             X00799100
               ATTRB=(ASKIP,NORM),                                     X00799200
               LENGTH=008                                               00799300
AINTM07 DFHMDF POS=(16,028),                                           X00799400
               COLOR=BLUE,                                             X00799500
               ATTRB=(ASKIP,NORM),                                     X00799600
               LENGTH=008                                               00799700
AOTDT07 DFHMDF POS=(16,038),                                           X00799800
               COLOR=BLUE,                                             X00799900
               ATTRB=(ASKIP,NORM),                                     X00800000
               LENGTH=008                                               00801000
AOTTM07 DFHMDF POS=(16,047),                                           X00802000
               COLOR=BLUE,                                             X00803000
               ATTRB=(ASKIP,NORM),                                     X00804000
               LENGTH=008                                               00805000
**********************************************************************  00806000
ATKTP08 DFHMDF POS=(17,004),                                           X00807000
               COLOR=BLUE,                                             X00807100
               ATTRB=(ASKIP,NORM),                                     X00807200
               LENGTH=008                                               00809000
AACTV08 DFHMDF POS=(17,014),                                           X00809100
               COLOR=BLUE,                                             X00809200
               ATTRB=(ASKIP,NORM),                                     X00809300
               LENGTH=001                                               00809400
AINDT08 DFHMDF POS=(17,019),                                           X00809500
               COLOR=BLUE,                                             X00809600
               ATTRB=(ASKIP,NORM),                                     X00809700
               LENGTH=008                                               00809800
AINTM08 DFHMDF POS=(17,028),                                           X00809900
               COLOR=BLUE,                                             X00810000
               ATTRB=(ASKIP,NORM),                                     X00811000
               LENGTH=008                                               00812000
AOTDT08 DFHMDF POS=(17,038),                                           X00813000
               COLOR=BLUE,                                             X00814000
               ATTRB=(ASKIP,NORM),                                     X00815000
               LENGTH=008                                               00816000
AOTTM08 DFHMDF POS=(17,047),                                           X00817000
               COLOR=BLUE,                                             X00818000
               ATTRB=(ASKIP,NORM),                                     X00819000
               LENGTH=008                                               00819100
**********************************************************************  00819200
ATKTP09 DFHMDF POS=(18,004),                                           X00819300
               COLOR=BLUE,                                             X00819400
               ATTRB=(ASKIP,NORM),                                     X00819500
               LENGTH=008                                               00819700
AACTV09 DFHMDF POS=(18,014),                                           X00819800
               COLOR=BLUE,                                             X00819900
               ATTRB=(ASKIP,NORM),                                     X00820000
               LENGTH=001                                               00820100
AINDT09 DFHMDF POS=(18,019),                                           X00820200
               COLOR=BLUE,                                             X00821000
               ATTRB=(ASKIP,NORM),                                     X00822000
               LENGTH=008                                               00823000
AINTM09 DFHMDF POS=(18,028),                                           X00824000
               COLOR=BLUE,                                             X00825000
               ATTRB=(ASKIP,NORM),                                     X00826000
               LENGTH=008                                               00827000
AOTDT09 DFHMDF POS=(18,038),                                           X00828000
               COLOR=BLUE,                                             X00829000
               ATTRB=(ASKIP,NORM),                                     X00829100
               LENGTH=008                                               00829200
AOTTM09 DFHMDF POS=(18,047),                                           X00829300
               COLOR=BLUE,                                             X00829400
               ATTRB=(ASKIP,NORM),                                     X00829500
               LENGTH=008                                               00829600
**********************************************************************  00829700
ATKTP10 DFHMDF POS=(19,004),                                           X00829800
               COLOR=BLUE,                                             X00829900
               ATTRB=(ASKIP,NORM),                                     X00830000
               LENGTH=008                                               00830200
AACTV10 DFHMDF POS=(19,014),                                           X00831000
               COLOR=BLUE,                                             X00832000
               ATTRB=(ASKIP,NORM),                                     X00833000
               LENGTH=001                                               00834000
AINDT10 DFHMDF POS=(19,019),                                           X00835000
               COLOR=BLUE,                                             X00836000
               ATTRB=(ASKIP,NORM),                                     X00837000
               LENGTH=008                                               00838000
AINTM10 DFHMDF POS=(19,028),                                           X00839000
               COLOR=BLUE,                                             X00839100
               ATTRB=(ASKIP,NORM),                                     X00839200
               LENGTH=008                                               00839300
AOTDT10 DFHMDF POS=(19,038),                                           X00839400
               COLOR=BLUE,                                             X00839500
               ATTRB=(ASKIP,NORM),                                     X00839600
               LENGTH=008                                               00839700
AOTTM10 DFHMDF POS=(19,047),                                           X00839800
               COLOR=BLUE,                                             X00839900
               ATTRB=(ASKIP,NORM),                                     X00840000
               LENGTH=008                                               00841000
**********************************************************************  00850000
**********************************************************************  01629300
**********************************************************************  01629400
         DFHMSD TYPE=FINAL                                              01680000
         END                                                            01690000
