  PRINT  NOGEN                                                          00001   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00002   
*                                                                       00003   
*  SUKM581  MAPSET -  THIS IS THE BMS MAP FOR THE VENDOR AUDIT RATE     00004   
*    UPDATE FUNCTION.  IT STARTS IN LINE 2 AND IS 19 LINES LONG.        00005   
*    THE OTHER 5 LINES ARE PART OF THE CICS ARCHITECTURE API MAP        00006   
*    (SUKM581)                                                          00007   
*                                                                       00008   
*.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-                                     00009   
SUKM581 DFHMSD TYPE=DSECT,                                             C00010   
               LANG=COBOL,                                             C00011   
               MODE=INOUT,                                             C00012   
               STORAGE=AUTO,                                           C00013   
               TERM=3270-2,                                            C00014   
               TIOAPFX=YES                                              00015   
SU581A  DFHMDI LINE=2,COLUMN=1,                                        C00016   
               SIZE=(19,80),                                           C00017   
               CTRL=(FREEKB),                                          C00018   
               MAPATTS=(COLOR,HILIGHT),                                C00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='VENDOR ENT ID:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(02,2)                                               00029   
AENTID   DFHMDF POS=(02,17),                                           X00030   
               LENGTH=9,                                               X00031   
               COLOR=BLUE,                                             X00032   
               ATTRB=ASKIP                                              00033   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='VENDOR NAME..:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(03,2)                                               00029   
AVENNM   DFHMDF POS=(03,17),                                           X00030   
               LENGTH=30,                                              X00031   
               COLOR=BLUE,                                             X00032   
               ATTRB=ASKIP                                              00033   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='VENDOR RATINGS: ',                             X00027   
               LENGTH=16,                                              X00028   
               POS=(05,2)                                               00029   
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='BULK/CASEPACK:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(07,3)                                               00029   
ABULKCP DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00049   
               LENGTH=6,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(07,18)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(07,25)                                              00057**3
ABKCPDS DFHMDF ATTRB=(ASKIP,NORM),                                     X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(07,27)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(07,58)                                              00057**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='PRE-PACK.....:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(08,3)                                               00029   
APREPAK DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00049   
               LENGTH=6,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(08,18)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(08,25)                                              00057**3
APREPDS DFHMDF ATTRB=(ASKIP,NORM),                                     X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,27)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(08,58)                                              00057**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='PACK BY STORE:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(09,3)                                               00029   
APACKBS DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00049   
               LENGTH=6,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(09,18)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(09,25)                                              00057**3
APKBSDS DFHMDF ATTRB=(ASKIP,NORM),                                     X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,27)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(09,58)                                              00057**3
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00026   
               INITIAL='RFID.........:',                               X00027   
               LENGTH=14,                                              X00028   
               POS=(10,3)                                               00029   
ARFIDBS DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00049   
               LENGTH=6,                                               X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(10,18)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(10,25)                                              00057**3
ARFIDDS DFHMDF ATTRB=(ASKIP,NORM),                                     X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,27)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00054   
               LENGTH=1,                                               X00055   
               COLOR=NEUTRAL,                                          X00056   
               POS=(10,58)                                              00057**3
         DFHMSD TYPE=FINAL                                              00078   
         END                                                            00079   
