        PRINT  NOGEN                                                    00002   
SUKM589 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
SU589A  DFHMDI LINE=2,COLUMN=1,                                        C00010**5
               SIZE=(19,80),                                           C00011**5
               CTRL=(FREEKB),                                          C00012   
               MAPATTS=(COLOR,HILIGHT),                                C00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(02,01),LENGTH=13,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='OPER UNIT ID:'                                  00037   
AOPRUNT DFHMDF POS=(02,15),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
AOPRDSC DFHMDF POS=(02,20),LENGTH=30,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(02,52),LENGTH=15,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='FROM DATE.....:'                                00037   
AFRMDTE DFHMDF POS=(02,68),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
ATITLE1 DFHMDF POS=(03,01),LENGTH=13,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PO-RECEIVER.:'                                  00037   
APORCVR DFHMDF POS=(03,15),LENGTH=18,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(03,52),LENGTH=15,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='TO DATE.......:'                                00037   
ATODTE  DFHMDF POS=(03,68),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(04,01),LENGTH=13,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='VENDOR ID...:'                                  00037   
AVENDID DFHMDF POS=(04,15),LENGTH=09,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
AVENDNM DFHMDF POS=(04,25),LENGTH=25,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(04,52),LENGTH=15,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='AUDIT STATUS..:'                                00037   
AAUDSTA DFHMDF POS=(04,68),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(05,01),LENGTH=13,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DEPARTMENT..:'                                  00037   
ADEPT   DFHMDF POS=(05,20),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
ADPTDSC DFHMDF POS=(05,25),LENGTH=25,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(05,52),LENGTH=15,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PROCESS STATUS:'                                00037   
APRCSTA DFHMDF POS=(05,68),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
*                                                                       00034   
        DFHMDF POS=(06,01),LENGTH=13,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PACKAGE TYPE:'                                  00037   
APKGTYP DFHMDF POS=(06,15),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=BLUE                                               00036   
        DFHMDF POS=(06,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(06,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(06,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(06,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(06,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(06,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
*                                                                       00034   
        DFHMDF POS=(07,05),LENGTH=05,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='AUDIT'                                          00037   
        DFHMDF POS=(07,17),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='OPER'                                           00037   
        DFHMDF POS=(07,23),LENGTH=11,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PO-RECEIVER'                                    00037   
        DFHMDF POS=(07,37),LENGTH=05,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='LINE/'                                          00037   
        DFHMDF POS=(07,59),LENGTH=07,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='REQUEST'                                        00037   
        DFHMDF POS=(07,68),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PROC'                                                   
        DFHMDF POS=(07,73),LENGTH=03,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DFR'                                                    
*                                                                       00034   
        DFHMDF POS=(08,01),LENGTH=01,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='S'                                              00037   
        DFHMDF POS=(08,04),LENGTH=06,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='NUMBER'                                         00037   
        DFHMDF POS=(08,13),LENGTH=03,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='SRC'                                            00037   
        DFHMDF POS=(08,17),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='UNIT'                                           00037   
        DFHMDF POS=(08,25),LENGTH=06,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='NUMBER'                                         00037   
        DFHMDF POS=(08,37),LENGTH=04,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='PACK'                                           00037   
        DFHMDF POS=(08,43),LENGTH=10,ATTRB=(PROT,NORM),                C00035   
               COLOR=NEUTRAL,                                          C00036   
               INITIAL='DPT CL SKU'                                     00037   
        DFHMDF POS=(08,61),LENGTH=04,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='DATE'                                           00049   
        DFHMDF POS=(08,68),LENGTH=04,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='STAT'                                           00049   
        DFHMDF POS=(08,73),LENGTH=03,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='IND'                                            00049   
        DFHMDF POS=(08,77),LENGTH=03,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='MOD'                                            00049   
*                                                                       00053   
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN01 DFHMDF POS=(09,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC01  DFHMDF POS=(09,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR01  DFHMDF POS=(09,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC01 DFHMDF POS=(09,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK01 DFHMDF POS=(09,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU01  DFHMDF POS=(09,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE01 DFHMDF POS=(09,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST01 DFHMDF POS=(09,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN01 DFHMDF POS=(09,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD01  DFHMDF POS=(09,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN02 DFHMDF POS=(10,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC02  DFHMDF POS=(10,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR02  DFHMDF POS=(10,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC02 DFHMDF POS=(10,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK02 DFHMDF POS=(10,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU02  DFHMDF POS=(10,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE02 DFHMDF POS=(10,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST02 DFHMDF POS=(10,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN02 DFHMDF POS=(10,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD02  DFHMDF POS=(10,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN03 DFHMDF POS=(11,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC03  DFHMDF POS=(11,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR03  DFHMDF POS=(11,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC03 DFHMDF POS=(11,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK03 DFHMDF POS=(11,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU03  DFHMDF POS=(11,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE03 DFHMDF POS=(11,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST03 DFHMDF POS=(11,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN03 DFHMDF POS=(11,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD03  DFHMDF POS=(11,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN04 DFHMDF POS=(12,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC04  DFHMDF POS=(12,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR04  DFHMDF POS=(12,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC04 DFHMDF POS=(12,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK04 DFHMDF POS=(12,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU04  DFHMDF POS=(12,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE04 DFHMDF POS=(12,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST04 DFHMDF POS=(12,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN04 DFHMDF POS=(12,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD04  DFHMDF POS=(12,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN05 DFHMDF POS=(13,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC05  DFHMDF POS=(13,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR05  DFHMDF POS=(13,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC05 DFHMDF POS=(13,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK05 DFHMDF POS=(13,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU05  DFHMDF POS=(13,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE05 DFHMDF POS=(13,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST05 DFHMDF POS=(13,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN05 DFHMDF POS=(13,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD05  DFHMDF POS=(13,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN06 DFHMDF POS=(14,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC06  DFHMDF POS=(14,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR06  DFHMDF POS=(14,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC06 DFHMDF POS=(14,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK06 DFHMDF POS=(14,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU06  DFHMDF POS=(14,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE06 DFHMDF POS=(14,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST06 DFHMDF POS=(14,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN06 DFHMDF POS=(14,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD06  DFHMDF POS=(14,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN07 DFHMDF POS=(15,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC07  DFHMDF POS=(15,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR07  DFHMDF POS=(15,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC07 DFHMDF POS=(15,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK07 DFHMDF POS=(15,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU07  DFHMDF POS=(15,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE07 DFHMDF POS=(15,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST07 DFHMDF POS=(15,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN07 DFHMDF POS=(15,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD07  DFHMDF POS=(15,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN08 DFHMDF POS=(16,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC08  DFHMDF POS=(16,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR08  DFHMDF POS=(16,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC08 DFHMDF POS=(16,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK08 DFHMDF POS=(16,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU08  DFHMDF POS=(16,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE08 DFHMDF POS=(16,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST08 DFHMDF POS=(16,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN08 DFHMDF POS=(16,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD08  DFHMDF POS=(16,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN09 DFHMDF POS=(17,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC09  DFHMDF POS=(17,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR09  DFHMDF POS=(17,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC09 DFHMDF POS=(17,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK09 DFHMDF POS=(17,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU09  DFHMDF POS=(17,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE09 DFHMDF POS=(17,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST09 DFHMDF POS=(17,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN09 DFHMDF POS=(17,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD09  DFHMDF POS=(17,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
ASEL10  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00054**2
               HILIGHT=UNDERLINE,                                      C00055   
               COLOR=GREEN                                              00056   
AAUDN10 DFHMDF POS=(18,03),LENGTH=09,ATTRB=(ASKIP,NORM),               C00060**8
               COLOR=BLUE,PICOUT='ZZZZZZZZ9'                            00061   
ASRC10  DFHMDF POS=(18,13),LENGTH=03,ATTRB=(ASKIP,NORM),               C00062   
               COLOR=BLUE                                               00063   
AOPR10  DFHMDF POS=(18,17),LENGTH=04,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE,PICOUT='ZZZ9'                                 00061   
APORC10 DFHMDF POS=(18,22),LENGTH=13,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ALNPK10 DFHMDF POS=(18,36),LENGTH=06,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                                       
ASKU10  DFHMDF POS=(18,43),LENGTH=15,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ARDTE10 DFHMDF POS=(18,59),LENGTH=08,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
APRST10 DFHMDF POS=(18,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
ADFIN10 DFHMDF POS=(18,74),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
AMOD10  DFHMDF POS=(18,78),LENGTH=01,ATTRB=(ASKIP,NORM),               C00064   
               COLOR=BLUE                                               00061   
*                                                                       00053   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00264   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00265   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00266   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00267   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
