  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  SUKM587                                            *   00004   
*        MAP     SU587A                                             *   00005   
*        PROGRAM SUKCS587                                           *   00006   
*        TRANSID S587 - SYSTEM GENERATED AUDIT RESULTS CRIT SPEC    *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
SUKM587 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
SU587A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ENTER THE NECESSARY DATA TO LOOK AT SYSTEM GENEX00022   
               RATED AUDITS:',                                         X00024   
               LENGTH=60,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026**2
*                                                                       00027**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PACKAGING TYPE...:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(03,06)                                              00032**3
APKGTYP DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(03,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(03,28)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='BC=BULK/CASEPACK, PP=PRE-PACK, PS=PBS',        X00029**3
               LENGTH=37,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(03,35)                                              00032**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='RF=RFID, AL=ALL',                              X00029**3
               LENGTH=15,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(04,35)                                              00032**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PROCESS STATUS...:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(05,06)                                              00032**3
APRCSTA DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=01,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(05,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(05,27)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='P=PASS, F=FAIL, I=IN PROCESS, N=NOT NEEDED',   X00029**3
               LENGTH=42,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(05,35)                                              00032**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='A=ALL',                                        X00029**3
               LENGTH=05,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(06,35)                                              00032**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='OPER UNIT ID.....:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(07,06)                                              00032**3
AOPRUNT DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(07,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(07,30)                                              00042**3
AOPRDSC DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               LENGTH=30,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(07,35)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='REQUEST FROM DATE:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(08,06)                                              00032**3
AREQFMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,25)                                              00037**5
AREQFDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,28)                                              00037**5
AREQFYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,31)                                              00037**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='TO DATE:',                                     X00060   
               LENGTH=08,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(08,36)                                              00032**3
AREQTMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,45)                                              00037**5
AREQTDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,48)                                              00037**5
AREQTYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(08,51)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(08,56)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='MM DD YYYY (OPTIONAL)',                        X00060   
               LENGTH=21,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(08,58)                                              00032**3
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(08,80)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='-OR-',                                         X00060   
               LENGTH=04,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(09,11)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='PURCHASE ORDER...:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(10,06)                                              00032**3
APO     DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=09,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(10,35)                                              00042**3
*                                                                       00043   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='RECEIVER SEQ NBR.:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(11,06)                                              00032**3
ARECSEQ DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=03,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(11,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(11,29)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='(OPTIONAL)',                                   X00029**3
               LENGTH=10,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(11,35)                                              00032**3
*                                                                       00073   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='OPER UNIT ID.....:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,06)                                              00032**3
APOOPER DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(12,30)                                              00042**3
APOOPDS DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               LENGTH=30,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,35)                                              00032**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='(OPTIONAL)',                                   X00029**3
               LENGTH=10,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(12,66)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='-OR-',                                         X00060   
               LENGTH=04,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(13,11)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='VENDOR NAME......:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(14,06)                                              00032**3
AVNDNAM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(14,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='OR VENDOR ID:',                                X00029**3
               LENGTH=13,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(14,56)                                              00032**3
AVNDID  DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=09,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               PICOUT='ZZZZZZZZ9',                                     X00036**3
               POS=(14,70)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(14,80)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='DEPARTMENT.......:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(15,06)                                              00032**3
ADEPT   DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(15,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(15,30)                                              00042**3
ADEPTDS DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               LENGTH=30,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(15,35)                                              00032**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='(OPTIONAL)',                                   X00029**3
               LENGTH=10,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(15,67)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='OPER UNIT ID.....:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(16,06)                                              00032**3
AVNOPER DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(16,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(16,30)                                              00042**3
AVNOPDS DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               LENGTH=30,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(16,35)                                              00032**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='(OPTIONAL)',                                   X00029**3
               LENGTH=10,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(16,67)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='REQUEST FROM DATE:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(17,06)                                              00032**3
AVRQFMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,25)                                              00037**5
AVRQFDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,28)                                              00037**5
AVRQFYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,31)                                              00037**5
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='TO DATE:',                                     X00060   
               LENGTH=08,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(17,36)                                              00032**3
AVRQTMM DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,45)                                              00037**5
AVRQTDD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=02,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,48)                                              00037**5
AVRQTYY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,51)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(17,56)                                              00042**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='MM DD YYYY (OPTIONAL)',                        X00060   
               LENGTH=21,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(17,58)                                              00032**3
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(17,80)                                              00042**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='-OR-',                                         X00060   
               LENGTH=04,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(18,11)                                              00032**3
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00028**3
               INITIAL='AUDIT NUMBER.....:',                           X00029**3
               LENGTH=18,                                              X00030**3
               COLOR=NEUTRAL,                                          X00031**3
               POS=(19,06)                                              00032**3
AAUDNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=09,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(19,25)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00039**3
               LENGTH=1,                                               X00040**3
               COLOR=NEUTRAL,                                          X00041**3
               POS=(19,35)                                              00042**3
*                                                                       00058   
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
