  PRINT  NOGEN                                                          00003*11
*-------------------------------------------------------------------*   00004*11
*        MAPSET  SUKM567                                            *   00006*11
*        MAP     SU567A                                             *   00007*11
*        PROGRAM SUKCS567                                           *   00008*11
*        TRANSID S567 - TRAILER STATUS LIST                         *   00009*11
*-------------------------------------------------------------------*   00012*11
SUKM567 DFHMSD TYPE=DSECT,                                             X00013*11
               MODE=INOUT,                                             X00014*11
               LANG=COBOL,                                             X00015*11
               STORAGE=AUTO,                                           X00016*11
               TIOAPFX=YES,                                            X00017*11
               TERM=3270-2                                              00018*11
SU567A  DFHMDI LINE=2,COLUMN=1,                                        X00019*11
               SIZE=(19,80),                                           X00020*11
               MAPATTS=(COLOR,HILIGHT),                                X00021*11
               DSATTS=(COLOR,HILIGHT),                                 X00022*11
               CTRL=(FREEKB)                                            00023*11
*                                                                       00024*11
        DFHMDF POS=(02,01),                                            X00025*11
               LENGTH=20,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL,                                          X00028*11
               INITIAL='STORE NUMBER.......:'                           00029*11
ASTORE  DFHMDF POS=(02,22),                                            X00030*11
               LENGTH=04,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               PICOUT='ZZZ9',                                          X00032*11
               COLOR=BLUE                                               00033*11
ASTNME  DFHMDF POS=(02,27),                                            X00030*11
               LENGTH=25,                                              X00031*11
               ATTRB=(ASKIP,NORM),                                     X00032*11
               COLOR=BLUE                                               00033*11
*                                                                       00024*11
ASTTYP  DFHMDF POS=(03,01),                                            X00025*11
               LENGTH=20,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL                                            00028*11
ATITLE  DFHMDF POS=(03,22),                                            X00025*11
               LENGTH=58,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
*                                                                       00024*11
ADCSHM  DFHMDF POS=(04,01),                                            X00025*11
               LENGTH=35,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=NEUTRAL                                            00028*11
AOPSTM  DFHMDF POS=(04,38),                                            X00025*11
               LENGTH=35,                                              X00026*11
               ATTRB=(ASKIP,NORM),                                     X00027*11
               COLOR=BLUE                                               00028*11
*                                                                               
        DFHMDF POS=(05,45),                                            X00044*11
               LENGTH=05,                                              X00045*11
               ATTRB=(ASKIP,NORM),                                     X00046*11
               COLOR=NEUTRAL,                                          X00047*11
               INITIAL='ITEMS'                                          00048*11
ASTRTIT DFHMDF POS=(05,51),                                            X00049*11
               LENGTH=05,                                              X00050*11
               ATTRB=(NUM,UNPROT,NORM),                                X00051*11
               COLOR=GREEN,                                            X00052*11
               HILIGHT=UNDERLINE,                                      X00053*11
               PICOUT='ZZZZ9'                                           00054*11
        DFHMDF POS=(05,57),                                            X00055*11
               LENGTH=02,                                              X00056*11
               ATTRB=(ASKIP,NORM),                                     X00057*11
               COLOR=NEUTRAL,                                          X00058*11
               INITIAL='TO'                                             00059*11
AENDIT  DFHMDF POS=(05,60),                                            X00060*11
               LENGTH=05,                                              X00061*11
               ATTRB=(ASKIP,NORM),                                     X00062*11
               COLOR=BLUE,                                             X00063*11
               PICOUT='ZZZZ9'                                           00064*11
        DFHMDF POS=(05,66),                                            X00065*11
               LENGTH=02,                                              X00066*11
               ATTRB=(ASKIP,NORM),                                     X00067*11
               COLOR=NEUTRAL,                                          X00068*11
               INITIAL='OF'                                             00069*11
ATOTIT  DFHMDF POS=(05,69),                                            X00070*11
               LENGTH=05,                                              X00071*11
               ATTRB=(ASKIP,NORM),                                     X00072*11
               COLOR=BLUE,                                             X00073*11
               PICOUT='ZZZZ9'                                           00074*11
*                                                                       00075*11
        DFHMDF POS=(06,08),                                            X00076*12
               LENGTH=18,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='TRAILER    STATUS '                             00080*11
        DFHMDF POS=(06,27),                                            X00076*12
               LENGTH=27,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='----------TRAILER----------'                    00080*11
        DFHMDF POS=(06,56),                                            X00076*12
               LENGTH=24,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='   JWLRY   CARTON   UNIT'                       00080*11
*                                                                       00075*11
        DFHMDF POS=(07,01),                                            X00076*12
               LENGTH=43,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL='S ACT   STATUS     DATE   SCAC TRLR ID     '    00080*11
        DFHMDF POS=(07,45),                                            X00076*12
               LENGTH=35,                                              X00077*11
               ATTRB=(ASKIP,NORM),                                     X00078*11
               COLOR=NEUTRAL,                                          X00079*11
               INITIAL=' SERIAL #      Y/N AD  COUNT  COUNT'            00080*11
*                                                                       00127*11
ASEL01  DFHMDF POS=(08,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT01  DFHMDF POS=(08,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT01 DFHMDF POS=(08,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT01 DFHMDF POS=(08,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC01 DFHMDF POS=(08,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR01 DFHMDF POS=(08,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER01  DFHMDF POS=(08,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL01 DFHMDF POS=(08,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD01   DFHMDF POS=(08,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN01  DFHMDF POS=(08,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT01  DFHMDF POS=(08,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 9                                                                00127*11
ASEL02  DFHMDF POS=(09,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT02  DFHMDF POS=(09,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT02 DFHMDF POS=(09,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT02 DFHMDF POS=(09,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC02 DFHMDF POS=(09,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR02 DFHMDF POS=(09,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER02  DFHMDF POS=(09,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL02 DFHMDF POS=(09,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD02   DFHMDF POS=(09,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN02  DFHMDF POS=(09,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT02  DFHMDF POS=(09,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 10                                                               00127*11
ASEL03  DFHMDF POS=(10,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT03  DFHMDF POS=(10,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT03 DFHMDF POS=(10,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT03 DFHMDF POS=(10,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC03 DFHMDF POS=(10,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR03 DFHMDF POS=(10,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER03  DFHMDF POS=(10,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL03 DFHMDF POS=(10,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD03   DFHMDF POS=(10,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN03  DFHMDF POS=(10,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT03  DFHMDF POS=(10,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 11                                                               00127*11
ASEL04  DFHMDF POS=(11,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT04  DFHMDF POS=(11,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT04 DFHMDF POS=(11,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT04 DFHMDF POS=(11,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC04 DFHMDF POS=(11,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR04 DFHMDF POS=(11,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER04  DFHMDF POS=(11,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL04 DFHMDF POS=(11,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD04   DFHMDF POS=(11,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN04  DFHMDF POS=(11,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT04  DFHMDF POS=(11,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 12                                                               00127*11
ASEL05  DFHMDF POS=(12,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT05  DFHMDF POS=(12,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT05 DFHMDF POS=(12,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT05 DFHMDF POS=(12,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC05 DFHMDF POS=(12,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR05 DFHMDF POS=(12,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER05  DFHMDF POS=(12,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL05 DFHMDF POS=(12,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD05   DFHMDF POS=(12,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN05  DFHMDF POS=(12,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT05  DFHMDF POS=(12,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 13                                                               00127*11
ASEL06  DFHMDF POS=(13,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT06  DFHMDF POS=(13,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT06 DFHMDF POS=(13,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT06 DFHMDF POS=(13,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC06 DFHMDF POS=(13,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR06 DFHMDF POS=(13,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER06  DFHMDF POS=(13,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL06 DFHMDF POS=(13,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD06   DFHMDF POS=(13,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN06  DFHMDF POS=(13,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT06  DFHMDF POS=(13,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 14                                                               00127*11
ASEL07  DFHMDF POS=(14,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT07  DFHMDF POS=(14,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT07 DFHMDF POS=(14,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT07 DFHMDF POS=(14,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC07 DFHMDF POS=(14,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR07 DFHMDF POS=(14,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER07  DFHMDF POS=(14,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL07 DFHMDF POS=(14,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD07   DFHMDF POS=(14,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN07  DFHMDF POS=(14,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT07  DFHMDF POS=(14,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 15                                                               00127*11
ASEL08  DFHMDF POS=(15,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT08  DFHMDF POS=(15,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT08 DFHMDF POS=(15,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT08 DFHMDF POS=(15,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC08 DFHMDF POS=(15,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR08 DFHMDF POS=(15,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER08  DFHMDF POS=(15,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL08 DFHMDF POS=(15,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD08   DFHMDF POS=(15,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN08  DFHMDF POS=(15,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT08  DFHMDF POS=(15,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 16                                                               00127*11
ASEL09  DFHMDF POS=(16,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT09  DFHMDF POS=(16,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT09 DFHMDF POS=(16,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT09 DFHMDF POS=(16,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC09 DFHMDF POS=(16,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR09 DFHMDF POS=(16,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER09  DFHMDF POS=(16,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL09 DFHMDF POS=(16,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD09   DFHMDF POS=(16,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN09  DFHMDF POS=(16,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT09  DFHMDF POS=(16,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
* LINE 17                                                               00127*11
ASEL10  DFHMDF POS=(17,01),                                            X00128*11
               LENGTH=01,                                              X00129*11
               ATTRB=(UNPROT,NORM,IC),                                 X00130*11
               HILIGHT=UNDERLINE,                                      X00131*11
               COLOR=GREEN                                              00132*11
AACT10  DFHMDF POS=(17,03),                                            X00136*12
               LENGTH=03,                                              X00137*11
               ATTRB=(ASKIP,NORM),                                     X00138*11
               COLOR=BLUE                                               00139*11
ASTAT10 DFHMDF POS=(17,07),                                            X00140*12
               LENGTH=10,                                              X00141*11
               ATTRB=(ASKIP,NORM),                                     X00142*11
               COLOR=BLUE                                               00143*11
ASTDT10 DFHMDF POS=(17,18),                                            X00144*12
               LENGTH=08,                                              X00145*11
               ATTRB=(ASKIP,NORM),                                     X00146*11
               COLOR=BLUE                                               00147*11
ASCAC10 DFHMDF POS=(17,27),                                            X00148*12
               LENGTH=04,                                              X00149*11
               ATTRB=(ASKIP,NORM),                                     X00150*11
               COLOR=BLUE                                               00151*11
ATRLR10 DFHMDF POS=(17,32),                                            X00152*12
               LENGTH=12,                                              X00153*11
               ATTRB=(ASKIP,NORM),                                     X00154*11
               COLOR=BLUE                                               00155*11
ASER10  DFHMDF POS=(17,45),                                            X00156*12
               LENGTH=09,                                              X00157*11
               ATTRB=(ASKIP,NORM),                                     X00158*11
               COLOR=BLUE                                               00159*11
AJEWL10 DFHMDF POS=(17,61),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AAD10   DFHMDF POS=(17,65),                                            X00165*12
               LENGTH=01,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
ACTN10  DFHMDF POS=(17,67),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
AUNT10  DFHMDF POS=(17,74),                                            X00165*12
               LENGTH=06,                                              X00166*11
               ATTRB=(ASKIP,NORM),                                     X00167*11
               COLOR=BLUE                                               00168*11
*                                                                       00691*11
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               C00739*12
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00740*12
ASELIT  DFHMDF POS=(19,71),LENGTH=07,ATTRB=(ASKIP,NORM),               C00741*12
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00742*11
**************                                                          00747*11
        DFHMSD TYPE=FINAL                                               00748*11
**************                                                          00749*11
        END                                                             00750*11
