***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
SUKM535  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
SU535A   DFHMDI SIZE=(09,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT)                                          
***********************************************************************         
         DFHMDF POS=(01,03),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='PREVIOUS FAILURE'                                       
***********************************************************************         
         DFHMDF POS=(02,01),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DC NBR:'                                                
ADCNBR   DFHMDF POS=(02,09),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM)                                               
AMULTDC  DFHMDF POS=(02,14),                                           X        
               LENGTH=006,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
ACRTERR  DFHMDF POS=(03,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
***********************************************************************         
AFAIL1   DFHMDF POS=(04,02),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
AFAIL2   DFHMDF POS=(05,02),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
AFAIL3   DFHMDF POS=(06,02),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
AFAIL4   DFHMDF POS=(07,02),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
AFAIL5   DFHMDF POS=(08,02),                                           X        
               LENGTH=017,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
AMSGLN   DFHMDF POS=(09,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
