*          DATA SET SUKM520    AT LEVEL 001 AS OF 08/27/97                      
        PRINT NOGEN                                                     00001   
SUKM520  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU520A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=001,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='#'                                              00015*29
ANBR     DFHMDF POS=(01,03),                                           X00034*22
               LENGTH=009,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00053   
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00025**2
               LENGTH=018,                                             X00026**2
               ATTRB=(ASKIP,NORM),                                     X00027**2
               INITIAL='HAS A CURRENT     '                             00028**2
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00025**2
               LENGTH=09,                                              X00026**2
               ATTRB=(ASKIP,NORM),                                     X00027**2
               INITIAL='TYPE OF: '                                      00028**2
*                                                                       00024   
ATYPE    DFHMDF POS=(03,11),                                           X00030**2
               LENGTH=10,                                              X00031   
               ATTRB=(ASKIP,NORM)                                       00032   
*                                                                       00016   
         DFHMDF POS=(04,03),                                           X00034*22
               LENGTH=11,                                              X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F2-CONTINUE'                                    00015*29
*                                                                       00016   
         DFHMDF POS=(05,03),                                           X00034*22
               LENGTH=14,                                              X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F4-SET TO 100%'                                 00015*29
*                                                                       00016   
         DFHMDF POS=(06,03),                                           X00034*22
               LENGTH=14,                                              X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F5-SET TO SPOT'                                 00015*29
*                                                                       00016   
         DFHMDF POS=(07,03),                                           X00034*22
               LENGTH=16,                                              X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='F6-SET TO REWORK'                               00015*29
*                                                                       00076   
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=19,                                              X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
