*********************************************************************** 00030001
        PRINT  NOGEN                                                    00080001
SUKM559 DFHMSD TYPE=DSECT,                                             X00090001
               LANG=COBOL,                                             X00100001
               MODE=INOUT,                                             X00110001
               STORAGE=AUTO,                                           X00120001
               TERM=3270-2,                                            X00130001
               TIOAPFX=YES                                              00140001
*********************************************************************** 00150001
SU559A  DFHMDI LINE=2,COLUMN=1,                                        X00160001
               SIZE=(19,80),                                           X00170001
               CTRL=(FREEKB),                                          X00180001
               MAPATTS=(COLOR,HILIGHT),                                X00190001
               DSATTS=(COLOR,HILIGHT)                                   00200001
*********************************************************************** 00210001
        DFHMDF POS=(02,01),                                            X00220001
               LENGTH=09,                                              X00230001
               ATTRB=(ASKIP,NORM),                                     X00240001
               COLOR=NEUTRAL,                                          X00250001
               INITIAL='OPER ID: '                                      00260001
AOPER   DFHMDF POS=(02,11),                                            X00270001
               LENGTH=04,                                              X00280001
               ATTRB=(ASKIP,NORM),                                     X00290001
               COLOR=BLUE                                               00300001
AOPRNME DFHMDF POS=(02,17),                                            X00360001
               LENGTH=25,                                              X00370001
               ATTRB=(ASKIP,NORM),                                     X00380001
               COLOR=BLUE                                               00390002
        DFHMDF POS=(02,45),                                            X00410001
               LENGTH=01,                                              X00420001
               ATTRB=(ASKIP)                                            00430001
*********************************************************************** 00960014
        DFHMDF POS=(03,49),                                            X00990001
               LENGTH=05,                                              X01000001
               ATTRB=(ASKIP,NORM),                                     X01010001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01020001
ASTRTIT DFHMDF POS=(03,55),                                            X01030001
               LENGTH=05,                                              X01040001
               ATTRB=(NUM,UNPROT,NORM),                                X01050001
               COLOR=GREEN,                                            X01060001
               PICOUT='ZZZZ9',                                         X01070001
               HILIGHT=UNDERLINE                                        01080001
        DFHMDF POS=(03,61),                                            X01090001
               LENGTH=02,                                              X01100001
               ATTRB=(ASKIP,NORM),                                     X01110001
               COLOR=NEUTRAL,                                          X01120001
               INITIAL='TO'                                             01130001
AENDIT  DFHMDF POS=(03,64),                                            X01140001
               LENGTH=05,                                              X01150001
               ATTRB=(ASKIP,NORM),                                     X01160001
               COLOR=BLUE,                                             X01170001
               PICOUT='ZZZZ9'                                           01180001
        DFHMDF POS=(03,70),                                            X01190001
               LENGTH=02,                                              X01200001
               ATTRB=(ASKIP,NORM),                                     X01210001
               COLOR=NEUTRAL,                                          X01220001
               INITIAL='OF'                                             01230001
ATOTIT  DFHMDF POS=(03,73),                                            X01240001
               LENGTH=05,                                              X01250001
               ATTRB=(ASKIP,NORM),                                     X01260001
               COLOR=BLUE,                                             X01270001
               PICOUT='ZZZZ9'                                           01280001
*********************************************************************** 01290001
ASEQ    DFHMDF POS=(04,01),                                            X01292015
               LENGTH=14,                                              X01293015
               ATTRB=(ASKIP,NORM),                                     X01294015
               COLOR=YELLOW                                             01295015
*********************************************************************** 01296015
        DFHMDF POS=(05,27),                                            X01300013
               LENGTH=07,                                              X01310001
               ATTRB=(ASKIP,NORM),                                     X01320001
               COLOR=NEUTRAL,                                          X01330001
               INITIAL='TRAILER'                                        01340001
        DFHMDF POS=(05,38),                                            X01350013
               LENGTH=08,                                              X01360001
               ATTRB=(ASKIP,NORM),                                     X01370001
               COLOR=NEUTRAL,                                          X01380001
               INITIAL='OUTBOUND'                                       01390001
        DFHMDF POS=(05,49),                                            X01390112
               LENGTH=04,                                              X01390211
               ATTRB=(ASKIP,NORM),                                     X01390301
               COLOR=NEUTRAL,                                          X01390401
               INITIAL='TRIP'                                           01390511
        DFHMDF POS=(05,57),                                            X01390611
               LENGTH=06,                                              X01390711
               ATTRB=(ASKIP,NORM),                                     X01390811
               COLOR=NEUTRAL,                                          X01390911
               INITIAL='STATUS'                                         01391011
        DFHMDF POS=(05,67),                                            X01391111
               LENGTH=05,                                              X01391211
               ATTRB=(ASKIP,NORM),                                     X01391311
               COLOR=NEUTRAL,                                          X01391411
               INITIAL='DOOR/'                                          01391511
        DFHMDF POS=(05,76),                                            X01391611
               LENGTH=04,                                              X01391711
               ATTRB=(ASKIP,NORM),                                     X01391811
               COLOR=NEUTRAL,                                          X01391911
               INITIAL='DEST'                                           01392011
*********************************************************************** 01393011
        DFHMDF POS=(06,01),                                            X01410001
               LENGTH=22,                                              X01420006
               ATTRB=(ASKIP,NORM),                                     X01430001
               COLOR=NEUTRAL,                                          X01440001
               INITIAL='S ACT SCAC  TRAILER ID'                         01450006
        DFHMDF POS=(06,27),                                            X01460006
               LENGTH=29,                                              X01470006
               ATTRB=(ASKIP,NORM),                                     X01480001
               COLOR=NEUTRAL,                                          X01490001
               INITIAL='SERIAL #     TRIP    STATUS  '                  01500010
        DFHMDF POS=(06,57),                                            X01510006
               LENGTH=23,                                              X01520006
               ATTRB=(ASKIP,NORM),                                     X01530001
               COLOR=NEUTRAL,                                          X01540001
               INITIAL=' DATE     SLOT      NBR'                        01550013
*********************************************************************** 01560001
ASEL01  DFHMDF POS=(07,01),                                            X01570001
               LENGTH=01,                                              X01580001
               ATTRB=(UNPROT,NORM,IC),                                 X01590007
               HILIGHT=UNDERLINE,                                      X01600001
               COLOR=GREEN                                              01610001
AACT01  DFHMDF POS=(07,03),                                            X01620001
               LENGTH=03,                                              X01630001
               ATTRB=(ASKIP,NORM),                                     X01640006
               COLOR=BLUE                                               01650001
ASCAC01 DFHMDF POS=(07,07),                                            X01660006
               LENGTH=04,                                              X01670006
               ATTRB=(ASKIP,NORM),                                     X01680006
               COLOR=BLUE                                               01700001
ATRID01 DFHMDF POS=(07,12),                                            X01700106
               LENGTH=12,                                              X01700206
               ATTRB=(ASKIP,NORM),                                     X01700306
               COLOR=BLUE                                               01700506
ATRLR01 DFHMDF POS=(07,26),                                            X01701006
               LENGTH=09,                                              X01702006
               ATTRB=(ASKIP,NORM),                                     X01703006
               PICOUT='ZZZZZZZZZ',                                     X01704006
               COLOR=BLUE                                               01705006
ATRIP01 DFHMDF POS=(07,38),                                            X01710009
               LENGTH=09,                                              X01720001
               ATTRB=(ASKIP,NORM),                                     X01730006
               PICOUT='ZZZZZZZZZ',                                     X01740001
               COLOR=BLUE                                               01750001
ASTAT01 DFHMDF POS=(07,50),                                            X01760006
               LENGTH=02,                                              X01770006
               ATTRB=(ASKIP,NORM),                                     X01780006
               COLOR=BLUE                                               01790001
ADATE01 DFHMDF POS=(07,55),                                            X01800006
               LENGTH=10,                                              X01810001
               ATTRB=(ASKIP,NORM),                                     X01820006
               COLOR=BLUE                                               01830001
ADOOR01 DFHMDF POS=(07,66),                                            X01840008
               LENGTH=06,                                              X01850008
               ATTRB=(ASKIP,NORM),                                     X01860006
               COLOR=BLUE                                               01870001
ADEST01 DFHMDF POS=(07,76),                                            X01880001
               LENGTH=04,                                              X01890001
               ATTRB=(ASKIP,NORM),                                     X01900006
               PICOUT='Z999',                                          X01901001
               COLOR=BLUE                                               01910001
*********************************************************************** 01910106
ASEL02  DFHMDF POS=(08,01),                                            X01911006
               LENGTH=01,                                              X01912006
               ATTRB=(UNPROT,NORM),                                    X01913006
               HILIGHT=UNDERLINE,                                      X01914006
               COLOR=GREEN                                              01915006
AACT02  DFHMDF POS=(08,03),                                            X01916006
               LENGTH=03,                                              X01917006
               ATTRB=(ASKIP,NORM),                                     X01918006
               COLOR=BLUE                                               01919006
ASCAC02 DFHMDF POS=(08,07),                                            X01919106
               LENGTH=04,                                              X01919206
               ATTRB=(ASKIP,NORM),                                     X01919306
               COLOR=BLUE                                               01919406
ATRID02 DFHMDF POS=(08,12),                                            X01919506
               LENGTH=12,                                              X01919606
               ATTRB=(ASKIP,NORM),                                     X01919706
               COLOR=BLUE                                               01919806
ATRLR02 DFHMDF POS=(08,26),                                            X01919906
               LENGTH=09,                                              X01920006
               ATTRB=(ASKIP,NORM),                                     X01921006
               PICOUT='ZZZZZZZZZ',                                     X01922006
               COLOR=BLUE                                               01923006
ATRIP02 DFHMDF POS=(08,38),                                            X01924009
               LENGTH=09,                                              X01925006
               ATTRB=(ASKIP,NORM),                                     X01926006
               PICOUT='ZZZZZZZZZ',                                     X01927006
               COLOR=BLUE                                               01928006
ASTAT02 DFHMDF POS=(08,50),                                            X01929006
               LENGTH=02,                                              X01929106
               ATTRB=(ASKIP,NORM),                                     X01929206
               COLOR=BLUE                                               01929306
ADATE02 DFHMDF POS=(08,55),                                            X01929406
               LENGTH=10,                                              X01929506
               ATTRB=(ASKIP,NORM),                                     X01929606
               COLOR=BLUE                                               01929706
ADOOR02 DFHMDF POS=(08,66),                                            X01929808
               LENGTH=06,                                              X01929908
               ATTRB=(ASKIP,NORM),                                     X01930006
               COLOR=BLUE                                               01931006
ADEST02 DFHMDF POS=(08,76),                                            X01932006
               LENGTH=04,                                              X01933006
               ATTRB=(ASKIP,NORM),                                     X01934006
               PICOUT='Z999',                                          X01935006
               COLOR=BLUE                                               01936006
*********************************************************************** 01937006
ASEL03  DFHMDF POS=(09,01),                                            X01938006
               LENGTH=01,                                              X01939006
               ATTRB=(UNPROT,NORM),                                    X01939106
               HILIGHT=UNDERLINE,                                      X01939206
               COLOR=GREEN                                              01939306
AACT03  DFHMDF POS=(09,03),                                            X01939406
               LENGTH=03,                                              X01939506
               ATTRB=(ASKIP,NORM),                                     X01939606
               COLOR=BLUE                                               01939706
ASCAC03 DFHMDF POS=(09,07),                                            X01939806
               LENGTH=04,                                              X01939906
               ATTRB=(ASKIP,NORM),                                     X01940006
               COLOR=BLUE                                               01941006
ATRID03 DFHMDF POS=(09,12),                                            X01942006
               LENGTH=12,                                              X01943006
               ATTRB=(ASKIP,NORM),                                     X01944006
               COLOR=BLUE                                               01945006
ATRLR03 DFHMDF POS=(09,26),                                            X01946006
               LENGTH=09,                                              X01947006
               ATTRB=(ASKIP,NORM),                                     X01948006
               PICOUT='ZZZZZZZZZ',                                     X01949006
               COLOR=BLUE                                               01949106
ATRIP03 DFHMDF POS=(09,38),                                            X01949209
               LENGTH=09,                                              X01949306
               ATTRB=(ASKIP,NORM),                                     X01949406
               PICOUT='ZZZZZZZZZ',                                     X01949506
               COLOR=BLUE                                               01949606
ASTAT03 DFHMDF POS=(09,50),                                            X01949706
               LENGTH=02,                                              X01949806
               ATTRB=(ASKIP,NORM),                                     X01949906
               COLOR=BLUE                                               01950006
ADATE03 DFHMDF POS=(09,55),                                            X01951006
               LENGTH=10,                                              X01952006
               ATTRB=(ASKIP,NORM),                                     X01953006
               COLOR=BLUE                                               01954006
ADOOR03 DFHMDF POS=(09,66),                                            X01955008
               LENGTH=06,                                              X01956008
               ATTRB=(ASKIP,NORM),                                     X01957006
               COLOR=BLUE                                               01958006
ADEST03 DFHMDF POS=(09,76),                                            X01959006
               LENGTH=04,                                              X01959106
               ATTRB=(ASKIP,NORM),                                     X01959206
               PICOUT='Z999',                                          X01959306
               COLOR=BLUE                                               01959406
*********************************************************************** 01959506
ASEL04  DFHMDF POS=(10,01),                                            X01959606
               LENGTH=01,                                              X01959706
               ATTRB=(UNPROT,NORM),                                    X01959806
               HILIGHT=UNDERLINE,                                      X01959906
               COLOR=GREEN                                              01960006
AACT04  DFHMDF POS=(10,03),                                            X01961006
               LENGTH=03,                                              X01962006
               ATTRB=(ASKIP,NORM),                                     X01963006
               COLOR=BLUE                                               01964006
ASCAC04 DFHMDF POS=(10,07),                                            X01965006
               LENGTH=04,                                              X01966006
               ATTRB=(ASKIP,NORM),                                     X01967006
               COLOR=BLUE                                               01968006
ATRID04 DFHMDF POS=(10,12),                                            X01969006
               LENGTH=12,                                              X01969106
               ATTRB=(ASKIP,NORM),                                     X01969206
               COLOR=BLUE                                               01969306
ATRLR04 DFHMDF POS=(10,26),                                            X01969406
               LENGTH=09,                                              X01969506
               ATTRB=(ASKIP,NORM),                                     X01969606
               PICOUT='ZZZZZZZZZ',                                     X01969706
               COLOR=BLUE                                               01969806
ATRIP04 DFHMDF POS=(10,38),                                            X01969909
               LENGTH=09,                                              X01970006
               ATTRB=(ASKIP,NORM),                                     X01971006
               PICOUT='ZZZZZZZZZ',                                     X01972006
               COLOR=BLUE                                               01973006
ASTAT04 DFHMDF POS=(10,50),                                            X01974006
               LENGTH=02,                                              X01975006
               ATTRB=(ASKIP,NORM),                                     X01976006
               COLOR=BLUE                                               01977006
ADATE04 DFHMDF POS=(10,55),                                            X01978006
               LENGTH=10,                                              X01979006
               ATTRB=(ASKIP,NORM),                                     X01979106
               COLOR=BLUE                                               01979206
ADOOR04 DFHMDF POS=(10,66),                                            X01979308
               LENGTH=06,                                              X01979408
               ATTRB=(ASKIP,NORM),                                     X01979506
               COLOR=BLUE                                               01979606
ADEST04 DFHMDF POS=(10,76),                                            X01979706
               LENGTH=04,                                              X01979806
               ATTRB=(ASKIP,NORM),                                     X01979906
               PICOUT='Z999',                                          X01980006
               COLOR=BLUE                                               01981006
*********************************************************************** 01982006
ASEL05  DFHMDF POS=(11,01),                                            X01983006
               LENGTH=01,                                              X01984006
               ATTRB=(UNPROT,NORM),                                    X01985006
               HILIGHT=UNDERLINE,                                      X01986006
               COLOR=GREEN                                              01987006
AACT05  DFHMDF POS=(11,03),                                            X01988006
               LENGTH=03,                                              X01989006
               ATTRB=(ASKIP,NORM),                                     X01989106
               COLOR=BLUE                                               01989206
ASCAC05 DFHMDF POS=(11,07),                                            X01989306
               LENGTH=04,                                              X01989406
               ATTRB=(ASKIP,NORM),                                     X01989506
               COLOR=BLUE                                               01989606
ATRID05 DFHMDF POS=(11,12),                                            X01989706
               LENGTH=12,                                              X01989806
               ATTRB=(ASKIP,NORM),                                     X01989906
               COLOR=BLUE                                               01990006
ATRLR05 DFHMDF POS=(11,26),                                            X01991006
               LENGTH=09,                                              X01992006
               ATTRB=(ASKIP,NORM),                                     X01993006
               PICOUT='ZZZZZZZZZ',                                     X01994006
               COLOR=BLUE                                               01995006
ATRIP05 DFHMDF POS=(11,38),                                            X01996009
               LENGTH=09,                                              X01997006
               ATTRB=(ASKIP,NORM),                                     X01998006
               PICOUT='ZZZZZZZZZ',                                     X01999006
               COLOR=BLUE                                               01999106
ASTAT05 DFHMDF POS=(11,50),                                            X01999206
               LENGTH=02,                                              X01999306
               ATTRB=(ASKIP,NORM),                                     X01999406
               COLOR=BLUE                                               01999506
ADATE05 DFHMDF POS=(11,55),                                            X01999606
               LENGTH=10,                                              X01999706
               ATTRB=(ASKIP,NORM),                                     X01999806
               COLOR=BLUE                                               01999906
ADOOR05 DFHMDF POS=(11,66),                                            X02000008
               LENGTH=06,                                              X02001008
               ATTRB=(ASKIP,NORM),                                     X02002006
               COLOR=BLUE                                               02003006
ADEST05 DFHMDF POS=(11,76),                                            X02004006
               LENGTH=04,                                              X02005006
               ATTRB=(ASKIP,NORM),                                     X02006006
               PICOUT='Z999',                                          X02007006
               COLOR=BLUE                                               02008006
*********************************************************************** 02009006
ASEL06  DFHMDF POS=(12,01),                                            X02009106
               LENGTH=01,                                              X02009206
               ATTRB=(UNPROT,NORM),                                    X02009306
               HILIGHT=UNDERLINE,                                      X02009406
               COLOR=GREEN                                              02009506
AACT06  DFHMDF POS=(12,03),                                            X02009606
               LENGTH=03,                                              X02009706
               ATTRB=(ASKIP,NORM),                                     X02009806
               COLOR=BLUE                                               02009906
ASCAC06 DFHMDF POS=(12,07),                                            X02010006
               LENGTH=04,                                              X02011006
               ATTRB=(ASKIP,NORM),                                     X02012006
               COLOR=BLUE                                               02013006
ATRID06 DFHMDF POS=(12,12),                                            X02014006
               LENGTH=12,                                              X02015006
               ATTRB=(ASKIP,NORM),                                     X02016006
               COLOR=BLUE                                               02017006
ATRLR06 DFHMDF POS=(12,26),                                            X02018006
               LENGTH=09,                                              X02019006
               ATTRB=(ASKIP,NORM),                                     X02019106
               PICOUT='ZZZZZZZZZ',                                     X02019206
               COLOR=BLUE                                               02019306
ATRIP06 DFHMDF POS=(12,38),                                            X02019409
               LENGTH=09,                                              X02019506
               ATTRB=(ASKIP,NORM),                                     X02019606
               PICOUT='ZZZZZZZZZ',                                     X02019706
               COLOR=BLUE                                               02019806
ASTAT06 DFHMDF POS=(12,50),                                            X02019906
               LENGTH=02,                                              X02020006
               ATTRB=(ASKIP,NORM),                                     X02021006
               COLOR=BLUE                                               02022006
ADATE06 DFHMDF POS=(12,55),                                            X02023006
               LENGTH=10,                                              X02024006
               ATTRB=(ASKIP,NORM),                                     X02025006
               COLOR=BLUE                                               02026006
ADOOR06 DFHMDF POS=(12,66),                                            X02027008
               LENGTH=06,                                              X02028008
               ATTRB=(ASKIP,NORM),                                     X02029006
               COLOR=BLUE                                               02029106
ADEST06 DFHMDF POS=(12,76),                                            X02029206
               LENGTH=04,                                              X02029306
               ATTRB=(ASKIP,NORM),                                     X02029406
               PICOUT='Z999',                                          X02029506
               COLOR=BLUE                                               02029606
*********************************************************************** 02029706
ASEL07  DFHMDF POS=(13,01),                                            X02029806
               LENGTH=01,                                              X02029906
               ATTRB=(UNPROT,NORM),                                    X02030006
               HILIGHT=UNDERLINE,                                      X02031006
               COLOR=GREEN                                              02032006
AACT07  DFHMDF POS=(13,03),                                            X02033006
               LENGTH=03,                                              X02034006
               ATTRB=(ASKIP,NORM),                                     X02035006
               COLOR=BLUE                                               02036006
ASCAC07 DFHMDF POS=(13,07),                                            X02037006
               LENGTH=04,                                              X02038006
               ATTRB=(ASKIP,NORM),                                     X02039006
               COLOR=BLUE                                               02039106
ATRID07 DFHMDF POS=(13,12),                                            X02039206
               LENGTH=12,                                              X02039306
               ATTRB=(ASKIP,NORM),                                     X02039406
               COLOR=BLUE                                               02039506
ATRLR07 DFHMDF POS=(13,26),                                            X02039606
               LENGTH=09,                                              X02039706
               ATTRB=(ASKIP,NORM),                                     X02039806
               PICOUT='ZZZZZZZZZ',                                     X02039906
               COLOR=BLUE                                               02040006
ATRIP07 DFHMDF POS=(13,38),                                            X02041009
               LENGTH=09,                                              X02042006
               ATTRB=(ASKIP,NORM),                                     X02043006
               PICOUT='ZZZZZZZZZ',                                     X02044006
               COLOR=BLUE                                               02045006
ASTAT07 DFHMDF POS=(13,50),                                            X02046006
               LENGTH=02,                                              X02047006
               ATTRB=(ASKIP,NORM),                                     X02048006
               COLOR=BLUE                                               02049006
ADATE07 DFHMDF POS=(13,55),                                            X02049106
               LENGTH=10,                                              X02049206
               ATTRB=(ASKIP,NORM),                                     X02049306
               COLOR=BLUE                                               02049406
ADOOR07 DFHMDF POS=(13,66),                                            X02049508
               LENGTH=06,                                              X02049608
               ATTRB=(ASKIP,NORM),                                     X02049706
               COLOR=BLUE                                               02049806
ADEST07 DFHMDF POS=(13,76),                                            X02049906
               LENGTH=04,                                              X02050006
               ATTRB=(ASKIP,NORM),                                     X02051006
               PICOUT='Z999',                                          X02052006
               COLOR=BLUE                                               02053006
*********************************************************************** 02054006
ASEL08  DFHMDF POS=(14,01),                                            X02055006
               LENGTH=01,                                              X02056006
               ATTRB=(UNPROT,NORM),                                    X02057006
               HILIGHT=UNDERLINE,                                      X02058006
               COLOR=GREEN                                              02059006
AACT08  DFHMDF POS=(14,03),                                            X02059106
               LENGTH=03,                                              X02059206
               ATTRB=(ASKIP,NORM),                                     X02059306
               COLOR=BLUE                                               02059406
ASCAC08 DFHMDF POS=(14,07),                                            X02059506
               LENGTH=04,                                              X02059606
               ATTRB=(ASKIP,NORM),                                     X02059706
               COLOR=BLUE                                               02059806
ATRID08 DFHMDF POS=(14,12),                                            X02059906
               LENGTH=12,                                              X02060006
               ATTRB=(ASKIP,NORM),                                     X02061006
               COLOR=BLUE                                               02062006
ATRLR08 DFHMDF POS=(14,26),                                            X02063006
               LENGTH=09,                                              X02064006
               ATTRB=(ASKIP,NORM),                                     X02065006
               PICOUT='ZZZZZZZZZ',                                     X02066006
               COLOR=BLUE                                               02067006
ATRIP08 DFHMDF POS=(14,38),                                            X02068009
               LENGTH=09,                                              X02069006
               ATTRB=(ASKIP,NORM),                                     X02069106
               PICOUT='ZZZZZZZZZ',                                     X02069206
               COLOR=BLUE                                               02069306
ASTAT08 DFHMDF POS=(14,50),                                            X02069406
               LENGTH=02,                                              X02069506
               ATTRB=(ASKIP,NORM),                                     X02069606
               COLOR=BLUE                                               02069706
ADATE08 DFHMDF POS=(14,55),                                            X02069806
               LENGTH=10,                                              X02069906
               ATTRB=(ASKIP,NORM),                                     X02070006
               COLOR=BLUE                                               02071006
ADOOR08 DFHMDF POS=(14,66),                                            X02072008
               LENGTH=06,                                              X02073008
               ATTRB=(ASKIP,NORM),                                     X02074006
               COLOR=BLUE                                               02075006
ADEST08 DFHMDF POS=(14,76),                                            X02076006
               LENGTH=04,                                              X02077006
               ATTRB=(ASKIP,NORM),                                     X02078006
               PICOUT='Z999',                                          X02079006
               COLOR=BLUE                                               02079106
*********************************************************************** 02079206
ASEL09  DFHMDF POS=(15,01),                                            X02079306
               LENGTH=01,                                              X02079406
               ATTRB=(UNPROT,NORM),                                    X02079506
               HILIGHT=UNDERLINE,                                      X02079606
               COLOR=GREEN                                              02079706
AACT09  DFHMDF POS=(15,03),                                            X02079806
               LENGTH=03,                                              X02079906
               ATTRB=(ASKIP,NORM),                                     X02080006
               COLOR=BLUE                                               02081006
ASCAC09 DFHMDF POS=(15,07),                                            X02082006
               LENGTH=04,                                              X02083006
               ATTRB=(ASKIP,NORM),                                     X02084006
               COLOR=BLUE                                               02085006
ATRID09 DFHMDF POS=(15,12),                                            X02086006
               LENGTH=12,                                              X02087006
               ATTRB=(ASKIP,NORM),                                     X02088006
               COLOR=BLUE                                               02089006
ATRLR09 DFHMDF POS=(15,26),                                            X02089106
               LENGTH=09,                                              X02089206
               ATTRB=(ASKIP,NORM),                                     X02089306
               PICOUT='ZZZZZZZZZ',                                     X02089406
               COLOR=BLUE                                               02089506
ATRIP09 DFHMDF POS=(15,38),                                            X02089609
               LENGTH=09,                                              X02089706
               ATTRB=(ASKIP,NORM),                                     X02089806
               PICOUT='ZZZZZZZZZ',                                     X02089906
               COLOR=BLUE                                               02090006
ASTAT09 DFHMDF POS=(15,50),                                            X02091006
               LENGTH=02,                                              X02092006
               ATTRB=(ASKIP,NORM),                                     X02093006
               COLOR=BLUE                                               02094006
ADATE09 DFHMDF POS=(15,55),                                            X02095006
               LENGTH=10,                                              X02096006
               ATTRB=(ASKIP,NORM),                                     X02097006
               COLOR=BLUE                                               02098006
ADOOR09 DFHMDF POS=(15,66),                                            X02099008
               LENGTH=06,                                              X02099108
               ATTRB=(ASKIP,NORM),                                     X02099206
               COLOR=BLUE                                               02099306
ADEST09 DFHMDF POS=(15,76),                                            X02099406
               LENGTH=04,                                              X02099506
               ATTRB=(ASKIP,NORM),                                     X02099606
               PICOUT='Z999',                                          X02099706
               COLOR=BLUE                                               02099806
*********************************************************************** 02099906
ASEL10  DFHMDF POS=(16,01),                                            X02100006
               LENGTH=01,                                              X02101006
               ATTRB=(UNPROT,NORM),                                    X02102006
               HILIGHT=UNDERLINE,                                      X02103006
               COLOR=GREEN                                              02104006
AACT10  DFHMDF POS=(16,03),                                            X02105006
               LENGTH=03,                                              X02106006
               ATTRB=(ASKIP,NORM),                                     X02107006
               COLOR=BLUE                                               02108006
ASCAC10 DFHMDF POS=(16,07),                                            X02109006
               LENGTH=04,                                              X02109106
               ATTRB=(ASKIP,NORM),                                     X02109206
               COLOR=BLUE                                               02109306
ATRID10 DFHMDF POS=(16,12),                                            X02109406
               LENGTH=12,                                              X02109506
               ATTRB=(ASKIP,NORM),                                     X02109606
               COLOR=BLUE                                               02109706
ATRLR10 DFHMDF POS=(16,26),                                            X02109806
               LENGTH=09,                                              X02109906
               ATTRB=(ASKIP,NORM),                                     X02110006
               PICOUT='ZZZZZZZZZ',                                     X02111006
               COLOR=BLUE                                               02112006
ATRIP10 DFHMDF POS=(16,38),                                            X02113009
               LENGTH=09,                                              X02114006
               ATTRB=(ASKIP,NORM),                                     X02115006
               PICOUT='ZZZZZZZZZ',                                     X02116006
               COLOR=BLUE                                               02117006
ASTAT10 DFHMDF POS=(16,50),                                            X02118006
               LENGTH=02,                                              X02119006
               ATTRB=(ASKIP,NORM),                                     X02119106
               COLOR=BLUE                                               02119206
ADATE10 DFHMDF POS=(16,55),                                            X02119306
               LENGTH=10,                                              X02119406
               ATTRB=(ASKIP,NORM),                                     X02119506
               COLOR=BLUE                                               02119606
ADOOR10 DFHMDF POS=(16,66),                                            X02119708
               LENGTH=06,                                              X02119808
               ATTRB=(ASKIP,NORM),                                     X02119906
               COLOR=BLUE                                               02120006
ADEST10 DFHMDF POS=(16,76),                                            X02121006
               LENGTH=04,                                              X02122006
               ATTRB=(ASKIP,NORM),                                     X02123006
               PICOUT='Z999',                                          X02124006
               COLOR=BLUE                                               02125006
*********************************************************************** 02126006
ASEL11  DFHMDF POS=(17,01),                                            X02127006
               LENGTH=01,                                              X02128006
               ATTRB=(UNPROT,NORM),                                    X02129006
               HILIGHT=UNDERLINE,                                      X02129106
               COLOR=GREEN                                              02129206
AACT11  DFHMDF POS=(17,03),                                            X02129306
               LENGTH=03,                                              X02129406
               ATTRB=(ASKIP,NORM),                                     X02129506
               COLOR=BLUE                                               02129606
ASCAC11 DFHMDF POS=(17,07),                                            X02129706
               LENGTH=04,                                              X02129806
               ATTRB=(ASKIP,NORM),                                     X02129906
               COLOR=BLUE                                               02130006
ATRID11 DFHMDF POS=(17,12),                                            X02131006
               LENGTH=12,                                              X02132006
               ATTRB=(ASKIP,NORM),                                     X02133006
               COLOR=BLUE                                               02134006
ATRLR11 DFHMDF POS=(17,26),                                            X02135006
               LENGTH=09,                                              X02136006
               ATTRB=(ASKIP,NORM),                                     X02137006
               PICOUT='ZZZZZZZZZ',                                     X02138006
               COLOR=BLUE                                               02139006
ATRIP11 DFHMDF POS=(17,38),                                            X02139109
               LENGTH=09,                                              X02139206
               ATTRB=(ASKIP,NORM),                                     X02139306
               PICOUT='ZZZZZZZZZ',                                     X02139406
               COLOR=BLUE                                               02139506
ASTAT11 DFHMDF POS=(17,50),                                            X02139606
               LENGTH=02,                                              X02139706
               ATTRB=(ASKIP,NORM),                                     X02139806
               COLOR=BLUE                                               02139906
ADATE11 DFHMDF POS=(17,55),                                            X02140006
               LENGTH=10,                                              X02141006
               ATTRB=(ASKIP,NORM),                                     X02142006
               COLOR=BLUE                                               02143006
ADOOR11 DFHMDF POS=(17,66),                                            X02144008
               LENGTH=06,                                              X02145008
               ATTRB=(ASKIP,NORM),                                     X02146006
               COLOR=BLUE                                               02147006
ADEST11 DFHMDF POS=(17,76),                                            X02148006
               LENGTH=04,                                              X02149006
               ATTRB=(ASKIP,NORM),                                     X02149106
               PICOUT='Z999',                                          X02149206
               COLOR=BLUE                                               02149306
*********************************************************************** 02149406
ASEL12  DFHMDF POS=(18,01),                                            X02149506
               LENGTH=01,                                              X02149606
               ATTRB=(UNPROT,NORM),                                    X02149706
               HILIGHT=UNDERLINE,                                      X02149806
               COLOR=GREEN                                              02149906
AACT12  DFHMDF POS=(18,03),                                            X02150006
               LENGTH=03,                                              X02151006
               ATTRB=(ASKIP,NORM),                                     X02152006
               COLOR=BLUE                                               02153006
ASCAC12 DFHMDF POS=(18,07),                                            X02154006
               LENGTH=04,                                              X02155006
               ATTRB=(ASKIP,NORM),                                     X02156006
               COLOR=BLUE                                               02157006
ATRID12 DFHMDF POS=(18,12),                                            X02158006
               LENGTH=12,                                              X02159006
               ATTRB=(ASKIP,NORM),                                     X02159106
               COLOR=BLUE                                               02159206
ATRLR12 DFHMDF POS=(18,26),                                            X02159306
               LENGTH=09,                                              X02159406
               ATTRB=(ASKIP,NORM),                                     X02159506
               PICOUT='ZZZZZZZZZ',                                     X02159606
               COLOR=BLUE                                               02159706
ATRIP12 DFHMDF POS=(18,38),                                            X02159809
               LENGTH=09,                                              X02159906
               ATTRB=(ASKIP,NORM),                                     X02160006
               PICOUT='ZZZZZZZZZ',                                     X02161006
               COLOR=BLUE                                               02162006
ASTAT12 DFHMDF POS=(18,50),                                            X02163006
               LENGTH=02,                                              X02164006
               ATTRB=(ASKIP,NORM),                                     X02165006
               COLOR=BLUE                                               02166006
ADATE12 DFHMDF POS=(18,55),                                            X02167006
               LENGTH=10,                                              X02168006
               ATTRB=(ASKIP,NORM),                                     X02169006
               COLOR=BLUE                                               02169106
ADOOR12 DFHMDF POS=(18,66),                                            X02169208
               LENGTH=06,                                              X02169308
               ATTRB=(ASKIP,NORM),                                     X02169406
               COLOR=BLUE                                               02169506
ADEST12 DFHMDF POS=(18,76),                                            X02169606
               LENGTH=04,                                              X02169706
               ATTRB=(ASKIP,NORM),                                     X02169806
               PICOUT='Z999',                                          X02169906
               COLOR=BLUE                                               02170006
*********************************************************************** 02180006
*********************************************************************** 02320001
*********************************************************************** 07720001
        DFHMDF POS=(19,45),                                            X07730001
               LENGTH=25,                                              X07740001
               ATTRB=(ASKIP,NORM),                                     X07750001
               COLOR=NEUTRAL,                                          X07760001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      07770001
ASELIT  DFHMDF POS=(19,72),                                            X07780001
               LENGTH=07,                                              X07790001
               ATTRB=(ASKIP,NORM),                                     X07800001
               COLOR=BLUE,                                             X07810001
               PICOUT='ZZZ,ZZ9'                                         07820001
        DFHMSD TYPE=FINAL                                               07830001
        END                                                             07840001
