*          DATA SET SUKM755    AT LEVEL 002 AS OF 04/13/00              00030001
        PRINT  NOGEN                                                    00040001
*-------------------------------------------------------------------*   00050001
*                                                                   *   00060001
*        MAPSET  SUKM755                                            *   00070001
*        MAP     SUK755                                             *   00080001
*        PROGRAM SUKCS755                                           *   00090001
*        TRANSID S755 - STORE UNIT ADJ ACTIVITY BY PO/REC/LINE      *   00100001
*                                                                   *   00110001
*-------------------------------------------------------------------*   00120001
SUKM755 DFHMSD TYPE=DSECT,                                             X00130001
               LANG=COBOL,                                             X00140001
               MODE=INOUT,                                             X00150001
               STORAGE=AUTO,                                           X00160001
               TERM=3270-2,                                            X00170001
               TIOAPFX=YES                                              00180001
*********************************************************************** 00190001
SU755A  DFHMDI LINE=2,COLUMN=1,                                        X00200001
               SIZE=(19,80),                                           X00210001
               CTRL=(FREEKB),                                          X00220001
               MAPATTS=(COLOR,HILIGHT),                                X00230001
               DSATTS=(COLOR,HILIGHT)                                   00240001
*********************************************************************** 00250001
        DFHMDF POS=(02,01),                                            X00260001
               LENGTH=19,                                              X00270012
               ATTRB=(ASKIP,NORM),                                     X00280001
               COLOR=NEUTRAL,                                          X00290001
               INITIAL='UNIT ADJUST TYPE..:'                            00300012
AADJTYP DFHMDF POS=(02,22),                                            X00310012
               LENGTH=17,                                              X00320001
               ATTRB=(ASKIP,NORM),                                     X00330001
               COLOR=BLUE                                               00340001
        DFHMDF POS=(02,52),                                            X00350012
               LENGTH=14,                                              X00360001
               ATTRB=(ASKIP,NORM),                                     X00370001
               COLOR=NEUTRAL,                                          X00380001
               INITIAL='FROM DATE....:'                                 00390010
AFRDATE DFHMDF POS=(02,68),                                            X00400012
               LENGTH=10,                                              X00410001
               ATTRB=(ASKIP,NORM),                                     X00420001
               COLOR=BLUE                                               00430001
*********************************************************************** 00440001
        DFHMDF POS=(03,01),                                            X00450001
               LENGTH=19,                                              X00460012
               ATTRB=(ASKIP,NORM),                                     X00470001
               COLOR=NEUTRAL,                                          X00480001
               INITIAL='FAIL/SUCCESS/UNACK:'                            00490012
ASTATUS DFHMDF POS=(03,22),                                            X00500012
               LENGTH=17,                                              X00510001
               ATTRB=(ASKIP,NORM),                                     X00520001
               COLOR=BLUE                                               00530001
        DFHMDF POS=(03,52),                                            X00531012
               LENGTH=14,                                              X00532001
               ATTRB=(ASKIP,NORM),                                     X00533001
               COLOR=NEUTRAL,                                          X00534001
               INITIAL='TO DATE......:'                                 00535001
ATODATE DFHMDF POS=(03,68),                                            X00536012
               LENGTH=10,                                              X00537001
               ATTRB=(ASKIP,NORM),                                     X00538001
               COLOR=BLUE                                               00539001
*********************************************************************** 00539101
        DFHMDF POS=(04,01),                                            X00539201
               LENGTH=19,                                              X00539312
               ATTRB=(ASKIP,NORM),                                     X00539401
               COLOR=NEUTRAL,                                          X00539501
               INITIAL='DESTINATION STORE.:'                            00539612
ASTORE  DFHMDF POS=(04,22),                                            X00539712
               LENGTH=25,                                              X00539813
               ATTRB=(ASKIP,NORM),                                     X00539901
               COLOR=BLUE                                               00540101
        DFHMDF POS=(04,52),                                            X00540212
               LENGTH=14,                                              X00540301
               ATTRB=(ASKIP,NORM),                                     X00540401
               COLOR=NEUTRAL,                                          X00540501
               INITIAL='TOTAL NET ADJ:'                                 00540601
ANETADJ DFHMDF POS=(04,68),                                            X00540712
               LENGTH=10,                                              X00540801
               ATTRB=(ASKIP,NORM),                                     X00540901
               PICOUT='ZZZZZZZZ9-',                                    X00541019
               COLOR=BLUE                                               00541101
*********************************************************************** 00542001
        DFHMDF POS=(05,01),                                            X00543020
               LENGTH=19,                                              X00544020
               ATTRB=(ASKIP,NORM),                                     X00545020
               COLOR=NEUTRAL,                                          X00546020
               INITIAL='PROCESS GROUP.....:'                            00547020
AGROUP  DFHMDF POS=(05,22),                                            X00548020
               LENGTH=25,                                              X00549020
               ATTRB=(ASKIP,NORM),                                     X00550020
               COLOR=BLUE                                               00560020
        DFHMDF POS=(05,50),                                            X01260001
               LENGTH=05,                                              X01270001
               ATTRB=(ASKIP,NORM),                                     X01280001
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01290001
ASTRTIT DFHMDF POS=(05,56),                                            X01300001
               LENGTH=05,                                              X01310001
               ATTRB=(NUM,UNPROT,NORM),                                X01320001
               COLOR=GREEN,                                            X01330001
               PICOUT='ZZZZ9',                                         X01340001
               HILIGHT=UNDERLINE                                        01350001
        DFHMDF POS=(05,62),                                            X01360001
               LENGTH=02,                                              X01370001
               ATTRB=(ASKIP,NORM),                                     X01380001
               COLOR=NEUTRAL,                                          X01390001
               INITIAL='TO'                                             01400001
AENDIT  DFHMDF POS=(05,65),                                            X01410001
               LENGTH=05,                                              X01420001
               ATTRB=(ASKIP,NORM),                                     X01430001
               COLOR=BLUE,                                             X01440001
               PICOUT='ZZZZ9'                                           01450001
        DFHMDF POS=(05,71),                                            X01460001
               LENGTH=02,                                              X01470001
               ATTRB=(ASKIP,NORM),                                     X01480001
               COLOR=NEUTRAL,                                          X01490001
               INITIAL='OF'                                             01500001
ATOTIT  DFHMDF POS=(05,74),                                            X01510001
               LENGTH=05,                                              X01520001
               ATTRB=(ASKIP,NORM),                                     X01530001
               COLOR=BLUE,                                             X01540001
               PICOUT='ZZZZ9'                                           01550001
*********************************************************************** 01560001
        DFHMDF POS=(06,65),                                            X01570009
               LENGTH=06,                                              X01580001
               ATTRB=(ASKIP,NORM),                                     X01590001
               COLOR=NEUTRAL,                                          X01600001
               INITIAL='ADJUST'                                         01610001
        DFHMDF POS=(06,73),                                            X01620009
               LENGTH=02,                                              X01630001
               ATTRB=(ASKIP,NORM),                                     X01640001
               COLOR=NEUTRAL,                                          X01650001
               INITIAL='F/'                                             01660001
*********************************************************************** 01670001
        DFHMDF POS=(07,01),                                            X01680001
               LENGTH=01,                                              X01690001
               ATTRB=(ASKIP,NORM),                                     X01700001
               COLOR=NEUTRAL,                                          X01710001
               INITIAL='S'                                              01720001
        DFHMDF POS=(07,03),                                            X01730001
               LENGTH=03,                                              X01740001
               ATTRB=(ASKIP,NORM),                                     X01750001
               COLOR=NEUTRAL,                                          X01760001
               INITIAL='ACT'                                            01761001
        DFHMDF POS=(07,07),                                            X01762001
               LENGTH=04,                                              X01763001
               ATTRB=(ASKIP,NORM),                                     X01764001
               COLOR=NEUTRAL,                                          X01765001
               INITIAL='OPER'                                           01766001
        DFHMDF POS=(07,13),                                            X01767001
               LENGTH=11,                                              X01768001
               ATTRB=(ASKIP,NORM),                                     X01769001
               COLOR=NEUTRAL,                                          X01769101
               INITIAL='PO-RECEIVER'                                    01769201
        DFHMDF POS=(07,26),                                            X01769301
               LENGTH=04,                                              X01769401
               ATTRB=(ASKIP,NORM),                                     X01769501
               COLOR=NEUTRAL,                                          X01769601
               INITIAL='LINE'                                           01769701
        DFHMDF POS=(07,34),                                            X01770317
               LENGTH=10,                                              X01770414
               ATTRB=(ASKIP,NORM),                                     X01770501
               COLOR=NEUTRAL,                                          X01770601
               INITIAL='UPC NUMBER'                                     01770711
        DFHMDF POS=(07,49),                                            X01770816
               LENGTH=03,                                              X01770916
               ATTRB=(ASKIP,NORM),                                     X01771016
               COLOR=NEUTRAL,                                          X01771116
               INITIAL='SKU'                                            01771216
        DFHMDF POS=(07,56),                                            X01771301
               LENGTH=07,                                              X01771401
               ATTRB=(ASKIP,NORM),                                     X01771501
               COLOR=NEUTRAL,                                          X01771601
               INITIAL='NET ADJ'                                        01771701
        DFHMDF POS=(07,65),                                            X01771801
               LENGTH=06,                                              X01771901
               ATTRB=(ASKIP,NORM),                                     X01772001
               COLOR=NEUTRAL,                                          X01772101
               INITIAL='SOURCE'                                         01772201
        DFHMDF POS=(07,73),                                            X01772301
               LENGTH=01,                                              X01772401
               ATTRB=(ASKIP,NORM),                                     X01772501
               COLOR=NEUTRAL,                                          X01772601
               INITIAL='S'                                              01772701
        DFHMDF POS=(07,76),                                            X01772801
               LENGTH=03,                                              X01772901
               ATTRB=(ASKIP,NORM),                                     X01773001
               COLOR=NEUTRAL,                                          X01773101
               INITIAL='ACK'                                            01773201
*********************************************************************** 01774001
ASEL01  DFHMDF POS=(08,01),                                            X01780001
               LENGTH=01,                                              X01790008
               ATTRB=(UNPROT),                                         X01800006
               HILIGHT=UNDERLINE,                                      X01801001
               COLOR=GREEN                                              01810001
AACT01  DFHMDF POS=(08,03),                                            X01820001
               LENGTH=03,                                              X01830001
               ATTRB=(ASKIP,NORM),                                     X01840001
               COLOR=BLUE                                               01850001
AOPER01 DFHMDF POS=(08,07),                                            X01860001
               LENGTH=04,                                              X01870001
               ATTRB=(ASKIP,NORM),                                     X01880001
               COLOR=BLUE                                               01890001
APORC01 DFHMDF POS=(08,12),                                            X01900001
               LENGTH=13,                                              X01910001
               ATTRB=(ASKIP,NORM),                                     X01920001
               COLOR=BLUE                                               01930001
ALINE01 DFHMDF POS=(08,26),                                            X01940001
               LENGTH=04,                                              X01950001
               ATTRB=(ASKIP,NORM),                                     X01960001
               COLOR=BLUE                                               01970001
AUPC01  DFHMDF POS=(08,31),                                            X01975016
               LENGTH=15,                                              X01976001
               ATTRB=(ASKIP,NORM),                                     X01977001
               COLOR=BLUE                                               01978001
ASKU01  DFHMDF POS=(08,47),                                            X01978116
               LENGTH=08,                                              X01978216
               ATTRB=(ASKIP,NORM),                                     X01978316
               COLOR=BLUE                                               01978416
ANADJ01 DFHMDF POS=(08,56),                                            X01979001
               LENGTH=07,                                              X01979101
               ATTRB=(ASKIP,NORM),                                     X01979201
               COLOR=BLUE                                               01979301
ASORC01 DFHMDF POS=(08,64),                                            X01979401
               LENGTH=08,                                              X01979501
               ATTRB=(ASKIP,NORM),                                     X01979601
               COLOR=BLUE                                               01979701
AFLSC01 DFHMDF POS=(08,73),                                            X01979801
               LENGTH=01,                                              X01979901
               ATTRB=(ASKIP,NORM),                                     X01980001
               COLOR=BLUE                                               01980101
AACK01  DFHMDF POS=(08,77),                                            X01980202
               LENGTH=01,                                              X01980301
               ATTRB=(ASKIP,NORM),                                     X01980401
               COLOR=BLUE                                               01980501
*********************************************************************** 01980601
ASEL02  DFHMDF POS=(09,01),                                            X01980701
               LENGTH=01,                                              X01980808
               ATTRB=(UNPROT),                                         X01980906
               HILIGHT=UNDERLINE,                                      X01981001
               COLOR=GREEN                                              01982001
AACT02  DFHMDF POS=(09,03),                                            X01983001
               LENGTH=03,                                              X01984001
               ATTRB=(ASKIP,NORM),                                     X01985001
               COLOR=BLUE                                               01986001
AOPER02 DFHMDF POS=(09,07),                                            X01987001
               LENGTH=04,                                              X01988001
               ATTRB=(ASKIP,NORM),                                     X01989001
               COLOR=BLUE                                               01990001
APORC02 DFHMDF POS=(09,12),                                            X02000001
               LENGTH=13,                                              X02010001
               ATTRB=(ASKIP,NORM),                                     X02020001
               COLOR=BLUE                                               02030001
ALINE02 DFHMDF POS=(09,26),                                            X02040001
               LENGTH=04,                                              X02050001
               ATTRB=(ASKIP,NORM),                                     X02060001
               COLOR=BLUE                                               02070001
AUPC02  DFHMDF POS=(09,31),                                            X02120016
               LENGTH=15,                                              X02130001
               ATTRB=(ASKIP,NORM),                                     X02140001
               COLOR=BLUE                                               02150001
ASKU02  DFHMDF POS=(09,47),                                            X02151016
               LENGTH=08,                                              X02152016
               ATTRB=(ASKIP,NORM),                                     X02153016
               COLOR=BLUE                                               02154016
ANADJ02 DFHMDF POS=(09,56),                                            X02160001
               LENGTH=07,                                              X02170001
               ATTRB=(ASKIP,NORM),                                     X02180001
               COLOR=BLUE                                               02190001
ASORC02 DFHMDF POS=(09,64),                                            X02200001
               LENGTH=08,                                              X02210001
               ATTRB=(ASKIP,NORM),                                     X02220001
               COLOR=BLUE                                               02230001
AFLSC02 DFHMDF POS=(09,73),                                            X02240001
               LENGTH=01,                                              X02250001
               ATTRB=(ASKIP,NORM),                                     X02260001
               COLOR=BLUE                                               02270001
AACK02  DFHMDF POS=(09,77),                                            X02280002
               LENGTH=01,                                              X02290001
               ATTRB=(ASKIP,NORM),                                     X02300001
               COLOR=BLUE                                               02310001
*********************************************************************** 02320001
ASEL03  DFHMDF POS=(10,01),                                            X02330001
               LENGTH=01,                                              X02340008
               ATTRB=(UNPROT),                                         X02350006
               HILIGHT=UNDERLINE,                                      X02360001
               COLOR=GREEN                                              02370001
AACT03  DFHMDF POS=(10,03),                                            X02380001
               LENGTH=03,                                              X02390001
               ATTRB=(ASKIP,NORM),                                     X02400001
               COLOR=BLUE                                               02410001
AOPER03 DFHMDF POS=(10,07),                                            X02420001
               LENGTH=04,                                              X02430001
               ATTRB=(ASKIP,NORM),                                     X02440001
               COLOR=BLUE                                               02450001
APORC03 DFHMDF POS=(10,12),                                            X02460001
               LENGTH=13,                                              X02470001
               ATTRB=(ASKIP,NORM),                                     X02480001
               COLOR=BLUE                                               02490001
ALINE03 DFHMDF POS=(10,26),                                            X02500001
               LENGTH=04,                                              X02510001
               ATTRB=(ASKIP,NORM),                                     X02520001
               COLOR=BLUE                                               02530001
AUPC03  DFHMDF POS=(10,31),                                            X02580016
               LENGTH=15,                                              X02590001
               ATTRB=(ASKIP,NORM),                                     X02600001
               COLOR=BLUE                                               02610001
ASKU03  DFHMDF POS=(10,47),                                            X02611016
               LENGTH=08,                                              X02612016
               ATTRB=(ASKIP,NORM),                                     X02613016
               COLOR=BLUE                                               02614016
ANADJ03 DFHMDF POS=(10,56),                                            X02620001
               LENGTH=07,                                              X02630001
               ATTRB=(ASKIP,NORM),                                     X02640001
               COLOR=BLUE                                               02650001
ASORC03 DFHMDF POS=(10,64),                                            X02660001
               LENGTH=08,                                              X02670001
               ATTRB=(ASKIP,NORM),                                     X02680001
               COLOR=BLUE                                               02690001
AFLSC03 DFHMDF POS=(10,73),                                            X02700001
               LENGTH=01,                                              X02710001
               ATTRB=(ASKIP,NORM),                                     X02720001
               COLOR=BLUE                                               02730001
AACK03  DFHMDF POS=(10,77),                                            X02740002
               LENGTH=01,                                              X02750001
               ATTRB=(ASKIP,NORM),                                     X02760001
               COLOR=BLUE                                               02770001
*********************************************************************** 02780001
ASEL04  DFHMDF POS=(11,01),                                            X02790003
               LENGTH=01,                                              X02800008
               ATTRB=(UNPROT),                                         X02810006
               HILIGHT=UNDERLINE,                                      X02820001
               COLOR=GREEN                                              02830001
AACT04  DFHMDF POS=(11,03),                                            X02840003
               LENGTH=03,                                              X02850001
               ATTRB=(ASKIP,NORM),                                     X02860001
               COLOR=BLUE                                               02870001
AOPER04 DFHMDF POS=(11,07),                                            X02880003
               LENGTH=04,                                              X02890001
               ATTRB=(ASKIP,NORM),                                     X02900001
               COLOR=BLUE                                               02910001
APORC04 DFHMDF POS=(11,12),                                            X02920003
               LENGTH=13,                                              X02930001
               ATTRB=(ASKIP,NORM),                                     X02940001
               COLOR=BLUE                                               02950001
ALINE04 DFHMDF POS=(11,26),                                            X02960003
               LENGTH=04,                                              X02970001
               ATTRB=(ASKIP,NORM),                                     X02980001
               COLOR=BLUE                                               02990001
AUPC04  DFHMDF POS=(11,31),                                            X03040016
               LENGTH=15,                                              X03050001
               ATTRB=(ASKIP,NORM),                                     X03060001
               COLOR=BLUE                                               03070001
ASKU04  DFHMDF POS=(11,47),                                            X03071016
               LENGTH=08,                                              X03072016
               ATTRB=(ASKIP,NORM),                                     X03073016
               COLOR=BLUE                                               03074016
ANADJ04 DFHMDF POS=(11,56),                                            X03080003
               LENGTH=07,                                              X03090001
               ATTRB=(ASKIP,NORM),                                     X03100001
               COLOR=BLUE                                               03110001
ASORC04 DFHMDF POS=(11,64),                                            X03120003
               LENGTH=08,                                              X03130001
               ATTRB=(ASKIP,NORM),                                     X03140001
               COLOR=BLUE                                               03150001
AFLSC04 DFHMDF POS=(11,73),                                            X03160003
               LENGTH=01,                                              X03170003
               ATTRB=(ASKIP,NORM),                                     X03180001
               COLOR=BLUE                                               03190001
AACK04  DFHMDF POS=(11,77),                                            X03200003
               LENGTH=01,                                              X03210001
               ATTRB=(ASKIP,NORM),                                     X03220001
               COLOR=BLUE                                               03230001
*********************************************************************** 03240001
ASEL05  DFHMDF POS=(12,01),                                            X03250003
               LENGTH=01,                                              X03260008
               ATTRB=(UNPROT),                                         X03270006
               HILIGHT=UNDERLINE,                                      X03280001
               COLOR=GREEN                                              03290001
AACT05  DFHMDF POS=(12,03),                                            X03300003
               LENGTH=03,                                              X03310001
               ATTRB=(ASKIP,NORM),                                     X03320001
               COLOR=BLUE                                               03330001
AOPER05 DFHMDF POS=(12,07),                                            X03340003
               LENGTH=04,                                              X03350001
               ATTRB=(ASKIP,NORM),                                     X03360001
               COLOR=BLUE                                               03370001
APORC05 DFHMDF POS=(12,12),                                            X03380003
               LENGTH=13,                                              X03390001
               ATTRB=(ASKIP,NORM),                                     X03400001
               COLOR=BLUE                                               03410001
ALINE05 DFHMDF POS=(12,26),                                            X03420003
               LENGTH=04,                                              X03430001
               ATTRB=(ASKIP,NORM),                                     X03440001
               COLOR=BLUE                                               03450001
AUPC05  DFHMDF POS=(12,31),                                            X03500016
               LENGTH=15,                                              X03510001
               ATTRB=(ASKIP,NORM),                                     X03520001
               COLOR=BLUE                                               03530001
ASKU05  DFHMDF POS=(12,47),                                            X03531016
               LENGTH=08,                                              X03532016
               ATTRB=(ASKIP,NORM),                                     X03533016
               COLOR=BLUE                                               03534016
ANADJ05 DFHMDF POS=(12,56),                                            X03540003
               LENGTH=07,                                              X03550001
               ATTRB=(ASKIP,NORM),                                     X03560001
               COLOR=BLUE                                               03570001
ASORC05 DFHMDF POS=(12,64),                                            X03580003
               LENGTH=08,                                              X03590001
               ATTRB=(ASKIP,NORM),                                     X03600001
               COLOR=BLUE                                               03610001
AFLSC05 DFHMDF POS=(12,73),                                            X03620003
               LENGTH=01,                                              X03630001
               ATTRB=(ASKIP,NORM),                                     X03640001
               COLOR=BLUE                                               03650001
AACK05  DFHMDF POS=(12,77),                                            X03660003
               LENGTH=01,                                              X03670003
               ATTRB=(ASKIP,NORM),                                     X03680001
               COLOR=BLUE                                               03690001
*********************************************************************** 03700001
ASEL06  DFHMDF POS=(13,01),                                            X03710003
               LENGTH=01,                                              X03720008
               ATTRB=(UNPROT),                                         X03730006
               HILIGHT=UNDERLINE,                                      X03740001
               COLOR=GREEN                                              03750001
AACT06  DFHMDF POS=(13,03),                                            X03760003
               LENGTH=03,                                              X03770001
               ATTRB=(ASKIP,NORM),                                     X03780001
               COLOR=BLUE                                               03790001
AOPER06 DFHMDF POS=(13,07),                                            X03800003
               LENGTH=04,                                              X03810001
               ATTRB=(ASKIP,NORM),                                     X03820001
               COLOR=BLUE                                               03830001
APORC06 DFHMDF POS=(13,12),                                            X03840003
               LENGTH=13,                                              X03850001
               ATTRB=(ASKIP,NORM),                                     X03860001
               COLOR=BLUE                                               03870001
ALINE06 DFHMDF POS=(13,26),                                            X03880003
               LENGTH=04,                                              X03890001
               ATTRB=(ASKIP,NORM),                                     X03900001
               COLOR=BLUE                                               03910001
AUPC06  DFHMDF POS=(13,31),                                            X03960016
               LENGTH=15,                                              X03970001
               ATTRB=(ASKIP,NORM),                                     X03980001
               COLOR=BLUE                                               03990001
ASKU06  DFHMDF POS=(13,47),                                            X03991016
               LENGTH=08,                                              X03992016
               ATTRB=(ASKIP,NORM),                                     X03993016
               COLOR=BLUE                                               03994016
ANADJ06 DFHMDF POS=(13,56),                                            X04000003
               LENGTH=07,                                              X04010001
               ATTRB=(ASKIP,NORM),                                     X04020001
               COLOR=BLUE                                               04030001
ASORC06 DFHMDF POS=(13,64),                                            X04040003
               LENGTH=08,                                              X04050001
               ATTRB=(ASKIP,NORM),                                     X04060001
               COLOR=BLUE                                               04070001
AFLSC06 DFHMDF POS=(13,73),                                            X04071003
               LENGTH=01,                                              X04072001
               ATTRB=(ASKIP,NORM),                                     X04073001
               COLOR=BLUE                                               04074001
AACK06  DFHMDF POS=(13,77),                                            X04075003
               LENGTH=01,                                              X04076001
               ATTRB=(ASKIP,NORM),                                     X04077001
               COLOR=BLUE                                               04078001
*********************************************************************** 04079001
ASEL07  DFHMDF POS=(14,01),                                            X04079103
               LENGTH=01,                                              X04079208
               ATTRB=(UNPROT),                                         X04079306
               HILIGHT=UNDERLINE,                                      X04079401
               COLOR=GREEN                                              04079501
AACT07  DFHMDF POS=(14,03),                                            X04079603
               LENGTH=03,                                              X04079701
               ATTRB=(ASKIP,NORM),                                     X04079801
               COLOR=BLUE                                               04079901
AOPER07 DFHMDF POS=(14,07),                                            X04080003
               LENGTH=04,                                              X04080101
               ATTRB=(ASKIP,NORM),                                     X04080201
               COLOR=BLUE                                               04080301
APORC07 DFHMDF POS=(14,12),                                            X04080403
               LENGTH=13,                                              X04080501
               ATTRB=(ASKIP,NORM),                                     X04080601
               COLOR=BLUE                                               04080701
ALINE07 DFHMDF POS=(14,26),                                            X04080803
               LENGTH=04,                                              X04080901
               ATTRB=(ASKIP,NORM),                                     X04081001
               COLOR=BLUE                                               04081101
AUPC07  DFHMDF POS=(14,31),                                            X04081616
               LENGTH=15,                                              X04081701
               ATTRB=(ASKIP,NORM),                                     X04081801
               COLOR=BLUE                                               04081901
ASKU07  DFHMDF POS=(14,47),                                            X04082016
               LENGTH=08,                                              X04082116
               ATTRB=(ASKIP,NORM),                                     X04082216
               COLOR=BLUE                                               04082316
ANADJ07 DFHMDF POS=(14,56),                                            X04082403
               LENGTH=07,                                              X04082501
               ATTRB=(ASKIP,NORM),                                     X04082601
               COLOR=BLUE                                               04082701
ASORC07 DFHMDF POS=(14,64),                                            X04082803
               LENGTH=08,                                              X04082901
               ATTRB=(ASKIP,NORM),                                     X04083001
               COLOR=BLUE                                               04083101
AFLSC07 DFHMDF POS=(14,73),                                            X04083203
               LENGTH=01,                                              X04083301
               ATTRB=(ASKIP,NORM),                                     X04083401
               COLOR=BLUE                                               04083501
AACK07  DFHMDF POS=(14,77),                                            X04083603
               LENGTH=01,                                              X04083701
               ATTRB=(ASKIP,NORM),                                     X04083801
               COLOR=BLUE                                               04083901
*********************************************************************** 04084001
ASEL08  DFHMDF POS=(15,01),                                            X04084103
               LENGTH=01,                                              X04084208
               ATTRB=(UNPROT),                                         X04084306
               HILIGHT=UNDERLINE,                                      X04084401
               COLOR=GREEN                                              04084501
AACT08  DFHMDF POS=(15,03),                                            X04084603
               LENGTH=03,                                              X04084701
               ATTRB=(ASKIP,NORM),                                     X04084801
               COLOR=BLUE                                               04084901
AOPER08 DFHMDF POS=(15,07),                                            X04085003
               LENGTH=04,                                              X04085101
               ATTRB=(ASKIP,NORM),                                     X04085201
               COLOR=BLUE                                               04085301
APORC08 DFHMDF POS=(15,12),                                            X04085403
               LENGTH=13,                                              X04085501
               ATTRB=(ASKIP,NORM),                                     X04085601
               COLOR=BLUE                                               04085701
ALINE08 DFHMDF POS=(15,26),                                            X04085803
               LENGTH=04,                                              X04085901
               ATTRB=(ASKIP,NORM),                                     X04086001
               COLOR=BLUE                                               04086101
AUPC08  DFHMDF POS=(15,31),                                            X04086616
               LENGTH=15,                                              X04086701
               ATTRB=(ASKIP,NORM),                                     X04086801
               COLOR=BLUE                                               04086901
ASKU08  DFHMDF POS=(15,47),                                            X04087016
               LENGTH=08,                                              X04087116
               ATTRB=(ASKIP,NORM),                                     X04087216
               COLOR=BLUE                                               04087316
ANADJ08 DFHMDF POS=(15,56),                                            X04087403
               LENGTH=07,                                              X04087501
               ATTRB=(ASKIP,NORM),                                     X04087601
               COLOR=BLUE                                               04087701
ASORC08 DFHMDF POS=(15,64),                                            X04087803
               LENGTH=08,                                              X04087901
               ATTRB=(ASKIP,NORM),                                     X04088001
               COLOR=BLUE                                               04088101
AFLSC08 DFHMDF POS=(15,73),                                            X04088203
               LENGTH=01,                                              X04088301
               ATTRB=(ASKIP,NORM),                                     X04088401
               COLOR=BLUE                                               04088501
AACK08  DFHMDF POS=(15,77),                                            X04088603
               LENGTH=01,                                              X04088701
               ATTRB=(ASKIP,NORM),                                     X04088801
               COLOR=BLUE                                               04088901
*********************************************************************** 04089001
ASEL09  DFHMDF POS=(16,01),                                            X04089103
               LENGTH=01,                                              X04089208
               ATTRB=(UNPROT),                                         X04089306
               HILIGHT=UNDERLINE,                                      X04089401
               COLOR=GREEN                                              04089501
AACT09  DFHMDF POS=(16,03),                                            X04089603
               LENGTH=03,                                              X04089701
               ATTRB=(ASKIP,NORM),                                     X04089801
               COLOR=BLUE                                               04089901
AOPER09 DFHMDF POS=(16,07),                                            X04090003
               LENGTH=04,                                              X04090101
               ATTRB=(ASKIP,NORM),                                     X04090201
               COLOR=BLUE                                               04090301
APORC09 DFHMDF POS=(16,12),                                            X04090403
               LENGTH=13,                                              X04090501
               ATTRB=(ASKIP,NORM),                                     X04090601
               COLOR=BLUE                                               04090701
ALINE09 DFHMDF POS=(16,26),                                            X04090803
               LENGTH=04,                                              X04090901
               ATTRB=(ASKIP,NORM),                                     X04091001
               COLOR=BLUE                                               04091101
AUPC09  DFHMDF POS=(16,31),                                            X04091616
               LENGTH=15,                                              X04091701
               ATTRB=(ASKIP,NORM),                                     X04091801
               COLOR=BLUE                                               04091901
ASKU09  DFHMDF POS=(16,47),                                            X04092016
               LENGTH=08,                                              X04092116
               ATTRB=(ASKIP,NORM),                                     X04092216
               COLOR=BLUE                                               04092316
ANADJ09 DFHMDF POS=(16,56),                                            X04092403
               LENGTH=07,                                              X04092501
               ATTRB=(ASKIP,NORM),                                     X04092601
               COLOR=BLUE                                               04092701
ASORC09 DFHMDF POS=(16,64),                                            X04092803
               LENGTH=08,                                              X04092901
               ATTRB=(ASKIP,NORM),                                     X04093001
               COLOR=BLUE                                               04093101
AFLSC09 DFHMDF POS=(16,73),                                            X04093203
               LENGTH=01,                                              X04093301
               ATTRB=(ASKIP,NORM),                                     X04093401
               COLOR=BLUE                                               04093501
AACK09  DFHMDF POS=(16,77),                                            X04093603
               LENGTH=01,                                              X04093701
               ATTRB=(ASKIP,NORM),                                     X04093801
               COLOR=BLUE                                               04093901
*********************************************************************** 04094001
ASEL10  DFHMDF POS=(17,01),                                            X04094103
               LENGTH=01,                                              X04094208
               ATTRB=(UNPROT),                                         X04094306
               HILIGHT=UNDERLINE,                                      X04094401
               COLOR=GREEN                                              04094501
AACT10  DFHMDF POS=(17,03),                                            X04094603
               LENGTH=03,                                              X04094701
               ATTRB=(ASKIP,NORM),                                     X04094801
               COLOR=BLUE                                               04094901
AOPER10 DFHMDF POS=(17,07),                                            X04095003
               LENGTH=04,                                              X04095101
               ATTRB=(ASKIP,NORM),                                     X04095201
               COLOR=BLUE                                               04095301
APORC10 DFHMDF POS=(17,12),                                            X04095403
               LENGTH=13,                                              X04095501
               ATTRB=(ASKIP,NORM),                                     X04095601
               COLOR=BLUE                                               04095701
ALINE10 DFHMDF POS=(17,26),                                            X04095803
               LENGTH=04,                                              X04095901
               ATTRB=(ASKIP,NORM),                                     X04096001
               COLOR=BLUE                                               04096101
AUPC10  DFHMDF POS=(17,31),                                            X04096616
               LENGTH=15,                                              X04096701
               ATTRB=(ASKIP,NORM),                                     X04096801
               COLOR=BLUE                                               04096901
ASKU10  DFHMDF POS=(17,47),                                            X04097016
               LENGTH=08,                                              X04097116
               ATTRB=(ASKIP,NORM),                                     X04097216
               COLOR=BLUE                                               04097316
ANADJ10 DFHMDF POS=(17,56),                                            X04097403
               LENGTH=07,                                              X04097501
               ATTRB=(ASKIP,NORM),                                     X04097601
               COLOR=BLUE                                               04097701
ASORC10 DFHMDF POS=(17,64),                                            X04097803
               LENGTH=08,                                              X04097901
               ATTRB=(ASKIP,NORM),                                     X04098001
               COLOR=BLUE                                               04098101
AFLSC10 DFHMDF POS=(17,73),                                            X04098203
               LENGTH=01,                                              X04098301
               ATTRB=(ASKIP,NORM),                                     X04098401
               COLOR=BLUE                                               04098501
AACK10  DFHMDF POS=(17,77),                                            X04098603
               LENGTH=01,                                              X04098703
               ATTRB=(ASKIP,NORM),                                     X04098801
               COLOR=BLUE                                               04098901
*********************************************************************** 04099001
ASEL11  DFHMDF POS=(18,01),                                            X04099103
               LENGTH=01,                                              X04099208
               ATTRB=(UNPROT),                                         X04099306
               HILIGHT=UNDERLINE,                                      X04099401
               COLOR=GREEN                                              04099501
AACT11  DFHMDF POS=(18,03),                                            X04099603
               LENGTH=03,                                              X04099701
               ATTRB=(ASKIP,NORM),                                     X04099801
               COLOR=BLUE                                               04099901
AOPER11 DFHMDF POS=(18,07),                                            X04100003
               LENGTH=04,                                              X04100101
               ATTRB=(ASKIP,NORM),                                     X04100201
               COLOR=BLUE                                               04100301
APORC11 DFHMDF POS=(18,12),                                            X04100403
               LENGTH=13,                                              X04100501
               ATTRB=(ASKIP,NORM),                                     X04100601
               COLOR=BLUE                                               04100701
ALINE11 DFHMDF POS=(18,26),                                            X04100803
               LENGTH=04,                                              X04100901
               ATTRB=(ASKIP,NORM),                                     X04101001
               COLOR=BLUE                                               04101101
AUPC11  DFHMDF POS=(18,31),                                            X04101616
               LENGTH=15,                                              X04101701
               ATTRB=(ASKIP,NORM),                                     X04101801
               COLOR=BLUE                                               04101901
ASKU11  DFHMDF POS=(18,47),                                            X04102016
               LENGTH=08,                                              X04102116
               ATTRB=(ASKIP,NORM),                                     X04102216
               COLOR=BLUE                                               04102316
ANADJ11 DFHMDF POS=(18,56),                                            X04102403
               LENGTH=07,                                              X04102501
               ATTRB=(ASKIP,NORM),                                     X04102601
               COLOR=BLUE                                               04102701
ASORC11 DFHMDF POS=(18,64),                                            X04102803
               LENGTH=08,                                              X04102901
               ATTRB=(ASKIP,NORM),                                     X04103001
               COLOR=BLUE                                               04103101
AFLSC11 DFHMDF POS=(18,73),                                            X04103203
               LENGTH=01,                                              X04103301
               ATTRB=(ASKIP,NORM),                                     X04103401
               COLOR=BLUE                                               04103501
AACK11  DFHMDF POS=(18,77),                                            X04103603
               LENGTH=01,                                              X04103701
               ATTRB=(ASKIP,NORM),                                     X04103801
               COLOR=BLUE                                               04103901
*********************************************************************** 04104001
*********************************************************************** 04104101
        DFHMDF POS=(19,45),                                            X04105001
               LENGTH=25,                                              X04110001
               ATTRB=(ASKIP,NORM),                                     X04120001
               COLOR=NEUTRAL,                                          X04130001
               INITIAL='NUMBER OF SELECTED ITEMS:'                      04140001
ASELIT  DFHMDF POS=(19,72),                                            X04150001
               LENGTH=07,                                              X04160001
               ATTRB=(ASKIP,NORM),                                     X04170001
               COLOR=BLUE,                                             X04180001
               PICOUT='ZZZ,ZZ9'                                         04190001
        DFHMSD TYPE=FINAL                                               04200001
        END                                                             04210001
