        PRINT NOGEN                                                     00001   
SUKM512  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU512A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,01),                                           X00012**5
               LENGTH=015,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='AUDIT ON CARTON'                                00015*29
*                                                                       00016   
ACARTON  DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
ASTAT    DFHMDF POS=(03,01),                                           X00012**5
               LENGTH=019,                                             X00013*29
               ATTRB=(ASKIP,NORM)                                       00014*24
*                                                                       00016   
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=018,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='1. CONT.  2. CLOSE'                             00015*29
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=013,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='3. START OVER'                                  00015*29
*                                                                       00016   
         DFHMDF POS=(06,01),                                           X00034*22
               LENGTH=010,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='4. PRT RPT'                                     00015*29
*                                                                       00016   
ADEST    DFHMDF POS=(06,12),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00041*22
         DFHMDF POS=(07,01),                                           X00064**9
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='SELECTION'                                      00067**5
*                                                                       00068   
ASELECT  DFHMDF POS=(07,11),                                           X00051   
               LENGTH=001,                                             X00052   
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00072**5
         DFHMDF POS=(07,13),                                           X00055   
               LENGTH=001,                                             X00056   
               ATTRB=(ASKIP)                                            00057   
*                                                                       00068   
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
