***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT  NOGEN                                                            
SUKM553 DFHMSD TYPE=DSECT,                                             X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               STORAGE=AUTO,                                           X        
               TERM=3270-2,                                            X        
               TIOAPFX=YES                                                      
**********************************************************************          
SUK553  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               CTRL=(FREEKB),                                          X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
**********************************************************************          
        DFHMDF POS=(02,02),                                            X        
               LENGTH=010,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OPER UNIT:'                                             
AOPER   DFHMDF POS=(02,17),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='9999'                                                    
ANAME   DFHMDF POS=(02,22),                                            X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(02,43),                                            X        
               LENGTH=020,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL CTNS.........:'                                   
ATLCTN  DFHMDF POS=(02,64),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                            00737   
**********************************************************************          
        DFHMDF POS=(03,02),                                            X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='PO/RCVR..:'                                             
APORCVR  DFHMDF POS=(03,017),                                          X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(03,43),                                            X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TOTAL CTNS IN ERROR:'                                   
ACTNERR  DFHMDF POS=(03,064),                                          X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ9'                                            00737   
**********************************************************************          
        DFHMDF POS=(04,02),                                            X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='VENDOR...:'                                             
AVENDR  DFHMDF POS=(04,17),                                            X        
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
        DFHMDF POS=(04,43),                                            X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ITEMS'                                                  
ASTRTIT DFHMDF POS=(04,49),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(04,055),                                          X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(04,58),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(04,064),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(04,67),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************          
        DFHMDF POS=(05,026),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='S'                                                      
        DFHMDF POS=(05,28),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='DEST'                                                   
        DFHMDF POS=(05,33),                                            X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='CRE'                                                    
        DFHMDF POS=(05,48),                                            X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SCAN'                                                   
**********************************************************************          
        DFHMDF POS=(06,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='S'                                                      
        DFHMDF POS=(06,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='ACT'                                                    
        DFHMDF POS=(06,007),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SERIAL SHIP CODE'                                       
        DFHMDF POS=(06,026),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='T'                                                      
        DFHMDF POS=(06,028),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='STR'                                                    
        DFHMDF POS=(06,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SRC'                                                    
        DFHMDF POS=(06,037),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SCAN DATE  TIME'                                        
        DFHMDF POS=(06,054),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TRIP ID'                                                
        DFHMDF POS=(06,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='SCAC'                                                   
        DFHMDF POS=(06,069),                                           X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TRAILER'                                                
**********************************************************************          
ASEL01  DFHMDF POS=(07,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT01  DFHMDF POS=(07,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP01 DFHMDF POS=(07,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS01 DFHMDF POS=(07,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR01  DFHMDF POS=(07,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC01  DFHMDF POS=(07,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT01  DFHMDF POS=(07,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP01 DFHMDF POS=(07,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC01 DFHMDF POS=(07,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR01 DFHMDF POS=(07,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL02  DFHMDF POS=(08,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT02  DFHMDF POS=(08,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP02 DFHMDF POS=(08,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS02 DFHMDF POS=(08,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR02  DFHMDF POS=(08,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC02  DFHMDF POS=(08,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT02  DFHMDF POS=(08,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP02 DFHMDF POS=(08,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC02 DFHMDF POS=(08,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR02 DFHMDF POS=(08,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL03  DFHMDF POS=(09,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT03  DFHMDF POS=(09,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP03 DFHMDF POS=(09,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS03 DFHMDF POS=(09,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR03  DFHMDF POS=(09,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC03  DFHMDF POS=(09,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT03  DFHMDF POS=(09,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP03 DFHMDF POS=(09,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC03 DFHMDF POS=(09,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR03 DFHMDF POS=(09,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL04  DFHMDF POS=(10,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT04  DFHMDF POS=(10,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP04 DFHMDF POS=(10,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS04 DFHMDF POS=(10,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR04  DFHMDF POS=(10,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC04  DFHMDF POS=(10,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT04  DFHMDF POS=(10,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP04 DFHMDF POS=(10,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC04 DFHMDF POS=(10,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR04 DFHMDF POS=(10,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL05  DFHMDF POS=(11,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT05  DFHMDF POS=(11,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP05 DFHMDF POS=(11,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS05 DFHMDF POS=(11,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR05  DFHMDF POS=(11,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC05  DFHMDF POS=(11,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT05  DFHMDF POS=(11,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP05 DFHMDF POS=(11,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC05 DFHMDF POS=(11,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR05 DFHMDF POS=(11,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL06  DFHMDF POS=(12,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT06  DFHMDF POS=(12,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP06 DFHMDF POS=(12,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS06 DFHMDF POS=(12,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR06  DFHMDF POS=(12,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC06  DFHMDF POS=(12,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT06  DFHMDF POS=(12,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP06 DFHMDF POS=(12,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC06 DFHMDF POS=(12,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR06 DFHMDF POS=(12,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL07  DFHMDF POS=(13,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT07  DFHMDF POS=(13,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP07 DFHMDF POS=(13,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS07 DFHMDF POS=(13,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR07  DFHMDF POS=(13,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC07  DFHMDF POS=(13,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT07  DFHMDF POS=(13,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP07 DFHMDF POS=(13,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC07 DFHMDF POS=(13,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR07 DFHMDF POS=(13,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL08  DFHMDF POS=(14,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT08  DFHMDF POS=(14,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP08 DFHMDF POS=(14,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS08 DFHMDF POS=(14,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR08  DFHMDF POS=(14,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC08  DFHMDF POS=(14,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT08  DFHMDF POS=(14,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP08 DFHMDF POS=(14,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC08 DFHMDF POS=(14,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR08 DFHMDF POS=(14,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL09  DFHMDF POS=(15,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT09  DFHMDF POS=(15,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP09 DFHMDF POS=(15,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS09 DFHMDF POS=(15,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR09  DFHMDF POS=(15,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC09  DFHMDF POS=(15,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT09  DFHMDF POS=(15,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP09 DFHMDF POS=(15,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC09 DFHMDF POS=(15,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR09 DFHMDF POS=(15,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL10  DFHMDF POS=(16,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT10  DFHMDF POS=(16,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP10 DFHMDF POS=(16,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS10 DFHMDF POS=(16,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR10  DFHMDF POS=(16,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC10  DFHMDF POS=(16,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT10  DFHMDF POS=(16,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP10 DFHMDF POS=(16,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC10 DFHMDF POS=(16,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR10 DFHMDF POS=(16,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL11  DFHMDF POS=(17,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT11  DFHMDF POS=(17,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP11 DFHMDF POS=(17,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS11 DFHMDF POS=(17,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR11  DFHMDF POS=(17,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC11  DFHMDF POS=(17,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT11  DFHMDF POS=(17,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP11 DFHMDF POS=(17,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC11 DFHMDF POS=(17,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR11 DFHMDF POS=(17,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
ASEL12  DFHMDF POS=(18,001),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                                      
AACT12  DFHMDF POS=(18,003),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASHIP12 DFHMDF POS=(18,007),                                           X        
               LENGTH=018,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTUS12 DFHMDF POS=(18,026),                                           X        
               LENGTH=01,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTR12  DFHMDF POS=(18,028),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASRC12  DFHMDF POS=(18,033),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ADAT12  DFHMDF POS=(18,037),                                           X        
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRIP12 DFHMDF POS=(18,054),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASCAC12 DFHMDF POS=(18,064),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ATRLR12 DFHMDF POS=(18,069),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
**********************************************************************          
**********************************************************************          
         DFHMDF POS=(19,039),                                          X        
               LENGTH=025,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT   DFHMDF POS=(19,065),                                          X        
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
**********************************************************************          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
