*********************************************************************** 00010001
*          DATA SET SUKM575                                             00020001
  PRINT  NOGEN                                                          00030001
*-------------------------------------------------------------------*   00040001
*                                                                   *   00050001
*        MAPSET  SUKM575                                            *   00060001
*        MAP     SU575A                                             *   00070001
*        PROGRAM SUKCS575                                           *   00080001
*        TRANSID S575 - SU - RANKING MAINTENANCE CRITERIA SPEC     *    00090001
*        SYSTEM  SHIPPING UNIT (SU)                                 *   00100001
*                                                                   *   00110001
*-------------------------------------------------------------------*   00120001
SUKM575  DFHMSD TYPE=&&SYSPARM,                                        X00130001
               CTRL=(FREEKB),                                          X00140001
               LANG=COBOL,                                             X00150001
               MODE=INOUT,                                             X00160001
               TIOAPFX=YES                                              00170001
SU575A   DFHMDI SIZE=(19,080),                                         X00180001
               MAPATTS=(COLOR,HILIGHT),                                X00190001
               DSATTS=(COLOR,HILIGHT),                                 X00200001
               LINE=02,                                                X00210001
               COLUMN=01                                                00220001
*********************************************************************** 00290001
         DFHMDF POS=(03,002),                                          X00300003
               COLOR=NEUTRAL,                                          X00310001
               ATTRB=(ASKIP,BRT),                                      X00320001
               LENGTH=038,                                             X00330001
               INITIAL='ENTER THE AUDIT RANK TO ADD OR UPDATE:'         00340002
*********************************************************************** 00340101
         DFHMDF POS=(05,008),                                          X00461001
               COLOR=NEUTRAL,                                          X00462001
               ATTRB=(ASKIP,BRT),                                      X00463001
               LENGTH=011,                                             X00464001
               INITIAL='AUDIT RANK:'                                    00465001
ARANK    DFHMDF POS=(05,021),                                          X00466001
               COLOR=GREEN,                                            X00467001
               ATTRB=(UNPROT),                                         X00468001
               HILIGHT=UNDERLINE,                                      X00469001
               LENGTH=006                                               00469101
         DFHMDF POS=(05,28),                                           X00469301
               LENGTH=01,                                              X00469401
               ATTRB=(ASKIP,DRK)                                        00469501
ARNKDSC  DFHMDF POS=(05,30),                                           X00469601
               LENGTH=30,                                              X00469701
               COLOR=BLUE,                                             X00469801
               ATTRB=(ASKIP)                                            00469901
         DFHMDF POS=(05,61),                                           X00470001
               LENGTH=01,                                              X00480001
               ATTRB=(ASKIP,DRK)                                        00490001
*********************************************************************** 01880001
         DFHMSD TYPE=FINAL                                              01890001
         END                                                            01900001
