***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
        PRINT NOGEN                                                             
SUKM530  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
SU530A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
***********************************************************************         
ACTN    DFHMDF POS=(01,001),                                           X00023   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=018                                                       
APOHDG  DFHMDF POS=(02,001),                                           X00023   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=006,                                             X        
               INITIAL='PO/RC:'                                         00025   
APORCVR  DFHMDF POS=(02,08),                                           X        
               LENGTH=012,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
ALNEHDG DFHMDF POS=(03,001),                                           X00023   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='LINE..:'                                        00025   
APOLNE   DFHMDF POS=(03,09),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
AMSGLN01 DFHMDF POS=(04,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
AMSGLN02 DFHMDF POS=(05,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
AMSGLN03 DFHMDF POS=(06,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
AMSGLN04 DFHMDF POS=(07,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
***********************************************************************         
AMSGLN05 DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
***********************************************************************         
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
