        PRINT NOGEN                                                             
SUKM529  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
SU529A   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1,                                               X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*** LINE 1 ************************************************************         
         DFHMDF POS=(01,04),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRIP ENTRY'                                             
*** LINE 2 ************************************************************         
         DFHMDF POS=(02,01),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='SCAN/ENTER'                                             
*** LINE 3 ************************************************************         
         DFHMDF POS=(03,01),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='TRIP:'                                                  
AMANIFST DFHMDF POS=(03,07),                                           X        
               LENGTH=011,                                             X        
               ATTRB=(UNPROT,NORM,FSET,IC),                            X        
               PICOUT='ZZZZZZZZZZZ',                                   X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(03,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*** LINE 4 ************************************************************         
         DFHMDF POS=(04,01),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='RECV DOOR:'                                             
ADOOR    DFHMDF POS=(04,12),                                           X        
               LENGTH=004,                                             X        
               ATTRB=(UNPROT,NORM,FSET),                               X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(04,17),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*** LINE 5 ************************************************************         
         DFHMDF POS=(05,01),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='DEFINE P4 TEAM:'                                        
AP4      DFHMDF POS=(05,17),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,FSET),                               X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(05,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,DRK)                                                
*** LINE 6 ************************************************************         
APRTMSG  DFHMDF POS=(06,01),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
APROMPT  DFHMDF POS=(06,17),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,FSET),                               X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(06,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP)                                                    
*** LINE 7 ************************************************************         
AKEYLN   DFHMDF POS=(07,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
*** LINE 8 ************************************************************         
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM,FSET)                                          
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
