***********************************************************************         
*                                                                               
*   NOTE - ROW NUMBERS ARE RELATIVE TO LINE 2.  I.E. THE 2ND ROW ON             
*          THE SCREEN (MAPSET) IS THE 1ST LINE OF THIS MAP                      
***********************************************************************         
*          DATA SET SUKM761                                                     
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  SUKM761                                            *   00007   
*        MAP     SU761A                                             *   00008   
*        PROGRAM SUKCS761                                           *   00009   
*        TRANSID S761 - LISTING OF UNRESOLVED FREE-ASTRAYS          *   00010   
*        SYSTEM  SHIPPING UNIT (SU)                                 *   00011   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
SUKM761 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SU761A  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(20,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(03,02),                                            X00018   
               LENGTH=13,                                              X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='OPER UNIT ID:'                                  00020   
AOPER   DFHMDF POS=(03,17),                                            X00021   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X00022   
               PICOUT='9999'                                                    
AFCLTY  DFHMDF POS=(03,22),                                            X00021   
               LENGTH=04,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X00022   
               PICOUT='9999'                                                    
AFDESC  DFHMDF POS=(03,27),                                            X00021   
               LENGTH=020,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                               00022   
        DFHMDF POS=(03,48),                                            X00096   
               LENGTH=000,                                             X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
        DFHMDF POS=(03,49),                                            X00018   
               LENGTH=009,                                             X        
               ATTRB=(PROT,NORM),                                      X        
               COLOR=NEUTRAL,                                          X00019   
               INITIAL='LIST SEQ:'                                      00020   
ALSTSEQ DFHMDF POS=(03,59),                                            X00196   
               COLOR=GREEN,                                            X00197   
               ATTRB=(UNPROT,FSET),                                    X00198   
               HILIGHT=UNDERLINE,                                      X00077   
               LENGTH=001,                                             X00199   
               INITIAL=' '                                              00200   
        DFHMDF POS=(03,61),                                            X00023   
               LENGTH=013,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='(S=SCAC/TRLR,'                                  00025   
**********************************************************************  00011   
        DFHMDF POS=(04,02),                                            X00023   
               LENGTH=041,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=YELLOW,                                           X00024   
               INITIAL='ITEMS IN YELLOW HAVE NOT BEEN TRANSCRIBED'      00025   
        DFHMDF POS=(04,44),                                            X00096   
               LENGTH=000,                                             X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
        DFHMDF POS=(04,49),                                            X00023   
               LENGTH=031,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='A=ASCENDING DATE, D=DESCENDING)'                00025   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(05,02),                                           X00056   
               LENGTH=027,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00058   
               COLOR=RED,                                              X00057   
               INITIAL='ITEMS IN RED ARE IN TROUBLE'                    00060   
        DFHMDF POS=(05,30),                                            X00096   
               LENGTH=000,                                             X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
        DFHMDF POS=(05,45),                                            X00023   
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ITEMS'                                          00025   
ASTRTIT DFHMDF POS=(05,51),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
         DFHMDF POS=(05,057),                                          X00056   
               LENGTH=002,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00058   
               COLOR=NEUTRAL,                                          X00057   
               INITIAL='TO'                                             00060   
AENDIT  DFHMDF POS=(05,60),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(05,066),                                           X00067   
               LENGTH=002,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='OF'                                             00071   
ATOTIT  DFHMDF POS=(05,69),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
**********************************************************************  00011   
        DFHMDF POS=(06,030),                                           X00067   
               LENGTH=002,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='TR'                                             00071   
        DFHMDF POS=(06,047),                                           X00067   
               LENGTH=001,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='P'                                              00071   
        DFHMDF POS=(06,071),                                           X00067   
               LENGTH=003,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='ACT'                                            00071   
**********************************************************************  00011   
        DFHMDF POS=(07,030),                                           X00067   
               LENGTH=002,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='LR'                                             00071   
        DFHMDF POS=(07,047),                                           X00067   
               LENGTH=001,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='K'                                              00071   
        DFHMDF POS=(07,049),                                           X00067   
               LENGTH=003,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='SET'                                            00071   
        DFHMDF POS=(07,070),                                           X00067   
               LENGTH=004,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='SCAN'                                           00071   
        DFHMDF POS=(07,075),                                           X00067   
               LENGTH=005,                                             X00070   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00068   
               INITIAL='CRETE'                                          00071   
**********************************************************************  00011   
        DFHMDF POS=(08,001),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='S'                                              00025   
        DFHMDF POS=(08,003),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(08,007),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='SCAC'                                           00025   
        DFHMDF POS=(08,012),                                           X00023   
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TRAILER'                                        00025   
        DFHMDF POS=(08,020),                                           X00023   
               LENGTH=007,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='TRIP ID'                                        00025   
        DFHMDF POS=(08,030),                                           X00023   
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='ST'                                             00025   
        DFHMDF POS=(08,033),                                           X00023   
               LENGTH=011,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='PO/RECEIVER'                                    00025   
        DFHMDF POS=(08,047),                                           X00023   
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='G'                                              00025   
        DFHMDF POS=(08,049),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='NAME'                                           00025   
        DFHMDF POS=(08,055),                                           X00023   
               LENGTH=011,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='VENDOR NAME'                                    00025   
        DFHMDF POS=(08,071),                                           X00023   
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='CNT'                                            00025   
        DFHMDF POS=(08,075),                                           X00023   
               LENGTH=004,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='DATE'                                                   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(09,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT01  DFHMDF POS=(09,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC01 DFHMDF POS=(09,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR01 DFHMDF POS=(09,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP01 DFHMDF POS=(09,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT01 DFHMDF POS=(09,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC01 DFHMDF POS=(09,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG01  DFHMDF POS=(09,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM1 DFHMDF POS=(09,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM1 DFHMDF POS=(09,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT1 DFHMDF POS=(09,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT1 DFHMDF POS=(09,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(10,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT02  DFHMDF POS=(10,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC02 DFHMDF POS=(10,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR02 DFHMDF POS=(10,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP02 DFHMDF POS=(10,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT02 DFHMDF POS=(10,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC02 DFHMDF POS=(10,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG02  DFHMDF POS=(10,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM2 DFHMDF POS=(10,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM2 DFHMDF POS=(10,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT2 DFHMDF POS=(10,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT2 DFHMDF POS=(10,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(11,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT03  DFHMDF POS=(11,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC03 DFHMDF POS=(11,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR03 DFHMDF POS=(11,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP03 DFHMDF POS=(11,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT03 DFHMDF POS=(11,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC03 DFHMDF POS=(11,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG03  DFHMDF POS=(11,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM3 DFHMDF POS=(11,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM3 DFHMDF POS=(11,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT3 DFHMDF POS=(11,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT3 DFHMDF POS=(11,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(12,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT04  DFHMDF POS=(12,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC04 DFHMDF POS=(12,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR04 DFHMDF POS=(12,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP04 DFHMDF POS=(12,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT04 DFHMDF POS=(12,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC04 DFHMDF POS=(12,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG04  DFHMDF POS=(12,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM4 DFHMDF POS=(12,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM4 DFHMDF POS=(12,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT4 DFHMDF POS=(12,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT4 DFHMDF POS=(12,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(13,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT05  DFHMDF POS=(13,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC05 DFHMDF POS=(13,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR05 DFHMDF POS=(13,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP05 DFHMDF POS=(13,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT05 DFHMDF POS=(13,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC05 DFHMDF POS=(13,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG05  DFHMDF POS=(13,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM5 DFHMDF POS=(13,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM5 DFHMDF POS=(13,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT5 DFHMDF POS=(13,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT5 DFHMDF POS=(13,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(14,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT06  DFHMDF POS=(14,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC06 DFHMDF POS=(14,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR06 DFHMDF POS=(14,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP06 DFHMDF POS=(14,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT06 DFHMDF POS=(14,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC06 DFHMDF POS=(14,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG06  DFHMDF POS=(14,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM6 DFHMDF POS=(14,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM6 DFHMDF POS=(14,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT6 DFHMDF POS=(14,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT6 DFHMDF POS=(14,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(15,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT07  DFHMDF POS=(15,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC07 DFHMDF POS=(15,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR07 DFHMDF POS=(15,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP07 DFHMDF POS=(15,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT07 DFHMDF POS=(15,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC07 DFHMDF POS=(15,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG07  DFHMDF POS=(15,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM7 DFHMDF POS=(15,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM7 DFHMDF POS=(15,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT7 DFHMDF POS=(15,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT7 DFHMDF POS=(15,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(16,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT08  DFHMDF POS=(16,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC08 DFHMDF POS=(16,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR08 DFHMDF POS=(16,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP08 DFHMDF POS=(16,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT08 DFHMDF POS=(16,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC08 DFHMDF POS=(16,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG08  DFHMDF POS=(16,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM8 DFHMDF POS=(16,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM8 DFHMDF POS=(16,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT8 DFHMDF POS=(16,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT8 DFHMDF POS=(16,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL09  DFHMDF POS=(17,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT09  DFHMDF POS=(17,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC09 DFHMDF POS=(17,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR09 DFHMDF POS=(17,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP09 DFHMDF POS=(17,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT09 DFHMDF POS=(17,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC09 DFHMDF POS=(17,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG09  DFHMDF POS=(17,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM9 DFHMDF POS=(17,049),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM9 DFHMDF POS=(17,055),                                           X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT9 DFHMDF POS=(17,070),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT9 DFHMDF POS=(17,075),                                           X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL10  DFHMDF POS=(18,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT10  DFHMDF POS=(18,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC10 DFHMDF POS=(18,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR10 DFHMDF POS=(18,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP10 DFHMDF POS=(18,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT10 DFHMDF POS=(18,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC10 DFHMDF POS=(18,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG10  DFHMDF POS=(18,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM10 DFHMDF POS=(18,049),                                          X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM10 DFHMDF POS=(18,055),                                          X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT10 DFHMDF POS=(18,070),                                          X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT10 DFHMDF POS=(18,075),                                          X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
ASEL11  DFHMDF POS=(19,001),                                           X00021   
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               COLOR=GREEN                                              00022   
AACT11  DFHMDF POS=(19,003),                                           X00137   
               LENGTH=003,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASCAC11 DFHMDF POS=(19,007),                                           X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRLR11 DFHMDF POS=(19,012),                                           X00137   
               LENGTH=007,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ATRIP11 DFHMDF POS=(19,020),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE                                                       
ASTAT11 DFHMDF POS=(19,030),                                           X00137   
               LENGTH=002,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APORC11 DFHMDF POS=(19,033),                                           X00137   
               LENGTH=013,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
APKG11  DFHMDF POS=(19,047),                                           X00137   
               LENGTH=001,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ASETNM11 DFHMDF POS=(19,049),                                          X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
AVNDNM11 DFHMDF POS=(19,055),                                          X00137   
               LENGTH=014,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
ACTNCT11 DFHMDF POS=(19,070),                                          X00137   
               LENGTH=004,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE,                                             X00138   
               PICOUT='ZZZ9'                                                    
ACREDT11 DFHMDF POS=(19,075),                                          X00137   
               LENGTH=005,                                             X00140   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00138   
**********************************************************************  00011   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(20,039),                                          X00728   
               LENGTH=025,                                             X00731   
               ATTRB=(ASKIP,NORM),                                     X00730   
               COLOR=NEUTRAL,                                          X00729   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(20,065),                                          X00733   
               LENGTH=007,                                             X00736   
               ATTRB=(ASKIP,NORM),                                     X00735   
               COLOR=BLUE,                                             X00734   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
