        PRINT  NOGEN                                                    00010028
SUKM556 DFHMSD TYPE=DSECT,                                             X00020016
               LANG=COBOL,                                             X00030000
               MODE=INOUT,                                             X00040000
               STORAGE=AUTO,                                           X00050000
               TERM=3270-2,                                            X00060000
               TIOAPFX=YES                                              00070000
**********************************************************************  00080012
SUK556  DFHMDI LINE=2,COLUMN=1,                                        X00090016
               SIZE=(19,80),                                           X00100000
               CTRL=(FREEKB),                                          X00110000
               MAPATTS=(COLOR,HILIGHT),                                X00120000
               DSATTS=(COLOR,HILIGHT)                                   00130000
**********************************************************************  00140012
        DFHMDF POS=(02,15),                                            X00150012
               LENGTH=27,                                              X00160013
               ATTRB=(ASKIP,NORM),                                     X00170000
               COLOR=NEUTRAL,                                          X00180000
               INITIAL='PRINT REPORT TO PRINTER ID:'                    00190013
APRTID  DFHMDF POS=(02,43),                                            X00200012
               LENGTH=08,                                              X00210035
               ATTRB=(UNPROT,NORM),                                    X00220001
               COLOR=GREEN,                                            X00230001
               HILIGHT=UNDERLINE                                        00240001
        DFHMDF POS=(02,52),                                            X00250035
               LENGTH=01,                                              X00260005
               ATTRB=(ASKIP)                                            00270005
**********************************************************************  00280012
        DFHMDF POS=(05,18),                                            X00290027
               LENGTH=24,                                              X00300012
               ATTRB=(ASKIP,NORM),                                     X00310005
               COLOR=NEUTRAL,                                          X00320005
               INITIAL='ALL CHECK-IN REPORTS...:'                       00330012
ALLRPT  DFHMDF POS=(05,43),                                            X00340027
               LENGTH=01,                                              X00350001
               ATTRB=(UNPROT,NORM),                                    X00360001
               COLOR=GREEN,                                            X00370001
               HILIGHT=UNDERLINE                                        00380001
        DFHMDF POS=(05,45),                                            X00390027
               LENGTH=23,                                              X00400037
               ATTRB=(ASKIP,NORM),                                     X00410001
               COLOR=NEUTRAL,                                          X00420001
               INITIAL=' (S OR X = ALL REPORTS)'                        00430037
**********************************************************************  00440012
        DFHMDF POS=(07,21),                                            X00450012
               LENGTH=02,                                              X00460001
               ATTRB=(ASKIP,NORM),                                     X00470000
               COLOR=NEUTRAL,                                          X00480000
               INITIAL='OR'                                             00490001
**********************************************************************  00500012
        DFHMDF POS=(09,18),                                            X00510012
               LENGTH=24,                                              X00520012
               ATTRB=(ASKIP,NORM),                                     X00530000
               COLOR=NEUTRAL,                                          X00540000
               INITIAL='SELECT CHECK-IN REPORTS:'                       00550012
        DFHMDF POS=(09,46),                                            X00560032
               LENGTH=25,                                              X00570036
               ATTRB=(ASKIP,NORM),                                     X00580001
               COLOR=NEUTRAL,                                          X00590001
               INITIAL='(S OR X = SELECT REPORTS)'                      00600036
**********************************************************************  00610012
        DFHMDF POS=(10,24),                                            X00620001
               LENGTH=18,                                              X00630012
               ATTRB=(ASKIP,NORM),                                     X00640001
               COLOR=NEUTRAL,                                          X00650001
               INITIAL='1. STATS RPT ....:'                             00660012
ASTRPT  DFHMDF POS=(10,43),                                            X00670012
               LENGTH=01,                                              X00680001
               ATTRB=(UNPROT,NORM),                                    X00690001
               COLOR=GREEN,                                            X00700001
               HILIGHT=UNDERLINE                                        00710001
        DFHMDF POS=(10,45),                                            X00720014
               LENGTH=01,                                              X00730005
               ATTRB=(ASKIP)                                            00740005
**********************************************************************  00750012
        DFHMDF POS=(11,24),                                            X00760001
               LENGTH=18,                                              X00770012
               ATTRB=(ASKIP,NORM),                                     X00780001
               COLOR=NEUTRAL,                                          X00790001
               INITIAL='2. PO/STR UNT ADJ:'                             00800012
APORPT  DFHMDF POS=(11,43),                                            X00810033
               LENGTH=01,                                              X00820001
               ATTRB=(UNPROT,NORM),                                    X00830001
               COLOR=GREEN,                                            X00840001
               HILIGHT=UNDERLINE                                        00850001
        DFHMDF POS=(11,45),                                            X00860014
               LENGTH=01,                                              X00870005
               ATTRB=(ASKIP)                                            00880005
**********************************************************************  00890012
        DFHMDF POS=(12,24),                                            X00900001
               LENGTH=18,                                              X00910012
               ATTRB=(ASKIP,NORM),                                     X00920001
               COLOR=NEUTRAL,                                          X00930001
               INITIAL='3. CRTNS NOT RCVD:'                             00940012
ANRRPT  DFHMDF POS=(12,43),                                            X00950034
               LENGTH=01,                                              X00960001
               ATTRB=(UNPROT,NORM),                                    X00970001
               COLOR=GREEN,                                            X00980001
               HILIGHT=UNDERLINE                                        00990001
        DFHMDF POS=(12,45),                                            X01000014
               LENGTH=01,                                              X01010005
               ATTRB=(ASKIP)                                            01020005
**********************************************************************  01030012
        DFHMDF POS=(13,24),                                            X01040001
               LENGTH=18,                                              X01050012
               ATTRB=(ASKIP,NORM),                                     X01060001
               COLOR=NEUTRAL,                                          X01070001
               INITIAL='4. FREE ASTRAY ..:'                             01080012
AFARPT  DFHMDF POS=(13,43),                                            X01090012
               LENGTH=01,                                              X01100001
               ATTRB=(UNPROT,NORM),                                    X01110001
               COLOR=GREEN,                                            X01120001
               HILIGHT=UNDERLINE                                        01130001
        DFHMDF POS=(13,45),                                            X01140014
               LENGTH=01,                                              X01150005
               ATTRB=(ASKIP)                                            01160005
**********************************************************************  01170012
        DFHMDF POS=(14,24),                                            X01180001
               LENGTH=18,                                              X01190012
               ATTRB=(ASKIP,NORM),                                     X01200001
               COLOR=NEUTRAL,                                          X01210001
               INITIAL='5. MISDIRECT RPT :'                             01220012
AMDRPT  DFHMDF POS=(14,43),                                            X01230012
               LENGTH=01,                                              X01240001
               ATTRB=(UNPROT,NORM),                                    X01250001
               COLOR=GREEN,                                            X01260001
               HILIGHT=UNDERLINE                                        01270001
        DFHMDF POS=(14,45),                                            X01280014
               LENGTH=01,                                              X01290005
               ATTRB=(ASKIP)                                            01300005
**********************************************************************  01310012
        DFHMDF POS=(15,24),                                            X01320001
               LENGTH=18,                                              X01330012
               ATTRB=(ASKIP,NORM),                                     X01340001
               COLOR=NEUTRAL,                                          X01350001
               INITIAL='6. DUPLICATE SCAN:'                             01360012
ADSRPT  DFHMDF POS=(15,43),                                            X01370012
               LENGTH=01,                                              X01380001
               ATTRB=(UNPROT,NORM),                                    X01390001
               COLOR=GREEN,                                            X01400001
               HILIGHT=UNDERLINE                                        01410001
        DFHMDF POS=(15,45),                                            X01420014
               LENGTH=01,                                              X01430005
               ATTRB=(ASKIP)                                            01440005
**********************************************************************  01450012
        DFHMDF POS=(16,24),                                            X01460001
               LENGTH=18,                                              X01470012
               ATTRB=(ASKIP,NORM),                                     X01480001
               COLOR=NEUTRAL,                                          X01490001
               INITIAL='7. SCAN NOT FOUND:'                             01500012
ANFRPT  DFHMDF POS=(16,43),                                            X01510012
               LENGTH=01,                                              X01520001
               ATTRB=(UNPROT,NORM),                                    X01530001
               COLOR=GREEN,                                            X01540001
               HILIGHT=UNDERLINE                                        01550001
        DFHMDF POS=(16,45),                                            X01560014
               LENGTH=01,                                              X01570005
               ATTRB=(ASKIP)                                            01580005
**********************************************************************  01590012
        DFHMDF POS=(17,24),                                            X01600001
               LENGTH=18,                                              X01610012
               ATTRB=(ASKIP,NORM),                                     X01620001
               COLOR=NEUTRAL,                                          X01630001
               INITIAL='8. UNUSED LABELS :'                             01640012
AULRPT  DFHMDF POS=(17,43),                                            X01650012
               LENGTH=01,                                              X01660001
               ATTRB=(UNPROT,NORM),                                    X01670001
               COLOR=GREEN,                                            X01680001
               HILIGHT=UNDERLINE                                        01690001
        DFHMDF POS=(17,45),                                            X01700014
               LENGTH=01,                                              X01710005
               ATTRB=(ASKIP)                                            01720005
**********************************************************************  01730012
        DFHMSD TYPE=FINAL                                               01740000
        END                                                             01750000
