        PRINT NOGEN                                                             
SUKM513  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=(FREEKB,FRSET)                                              
*                                                                               
SU513A   DFHMDI SIZE=(08,22),                                          X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
         DFHMDF POS=(01,01),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='UPC'                                                    
*                                                                               
AUPC     DFHMDF POS=(01,05),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(IC,NORM)                                                  
         DFHMDF POS=(01,21),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMDF POS=(02,01),                                           X        
               LENGTH=005,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='D/M/S'                                                  
ADEPT    DFHMDF POS=(02,07),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
AMAJCLS  DFHMDF POS=(02,11),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
ASUBCLS  DFHMDF POS=(02,14),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
AHFM     DFHMDF POS=(02,17),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM)                                               
AHANG    DFHMDF POS=(02,19),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
ASKDESC  DFHMDF POS=(03,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
AVNDNME  DFHMDF POS=(04,01),                                           X        
               LENGTH=010,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
ARETAIL  DFHMDF POS=(04,12),                                           X        
               LENGTH=008,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
ASTYLE   DFHMDF POS=(05,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMDF POS=(06,01),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='SZE'                                                    
*                                                                               
ASIZE    DFHMDF POS=(06,05),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMDF POS=(07,01),                                           X        
               LENGTH=003,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='CLR'                                                    
*                                                                               
ACOLOR   DFHMDF POS=(07,05),                                           X        
               LENGTH=015,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
AMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
