*          DATA SET SUKM508    AT LEVEL 030 AS OF 06/17/91                      
        PRINT NOGEN                                                     00001   
SUKM508  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=(FREEKB,FRSET)                                      00006   
*                                                                       00007   
SU508A   DFHMDI SIZE=(08,20),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,04),                                           X00012**5
               LENGTH=012,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='CARTON AUDIT'                                   00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00012**5
               LENGTH=018,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='ASSOCIATE LOCATION'                             00015*29
*                                                                       00016   
         DFHMDF POS=(03,01),                                           X00034*22
               LENGTH=008,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='OPER UNT'                                       00015*29
*                                                                       00016   
AOPRUNT  DFHMDF POS=(03,10),                                           X00034*22
               LENGTH=004,                                             X00035*22
               ATTRB=(UNPROT,NORM)                                      00053   
*                                                                       00016   
         DFHMDF POS=(03,15),                                           X00034*22
               LENGTH=003,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='001'                                            00015*29
*                                                                       00016   
         DFHMDF POS=(04,01),                                           X00034*22
               LENGTH=016,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='1. RECV  2. FLAT'                               00015*29
*                                                                       00016   
         DFHMDF POS=(05,01),                                           X00034*22
               LENGTH=007,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='3. SHIP'                                        00015*29
*                                                                       00046**5
         DFHMDF POS=(06,01),                                           X00051**5
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='SELECTION'                                      00067**5
*                                                                       00068   
ASELECT  DFHMDF POS=(06,11),                                           X00051   
               LENGTH=001,                                             X00052   
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00072**5
         DFHMDF POS=(06,13),                                           X00055   
               LENGTH=001,                                             X00056   
               ATTRB=(ASKIP)                                            00057   
*                                                                       00072**5
         DFHMDF POS=(07,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL=' F4 - PRINT REPORT '                            00067**5
*                                                                       00072**5
AMSGLN   DFHMDF POS=(08,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
