        PRINT  NOGEN                                                    00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  SUKM758                                            *   00007   
*        MAP     SUK758                                             *   00008   
*        PROGRAM SUKCS758                                           *   00009   
*        TRANSID S758 - REPORT REQUEST LIST BY PO NUMBER            *   00010   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
SUKM758 DFHMSD TYPE=DSECT,                                             X00005   
               LANG=COBOL,                                             X00006   
               MODE=INOUT,                                             X00007   
               STORAGE=AUTO,                                           X00008   
               TERM=3270-2,                                            X00009   
               TIOAPFX=YES                                              00010   
**********************************************************************  00011   
SUK758  DFHMDI LINE=2,COLUMN=1,                                        X00012   
               SIZE=(20,80),                                           X00013   
               CTRL=(FREEKB),                                          X00014   
               MAPATTS=(COLOR,HILIGHT),                                X00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**********************************************************************  00011   
        DFHMDF POS=(02,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=16,                                              X        
               INITIAL='OPER UNIT/FCLTY:'                               00020   
AOPER   DFHMDF POS=(02,19),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
AFCLTY  DFHMDF POS=(02,24),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=04,                                              X        
               PICOUT='9999'                                                    
ANAME   DFHMDF POS=(02,30),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(02,061),                                          X00191   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
**********************************************************************          
        DFHMDF POS=(03,02),                                            X00018   
               COLOR=NEUTRAL,                                          X00019   
               ATTRB=(PROT,NORM),                                      X        
               LENGTH=16,                                              X        
               INITIAL='USER ID........:'                               00020   
ATKNO   DFHMDF POS=(03,19),                                            X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=08                                                        
         DFHMDF POS=(03,028),                                          X00191   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
**********************************************************************          
        DFHMDF POS=(04,02),                                            X00023   
               LENGTH=016,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X00024   
               INITIAL='REQ DATE RANGE.:'                               00025   
AFMM     DFHMDF POS=(04,019),                                          X        
               LENGTH=002,                                             X        
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM)                                               
AFDD     DFHMDF POS=(04,022),                                          X        
               LENGTH=002,                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                               
AFYY     DFHMDF POS=(04,025),                                          X        
               LENGTH=004,                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                               
         DFHMDF POS=(04,30),                                           X        
               LENGTH=02,                                              X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='TO'                                                     
ATMM     DFHMDF POS=(04,033),                                          X        
               LENGTH=002,                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                               
ATDD     DFHMDF POS=(04,036),                                          X        
               LENGTH=002,                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                               
ATYY     DFHMDF POS=(04,039),                                          X        
               LENGTH=004,                                             X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM)                                               
         DFHMDF POS=(04,044),                                          X00191   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
*********************************************************************           
        DFHMDF POS=(05,44),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,INITIAL='ITEMS'                                    
ASTRTIT DFHMDF POS=(05,50),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(NUM,UNPROT,NORM),                                X        
               COLOR=GREEN,                                            X        
               PICOUT='ZZZZ9',                                         X        
               HILIGHT=UNDERLINE                                                
        DFHMDF POS=(05,56),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='TO'                                                     
AENDIT  DFHMDF POS=(05,59),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
        DFHMDF POS=(05,65),                                            X        
               LENGTH=02,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='OF'                                                     
ATOTIT  DFHMDF POS=(05,68),                                            X        
               LENGTH=05,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZ9'                                                   
         DFHMDF POS=(05,074),                                          X00191   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
**********************************************************************          
**********************************************************************  00011   
        DFHMDF POS=(06,50),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='OPER'                                           00025   
         DFHMDF POS=(06,055),                                          X00191   
               LENGTH=01,                                              X00049**8
               ATTRB=(ASKIP,DRK)                                        00050**8
*******************************************************************             
        DFHMDF POS=(07,14),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='REQUEST'                                        00025   
        DFHMDF POS=(07,29),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='USER'                                           00025   
        DFHMDF POS=(07,37),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008,                                             X        
               INITIAL='PURCHASE'                                       00025   
        DFHMDF POS=(07,50),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='UNIT'                                           00025   
        DFHMDF POS=(07,66),                                            X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009,                                             X        
               INITIAL='PROCESSED'                                      00025   
**********************************************************************  00011   
        DFHMDF POS=(08,001),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001,                                             X        
               INITIAL='S'                                              00025   
        DFHMDF POS=(08,003),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                            00025   
        DFHMDF POS=(08,011),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='DATE'                                           00025   
        DFHMDF POS=(08,021),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='TIME'                                           00025   
        DFHMDF POS=(08,030),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='ID'                                             00025   
        DFHMDF POS=(08,038),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='ORDER'                                          00025   
        DFHMDF POS=(08,046),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='RCV'                                            00025   
        DFHMDF POS=(08,051),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='ID'                                             00025   
        DFHMDF POS=(08,055),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='STORE'                                          00025   
        DFHMDF POS=(08,063),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='DATE'                                           00025   
        DFHMDF POS=(08,074),                                           X00023   
               COLOR=NEUTRAL,                                          X00024   
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='TIME'                                           00025   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL01  DFHMDF POS=(09,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT01  DFHMDF POS=(09,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT01 DFHMDF POS=(09,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM01 DFHMDF POS=(09,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU01 DFHMDF POS=(09,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM01 DFHMDF POS=(09,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR01 DFHMDF POS=(09,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER01 DFHMDF POS=(09,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR01 DFHMDF POS=(09,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT01 DFHMDF POS=(09,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM01 DFHMDF POS=(09,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL02  DFHMDF POS=(10,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT02  DFHMDF POS=(10,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT02 DFHMDF POS=(10,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM02 DFHMDF POS=(10,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU02 DFHMDF POS=(10,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM02 DFHMDF POS=(10,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR02 DFHMDF POS=(10,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER02 DFHMDF POS=(10,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR02 DFHMDF POS=(10,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT02 DFHMDF POS=(10,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM02 DFHMDF POS=(10,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL03  DFHMDF POS=(11,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT03  DFHMDF POS=(11,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT03 DFHMDF POS=(11,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM03 DFHMDF POS=(11,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU03 DFHMDF POS=(11,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM03 DFHMDF POS=(11,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR03 DFHMDF POS=(11,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER03 DFHMDF POS=(11,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR03 DFHMDF POS=(11,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT03 DFHMDF POS=(11,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM03 DFHMDF POS=(11,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL04  DFHMDF POS=(12,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT04  DFHMDF POS=(12,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT04 DFHMDF POS=(12,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM04 DFHMDF POS=(12,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU04 DFHMDF POS=(12,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM04 DFHMDF POS=(12,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR04 DFHMDF POS=(12,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER04 DFHMDF POS=(12,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR04 DFHMDF POS=(12,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT04 DFHMDF POS=(12,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM04 DFHMDF POS=(12,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL05  DFHMDF POS=(13,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT05  DFHMDF POS=(13,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT05 DFHMDF POS=(13,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM05 DFHMDF POS=(13,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU05 DFHMDF POS=(13,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM05 DFHMDF POS=(13,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR05 DFHMDF POS=(13,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER05 DFHMDF POS=(13,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR05 DFHMDF POS=(13,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT05 DFHMDF POS=(13,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM05 DFHMDF POS=(13,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL06  DFHMDF POS=(14,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT06  DFHMDF POS=(14,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT06 DFHMDF POS=(14,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM06 DFHMDF POS=(14,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU06 DFHMDF POS=(14,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM06 DFHMDF POS=(14,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR06 DFHMDF POS=(14,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER06 DFHMDF POS=(14,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR06 DFHMDF POS=(14,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT06 DFHMDF POS=(14,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM06 DFHMDF POS=(14,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL07  DFHMDF POS=(15,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT07  DFHMDF POS=(15,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT07 DFHMDF POS=(15,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM07 DFHMDF POS=(15,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU07 DFHMDF POS=(15,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM07 DFHMDF POS=(15,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR07 DFHMDF POS=(15,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER07 DFHMDF POS=(15,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR07 DFHMDF POS=(15,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT07 DFHMDF POS=(15,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM07 DFHMDF POS=(15,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL08  DFHMDF POS=(16,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT08  DFHMDF POS=(16,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT08 DFHMDF POS=(16,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM08 DFHMDF POS=(16,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU08 DFHMDF POS=(16,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM08 DFHMDF POS=(16,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR08 DFHMDF POS=(16,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER08 DFHMDF POS=(16,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR08 DFHMDF POS=(16,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT08 DFHMDF POS=(16,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM08 DFHMDF POS=(16,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL09  DFHMDF POS=(17,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT09  DFHMDF POS=(17,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT09 DFHMDF POS=(17,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM09 DFHMDF POS=(17,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU09 DFHMDF POS=(17,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM09 DFHMDF POS=(17,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR09 DFHMDF POS=(17,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER09 DFHMDF POS=(17,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR09 DFHMDF POS=(17,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT09 DFHMDF POS=(17,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM09 DFHMDF POS=(17,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
ASEL10  DFHMDF POS=(18,01),                                            X00021   
               COLOR=GREEN,                                            X00022   
               HILIGHT=UNDERLINE,                                      X        
               ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=001                                                       
AACT10  DFHMDF POS=(18,03),                                            X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003                                               00140   
ARQDT10 DFHMDF POS=(18,007),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
ARQTM10 DFHMDF POS=(18,018),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
ATKNU10 DFHMDF POS=(18,027),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=007                                               00140   
APONM10 DFHMDF POS=(18,036),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008,                                             X00140   
               PICOUT='99999999'                                        00140   
ARCVR10 DFHMDF POS=(18,046),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=003,                                             X00140   
               PICOUT='999'                                             00140   
AOPER10 DFHMDF POS=(18,050),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00140   
ASTOR10 DFHMDF POS=(18,056),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=004,                                             X00140   
               PICOUT='9999'                                            00033   
APRDT10 DFHMDF POS=(18,061),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=010                                               00140   
APRTM10 DFHMDF POS=(18,072),                                           X00137   
               COLOR=BLUE,                                             X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=008                                               00140   
**********************************************************************  00011   
**********************************************************************  00011   
         DFHMDF POS=(19,040),                                          X00728   
               COLOR=NEUTRAL,                                          X00729   
               ATTRB=(ASKIP,NORM),                                     X00730   
               LENGTH=025,                                             X00731   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00732   
ASELIT   DFHMDF POS=(19,067),                                          X00733   
               COLOR=BLUE,                                             X00734   
               ATTRB=(ASKIP,NORM),                                     X00735   
               LENGTH=007,                                             X00736   
               PICOUT='ZZZ,ZZ9'                                         00737   
**********************************************************************  00011   
         DFHMSD TYPE=FINAL                                              00347   
         END                                                            00349   
