*          DATA SET SUKM525    AT LEVEL 000 AS OF 04/03/98                      
        PRINT NOGEN                                                             
SUKM525  DFHMSD TYPE=MAP,                                              X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=FREEKB                                                      
*                                                                               
SU525B   DFHMDI SIZE=(08,20),                                          X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
         DFHMDF POS=(01,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='CHECK-IN RPTS F7/F8'                                    
*                                                                               
BSLECT1  DFHMDF POS=(02,01),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,IC)                                           
*                                                                               
BRPTNB1  DFHMDF POS=(02,03),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BRPTNM1  DFHMDF POS=(02,06),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BSLECT2  DFHMDF POS=(03,01),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,IC)                                           
*                                                                               
BRPTNB2  DFHMDF POS=(03,03),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BRPTNM2  DFHMDF POS=(03,06),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BSLECT3  DFHMDF POS=(04,01),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,IC)                                           
*                                                                               
BRPTNB3  DFHMDF POS=(04,03),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BRPTNM3  DFHMDF POS=(04,06),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BSLECT4  DFHMDF POS=(05,01),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,IC)                                           
*                                                                               
BRPTNB4  DFHMDF POS=(05,03),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BRPTNM4  DFHMDF POS=(05,06),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BSLECT5  DFHMDF POS=(06,01),                                           X        
               LENGTH=001,                                             X        
               ATTRB=(UNPROT,NORM,IC)                                           
*                                                                               
BRPTNB5  DFHMDF POS=(06,03),                                           X        
               LENGTH=002,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
BRPTNM5  DFHMDF POS=(06,06),                                           X        
               LENGTH=014,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMDF POS=(07,01),                                           X        
               LENGTH=009,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               INITIAL='F4 TO PRT'                                              
*                                                                               
BPRNTID  DFHMDF POS=(07,11),                                           X        
               LENGTH=008,                                             X        
               ATTRB=(UNPROT,NORM)                                              
*                                                                               
BMSGLN   DFHMDF POS=(08,01),                                           X        
               LENGTH=019,                                             X        
               ATTRB=(ASKIP,NORM)                                               
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
