*          DATA SET SUKM708    AT LEVEL 001 AS OF 07/09/99                      
SUKM708  DFHMSD TYPE=MAP,                                              X        
               CTRL=(FREEKB),                                          X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES                                                      
SU708A   DFHMDI SIZE=(07,020),                                         X        
               LINE=1,                                                 X        
               COLUMN=1                                                         
*                                                                               
         DFHMDF POS=(01,006),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='WARNING'                                                
*                                                                               
         DFHMDF POS=(02,005),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009,                                             X        
               INITIAL='THERE ARE'                                              
*                                                                               
         DFHMDF POS=(03,002),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=016,                                             X        
               INITIAL='UNPRINTED LABELS'                                       
*                                                                               
         DFHMDF POS=(04,004),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=016,                                             X        
               INITIAL='FOR RFID CARTONS'                                       
*                                                                               
         DFHMDF POS=(05,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=018,                                             X        
               INITIAL='F4 TO PRINT SML OR'                                     
*                                                                               
         DFHMDF POS=(06,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019,                                             X        
               INITIAL='PRESS ENTER TO CONT'                                    
*                                                                               
AMSGLN   DFHMDF POS=(07,001),                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019                                                       
                                                                                
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
