*          DATA SET SUKM500    AT LEVEL 030 AS OF 06/17/91                      
        PRINT NOGEN                                                     00001   
SUKM500  DFHMSD TYPE=MAP,                                              X00002**3
               LANG=COBOL,                                             X00003   
               MODE=INOUT,                                             X00004   
               TIOAPFX=YES,                                            X00005   
               CTRL=FREEKB                                              00006   
*                                                                       00007   
SU500A   DFHMDI SIZE=(11,24),                                          X00008*22
               LINE=1,                                                 X00009   
               COLUMN=1                                                 00010*12
*                                                                       00011   
         DFHMDF POS=(01,04),                                           X00012**5
               LENGTH=011,                                             X00013*29
               ATTRB=(ASKIP,NORM),                                     X00014*24
               INITIAL='UCC128 MENU'                                    00015*29
*                                                                       00016   
         DFHMDF POS=(02,01),                                           X00034*22
               LENGTH=019,                                             X00035*22
               ATTRB=(ASKIP,NORM)                                       00036*14
*                                                                       00016   
         DFHMDF POS=(03,02),                                           X00034*22
               LENGTH=011,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='1. CHECK-IN'                                    00015*29
*                                                                       00016   
         DFHMDF POS=(04,02),                                           X00034*22
               LENGTH=015,                                             X00035*22
               ATTRB=(ASKIP,NORM),                                     X00036*14
               INITIAL='2. CARTON AUDIT'                                00015*29
*                                                                       00041*22
         DFHMDF POS=(05,02),                                           X00042**8
               LENGTH=018,                                             X00043**5
               ATTRB=(ASKIP,NORM),                                     X00044**5
               INITIAL='3. CART AUDIT STAT'                             00015*29
*                                                                       00046**5
         DFHMDF POS=(06,02),                                           X00042**8
               LENGTH=018,                                             X00043**5
               ATTRB=(ASKIP,NORM),                                     X00044**5
               INITIAL='4. CART DIRCT RLSE'                             00015*29
*                                                                       00046**5
         DFHMDF POS=(07,02),                                           X00042**8
               LENGTH=017,                                             X00043**5
               ATTRB=(ASKIP,NORM),                                     X00044**5
               INITIAL='5. RFID FINAL LBL'                              00015*29
*                                                                       00046**5
         DFHMDF POS=(08,02),                                           X00042**8
               LENGTH=015,                                             X00043**5
               ATTRB=(ASKIP,NORM),                                     X00044**5
               INITIAL='6. DIRCT RESEND'                                00015*29
*                                                                       00046**5
         DFHMDF POS=(09,01),                                           X00064**9
               LENGTH=009,                                             X00065*10
               ATTRB=(ASKIP,NORM),                                     X00066   
               INITIAL='SELECTION'                                      00067**5
*                                                                       00068   
ASELECT  DFHMDF POS=(09,11),                                           X00051   
               LENGTH=001,                                             X00052   
               ATTRB=(UNPROT,NORM,IC)                                   00053   
*                                                                       00072**5
         DFHMDF POS=(09,13),                                           X00055   
               LENGTH=001,                                             X00056   
               ATTRB=(ASKIP)                                            00057   
*                                                                       00072**5
AMSGLN   DFHMDF POS=(10,01),                                           X00073*22
               LENGTH=019,                                             X00074*22
               ATTRB=(ASKIP,NORM)                                       00075*24
*                                                                       00076   
         DFHMSD TYPE=FINAL                                              00077   
         END                                                            00078   
