000100 IDENTIFICATION DIVISION.                                         00010000
000200                                                                  00020000
000300 PROGRAM-ID.             SUKRP027.                                00030000
000400 AUTHOR.                 LYNN MCADAMS.                            00040000
000500 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00050000
000600 DATE-WRITTEN            SEPTEMBER, 2001.                         00060000
000700 DATE-COMPILED.                                                   00070000
000800*                                                                 00080000
000900*---------------------------------------------------------------- 00090000
001000*  THIS PROGRAM WILL PRODUCE A REPORT OF THE TRAILER AUDIT BY     00100000
001100*  CARTONS. A SUMMARY REPORT IS ALSO PRODUCED.                    00110000
001200*                                                                 00120000
001300*---------------------------------------------------------------- 00130000
001400*                                                                 00140000
001500 ENVIRONMENT DIVISION.                                            00150000
001600                                                                  00160000
001700 CONFIGURATION SECTION.                                           00170000
001800                                                                  00180000
001900 SOURCE-COMPUTER.        IBM-3090.                                00190000
002000 OBJECT-COMPUTER.        IBM-3090.                                00200000
002100                                                                  00210000
002200 INPUT-OUTPUT SECTION.                                            00220000
002300                                                                  00230000
002400 FILE-CONTROL.                                                    00240000
002500                                                                  00250000
002600*INPUT FILE                                                       00260000
002700     SELECT CARDIN-INPUT-FILE                                     00270000
002800         ASSIGN TO CARDIN.                                        00280000
002900                                                                  00290000
003000*SURD019                                                          00300000
003100     SELECT AUDIT-EXTRACT-FILE                                    00310000
003200         ASSIGN TO INP01.                                         00320000
003300                                                                  00330000
003400*SURD018                                                          00340000
003500     SELECT CRTN-MFST-FILE                                        00350000
003600         ASSIGN TO INP02.                                         00360000
003700                                                                  00370000
003800*REPORT OUTPUT                                                    00380000
003900     SELECT REPORT-FILE                                           00390000
004000         ASSIGN TO RPT01.                                         00400000
004100                                                                  00410000
004200 DATA DIVISION.                                                   00420000
004300                                                                  00430000
004400 FILE SECTION.                                                    00440000
004500 FD  CARDIN-INPUT-FILE                                            00450000
004600     LABEL RECORDS ARE STANDARD                                   00460000
004700     RECORDING MODE IS F                                          00470000
004800     BLOCK CONTAINS 0 RECORDS                                     00480000
004900     RECORD CONTAINS 80 CHARACTERS.                               00490000
005000 01  CC-RECORD                       PIC X(80).                   00500000
005100                                                                  00510000
005200 FD  AUDIT-EXTRACT-FILE                                           00520000
005300     LABEL RECORDS ARE STANDARD                                   00530000
005400     RECORDING MODE IS F                                          00540000
005500     BLOCK CONTAINS 0 RECORDS                                     00550000
005600     RECORD CONTAINS 300 CHARACTERS.                              00560000
005700 01  AUDIT-EXTRACT-REC               PIC X(300).                  00570000
005800                                                                  00580000
005900 FD  CRTN-MFST-FILE                                               00590000
006000     LABEL RECORDS ARE STANDARD                                   00600000
006100     RECORDING MODE IS F                                          00610000
006200     BLOCK CONTAINS 0 RECORDS                                     00620000
006300     RECORD CONTAINS 200 CHARACTERS.                              00630000
006400 01  CRTNS-MFST-REC                  PIC X(200).                  00640000
006500                                                                  00650000
006600 FD  REPORT-FILE                                                  00660000
006700     RECORDING MODE IS F                                          00670000
006800     LABEL RECORDS ARE STANDARD                                   00680000
006900     BLOCK CONTAINS 0 RECORDS.                                    00690000
007000 01  REPORT-RECORD                   PIC X(132).                  00700000
007100                                                                  00710000
007200                                                                  00720000
007300 WORKING-STORAGE SECTION.                                         00730000
007400 01  PROGRAM-SWITCHES.                                            00740000
007500     05  PS-EOF-CARDIN-SW            PIC X(01)     VALUE 'N'.     00750000
007600         88  PS-EOF-CARDIN-FILE                    VALUE 'Y'.     00760000
007700         88  PS-NOT-EOF-CARDIN-FILE                VALUE 'N'.     00770000
007800     05  PS-END-OF-EXTRACT1-SW       PIC X(03)     VALUE 'N'.     00780000
007900         88  PS-END-OF-EXTRACT1                    VALUE 'Y'.     00790000
008000     05  PS-END-OF-EXTRACT2-SW       PIC X(03)     VALUE 'N'.     00800000
008100         88  PS-END-OF-EXTRACT2                    VALUE 'Y'.     00810000
008200     05  PS-INACTIVE-CARTON-SW       PIC X(03)     VALUE 'N'.     00820000
008300         88  PS-INACTIVE-CARTON                    VALUE 'Y'.     00830000
008400         88  PS-NO-INACTIVE-CARTON                 VALUE 'N'.     00840000
008500     05  PS-CURSOR-SW                PIC X(01)     VALUE 'N'.     00850000
008600         88  PS-CURSOR-OPEN                        VALUE 'Y'.     00860000
008700         88  PS-CURSOR-CLOSED                      VALUE 'N'.     00870000
008800     05  PS-NEW-PAGE-SW              PIC X(03)     VALUE 'N'.     00880000
008900         88  PS-NEW-PAGE                           VALUE 'Y'.     00890000
009000         88  PS-NOT-NEW-PAGE                       VALUE 'N'.     00900000
009100     05  PS-EOF-USERID-CSR-SW        PIC X(01)     VALUE 'N'.     00910000
009200         88  PS-EOF-USERID-CSR                     VALUE 'Y'.     00920000
009300         88  PS-NOT-EOF-USERID-CSR                 VALUE 'N'.     00930000
009400     05  PS-EOF-MFST-CTNS-CSR-SW     PIC X(01)     VALUE 'N'.     00940000
009500         88  PS-EOF-MFST-CTNS-CSR                  VALUE 'Y'.     00950000
009600         88  PS-NOT-EOF-MFST-CTNS-CSR              VALUE 'N'.     00960000
009700     05  PS-SUBHEAD1-WRITTEN-SW      PIC X(01)     VALUE 'N'.     00970000
009800         88  PS-SUBHEAD1-WRITTEN                   VALUE 'Y'.     00980000
009900         88  PS-SUBHEAD1-NOT-WRITTEN               VALUE 'N'.     00990000
010000     05  PS-SUBHEAD2-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01000000
010100         88  PS-SUBHEAD2-WRITTEN                   VALUE 'Y'.     01010000
010200         88  PS-SUBHEAD2-NOT-WRITTEN               VALUE 'N'.     01020000
010300     05  PS-SUBHEAD3-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01030000
010400         88  PS-SUBHEAD3-WRITTEN                   VALUE 'Y'.     01040000
010500         88  PS-SUBHEAD3-NOT-WRITTEN               VALUE 'N'.     01050000
010600     05  PS-SUBHEAD4-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01060000
010700         88  PS-SUBHEAD4-WRITTEN                   VALUE 'Y'.     01070000
010800         88  PS-SUBHEAD4-NOT-WRITTEN               VALUE 'N'.     01080000
010900     05  PS-SUBHEAD5-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01090000
011000         88  PS-SUBHEAD5-WRITTEN                   VALUE 'Y'.     01100000
011100         88  PS-SUBHEAD5-NOT-WRITTEN               VALUE 'N'.     01110000
011200     05  PS-SUBHEAD6-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01120000
011300         88  PS-SUBHEAD6-WRITTEN                   VALUE 'Y'.     01130000
011400         88  PS-SUBHEAD6-NOT-WRITTEN               VALUE 'N'.     01140000
011500     05  PS-SUBHEAD7-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01150000
011600         88  PS-SUBHEAD7-WRITTEN                   VALUE 'Y'.     01160000
011700         88  PS-SUBHEAD7-NOT-WRITTEN               VALUE 'N'.     01170000
011800     05  PS-SUBHEAD8-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01180000
011900         88  PS-SUBHEAD8-WRITTEN                   VALUE 'Y'.     01190000
012000         88  PS-SUBHEAD8-NOT-WRITTEN               VALUE 'N'.     01200000
012100     05  PS-SUBHEAD9-WRITTEN-SW      PIC X(01)     VALUE 'N'.     01210000
012200         88  PS-SUBHEAD9-WRITTEN                   VALUE 'Y'.     01220000
012300         88  PS-SUBHEAD9-NOT-WRITTEN               VALUE 'N'.     01230000
012400     05  PS-SUBHEAD10-WRITTEN-SW     PIC X(01)     VALUE 'N'.     01240000
012500         88  PS-SUBHEAD10-WRITTEN                  VALUE 'Y'.     01250000
012600         88  PS-SUBHEAD10-NOT-WRITTEN              VALUE 'N'.     01260000
012700     05  PS-SUBHEADII-WRITTEN-SW     PIC X(01)     VALUE 'N'.     01270000
012800         88  PS-SUBHEADII-WRITTEN                  VALUE 'Y'.     01280000
012900         88  PS-SUBHEADII-NOT-WRITTEN              VALUE 'N'.     01290000
013000     05  PS-END-CARTON-CSR-SW         PIC X(1)   VALUE 'N'.       01300000
013100         88  PS-EOF-CARTON-CSR                   VALUE 'Y'.       01310000
013200         88  PS-NOT-EOF-CARTON-CSR               VALUE 'N'.       01320000
013300     05  PS-DETAIL-WRITTEN-SW         PIC X(1)   VALUE 'N'.       01330000
013400         88  PS-DETAIL-WRITTEN                   VALUE 'Y'.       01340000
013500         88  PS-NO-DETAIL-WRITTEN                VALUE 'N'.       01350000
013510     05  PS-DUPLICATE-SCAN-SW         PIC X(1)   VALUE 'Y'.       01351017
013520         88  PS-FIRST-DUPLICATE                  VALUE 'Y'.       01352017
013530         88  PS-NOT-FIRST-DUPLICATE              VALUE 'N'.       01353017
013600                                                                  01360000
013700                                                                  01370000
013800* PROGRAM VARIABLES                                               01380000
013900 01  PV-PROGRAM-VARIABLES.                                        01390000
014000     05  PV-AUD-STRT.                                             01400000
014100         10  PV-AUD-STRT-HH          PIC 9(02)   VALUE ZERO.      01410000
014200         10  FILLER                  PIC X(01)   VALUE ':'.       01420000
014300         10  PV-AUD-STRT-MI          PIC 9(02)   VALUE ZERO.      01430000
014400     05  PV-AUD-STP.                                              01440000
014500         10  PV-AUD-STP-HH           PIC 9(02)   VALUE ZERO.      01450000
014600         10  FILLER                  PIC X(01)   VALUE ':'.       01460000
014700         10  PV-AUD-STP-MI           PIC 9(02)   VALUE ZERO.      01470000
014800                                                                  01480000
014900     05  PV-CARTON-HOURS             PIC  9(06).                  01490000
015000     05  PV-CARTON-MIN               PIC  9(02).                  01500000
015100     05  PV-AUDIT-DURATION            PIC S9(9) COMP-3 VALUE ZERO.01510000
015200     05  PV-CARTON-DURATION           PIC S9(9) COMP-3 VALUE ZERO.01520000
015210     05  PV-DISPLAY-COUNT            PIC  ZZZ,ZZZ,ZZ9.            01521023
015300     05  PV-DISPLAY-DURATION.                                     01530000
015400         10  PV-DISPLAY-HOURS         PIC  Z(2) VALUE ZERO.       01540000
015500         10  FILLER                   PIC  X(1) VALUE ':'.        01550000
015600         10  PV-DISPLAY-MIN           PIC  Z(2) VALUE ZERO.       01560000
016100     05  PV-PAGE-COUNT               PIC S9(04)   VALUE ZERO      01610000
016200                                                  COMP-3.         01620000
016300     05  PV-LINE-COUNT               PIC S9(03)   VALUE ZERO      01630000
016400                                                  COMP-3.         01640000
016500     05  PV-MISLOAD-COUNT            PIC S9(07)   VALUE ZERO      01650000
016600                                                  COMP-3.         01660000
016700     05  PV-NOT-MFST-COUNT           PIC S9(07)   VALUE ZERO      01670000
016800                                                  COMP-3.         01680000
016900     05  PV-CONTENTS-UNKNOWN-COUNT   PIC S9(07)   VALUE ZERO      01690000
017000                                                  COMP-3.         01700000
017100     05  PV-DUPLICATE-SCAN-COUNT     PIC S9(07)   VALUE ZERO      01710000
017200                                                  COMP-3.         01720000
017300     05  PV-INACTIVE-COUNT           PIC S9(07)   VALUE ZERO      01730000
017400                                                  COMP-3.         01740000
017500     05  PV-NOT-FOUND-COUNT          PIC S9(07)   VALUE ZERO      01750000
017600                                                  COMP-3.         01760000
017700     05  PV-MFST-NOT-AUD-COUNT       PIC S9(07)   VALUE ZERO      01770000
017800                                                  COMP-3.         01780000
017900     05  PV-ERRORS-OTHER-COUNT       PIC S9(07)   VALUE ZERO      01790000
018000                                                  COMP-3.         01800000
018100     05  PV-CRE-NON-MFST-DC-COUNT    PIC S9(07)   VALUE ZERO      01810000
018200                                                  COMP-3.         01820000
018300     05  PV-NOT-AUD-CRE-NM-DC-COUNT  PIC S9(07)   VALUE ZERO      01830000
018400                                                  COMP-3.         01840000
018500                                                                  01850000
018600     05  PV-DB2-FUNCTION             PIC X(30) VALUE SPACE.       01860000
018700     05  PV-PARAGRAPH-NAME           PIC X(30) VALUE SPACE.       01870000
018800                                                                  01880000
018900     05  PV-SQL-RETURN-CD                PIC  999-.               01890000
019000     05  PV-ABEND-CODE               PIC S9(04)    VALUE ZERO     01900000
019100                                                   COMP SYNC.     01910000
019200     05  PV-ABEND-PARA-NAME          PIC X(30)     VALUE SPACES.  01920000
019300     05  PV-DB2-OPERATION-MSG-1      PIC X(40)     VALUE SPACES.  01930000
019400     05  PV-DB2-OPERATION-MSG-2      PIC X(40)     VALUE SPACES.  01940000
019500     05  PV-DB2-TABLE-NAME           PIC X(12)     VALUE SPACES.  01950000
019600     05  PV-SQLCODE                  PIC Z(8)9-.                  01960000
019700     05  PV-MESSAGE-AREA                 PIC  X(19)  VALUE SPACE. 01970000
019800     05  PV-RECEIVE-DATA                 PIC  X(01)  VALUE SPACE. 01980000
019900     05  PV-TRANSFER-PROGRAM             PIC  X(08)  VALUE SPACE. 01990000
020000     05  PV-RECORD-COUNT                 PIC S9(09)  VALUE ZEROS  02000000
020100                                                     COMP SYNC.   02010000
020200     05  PV-COUNT-IND                    PIC S9(04)  VALUE ZEROS  02020000
020300                                                     COMP SYNC.   02030000
020400     05  PV-SELECT-COUNTER               PIC S9(04)  VALUE ZEROS  02040000
020500                                                     COMP SYNC.   02050000
020600     05  PV-MULTI-LINE-COUNT             PIC S9(04)  VALUE ZEROS  02060000
020700                                                     COMP SYNC.   02070000
020800                                                                  02080000
020900     05  PV-MFST-CRTN-CNT            PIC S9(09) VALUE ZERO        02090000
021000                                                 COMP-3.          02100000
021100     05  PV-MFST-CRTN-ERR-CNT        PIC S9(09) VALUE ZERO        02110000
021200                                                 COMP-3.          02120000
021300                                                                  02130000
021400     05  PV-SHIPT-UNT-ID           PIC X(18).                     02140000
021500     05  PV-CRTN-STATUS            PIC X(19).                     02150000
021600     05  PV-STATUS-USERID          PIC X(07).                     02160000
021700     05  PV-SHPUNT-SRC-ID          PIC X(09).                     02170000
021800     05  PV-PO-NBR                 PIC X(09).                     02180000
021900     05  PV-RCVR                   PIC X(03).                     02190000
022000     05  PV-OTBD-TRIP-ID           PIC X(09).                     02200000
022100     05  PV-DEST-OPER-UNT-ID       PIC X(04).                     02210000
022200     05  PV-DOOR-ID                PIC X(04).                     02220000
022300     05  PV-TRIP-STATUS            PIC X(10).                     02230000
022310                                                                  02231023
022320     05  PV-READ-MANIFEST-COUNT      PIC  S9(9)     VALUE ZERO    02232023
022330                                                    COMP-3.       02233023
022340     05  PV-READ-EXCEPTION-COUNT     PIC  S9(9)     VALUE ZERO    02234023
022350                                                    COMP-3.       02235023
022400                                                                  02240000
022500 01  DK-DB-KEYS.                                                  02250000
022600     05  DK-AUD-CNTL-NBR             PIC S9(09) COMP.             02260000
022700     05  DK-OPER-UNT-ID              PIC S9(04) COMP.             02270000
022800     05  DK-ORIG-OTBND-TRIP-ID       PIC S9(09) COMP.             02280000
022900     05  DK-DEST-OTBND-TRIP-ID       PIC S9(09) COMP.             02290000
023000     05  DK-SHIPT-UNT-ID             PIC S9(18)V COMP-3.          02300000
023100     05  DK-OTBND-TRIP-ID            PIC S9(09) COMP.             02310000
023200                                                                  02320000
023300 01  PC-CONSTANTS.                                                02330000
023310     05  PC-LOCATION-MODULE          PIC  X(08)  VALUE 'XLKUT071'.02331003
023320                                                                  02332003
023400     05  PC-MAX-REPORT-LINES         PIC S9(3) COMP-3 VALUE +60.  02340000
023500     05  PC-MAX-RETRIES              PIC S9(4) COMP SYNC VALUE +2.02350003
023600     05  PC-BLANK-LINE               PIC X(132)    VALUE SPACE.   02360000
023700     05  PC-0                        PIC S9(03)    VALUE +0       02370000
023800                                                   COMP-3.        02380000
023900     05  PC-1                        PIC S9(03)    VALUE +1       02390000
024000                                                   COMP-3.        02400000
024100     05  PC-2                        PIC S9(03)    VALUE +2       02410000
024200                                                   COMP-3.        02420000
024300     05  PC-5                        PIC S9(03)    VALUE +5       02430000
024400                                                   COMP-3.        02440000
024500     05  PC-100                      PIC S9(03)    VALUE +100     02450000
024600                                                   COMP-3.        02460000
024700     05  PC-100-PRCT                 PIC  X(06)                   02470000
024800                                     VALUE '100%  '.              02480000
024900     05  PC-SPOT                     PIC  X(06)                   02490000
025000                                     VALUE 'SPOT  '.              02500000
025100     05  PC-REWORK                   PIC  X(06)                   02510000
025200                                     VALUE 'REWORK'.              02520000
025300     05  PC-CR                       PIC  X(16)                   02530000
025400                                     VALUE 'AUDIT CREATE    '.    02540000
025500     05  PC-IP                       PIC  X(16)                   02550000
025600                                     VALUE 'AUDIT IN PROCESS'.    02560000
025700     05  PC-CM                       PIC  X(16)                   02570000
025800                                     VALUE 'AUDIT COMPLETE  '.    02580000
025900     05  PC-PP                       PIC  X(16)                   02590000
026000                                     VALUE 'AUDIT POSTPONE  '.    02600000
026100     05  PC-ASN                      PIC  X(09)    VALUE          02610000
026200                                                   'ASN      '.   02620000
026300     05  PC-CKN                      PIC  X(09)    VALUE          02630000
026400                                                   'CHECK IN '.   02640000
026500     05  PC-CPS                      PIC  X(09)    VALUE          02650000
026600                                                   'CSPK SPLT'.   02660000
026700     05  PC-MAN                      PIC  X(09)    VALUE          02670000
026800                                                   'MANUAL   '.   02680000
026900     05  PC-P2L                      PIC  X(09)    VALUE          02690000
027000                                                   'P2L      '.   02700000
027100     05  PC-RCV                      PIC  X(09)    VALUE          02710000
027200                                                   'RECEIVING'.   02720000
027300     05  PC-RDM                      PIC  X(09)    VALUE          02730000
027400                                                   'RDM      '.   02740000
027500     05  PC-SMO                      PIC  X(09)    VALUE          02750000
027600                                                   'SMOOTHING'.   02760000
027700     05  PC-FXR                      PIC  X(09)    VALUE          02770000
027800                                                   'FAST XFER'.   02780000
027900     05  PC-MST                      PIC  X(09)    VALUE          02790000
028000                                                   'MSTR CNTR'.   02800000
028100     05  PC-MSC                      PIC  X(09)    VALUE          02810000
028200                                                   'CRTN BULD'.   02820000
028210     05  PC-JWL                      PIC  X(09)    VALUE          02821002
028220                                                   'FINE JWLY'.   02822001
028230     05  PC-DMG                      PIC  X(09)    VALUE          02823001
028240                                                   'DAMAGED  '.   02824001
028250     05  PC-3WD                      PIC  X(09)    VALUE          02825008
028260                                                   '3WD      '.   02826008
028300     05  PC-UNKNOWN                  PIC  X(09)    VALUE          02830000
028400                                                   'UNKNOWN  '.   02840000
028500     05  PC-DO                       PIC  X(10)    VALUE          02850000
028600                                                   'OPEN AT DC'.  02860000
028700     05  PC-DC                       PIC  X(10)    VALUE          02870000
028800                                                   'CLSD AT DC'.  02880000
028900     05  PC-DS                       PIC  X(10)    VALUE          02890000
029000                                                   'SHPD FR DC'.  02900000
029100     05  PC-SO                       PIC  X(10)    VALUE          02910000
029200                                                   'OPEN AT ST'.  02920000
029300     05  PC-SU                       PIC  X(10)    VALUE          02930000
029400                                                   'UNLD AT ST'.  02940000
029500     05  PC-AO                       PIC  X(10)    VALUE          02950000
029600                                                   'OPEN FR AU'.  02960000
029700     05  PC-AK                       PIC  X(10)    VALUE          02970000
029800                                                   'CLSD AU KP'.  02980000
029900     05  PC-AR                       PIC  X(10)    VALUE          02990000
030000                                                   'CLSD AU RL'.  03000000
030100     05  PC-DIFFERENT                PIC  X(09)    VALUE          03010000
030200                                                   'DIFFERENT'.   03020000
030300     05  PC-SAME                     PIC  X(09)    VALUE          03030000
030400                                                   'SAME     '.   03040000
030500     05  PC-CONVEYOR                 PIC  X(09)    VALUE          03050000
030600                                                   'CONVEYOR '.   03060000
030700                                                                  03070000
030800     05  PC-END-OF-PAGE              PIC S9(3) COMP-3 VALUE +60.  03080000
030900     05  PC-SLASH                    PIC  X(01)    VALUE '/'.     03090000
031000     05  PC-SPACE                    PIC  X(01)    VALUE ' '.     03100000
031100     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          03110000
031200         'SUKRP027'.                                              03120000
031300     05  PC-CRTN-STATUS-PGM          PIC  X(08)    VALUE          03130000
031400         'PCKUT713'.                                              03140000
031500     05  PC-REPORT-NBR               PIC  9(01)    VALUE 1.       03150000
031600     05  PC-DEFAULT-TMST           PIC  X(26)  VALUE              03160000
031700                                  '9999-09-09-09.09.09.999999'.   03170000
031800                                                                  03180000
031900                                                                  03190000
032000 01  ABEND-CODE                       PIC S9(04) VALUE ZERO       03200000
032100                                                 COMP SYNC.       03210000
032200     88  ABEND-4013-DB2-ERROR                    VALUE +4013.     03220000
032300                                                                  03230000
032400 01  PV-CONTROL-KEYS.                                             03240000
032500     05  PV-CURR-SHIPT-UNT-ID        PIC X(18) VALUE SPACE.       03250000
032600     05  PV-PREV-SHIPT-UNT-ID        PIC X(18) VALUE SPACE.       03260000
032700     05  PV-DB2-TIMESTAMP               PIC X(26)   VALUE SPACES. 03270000
032800     05  PV-TMST-R REDEFINES  PV-DB2-TIMESTAMP.                   03280000
032900         10   PV-TMST-CC                PIC X(02).                03290000
033000         10   PV-TMST-YY                PIC X(02).                03300000
033100         10   FILLER                    PIC X(01).                03310000
033200         10   PV-TMST-MM                PIC X(02).                03320000
033300         10   FILLER                    PIC X(01).                03330000
033400         10   PV-TMST-DD                PIC X(02).                03340000
033500         10   FILLER                    PIC X(01).                03350000
033600         10   PV-TMST-HH                PIC X(02).                03360000
033700         10   FILLER                    PIC X(01).                03370000
033800         10   PV-TMST-MI                PIC X(02).                03380000
033900         10   FILLER                    PIC X(10).                03390000
034000                                                                  03400000
034100     05  PV-DASH1                       PIC X(01)   VALUE '-'.    03410000
034200     05  PV-DASH2                       PIC X(01)   VALUE '-'.    03420000
034300     05  PV-COLON                       PIC X(01)   VALUE ':'.    03430000
034400                                                                  03440000
034500     05  PV-MFST-TIMESTAMP              PIC X(26)   VALUE SPACES. 03450000
034600     05  PV-MFST-TMST-R REDEFINES  PV-MFST-TIMESTAMP.             03460000
034700         10   PV-MFST-TMST-CC           PIC X(02).                03470000
034800         10   PV-MFST-TMST-YY           PIC X(02).                03480000
034900         10   FILLER                    PIC X(01).                03490000
035000         10   PV-MFST-TMST-MM           PIC X(02).                03500000
035100         10   FILLER                    PIC X(01).                03510000
035200         10   PV-MFST-TMST-DD           PIC X(02).                03520000
035300         10   FILLER                    PIC X(01).                03530000
035400         10   PV-MFST-TMST-HH           PIC X(02).                03540000
035500         10   FILLER                    PIC X(01).                03550000
035600         10   PV-MFST-TMST-MI           PIC X(02).                03560000
035700         10   FILLER                    PIC X(10).                03570000
035710                                                                  03571019
035720     05  PV-SCAN-TIMESTAMP              PIC X(26)   VALUE SPACES. 03572019
035730     05  PV-SCAN-TMST-R REDEFINES  PV-SCAN-TIMESTAMP.             03573019
035740         10   PV-SCAN-TMST-CC           PIC X(02).                03574019
035750         10   PV-SCAN-TMST-YY           PIC X(02).                03575019
035760         10   FILLER                    PIC X(01).                03576019
035770         10   PV-SCAN-TMST-MM           PIC X(02).                03577019
035780         10   FILLER                    PIC X(01).                03578019
035790         10   PV-SCAN-TMST-DD           PIC X(02).                03579019
035791         10   FILLER                    PIC X(01).                03579119
035792         10   PV-SCAN-TMST-HH           PIC X(02).                03579219
035793         10   FILLER                    PIC X(01).                03579319
035794         10   PV-SCAN-TMST-MI           PIC X(02).                03579419
035795         10   FILLER                    PIC X(01).                03579519
035796         10   PV-SCAN-TMST-SS           PIC X(02).                03579619
035797         10   FILLER                    PIC X(07).                03579719
035800                                                                  03580000
035900     05  PV-DB2-OPERATION-ATTEMPTED   PIC  X(30)  VALUE SPACE.    03590000
036000     05  PV-HOLD-USERID               PIC  X(07)  VALUE SPACES.   03600000
036100                                                                  03610000
036200     05  PV-TODAYS-DATE.                                          03620000
036300         10  PV-TODAYS-DATE-YY       PIC  9(02)    VALUE ZEROS.   03630000
036400         10  PV-TODAYS-DATE-MM       PIC  9(02)    VALUE ZEROS.   03640000
036500         10  PV-TODAYS-DATE-DD       PIC  9(02)    VALUE ZEROS.   03650000
036600     05  PV-TODAYS-TIME.                                          03660000
036700         10  PV-TODAYS-TIME-HH       PIC  9(02)    VALUE ZEROS.   03670000
036800         10  PV-TODAYS-TIME-MM       PIC  9(02)    VALUE ZEROS.   03680000
036900         10  PV-TODAYS-TIME-SS       PIC  9(02)    VALUE ZEROS.   03690000
037000         10  FILLER                  PIC  9(02)    VALUE ZEROS.   03700000
037100     05  PV-FORMAT-DATE.                                          03710000
037200         10  PV-FORMAT-DATE-MM       PIC  X(02)    VALUE SPACES.  03720000
037300         10  FILLER                  PIC  X(01)    VALUE '/'.     03730000
037400         10  PV-FORMAT-DATE-DD       PIC  X(02)    VALUE SPACES.  03740000
037500         10  FILLER                  PIC  X(01)    VALUE '/'.     03750000
037600         10  PV-FORMAT-DATE-YYYY     PIC  X(04)    VALUE SPACES.  03760000
037700                                                                  03770000
037800     05  PV-REPORT-FIELDS.                                        03780000
037900         10  PV-TOT-ERROR-CNT        PIC S9(09)  VALUE +0         03790012
038000                                                 COMP-3.          03800000
038010         10  PV-AUD-CRTN-CNT         PIC S9(09)  VALUE +0         03801012
038020                                                 COMP-3.          03802012
038100         10  PV-AUD-CRTN-ERR-CNT     PIC S9(09)  VALUE +0         03810000
038200                                                 COMP-3.          03820000
038210         10  PV-AUD-EXC-ERR-CNT      PIC S9(09)  VALUE +0         03821031
038220                                                 COMP-3.          03822031
038230         10  PV-AUD-TOT-ERR-CNT      PIC S9(09)  VALUE +0         03823031
038240                                                 COMP-3.          03824031
038300*        10  PV-AUD-CRTN-ERR-PRCT    PIC S9(09)  VALUE +0         03830010
038400*                                                COMP-3.          03840010
038410         10  PV-AUD-CRTN-ERR-PRCT    PIC S9(05)V99  VALUE +0      03841010
038420                                                 COMP-3.          03842010
038500*        10  PV-AUDIT-ERROR-PRCT     PIC S9(09)  VALUE +0         03850010
038600*                                                COMP-3.          03860010
038610         10  PV-AUDIT-ERROR-PRCT     PIC S9(05)V99  VALUE +0      03861010
038620                                                 COMP-3.          03862010
038700         10  PV-DIVIDEND             PIC  9(03)V9999.             03870000
038800                                                                  03880000
038900         10  PV-SUM                  PIC  9(03)V9999.             03890000
039000                                                                  03900000
039100         10  PV-STORE-NMBR           PIC 9(04)     VALUE ZERO.    03910000
039200         10  FILLER REDEFINES PV-STORE-NMBR.                      03920000
039300             15  PV-STORE-NMBR-1     PIC X(01).                   03930000
039400             15  PV-STORE-NMBR-3     PIC X(03).                   03940000
039500                                                                  03950000
039600     05  PV-BATCH-DATE                  PIC X(10)   VALUE SPACE.  03960000
039700     05  PV-BATCH-DATE-DISPLAY REDEFINES PV-BATCH-DATE.           03970000
039800         10   PV-DISPLAY-CC             PIC X(02).                03980000
039900         10   PV-DISPLAY-YY             PIC X(02).                03990000
040000         10   PV-DASH-1                 PIC X(01).                04000000
040100         10   PV-DISPLAY-MM             PIC X(02).                04010000
040200         10   PV-DASH-2                 PIC X(01).                04020000
040300         10   PV-DISPLAY-DD             PIC X(02).                04030000
040400                                                                  04040000
040500 EJECT                                                            04050000
040600                                                                  04060000
040700                                                                  04070000
040800 01  WS-BATCH-PROC-DATE.                                          04080000
040900     05  WS-BATCH-PROC-CC            PIC X(02)     VALUE SPACE.   04090000
041000     05  WS-BATCH-PROC-YY            PIC X(02)     VALUE SPACE.   04100000
041100     05  FILLER                      PIC X(01)     VALUE SPACE.   04110000
041200     05  WS-BATCH-PROC-MM            PIC X(02)     VALUE SPACE.   04120000
041300     05  FILLER                      PIC X(01)     VALUE SPACE.   04130000
041400     05  WS-BATCH-PROC-DD            PIC X(02)     VALUE SPACE.   04140000
041500                                                                  04150000
041600 01 WS-CALC-FIELDS.                                               04160000
041700    05  WS-RECORDS-READ-QTY          PIC S9(07)    COMP-3         04170000
041800                                                   VALUE ZEROS.   04180000
041900    05  WS-RECORDS-WRITE-QTY         PIC S9(07)    COMP-3         04190000
042000                                                   VALUE ZEROS.   04200000
042100                                                                  04210000
042200 01  CC-CONTROL-CARD.                                             04220000
042300     05  CC-AUD-CNTL-NBR             PIC  9(09).                  04230000
042400     05  FILLER                      PIC  X(01).                  04240000
042500     05  CC-USER-ID                  PIC  X(08).                  04250000
042600     05  FILLER                      PIC  X(62).                  04260000
042700                                                                  04270000
042800*RECORD LAYOUTS FOR INPUT FILES                                   04280000
042900     COPY SURD018.                                                04290000
043000     COPY SURD019.                                                04300000
043100                                                                  04310000
043200*  NUMERIC EDIT ROUTINE COMMAREA                                  04320000
043300     COPY DPWS010I.                                               04330000
043400                                                                  04340000
043500*COPYBOOK FOR CARTON STATUS MODULE - PCKUT713                     04350000
043600     COPY PCWS046.                                                04360000
043700                                                                  04370000
043710******************************************************************04371004
043720*    LOCATION MODULE                                              04372004
043730******************************************************************04373004
043740     COPY XLWS071.                                                04374004
043750                                                                  04375004
043800*STANDARD REPORT HEADER FOR 132 COLUMN REPORT                     04380000
043900     COPY DPWS132O.                                               04390000
044000                                                                  04400000
044100*MAIN HEADINGS                                                    04410000
044200 01  HEADING-LINE1.                                               04420000
044300     05  FILLER                  PIC  X(54)    VALUE SPACE.       04430000
044400     05  FILLER                  PIC  X(24)    VALUE              04440000
044500         'TRAILER AUDIT BY CARTONS'.                              04450000
044600     05  FILLER                  PIC  X(54)    VALUE SPACE.       04460000
044700                                                                  04470000
044800 01  HEADING-LINE2.                                               04480000
044900     05  FILLER                  PIC  X(60)    VALUE SPACE.       04490000
045000     05  FILLER                  PIC  X(13)    VALUE              04500000
045100         'DETAIL REPORT'.                                         04510000
045200     05  FILLER                  PIC  X(59)    VALUE SPACE.       04520000
045300                                                                  04530000
045400 01  HEADING-LINE3.                                               04540000
045500     05  FILLER                  PIC  X(02)    VALUE SPACE.       04550000
045600     05  FILLER                  PIC  X(09)    VALUE              04560000
045700         'FACILITY:'.                                             04570000
045800     05  FILLER                  PIC  X(02)    VALUE SPACE.       04580000
045900     05  HL3-FCLTY-ID            PIC  9(04)    VALUE ZERO.        04590000
046000     05  FILLER                  PIC  X(02)    VALUE SPACE.       04600000
046100     05  FILLER                  PIC  X(01)    VALUE '-'.         04610000
046200     05  FILLER                  PIC  X(02)    VALUE SPACE.       04620000
046300     05  HL3-FCLTY-NME           PIC  X(25)    VALUE SPACE.       04630000
046400     05  FILLER                  PIC  X(85)    VALUE SPACE.       04640000
046500                                                                  04650000
046600 01  HEADING-LINE4.                                               04660000
046700     05  FILLER                  PIC  X(02)    VALUE SPACE.       04670000
046800     05  FILLER                  PIC  X(27)    VALUE              04680000
046900         'AUDIT CONTROL NBR.........:'.                           04690000
047000     05  FILLER                  PIC  X(02)    VALUE SPACE.       04700000
047100     05  HL4-AUD-CNTL-NBR        PIC  9(09)    VALUE ZERO.        04710000
047200     05  FILLER                  PIC  X(09)    VALUE SPACE.       04720000
047300     05  FILLER                  PIC  X(27)    VALUE              04730000
047400         'AUDIT TYPE................:'.                           04740000
047500     05  FILLER                  PIC  X(02)    VALUE SPACE.       04750000
047600     05  HL4-AUD-TYP-CDE         PIC  X(06)    VALUE SPACE.       04760000
047700     05  FILLER                  PIC  X(12)    VALUE SPACE.       04770000
047800     05  FILLER                  PIC  X(17)    VALUE              04780000
047900         'AUDIT STATUS....:'.                                     04790000
048000     05  FILLER                  PIC  X(02)    VALUE SPACE.       04800000
048100     05  HL4-AUD-STAT-CDE        PIC  X(16)    VALUE SPACE.       04810000
048200     05  FILLER                  PIC  X(01)    VALUE SPACE.       04820000
048300                                                                  04830000
048400 01  HEADING-LINE5.                                               04840000
048500     05  FILLER                  PIC  X(02)    VALUE SPACE.       04850000
048600     05  FILLER                  PIC  X(27)    VALUE              04860000
048700         'AUDIT START...............:'.                           04870000
048800     05  FILLER                  PIC  X(02)    VALUE SPACE.       04880000
048900*STRT TIMESTAMP                                                   04890000
049000     05  HL5-STRT-DATE.                                           04900000
049100         10  HL5-STRT-MM         PIC 99.                          04910000
049200         10  FILLER              PIC X(01) VALUE '-'.             04920000
049300         10  HL5-STRT-DD         PIC 99.                          04930000
049400         10  FILLER              PIC X(01) VALUE '-'.             04940000
049500         10  HL5-STRT-CC         PIC 99.                          04950000
049600         10  HL5-STRT-YY         PIC 99.                          04960000
049700     05  FILLER                  PIC X(01) VALUE ' '.             04970000
049800     05  HL5-STRT-TIME.                                           04980000
049900         10  HL5-STRT-HH         PIC X(02).                       04990000
050000         10  FILLER              PIC X(01) VALUE ':'.             05000000
050100         10  HL5-STRT-MI         PIC X(02).                       05010000
050200     05  FILLER                  PIC X(02)    VALUE SPACE.        05020000
050300     05  FILLER                  PIC X(27)    VALUE               05030000
050400         'AUDIT STOP................:'.                           05040000
050500     05  FILLER                  PIC X(02)    VALUE SPACE.        05050000
050600*STP TIMESTAMP                                                    05060000
050700     05  HL5-STP-DATE.                                            05070000
050800         10  HL5-STP-MM          PIC X(02).                       05080000
050900         10  HL5-DASH1           PIC X(01) VALUE '-'.             05090000
051000         10  HL5-STP-DD          PIC X(02).                       05100000
051100         10  HL5-DASH2           PIC X(01) VALUE '-'.             05110000
051200         10  HL5-STP-CC          PIC X(02).                       05120000
051300         10  HL5-STP-YY          PIC X(02).                       05130000
051400     05  FILLER                  PIC X(01) VALUE ' '.             05140000
051500     05  HL5-STP-TIME.                                            05150000
051600         10  HL5-STP-HH          PIC X(02).                       05160000
051700         10  HL5-COLON           PIC X(01) VALUE ':'.             05170000
051800         10  HL5-STP-MI          PIC X(02).                       05180000
051900     05  FILLER                  PIC  X(02)    VALUE SPACE.       05190000
052000     05  FILLER                  PIC  X(17)    VALUE              05200000
052100         'DURATION(HH:MM).:'.                                     05210000
052200     05  FILLER                  PIC  X(02)    VALUE SPACE.       05220000
052300     05  HL5-AUD-DURATION        PIC  X(05)    VALUE SPACE.       05230000
052400     05  FILLER                  PIC  X(12)    VALUE SPACE.       05240000
052500                                                                  05250000
052600 01  HEADING-LINE6.                                               05260000
052700     05  FILLER                  PIC  X(02)    VALUE SPACE.       05270000
052800     05  FILLER                  PIC  X(27)    VALUE              05280000
052900         'ORIG TRAILER SERIAL NBR...:'.                           05290000
053000     05  FILLER                  PIC  X(02)    VALUE SPACE.       05300000
053100     05  HL6-ORIG-TRLR-SER-NBR   PIC  9(09)    VALUE ZERO.        05310000
053200     05  FILLER                  PIC  X(09)    VALUE SPACE.       05320000
053300     05  FILLER                  PIC  X(27)    VALUE              05330000
053400         'DEST TRAILER SERIAL NBR...:'.                           05340000
053500     05  FILLER                  PIC  X(02)    VALUE SPACE.       05350000
053600     05  HL6-DEST-TRLR-SER-NBR   PIC  Z(09).                      05360000
053700     05  FILLER                  PIC  X(09)    VALUE SPACE.       05370000
053800     05  FILLER                  PIC  X(17)    VALUE              05380000
053900         'AUDIT TO TRLR...:'.                                     05390000
054000     05  FILLER                  PIC  X(02)    VALUE SPACE.       05400000
054100     05  HL6-DEST-TYP-CDE        PIC  X(09)    VALUE SPACE.       05410000
054200     05  FILLER                  PIC  X(08)    VALUE SPACE.       05420000
054300                                                                  05430000
054400 01  HEADING-LINE7.                                               05440000
054500     05  FILLER                  PIC  X(02)    VALUE SPACE.       05450000
054600     05  FILLER                  PIC  X(27)    VALUE              05460000
054700         'ORIG TRAILER TRIP ID......:'.                           05470000
054800     05  FILLER                  PIC  X(02)    VALUE SPACE.       05480000
054900     05  HL7-ORIG-TRIP-ID        PIC  9(09)    VALUE ZERO.        05490000
055000     05  FILLER                  PIC  X(09)    VALUE SPACE.       05500000
055100     05  FILLER                  PIC  X(27)    VALUE              05510000
055200         'DEST TRAILER TRIP ID......:'.                           05520000
055300     05  FILLER                  PIC  X(02)    VALUE SPACE.       05530000
055400     05  HL7-DEST-TRIP-ID        PIC  Z(09).                      05540000
055500     05  FILLER                  PIC  X(09)    VALUE SPACE.       05550000
055600     05  FILLER                  PIC  X(17)    VALUE              05560000
055700         'STORE...........:'.                                     05570000
055800     05  FILLER                  PIC  X(02)    VALUE SPACE.       05580000
055900     05  HL7-DEST-OPER-UNT-ID    PIC  Z(04)    VALUE ZERO.        05590000
056000     05  FILLER                  PIC  X(13)    VALUE SPACE.       05600000
056100                                                                  05610000
056200 01  HEADING-LINE8.                                               05620000
056300     05  FILLER                  PIC  X(02)    VALUE SPACE.       05630000
056400     05  FILLER                  PIC  X(27)    VALUE              05640000
056500         'ASSOCIATE INITIATING AUDIT:'.                           05650000
056600     05  FILLER                  PIC  X(02)    VALUE SPACE.       05660000
056700     05  HL8-AUD-USR-ID          PIC  X(07)    VALUE SPACE.       05670000
056800     05  FILLER                  PIC  X(58)    VALUE SPACE.       05680000
056900     05  FILLER                  PIC  X(17)    VALUE              05690000
057000         'DOOR ID.........:'.                                     05700000
057100     05  FILLER                  PIC  X(02)    VALUE SPACE.       05710000
057200     05  HL8-DOOR-ID             PIC  X(04)    VALUE SPACE.       05720000
057300                                                                  05730009
057400*01  HEADING-LINE9.                                               05740009
057500*    05  FILLER                  PIC  X(02)    VALUE SPACE.       05750009
057600*    05  FILLER                  PIC  X(20)    VALUE              05760009
057700*        'AUDITED CARTONS....:'.                                  05770009
057800*    05  FILLER                  PIC  X(02)    VALUE SPACE.       05780009
057900*    05  HL9-AUD-CTN-QTY         PIC  ZZ,ZZZ,ZZ9.                 05790009
058000*    05  FILLER                  PIC  X(15)    VALUE SPACE.       05800009
058100*    05  FILLER                  PIC  X(28)    VALUE              05810009
058200*        'AUDITED CARTONS IN ERROR...:'.                          05820009
058300*    05  FILLER                  PIC  X(02)    VALUE SPACE.       05830009
058400*    05  HL9-AUD-CTN-ERR-QTY     PIC  ZZ,ZZZ,ZZ9.                 05840009
058500*    05  FILLER                  PIC  X(43)    VALUE SPACE.       05850009
058600                                                                  05860009
058700*HL10-MFST-CTN-ERR-QTY IS THE MANIFESTED AND AUDITED CARTONS      05870000
058800*WITH ERRORS.                                                     05880000
058900                                                                  05890000
059000 01  HEADING-LINE10.                                              05900000
059100     05  FILLER                  PIC  X(02)    VALUE SPACE.       05910000
059110     05  HL10-CTN-DESC           PIC  X(20)    VALUE SPACE.       05911028
059200*    05  FILLER                  PIC  X(20)    VALUE              05920028
059300*        'MANIFESTED CARTONS.:'.                                  05930028
059400     05  FILLER                  PIC  X(02)    VALUE SPACE.       05940000
059500     05  HL10-MFST-CTN-QTY       PIC  ZZ,ZZZ,ZZ9.                 05950000
059600     05  FILLER                  PIC  X(15)    VALUE SPACE.       05960000
059700     05  FILLER                  PIC  X(28)    VALUE              05970000
059800         'UNIQUE CARTONS IN ERROR....:'.                          05980031
059900     05  FILLER                  PIC  X(02)    VALUE SPACE.       05990000
060000     05  HL10-MFST-CTN-ERR-QTY   PIC  ZZ,ZZZ,ZZ9.                 06000000
060100     05  FILLER                  PIC  X(07)    VALUE SPACE.       06010000
060200     05  FILLER                  PIC  X(19)    VALUE              06020000
060300         'TOTAL ACCURACY RATE'.                                   06030000
060400     05  FILLER                  PIC  X(02)    VALUE SPACE.       06040000
060500     05  HL10-TOT-ACC-RATE       PIC  ZZ9.99.                     06050009
060600     05  FILLER                  PIC  X(01)    VALUE              06060000
060700         '%'.                                                     06070000
060800     05  FILLER                  PIC  X(08)    VALUE SPACE.       06080009
060900                                                                  06090000
061000 01  HEADING-LINE11.                                              06100000
061100     05  FILLER                  PIC  X(02)    VALUE SPACE.       06110000
061200     05  FILLER                  PIC  X(20)    VALUE              06120000
061300         'AUDITING ASSOCIATES:'.                                  06130000
061400     05  FILLER                  PIC  X(02)    VALUE SPACE.       06140000
061500     05  HL11-USERID-TABLE.                                       06150000
061600         10 FILLER  OCCURS 11 TIMES                               06160000
061700                    INDEXED BY HL11-USERID-IDX.                   06170000
061800            15 HL11-USERID      PIC  X(07) VALUE SPACE.           06180000
061900            15 HL11-COMMA       PIC  X(01) VALUE SPACE.           06190000
062000            15 FILLER           PIC  X(01) VALUE SPACE.           06200000
062100                                                                  06210000
062200                                                                  06220000
062300*SUB HEADINGS                                                     06230000
062400 01  SUB-HEADING-LINE1.                                           06240000
062500     05  FILLER                  PIC  X(01)    VALUE SPACE.       06250000
062600     05  FILLER                  PIC  X(30)    VALUE              06260009
062700         'CARTON AUDIT - STORE MISLOADS:'.                        06270009
062800     05  FILLER                  PIC  X(101)   VALUE SPACE.       06280009
062900                                                                  06290000
063000 01  SUB-HEADING-LINE2.                                           06300000
063100     05  FILLER                  PIC  X(01)    VALUE SPACE.       06310000
063200     05  FILLER                  PIC  X(32)    VALUE              06320000
063300         'CARTON AUDIT - NOT MFST TO TRLR:'.                      06330000
063400     05  FILLER                  PIC  X(99)    VALUE SPACE.       06340000
063500                                                                  06350000
063600 01  SUB-HEADING-LINE3.                                           06360011
063700     05  FILLER                  PIC  X(01)    VALUE SPACE.       06370011
063800     05  FILLER                  PIC  X(39)    VALUE              06380011
063900         'CARTON AUDIT - CARTON CONTENTS UNKNOWN:'.               06390011
064000     05  FILLER                  PIC  X(92)    VALUE SPACE.       06400011
064100                                                                  06410000
064200 01  SUB-HEADING-LINE4.                                           06420000
064300     05  FILLER                  PIC  X(01)    VALUE SPACE.       06430000
064400     05  FILLER                  PIC  X(30)    VALUE              06440000
064500         'CARTON AUDIT - DUPLICATE SCAN:'.                        06450000
064600     05  FILLER                  PIC  X(101)   VALUE SPACE.       06460000
064700                                                                  06470000
064800 01  SUB-HEADING-LINE5.                                           06480011
064900     05  FILLER                  PIC  X(01)    VALUE SPACE.       06490011
065000     05  FILLER                  PIC  X(32)    VALUE              06500011
065100         'CARTON AUDIT - CARTONS INACTIVE:'.                      06510011
065200     05  FILLER                  PIC  X(99)    VALUE SPACE.       06520011
065300                                                                  06530000
065400 01  SUB-HEADING-LINE6.                                           06540000
065500     05  FILLER                  PIC  X(01)    VALUE SPACE.       06550000
065600     05  FILLER                  PIC  X(43)    VALUE              06560000
065700         'CARTON AUDIT - CARTONS NOT FOUND IN SYSTEM:'.           06570000
065800     05  FILLER                  PIC  X(88)    VALUE SPACE.       06580000
065900                                                                  06590000
066000 01  SUB-HEADING-LINE7.                                           06600000
066100     05  FILLER                  PIC  X(01)    VALUE SPACE.       06610000
066200     05  FILLER                  PIC  X(28)    VALUE              06620009
066300         'MANIFESTED - NOT ON TRAILER:'.                          06630009
066400     05  FILLER                  PIC  X(103)   VALUE SPACE.       06640009
066500                                                                  06650000
066600 01  SUB-HEADING-LINE8.                                           06660000
066700     05  FILLER                  PIC  X(01)    VALUE SPACE.       06670000
066800     05  FILLER                  PIC  X(30)    VALUE              06680000
066900         'CARTON AUDIT - ERRORS (OTHER):'.                        06690000
067000     05  FILLER                  PIC  X(101)   VALUE SPACE.       06700000
067100                                                                  06710000
067200 01  SUB-HEADING-LINE9.                                           06720000
067300     05  FILLER                  PIC  X(01)    VALUE SPACE.       06730000
067400     05  FILLER                  PIC  X(49)    VALUE              06740000
067500         'CARTON AUDIT - CARTON(S) CREATED FROM NON-MFST DC'.     06750000
067600     05  FILLER                  PIC  X(82)    VALUE SPACE.       06760000
067700                                                                  06770000
067800 01  SUB-HEADING-LINE10.                                          06780000
067900     05  FILLER                  PIC  X(01)    VALUE SPACE.       06790000
068000     05  FILLER                  PIC  X(61)    VALUE              06800000
068100         'MANIFESTED - NOT AUDITED - CARTON(S) CREATED FROM NON-MF06810000
068200-        'ST DC'.                                                 06820000
068300     05  FILLER                  PIC  X(70)    VALUE SPACE.       06830000
068400                                                                  06840000
068500 01  SUB-HEADING-LINEI.                                           06850000
068600     05  FILLER                  PIC  X(53)    VALUE SPACE.       06860000
068700     05  FILLER                  PIC  X(25)    VALUE              06870000
068800         'C A R T O N   E R R O R S'.                             06880000
068900     05  FILLER                  PIC  X(54)   VALUE SPACE.        06890000
069000                                                                  06900000
069100*01  SUB-HEADING-LINEII.                                          06910010
069200*    05  FILLER                  PIC  X(48)    VALUE SPACE.       06920010
069300*    05  FILLER                  PIC  X(42)    VALUE              06930010
069400*        'I N F O R M A T I O N A L  M E S S A G E S'.            06940010
069500*    05  FILLER                  PIC  X(42)   VALUE SPACE.        06950010
069600                                                                  06960000
069700 01  SUB-HEADING-LINEA.                                           06970000
069800     05  FILLER                  PIC  X(45)   VALUE SPACE.        06980000
069900     05  FILLER                  PIC  X(25)   VALUE               06990000
070000         '-- M A N I F E S T E D --'.                             07000000
070100     05  FILLER                  PIC  X(02)   VALUE SPACE.        07010000
070200     05  FILLER                  PIC  X(06)   VALUE               07020000
070300         'CREATE'.                                                07030000
070400     05  FILLER                  PIC  X(09)   VALUE SPACE.        07040000
070500     05  FILLER                  PIC  X(07)   VALUE               07050000
070600         'PO/RCVR'.                                               07060000
070700     05  FILLER                  PIC  X(04)   VALUE SPACE.        07070000
070800     05  FILLER                  PIC  X(06)   VALUE               07080000
070900         'OUTBND'.                                                07090000
071000     05  FILLER                  PIC  X(28)   VALUE SPACE.        07100000
071100                                                                  07110000
071200 01  SUB-HEADING-LINEB.                                           07120000
071300     05  FILLER                  PIC  X(11)   VALUE SPACE.        07130000
071400     05  FILLER                  PIC  X(03)   VALUE               07140000
071500         'SML'.                                                   07150000
071600     05  FILLER                  PIC  X(10)   VALUE SPACE.        07160000
071700     05  FILLER                  PIC  X(13)    VALUE              07170000
071800         'CARTON STATUS'.                                         07180000
071900     05  FILLER                  PIC  X(11)   VALUE SPACE.        07190000
072000     05  FILLER                  PIC  X(10)    VALUE              07200000
072100         'TO TRAILER'.                                            07210000
072200     05  FILLER                  PIC  X(07)   VALUE SPACE.        07220000
072300     05  FILLER                  PIC  X(02)    VALUE              07230000
072400         'BY'.                                                    07240000
072500     05  FILLER                  PIC  X(05)   VALUE SPACE.        07250000
072600     05  FILLER                  PIC  X(06)    VALUE              07260000
072700         'SOURCE'.                                                07270000
072800     05  FILLER                  PIC  X(09)   VALUE SPACE.        07280000
072900     05  FILLER                  PIC  X(06)    VALUE              07290000
073000         'NUMBER'.                                                07300000
073100     05  FILLER                  PIC  X(05)   VALUE SPACE.        07310000
073200     05  FILLER                  PIC  X(07)    VALUE              07320000
073300         'TRIP ID'.                                               07330000
073400     05  FILLER                  PIC  X(04)   VALUE SPACE.        07340000
073500     05  FILLER                  PIC  X(03)    VALUE              07350000
073600         'STR'.                                                   07360000
073700     05  FILLER                  PIC  X(02)   VALUE SPACE.        07370000
073800     05  FILLER                  PIC  X(09)    VALUE              07380000
073900         'TRIP STAT'.                                             07390000
074000     05  FILLER                  PIC  X(09)   VALUE SPACE.        07400000
074100                                                                  07410000
074200 01  SUB-HEADING-LINEC.                                           07420000
074300     05  FILLER                  PIC  X(04)    VALUE SPACE.       07430000
074400     05  FILLER                  PIC  X(18)    VALUE              07440000
074500         '-----------------'.                                     07450000
074600     05  FILLER                  PIC  X(02)   VALUE SPACE.        07460000
074700     05  FILLER                  PIC  X(19)   VALUE               07470000
074800         '-------------------'.                                   07480000
074900     05  FILLER                  PIC  X(02)   VALUE SPACE.        07490000
075000     05  FILLER                  PIC  X(16)   VALUE               07500000
075100         '----------------'.                                      07510000
075200     05  FILLER                  PIC  X(02)   VALUE SPACE.        07520000
075300     05  FILLER                  PIC  X(07)   VALUE               07530000
075400         '-------'.                                               07540000
075500     05  FILLER                  PIC  X(02)   VALUE SPACE.        07550000
075600     05  FILLER                  PIC  X(09)   VALUE               07560000
075700         '---------'.                                             07570000
075800     05  FILLER                  PIC  X(02)   VALUE SPACE.        07580000
075900     05  FILLER                  PIC  X(13)   VALUE               07590000
076000         '-------------'.                                         07600000
076100     05  FILLER                  PIC  X(02)   VALUE SPACE.        07610000
076200     05  FILLER                  PIC  X(09)   VALUE               07620000
076300         '---------'.                                             07630000
076400     05  FILLER                  PIC  X(02)   VALUE SPACE.        07640000
076500     05  FILLER                  PIC  X(04)   VALUE               07650000
076600         '----'.                                                  07660000
076700     05  FILLER                  PIC  X(01)   VALUE SPACE.        07670000
076800     05  FILLER                  PIC  X(10)   VALUE               07680000
076900         '----------'.                                            07690000
077000     05  FILLER                  PIC  X(08)   VALUE SPACE.        07700000
077100                                                                  07710000
077200 01  DL-DETAIL-LINE-1.                                            07720000
077300     05  FILLER                  PIC  X(04)    VALUE SPACE.       07730000
077400     05  DL1-SHIPT-UNT-ID        PIC  X(18).                      07740000
077500     05  FILLER                  PIC  X(02)    VALUE SPACE.       07750000
077600     05  DL1-CRTN-STATUS         PIC  X(19).                      07760000
077700     05  FILLER                  PIC  X(02)    VALUE SPACE.       07770000
077800     05  DL1-DATE.                                                07780000
077900         10  DL1-CC              PIC    XX.                       07790000
078000         10  DL1-YY              PIC    XX.                       07800000
078100         10  DL1-DASH1           PIC  X(01)    VALUE '-'.         07810000
078200         10  DL1-MM              PIC    XX.                       07820000
078300         10  DL1-DASH2           PIC  X(01)    VALUE '-'.         07830000
078400         10  DL1-DD              PIC    XX.                       07840000
078500     05  FILLER                  PIC  X(01)    VALUE ' '.         07850000
078600     05  DL1-TIME.                                                07860000
078700         10  DL1-HH              PIC    XX.                       07870000
078800         10  DL1-COLON           PIC  X(01)    VALUE ':'.         07880000
078900         10  DL1-MI              PIC    XX.                       07890000
079000     05  FILLER                  PIC  X(02)    VALUE SPACE.       07900000
079100     05  DL1-STATUS-USERID       PIC  X(07).                      07910000
079200     05  FILLER                  PIC  X(02)    VALUE SPACE.       07920000
079300     05  DL1-SHPUNT-SRC-ID       PIC  X(09).                      07930000
079400     05  FILLER                  PIC  X(02)    VALUE SPACE.       07940000
079500     05  DL1-PO-NBR              PIC  Z(09).                      07950000
079600     05  DL1-PO-DASH             PIC  X(01)    VALUE '-'.         07960000
079700     05  DL1-RCVR                PIC  X(04).                      07970000
079800     05  FILLER                  PIC  X(01)    VALUE SPACE.       07980000
079900     05  DL1-OTBD-TRIP-ID        PIC  X(09).                      07990000
080000     05  FILLER                  PIC  X(02)    VALUE SPACE.       08000000
080100     05  DL1-DEST-OPER-UNT-ID    PIC  Z(04).                      08010000
080200     05  FILLER                  PIC  X(01)    VALUE SPACE.       08020000
080300     05  DL1-TRIP-STATUS         PIC  X(10).                      08030000
080400     05  FILLER                  PIC  X(08)    VALUE SPACE.       08040000
080500                                                                  08050000
080600 01  DL-DETAIL-LINE-2.                                            08060000
080700     05  FILLER                  PIC  X(04)    VALUE SPACE.       08070000
080800     05  DL2-SHIPT-UNT-ID        PIC  X(18).                      08080000
080900     05  FILLER                  PIC  X(02)    VALUE SPACE.       08090000
081000     05  DL2-CRTN-STATUS         PIC  X(19).                      08100000
081100     05  FILLER                  PIC  X(02)    VALUE SPACE.       08110000
081200     05  DL2-DATE.                                                08120000
081300         10  DL2-CC              PIC    XX.                       08130000
081400         10  DL2-YY              PIC    XX.                       08140000
081500         10  DL2-DASH1           PIC  X(01)    VALUE '-'.         08150000
081600         10  DL2-MM              PIC    XX.                       08160000
081700         10  DL2-DASH2           PIC  X(01)    VALUE '-'.         08170000
081800         10  DL2-DD              PIC    XX.                       08180000
081900     05  FILLER                  PIC  X(01)    VALUE ' '.         08190000
082000     05  DL2-TIME.                                                08200000
082100         10  DL2-HH              PIC    XX.                       08210000
082200         10  DL2-COLON           PIC  X(01)    VALUE ':'.         08220000
082300         10  DL2-MI              PIC    XX.                       08230000
082400     05  FILLER                  PIC  X(02)    VALUE SPACE.       08240000
082500     05  DL2-STATUS-USERID       PIC  X(07).                      08250000
082600     05  FILLER                  PIC  X(02)    VALUE SPACE.       08260000
082700     05  DL2-SHPUNT-SRC-ID       PIC  X(09).                      08270000
082800     05  FILLER                  PIC  X(02)    VALUE SPACE.       08280000
082900     05  DL2-PO-NBR              PIC  Z(09).                      08290000
083000     05  DL2-PO-DASH             PIC  X(01)    VALUE '-'.         08300000
083100     05  DL2-RCVR                PIC  X(04).                      08310000
083200     05  FILLER                  PIC  X(01)    VALUE SPACE.       08320000
083300     05  DL2-OTBD-TRIP-ID        PIC  X(09).                      08330000
083400     05  FILLER                  PIC  X(02)    VALUE SPACE.       08340000
083500     05  DL2-DEST-OPER-UNT-ID    PIC  Z(04).                      08350000
083600     05  FILLER                  PIC  X(01)    VALUE SPACE.       08360000
083700     05  DL2-TRIP-STATUS         PIC  X(10).                      08370000
083800     05  FILLER                  PIC  X(08)    VALUE SPACE.       08380000
083900                                                                  08390000
084000 01  DL-DETAIL-LINE-3.                                            08400000
084100     05  FILLER                  PIC  X(04)    VALUE SPACE.       08410000
084200     05  DL3-SHIPT-UNT-ID        PIC  X(18).                      08420000
084300     05  FILLER                  PIC  X(02)    VALUE SPACE.       08430000
084400     05  DL3-CRTN-STATUS         PIC  X(19).                      08440000
084500     05  FILLER                  PIC  X(02)    VALUE SPACE.       08450000
084600     05  DL3-DATE.                                                08460000
084700         10  DL3-CC              PIC    XX.                       08470000
084800         10  DL3-YY              PIC    XX.                       08480000
084900         10  DL3-DASH1           PIC  X(01)    VALUE '-'.         08490000
085000         10  DL3-MM              PIC    XX.                       08500000
085100         10  DL3-DASH2           PIC  X(01)    VALUE '-'.         08510000
085200         10  DL3-DD              PIC    XX.                       08520000
085300     05  FILLER                  PIC  X(01)    VALUE ' '.         08530000
085400     05  DL3-TIME.                                                08540000
085500         10  DL3-HH              PIC    XX.                       08550000
085600         10  DL3-COLON           PIC  X(01)    VALUE ':'.         08560000
085700         10  DL3-MI              PIC    XX.                       08570000
085800     05  FILLER                  PIC  X(02)    VALUE SPACE.       08580000
085900     05  DL3-STATUS-USERID       PIC  X(07).                      08590000
086000     05  FILLER                  PIC  X(02)    VALUE SPACE.       08600000
086100     05  DL3-SHPUNT-SRC-ID       PIC  X(09).                      08610000
086200     05  FILLER                  PIC  X(02)    VALUE SPACE.       08620000
086300     05  DL3-PO-NBR              PIC  Z(09).                      08630000
086400     05  DL3-PO-DASH             PIC  X(01)    VALUE '-'.         08640000
086500     05  DL3-RCVR                PIC  X(04).                      08650000
086600     05  FILLER                  PIC  X(01)    VALUE SPACE.       08660000
086700     05  DL3-OTBD-TRIP-ID        PIC  X(09).                      08670000
086800     05  FILLER                  PIC  X(02)    VALUE SPACE.       08680000
086900     05  DL3-DEST-OPER-UNT-ID    PIC  Z(04).                      08690000
087000     05  FILLER                  PIC  X(01)    VALUE SPACE.       08700000
087100     05  DL3-TRIP-STATUS         PIC  X(10).                      08710000
087200     05  FILLER                  PIC  X(08)    VALUE SPACE.       08720000
087300                                                                  08730000
087400 01  DL-DETAIL-LINE-4.                                            08740000
087500     05  FILLER                  PIC  X(04)    VALUE SPACE.       08750000
087600     05  DL4-SHIPT-UNT-ID        PIC  X(18).                      08760000
087700     05  FILLER                  PIC  X(02)    VALUE SPACE.       08770000
087800     05  DL4-CRTN-STATUS         PIC  X(19).                      08780000
087900     05  FILLER                  PIC  X(02)    VALUE SPACE.       08790000
088000     05  DL4-DATE.                                                08800000
088100         10  DL4-CC              PIC    XX.                       08810000
088200         10  DL4-YY              PIC    XX.                       08820000
088300         10  DL4-DASH1           PIC  X(01)    VALUE '-'.         08830000
088400         10  DL4-MM              PIC    XX.                       08840000
088500         10  DL4-DASH2           PIC  X(01)    VALUE '-'.         08850000
088600         10  DL4-DD              PIC    XX.                       08860000
088700     05  FILLER                  PIC  X(01)    VALUE ' '.         08870000
088800     05  DL4-TIME.                                                08880000
088900         10  DL4-HH              PIC    XX.                       08890000
089000         10  DL4-COLON           PIC  X(01)    VALUE ':'.         08900000
089100         10  DL4-MI              PIC    XX.                       08910000
089200     05  FILLER                  PIC  X(02)    VALUE SPACE.       08920000
089300     05  DL4-STATUS-USERID       PIC  X(07).                      08930000
089400     05  FILLER                  PIC  X(02)    VALUE SPACE.       08940000
089500     05  DL4-SHPUNT-SRC-ID       PIC  X(09).                      08950000
089600     05  FILLER                  PIC  X(02)    VALUE SPACE.       08960000
089700     05  DL4-PO-NBR              PIC  Z(09).                      08970000
089800     05  DL4-PO-DASH             PIC  X(01)    VALUE '-'.         08980000
089900     05  DL4-RCVR                PIC  X(04).                      08990000
090000     05  FILLER                  PIC  X(01)    VALUE SPACE.       09000000
090100     05  DL4-OTBD-TRIP-ID        PIC  X(09).                      09010000
090200     05  FILLER                  PIC  X(02)    VALUE SPACE.       09020000
090300     05  DL4-DEST-OPER-UNT-ID    PIC  Z(04).                      09030000
090400     05  FILLER                  PIC  X(01)    VALUE SPACE.       09040000
090500     05  DL4-TRIP-STATUS         PIC  X(10).                      09050000
090600     05  FILLER                  PIC  X(08)    VALUE SPACE.       09060000
090700                                                                  09070000
090710 01  DL-DETAIL-LINE-4A.                                           09071020
090720     05  FILLER                  PIC  X(16)    VALUE SPACE.       09072025
090730     05  FILLER                  PIC  X(22)    VALUE              09073026
090731         'AUDIT SCAN DATE/TIME: '.                                09073125
090770     05  DL4A-DATE.                                               09077019
090780         10  DL4A-CC             PIC    XX.                       09078019
090790         10  DL4A-YY             PIC    XX.                       09079019
090791         10  DL4A-DASH1          PIC  X(01)    VALUE '-'.         09079119
090792         10  DL4A-MM             PIC    XX.                       09079219
090793         10  DL4A-DASH2          PIC  X(01)    VALUE '-'.         09079319
090794         10  DL4A-DD             PIC    XX.                       09079419
090795     05  FILLER                  PIC  X(01)    VALUE ' '.         09079519
090796     05  DL4A-TIME.                                               09079619
090797         10  DL4A-HH             PIC    XX.                       09079719
090798         10  DL4A-COLON1         PIC  X(01)    VALUE ':'.         09079819
090799         10  DL4A-MI             PIC    XX.                       09079919
090800         10  DL4A-COLON2         PIC  X(01)    VALUE ':'.         09080019
090801         10  DL4A-SS             PIC    XX.                       09080119
090802     05  FILLER                  PIC  X(05)    VALUE ' BY: '.     09080221
090803     05  DL4A-SCAN-USERID        PIC  X(08).                      09080319
090804     05  FILLER                  PIC  X(05)    VALUE SPACE.       09080419
090805     05  FILLER                  PIC  X(22)    VALUE              09080519
090806         'PRIOR SCAN DATE/TIME: '.                                09080619
090807     05  DL4A-PRIOR-DATE.                                         09080719
090808         10  DL4A-PRIOR-CC       PIC    XX.                       09080819
090809         10  DL4A-PRIOR-YY       PIC    XX.                       09080919
090810         10  DL4A-PRIOR-DASH1    PIC  X(01)    VALUE '-'.         09081019
090811         10  DL4A-PRIOR-MM       PIC    XX.                       09081119
090812         10  DL4A-PRIOR-DASH2    PIC  X(01)    VALUE '-'.         09081219
090813         10  DL4A-PRIOR-DD       PIC    XX.                       09081319
090814     05  FILLER                  PIC  X(01)    VALUE ' '.         09081419
090815     05  DL4A-PRIOR-TIME.                                         09081519
090816         10  DL4A-PRIOR-HH       PIC    XX.                       09081619
090817         10  DL4A-PRIOR-COLON1   PIC  X(01)    VALUE ':'.         09081719
090818         10  DL4A-PRIOR-MI       PIC    XX.                       09081819
090819         10  DL4A-PRIOR-COLON2   PIC  X(01)    VALUE ':'.         09081919
090820         10  DL4A-PRIOR-SS       PIC    XX.                       09082019
090821     05  FILLER                  PIC  X(05)    VALUE ' BY: '.     09082121
090823     05  DL4A-PRIOR-SCAN-USER-ID PIC  X(08).                      09082319
090824     05  FILLER                  PIC  X(03)    VALUE SPACE.       09082421
090836                                                                  09083619
090840 01  DL-DETAIL-LINE-5.                                            09084019
090900     05  FILLER                  PIC  X(04)    VALUE SPACE.       09090000
091000     05  DL5-SHIPT-UNT-ID        PIC  X(18).                      09100000
091100     05  FILLER                  PIC  X(02)    VALUE SPACE.       09110000
091200     05  DL5-CRTN-STATUS         PIC  X(19).                      09120000
091300     05  FILLER                  PIC  X(02)    VALUE SPACE.       09130000
091400     05  DL5-DATE.                                                09140000
091500         10  DL5-CC              PIC    XX.                       09150000
091600         10  DL5-YY              PIC    XX.                       09160000
091700         10  DL5-DASH1           PIC  X(01)    VALUE '-'.         09170000
091800         10  DL5-MM              PIC    XX.                       09180000
091900         10  DL5-DASH2           PIC  X(01)    VALUE '-'.         09190000
092000         10  DL5-DD              PIC    XX.                       09200000
092100     05  FILLER                  PIC  X(01)    VALUE ' '.         09210000
092200     05  DL5-TIME.                                                09220000
092300         10  DL5-HH              PIC    XX.                       09230000
092400         10  DL5-COLON           PIC  X(01)    VALUE ':'.         09240000
092500         10  DL5-MI              PIC    XX.                       09250000
092600     05  FILLER                  PIC  X(02)    VALUE SPACE.       09260000
092700     05  DL5-STATUS-USERID       PIC  X(07).                      09270000
092800     05  FILLER                  PIC  X(02)    VALUE SPACE.       09280000
092900     05  DL5-SHPUNT-SRC-ID       PIC  X(09).                      09290000
093000     05  FILLER                  PIC  X(02)    VALUE SPACE.       09300000
093100     05  DL5-PO-NBR              PIC  Z(09).                      09310000
093200     05  DL5-PO-DASH             PIC  X(01)    VALUE '-'.         09320000
093300     05  DL5-RCVR                PIC  X(04).                      09330000
093400     05  FILLER                  PIC  X(01)    VALUE SPACE.       09340000
093500     05  DL5-OTBD-TRIP-ID        PIC  X(09).                      09350000
093600     05  FILLER                  PIC  X(02)    VALUE SPACE.       09360000
093700     05  DL5-DEST-OPER-UNT-ID    PIC  Z(04).                      09370000
093800     05  FILLER                  PIC  X(01)    VALUE SPACE.       09380000
093900     05  DL5-TRIP-STATUS         PIC  X(10).                      09390000
094000     05  FILLER                  PIC  X(08)    VALUE SPACE.       09400000
094100                                                                  09410000
094200 01  DL-DETAIL-LINE-6.                                            09420000
094300     05  FILLER                  PIC  X(04)    VALUE SPACE.       09430000
094400     05  DL6-SHIPT-UNT-ID        PIC  X(18).                      09440000
094500     05  FILLER                  PIC  X(02)    VALUE SPACE.       09450000
094600     05  DL6-CRTN-STATUS         PIC  X(19).                      09460000
094700     05  FILLER                  PIC  X(02)    VALUE SPACE.       09470000
094800     05  DL6-DATE.                                                09480000
094900         10  DL6-CC              PIC    XX.                       09490000
095000         10  DL6-YY              PIC    XX.                       09500000
095100         10  DL6-DASH1           PIC  X(01)    VALUE '-'.         09510000
095200         10  DL6-MM              PIC    XX.                       09520000
095300         10  DL6-DASH2           PIC  X(01)    VALUE '-'.         09530000
095400         10  DL6-DD              PIC    XX.                       09540000
095500     05  FILLER                  PIC  X(01)    VALUE ' '.         09550000
095600     05  DL6-TIME.                                                09560000
095700         10  DL6-HH              PIC    XX.                       09570000
095800         10  DL6-COLON           PIC  X(01)    VALUE ':'.         09580000
095900         10  DL6-MI              PIC    XX.                       09590000
096000     05  FILLER                  PIC  X(02)    VALUE SPACE.       09600000
096100     05  DL6-STATUS-USERID       PIC  X(07).                      09610000
096200     05  FILLER                  PIC  X(02)    VALUE SPACE.       09620000
096300     05  DL6-SHPUNT-SRC-ID       PIC  X(09).                      09630000
096400     05  FILLER                  PIC  X(02)    VALUE SPACE.       09640000
096500     05  DL6-PO-NBR              PIC  Z(09).                      09650000
096600     05  DL6-PO-DASH             PIC  X(01)    VALUE '-'.         09660000
096700     05  DL6-RCVR                PIC  X(04).                      09670000
096800     05  FILLER                  PIC  X(01)    VALUE SPACE.       09680000
096900     05  DL6-OTBD-TRIP-ID        PIC  X(09).                      09690000
097000     05  FILLER                  PIC  X(02)    VALUE SPACE.       09700000
097100     05  DL6-DEST-OPER-UNT-ID    PIC  Z(04).                      09710000
097200     05  FILLER                  PIC  X(01)    VALUE SPACE.       09720000
097300     05  DL6-TRIP-STATUS         PIC  X(10).                      09730000
097400     05  FILLER                  PIC  X(08)    VALUE SPACE.       09740000
097500                                                                  09750000
097600 01  DL-DETAIL-LINE-7.                                            09760000
097700     05  FILLER                  PIC  X(04)    VALUE SPACE.       09770000
097800     05  DL7-SHIPT-UNT-ID        PIC  X(18).                      09780000
097900     05  FILLER                  PIC  X(02)    VALUE SPACE.       09790000
098000     05  DL7-CRTN-STATUS         PIC  X(19).                      09800000
098100     05  FILLER                  PIC  X(02)    VALUE SPACE.       09810000
098200     05  DL7-DATE.                                                09820000
098300         10  DL7-CC              PIC    XX.                       09830000
098400         10  DL7-YY              PIC    XX.                       09840000
098500         10  DL7-DASH1           PIC  X(01)    VALUE '-'.         09850000
098600         10  DL7-MM              PIC    XX.                       09860000
098700         10  DL7-DASH2           PIC  X(01)    VALUE '-'.         09870000
098800         10  DL7-DD              PIC    XX.                       09880000
098900     05  FILLER                  PIC  X(01)    VALUE ' '.         09890000
099000     05  DL7-TIME.                                                09900000
099100         10  DL7-HH              PIC    XX.                       09910000
099200         10  DL7-COLON           PIC  X(01)    VALUE ':'.         09920000
099300         10  DL7-MI              PIC    XX.                       09930000
099400     05  FILLER                  PIC  X(02)    VALUE SPACE.       09940000
099500     05  DL7-STATUS-USERID       PIC  X(07).                      09950000
099600     05  FILLER                  PIC  X(02)    VALUE SPACE.       09960000
099700     05  DL7-SHPUNT-SRC-ID       PIC  X(09).                      09970000
099800     05  FILLER                  PIC  X(02)    VALUE SPACE.       09980000
099900     05  DL7-PO-NBR              PIC  Z(09).                      09990000
100000     05  DL7-PO-DASH             PIC  X(01)    VALUE '-'.         10000000
100100     05  DL7-RCVR                PIC  X(04).                      10010000
100200     05  FILLER                  PIC  X(01)    VALUE SPACE.       10020000
100300     05  DL7-OTBD-TRIP-ID        PIC  X(09).                      10030000
100400     05  FILLER                  PIC  X(02)    VALUE SPACE.       10040000
100500     05  DL7-DEST-OPER-UNT-ID    PIC  Z(04).                      10050000
100600     05  FILLER                  PIC  X(01)    VALUE SPACE.       10060000
100700     05  DL7-TRIP-STATUS         PIC  X(10).                      10070000
100800     05  FILLER                  PIC  X(08)    VALUE SPACE.       10080000
100900                                                                  10090000
101000 01  DL-DETAIL-LINE-8.                                            10100000
101100     05  FILLER                  PIC  X(04)    VALUE SPACE.       10110000
101200     05  DL8-SHIPT-UNT-ID        PIC  X(18).                      10120000
101300     05  FILLER                  PIC  X(02)    VALUE SPACE.       10130000
101400     05  DL8-CRTN-STATUS         PIC  X(19).                      10140000
101500     05  FILLER                  PIC  X(02)    VALUE SPACE.       10150000
101600     05  DL8-DATE.                                                10160000
101700         10  DL8-CC              PIC    XX.                       10170000
101800         10  DL8-YY              PIC    XX.                       10180000
101900         10  DL8-DASH1           PIC  X(01)    VALUE '-'.         10190000
102000         10  DL8-MM              PIC    XX.                       10200000
102100         10  DL8-DASH2           PIC  X(01)    VALUE '-'.         10210000
102200         10  DL8-DD              PIC    XX.                       10220000
102300     05  FILLER                  PIC  X(01)    VALUE ' '.         10230000
102400     05  DL8-TIME.                                                10240000
102500         10  DL8-HH              PIC    XX.                       10250000
102600         10  DL8-COLON           PIC  X(01)    VALUE ':'.         10260000
102700         10  DL8-MI              PIC    XX.                       10270000
102800     05  FILLER                  PIC  X(02)    VALUE SPACE.       10280000
102900     05  DL8-STATUS-USERID       PIC  X(07).                      10290000
103000     05  FILLER                  PIC  X(02)    VALUE SPACE.       10300000
103100     05  DL8-SHPUNT-SRC-ID       PIC  X(09).                      10310000
103200     05  FILLER                  PIC  X(02)    VALUE SPACE.       10320000
103300     05  DL8-PO-NBR              PIC  Z(09).                      10330000
103400     05  DL8-PO-DASH             PIC  X(01)    VALUE '-'.         10340000
103500     05  DL8-RCVR                PIC  X(04).                      10350000
103600     05  FILLER                  PIC  X(01)    VALUE SPACE.       10360000
103700     05  DL8-OTBD-TRIP-ID        PIC  X(09).                      10370000
103800     05  FILLER                  PIC  X(02)    VALUE SPACE.       10380000
103900     05  DL8-DEST-OPER-UNT-ID    PIC  Z(04).                      10390000
104000     05  FILLER                  PIC  X(01)    VALUE SPACE.       10400000
104100     05  DL8-TRIP-STATUS         PIC  X(10).                      10410000
104200     05  FILLER                  PIC  X(08)    VALUE SPACE.       10420000
104300                                                                  10430000
104400 01  DL-DETAIL-LINE-9.                                            10440000
104500     05  FILLER                  PIC  X(04)    VALUE SPACE.       10450000
104600     05  DL9-SHIPT-UNT-ID        PIC  X(18).                      10460000
104700     05  FILLER                  PIC  X(02)    VALUE SPACE.       10470000
104800     05  DL9-CRTN-STATUS         PIC  X(19).                      10480000
104900     05  FILLER                  PIC  X(02)    VALUE SPACE.       10490000
105000     05  DL9-DATE.                                                10500000
105100         10  DL9-CC              PIC    XX.                       10510000
105200         10  DL9-YY              PIC    XX.                       10520000
105300         10  DL9-DASH1           PIC  X(01)    VALUE '-'.         10530000
105400         10  DL9-MM              PIC    XX.                       10540000
105500         10  DL9-DASH2           PIC  X(01)    VALUE '-'.         10550000
105600         10  DL9-DD              PIC    XX.                       10560000
105700     05  FILLER                  PIC  X(01)    VALUE ' '.         10570000
105800     05  DL9-TIME.                                                10580000
105900         10  DL9-HH              PIC    XX.                       10590000
106000         10  DL9-COLON           PIC  X(01)    VALUE ':'.         10600000
106100         10  DL9-MI              PIC    XX.                       10610000
106200     05  FILLER                  PIC  X(02)    VALUE SPACE.       10620000
106300     05  DL9-STATUS-USERID       PIC  X(07).                      10630000
106400     05  FILLER                  PIC  X(02)    VALUE SPACE.       10640000
106500     05  DL9-SHPUNT-SRC-ID       PIC  X(09).                      10650000
106600     05  FILLER                  PIC  X(02)    VALUE SPACE.       10660000
106700     05  DL9-PO-NBR              PIC  Z(09).                      10670000
106800     05  DL9-PO-DASH             PIC  X(01)    VALUE '-'.         10680000
106900     05  DL9-RCVR                PIC  X(04).                      10690000
107000     05  FILLER                  PIC  X(01)    VALUE SPACE.       10700000
107100     05  DL9-OTBD-TRIP-ID        PIC  X(09).                      10710000
107200     05  FILLER                  PIC  X(02)    VALUE SPACE.       10720000
107300     05  DL9-DEST-OPER-UNT-ID    PIC  Z(04).                      10730000
107400     05  FILLER                  PIC  X(01)    VALUE SPACE.       10740000
107500     05  DL9-TRIP-STATUS         PIC  X(10).                      10750000
107600     05  FILLER                  PIC  X(08)    VALUE SPACE.       10760000
107700                                                                  10770000
107800 01  DL-DETAIL-LINE-10.                                           10780000
107900     05  FILLER                  PIC  X(04)    VALUE SPACE.       10790000
108000     05  DL10-SHIPT-UNT-ID       PIC  X(18).                      10800000
108100     05  FILLER                  PIC  X(02)    VALUE SPACE.       10810000
108200     05  DL10-CRTN-STATUS        PIC  X(19).                      10820000
108300     05  FILLER                  PIC  X(02)    VALUE SPACE.       10830000
108400     05  DL10-DATE.                                               10840000
108500         10  DL10-CC             PIC    XX.                       10850000
108600         10  DL10-YY             PIC    XX.                       10860000
108700         10  DL10-DASH1          PIC  X(01)    VALUE '-'.         10870000
108800         10  DL10-MM             PIC    XX.                       10880000
108900         10  DL10-DASH2          PIC  X(01)    VALUE '-'.         10890000
109000         10  DL10-DD             PIC    XX.                       10900000
109100     05  FILLER                  PIC  X(01)    VALUE ' '.         10910000
109200     05  DL10-TIME.                                               10920000
109300         10  DL10-HH             PIC    XX.                       10930000
109400         10  DL10-COLON          PIC  X(01)    VALUE ':'.         10940000
109500         10  DL10-MI             PIC    XX.                       10950000
109600     05  FILLER                  PIC  X(02)    VALUE SPACE.       10960000
109700     05  DL10-STATUS-USERID      PIC  X(07).                      10970000
109800     05  FILLER                  PIC  X(02)    VALUE SPACE.       10980000
109900     05  DL10-SHPUNT-SRC-ID      PIC  X(09).                      10990000
110000     05  FILLER                  PIC  X(02)    VALUE SPACE.       11000000
110100     05  DL10-PO-NBR             PIC  Z(09).                      11010000
110200     05  DL10-PO-DASH            PIC  X(01)    VALUE '-'.         11020000
110300     05  DL10-RCVR               PIC  X(04).                      11030000
110400     05  FILLER                  PIC  X(01)    VALUE SPACE.       11040000
110500     05  DL10-OTBD-TRIP-ID       PIC  X(09).                      11050000
110600     05  FILLER                  PIC  X(02)    VALUE SPACE.       11060000
110700     05  DL10-DEST-OPER-UNT-ID   PIC  Z(04).                      11070000
110800     05  FILLER                  PIC  X(01)    VALUE SPACE.       11080000
110900     05  DL10-TRIP-STATUS        PIC  X(10).                      11090000
111000     05  FILLER                  PIC  X(08)    VALUE SPACE.       11100000
111100                                                                  11110000
111200 01  SUMMARY-HEADING-LINE1.                                       11120000
111300     05  FILLER                  PIC  X(54)    VALUE SPACE.       11130000
111400     05  FILLER                  PIC  X(24)    VALUE              11140000
111500         'TRAILER AUDIT BY CARTONS'.                              11150000
111600     05  FILLER                  PIC  X(54)    VALUE SPACE.       11160000
111700                                                                  11170000
111800 01  SUMMARY-HEADING-LINE2.                                       11180000
111900     05  FILLER                  PIC  X(59)    VALUE SPACE.       11190000
112000     05  FILLER                  PIC  X(14)    VALUE              11200000
112100         'SUMMARY REPORT'.                                        11210000
112200     05  FILLER                  PIC  X(59)    VALUE SPACE.       11220000
112300                                                                  11230000
112400 01  SUMMARY-HEADING-LINE3.                                       11240000
112500     05  FILLER                  PIC  X(02)    VALUE SPACE.       11250000
112600     05  FILLER                  PIC  X(09)    VALUE              11260000
112700         'FACILITY:'.                                             11270000
112800     05  FILLER                  PIC  X(02)    VALUE SPACE.       11280000
112900     05  SL3-FCLTY-ID            PIC  9(04)    VALUE ZERO.        11290000
113000     05  FILLER                  PIC  X(02)    VALUE SPACE.       11300000
113100     05  FILLER                  PIC  X(01)    VALUE '-'.         11310000
113200     05  FILLER                  PIC  X(02)    VALUE SPACE.       11320000
113300     05  SL3-FCLTY-NME           PIC  X(25)    VALUE SPACE.       11330000
113400     05  FILLER                  PIC  X(85)    VALUE SPACE.       11340000
113500                                                                  11350000
113600 01  SUMMARY-HEADING-LINE4.                                       11360000
113700     05  FILLER                  PIC  X(02)    VALUE SPACE.       11370000
113800     05  FILLER                  PIC  X(27)    VALUE              11380000
113900         'AUDIT CONTROL NBR.........:'.                           11390000
114000     05  FILLER                  PIC  X(02)    VALUE SPACE.       11400000
114100     05  SL4-AUD-CNTL-NBR        PIC  9(09)    VALUE ZERO.        11410000
114200     05  FILLER                  PIC  X(09)    VALUE SPACE.       11420000
114300     05  FILLER                  PIC  X(27)    VALUE              11430000
114400         'AUDIT TYPE................:'.                           11440000
114500     05  FILLER                  PIC  X(02)    VALUE SPACE.       11450000
114600     05  SL4-AUD-TYP-CDE         PIC  X(06)    VALUE SPACE.       11460000
114700     05  FILLER                  PIC  X(12)    VALUE SPACE.       11470000
114800     05  FILLER                  PIC  X(17)    VALUE              11480000
114900         'AUDIT STATUS....:'.                                     11490000
115000     05  FILLER                  PIC  X(02)    VALUE SPACE.       11500000
115100     05  SL4-AUD-STAT-CDE        PIC  X(16)    VALUE SPACE.       11510000
115200     05  FILLER                  PIC  X(01)    VALUE SPACE.       11520000
115300                                                                  11530000
115400 01  SUMMARY-HEADING-LINE5.                                       11540000
115500     05  FILLER                  PIC  X(02)    VALUE SPACE.       11550000
115600     05  FILLER                  PIC  X(27)    VALUE              11560000
115700         'AUDIT START...............:'.                           11570000
115800     05  FILLER                  PIC  X(02)    VALUE SPACE.       11580000
115900*STRT TIMESTAMP                                                   11590000
116000     05  SL5-STRT-DATE.                                           11600000
116100         10  SL5-STRT-MM         PIC 99.                          11610000
116200         10  FILLER              PIC X(01) VALUE '-'.             11620000
116300         10  SL5-STRT-DD         PIC 99.                          11630000
116400         10  FILLER              PIC X(01) VALUE '-'.             11640000
116500         10  SL5-STRT-CC         PIC 99.                          11650000
116600         10  SL5-STRT-YY         PIC 99.                          11660000
116700     05  FILLER                  PIC X(01) VALUE ' '.             11670000
116800     05  SL5-STRT-TIME.                                           11680000
116900         10  SL5-STRT-HH         PIC X(02).                       11690000
117000         10  FILLER              PIC X(01) VALUE ':'.             11700000
117100         10  SL5-STRT-MI         PIC X(02).                       11710000
117200     05  FILLER                  PIC X(02)    VALUE SPACE.        11720000
117300     05  FILLER                  PIC X(27)    VALUE               11730000
117400         'AUDIT STOP................:'.                           11740000
117500     05  FILLER                  PIC X(02)    VALUE SPACE.        11750000
117600*STP TIMESTAMP                                                    11760000
117700     05  SL5-STP-DATE.                                            11770000
117800         10  SL5-STP-MM          PIC X(02).                       11780000
117900         10  SL5-DASH1           PIC X(01) VALUE '-'.             11790000
118000         10  SL5-STP-DD          PIC X(02).                       11800000
118100         10  SL5-DASH2           PIC X(01) VALUE '-'.             11810000
118200         10  SL5-STP-CC          PIC X(02).                       11820000
118300         10  SL5-STP-YY          PIC X(02).                       11830000
118400     05  FILLER                  PIC X(01) VALUE ' '.             11840000
118500     05  SL5-STP-TIME.                                            11850000
118600         10  SL5-STP-HH          PIC X(02).                       11860000
118700         10  SL5-COLON           PIC X(01) VALUE ':'.             11870000
118800         10  SL5-STP-MI          PIC X(02).                       11880000
118900     05  FILLER                  PIC  X(02)    VALUE SPACE.       11890000
119000     05  FILLER                  PIC  X(17)    VALUE              11900000
119100         'DURATION(HH:MM).:'.                                     11910000
119200     05  FILLER                  PIC  X(02)    VALUE SPACE.       11920000
119300     05  SL5-AUD-DURATION        PIC  X(05)    VALUE SPACE.       11930000
119400     05  FILLER                  PIC  X(08)    VALUE SPACE.       11940000
119500                                                                  11950000
119600 01  SUMMARY-HEADING-LINE6.                                       11960000
119700     05  FILLER                  PIC  X(02)    VALUE SPACE.       11970000
119800     05  FILLER                  PIC  X(27)    VALUE              11980000
119900         'ORIG TRAILER SERIAL NBR...:'.                           11990000
120000     05  FILLER                  PIC  X(02)    VALUE SPACE.       12000000
120100     05  SL6-ORIG-TRLR-SER-NBR   PIC  9(09)    VALUE ZERO.        12010000
120200     05  FILLER                  PIC  X(09)    VALUE SPACE.       12020000
120300     05  FILLER                  PIC  X(27)    VALUE              12030000
120400         'DEST TRAILER SERIAL NBR...:'.                           12040000
120500     05  FILLER                  PIC  X(02)    VALUE SPACE.       12050000
120600     05  SL6-DEST-TRLR-SER-NBR   PIC  Z(09).                      12060000
120700     05  FILLER                  PIC  X(09)    VALUE SPACE.       12070000
120800     05  FILLER                  PIC  X(17)    VALUE              12080000
120900         'AUDIT TO TRLR...:'.                                     12090000
121000     05  FILLER                  PIC  X(02)    VALUE SPACE.       12100000
121100     05  SL6-DEST-TYP-CDE        PIC  X(09)    VALUE SPACE.       12110000
121200     05  FILLER                  PIC  X(04)    VALUE SPACE.       12120000
121300                                                                  12130000
121400 01  SUMMARY-HEADING-LINE7.                                       12140000
121500     05  FILLER                  PIC  X(02)    VALUE SPACE.       12150000
121600     05  FILLER                  PIC  X(27)    VALUE              12160000
121700         'ORIG TRAILER TRIP ID......:'.                           12170000
121800     05  FILLER                  PIC  X(02)    VALUE SPACE.       12180000
121900     05  SL7-ORIG-TRIP-ID        PIC  9(09)    VALUE ZERO.        12190000
122000     05  FILLER                  PIC  X(09)    VALUE SPACE.       12200000
122100     05  FILLER                  PIC  X(27)    VALUE              12210000
122200         'DEST TRAILER TRIP ID......:'.                           12220000
122300     05  FILLER                  PIC  X(02)    VALUE SPACE.       12230000
122400     05  SL7-DEST-TRIP-ID        PIC  Z(09).                      12240000
122500     05  FILLER                  PIC  X(09)    VALUE SPACE.       12250000
122600     05  FILLER                  PIC  X(17)    VALUE              12260000
122700         'STORE...........:'.                                     12270000
122800     05  FILLER                  PIC  X(02)    VALUE SPACE.       12280000
122900     05  SL7-DEST-OPER-UNT-ID    PIC  Z(04)    VALUE ZERO.        12290000
123000     05  FILLER                  PIC  X(13)    VALUE SPACE.       12300000
123100                                                                  12310000
123200 01  SUMMARY-HEADING-LINE8.                                       12320000
123300     05  FILLER                  PIC  X(02)    VALUE SPACE.       12330000
123400     05  FILLER                  PIC  X(27)    VALUE              12340000
123500         'ASSOCIATE INITIATING AUDIT:'.                           12350000
123600     05  FILLER                  PIC  X(02)    VALUE SPACE.       12360000
123700     05  SL8-AUD-USR-ID          PIC  X(07)    VALUE SPACE.       12370000
123800     05  FILLER                  PIC  X(58)    VALUE SPACE.       12380000
123900     05  FILLER                  PIC  X(17)    VALUE              12390000
124000         'DOOR ID.........:'.                                     12400000
124100     05  FILLER                  PIC  X(02)    VALUE SPACE.       12410000
124200     05  SL8-DOOR-ID             PIC  X(04)    VALUE SPACE.       12420000
124300                                                                  12430014
124400*01  SUMMARY-HEADING-LINE9.                                       12440014
124500*    05  FILLER                  PIC  X(02)    VALUE SPACE.       12450014
124600*    05  FILLER                  PIC  X(20)    VALUE              12460014
124700*        'AUDITED CARTONS....:'.                                  12470014
124800*    05  FILLER                  PIC  X(02)    VALUE SPACE.       12480014
124900*    05  SL9-AUD-CTN-QTY         PIC  ZZ,ZZZ,ZZ9.                 12490014
125000*    05  FILLER                  PIC  X(15)    VALUE SPACE.       12500014
125100*    05  FILLER                  PIC  X(28)    VALUE              12510014
125200*        'AUDITED CARTONS IN ERROR...:'.                          12520014
125300*    05  FILLER                  PIC  X(02)    VALUE SPACE.       12530014
125400*    05  SL9-AUD-CTN-ERR-QTY     PIC  ZZ,ZZZ,ZZ9.                 12540014
125500*    05  FILLER                  PIC  X(43)    VALUE SPACE.       12550014
125600                                                                  12560000
125700*SL10-MFST-CTN-ERR-QTY IS THE MANIFESTED AND AUDITED CARTONS      12570000
125800*WITH ERRORS.                                                     12580000
125900                                                                  12590000
126000 01  SUMMARY-HEADING-LINE10.                                      12600000
126100     05  FILLER                  PIC  X(02)    VALUE SPACE.       12610000
126110     05  SL10-CTN-DESC           PIC  X(20)    VALUE SPACE.       12611028
126200*    05  FILLER                  PIC  X(20)    VALUE              12620028
126300*        'MANIFESTED CARTONS.:'.                                  12630028
126400     05  FILLER                  PIC  X(02)    VALUE SPACE.       12640000
126500     05  SL10-MFST-CTN-QTY       PIC  ZZ,ZZZ,ZZ9.                 12650000
126600     05  FILLER                  PIC  X(15)    VALUE SPACE.       12660000
126700     05  FILLER                  PIC  X(27)    VALUE              12670014
126800         'UNIQUE CARTONS IN ERROR..:'.                            12680031
126900     05  FILLER                  PIC  X(02)    VALUE SPACE.       12690000
127000     05  SL10-MFST-CTN-ERR-QTY   PIC  ZZ,ZZZ,ZZ9.                 12700000
127100     05  FILLER                  PIC  X(08)    VALUE SPACE.       12710014
127200     05  FILLER                  PIC  X(19)    VALUE              12720000
127300         'TOTAL ACCURACY RATE'.                                   12730000
127400     05  FILLER                  PIC  X(02)    VALUE SPACE.       12740000
127500     05  SL10-TOT-ACC-RATE       PIC  ZZ9.99.                     12750015
127600     05  FILLER                  PIC  X(01)    VALUE              12760000
127700         '%'.                                                     12770000
127800     05  FILLER                  PIC  X(08)    VALUE SPACE.       12780010
127900                                                                  12790000
128000 01  SUMMARY-HEADING-LINE11.                                      12800000
128100     05  FILLER                  PIC  X(02)    VALUE SPACE.       12810000
128200     05  FILLER                  PIC  X(20)    VALUE              12820000
128300         'AUDITING ASSOCIATES:'.                                  12830000
128400     05  FILLER                  PIC  X(02)    VALUE SPACE.       12840000
128500     05  SL11-USERID-TABLE.                                       12850000
128600         10 FILLER  OCCURS 11 TIMES                               12860000
128700                    INDEXED BY SL11-USERID-IDX.                   12870000
128800            15 SL11-USERID      PIC  X(07) VALUE SPACE.           12880000
128900            15 SL11-COMMA       PIC  X(01) VALUE SPACE.           12890000
129000            15 FILLER           PIC  X(01) VALUE SPACE.           12900000
129100                                                                  12910000
129200 01  SUMMARY-HEADING-LINE12.                                      12920000
129300     05  FILLER                  PIC  X(58)    VALUE SPACE.       12930000
129400     05  FILLER                  PIC  X(09)    VALUE              12940000
129500         'NUMBER OF'.                                             12950000
129600     05  FILLER                  PIC  X(07)    VALUE SPACE.       12960016
129700     05  FILLER                  PIC  X(04)    VALUE              12970000
129800         '% IN'.                                                  12980000
129900     05  FILLER                  PIC  X(54)    VALUE SPACE.       12990016
130000                                                                  13000000
130100 01  SUMMARY-HEADING-LINE13.                                      13010000
130200     05  FILLER                  PIC  X(59)    VALUE SPACE.       13020000
130300     05  FILLER                  PIC  X(07)    VALUE              13030000
130400         'ERRORS '.                                               13040031
130500     05  FILLER                  PIC  X(08)    VALUE SPACE.       13050016
130600     05  FILLER                  PIC  X(05)    VALUE              13060000
130700         'ERROR'.                                                 13070000
130800     05  FILLER                  PIC  X(53)    VALUE SPACE.       13080016
130900                                                                  13090000
131000 01  SUMMARY-HEADING-LINE13A.                                     13100031
131100     05  FILLER                  PIC  X(02)    VALUE SPACE.       13110000
131200     05  FILLER                  PIC  X(40)    VALUE              13120031
131300         'CARTON AUDIT  -  TOTAL NUMBER OF ERRORS:'.              13130031
131400     05  FILLER                  PIC  X(16)    VALUE SPACE.       13140031
131500     05  SL13A-NBR-ERRORS        PIC  ZZZ,ZZ9.                    13150031
131600     05  FILLER                  PIC  X(14)    VALUE SPACE.       13160031
132000     05  FILLER                  PIC  X(53)    VALUE SPACE.       13200010
132010                                                                  13201031
132020 01  SUMMARY-HEADING-LINE14.                                      13202031
132030     05  FILLER                  PIC  X(02)    VALUE SPACE.       13203031
132040     05  FILLER                  PIC  X(26)    VALUE              13204031
132050         'CARTON AUDIT  -  MISLOADS:'.                            13205031
132060     05  FILLER                  PIC  X(30)    VALUE SPACE.       13206031
132070     05  SL14-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13207031
132080     05  FILLER                  PIC  X(07)    VALUE SPACE.       13208031
132090     05  SL14-PRCT-ERROR         PIC  ZZ9.99.                     13209031
132091     05  FILLER                  PIC  X(01)    VALUE              13209131
132092         '%'.                                                     13209231
132093     05  FILLER                  PIC  X(53)    VALUE SPACE.       13209331
132100                                                                  13210000
132200 01  SUMMARY-HEADING-LINE15.                                      13220000
132300     05  FILLER                  PIC  X(02)    VALUE SPACE.       13230000
132400     05  FILLER                  PIC  X(40)    VALUE              13240000
132500         'CARTON AUDIT  -  NOT MANIFESTED TO TRLR:'.              13250000
132600     05  FILLER                  PIC  X(16)    VALUE SPACE.       13260000
132700     05  SL15-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13270000
132800     05  FILLER                  PIC  X(07)    VALUE SPACE.       13280000
132900     05  SL15-PRCT-ERROR         PIC  ZZ9.99.                     13290015
133000     05  FILLER                  PIC  X(01)    VALUE              13300000
133100         '%'.                                                     13310000
133200     05  FILLER                  PIC  X(53)    VALUE SPACE.       13320010
133300                                                                  13330000
133400 01  SUMMARY-HEADING-LINE16.                                      13340000
133500     05  FILLER                  PIC  X(02)    VALUE SPACE.       13350000
133600     05  FILLER                  PIC  X(41)    VALUE              13360000
133700         'CARTON AUDIT  -  CARTON CONTENTS UNKNOWN:'.             13370000
133800     05  FILLER                  PIC  X(15)    VALUE SPACE.       13380000
133900     05  SL16-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13390000
134000     05  FILLER                  PIC  X(07)    VALUE SPACE.       13400000
134100     05  SL16-PRCT-ERROR         PIC  ZZ9.99.                     13410015
134200     05  FILLER                  PIC  X(01)    VALUE              13420000
134300         '%'.                                                     13430000
134400     05  FILLER                  PIC  X(53)    VALUE SPACE.       13440010
134500                                                                  13450000
134600 01  SUMMARY-HEADING-LINE17.                                      13460000
134700     05  FILLER                  PIC  X(02)    VALUE SPACE.       13470000
134800     05  FILLER                  PIC  X(32)    VALUE              13480000
134900         'CARTON AUDIT  -  DUPLICATE SCAN:'.                      13490000
135000     05  FILLER                  PIC  X(24)    VALUE SPACE.       13500000
135100     05  SL17-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13510000
135200     05  FILLER                  PIC  X(07)    VALUE SPACE.       13520000
135300     05  SL17-PRCT-ERROR         PIC  ZZ9.99.                     13530015
135400     05  FILLER                  PIC  X(01)    VALUE              13540000
135500         '%'.                                                     13550000
135600     05  FILLER                  PIC  X(53)    VALUE SPACE.       13560010
135700                                                                  13570000
135800 01  SUMMARY-HEADING-LINE18.                                      13580000
135900     05  FILLER                  PIC  X(02)    VALUE SPACE.       13590000
136000     05  FILLER                  PIC  X(34)    VALUE              13600000
136100         'CARTON AUDIT  -  CARTONS INACTIVE:'.                    13610000
136200     05  FILLER                  PIC  X(22)    VALUE SPACE.       13620000
136300     05  SL18-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13630000
136400     05  FILLER                  PIC  X(07)    VALUE SPACE.       13640000
136500     05  SL18-PRCT-ERROR         PIC  ZZ9.99.                     13650015
136600     05  FILLER                  PIC  X(01)    VALUE              13660000
136700         '%'.                                                     13670000
136800     05  FILLER                  PIC  X(53)    VALUE SPACE.       13680010
136900                                                                  13690000
137000 01  SUMMARY-HEADING-LINE19.                                      13700000
137100     05  FILLER                  PIC  X(02)    VALUE SPACE.       13710000
137200     05  FILLER                  PIC  X(45)    VALUE              13720000
137300         'CARTON AUDIT  -  CARTONS NOT FOUND IN SYSTEM:'.         13730000
137400     05  FILLER                  PIC  X(11)    VALUE SPACE.       13740000
137500     05  SL19-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13750000
137600     05  FILLER                  PIC  X(07)    VALUE SPACE.       13760000
137700     05  SL19-PRCT-ERROR         PIC  ZZ9.99.                     13770015
137800     05  FILLER                  PIC  X(01)    VALUE              13780000
137900         '%'.                                                     13790000
138000     05  FILLER                  PIC  X(53)    VALUE SPACE.       13800010
138100                                                                  13810000
138200 01  SUMMARY-HEADING-LINE20.                                      13820000
138300     05  FILLER                  PIC  X(02)    VALUE SPACE.       13830000
138400     05  FILLER                  PIC  X(43)    VALUE              13840011
138500         'CARTON MNFST  -  MANIFESTED NOT ON TRAILER:'.           13850009
138600     05  FILLER                  PIC  X(13)    VALUE SPACE.       13860014
138700     05  SL20-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13870000
138800     05  FILLER                  PIC  X(07)    VALUE SPACE.       13880000
138900     05  SL20-PRCT-ERROR         PIC  ZZ9.99.                     13890015
139000     05  FILLER                  PIC  X(01)    VALUE              13900000
139100         '%'.                                                     13910000
139200     05  FILLER                  PIC  X(53)    VALUE SPACE.       13920010
139300                                                                  13930000
139400 01  SUMMARY-HEADING-LINE21.                                      13940000
139500     05  FILLER                  PIC  X(02)    VALUE SPACE.       13950000
139600     05  FILLER                  PIC  X(32)    VALUE              13960000
139700         'CARTON AUDIT  -  ERRORS (OTHER):'.                      13970000
139800     05  FILLER                  PIC  X(24)    VALUE SPACE.       13980000
139900     05  SL21-NBR-CRTNS          PIC  ZZZ,ZZ9.                    13990000
140000     05  FILLER                  PIC  X(07)    VALUE SPACE.       14000000
140100     05  SL21-PRCT-ERROR         PIC  ZZ9.99.                     14010015
140200     05  FILLER                  PIC  X(01)    VALUE              14020000
140300         '%'.                                                     14030000
140400     05  FILLER                  PIC  X(53)    VALUE SPACE.       14040010
140500                                                                  14050000
140600*01  SUMMARY-HEADING-LINE22.                                      14060030
140700*    05  FILLER                  PIC  X(02)    VALUE SPACE.       14070030
140800*    05  FILLER                  PIC  X(43)    VALUE              14080030
140900*        'I N F O R M A T I O N A L   M E S S A G E S'.           14090030
141000*    05  FILLER                  PIC  X(87)    VALUE SPACE.       14100030
141100                                                                  14110010
141200*01  SUMMARY-HEADING-LINE23.                                      14120010
141300*    05  FILLER                  PIC  X(02)    VALUE SPACE.       14130010
141400*    05  FILLER                  PIC  X(42)    VALUE              14140010
141500*        'CARTON AUDIT  -  CREATED FROM NON-MFST DC:'.            14150010
141600*    05  FILLER                  PIC  X(14)    VALUE SPACE.       14160010
141700*    05  SL23-NBR-CRTNS          PIC  ZZZ,ZZ9.                    14170010
141800*    05  FILLER                  PIC  X(07)    VALUE SPACE.       14180010
141900*    05  SL23-PRCT-ERROR         PIC  ZZ9.99.                     14190015
142000*    05  FILLER                  PIC  X(01)    VALUE              14200010
142100*        '%'.                                                     14210010
142200*    05  FILLER                  PIC  X(53)    VALUE SPACE.       14220010
142300                                                                  14230000
142400*01  SUMMARY-HEADING-LINE24.                                      14240010
142500*    05  FILLER                  PIC  X(02)    VALUE SPACE.       14250010
142600*    05  FILLER                  PIC  X(54)    VALUE              14260010
142700*        'CARTON MNFST  -  NOT AUDITED-CREATED FROM NON-MFST DC:'.14270010
142800*    05  FILLER                  PIC  X(02)    VALUE SPACE.       14280010
142900*    05  SL24-NBR-CRTNS          PIC  ZZZ,ZZ9.                    14290010
143000*    05  FILLER                  PIC  X(07)    VALUE SPACE.       14300010
143100*    05  SL24-PRCT-ERROR         PIC  ZZ9.99.                     14310015
143200*    05  FILLER                  PIC  X(01)    VALUE              14320010
143300*        '%'.                                                     14330010
143400*    05  FILLER                  PIC  X(53)    VALUE SPACE.       14340010
143500                                                                  14350000
143600                                                                  14360000
143700 01  MISCELLANEOUS-LINES.                                         14370000
143800     05  END-OF-REPORT-LINE.                                      14380000
143900         10  FILLER                  PIC  X(44)    VALUE SPACES.  14390000
144000         10  FILLER                  PIC  X(45)    VALUE          14400000
144100             '*******   E N D   O F   R E P O R T   *******'.     14410000
144200         10  FILLER                  PIC  X(43)    VALUE SPACES.  14420000
144300     05  NO-DATA-TO-REPORT-LINE.                                  14430000
144400         10  FILLER                  PIC  X(40)    VALUE SPACES.  14440000
144500         10  FILLER                  PIC  X(52)    VALUE          14450000
144600         '*******  N O   C A R T O N  E R R O R S      *******'.  14460000
144700         10  FILLER                  PIC  X(40)    VALUE SPACES.  14470000
144800                                                                  14480000
144900                                                                  14490000
145000 01  DN-DB2-NULL-INDICATORS.                                      14500000
145100     05  DN-ORIG-TRIP-ID             PIC S9(04) COMP VALUE +0.    14510000
145200     05  DN-DEST-TRIP-ID             PIC S9(04) COMP VALUE +0.    14520000
145300                                                                  14530000
145400*  PCWS049 - WORK FIELDS USED TO DETERMINE TRAILER CONTENTS       14540000
145500     COPY PCWS049.                                                14550000
145600                                                                  14560000
145700*** DB2 MESSAGE AREAS ****                                        14570000
145800     COPY DPWS004.                                                14580000
145900                                                                  14590000
146000* AUDIT TRAILER CARTON DETAIL TABLE                               14600000
146100* SUT_AUD_TRLR_CART                                               14610000
146200     EXEC SQL                                                     14620000
146300          INCLUDE SUT00000                                        14630000
146400     END-EXEC.                                                    14640000
146500                                                                  14650000
146600* AUDIT TRAILER TRIP TABLE                                        14660000
146700* SUT_AUD_TRLR_TRIP                                               14670000
146800     EXEC SQL                                                     14680000
146900          INCLUDE SUT00004                                        14690000
147000     END-EXEC.                                                    14700000
147100                                                                  14710000
147200* AUDIT TRAILER EXCEPTION TABLE                                   14720000
147300* SUT_AUD_TRLR_EXC                                                14730000
147400     EXEC SQL                                                     14740000
147500          INCLUDE SUT00002                                        14750000
147600     END-EXEC.                                                    14760000
147700                                                                  14770000
147800* OUTBOUND TRAILER TRIP TABLE                                     14780000
147900     EXEC SQL                                                     14790000
148000          INCLUDE TSUOBTR                                         14800000
148100     END-EXEC.                                                    14810000
148200                                                                  14820000
148300     EXEC SQL                                                     14830000
148400          INCLUDE TSUOBTS                                         14840000
148500     END-EXEC.                                                    14850000
148600                                                                  14860000
149200*DP-CICS ARCH USER TABLE                                          14920000
149300     EXEC SQL                                                     14930000
149400          INCLUDE TUSER                                           14940000
149500     END-EXEC.                                                    14950000
149600                                                                  14960000
149700* AUDIT HEADER TABLE                                              14970000
149800     EXEC SQL                                                     14980000
149900          INCLUDE TSUNAUD                                         14990000
150000     END-EXEC.                                                    15000000
150100                                                                  15010000
150200*SHIPPING UNIT ADJUSTMENT TABLE                                   15020000
150300     EXEC SQL                                                     15030000
150400          INCLUDE TSUQADJ                                         15040000
150500     END-EXEC.                                                    15050000
150600                                                                  15060000
150700*SHIPMENT UNIT CROSS REFERENCE TABLE                              15070000
150800     EXEC SQL                                                     15080000
150900          INCLUDE TSULBXF                                         15090000
151000     END-EXEC.                                                    15100000
151100                                                                  15110000
151200*SHIPPING UNIT LOCATION TABLE                                     15120000
151300     EXEC SQL                                                     15130000
151400          INCLUDE TSHUNLO                                         15140000
151500     END-EXEC.                                                    15150000
151600                                                                  15160000
152200*COMPANY CONTROL TABLE                                            15220000
152300     EXEC SQL                                                     15230000
152400          INCLUDE TCOCNTL                                         15240000
152500     END-EXEC.                                                    15250000
152600                                                                  15260000
152700*TRIP SUMMARY TABLE                                               15270000
152800*SUT_TRIP_SUM                                                     15280000
152900     EXEC SQL                                                     15290000
153000          INCLUDE SUT00007                                        15300000
153100     END-EXEC.                                                    15310000
153200                                                                  15320000
153300*DB2 AREA FOR COMMUNICATIONS                                      15330000
153400     EXEC SQL                                                     15340000
153500          INCLUDE SQLCA                                           15350000
153600     END-EXEC.                                                    15360000
153700                                                                  15370000
153800                                                                  15380000
153900     EXEC SQL                                                     15390000
154000          DECLARE USERID-CSR CURSOR FOR                           15400000
154100           SELECT DISTINCT AUD_USR_ID                             15410000
154200           FROM   SUT_AUD_TRLR_CART                               15420000
154300           WHERE  AUD_CNTL_NBR     = :DK-AUD-CNTL-NBR             15430000
154310           WITH UR                                                15431018
154400     END-EXEC                                                     15440000
154500                                                                  15450000
154600* CARTON CURSOR FOR CALCULATING AUDIT DURATION.                   15460000
154700                                                                  15470000
154800     EXEC SQL                                                     15480000
154900         DECLARE CARTON-CSR CURSOR FOR                            15490000
155000             SELECT                                               15500000
155100                ( (( DAYS(AUD_STP_TMST) -                         15510000
155200                     DAYS(AUD_STRT_TMST) )                        15520000
155300                     * 1440)                                      15530000
155400             +                                                    15540000
155500                  (( HOUR(AUD_STP_TMST) -                         15550000
155600                     HOUR(AUD_STRT_TMST) )                        15560000
155700                     * 60 )                                       15570000
155800             +                                                    15580000
155900                  ( MINUTE(AUD_STP_TMST) -                        15590000
156000                    MINUTE(AUD_STRT_TMST) )                       15600000
156100                                                                  15610000
156200             -      AUD_PSPND_MNIT_QTY                            15620000
156300             -      AUD_CLO_MNIT_QTY )                            15630000
156400             FROM                                                 15640000
156500                    TSUNAUD                                       15650000
156600             WHERE                                                15660000
156700                    AUD_CNTL_NBR  = :DK-AUD-CNTL-NBR              15670000
156800               AND  AUD_STP_TMST <> :PC-DEFAULT-TMST              15680000
156810           WITH UR                                                15681018
156900     END-EXEC                                                     15690000
157000                                                                  15700000
157100     EXEC SQL                                                     15710000
157200          DECLARE MFST-CTNS-CSR CURSOR FOR                        15720000
157300             SELECT CART_QTY                                      15730000
157400               FROM SUT_TRIP_SUM                                  15740000
157500              WHERE OTBND_TRIP_ID = :DK-ORIG-OTBND-TRIP-ID        15750000
157600                AND CRE_TMST     <= :SUNAUD-AUD-STRT-TMST         15760000
157700           ORDER BY CRE_TMST DESC                                 15770000
157710           WITH UR                                                15771018
157800     END-EXEC.                                                    15780000
157900                                                                  15790000
158000                                                                  15800000
158100*DB2 AREA FOR COMMUNICATIONS AREA2                                15810000
158200     COPY SQLCA2.                                                 15820000
158300                                                                  15830000
158400******************************************************************15840000
158500 PROCEDURE DIVISION.                                              15850000
158600                                                                  15860000
158700 0000-MAINLINE.                                                   15870000
158710                                                                  15871024
158711     DISPLAY '******************************'.                    15871124
158712     DISPLAY '*                            *'.                    15871224
158713     DISPLAY '* SUKRP027 - BEGIN           *'.                    15871324
158714     DISPLAY '*                            *'.                    15871424
158715     DISPLAY '******************************'.                    15871524
158720                                                                  15872024
158800     PERFORM 1000-INITIALIZE.                                     15880000
158900                                                                  15890000
159000     IF PS-END-OF-EXTRACT1                                        15900000
159100        NEXT SENTENCE                                             15910000
159200     ELSE                                                         15920000
159300        PERFORM 2000-MAIN-PROCESS                                 15930000
159400     END-IF.                                                      15940000
159500                                                                  15950000
159600     PERFORM 9000-END-PROCESS.                                    15960000
159700                                                                  15970000
159701     MOVE PV-READ-MANIFEST-COUNT  TO PV-DISPLAY-COUNT.            15970123
159702     DISPLAY 'SURD018 MANIFEST RECORDS READ.:  '                  15970223
159703             PV-DISPLAY-COUNT.                                    15970323
159704     MOVE PV-READ-EXCEPTION-COUNT TO PV-DISPLAY-COUNT.            15970423
159705     DISPLAY 'SURD019 EXCEPTION RECORDS READ:  '                  15970523
159706             PV-DISPLAY-COUNT.                                    15970623
159720                                                                  15972023
159800     STOP RUN.                                                    15980000
159900                                                                  15990000
160000                                                                  16000000
160100 1000-INITIALIZE.                                                 16010000
160200     OPEN INPUT  CARDIN-INPUT-FILE                                16020000
160300                 AUDIT-EXTRACT-FILE                               16030000
160400                 CRTN-MFST-FILE                                   16040000
160500          OUTPUT REPORT-FILE.                                     16050000
160600                                                                  16060000
160700     PERFORM 7000-READ-CARDIN-FILE.                               16070000
160800                                                                  16080000
160900     IF PS-EOF-CARDIN-FILE                                        16090000
161000         DISPLAY '** SUKUT027 ABEND **'                           16100000
161100         DISPLAY '** CARDIN (TRLR AUDIT NBR) FILE IS EMPTY **'    16110000
161200         MOVE +4019                  TO PV-ABEND-CODE             16120000
161300         CALL 'ILBOABN0' USING PV-ABEND-CODE                      16130000
161400     END-IF.                                                      16140000
161500     ACCEPT PV-TODAYS-DATE FROM DATE.                             16150000
161600     ACCEPT PV-TODAYS-TIME FROM TIME.                             16160000
161700                                                                  16170000
161800     PERFORM 1200-INITIALIZE-HEADINGS.                            16180000
161900                                                                  16190000
162000*FIRST READ - EXTRACT 1                                           16200000
162100     INITIALIZE SU019-EXTRACT-RECORD                              16210000
162200     PERFORM 7100-READ-EXTRACT1.                                  16220000
162300        IF PS-END-OF-EXTRACT1                                     16230000
162400           PERFORM 1700-GET-AUDIT-INFO                            16240000
162500*DON'TNEED PERFORM 1750-GET-FCLTY-DESC                            16250000
162600           PERFORM 1800-GET-OTBND-TRIP                            16260000
162700           MOVE SUT00004-ORIG-OTBND-TRIP-ID TO                    16270000
162800                        DK-OTBND-TRIP-ID                          16280000
162900                                                                  16290000
163000           PERFORM 1850-GET-DOOR-ID                               16300000
163100           PERFORM 1900-GET-ORIG-TRAILER-NBR                      16310000
163200           PERFORM 1950-GET-DEST-TRAILER-NBR                      16320000
163300           PERFORM 2300-COUNT-AUDITED-CRTNS                       16330000
163400           PERFORM 2400-COUNT-AUD-CRTNS-ERR                       16340000
163500           MOVE  CC-AUD-CNTL-NBR TO SU019-AUD-CNTL-NBR            16350000
163600           PERFORM 1500-SELECT-AUDITING-USERIDS                   16360000
163700           INITIALIZE SU018-EXTRACT-RECORD                        16370000
163800           PERFORM 7200-READ-EXTRACT2                             16380000
163900                                                                  16390000
164000           PERFORM 8050-PRINT-NO-ERR-HEADING                      16400000
164100           PERFORM 6900-NO-DETAIL                                 16410000
164200                                                                  16420000
164300           WRITE REPORT-RECORD                                    16430000
164400             FROM END-OF-REPORT-LINE                              16440000
164500               AFTER ADVANCING 1 LINES                            16450000
164600        ELSE                                                      16460000
164700           PERFORM 1700-GET-AUDIT-INFO                            16470000
164800           PERFORM 1800-GET-OTBND-TRIP                            16480000
164900                                                                  16490000
165000           MOVE SU019-ORIG-TRIP-ID  TO DK-OTBND-TRIP-ID           16500000
165100           PERFORM 1850-GET-DOOR-ID                               16510000
165200           PERFORM 2300-COUNT-AUDITED-CRTNS                       16520000
165300           PERFORM 2400-COUNT-AUD-CRTNS-ERR                       16530000
165400           PERFORM 1500-SELECT-AUDITING-USERIDS                   16540000
165500           PERFORM 6000-CALL-CRTN-STATUS-PGM                      16550000
165600           INITIALIZE SU018-EXTRACT-RECORD                        16560000
165700           PERFORM 7200-READ-EXTRACT2                             16570000
165800           PERFORM 8000-PRINT-REPORT-HEADINGS                     16580000
165900                                                                  16590000
166000*IF SUNAUD-AUD-TYP-CDE = '02' IT'S A SPOT AUDIT.                  16600000
166100*NOT DOING 100% OF THE AUDIT SO CAN'T COUNT CARTONS               16610000
166200*THAT WERE NOT AUDITED AS ERRORS.                                 16620000
166300           EVALUATE TRUE                                          16630000
166400              WHEN  SUNAUD-AUD-TYP-CDE = '02' AND                 16640000
166500                    SU019-MFST-NOT-AUDITED = 'Y'                  16650000
166600                    PERFORM 6900-NO-DETAIL                        16660000
166700              WHEN  SUNAUD-AUD-TYP-CDE = '02' AND                 16670000
166800                    SU019-MFST-NOT-AUD-NON-MFST-DC = 'Y'          16680000
166900                    PERFORM 6900-NO-DETAIL                        16690000
167000              WHEN  OTHER                                         16700000
167100                    SET PS-DETAIL-WRITTEN TO TRUE                 16710000
167200                    PERFORM 8100-WRITE-SUB-HEADINGS               16720000
167300                    PERFORM 8200-WRITE-SUB-DETAILS                16730000
167400           END-EVALUATE                                           16740000
167500        END-IF.                                                   16750000
167600                                                                  16760000
167700                                                                  16770000
167800                                                                  16780000
167900* INITIALIZE REPORT HEADINGS.                                     16790000
168000 1200-INITIALIZE-HEADINGS.                                        16800000
168100     MOVE PV-TODAYS-DATE-MM        TO DP132O-RUN-MONTH.           16810000
168200     MOVE PV-TODAYS-DATE-DD        TO DP132O-RUN-DAY.             16820000
168300     MOVE PV-TODAYS-DATE-YY        TO DP132O-RUN-YEAR.            16830000
168400     MOVE PV-TODAYS-TIME-HH        TO DP132O-RUN-HOUR.            16840000
168500     MOVE PV-TODAYS-TIME-MM        TO DP132O-RUN-MINUTE.          16850000
168600     MOVE PC-CURRENT-PROGRAM-NAME  TO DP132O-PROGRAM-NAME.        16860000
168700                                                                  16870000
168800                                                                  16880000
168900* OPEN A CURSOR TO SELECT ALL THE USERIDS OF ALL THE RECEIVING    16890000
169000* ASSOCIATES WHO CHECKED-IN THIS TRAILER.                         16900000
169100 1500-SELECT-AUDITING-USERIDS.                                    16910000
169200     INITIALIZE HL11-USERID-TABLE                                 16920000
169300                PV-HOLD-USERID.                                   16930000
169400     SET HL11-USERID-IDX TO +1.                                   16940000
169500     SET SL11-USERID-IDX TO +1.                                   16950000
169600     SET HL11-USERID-IDX DOWN BY +1.                              16960000
169700     SET SL11-USERID-IDX DOWN BY +1.                              16970000
169800     MOVE SU019-AUD-CNTL-NBR  TO DK-AUD-CNTL-NBR                  16980000
169900     PERFORM 1600-OPEN-USERID-CSR                                 16990000
170000     PERFORM 1625-FETCH-USERID-CSR                                17000000
170100                                                                  17010000
170200     PERFORM UNTIL PS-EOF-USERID-CSR                              17020000
170300         IF SUT00000-AUD-USR-ID = PV-HOLD-USERID                  17030000
170400             CONTINUE                                             17040000
170500         ELSE                                                     17050000
170600             IF HL11-USERID-IDX > 0                               17060000
170700                 MOVE ','          TO HL11-COMMA (HL11-USERID-IDX)17070000
170800             END-IF                                               17080000
170900                                                                  17090000
171000             IF SL11-USERID-IDX > 0                               17100000
171100                 MOVE ','          TO SL11-COMMA (SL11-USERID-IDX)17110000
171200             END-IF                                               17120000
171300                                                                  17130000
171400             SET HL11-USERID-IDX UP BY +1                         17140000
171500             SET SL11-USERID-IDX UP BY +1                         17150000
171600             MOVE SUT00000-AUD-USR-ID TO                          17160000
171700                             HL11-USERID (HL11-USERID-IDX)        17170000
171800                             SL11-USERID (SL11-USERID-IDX)        17180000
171900             MOVE SUT00000-AUD-USR-ID TO PV-HOLD-USERID           17190000
172000         END-IF                                                   17200000
172100         PERFORM 1625-FETCH-USERID-CSR                            17210000
172200     END-PERFORM.                                                 17220000
172300                                                                  17230000
172400     PERFORM 1650-CLOSE-USERID-CSR.                               17240000
172500                                                                  17250000
172600                                                                  17260000
172700*OPEN CURSOR TO SELECT AUDITING ASSOCIATES USER IDS               17270000
172800 1600-OPEN-USERID-CSR.                                            17280000
172900     EXEC SQL                                                     17290000
173000         OPEN USERID-CSR                                          17300000
173100     END-EXEC.                                                    17310000
173200                                                                  17320000
173300     EVALUATE TRUE                                                17330000
173400         WHEN SQLCODE = ZEROS                                     17340000
173500              SET PS-NOT-EOF-USERID-CSR TO TRUE                   17350000
173600         WHEN SQLCODE = -904                                      17360000
173700         WHEN SQLCODE = -911                                      17370000
173800         WHEN SQLCODE = -913                                      17380000
173900              MOVE '1600-OPEN-USERID-CSR  '                       17390000
174000                                 TO PV-ABEND-PARA-NAME            17400000
174100              MOVE SQLCODE       TO PV-SQLCODE                    17410000
174200              MOVE 'OPEN CURSOR' TO PV-DB2-OPERATION-MSG-1        17420000
174300              PERFORM 9100-SQL-ABEND                              17430000
174400         WHEN OTHER                                               17440000
174500              MOVE '1600-OPEN-USERID-CSR  '                       17450000
174600                                 TO PV-ABEND-PARA-NAME            17460000
174700              MOVE SQLCODE       TO PV-SQLCODE                    17470000
174800              MOVE 'OPEN CURSOR' TO PV-DB2-OPERATION-MSG-1        17480000
174900              PERFORM 9100-SQL-ABEND                              17490000
175000     END-EVALUATE.                                                17500000
175100                                                                  17510000
175200                                                                  17520000
175300*FETCH CURSOR TO SELECT AUDITING ASSOCIATES USER IDS              17530000
175400 1625-FETCH-USERID-CSR.                                           17540000
175500     EXEC SQL                                                     17550000
175600      FETCH USERID-CSR                                            17560000
175700         INTO  :SUT00000-AUD-USR-ID                               17570000
175800     END-EXEC                                                     17580000
175900                                                                  17590000
176000     EVALUATE TRUE                                                17600000
176100         WHEN SQLCODE = 0                                         17610000
176200         WHEN SQLCODE = -904                                      17620000
176300         WHEN SQLCODE = -911                                      17630000
176400             CONTINUE                                             17640000
176500         WHEN SQLCODE = +100                                      17650000
176600             SET PS-EOF-USERID-CSR TO TRUE                        17660000
176700         WHEN OTHER                                               17670000
176800             MOVE '1625-FETCH-USERID-CSR'                         17680000
176900                                    TO PV-ABEND-PARA-NAME         17690000
177000             MOVE 'SELECT FROM SUT_AUD_TRLR_CART'                 17700000
177100                                TO PV-DB2-OPERATION-ATTEMPTED     17710000
177200             MOVE SQLCODE       TO PV-SQLCODE                     17720000
177300             MOVE 'SUT_AUD_TRLR_CART' TO PV-DB2-TABLE-NAME        17730000
177400             PERFORM 9100-SQL-ABEND                               17740000
177500     END-EVALUATE.                                                17750000
177600                                                                  17760000
177700                                                                  17770000
177800*CLOSE CURSOR                                                     17780000
177900 1650-CLOSE-USERID-CSR.                                           17790000
178000     EXEC SQL                                                     17800000
178100         CLOSE USERID-CSR                                         17810000
178200     END-EXEC.                                                    17820000
178300                                                                  17830000
178400     EVALUATE TRUE                                                17840000
178500         WHEN SQLCODE = ZEROS                                     17850000
178600              CONTINUE                                            17860000
178700         WHEN SQLCODE = -904                                      17870000
178800         WHEN SQLCODE = -911                                      17880000
178900         WHEN SQLCODE = -913                                      17890000
179000              MOVE '1650-CLOSE-USERID-CSR  '                      17900000
179100                                 TO PV-ABEND-PARA-NAME            17910000
179200              MOVE SQLCODE       TO PV-SQLCODE                    17920000
179300              PERFORM 9100-SQL-ABEND                              17930000
179400         WHEN OTHER                                               17940000
179500              MOVE '1650-CLOSE-USERID-CSR  '                      17950000
179600                                 TO PV-ABEND-PARA-NAME            17960000
179700              MOVE SQLCODE       TO PV-SQLCODE                    17970000
179800              PERFORM 9100-SQL-ABEND                              17980000
179900     END-EVALUATE.                                                17990000
180000                                                                  18000000
180100                                                                  18010000
180200 1700-GET-AUDIT-INFO.                                             18020000
180300         EXEC SQL                                                 18030000
180400             SELECT AUD_TYP_CDE                                   18040000
180500                 ,  AUD_STAT_CDE                                  18050000
180600                 ,  DEST_TYP_CDE                                  18060000
180700                 ,  AUD_USR_ID                                    18070000
180800                 ,  AUD_STRT_TMST                                 18080000
180900                 ,  AUD_STP_TMST                                  18090000
181000                 ,  OPER_UNT_ID                                   18100000
181100                 ,  FCLTY_ID                                      18110000
181200             INTO  :SUNAUD-AUD-TYP-CDE                            18120000
181300                 , :SUNAUD-AUD-STAT-CDE                           18130000
181400                 , :SUNAUD-DEST-TYP-CDE                           18140000
181500                 , :SUNAUD-AUD-USR-ID                             18150000
181600                 , :SUNAUD-AUD-STRT-TMST                          18160000
181700                 , :SUNAUD-AUD-STP-TMST                           18170000
181800                 , :SUNAUD-OPER-UNT-ID                            18180000
181900                 , :SUNAUD-FCLTY-ID                               18190000
182000             FROM   TSUNAUD                                       18200000
182100             WHERE  AUD_CNTL_NBR     = :DK-AUD-CNTL-NBR           18210000
182110             WITH UR                                              18211018
182200         END-EXEC                                                 18220000
182300                                                                  18230000
182400         EVALUATE TRUE                                            18240000
182500             WHEN SQLCODE = 0                                     18250000
182600             WHEN SQLCODE = +100                                  18260000
182700             WHEN SQLCODE = -904                                  18270000
182800             WHEN SQLCODE = -911                                  18280000
182900                 CONTINUE                                         18290000
183000             WHEN OTHER                                           18300000
183100                 MOVE '1700-GET-AUDIT-INFO'                       18310000
183200                                        TO PV-PARAGRAPH-NAME      18320000
183300                 MOVE 'SELECT FROM TSUNAUD'                       18330000
183400                                  TO PV-DB2-OPERATION-ATTEMPTED   18340000
183500                 PERFORM 9100-SQL-ABEND                           18350000
183600         END-EVALUATE.                                            18360000
183700                                                                  18370000
183800                                                                  18380000
183900*THIS PARAGRAPH WILL SELECT THE FACLITY DESC                      18390000
184000 1750-GET-FCLTY-DESC.                                             18400000
184001                                                                  18400103
184002     INITIALIZE XL071-COMMAREA-REC.                               18400207
184031     MOVE DK-OPER-UNT-ID         TO XL071-LOCATION-NUMBER.        18403105
184032                                                                  18403203
184040     CALL PC-LOCATION-MODULE  USING                               18404003
184060                                    XL071-COMMAREA                18406003
184070                                    XL071-COMMAREA-REC.           18407003
184080                                                                  18408003
184090     EVALUATE TRUE                                                18409003
184091         WHEN XL071-NO-ERRORS                                     18409103
184092              CONTINUE                                            18409203
184099         WHEN OTHER                                               18409903
185500              MOVE '1750-GET-FCLTY-DESC'                          18550000
185600                               TO  PV-PARAGRAPH-NAME              18560000
185700              MOVE 'SELECT OF XLKUT071'                           18570003
185800                               TO  PV-DB2-OPERATION-ATTEMPTED     18580000
185900              PERFORM 9100-SQL-ABEND                              18590000
186000     END-EVALUATE.                                                18600000
186100                                                                  18610000
186200                                                                  18620000
186300*GET OUTBOUND TRIP ID BASED ON AUDIT CONTROL NUMBER               18630000
186400 1800-GET-OTBND-TRIP.                                             18640000
186500     EXEC SQL                                                     18650000
186600         SELECT A.OPER_UNT_ID                                     18660000
186700              , A.FCLTY_ID                                        18670000
186800              , A.AUD_TYP_CDE                                     18680000
186900              , A.AUD_STAT_CDE                                    18690000
187000              , A.AUD_STRT_TMST                                   18700000
187100              , A.AUD_STP_TMST                                    18710000
187200              , A.DEST_TYP_CDE                                    18720000
187300              , A.AUD_USR_ID                                      18730000
187400              , B.ORIG_OTBND_TRIP_ID                              18740000
187500              , B.DEST_OTBND_TRIP_ID                              18750000
187600         INTO  :SUNAUD-OPER-UNT-ID                                18760000
187700              ,:SUNAUD-FCLTY-ID                                   18770000
187800              ,:SUNAUD-AUD-TYP-CDE                                18780000
187900              ,:SUNAUD-AUD-STAT-CDE                               18790000
188000              ,:SUNAUD-AUD-STRT-TMST                              18800000
188100              ,:SUNAUD-AUD-STP-TMST                               18810000
188200              ,:SUNAUD-DEST-TYP-CDE                               18820000
188300              ,:SUNAUD-AUD-USR-ID                                 18830000
188400              ,:SUT00004-ORIG-OTBND-TRIP-ID :DN-ORIG-TRIP-ID      18840000
188500              ,:SUT00004-DEST-OTBND-TRIP-ID :DN-DEST-TRIP-ID      18850000
188600         FROM   TSUNAUD A                                         18860000
188700              , SUT_AUD_TRLR_TRIP B                               18870000
188800         WHERE  A.AUD_CNTL_NBR   = B.AUD_CNTL_NBR                 18880000
188900           AND  B.AUD_CNTL_NBR   = :DK-AUD-CNTL-NBR               18890000
188910         WITH UR                                                  18891018
189000     END-EXEC                                                     18900000
189100                                                                  18910000
189200     EVALUATE TRUE                                                18920000
189300         WHEN SQLCODE = 0                                         18930000
189400         WHEN SQLCODE = +100                                      18940000
189500         WHEN SQLCODE = -904                                      18950000
189600         WHEN SQLCODE = -911                                      18960000
189700             IF DN-ORIG-TRIP-ID = -1                              18970000
189800                MOVE ZEROS   TO SUT00004-ORIG-OTBND-TRIP-ID       18980000
189900             END-IF                                               18990000
190000             IF DN-DEST-TRIP-ID = -1                              19000000
190100                MOVE ZEROS   TO SUT00004-DEST-OTBND-TRIP-ID       19010000
190200             END-IF                                               19020000
190300                                                                  19030000
190400             MOVE SUT00004-ORIG-OTBND-TRIP-ID TO                  19040000
190500                                    DK-ORIG-OTBND-TRIP-ID         19050000
190600             MOVE SUT00004-DEST-OTBND-TRIP-ID TO                  19060000
190700                                    DK-DEST-OTBND-TRIP-ID         19070000
190800         WHEN OTHER                                               19080000
190900             MOVE '1800-GET-OTBND-TRIP'                           19090000
191000                                    TO PV-PARAGRAPH-NAME          19100000
191100             MOVE 'SELECT FROM SUT_AUD_TRLR_TRIP'                 19110000
191200                              TO PV-DB2-OPERATION-ATTEMPTED       19120000
191300             PERFORM 9100-SQL-ABEND                               19130000
191400     END-EVALUATE.                                                19140000
191500                                                                  19150000
191600                                                                  19160000
191700*GET THE DOOR ID BASED ON ORIGINAL TRIP TRAILER ID AND MOST RECENT19170000
191800*TMST                                                             19180000
191900 1850-GET-DOOR-ID.                                                19190000
192000     EXEC SQL                                                     19200000
192100          SELECT  A.DOOR_ID                                       19210000
192200            INTO  :SUOBTS-DOOR-ID                                 19220000
192300            FROM  TSUOBTS A                                       19230000
192400           WHERE  A.OTBND_TRIP_ID  =  :DK-OTBND-TRIP-ID           19240000
192500             AND  A.OTBND_STAT_TMST  =                            19250000
192600                  (SELECT  MAX(B.OTBND_STAT_TMST)                 19260000
192700                     FROM  TSUOBTS B                              19270000
192800                    WHERE  B.OTBND_TRIP_ID  =  :DK-OTBND-TRIP-ID) 19280000
192810          WITH UR                                                 19281018
192900     END-EXEC.                                                    19290000
193000                                                                  19300000
193100     EVALUATE TRUE                                                19310000
193200         WHEN SQLCODE = 0                                         19320000
193300             CONTINUE                                             19330000
193400         WHEN SQLCODE = +100                                      19340000
193500             CONTINUE                                             19350000
193600         WHEN OTHER                                               19360000
193700             MOVE '1850-GET-DOOR-ID         '                     19370000
193800                                    TO PV-PARAGRAPH-NAME          19380000
193900             MOVE 'SELECT FROM TSUOBTS'                           19390000
194000                                TO PV-DB2-OPERATION-ATTEMPTED     19400000
194100             PERFORM 9100-SQL-ABEND                               19410000
194200     END-EVALUATE.                                                19420000
194300                                                                  19430000
194400                                                                  19440000
194500*GET TRAILER SERIAL NUMBER BASED ON OUTBND TRIP ID                19450000
194600 1900-GET-ORIG-TRAILER-NBR.                                       19460000
194700         EXEC SQL                                                 19470000
194800             SELECT TRLR_SRL_NBR                                  19480000
194900                  , DOOR_TYP_CDE                                  19490000
195000                  , ORGN_OPER_UNT_ID                              19500000
195100                  , DEST_OPER_UNT_ID                              19510000
195200             INTO  :SUOBTR-TRLR-SRL-NBR                           19520000
195300                  ,:SUOBTR-DOOR-TYP-CDE                           19530000
195400                  ,:SUOBTR-ORGN-OPER-UNT-ID                       19540000
195500                  ,:SUOBTR-DEST-OPER-UNT-ID                       19550000
195600             FROM   TSUOBTR                                       19560000
195700             WHERE  OTBND_TRIP_ID    = :DK-ORIG-OTBND-TRIP-ID     19570000
195710             WITH UR                                              19571018
195800         END-EXEC                                                 19580000
195900                                                                  19590000
196000         EVALUATE TRUE                                            19600000
196100             WHEN SQLCODE = 0                                     19610000
196200             WHEN SQLCODE = +100                                  19620000
196300             WHEN SQLCODE = -904                                  19630000
196400             WHEN SQLCODE = -911                                  19640000
196500                 MOVE SUOBTR-TRLR-SRL-NBR TO                      19650000
196600                      SU019-ORIG-TRLR-SER-NBR                     19660000
196700             WHEN OTHER                                           19670000
196800                 MOVE '1900-GET-ORIG-TRAILER-NBR'                 19680000
196900                                        TO PV-PARAGRAPH-NAME      19690000
197000                 MOVE 'SELECT FROM TSUOBTR'                       19700000
197100                                  TO PV-DB2-OPERATION-ATTEMPTED   19710000
197200                 PERFORM 9100-SQL-ABEND                           19720000
197300         END-EVALUATE.                                            19730000
197400                                                                  19740000
197500                                                                  19750000
197600 1950-GET-DEST-TRAILER-NBR.                                       19760000
197700     EXEC SQL                                                     19770000
197800        SELECT TRLR_SRL_NBR                                       19780000
197900         INTO  :SUOBTR-TRLR-SRL-NBR                               19790000
198000          FROM TSUOBTR                                            19800000
198100         WHERE OTBND_TRIP_ID = :DK-DEST-OTBND-TRIP-ID             19810000
198110         WITH UR                                                  19811018
198200     END-EXEC                                                     19820000
198300                                                                  19830000
198400     EVALUATE TRUE                                                19840000
198500         WHEN SQLCODE = 0                                         19850000
198600         WHEN SQLCODE = -904                                      19860000
198700         WHEN SQLCODE = -911                                      19870000
198800             MOVE SUOBTR-TRLR-SRL-NBR TO                          19880000
198900                  SU019-DEST-TRLR-SER-NBR                         19890000
199000         WHEN SQLCODE = +100                                      19900000
199100             CONTINUE                                             19910000
199200         WHEN OTHER                                               19920000
199300             MOVE '1950-GET-DEST-TRAILER-NBR'                     19930000
199400                                    TO PV-PARAGRAPH-NAME          19940000
199500             MOVE 'SELECT FROM TSUOBTR'                           19950000
199600                                TO PV-DB2-OPERATION-ATTEMPTED     19960000
199700             PERFORM 9100-SQL-ABEND                               19970000
199800     END-EVALUATE.                                                19980000
199900                                                                  19990000
200000                                                                  20000000
200100 2000-MAIN-PROCESS.                                               20010000
200200*NEXT READ - EXTRACT 1                                            20020000
200300     PERFORM UNTIL PS-END-OF-EXTRACT1                             20030000
200400        PERFORM 7100-READ-EXTRACT1                                20040000
200500        IF PS-END-OF-EXTRACT1                                     20050000
200600           CONTINUE                                               20060000
200700        ELSE                                                      20070000
200800           PERFORM 6000-CALL-CRTN-STATUS-PGM                      20080000
200900           SET PS-DETAIL-WRITTEN TO TRUE                          20090000
201000           PERFORM 8200-WRITE-SUB-DETAILS                         20100000
201100        END-IF                                                    20110000
201200     END-PERFORM.                                                 20120000
201300                                                                  20130000
201400*NEXT READ - EXTRACT 2                                            20140000
201500     PERFORM UNTIL PS-END-OF-EXTRACT2                             20150000
201600        PERFORM 7200-READ-EXTRACT2                                20160000
201700     END-PERFORM.                                                 20170000
201800                                                                  20180000
201900                                                                  20190000
202000*COUNT NUMBER OF AUDITED CARTONS.                                 20200000
202100 2300-COUNT-AUDITED-CRTNS.                                        20210000
202200         EXEC SQL                                                 20220000
202300            SELECT  COUNT (DISTINCT SHIPT_UNT_ID)                 20230000
202400              INTO :PV-AUD-CRTN-CNT                               20240000
202500              FROM  SUT_AUD_TRLR_CART                             20250000
202600             WHERE  AUD_CNTL_NBR     = :DK-AUD-CNTL-NBR           20260000
202610            WITH UR                                               20261018
202700         END-EXEC                                                 20270000
202800                                                                  20280000
202900         EVALUATE TRUE                                            20290000
203000             WHEN SQLCODE = +0                                    20300000
203100             WHEN SQLCODE = +100                                  20310000
203200             WHEN SQLCODE = -305                                  20320000
203300             WHEN SQLCODE = -904                                  20330000
203400             WHEN SQLCODE = -913                                  20340000
203500                 CONTINUE                                         20350000
203600             WHEN SQLWARN0 NOT = SPACE                            20360000
203700             WHEN SQLCODE  < ZERO                                 20370000
203800             WHEN SQLCODE  > ZERO                                 20380000
203900                 MOVE '2300-COUNT-AUDITED-CRTNS'                  20390000
204000                                 TO PV-PARAGRAPH-NAME             20400000
204100                 MOVE 'COUNT AUDITED CARTONS'                     20410000
204200                                 TO PV-DB2-OPERATION-ATTEMPTED    20420000
204300              PERFORM 9100-SQL-ABEND                              20430000
204400         END-EVALUATE.                                            20440000
204500                                                                  20450000
204600                                                                  20460000
204700*COUNT NUMBER OF AUDITED CARTONS IN ERROR.                        20470000
204800 2400-COUNT-AUD-CRTNS-ERR.                                        20480000
204900         EXEC SQL                                                 20490000
205000            SELECT  COUNT (DISTINCT SHIPT_UNT_ID)                 20500000
205010                 ,  COUNT(*)                                      20501031
205100              INTO :PV-AUD-CRTN-ERR-CNT                           20510000
205110                 , :PV-AUD-EXC-ERR-CNT                            20511031
205200              FROM  SUT_AUD_TRLR_EXC                              20520000
205300             WHERE  AUD_CNTL_NBR  = :DK-AUD-CNTL-NBR              20530034
205400               AND  ERR_CDE <> 'G'                                20540000
205410            WITH UR                                               20541018
205500         END-EXEC                                                 20550000
205600                                                                  20560000
205700         EVALUATE TRUE                                            20570000
205800             WHEN SQLCODE = +0                                    20580000
205900             WHEN SQLCODE = +100                                  20590000
206000             WHEN SQLCODE = -305                                  20600000
206100             WHEN SQLCODE = -904                                  20610000
206200             WHEN SQLCODE = -913                                  20620000
206300                 CONTINUE                                         20630000
206400             WHEN SQLWARN0 NOT = SPACE                            20640000
206500             WHEN SQLCODE  < ZERO                                 20650000
206600             WHEN SQLCODE  > ZERO                                 20660000
206700                 MOVE '2400-COUNT-AUD-CRTNS-ERR'                  20670000
206800                                 TO PV-PARAGRAPH-NAME             20680000
206900                 MOVE 'COUNT AUDITED CARTONS IN ERROR'            20690000
207000                                 TO PV-DB2-OPERATION-ATTEMPTED    20700000
207100              PERFORM 9100-SQL-ABEND                              20710000
207200         END-EVALUATE.                                            20720000
207300                                                                  20730000
207400                                                                  20740000
207500 2500-OPEN-MFST-CTNS-CSR.                                         20750000
207600     EXEC SQL                                                     20760000
207700         OPEN MFST-CTNS-CSR                                       20770000
207800     END-EXEC.                                                    20780000
207900                                                                  20790000
208000     EVALUATE TRUE                                                20800000
208100         WHEN SQLCODE = ZERO                                      20810000
208200             CONTINUE                                             20820000
208300         WHEN SQLWARN0 NOT = SPACES                               20830000
208400         WHEN SQLCODE < +0                                        20840000
208500         WHEN SQLCODE > ZERO                                      20850000
208600             MOVE '2500-OPEN-MFST-CTNS-CSR'                       20860000
208700                             TO PV-PARAGRAPH-NAME                 20870000
208800             MOVE 'OPEN MFST UNTS CURSOR'                         20880000
208900                                TO PV-DB2-OPERATION-ATTEMPTED     20890000
209000             PERFORM 9100-SQL-ABEND                               20900000
209100     END-EVALUATE.                                                20910000
209200                                                                  20920000
209300 2510-FETCH-MFST-CTNS-CSR.                                        20930000
209400     EXEC SQL                                                     20940000
209500         FETCH MFST-CTNS-CSR                                      20950000
209600         INTO                                                     20960000
209700             :SUT00007-CART-QTY                                   20970000
209800     END-EXEC.                                                    20980000
209900                                                                  20990000
210000     EVALUATE TRUE                                                21000000
210100         WHEN SQLCODE = ZERO                                      21010000
210200             MOVE SUT00007-CART-QTY TO SU018-MFST-CRTN-CNT        21020000
210300         WHEN SQLCODE = +100                                      21030000
210400              SET PS-EOF-MFST-CTNS-CSR    TO TRUE                 21040000
210500         WHEN SQLWARN0 NOT = SPACES                               21050000
210600         WHEN SQLCODE < +0                                        21060000
210700         WHEN SQLCODE > ZERO                                      21070000
210800             MOVE '2510-FETCH-MFST-CTNS-CSR'                      21080000
210900                             TO PV-PARAGRAPH-NAME                 21090000
211000             MOVE 'FETCH MFST UNTS CURSOR'                        21100000
211100                                TO PV-DB2-OPERATION-ATTEMPTED     21110000
211200             PERFORM 9100-SQL-ABEND                               21120000
211300     END-EVALUATE.                                                21130000
211400                                                                  21140000
211500                                                                  21150000
211600 2520-CLOSE-MFST-CTNS-CSR.                                        21160000
211700     EXEC SQL                                                     21170000
211800         CLOSE MFST-CTNS-CSR                                      21180000
211900     END-EXEC.                                                    21190000
212000                                                                  21200000
212100     EVALUATE TRUE                                                21210000
212200         WHEN SQLCODE = ZERO                                      21220000
212300             CONTINUE                                             21230000
212400         WHEN SQLWARN0 NOT = SPACES                               21240000
212500         WHEN SQLCODE < +0                                        21250000
212600         WHEN SQLCODE > ZERO                                      21260000
212700             MOVE '2520-CLOSE-MFST-CTNS-CSR'                      21270000
212800                             TO PV-PARAGRAPH-NAME                 21280000
212900             MOVE 'CLOSE MFST UNTS CURSOR'                        21290000
213000                                 TO PV-DB2-OPERATION-ATTEMPTED    21300000
213100             PERFORM 9100-SQL-ABEND                               21310000
213200     END-EVALUATE.                                                21320000
213210                                                                  21321017
213220                                                                  21322017
213230*COUNT NUMBER OF DUPLICATE SCAN ERRORS.                           21323017
213240 2700-COUNT-DUPLICATE-SCAN.                                       21324017
213250         EXEC SQL                                                 21325017
213260            SELECT  COUNT(*)                                      21326017
213270              INTO :PV-DUPLICATE-SCAN-COUNT                       21327017
213280              FROM  SUT_AUD_TRLR_EXC                              21328017
213290             WHERE  AUD_CNTL_NBR  = :DK-AUD-CNTL-NBR              21329034
213292               AND  ERR_CDE = 'F'                                 21329232
213293            WITH UR                                               21329332
213294         END-EXEC                                                 21329432
213295                                                                  21329532
213296         EVALUATE TRUE                                            21329632
213297             WHEN SQLCODE = +0                                    21329732
213298             WHEN SQLCODE = +100                                  21329832
213299             WHEN SQLCODE = -904                                  21329932
213300             WHEN SQLCODE = -913                                  21330032
213301                 CONTINUE                                         21330132
213302             WHEN SQLCODE = -305                                  21330232
213303                 MOVE ZERO TO PV-DUPLICATE-SCAN-COUNT             21330332
213304             WHEN SQLWARN0 NOT = SPACE                            21330432
213305             WHEN SQLCODE  < ZERO                                 21330532
213306             WHEN SQLCODE  > ZERO                                 21330632
213307                 MOVE '2700-COUNT-DUPLICATE-SCAN'                 21330732
213308                                 TO PV-PARAGRAPH-NAME             21330832
213309                 MOVE 'COUNT DUPLICATE SCAN ERRORS'               21330932
213310                                 TO PV-DB2-OPERATION-ATTEMPTED    21331032
213311              PERFORM 9100-SQL-ABEND                              21331132
213312         END-EVALUATE.                                            21331232
213320                                                                  21332000
213400                                                                  21340000
213500 3000-PRINT-REPORT-DETAIL.                                        21350000
213600*CHECK FOR OVERFLOW.                                              21360000
213700     IF  PV-LINE-COUNT > PC-MAX-REPORT-LINES                      21370000
213800       SET PS-SUBHEAD1-NOT-WRITTEN TO TRUE                        21380000
213900       SET PS-SUBHEAD2-NOT-WRITTEN TO TRUE                        21390000
214000       SET PS-SUBHEAD3-NOT-WRITTEN TO TRUE                        21400000
214100       SET PS-SUBHEAD4-NOT-WRITTEN TO TRUE                        21410000
214200       SET PS-SUBHEAD5-NOT-WRITTEN TO TRUE                        21420000
214300       SET PS-SUBHEAD6-NOT-WRITTEN TO TRUE                        21430000
214400       SET PS-SUBHEAD7-NOT-WRITTEN TO TRUE                        21440000
214500       SET PS-SUBHEAD8-NOT-WRITTEN TO TRUE                        21450000
214600       SET PS-SUBHEAD9-NOT-WRITTEN TO TRUE                        21460000
214700       SET PS-SUBHEAD10-NOT-WRITTEN TO TRUE                       21470000
214800       SET PS-SUBHEADII-NOT-WRITTEN TO TRUE                       21480000
214900                                                                  21490000
215000       PERFORM 8000-PRINT-REPORT-HEADINGS                         21500000
215100       PERFORM 8100-WRITE-SUB-HEADINGS                            21510000
215200                                                                  21520000
215300       IF SU019-MISLOADED-CRTN = 'Y'                              21530000
215400           ADD +1              TO PV-LINE-COUNT                   21540000
215500           WRITE REPORT-RECORD                                    21550000
215600             FROM PC-BLANK-LINE                                   21560000
215700               AFTER ADVANCING 1 LINE                             21570000
215800           ADD +1              TO PV-LINE-COUNT                   21580000
215900           WRITE REPORT-RECORD FROM SUB-HEADING-LINE1             21590000
216000           SET PS-SUBHEAD1-WRITTEN TO TRUE                        21600000
216100       END-IF                                                     21610000
216200       IF SU019-CRTN-NOT-MFST-TO-TRLR = 'Y'                       21620000
216300           ADD +1              TO PV-LINE-COUNT                   21630000
216400           WRITE REPORT-RECORD                                    21640000
216500             FROM PC-BLANK-LINE                                   21650000
216600               AFTER ADVANCING 1 LINE                             21660000
216700           ADD +1              TO PV-LINE-COUNT                   21670000
216800           WRITE REPORT-RECORD FROM SUB-HEADING-LINE2             21680000
216900           SET PS-SUBHEAD2-WRITTEN TO TRUE                        21690000
217000       END-IF                                                     21700000
217100       IF SU019-CRTN-CONTENT-UNKNOWN = 'Y'                        21710011
217200           ADD +1              TO PV-LINE-COUNT                   21720011
217300           WRITE REPORT-RECORD                                    21730011
217400             FROM PC-BLANK-LINE                                   21740011
217500               AFTER ADVANCING 1 LINE                             21750011
217600           ADD +1              TO PV-LINE-COUNT                   21760011
217700           WRITE REPORT-RECORD FROM SUB-HEADING-LINE3             21770011
217800           SET PS-SUBHEAD3-WRITTEN TO TRUE                        21780011
217900       END-IF                                                     21790011
218000       IF SU019-DUPLICATE-SCAN = 'Y'                              21800000
218100           ADD +1              TO PV-LINE-COUNT                   21810000
218200           WRITE REPORT-RECORD                                    21820000
218300             FROM PC-BLANK-LINE                                   21830000
218400               AFTER ADVANCING 1 LINE                             21840000
218500           ADD +1              TO PV-LINE-COUNT                   21850000
218600           WRITE REPORT-RECORD FROM SUB-HEADING-LINE4             21860000
218700           SET PS-SUBHEAD4-WRITTEN TO TRUE                        21870000
218800       END-IF                                                     21880000
218900       IF SU019-CRTN-INACTIVE = 'Y'                               21890000
219000           ADD +1              TO PV-LINE-COUNT                   21900000
219100           WRITE REPORT-RECORD                                    21910000
219200             FROM PC-BLANK-LINE                                   21920000
219300               AFTER ADVANCING 1 LINE                             21930000
219400           ADD +1              TO PV-LINE-COUNT                   21940000
219500           WRITE REPORT-RECORD FROM SUB-HEADING-LINE5             21950000
219600           SET PS-SUBHEAD5-WRITTEN TO TRUE                        21960000
219700       END-IF                                                     21970000
219800       IF SU019-CRTN-NOT-FOUND = 'Y'                              21980000
219900           ADD +1              TO PV-LINE-COUNT                   21990000
220000           WRITE REPORT-RECORD                                    22000000
220100             FROM PC-BLANK-LINE                                   22010000
220200               AFTER ADVANCING 1 LINE                             22020000
220300           ADD +1              TO PV-LINE-COUNT                   22030000
220400           WRITE REPORT-RECORD FROM SUB-HEADING-LINE6             22040000
220500           SET PS-SUBHEAD6-WRITTEN TO TRUE                        22050000
220600       END-IF                                                     22060000
220700       IF SU019-MFST-NOT-AUDITED = 'Y'                            22070000
220800           IF SUNAUD-AUD-TYP-CDE = '01'                           22080000
220900              ADD +1              TO PV-LINE-COUNT                22090000
221000              WRITE REPORT-RECORD                                 22100000
221100                FROM PC-BLANK-LINE                                22110000
221200                  AFTER ADVANCING 1 LINE                          22120000
221300              ADD +1              TO PV-LINE-COUNT                22130000
221400              WRITE REPORT-RECORD FROM SUB-HEADING-LINE7          22140000
221500              SET PS-SUBHEAD7-WRITTEN TO TRUE                     22150000
221600           ELSE                                                   22160000
221700              IF PS-END-OF-EXTRACT1                               22170000
221800                 PERFORM 8050-PRINT-NO-ERR-HEADING                22180000
221900                 PERFORM 6900-NO-DETAIL                           22190000
222000              END-IF                                              22200000
222100           END-IF                                                 22210000
222200       END-IF                                                     22220000
222300*      IF SU019-CRE-NON-MFST-DC = 'Y'                             22230010
222400*          ADD +1              TO PV-LINE-COUNT                   22240010
222500*          WRITE REPORT-RECORD FROM SUB-HEADING-LINEII            22250010
222600*          SET PS-SUBHEADII-WRITTEN TO TRUE                       22260010
222700*                                                                 22270010
222800*          ADD +1              TO PV-LINE-COUNT                   22280010
222900*          WRITE REPORT-RECORD                                    22290010
223000*            FROM PC-BLANK-LINE                                   22300010
223100*              AFTER ADVANCING 1 LINE                             22310010
223200*          ADD +1              TO PV-LINE-COUNT                   22320010
223300*          WRITE REPORT-RECORD FROM SUB-HEADING-LINE9             22330010
223400*          SET PS-SUBHEAD9-WRITTEN TO TRUE                        22340010
223500*      END-IF                                                     22350010
223510*                                                                 22351010
223600*      IF SU019-MFST-NOT-AUD-NON-MFST-DC = 'Y'                    22360010
223700*          IF SUNAUD-AUD-TYP-CDE = '01'                           22370010
223800*             ADD +1              TO PV-LINE-COUNT                22380010
223900*             WRITE REPORT-RECORD FROM SUB-HEADING-LINEII         22390010
224000*             SET PS-SUBHEADII-WRITTEN TO TRUE                    22400010
224100*                                                                 22410010
224200*             ADD +1              TO PV-LINE-COUNT                22420010
224300*             WRITE REPORT-RECORD                                 22430010
224400*               FROM PC-BLANK-LINE                                22440010
224500*                 AFTER ADVANCING 1 LINE                          22450010
224600*             ADD +1              TO PV-LINE-COUNT                22460010
224700*             WRITE REPORT-RECORD FROM SUB-HEADING-LINE10         22470010
224800*             SET PS-SUBHEAD10-WRITTEN TO TRUE                    22480010
224900*          ELSE                                                   22490010
225000*             CONTINUE                                            22500010
225100*          END-IF                                                 22510010
225200*      END-IF                                                     22520010
225300     END-IF.                                                      22530000
225400                                                                  22540000
225500                                                                  22550000
225600* CALCULATION AUDIT DURATION                                      22560000
225700 4050-CALC-AUDIT-DURATION.                                        22570000
225800                                                                  22580000
225900     INITIALIZE  PV-AUDIT-DURATION                                22590000
226000                 PV-CARTON-DURATION.                              22600000
226100     SET  PS-NOT-EOF-CARTON-CSR  TO  TRUE.                        22610000
226200                                                                  22620000
226300     PERFORM 4060-OPEN-CARTON-CSR.                                22630000
226400     PERFORM 4065-FETCH-CARTON-CSR.                               22640000
226500                                                                  22650000
226600     IF  PS-EOF-CARTON-CSR                                        22660000
226700         CONTINUE                                                 22670000
226800     ELSE                                                         22680000
226900         PERFORM 4070-CARTON-DURATION                             22690000
227000           UNTIL PS-EOF-CARTON-CSR                                22700000
227100     END-IF.                                                      22710000
227200                                                                  22720000
227300     PERFORM 4075-CLOSE-CARTON-CSR.                               22730000
227400                                                                  22740000
227500                                                                  22750000
227600 4060-OPEN-CARTON-CSR.                                            22760000
227700                                                                  22770000
227800     EXEC SQL                                                     22780000
227900         OPEN CARTON-CSR                                          22790000
228000     END-EXEC.                                                    22800000
228100                                                                  22810000
228200     EVALUATE TRUE                                                22820000
228300         WHEN SQLCODE = ZERO                                      22830000
228400             CONTINUE                                             22840000
228500         WHEN SQLWARN0 NOT = SPACES                               22850000
228600         WHEN SQLCODE < +0                                        22860000
228700         WHEN SQLCODE > ZERO                                      22870000
228800             MOVE '4060-OPEN-CARTON-CSR'                          22880000
228900                             TO PV-PARAGRAPH-NAME                 22890000
229000             MOVE 'OPEN CARTON CURSOR'                            22900000
229100                                TO PV-DB2-OPERATION-ATTEMPTED     22910000
229200             PERFORM 9100-SQL-ABEND                               22920000
229300     END-EVALUATE.                                                22930000
229400                                                                  22940000
229500                                                                  22950000
229600 4065-FETCH-CARTON-CSR.                                           22960000
229700                                                                  22970000
229800     EXEC SQL                                                     22980000
229900         FETCH CARTON-CSR                                         22990000
230000         INTO                                                     23000000
230100             :PV-CARTON-DURATION                                  23010000
230200     END-EXEC.                                                    23020000
230300                                                                  23030000
230400     EVALUATE TRUE                                                23040000
230500         WHEN SQLCODE = ZERO                                      23050000
230600              IF  PV-CARTON-DURATION  = 0                         23060000
230700                  MOVE  1             TO PV-CARTON-DURATION       23070000
230800              END-IF                                              23080000
230900                                                                  23090000
231000         WHEN SQLCODE = +100                                      23100000
231100              SET PS-EOF-CARTON-CSR    TO TRUE                    23110000
231200                                                                  23120000
231300         WHEN SQLWARN0 NOT = SPACES                               23130000
231400         WHEN SQLCODE < +0                                        23140000
231500         WHEN SQLCODE > ZERO                                      23150000
231600             MOVE '4065-FETCH-CARTON-CSR'                         23160000
231700                             TO PV-PARAGRAPH-NAME                 23170000
231800             MOVE 'FETCH CARTON CURSOR'                           23180000
231900                                TO PV-DB2-OPERATION-ATTEMPTED     23190000
232000             PERFORM 9100-SQL-ABEND                               23200000
232100     END-EVALUATE.                                                23210000
232200                                                                  23220000
232300                                                                  23230000
232400 4070-CARTON-DURATION.                                            23240000
232500                                                                  23250000
232600     ADD  PV-CARTON-DURATION TO PV-AUDIT-DURATION.                23260000
232700                                                                  23270000
232800     PERFORM 4065-FETCH-CARTON-CSR.                               23280000
232900                                                                  23290000
233000                                                                  23300000
233100 4075-CLOSE-CARTON-CSR.                                           23310000
233200                                                                  23320000
233300     EXEC SQL                                                     23330000
233400         CLOSE CARTON-CSR                                         23340000
233500     END-EXEC.                                                    23350000
233600                                                                  23360000
233700     EVALUATE TRUE                                                23370000
233800         WHEN SQLCODE = ZERO                                      23380000
233900             CONTINUE                                             23390000
234000                                                                  23400000
234100         WHEN SQLWARN0 NOT = SPACES                               23410000
234200         WHEN SQLCODE < +0                                        23420000
234300         WHEN SQLCODE > ZERO                                      23430000
234400             MOVE '4075-CLOSE-CARTON-CSR'                         23440000
234500                             TO PV-PARAGRAPH-NAME                 23450000
234600             MOVE 'CLOSE CARTON CURSOR'                           23460000
234700                                 TO PV-DB2-OPERATION-ATTEMPTED    23470000
234800             PERFORM 9100-SQL-ABEND                               23480000
234900     END-EVALUATE.                                                23490000
235000                                                                  23500000
235100                                                                  23510000
235200* DETERMINE LAST ACTIVITY FOR CARTON (CHECK IN REVERSE ORDER)     23520000
235300* THIS WILL CALL PCKUT713 WHICH BRINGS BACK ALL INFORMATION ON    23530000
235400* THE CARTON ENTERED.                                             23540000
235500 6000-CALL-CRTN-STATUS-PGM.                                       23550000
235600                                                                  23560000
235700     INITIALIZE PC046-COMMAREA-REC.                               23570000
235800     MOVE  SU019-SHIPT-UNT-ID    TO  PC046-CARTON-ID.             23580000
235900                                                                  23590000
236000     CALL PC-CRTN-STATUS-PGM                                      23600000
236100        USING PC046-COMMAREA-REC.                                 23610000
236200                                                                  23620000
236300     PERFORM 1200-INITIALIZE-HEADINGS.                            23630000
236400                                                                  23640000
236500     PERFORM 6005-VALIDATE-STATUS-CALL.                           23650000
236600                                                                  23660000
236700                                                                  23670000
236800* CHECK RETURN CODE FROM CRTN STATUS PROGRAM TO SEE IF SUCCESSFUL 23680000
236900 6005-VALIDATE-STATUS-CALL.                                       23690000
237000                                                                  23700000
237100     IF  PC046-SUCCESSFUL                                         23710000
237200         MOVE PC046-CARTON-ID        TO PV-SHIPT-UNT-ID           23720000
237300         MOVE PC046-CRTN-STAT-DESC   TO PV-CRTN-STATUS            23730000
237400                                                                  23740000
237500         MOVE PC046-CRTN-STAT-TMST   TO PV-MFST-TIMESTAMP         23750000
237600                                                                  23760000
237700         MOVE PC046-STATUS-USERID    TO PV-STATUS-USERID          23770000
237800                                                                  23780000
237900         IF PC046-SHPUNT-SRC-ID = 'ASN'                           23790000
238000            MOVE PC-ASN              TO PV-SHPUNT-SRC-ID          23800000
238100         END-IF                                                   23810000
238200         IF PC046-SHPUNT-SRC-ID = 'CKN'                           23820000
238300            MOVE PC-CKN              TO PV-SHPUNT-SRC-ID          23830000
238400         END-IF                                                   23840000
238500         IF PC046-SHPUNT-SRC-ID = 'CPS'                           23850000
238600            MOVE PC-CPS              TO PV-SHPUNT-SRC-ID          23860000
238700         END-IF                                                   23870000
238800         IF PC046-SHPUNT-SRC-ID = 'MAN'                           23880000
238900            MOVE PC-MAN              TO PV-SHPUNT-SRC-ID          23890000
239000         END-IF                                                   23900000
239100         IF PC046-SHPUNT-SRC-ID = 'P2L'                           23910000
239200            MOVE PC-P2L              TO PV-SHPUNT-SRC-ID          23920000
239300         END-IF                                                   23930000
239400         IF PC046-SHPUNT-SRC-ID = 'RCV'                           23940000
239500            MOVE PC-RCV              TO PV-SHPUNT-SRC-ID          23950000
239600         END-IF                                                   23960000
239700         IF PC046-SHPUNT-SRC-ID = 'RDM'                           23970000
239800            MOVE PC-RDM              TO PV-SHPUNT-SRC-ID          23980000
239900         END-IF                                                   23990000
239910         IF PC046-SHPUNT-SRC-ID = '3WD'                           23991008
239920            MOVE PC-3WD              TO PV-SHPUNT-SRC-ID          23992008
239930         END-IF                                                   23993008
240000         IF PC046-SHPUNT-SRC-ID = 'SMO'                           24000000
240100            MOVE PC-SMO              TO PV-SHPUNT-SRC-ID          24010000
240200         END-IF                                                   24020000
240300         IF PC046-SHPUNT-SRC-ID = 'FXR'                           24030000
240400            MOVE PC-FXR              TO PV-SHPUNT-SRC-ID          24040000
240500         END-IF                                                   24050000
240600         IF PC046-SHPUNT-SRC-ID = 'MST'                           24060000
240700            MOVE PC-MST              TO PV-SHPUNT-SRC-ID          24070000
240800         END-IF                                                   24080000
240900         IF PC046-SHPUNT-SRC-ID = 'MSC'                           24090000
241000            MOVE PC-MSC              TO PV-SHPUNT-SRC-ID          24100000
241100         END-IF                                                   24110000
241110         IF PC046-SHPUNT-SRC-ID = 'JWL'                           24111001
241120            MOVE PC-JWL              TO PV-SHPUNT-SRC-ID          24112001
241130         END-IF                                                   24113001
241140         IF PC046-SHPUNT-SRC-ID = 'DMG'                           24114001
241150            MOVE PC-DMG              TO PV-SHPUNT-SRC-ID          24115001
241160         END-IF                                                   24116001
241200         IF PC046-SHPUNT-SRC-ID = '   '                           24120000
241300            MOVE PC-UNKNOWN          TO PV-SHPUNT-SRC-ID          24130000
241400         END-IF                                                   24140000
241500                                                                  24150000
241600         IF PC046-PO-NBR > ZEROES                                 24160000
241700            MOVE PC046-PO-NBR        TO PV-PO-NBR                 24170000
241800            MOVE PC046-RCVR-NBR      TO PV-RCVR                   24180000
241900         ELSE                                                     24190000
242000            MOVE SPACES              TO PV-PO-NBR                 24200000
242100            MOVE SPACES              TO PV-RCVR                   24210000
242200         END-IF                                                   24220000
242300                                                                  24230000
242400         MOVE PC046-OTBD-TRIP-ID     TO PV-OTBD-TRIP-ID           24240000
242500         MOVE PC046-DEST-OPER-UNT-ID TO PV-DEST-OPER-UNT-ID       24250000
242600                                                                  24260000
242700         IF PC046-TRIP-STATUS = 'DO'                              24270000
242800            MOVE PC-DO               TO PV-TRIP-STATUS            24280000
242900         END-IF                                                   24290000
243000         IF PC046-TRIP-STATUS = 'DC'                              24300000
243100            MOVE PC-DC               TO PV-TRIP-STATUS            24310000
243200         END-IF                                                   24320000
243300         IF PC046-TRIP-STATUS = 'DS'                              24330000
243400            MOVE PC-DS               TO PV-TRIP-STATUS            24340000
243500         END-IF                                                   24350000
243600         IF PC046-TRIP-STATUS = 'SO'                              24360000
243700            MOVE PC-SO               TO PV-TRIP-STATUS            24370000
243800         END-IF                                                   24380000
243900         IF PC046-TRIP-STATUS = 'SU'                              24390000
244000            MOVE PC-SU               TO PV-TRIP-STATUS            24400000
244100         END-IF                                                   24410000
244200         IF PC046-TRIP-STATUS = 'AO'                              24420000
244300            MOVE PC-AO               TO PV-TRIP-STATUS            24430000
244400         END-IF                                                   24440000
244500         IF PC046-TRIP-STATUS = 'AK'                              24450000
244600            MOVE PC-AK               TO PV-TRIP-STATUS            24460000
244700         END-IF                                                   24470000
244800         IF PC046-TRIP-STATUS = 'AR'                              24480000
244900            MOVE PC-AR               TO PV-TRIP-STATUS            24490000
245000         END-IF                                                   24500000
245100         IF PC046-TRIP-STATUS = '  '                              24510000
245200            MOVE SPACES              TO PV-TRIP-STATUS            24520000
245300         END-IF                                                   24530000
245400     ELSE                                                         24540000
245500         MOVE SU019-SHIPT-UNT-ID     TO PV-SHIPT-UNT-ID           24550000
245600                                                                  24560000
245700         MOVE PC046-CRTN-STAT-DESC   TO PV-CRTN-STATUS            24570000
245800                                                                  24580000
245900         MOVE PC046-CRTN-STAT-TMST   TO PV-MFST-TIMESTAMP         24590000
246000                                                                  24600000
246100         MOVE PC046-STATUS-USERID    TO PV-STATUS-USERID          24610000
246200                                                                  24620000
246300         IF PC046-SHPUNT-SRC-ID = 'ASN'                           24630000
246400            MOVE PC-ASN              TO PV-SHPUNT-SRC-ID          24640000
246500         END-IF                                                   24650000
246600         IF PC046-SHPUNT-SRC-ID = 'CKN'                           24660000
246700            MOVE PC-CKN              TO PV-SHPUNT-SRC-ID          24670000
246800         END-IF                                                   24680000
246900         IF PC046-SHPUNT-SRC-ID = 'CPS'                           24690000
247000            MOVE PC-CPS              TO PV-SHPUNT-SRC-ID          24700000
247100         END-IF                                                   24710000
247200         IF PC046-SHPUNT-SRC-ID = 'MAN'                           24720000
247300            MOVE PC-MAN              TO PV-SHPUNT-SRC-ID          24730000
247400         END-IF                                                   24740000
247500         IF PC046-SHPUNT-SRC-ID = 'P2L'                           24750000
247600            MOVE PC-P2L              TO PV-SHPUNT-SRC-ID          24760000
247700         END-IF                                                   24770000
247800         IF PC046-SHPUNT-SRC-ID = 'RCV'                           24780000
247900            MOVE PC-RCV              TO PV-SHPUNT-SRC-ID          24790000
248000         END-IF                                                   24800000
248100         IF PC046-SHPUNT-SRC-ID = 'RDM'                           24810000
248200            MOVE PC-RDM              TO PV-SHPUNT-SRC-ID          24820000
248300         END-IF                                                   24830000
248310         IF PC046-SHPUNT-SRC-ID = '3WD'                           24831008
248320            MOVE PC-3WD              TO PV-SHPUNT-SRC-ID          24832008
248330         END-IF                                                   24833008
248400         IF PC046-SHPUNT-SRC-ID = 'SMO'                           24840000
248500            MOVE PC-SMO              TO PV-SHPUNT-SRC-ID          24850000
248600         END-IF                                                   24860000
248700         IF PC046-SHPUNT-SRC-ID = 'FXR'                           24870000
248800            MOVE PC-FXR              TO PV-SHPUNT-SRC-ID          24880000
248900         END-IF                                                   24890000
249000         IF PC046-SHPUNT-SRC-ID = 'MST'                           24900000
249100            MOVE PC-MST              TO PV-SHPUNT-SRC-ID          24910000
249200         END-IF                                                   24920000
249300         IF PC046-SHPUNT-SRC-ID = 'MSC'                           24930000
249400            MOVE PC-MSC              TO PV-SHPUNT-SRC-ID          24940000
249500         END-IF                                                   24950000
249510         IF PC046-SHPUNT-SRC-ID = 'JWL'                           24951001
249520            MOVE PC-JWL              TO PV-SHPUNT-SRC-ID          24952001
249530         END-IF                                                   24953001
249540         IF PC046-SHPUNT-SRC-ID = 'DMG'                           24954001
249550            MOVE PC-DMG              TO PV-SHPUNT-SRC-ID          24955001
249560         END-IF                                                   24956001
249600         IF PC046-SHPUNT-SRC-ID = '   '                           24960000
249700            MOVE PC-UNKNOWN          TO PV-SHPUNT-SRC-ID          24970000
249800         END-IF                                                   24980000
249900                                                                  24990000
250000         IF PC046-PO-NBR > ZEROES                                 25000000
250100            MOVE PC046-PO-NBR        TO PV-PO-NBR                 25010000
250200            MOVE PC046-RCVR-NBR      TO PV-RCVR                   25020000
250300         ELSE                                                     25030000
250400            MOVE SPACES              TO PV-PO-NBR                 25040000
250500            MOVE SPACES              TO PV-RCVR                   25050000
250600         END-IF                                                   25060000
250700                                                                  25070000
250800         MOVE PC046-OTBD-TRIP-ID     TO PV-OTBD-TRIP-ID           25080000
250900         MOVE PC046-DEST-OPER-UNT-ID TO PV-DEST-OPER-UNT-ID       25090000
251000                                                                  25100000
251100         IF PC046-TRIP-STATUS = 'DO'                              25110000
251200            MOVE PC-DO               TO PV-TRIP-STATUS            25120000
251300         END-IF                                                   25130000
251400         IF PC046-TRIP-STATUS = 'DC'                              25140000
251500            MOVE PC-DC               TO PV-TRIP-STATUS            25150000
251600         END-IF                                                   25160000
251700         IF PC046-TRIP-STATUS = 'DS'                              25170000
251800            MOVE PC-DS               TO PV-TRIP-STATUS            25180000
251900         END-IF                                                   25190000
252000         IF PC046-TRIP-STATUS = 'SO'                              25200000
252100            MOVE PC-SO               TO PV-TRIP-STATUS            25210000
252200         END-IF                                                   25220000
252300         IF PC046-TRIP-STATUS = 'SU'                              25230000
252400            MOVE PC-SU               TO PV-TRIP-STATUS            25240000
252500         END-IF                                                   25250000
252600         IF PC046-TRIP-STATUS = 'AO'                              25260000
252700            MOVE PC-AO               TO PV-TRIP-STATUS            25270000
252800         END-IF                                                   25280000
252900         IF PC046-TRIP-STATUS = 'AK'                              25290000
253000            MOVE PC-AK               TO PV-TRIP-STATUS            25300000
253100         END-IF                                                   25310000
253200         IF PC046-TRIP-STATUS = 'AR'                              25320000
253300            MOVE PC-AR               TO PV-TRIP-STATUS            25330000
253400         END-IF                                                   25340000
253500         IF PC046-TRIP-STATUS = '  '                              25350000
253600            MOVE SPACES              TO PV-TRIP-STATUS            25360000
253700         END-IF                                                   25370000
253800                                                                  25380000
253900         IF PC046-ERROR                                           25390000
254000             DISPLAY '** ABEND - PROGRAM '                        25400000
254100                     PC-CURRENT-PROGRAM-NAME ' **'                25410000
254200             DISPLAY '** BAD CALL TO CRTN STATUS PGM PCKUT713'    25420000
254300             DISPLAY PC046-CRA-RET-MSG                            25430000
254400             MOVE +4019 TO ABEND-CODE                             25440000
254500             CALL 'ILBOABN0' USING ABEND-CODE                     25450000
254600             STRING 'ERR FILE# SQL='        DELIMITED BY SIZE     25460000
254700                     PV-SQL-RETURN-CD       DELIMITED BY SIZE     25470000
254800                                       INTO PC046-CRA-RET-MSG     25480000
254900             SET  PC046-INVALID-SQL      TO TRUE                  25490000
255000             MOVE '6005-'                TO PC046-CRA-REQ-ID      25500000
255100     END-IF.                                                      25510000
255200                                                                  25520000
255300                                                                  25530000
255400*PRINTS NO DETAIL LINE.                                           25540000
255500 6900-NO-DETAIL.                                                  25550000
255600     WRITE REPORT-RECORD                                          25560000
255700       FROM NO-DATA-TO-REPORT-LINE                                25570000
255800         AFTER ADVANCING 3 LINES.                                 25580000
255900                                                                  25590000
256000                                                                  25600000
256100 7000-READ-CARDIN-FILE.                                           25610000
256200     READ CARDIN-INPUT-FILE INTO CC-CONTROL-CARD                  25620000
256300        AT END                                                    25630000
256400           SET PS-EOF-CARDIN-FILE TO TRUE.                        25640000
256500                                                                  25650000
256600     IF PS-EOF-CARDIN-FILE                                        25660000
256700         CONTINUE                                                 25670000
256800     ELSE                                                         25680000
256900         DISPLAY 'TRLR AUDIT NBR IS : ' CC-AUD-CNTL-NBR           25690000
257000         PERFORM 7050-VALIDATE-CONTROL-CARD                       25700000
257100     END-IF.                                                      25710000
257200                                                                  25720000
257300                                                                  25730000
257400*NUMERIC EDIT OF AUDIT CONTROL NUMBER                             25740000
257500 7050-VALIDATE-CONTROL-CARD.                                      25750000
257600                                                                  25760000
257700     MOVE CC-AUD-CNTL-NBR            TO DP010I-UNEDITED-FIELD.    25770000
257800     MOVE +9                         TO DP010I-MAXIMUM-DIGITS.    25780000
257900     MOVE 0                          TO DP010I-MAXIMUM-DECIMALS.  25790000
258000     SET DP010I-NEGATIVE-NOT-ALLOWED TO TRUE.                     25800000
258100     CALL DP010I-NUMERIC-EDIT-ROUTINE                             25810000
258200         USING DP010I-NUMERIC-EDIT-AREA.                          25820000
258300                                                                  25830000
258400     IF DP010I-NO-ERROR-DETECTED                                  25840000
258500         MOVE DP010I-NUMERIC-FIELD  TO DK-AUD-CNTL-NBR            25850000
258600     ELSE                                                         25860000
258700         DISPLAY '** SUKUT049 ABEND **'                           25870000
258800         DISPLAY '** AUDIT NUMBER IS NOT NUMERIC **'              25880000
258900         MOVE +4019                  TO PV-ABEND-CODE             25890000
259000         CALL 'ILBOABN0' USING PV-ABEND-CODE                      25900000
259100     END-IF.                                                      25910000
259200                                                                  25920000
259300                                                                  25930000
259400* READS EXTRACT FILE 1 - AUDIT-EXTRACT-FILE                       25940000
259500 7100-READ-EXTRACT1.                                              25950000
259600     READ AUDIT-EXTRACT-FILE INTO SU019-EXTRACT-RECORD            25960000
259700        AT END                                                    25970000
259800           SET PS-END-OF-EXTRACT1 TO TRUE                         25980000
259900     END-READ.                                                    25990000
259901                                                                  25990123
259910     IF PS-END-OF-EXTRACT1                                        25991023
259920        NEXT SENTENCE                                             25992023
259930     ELSE                                                         25993023
259940        ADD +1 TO PV-READ-EXCEPTION-COUNT                         25994023
259950     END-IF.                                                      25995023
260000                                                                  26000000
260100                                                                  26010000
260200* READS EXTRACT FILE 2 - CRTN-MFST-FILE                           26020000
260300 7200-READ-EXTRACT2.                                              26030000
260400     READ CRTN-MFST-FILE        INTO SU018-EXTRACT-RECORD         26040000
260500        AT END                                                    26050000
260600           SET PS-END-OF-EXTRACT2 TO TRUE                         26060000
260700     END-READ.                                                    26070000
260710                                                                  26071023
260720     IF PS-END-OF-EXTRACT2                                        26072023
260730        NEXT SENTENCE                                             26073023
260740     ELSE                                                         26074023
260750        ADD +1 TO PV-READ-MANIFEST-COUNT                          26075023
260760     END-IF.                                                      26076023
260800                                                                  26080000
260900     IF SUNAUD-AUD-TYP-CDE = '01'                                 26090000
261000        PERFORM 2500-OPEN-MFST-CTNS-CSR                           26100000
261100        PERFORM 2510-FETCH-MFST-CTNS-CSR                          26110000
261200        PERFORM 2520-CLOSE-MFST-CTNS-CSR                          26120000
261210     ELSE                                                         26121027
261220        MOVE PV-AUD-CRTN-CNT TO SU018-MFST-CRTN-CNT               26122027
261300     END-IF.                                                      26130000
261400                                                                  26140000
261500                                                                  26150000
261600 8000-PRINT-REPORT-HEADINGS.                                      26160000
261700     ADD 1                        TO PV-PAGE-COUNT.               26170000
261800     MOVE PV-PAGE-COUNT           TO DP132O-PAGE-NUMBER.          26180000
261900                                                                  26190000
262000     MOVE ZERO                    TO PV-LINE-COUNT.               26200000
262100     MOVE PC-1                    TO DP132O-REPORT-NUMBER.        26210000
262200                                                                  26220000
262300     WRITE REPORT-RECORD                                          26230000
262400       FROM DP132O-STANDRD-HEADER-132-COLS                        26240000
262500         AFTER ADVANCING PAGE.                                    26250000
262600                                                                  26260000
262700     WRITE REPORT-RECORD FROM HEADING-LINE1.                      26270000
262800                                                                  26280000
262900     WRITE REPORT-RECORD FROM HEADING-LINE2.                      26290000
263000                                                                  26300000
263100     WRITE REPORT-RECORD FROM PC-BLANK-LINE.                      26310000
263200                                                                  26320000
263300     MOVE SU019-FCLTY-ID          TO HL3-FCLTY-ID                 26330000
263400     MOVE SU019-FCLTY-NME         TO HL3-FCLTY-NME                26340000
263500     WRITE REPORT-RECORD FROM HEADING-LINE3.                      26350000
263600                                                                  26360000
263700     MOVE SU019-AUD-CNTL-NBR      TO HL4-AUD-CNTL-NBR             26370000
263800     MOVE SU019-AUD-TYP-CDE       TO HL4-AUD-TYP-CDE              26380000
263900     MOVE SU019-AUD-STAT-CDE      TO HL4-AUD-STAT-CDE             26390000
264000     WRITE REPORT-RECORD FROM HEADING-LINE4.                      26400000
264100                                                                  26410000
264200     MOVE SU019-AUD-STRT-TMST     TO PV-DB2-TIMESTAMP             26420000
264300     MOVE PV-TMST-MM              TO HL5-STRT-MM                  26430000
264400     MOVE PV-TMST-DD              TO HL5-STRT-DD                  26440000
264500     MOVE PV-TMST-CC              TO HL5-STRT-CC                  26450000
264600     MOVE PV-TMST-YY              TO HL5-STRT-YY                  26460000
264700     MOVE PV-TMST-HH              TO HL5-STRT-HH                  26470000
264800                                     PV-AUD-STRT-HH               26480000
264900     MOVE PV-TMST-MI              TO HL5-STRT-MI                  26490000
265000                                     PV-AUD-STRT-MI               26500000
265100                                                                  26510000
265200     MOVE SU019-AUD-STP-TMST      TO PV-DB2-TIMESTAMP             26520000
265300     MOVE PV-TMST-MM              TO HL5-STP-MM                   26530000
265400     MOVE PV-DASH1                TO HL5-DASH1                    26540000
265500     MOVE PV-TMST-DD              TO HL5-STP-DD                   26550000
265600     MOVE PV-DASH2                TO HL5-DASH2                    26560000
265700     MOVE PV-TMST-CC              TO HL5-STP-CC                   26570000
265800     MOVE PV-TMST-YY              TO HL5-STP-YY                   26580000
265900     MOVE PV-TMST-HH              TO HL5-STP-HH                   26590000
266000                                     PV-AUD-STP-HH                26600000
266100     MOVE PV-COLON                TO HL5-COLON                    26610000
266200     MOVE PV-TMST-MI              TO HL5-STP-MI                   26620000
266300                                     PV-AUD-STP-MI                26630000
266400                                                                  26640000
266500     IF HL5-STP-DATE = '09-09-9999' AND                           26650000
266600        HL5-STP-TIME = '09:09'                                    26660000
266700        MOVE SPACES               TO HL5-STP-MM                   26670000
266800        MOVE SPACES               TO HL5-DASH1                    26680000
266900        MOVE SPACES               TO HL5-STP-DD                   26690000
267000        MOVE SPACES               TO HL5-DASH2                    26700000
267100        MOVE SPACES               TO HL5-STP-CC                   26710000
267200        MOVE SPACES               TO HL5-STP-YY                   26720000
267300        MOVE SPACES               TO HL5-STP-HH                   26730000
267400        MOVE SPACES               TO HL5-COLON                    26740000
267500        MOVE SPACES               TO HL5-STP-MI                   26750000
267600        MOVE SPACES               TO HL5-AUD-DURATION             26760000
267700     ELSE                                                         26770000
267800        PERFORM 4050-CALC-AUDIT-DURATION                          26780000
267900        IF  PV-CARTON-DURATION  > 0                               26790000
268000            DIVIDE  PV-CARTON-DURATION                            26800000
268100                BY  60                                            26810000
268200            GIVING  PV-CARTON-HOURS                               26820000
268300            REMAINDER  PV-CARTON-MIN                              26830000
268400        ELSE                                                      26840000
268500            MOVE  ZEROES  TO  PV-CARTON-HOURS                     26850000
268600                              PV-CARTON-MIN                       26860000
268700        END-IF                                                    26870000
268800                                                                  26880000
268900        IF  PV-CARTON-HOURS   >  0  OR                            26890000
269000            PV-CARTON-MIN     >  0                                26900000
269100            MOVE  PV-CARTON-HOURS      TO  PV-DISPLAY-HOURS       26910000
269200            MOVE  PV-CARTON-MIN        TO  PV-DISPLAY-MIN         26920000
269300            MOVE  PV-DISPLAY-DURATION  TO  HL5-AUD-DURATION       26930000
269400        ELSE                                                      26940000
269500            MOVE  SPACES               TO  HL5-AUD-DURATION       26950000
269600        END-IF                                                    26960000
269700     END-IF.                                                      26970000
269800     WRITE REPORT-RECORD FROM HEADING-LINE5.                      26980000
269900                                                                  26990000
270000     MOVE SU019-ORIG-TRLR-SER-NBR TO HL6-ORIG-TRLR-SER-NBR        27000000
270100     MOVE SU019-DEST-TRLR-SER-NBR TO HL6-DEST-TRLR-SER-NBR        27010000
270200     MOVE SU019-DEST-TYP-CDE      TO HL6-DEST-TYP-CDE             27020000
270300     WRITE REPORT-RECORD FROM HEADING-LINE6.                      27030000
270400                                                                  27040000
270500     MOVE SU019-ORIG-TRIP-ID      TO HL7-ORIG-TRIP-ID             27050000
270600     MOVE SU019-DEST-TRIP-ID      TO HL7-DEST-TRIP-ID             27060000
270700     MOVE SU019-DEST-OPER-UNT-ID  TO HL7-DEST-OPER-UNT-ID         27070000
270800     WRITE REPORT-RECORD FROM HEADING-LINE7.                      27080000
270900                                                                  27090000
271000     MOVE SU019-AUD-INITIATED-BY  TO HL8-AUD-USR-ID               27100000
271100     MOVE SUOBTS-DOOR-ID          TO HL8-DOOR-ID                  27110000
271200     WRITE REPORT-RECORD FROM HEADING-LINE8.                      27120000
271300                                                                  27130000
271400     WRITE REPORT-RECORD FROM PC-BLANK-LINE.                      27140000
271500                                                                  27150000
271600*    MOVE PV-AUD-CRTN-CNT     TO HL9-AUD-CTN-QTY                  27160009
271700*    MOVE PV-AUD-CRTN-ERR-CNT TO HL9-AUD-CTN-ERR-QTY              27170009
271800*    WRITE REPORT-RECORD FROM HEADING-LINE9.                      27180009
271900                                                                  27190000
272000     WRITE REPORT-RECORD FROM PC-BLANK-LINE.                      27200000
272100                                                                  27210000
272200***** HOW MANIFESTED CARTONS IS DETERMINED ***********************27220000
272300*IF SPOT AUDIT, SU018-MFST-CRTN-CNT IS POPULATED FROM THE NUMBER  27230027
272400*OF UNIQUE CARTONS AUDITED FOR THE AUDIT NUMBER FROM THE          27240027
272410*SUT_AUD_TRLR_CART TABLE - FROM THE 2300-COUNT-AUDITED-CRTNS      27241027
272420*PARAGRAPH.                                                       27242027
272500*                                                                 27250000
272600*IF 100% AUDIT, SU018-MFST-CRTN-CNT IS FROM SUT00007-CART-QTY.    27260000
272700*(SUT_TRIP_SUM TABLE)                                             27270000
272800                                                                  27280000
272801     MOVE ZERO TO PV-TOT-ERROR-CNT                                27280112
272810     ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT            27281013
272820         GIVING PV-TOT-ERROR-CNT                                  27282012
272830     IF  SUNAUD-AUD-TYP-CDE = '01'                                27283028
272840         MOVE 'MANIFESTED CARTONS.:' TO HL10-CTN-DESC             27284028
272850     ELSE                                                         27285028
272860         MOVE 'AUDITED CARTONS....:' TO HL10-CTN-DESC             27286028
272870     END-IF                                                       27287028
272900     MOVE SU018-MFST-CRTN-CNT     TO HL10-MFST-CTN-QTY            27290000
273000     MOVE PV-TOT-ERROR-CNT        TO HL10-MFST-CTN-ERR-QTY        27300012
273100                                                                  27310000
273200*CALCULATE TOTAL ACCURACY RATE                                    27320000
273410*ACCURACY RATE FOR 100% TRAILER AUDIT IS CALCULATED BY TAKING     27341029
273420*THE CARTONS MANIFESTED TO THE TRAILER FROM SUT_TRIP_SUM AND      27342029
273430*THE NUMBER OF DISTINCT CARTONS IN ERROR.                         27343029
273440*ACCURACY RATE FOR SPOT AUDIT IS CALCULATED BY TAKING THE         27344029
273450*DISTINCT NUMBER OF CARTONS AUDITED AND THE NUMBER OF DISTINCT    27345029
273460*CARTONS IN ERROR.                                                27346029
273461     EVALUATE TRUE                                                27346129
273470*WHEN A00% AUDIT TYPE                                             27347029
273500        WHEN SUNAUD-AUD-TYP-CDE = '01'                            27350000
273600           IF SU018-MFST-CRTN-CNT     > ZERO                      27360000
273610               MOVE ZERO TO PV-TOT-ERROR-CNT                      27361012
273700               ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT  27370000
273800                   GIVING PV-TOT-ERROR-CNT                        27380012
273900               DIVIDE PV-TOT-ERROR-CNT BY SU018-MFST-CRTN-CNT     27390012
274000                   GIVING PV-DIVIDEND ROUNDED                     27400000
274100               MULTIPLY PV-DIVIDEND BY 100                        27410000
274200                   GIVING PV-AUD-CRTN-ERR-PRCT                    27420000
274300                                                                  27430000
274400               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             27440000
274500                   GIVING PV-AUDIT-ERROR-PRCT                     27450000
274600                                                                  27460000
274700               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           27470000
274800                  MOVE PC-0   TO HL10-TOT-ACC-RATE                27480000
274900               ELSE                                               27490000
275000                  MOVE PV-AUDIT-ERROR-PRCT                        27500000
275100                              TO HL10-TOT-ACC-RATE                27510000
275200               END-IF                                             27520000
275300                                                                  27530000
275400           ELSE                                                   27540000
275500               MOVE PC-100  TO  HL10-TOT-ACC-RATE                 27550000
275600           END-IF                                                 27560000
275700                                                                  27570000
275800*WHEN SPOT CHECK AUDIT TYPE                                       27580000
275900        WHEN SUNAUD-AUD-TYP-CDE = '02'                            27590000
276000           IF PV-AUD-CRTN-CNT     > ZERO                          27600000
276100               DIVIDE PV-AUD-CRTN-ERR-CNT BY PV-AUD-CRTN-CNT      27610000
276200                   GIVING PV-DIVIDEND ROUNDED                     27620000
276300               MULTIPLY PV-DIVIDEND BY 100                        27630000
276400                   GIVING PV-AUD-CRTN-ERR-PRCT                    27640000
276500                                                                  27650000
276600               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             27660000
276700                   GIVING PV-AUDIT-ERROR-PRCT                     27670000
276800                                                                  27680000
276900               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           27690000
277000                  MOVE PC-0   TO HL10-TOT-ACC-RATE                27700000
277100               ELSE                                               27710000
277200                  MOVE PV-AUDIT-ERROR-PRCT                        27720000
277300                              TO HL10-TOT-ACC-RATE                27730000
277400               END-IF                                             27740000
277500           ELSE                                                   27750000
277600               MOVE PC-100  TO  HL10-TOT-ACC-RATE                 27760000
277700           END-IF                                                 27770000
277800     END-EVALUATE.                                                27780000
277900                                                                  27790000
278000     WRITE REPORT-RECORD FROM HEADING-LINE10.                     27800000
278100                                                                  27810000
278200     WRITE REPORT-RECORD FROM PC-BLANK-LINE.                      27820000
278300                                                                  27830000
278400     WRITE REPORT-RECORD FROM HEADING-LINE11.                     27840000
278500                                                                  27850000
278600     WRITE REPORT-RECORD FROM PC-BLANK-LINE.                      27860000
278700                                                                  27870000
278800     MOVE SPACES TO REPORT-RECORD.                                27880000
278900     WRITE REPORT-RECORD                                          27890000
279000         AFTER ADVANCING 1 LINE.                                  27900000
279100                                                                  27910000
279200     ADD +18             TO PV-LINE-COUNT.                        27920000
279300                                                                  27930000
279400                                                                  27940000
279500 8050-PRINT-NO-ERR-HEADING.                                       27950000
279600     ADD 1                        TO PV-PAGE-COUNT.               27960000
279700     MOVE PV-PAGE-COUNT           TO DP132O-PAGE-NUMBER.          27970000
279800                                                                  27980000
279900     MOVE ZERO                    TO PV-LINE-COUNT.               27990000
280000     MOVE PC-1                    TO DP132O-REPORT-NUMBER.        28000000
280100                                                                  28010000
280200     WRITE REPORT-RECORD                                          28020000
280300       FROM DP132O-STANDRD-HEADER-132-COLS                        28030000
280400         AFTER ADVANCING PAGE.                                    28040000
280500                                                                  28050000
280600     WRITE REPORT-RECORD                                          28060000
280700       FROM HEADING-LINE1                                         28070000
280800         AFTER ADVANCING 2 LINES.                                 28080000
280900                                                                  28090000
281000     WRITE REPORT-RECORD                                          28100000
281100       FROM HEADING-LINE2                                         28110000
281200         AFTER ADVANCING 1 LINE.                                  28120000
281300                                                                  28130000
281400     WRITE REPORT-RECORD                                          28140000
281500       FROM PC-BLANK-LINE                                         28150000
281600         AFTER ADVANCING 1 LINE.                                  28160000
281700*GET DC & DESC FROM COPYBOOK DON'T NEED TO GET IT AGAIN           28170000
282000     MOVE SU019-FCLTY-ID          TO HL3-FCLTY-ID                 28200000
282100     MOVE SU019-FCLTY-NME         TO HL3-FCLTY-NME                28210000
282200                                                                  28220000
282300     WRITE REPORT-RECORD                                          28230000
282400       FROM HEADING-LINE3                                         28240000
282500         AFTER ADVANCING 1 LINE.                                  28250000
282600                                                                  28260000
282700     MOVE CC-AUD-CNTL-NBR      TO HL4-AUD-CNTL-NBR                28270000
282800     IF SUNAUD-AUD-TYP-CDE = '01'                                 28280000
282900        MOVE PC-100-PRCT              TO HL4-AUD-TYP-CDE          28290000
283000     END-IF                                                       28300000
283100                                                                  28310000
283200     IF SUNAUD-AUD-TYP-CDE = '02'                                 28320000
283300        MOVE PC-SPOT                  TO HL4-AUD-TYP-CDE          28330000
283400     END-IF                                                       28340000
283500                                                                  28350000
283600     IF SUNAUD-AUD-TYP-CDE = '03'                                 28360000
283700        MOVE PC-REWORK                TO HL4-AUD-TYP-CDE          28370000
283800     END-IF                                                       28380000
283900                                                                  28390000
284000     IF SUNAUD-AUD-STAT-CDE = 'CR'                                28400000
284100        MOVE PC-CR                    TO HL4-AUD-STAT-CDE         28410000
284200     END-IF                                                       28420000
284300                                                                  28430000
284400     IF SUNAUD-AUD-STAT-CDE = 'IP'                                28440000
284500        MOVE PC-IP                    TO HL4-AUD-STAT-CDE         28450000
284600     END-IF                                                       28460000
284700                                                                  28470000
284800     IF SUNAUD-AUD-STAT-CDE = 'CM'                                28480000
284900        MOVE PC-CM                    TO HL4-AUD-STAT-CDE         28490000
285000     END-IF                                                       28500000
285100                                                                  28510000
285200     IF SUNAUD-AUD-STAT-CDE = 'PP'                                28520000
285300        MOVE PC-PP                    TO HL4-AUD-STAT-CDE         28530000
285400     END-IF                                                       28540000
285500                                                                  28550000
285600     WRITE REPORT-RECORD                                          28560000
285700       FROM HEADING-LINE4                                         28570000
285800         AFTER ADVANCING 1 LINE.                                  28580000
285900                                                                  28590000
286000     MOVE SUNAUD-AUD-STRT-TMST    TO PV-DB2-TIMESTAMP             28600000
286100     MOVE PV-TMST-MM              TO HL5-STRT-MM                  28610000
286200     MOVE PV-TMST-DD              TO HL5-STRT-DD                  28620000
286300     MOVE PV-TMST-CC              TO HL5-STRT-CC                  28630000
286400     MOVE PV-TMST-YY              TO HL5-STRT-YY                  28640000
286500     MOVE PV-TMST-HH              TO HL5-STRT-HH                  28650000
286600                                     PV-AUD-STRT-HH               28660000
286700     MOVE PV-TMST-MI              TO HL5-STRT-MI                  28670000
286800                                     PV-AUD-STRT-MI               28680000
286900                                                                  28690000
287000     MOVE SUNAUD-AUD-STP-TMST     TO PV-DB2-TIMESTAMP             28700000
287100     MOVE PV-TMST-MM              TO HL5-STP-MM                   28710000
287200     MOVE PV-DASH1                TO HL5-DASH1                    28720000
287300     MOVE PV-TMST-DD              TO HL5-STP-DD                   28730000
287400     MOVE PV-DASH2                TO HL5-DASH2                    28740000
287500     MOVE PV-TMST-CC              TO HL5-STP-CC                   28750000
287600     MOVE PV-TMST-YY              TO HL5-STP-YY                   28760000
287700     MOVE PV-TMST-HH              TO HL5-STP-HH                   28770000
287800                                     PV-AUD-STP-HH                28780000
287900     MOVE PV-COLON                TO HL5-COLON                    28790000
288000     MOVE PV-TMST-MI              TO HL5-STP-MI                   28800000
288100                                     PV-AUD-STP-MI                28810000
288200                                                                  28820000
288300     IF HL5-STP-DATE = '09-09-9999' AND                           28830000
288400        HL5-STP-TIME = '09:09'                                    28840000
288500        MOVE SPACES               TO HL5-STP-MM                   28850000
288600        MOVE SPACES               TO HL5-DASH1                    28860000
288700        MOVE SPACES               TO HL5-STP-DD                   28870000
288800        MOVE SPACES               TO HL5-DASH2                    28880000
288900        MOVE SPACES               TO HL5-STP-CC                   28890000
289000        MOVE SPACES               TO HL5-STP-YY                   28900000
289100        MOVE SPACES               TO HL5-STP-HH                   28910000
289200        MOVE SPACES               TO HL5-COLON                    28920000
289300        MOVE SPACES               TO HL5-STP-MI                   28930000
289400        MOVE SPACES               TO HL5-AUD-DURATION             28940000
289500     ELSE                                                         28950000
289600        PERFORM 4050-CALC-AUDIT-DURATION                          28960000
289700        IF  PV-CARTON-DURATION  > 0                               28970000
289800            DIVIDE  PV-CARTON-DURATION                            28980000
289900                BY  60                                            28990000
290000            GIVING  PV-CARTON-HOURS                               29000000
290100            REMAINDER  PV-CARTON-MIN                              29010000
290200        ELSE                                                      29020000
290300            MOVE  ZEROES  TO  PV-CARTON-HOURS                     29030000
290400                              PV-CARTON-MIN                       29040000
290500        END-IF                                                    29050000
290600                                                                  29060000
290700        IF  PV-CARTON-HOURS   >  0  OR                            29070000
290800            PV-CARTON-MIN     >  0                                29080000
290900            MOVE  PV-CARTON-HOURS      TO  PV-DISPLAY-HOURS       29090000
291000            MOVE  PV-CARTON-MIN        TO  PV-DISPLAY-MIN         29100000
291100            MOVE  PV-DISPLAY-DURATION  TO  HL5-AUD-DURATION       29110000
291200        ELSE                                                      29120000
291300            MOVE  SPACES               TO  HL5-AUD-DURATION       29130000
291400        END-IF                                                    29140000
291500     END-IF                                                       29150000
291600                                                                  29160000
291700     WRITE REPORT-RECORD                                          29170000
291800       FROM HEADING-LINE5                                         29180000
291900         AFTER ADVANCING 1 LINE.                                  29190000
292000                                                                  29200000
292100     MOVE SU019-ORIG-TRLR-SER-NBR TO HL6-ORIG-TRLR-SER-NBR        29210000
292200     IF SUNAUD-DEST-TYP-CDE = 'D'                                 29220000
292300        MOVE SU019-DEST-TRLR-SER-NBR TO HL6-DEST-TRLR-SER-NBR     29230000
292400     ELSE                                                         29240000
292500        MOVE ZEROES TO HL6-DEST-TRLR-SER-NBR                      29250000
292600     END-IF                                                       29260000
292700                                                                  29270000
292800     EVALUATE TRUE                                                29280000
292900        WHEN SUNAUD-DEST-TYP-CDE = 'D'                            29290000
293000           MOVE PC-DIFFERENT TO HL6-DEST-TYP-CDE                  29300000
293100        WHEN SUNAUD-DEST-TYP-CDE = 'S'                            29310000
293200           MOVE PC-SAME      TO HL6-DEST-TYP-CDE                  29320000
293300        WHEN SUNAUD-DEST-TYP-CDE = 'C'                            29330000
293400           MOVE PC-CONVEYOR  TO HL6-DEST-TYP-CDE                  29340000
293500     END-EVALUATE                                                 29350000
293600                                                                  29360000
293700     WRITE REPORT-RECORD                                          29370000
293800       FROM HEADING-LINE6                                         29380000
293900         AFTER ADVANCING 1 LINE.                                  29390000
294000                                                                  29400000
294100     MOVE SUT00004-ORIG-OTBND-TRIP-ID TO HL7-ORIG-TRIP-ID         29410000
294200     MOVE SUT00004-DEST-OTBND-TRIP-ID TO HL7-DEST-TRIP-ID         29420000
294300     MOVE SUOBTR-DEST-OPER-UNT-ID     TO HL7-DEST-OPER-UNT-ID     29430000
294400                                                                  29440000
294500     WRITE REPORT-RECORD                                          29450000
294600       FROM HEADING-LINE7                                         29460000
294700         AFTER ADVANCING 1 LINE.                                  29470000
294800                                                                  29480000
294900     MOVE SUNAUD-AUD-USR-ID  TO HL8-AUD-USR-ID                    29490000
295000     MOVE SUOBTS-DOOR-ID     TO HL8-DOOR-ID                       29500000
295100     WRITE REPORT-RECORD                                          29510000
295200       FROM HEADING-LINE8                                         29520000
295300         AFTER ADVANCING 1 LINE.                                  29530000
295400                                                                  29540000
295500     WRITE REPORT-RECORD                                          29550000
295600       FROM PC-BLANK-LINE                                         29560000
295700         AFTER ADVANCING 1 LINE.                                  29570000
295800                                                                  29580000
295900*    MOVE PV-AUD-CRTN-CNT     TO HL9-AUD-CTN-QTY                  29590009
296000*    MOVE PV-AUD-CRTN-ERR-CNT TO HL9-AUD-CTN-ERR-QTY              29600009
296100*    WRITE REPORT-RECORD                                          29610009
296200*      FROM HEADING-LINE9                                         29620009
296300*        AFTER ADVANCING 1 LINE.                                  29630009
296400                                                                  29640000
296410     MOVE ZERO TO PV-TOT-ERROR-CNT                                29641012
296420     ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT            29642013
296430         GIVING PV-TOT-ERROR-CNT                                  29643012
296431     IF  SUNAUD-AUD-TYP-CDE = '01'                                29643128
296432         MOVE 'MANIFESTED CARTONS.:' TO HL10-CTN-DESC             29643228
296433     ELSE                                                         29643328
296434         MOVE 'AUDITED CARTONS....:' TO HL10-CTN-DESC             29643428
296435     END-IF                                                       29643528
296440     MOVE SU018-MFST-CRTN-CNT     TO HL10-MFST-CTN-QTY            29644012
296450     MOVE PV-TOT-ERROR-CNT        TO HL10-MFST-CTN-ERR-QTY        29645012
296700                                                                  29670000
296800*CALCULATE TOTAL ACCURACY RATE                                    29680000
296920*ACCURACY RATE FOR 100% TRAILER AUDIT IS CALCULATED BY TAKING     29692029
296930*THE CARTONS MANIFESTED TO THE TRAILER FROM SUT_TRIP_SUM AND      29693029
296940*THE NUMBER OF DISTINCT CARTONS IN ERROR.                         29694029
296950*ACCURACY RATE FOR SPOT AUDIT IS CALCULATED BY TAKING THE         29695029
296960*DISTINCT NUMBER OF CARTONS AUDITED AND THE NUMBER OF DISTINCT    29696029
296970*CARTONS IN ERROR.                                                29697029
296980     EVALUATE TRUE                                                29698029
297000*WHEN 100% AUDIT TYPE                                             29700000
297100        WHEN SUNAUD-AUD-TYP-CDE = '01'                            29710000
297200           IF SU018-MFST-CRTN-CNT     > ZERO                      29720000
297210               MOVE ZERO TO PV-TOT-ERROR-CNT                      29721012
297300               ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT  29730000
297400                   GIVING PV-TOT-ERROR-CNT                        29740012
297500               DIVIDE PV-TOT-ERROR-CNT BY SU018-MFST-CRTN-CNT     29750012
297600                   GIVING PV-DIVIDEND ROUNDED                     29760000
297700               MULTIPLY PV-DIVIDEND BY 100                        29770000
297800                   GIVING PV-AUD-CRTN-ERR-PRCT                    29780000
297900                                                                  29790000
298000               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             29800000
298100                   GIVING PV-AUDIT-ERROR-PRCT                     29810000
298200                                                                  29820000
298300               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           29830000
298400                   MOVE PC-0  TO HL10-TOT-ACC-RATE                29840000
298500               ELSE                                               29850000
298600                   MOVE PV-AUDIT-ERROR-PRCT                       29860000
298700                              TO HL10-TOT-ACC-RATE                29870000
298800               END-IF                                             29880000
298900           ELSE                                                   29890000
299000               MOVE PC-100 TO HL10-TOT-ACC-RATE                   29900000
299100           END-IF                                                 29910000
299200                                                                  29920000
299300*WHEN SPOT CHECK AUDIT TYPE                                       29930000
299400        WHEN SUNAUD-AUD-TYP-CDE = '02'                            29940000
299500           IF PV-AUD-CRTN-CNT > ZERO                              29950000
299600               DIVIDE PV-AUD-CRTN-ERR-CNT BY PV-AUD-CRTN-CNT      29960000
299700                   GIVING PV-DIVIDEND ROUNDED                     29970000
299800               MULTIPLY PV-DIVIDEND BY 100                        29980000
299900                   GIVING PV-AUD-CRTN-ERR-PRCT                    29990000
300000                                                                  30000000
300100               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             30010000
300200                   GIVING PV-AUDIT-ERROR-PRCT                     30020000
300300                                                                  30030000
300400               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           30040000
300500                   MOVE PC-0  TO HL10-TOT-ACC-RATE                30050000
300600               ELSE                                               30060000
300700                   MOVE PV-AUDIT-ERROR-PRCT                       30070000
300800                              TO HL10-TOT-ACC-RATE                30080000
300900               END-IF                                             30090000
301000           ELSE                                                   30100000
301100               MOVE PC-100 TO HL10-TOT-ACC-RATE                   30110000
301200           END-IF                                                 30120000
301300     END-EVALUATE.                                                30130000
301400                                                                  30140000
301500     WRITE REPORT-RECORD                                          30150000
301600       FROM HEADING-LINE10                                        30160000
301700         AFTER ADVANCING 1 LINE.                                  30170000
301800                                                                  30180000
301900     WRITE REPORT-RECORD                                          30190000
302000       FROM PC-BLANK-LINE                                         30200000
302100         AFTER ADVANCING 1 LINE.                                  30210000
302200                                                                  30220000
302300     WRITE REPORT-RECORD                                          30230000
302400       FROM HEADING-LINE11                                        30240000
302500         AFTER ADVANCING 1 LINE.                                  30250000
302600                                                                  30260000
302700     WRITE REPORT-RECORD                                          30270000
302800       FROM PC-BLANK-LINE                                         30280000
302900         AFTER ADVANCING 1 LINE.                                  30290000
303000                                                                  30300000
303100     MOVE SPACES TO REPORT-RECORD.                                30310000
303200     WRITE REPORT-RECORD                                          30320000
303300         AFTER ADVANCING 1 LINE.                                  30330000
303400                                                                  30340000
303500     ADD +18             TO PV-LINE-COUNT.                        30350000
303600                                                                  30360000
303700                                                                  30370000
303800 8100-WRITE-SUB-HEADINGS.                                         30380000
303900*CARTON ERRORS                                                    30390000
304000     WRITE REPORT-RECORD FROM SUB-HEADING-LINEI.                  30400000
304100                                                                  30410000
304200     WRITE REPORT-RECORD                                          30420000
304300       FROM PC-BLANK-LINE                                         30430000
304400         AFTER ADVANCING 1 LINE.                                  30440000
304500                                                                  30450000
304600     WRITE REPORT-RECORD FROM SUB-HEADING-LINEA                   30460000
304700         AFTER ADVANCING 1 LINE.                                  30470000
304800                                                                  30480000
304900     WRITE REPORT-RECORD FROM SUB-HEADING-LINEB.                  30490000
305000                                                                  30500000
305100     WRITE REPORT-RECORD FROM SUB-HEADING-LINEC.                  30510000
305200                                                                  30520000
305300     ADD +6              TO PV-LINE-COUNT.                        30530000
305400                                                                  30540000
305500                                                                  30550000
305600 8200-WRITE-SUB-DETAILS.                                          30560000
305700     MOVE PC046-CARTON-ID TO DK-SHIPT-UNT-ID                      30570000
305800                                                                  30580000
305900*CARTON AUDIT - MISLOADS:                                         30590000
306000       IF SU019-MISLOADED-CRTN = 'Y'                              30600000
306100          ADD PC-1 TO PV-MISLOAD-COUNT                            30610000
306200          IF PS-SUBHEAD1-WRITTEN                                  30620000
306300             CONTINUE                                             30630000
306400          ELSE                                                    30640000
306500             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              30650000
306600                PERFORM 8000-PRINT-REPORT-HEADINGS                30660000
306700                PERFORM 8100-WRITE-SUB-HEADINGS                   30670000
306800             ELSE                                                 30680000
306900                CONTINUE                                          30690000
307000             END-IF                                               30700000
307100                                                                  30710000
307200             ADD +1              TO PV-LINE-COUNT                 30720000
307300             WRITE REPORT-RECORD                                  30730000
307400               FROM PC-BLANK-LINE                                 30740000
307500                 AFTER ADVANCING 1 LINE                           30750000
307600                                                                  30760000
307700             ADD +1              TO PV-LINE-COUNT                 30770000
307800             WRITE REPORT-RECORD FROM SUB-HEADING-LINE1           30780000
307900             SET PS-SUBHEAD1-WRITTEN TO TRUE                      30790000
308000          END-IF                                                  30800000
308100                                                                  30810000
308200          PERFORM 3000-PRINT-REPORT-DETAIL                        30820000
308300          MOVE PV-SHIPT-UNT-ID        TO DL1-SHIPT-UNT-ID         30830000
308400          MOVE PV-CRTN-STATUS         TO DL1-CRTN-STATUS          30840000
308500                                                                  30850000
308600          IF PV-MFST-TIMESTAMP > SPACES                           30860000
308700             MOVE PV-MFST-TMST-CC        TO DL1-CC                30870000
308800             MOVE PV-MFST-TMST-YY        TO DL1-YY                30880000
308900             MOVE PV-DASH1               TO DL1-DASH1             30890000
309000             MOVE PV-MFST-TMST-MM        TO DL1-MM                30900000
309100             MOVE PV-DASH2               TO DL1-DASH2             30910000
309200             MOVE PV-MFST-TMST-DD        TO DL1-DD                30920000
309300             MOVE PV-MFST-TMST-HH        TO DL1-HH                30930000
309400             MOVE PV-COLON               TO DL1-COLON             30940000
309500             MOVE PV-MFST-TMST-MI        TO DL1-MI                30950000
309600          ELSE                                                    30960000
309700             MOVE SPACES                 TO DL1-CC                30970000
309800             MOVE SPACES                 TO DL1-YY                30980000
309900             MOVE SPACES                 TO DL1-DASH1             30990000
310000             MOVE SPACES                 TO DL1-MM                31000000
310100             MOVE SPACES                 TO DL1-DASH2             31010000
310200             MOVE SPACES                 TO DL1-DD                31020000
310300             MOVE SPACES                 TO DL1-HH                31030000
310400             MOVE SPACES                 TO DL1-COLON             31040000
310500             MOVE SPACES                 TO DL1-MI                31050000
310600          END-IF                                                  31060000
310700          MOVE PV-STATUS-USERID       TO DL1-STATUS-USERID        31070000
310800          MOVE PV-SHPUNT-SRC-ID       TO DL1-SHPUNT-SRC-ID        31080000
310900                                                                  31090000
311000          MOVE PV-PO-NBR              TO DL1-PO-NBR               31100000
311100          MOVE PV-RCVR                TO DL1-RCVR                 31110000
311200          IF PV-PO-NBR = SPACES AND                               31120000
311300             PV-RCVR   = SPACES                                   31130000
311400             MOVE SPACES   TO DL1-PO-DASH                         31140000
311500          ELSE                                                    31150000
311600             MOVE PV-DASH1 TO DL1-PO-DASH                         31160000
311700          END-IF                                                  31170000
311800                                                                  31180000
311900          IF PV-OTBD-TRIP-ID          > ZEROES                    31190000
312000             MOVE PV-OTBD-TRIP-ID        TO DL1-OTBD-TRIP-ID      31200000
312100          ELSE                                                    31210000
312200             MOVE SPACES                 TO DL1-OTBD-TRIP-ID      31220000
312300          END-IF                                                  31230000
312400                                                                  31240000
312500          MOVE PV-DEST-OPER-UNT-ID    TO DL1-DEST-OPER-UNT-ID     31250000
312600          MOVE PV-TRIP-STATUS         TO DL1-TRIP-STATUS          31260000
312700                                                                  31270000
312800          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-1               31280000
312900          ADD +1              TO PV-LINE-COUNT                    31290000
313000          INITIALIZE DL-DETAIL-LINE-1                             31300000
313100       END-IF                                                     31310000
313200                                                                  31320000
313300*CARTON AUDIT - NOT MFST TO TRLR:                                 31330000
313400       IF SU019-CRTN-NOT-MFST-TO-TRLR = 'Y'                       31340000
313500          ADD PC-1 TO PV-NOT-MFST-COUNT                           31350000
313600          IF PS-SUBHEAD2-WRITTEN                                  31360000
313700             CONTINUE                                             31370000
313800          ELSE                                                    31380000
313900             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              31390000
314000                PERFORM 8000-PRINT-REPORT-HEADINGS                31400000
314100                PERFORM 8100-WRITE-SUB-HEADINGS                   31410000
314200             ELSE                                                 31420000
314300                CONTINUE                                          31430000
314400             END-IF                                               31440000
314500                                                                  31450000
314600             ADD +1              TO PV-LINE-COUNT                 31460000
314700             WRITE REPORT-RECORD                                  31470000
314800               FROM PC-BLANK-LINE                                 31480000
314900                 AFTER ADVANCING 1 LINE                           31490000
315000             ADD +1              TO PV-LINE-COUNT                 31500000
315100             WRITE REPORT-RECORD FROM SUB-HEADING-LINE2           31510000
315200             SET PS-SUBHEAD2-WRITTEN TO TRUE                      31520000
315300          END-IF                                                  31530000
315400                                                                  31540000
315500          PERFORM 3000-PRINT-REPORT-DETAIL                        31550000
315600          MOVE PV-SHIPT-UNT-ID        TO DL2-SHIPT-UNT-ID         31560000
315700          MOVE PV-CRTN-STATUS         TO DL2-CRTN-STATUS          31570000
315800                                                                  31580000
315900          IF PV-MFST-TIMESTAMP > SPACES                           31590000
316000             MOVE PV-MFST-TMST-CC        TO DL2-CC                31600000
316100             MOVE PV-MFST-TMST-YY        TO DL2-YY                31610000
316200             MOVE PV-DASH1               TO DL2-DASH1             31620000
316300             MOVE PV-MFST-TMST-MM        TO DL2-MM                31630000
316400             MOVE PV-DASH2               TO DL2-DASH2             31640000
316500             MOVE PV-MFST-TMST-DD        TO DL2-DD                31650000
316600             MOVE PV-MFST-TMST-HH        TO DL2-HH                31660000
316700             MOVE PV-COLON               TO DL2-COLON             31670000
316800             MOVE PV-MFST-TMST-MI        TO DL2-MI                31680000
316900          ELSE                                                    31690000
317000             MOVE SPACES                 TO DL2-CC                31700000
317100             MOVE SPACES                 TO DL2-YY                31710000
317200             MOVE SPACES                 TO DL2-DASH1             31720000
317300             MOVE SPACES                 TO DL2-MM                31730000
317400             MOVE SPACES                 TO DL2-DASH2             31740000
317500             MOVE SPACES                 TO DL2-DD                31750000
317600             MOVE SPACES                 TO DL2-HH                31760000
317700             MOVE SPACES                 TO DL2-COLON             31770000
317800             MOVE SPACES                 TO DL2-MI                31780000
317900          END-IF                                                  31790000
318000          MOVE PV-STATUS-USERID       TO DL2-STATUS-USERID        31800000
318100          MOVE PV-SHPUNT-SRC-ID       TO DL2-SHPUNT-SRC-ID        31810000
318200                                                                  31820000
318300          MOVE PV-PO-NBR              TO DL2-PO-NBR               31830000
318400          MOVE PV-RCVR                TO DL2-RCVR                 31840000
318500          IF PV-PO-NBR = SPACES AND                               31850000
318600             PV-RCVR   = SPACES                                   31860000
318700             MOVE SPACES   TO DL2-PO-DASH                         31870000
318800          ELSE                                                    31880000
318900             MOVE PV-DASH1 TO DL2-PO-DASH                         31890000
319000          END-IF                                                  31900000
319100                                                                  31910000
319200          IF PV-OTBD-TRIP-ID          > ZEROES                    31920000
319300             MOVE PV-OTBD-TRIP-ID        TO DL2-OTBD-TRIP-ID      31930000
319400          ELSE                                                    31940000
319500             MOVE SPACES                 TO DL2-OTBD-TRIP-ID      31950000
319600          END-IF                                                  31960000
319700                                                                  31970000
319800          MOVE PV-DEST-OPER-UNT-ID    TO DL2-DEST-OPER-UNT-ID     31980000
319900          MOVE PV-TRIP-STATUS         TO DL2-TRIP-STATUS          31990000
320000                                                                  32000000
320100          ADD +1                         TO PV-LINE-COUNT         32010000
320200          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-2               32020000
320300          INITIALIZE DL-DETAIL-LINE-2                             32030000
320400       END-IF                                                     32040000
320500                                                                  32050000
320600*CARTON AUDIT - CARTON CONTENTS UNKNOWN:                          32060000
320610*                                                                 32061009
320700       IF SU019-CRTN-CONTENT-UNKNOWN = 'Y'                        32070011
320800          ADD PC-1 TO PV-CONTENTS-UNKNOWN-COUNT                   32080011
320900          IF PS-SUBHEAD3-WRITTEN                                  32090011
321000             CONTINUE                                             32100011
321100          ELSE                                                    32110011
321200             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              32120011
321300                PERFORM 8000-PRINT-REPORT-HEADINGS                32130011
321400                PERFORM 8100-WRITE-SUB-HEADINGS                   32140011
321500             ELSE                                                 32150011
321600                CONTINUE                                          32160011
321700             END-IF                                               32170011
321800                                                                  32180011
321900             ADD +1              TO PV-LINE-COUNT                 32190011
322000             WRITE REPORT-RECORD                                  32200011
322100               FROM PC-BLANK-LINE                                 32210011
322200                 AFTER ADVANCING 1 LINE                           32220011
322300                                                                  32230011
322400             ADD +1              TO PV-LINE-COUNT                 32240011
322500             WRITE REPORT-RECORD FROM SUB-HEADING-LINE3           32250011
322600             SET PS-SUBHEAD3-WRITTEN TO TRUE                      32260011
322700          END-IF                                                  32270011
322800                                                                  32280011
322900          PERFORM 3000-PRINT-REPORT-DETAIL                        32290011
323000          MOVE PV-SHIPT-UNT-ID        TO DL3-SHIPT-UNT-ID         32300011
323100          MOVE PV-CRTN-STATUS         TO DL3-CRTN-STATUS          32310011
323200                                                                  32320011
323300          IF PV-MFST-TIMESTAMP > SPACES                           32330011
323400             MOVE PV-MFST-TMST-CC        TO DL3-CC                32340011
323500             MOVE PV-MFST-TMST-YY        TO DL3-YY                32350011
323600             MOVE PV-DASH1               TO DL3-DASH1             32360011
323700             MOVE PV-MFST-TMST-MM        TO DL3-MM                32370011
323800             MOVE PV-DASH2               TO DL3-DASH2             32380011
323900             MOVE PV-MFST-TMST-DD        TO DL3-DD                32390011
324000             MOVE PV-MFST-TMST-HH        TO DL3-HH                32400011
324100             MOVE PV-COLON               TO DL3-COLON             32410011
324200             MOVE PV-MFST-TMST-MI        TO DL3-MI                32420011
324300          ELSE                                                    32430011
324400             MOVE SPACES                 TO DL3-CC                32440011
324500             MOVE SPACES                 TO DL3-YY                32450011
324600             MOVE SPACES                 TO DL3-DASH1             32460011
324700             MOVE SPACES                 TO DL3-MM                32470011
324800             MOVE SPACES                 TO DL3-DASH2             32480011
324900             MOVE SPACES                 TO DL3-DD                32490011
325000             MOVE SPACES                 TO DL3-HH                32500011
325100             MOVE SPACES                 TO DL3-COLON             32510011
325200             MOVE SPACES                 TO DL3-MI                32520011
325300          END-IF                                                  32530011
325400          MOVE PV-STATUS-USERID       TO DL3-STATUS-USERID        32540011
325500          MOVE PV-SHPUNT-SRC-ID       TO DL3-SHPUNT-SRC-ID        32550011
325600                                                                  32560011
325700          MOVE PV-PO-NBR              TO DL3-PO-NBR               32570011
325800          MOVE PV-RCVR                TO DL3-RCVR                 32580011
325900          IF PV-PO-NBR = SPACES AND                               32590011
326000             PV-RCVR   = SPACES                                   32600011
326100             MOVE SPACES   TO DL3-PO-DASH                         32610011
326200          ELSE                                                    32620011
326300             MOVE PV-DASH1 TO DL3-PO-DASH                         32630011
326400          END-IF                                                  32640011
326500                                                                  32650011
326600          IF PV-OTBD-TRIP-ID          > ZEROES                    32660011
326700             MOVE PV-OTBD-TRIP-ID        TO DL3-OTBD-TRIP-ID      32670011
326800          ELSE                                                    32680011
326900             MOVE SPACES                 TO DL3-OTBD-TRIP-ID      32690011
327000          END-IF                                                  32700011
327100                                                                  32710011
327200          MOVE PV-DEST-OPER-UNT-ID    TO DL3-DEST-OPER-UNT-ID     32720011
327300          MOVE PV-TRIP-STATUS         TO DL3-TRIP-STATUS          32730011
327400                                                                  32740011
327500          ADD +1                         TO PV-LINE-COUNT         32750011
327600          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-3               32760011
327700          INITIALIZE DL-DETAIL-LINE-3                             32770011
327800       END-IF                                                     32780011
327900                                                                  32790000
328000*CARTON AUDIT - DUPLICATE SCAN:                                   32800000
328100       IF SU019-DUPLICATE-SCAN = 'Y'                              32810000
328110          IF  PS-FIRST-DUPLICATE                                  32811017
328120              PERFORM 2700-COUNT-DUPLICATE-SCAN                   32812017
328130              SET PS-NOT-FIRST-DUPLICATE TO TRUE                  32813017
328140          END-IF                                                  32814017
328200*         ADD PC-1 TO PV-DUPLICATE-SCAN-COUNT                     32820017
328300          IF PS-SUBHEAD4-WRITTEN                                  32830000
328400             CONTINUE                                             32840000
328500          ELSE                                                    32850000
328600             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              32860000
328700                PERFORM 8000-PRINT-REPORT-HEADINGS                32870000
328800                PERFORM 8100-WRITE-SUB-HEADINGS                   32880000
328900             ELSE                                                 32890000
329000                CONTINUE                                          32900000
329100             END-IF                                               32910000
329200                                                                  32920000
329300             ADD +1              TO PV-LINE-COUNT                 32930000
329400             WRITE REPORT-RECORD                                  32940000
329500               FROM PC-BLANK-LINE                                 32950000
329600                 AFTER ADVANCING 1 LINE                           32960000
329700                                                                  32970000
329800             ADD +1              TO PV-LINE-COUNT                 32980000
329900             WRITE REPORT-RECORD FROM SUB-HEADING-LINE4           32990000
330000             SET PS-SUBHEAD4-WRITTEN TO TRUE                      33000000
330100          END-IF                                                  33010000
330200                                                                  33020000
330300          PERFORM 3000-PRINT-REPORT-DETAIL                        33030000
330400          MOVE PV-SHIPT-UNT-ID        TO DL4-SHIPT-UNT-ID         33040000
330500          MOVE PV-CRTN-STATUS         TO DL4-CRTN-STATUS          33050000
330600                                                                  33060000
330700          IF PV-MFST-TIMESTAMP > SPACES                           33070000
330800             MOVE PV-MFST-TMST-CC        TO DL4-CC                33080000
330900             MOVE PV-MFST-TMST-YY        TO DL4-YY                33090000
331000             MOVE PV-DASH1               TO DL4-DASH1             33100000
331100             MOVE PV-MFST-TMST-MM        TO DL4-MM                33110000
331200             MOVE PV-DASH2               TO DL4-DASH2             33120000
331300             MOVE PV-MFST-TMST-DD        TO DL4-DD                33130000
331400             MOVE PV-MFST-TMST-HH        TO DL4-HH                33140000
331500             MOVE PV-COLON               TO DL4-COLON             33150000
331600             MOVE PV-MFST-TMST-MI        TO DL4-MI                33160000
331700          ELSE                                                    33170000
331800             MOVE SPACES                 TO DL4-CC                33180000
331900             MOVE SPACES                 TO DL4-YY                33190000
332000             MOVE SPACES                 TO DL4-DASH1             33200000
332100             MOVE SPACES                 TO DL4-MM                33210000
332200             MOVE SPACES                 TO DL4-DASH2             33220000
332300             MOVE SPACES                 TO DL4-DD                33230000
332400             MOVE SPACES                 TO DL4-HH                33240000
332500             MOVE SPACES                 TO DL4-COLON             33250000
332600             MOVE SPACES                 TO DL4-MI                33260000
332700          END-IF                                                  33270000
332800          MOVE PV-STATUS-USERID       TO DL4-STATUS-USERID        33280000
332900          MOVE PV-SHPUNT-SRC-ID       TO DL4-SHPUNT-SRC-ID        33290000
333000                                                                  33300000
333100          MOVE PV-PO-NBR              TO DL4-PO-NBR               33310000
333200          MOVE PV-RCVR                TO DL4-RCVR                 33320000
333300          IF PV-PO-NBR = SPACES AND                               33330000
333400             PV-RCVR   = SPACES                                   33340000
333500             MOVE SPACES   TO DL4-PO-DASH                         33350000
333600          ELSE                                                    33360000
333700             MOVE PV-DASH1 TO DL4-PO-DASH                         33370000
333800          END-IF                                                  33380000
333900                                                                  33390000
334000          IF PV-OTBD-TRIP-ID          > ZEROES                    33400000
334100             MOVE PV-OTBD-TRIP-ID        TO DL4-OTBD-TRIP-ID      33410000
334200          ELSE                                                    33420000
334300             MOVE SPACES                 TO DL4-OTBD-TRIP-ID      33430000
334400          END-IF                                                  33440000
334500                                                                  33450000
334600          MOVE PV-DEST-OPER-UNT-ID    TO DL4-DEST-OPER-UNT-ID     33460000
334700          MOVE PV-TRIP-STATUS         TO DL4-TRIP-STATUS          33470000
334800                                                                  33480000
334900          ADD +1                         TO PV-LINE-COUNT         33490000
335000          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-4               33500000
335100          INITIALIZE DL-DETAIL-LINE-4                             33510000
335110                                                                  33511019
335120          MOVE SU019-SCN-TMST TO PV-SCAN-TIMESTAMP                33512019
335130          MOVE PV-SCAN-TMST-CC   TO DL4A-CC                       33513019
335140          MOVE PV-SCAN-TMST-YY   TO DL4A-YY                       33514019
335150          MOVE '-'               TO DL4A-DASH1                    33515019
335160          MOVE PV-SCAN-TMST-MM   TO DL4A-MM                       33516019
335170          MOVE '-'               TO DL4A-DASH2                    33517019
335180          MOVE PV-SCAN-TMST-DD   TO DL4A-DD                       33518019
335191          MOVE PV-SCAN-TMST-HH   TO DL4A-HH                       33519119
335192          MOVE ':'               TO DL4A-COLON1                   33519219
335193          MOVE PV-SCAN-TMST-MI   TO DL4A-MI                       33519322
335194          MOVE ':'               TO DL4A-COLON2                   33519419
335195          MOVE PV-SCAN-TMST-SS   TO DL4A-SS                       33519519
335196          MOVE SU019-AUD-USR-ID  TO DL4A-SCAN-USERID              33519619
335197          MOVE SU019-DUP-PREV-SCN-TMST TO PV-SCAN-TIMESTAMP       33519719
335198          MOVE PV-SCAN-TMST-CC   TO DL4A-PRIOR-CC                 33519819
335199          MOVE PV-SCAN-TMST-YY   TO DL4A-PRIOR-YY                 33519919
335200          MOVE '-'               TO DL4A-PRIOR-DASH1              33520019
335201          MOVE PV-SCAN-TMST-MM   TO DL4A-PRIOR-MM                 33520119
335202          MOVE '-'               TO DL4A-PRIOR-DASH2              33520219
335203          MOVE PV-SCAN-TMST-DD   TO DL4A-PRIOR-DD                 33520319
335204          MOVE PV-SCAN-TMST-HH   TO DL4A-PRIOR-HH                 33520419
335205          MOVE ':'               TO DL4A-PRIOR-COLON1             33520519
335206          MOVE PV-SCAN-TMST-MI   TO DL4A-PRIOR-MI                 33520622
335207          MOVE ':'               TO DL4A-PRIOR-COLON2             33520719
335208          MOVE PV-SCAN-TMST-SS   TO DL4A-PRIOR-SS                 33520819
335209          MOVE SU019-DUP-PREV-AUD-USR-ID TO                       33520919
335210               DL4A-PRIOR-SCAN-USER-ID                            33521019
335211          ADD +1                         TO PV-LINE-COUNT         33521119
335212          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-4A              33521219
335213          INITIALIZE DL-DETAIL-LINE-4A                            33521319
335220       END-IF                                                     33522000
335300                                                                  33530000
335400*CARTON AUDIT - CARTONS INACTIVE:                                 33540000
335500       IF SU019-CRTN-INACTIVE = 'Y'                               33550000
335600          ADD PC-1 TO PV-INACTIVE-COUNT                           33560000
335700          IF PS-SUBHEAD5-WRITTEN                                  33570000
335800             CONTINUE                                             33580000
335900          ELSE                                                    33590000
336000             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              33600000
336100                PERFORM 8000-PRINT-REPORT-HEADINGS                33610000
336200                PERFORM 8100-WRITE-SUB-HEADINGS                   33620000
336300             ELSE                                                 33630000
336400                CONTINUE                                          33640000
336500             END-IF                                               33650000
336600                                                                  33660000
336700             ADD +1              TO PV-LINE-COUNT                 33670000
336800             WRITE REPORT-RECORD                                  33680000
336900               FROM PC-BLANK-LINE                                 33690000
337000                 AFTER ADVANCING 1 LINE                           33700000
337100                                                                  33710000
337200             ADD +1              TO PV-LINE-COUNT                 33720000
337300             WRITE REPORT-RECORD FROM SUB-HEADING-LINE5           33730000
337400             SET PS-SUBHEAD5-WRITTEN TO TRUE                      33740000
337500          END-IF                                                  33750000
337600                                                                  33760000
337700          PERFORM 3000-PRINT-REPORT-DETAIL                        33770000
337800          MOVE PV-SHIPT-UNT-ID        TO DL5-SHIPT-UNT-ID         33780000
337900          MOVE PV-CRTN-STATUS         TO DL5-CRTN-STATUS          33790000
338000                                                                  33800000
338100          IF PV-MFST-TIMESTAMP > SPACES                           33810000
338200             MOVE PV-MFST-TMST-CC        TO DL5-CC                33820000
338300             MOVE PV-MFST-TMST-YY        TO DL5-YY                33830000
338400             MOVE PV-DASH1               TO DL5-DASH1             33840000
338500             MOVE PV-MFST-TMST-MM        TO DL5-MM                33850000
338600             MOVE PV-DASH2               TO DL5-DASH2             33860000
338700             MOVE PV-MFST-TMST-DD        TO DL5-DD                33870000
338800             MOVE PV-MFST-TMST-HH        TO DL5-HH                33880000
338900             MOVE PV-COLON               TO DL5-COLON             33890000
339000             MOVE PV-MFST-TMST-MI        TO DL5-MI                33900000
339100          ELSE                                                    33910000
339200             MOVE SPACES                 TO DL5-CC                33920000
339300             MOVE SPACES                 TO DL5-YY                33930000
339400             MOVE SPACES                 TO DL5-DASH1             33940000
339500             MOVE SPACES                 TO DL5-MM                33950000
339600             MOVE SPACES                 TO DL5-DASH2             33960000
339700             MOVE SPACES                 TO DL5-DD                33970000
339800             MOVE SPACES                 TO DL5-HH                33980000
339900             MOVE SPACES                 TO DL5-COLON             33990000
340000             MOVE SPACES                 TO DL5-MI                34000000
340100          END-IF                                                  34010000
340200                                                                  34020000
340300          MOVE PV-STATUS-USERID       TO DL5-STATUS-USERID        34030000
340400          MOVE PV-SHPUNT-SRC-ID       TO DL5-SHPUNT-SRC-ID        34040000
340500                                                                  34050000
340600          MOVE PV-PO-NBR              TO DL5-PO-NBR               34060000
340700          MOVE PV-RCVR                TO DL5-RCVR                 34070000
340800          IF PV-PO-NBR = SPACES AND                               34080000
340900             PV-RCVR   = SPACES                                   34090000
341000             MOVE SPACES   TO DL5-PO-DASH                         34100000
341100          ELSE                                                    34110000
341200             MOVE PV-DASH1 TO DL5-PO-DASH                         34120000
341300          END-IF                                                  34130000
341400                                                                  34140000
341500          IF PV-OTBD-TRIP-ID          > ZEROES                    34150000
341600             MOVE PV-OTBD-TRIP-ID        TO DL5-OTBD-TRIP-ID      34160000
341700          ELSE                                                    34170000
341800             MOVE SPACES                 TO DL5-OTBD-TRIP-ID      34180000
341900          END-IF                                                  34190000
342000                                                                  34200000
342100          MOVE PV-DEST-OPER-UNT-ID    TO DL5-DEST-OPER-UNT-ID     34210000
342200          MOVE PV-TRIP-STATUS         TO DL5-TRIP-STATUS          34220000
342300                                                                  34230000
342400          ADD +1                         TO PV-LINE-COUNT         34240000
342500          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-5               34250000
342600          INITIALIZE DL-DETAIL-LINE-5                             34260000
342700       END-IF                                                     34270000
342800                                                                  34280000
342900*CARTON AUDIT - CARTONS NOT FOUND IN SYSTEM:                      34290000
343000       IF SU019-CRTN-NOT-FOUND = 'Y'                              34300000
343100          ADD PC-1 TO PV-NOT-FOUND-COUNT                          34310000
343200                                                                  34320000
343300          IF PS-SUBHEAD6-WRITTEN                                  34330000
343400             CONTINUE                                             34340000
343500          ELSE                                                    34350000
343600             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              34360000
343700                PERFORM 8000-PRINT-REPORT-HEADINGS                34370000
343800                PERFORM 8100-WRITE-SUB-HEADINGS                   34380000
343900             ELSE                                                 34390000
344000                CONTINUE                                          34400000
344100             END-IF                                               34410000
344200                                                                  34420000
344300             ADD +1              TO PV-LINE-COUNT                 34430000
344400             WRITE REPORT-RECORD                                  34440000
344500               FROM PC-BLANK-LINE                                 34450000
344600                 AFTER ADVANCING 1 LINE                           34460000
344700                                                                  34470000
344800             ADD +1              TO PV-LINE-COUNT                 34480000
344900             WRITE REPORT-RECORD FROM SUB-HEADING-LINE6           34490000
345000             SET PS-SUBHEAD6-WRITTEN TO TRUE                      34500000
345100          END-IF                                                  34510000
345200                                                                  34520000
345300          PERFORM 3000-PRINT-REPORT-DETAIL                        34530000
345400          MOVE PV-SHIPT-UNT-ID        TO DL6-SHIPT-UNT-ID         34540000
345500          MOVE PV-CRTN-STATUS         TO DL6-CRTN-STATUS          34550000
345600                                                                  34560000
345700          IF PV-MFST-TIMESTAMP > SPACES                           34570000
345800             MOVE PV-MFST-TMST-CC        TO DL6-CC                34580000
345900             MOVE PV-MFST-TMST-YY        TO DL6-YY                34590000
346000             MOVE PV-DASH1               TO DL6-DASH1             34600000
346100             MOVE PV-MFST-TMST-MM        TO DL6-MM                34610000
346200             MOVE PV-DASH2               TO DL6-DASH2             34620000
346300             MOVE PV-MFST-TMST-DD        TO DL6-DD                34630000
346400             MOVE PV-MFST-TMST-HH        TO DL6-HH                34640000
346500             MOVE PV-COLON               TO DL6-COLON             34650000
346600             MOVE PV-MFST-TMST-MI        TO DL6-MI                34660000
346700          ELSE                                                    34670000
346800             MOVE SPACES                 TO DL6-CC                34680000
346900             MOVE SPACES                 TO DL6-YY                34690000
347000             MOVE SPACES                 TO DL6-DASH1             34700000
347100             MOVE SPACES                 TO DL6-MM                34710000
347200             MOVE SPACES                 TO DL6-DASH2             34720000
347300             MOVE SPACES                 TO DL6-DD                34730000
347400             MOVE SPACES                 TO DL6-HH                34740000
347500             MOVE SPACES                 TO DL6-COLON             34750000
347600             MOVE SPACES                 TO DL6-MI                34760000
347700          END-IF                                                  34770000
347800          MOVE PV-STATUS-USERID       TO DL6-STATUS-USERID        34780000
347900          MOVE PV-SHPUNT-SRC-ID       TO DL6-SHPUNT-SRC-ID        34790000
348000                                                                  34800000
348100          MOVE PV-PO-NBR              TO DL6-PO-NBR               34810000
348200          MOVE PV-RCVR                TO DL6-RCVR                 34820000
348300          IF PV-PO-NBR = SPACES AND                               34830000
348400             PV-RCVR   = SPACES                                   34840000
348500             MOVE SPACES   TO DL6-PO-DASH                         34850000
348600          ELSE                                                    34860000
348700             MOVE PV-DASH1 TO DL6-PO-DASH                         34870000
348800          END-IF                                                  34880000
348900                                                                  34890000
349000          IF PV-OTBD-TRIP-ID          > ZEROES                    34900000
349100             MOVE PV-OTBD-TRIP-ID        TO DL6-OTBD-TRIP-ID      34910000
349200          ELSE                                                    34920000
349300             MOVE SPACES                 TO DL6-OTBD-TRIP-ID      34930000
349400          END-IF                                                  34940000
349500                                                                  34950000
349600          MOVE PV-DEST-OPER-UNT-ID    TO DL6-DEST-OPER-UNT-ID     34960000
349700          MOVE PV-TRIP-STATUS         TO DL6-TRIP-STATUS          34970000
349800                                                                  34980000
349900          ADD +1                         TO PV-LINE-COUNT         34990000
350000          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-6               35000000
350100          INITIALIZE DL-DETAIL-LINE-6                             35010000
350200       END-IF                                                     35020000
350300                                                                  35030000
350400*MANIFESTED - TO TRLR BUT NOT AUDITED:                            35040000
350500       IF SU019-MFST-NOT-AUDITED = 'Y'                            35050000
350600          IF SUNAUD-AUD-TYP-CDE = '01'                            35060000
350700             ADD PC-1 TO PV-MFST-NOT-AUD-COUNT                    35070000
350800             IF PS-SUBHEAD7-WRITTEN                               35080000
350900                CONTINUE                                          35090000
351000             ELSE                                                 35100000
351100                IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES           35110000
351200                   PERFORM 8000-PRINT-REPORT-HEADINGS             35120000
351300                   PERFORM 8100-WRITE-SUB-HEADINGS                35130000
351400                ELSE                                              35140000
351500                   CONTINUE                                       35150000
351600                END-IF                                            35160000
351700                                                                  35170000
351800                ADD +1              TO PV-LINE-COUNT              35180000
351900                WRITE REPORT-RECORD                               35190000
352000                  FROM PC-BLANK-LINE                              35200000
352100                    AFTER ADVANCING 1 LINE                        35210000
352200                                                                  35220000
352300                ADD +1              TO PV-LINE-COUNT              35230000
352400                WRITE REPORT-RECORD FROM SUB-HEADING-LINE7        35240000
352500                SET PS-SUBHEAD7-WRITTEN TO TRUE                   35250000
352600             END-IF                                               35260000
352700                                                                  35270000
352800             PERFORM 3000-PRINT-REPORT-DETAIL                     35280000
352900             MOVE PV-SHIPT-UNT-ID        TO DL7-SHIPT-UNT-ID      35290000
353000             MOVE PV-CRTN-STATUS         TO DL7-CRTN-STATUS       35300000
353100                                                                  35310000
353200          IF PV-MFST-TIMESTAMP > SPACES                           35320000
353300             MOVE PV-MFST-TMST-CC        TO DL7-CC                35330000
353400             MOVE PV-MFST-TMST-YY        TO DL7-YY                35340000
353500             MOVE PV-DASH1               TO DL7-DASH1             35350000
353600             MOVE PV-MFST-TMST-MM        TO DL7-MM                35360000
353700             MOVE PV-DASH2               TO DL7-DASH2             35370000
353800             MOVE PV-MFST-TMST-DD        TO DL7-DD                35380000
353900             MOVE PV-MFST-TMST-HH        TO DL7-HH                35390000
354000             MOVE PV-COLON               TO DL7-COLON             35400000
354100             MOVE PV-MFST-TMST-MI        TO DL7-MI                35410000
354200          ELSE                                                    35420000
354300             MOVE SPACES                 TO DL7-CC                35430000
354400             MOVE SPACES                 TO DL7-YY                35440000
354500             MOVE SPACES                 TO DL7-DASH1             35450000
354600             MOVE SPACES                 TO DL7-MM                35460000
354700             MOVE SPACES                 TO DL7-DASH2             35470000
354800             MOVE SPACES                 TO DL7-DD                35480000
354900             MOVE SPACES                 TO DL7-HH                35490000
355000             MOVE SPACES                 TO DL7-COLON             35500000
355100             MOVE SPACES                 TO DL7-MI                35510000
355200          END-IF                                                  35520000
355300             MOVE PV-STATUS-USERID       TO DL7-STATUS-USERID     35530000
355400             MOVE PV-SHPUNT-SRC-ID       TO DL7-SHPUNT-SRC-ID     35540000
355500                                                                  35550000
355600             MOVE PV-PO-NBR              TO DL7-PO-NBR            35560000
355700             MOVE PV-RCVR                TO DL7-RCVR              35570000
355800             IF PV-PO-NBR = SPACES AND                            35580000
355900                PV-RCVR   = SPACES                                35590000
356000                MOVE SPACES   TO DL7-PO-DASH                      35600000
356100             ELSE                                                 35610000
356200                MOVE PV-DASH1 TO DL7-PO-DASH                      35620000
356300             END-IF                                               35630000
356400                                                                  35640000
356500             IF PV-OTBD-TRIP-ID          > ZEROES                 35650000
356600                MOVE PV-OTBD-TRIP-ID        TO DL7-OTBD-TRIP-ID   35660000
356700             ELSE                                                 35670000
356800                MOVE SPACES                 TO DL7-OTBD-TRIP-ID   35680000
356900             END-IF                                               35690000
357000                                                                  35700000
357100             MOVE PV-DEST-OPER-UNT-ID    TO DL7-DEST-OPER-UNT-ID  35710000
357200             MOVE PV-TRIP-STATUS         TO DL7-TRIP-STATUS       35720000
357300                                                                  35730000
357400             ADD +1                         TO PV-LINE-COUNT      35740000
357500             WRITE REPORT-RECORD FROM DL-DETAIL-LINE-7            35750000
357600             INITIALIZE DL-DETAIL-LINE-7                          35760000
357700          END-IF                                                  35770000
357800       END-IF                                                     35780000
357900                                                                  35790000
358000                                                                  35800000
358100***NOTE***                                                        35810000
358200*CARTON AUDIT - ERRORS (OTHER): IS NOT BEING USED AT THIS TIME.   35820000
358300                                                                  35830000
358400                                                                  35840010
358500*INFORMATIONAL MESSAGES                                           35850000
358600*      IF SU019-CRE-NON-MFST-DC = 'Y' OR                          35860010
358700*         SU019-MFST-NOT-AUD-NON-MFST-DC = 'Y'                    35870010
358800*                                                                 35880010
358900*         PERFORM 3000-PRINT-REPORT-DETAIL                        35890010
359000*                                                                 35900010
359100*         IF PS-SUBHEADII-WRITTEN                                 35910010
359200*            CONTINUE                                             35920010
359300*         ELSE                                                    35930010
359400*            ADD +1              TO PV-LINE-COUNT                 35940010
359500*            WRITE REPORT-RECORD                                  35950010
359600*              FROM PC-BLANK-LINE                                 35960010
359700*                AFTER ADVANCING 1 LINE                           35970010
359800*                                                                 35980010
359900*            ADD +1 TO PV-LINE-COUNT                              35990010
360000*            WRITE REPORT-RECORD FROM SUB-HEADING-LINEII          36000010
360100*            SET PS-SUBHEADII-WRITTEN TO TRUE                     36010010
360200*         END-IF                                                  36020010
360300*      END-IF                                                     36030010
360400                                                                  36040000
360500*CARTON AUDIT - CARTON(S) CREATED FROM NON-MFST DC                36050000
360600       IF SU019-CRE-NON-MFST-DC = 'Y'                             36060000
360700          ADD PC-1 TO PV-CRE-NON-MFST-DC-COUNT                    36070000
360800          IF PS-SUBHEAD9-WRITTEN                                  36080000
360900             CONTINUE                                             36090000
361000          ELSE                                                    36100000
361100             IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES              36110000
361200                PERFORM 8000-PRINT-REPORT-HEADINGS                36120000
361300                PERFORM 8100-WRITE-SUB-HEADINGS                   36130000
361400             ELSE                                                 36140000
361500                CONTINUE                                          36150000
361600             END-IF                                               36160000
361700                                                                  36170000
361800             ADD +1 TO PV-LINE-COUNT                              36180000
361900             WRITE REPORT-RECORD                                  36190000
362000               FROM PC-BLANK-LINE                                 36200000
362100                 AFTER ADVANCING 1 LINE                           36210000
362200                                                                  36220000
362300             ADD +1              TO PV-LINE-COUNT                 36230000
362400             WRITE REPORT-RECORD FROM SUB-HEADING-LINE9           36240000
362500             SET PS-SUBHEAD9-WRITTEN TO TRUE                      36250000
362600          END-IF                                                  36260000
362700                                                                  36270000
362800          PERFORM 3000-PRINT-REPORT-DETAIL                        36280000
362900          MOVE PV-SHIPT-UNT-ID        TO DL9-SHIPT-UNT-ID         36290000
363000          MOVE PV-CRTN-STATUS         TO DL9-CRTN-STATUS          36300000
363100                                                                  36310000
363200          IF PV-MFST-TIMESTAMP > SPACES                           36320000
363300             MOVE PV-MFST-TMST-CC        TO DL9-CC                36330000
363400             MOVE PV-MFST-TMST-YY        TO DL9-YY                36340000
363500             MOVE PV-DASH1               TO DL9-DASH1             36350000
363600             MOVE PV-MFST-TMST-MM        TO DL9-MM                36360000
363700             MOVE PV-DASH2               TO DL9-DASH2             36370000
363800             MOVE PV-MFST-TMST-DD        TO DL9-DD                36380000
363900             MOVE PV-MFST-TMST-HH        TO DL9-HH                36390000
364000             MOVE PV-COLON               TO DL9-COLON             36400000
364100             MOVE PV-MFST-TMST-MI        TO DL9-MI                36410000
364200          ELSE                                                    36420000
364300             MOVE SPACES                 TO DL9-CC                36430000
364400             MOVE SPACES                 TO DL9-YY                36440000
364500             MOVE SPACES                 TO DL9-DASH1             36450000
364600             MOVE SPACES                 TO DL9-MM                36460000
364700             MOVE SPACES                 TO DL9-DASH2             36470000
364800             MOVE SPACES                 TO DL9-DD                36480000
364900             MOVE SPACES                 TO DL9-HH                36490000
365000             MOVE SPACES                 TO DL9-COLON             36500000
365100             MOVE SPACES                 TO DL9-MI                36510000
365200          END-IF                                                  36520000
365300                                                                  36530000
365400          MOVE PV-STATUS-USERID       TO DL9-STATUS-USERID        36540000
365500          MOVE PV-SHPUNT-SRC-ID       TO DL9-SHPUNT-SRC-ID        36550000
365600                                                                  36560000
365700          MOVE PV-PO-NBR              TO DL9-PO-NBR               36570000
365800          MOVE PV-RCVR                TO DL9-RCVR                 36580000
365900          IF PV-PO-NBR = SPACES AND                               36590000
366000             PV-RCVR   = SPACES                                   36600000
366100             MOVE SPACES   TO DL9-PO-DASH                         36610000
366200          ELSE                                                    36620000
366300             MOVE PV-DASH1 TO DL9-PO-DASH                         36630000
366400          END-IF                                                  36640000
366500                                                                  36650000
366600          IF PV-OTBD-TRIP-ID          > ZEROES                    36660000
366700             MOVE PV-OTBD-TRIP-ID        TO DL9-OTBD-TRIP-ID      36670000
366800          ELSE                                                    36680000
366900             MOVE SPACES                 TO DL9-OTBD-TRIP-ID      36690000
367000          END-IF                                                  36700000
367100                                                                  36710000
367200          MOVE PV-DEST-OPER-UNT-ID    TO DL9-DEST-OPER-UNT-ID     36720000
367300          MOVE PV-TRIP-STATUS         TO DL9-TRIP-STATUS          36730000
367400                                                                  36740000
367500          ADD +1                         TO PV-LINE-COUNT         36750000
367600          WRITE REPORT-RECORD FROM DL-DETAIL-LINE-9               36760000
367700          INITIALIZE DL-DETAIL-LINE-9                             36770000
367800       END-IF                                                     36780000
367900                                                                  36790000
368000*MANIFESTED - NOT AUDITED - CARTON(S) CREATED FROM NON-MFST DC    36800000
368100       IF SU019-MFST-NOT-AUD-NON-MFST-DC = 'Y'                    36810000
368200          IF SUNAUD-AUD-TYP-CDE = '01'                            36820000
368300             ADD PC-1 TO PV-NOT-AUD-CRE-NM-DC-COUNT               36830000
368400             IF PS-SUBHEAD10-WRITTEN                              36840000
368500                CONTINUE                                          36850000
368600             ELSE                                                 36860000
368700                IF PV-LINE-COUNT >= PC-MAX-REPORT-LINES           36870000
368800                   PERFORM 8000-PRINT-REPORT-HEADINGS             36880000
368900                   PERFORM 8100-WRITE-SUB-HEADINGS                36890000
369000                ELSE                                              36900000
369100                   CONTINUE                                       36910000
369200                END-IF                                            36920000
369300                                                                  36930000
369400                ADD +1 TO PV-LINE-COUNT                           36940000
369500                WRITE REPORT-RECORD                               36950000
369600                  FROM PC-BLANK-LINE                              36960000
369700                    AFTER ADVANCING 1 LINE                        36970000
369800                                                                  36980000
369900                ADD +1              TO PV-LINE-COUNT              36990000
370000                WRITE REPORT-RECORD FROM SUB-HEADING-LINE10       37000000
370100                   SET PS-SUBHEAD10-WRITTEN TO TRUE               37010000
370200             END-IF                                               37020000
370300                                                                  37030000
370400             PERFORM 3000-PRINT-REPORT-DETAIL                     37040000
370500             MOVE PV-SHIPT-UNT-ID        TO DL10-SHIPT-UNT-ID     37050000
370600             MOVE PV-CRTN-STATUS         TO DL10-CRTN-STATUS      37060000
370700                                                                  37070000
370800          IF PV-MFST-TIMESTAMP > SPACES                           37080000
370900             MOVE PV-MFST-TMST-CC        TO DL10-CC               37090000
371000             MOVE PV-MFST-TMST-YY        TO DL10-YY               37100000
371100             MOVE PV-DASH1               TO DL10-DASH1            37110000
371200             MOVE PV-MFST-TMST-MM        TO DL10-MM               37120000
371300             MOVE PV-DASH2               TO DL10-DASH2            37130000
371400             MOVE PV-MFST-TMST-DD        TO DL10-DD               37140000
371500             MOVE PV-MFST-TMST-HH        TO DL10-HH               37150000
371600             MOVE PV-COLON               TO DL10-COLON            37160000
371700             MOVE PV-MFST-TMST-MI        TO DL10-MI               37170000
371800          ELSE                                                    37180000
371900             MOVE SPACES                 TO DL10-CC               37190000
372000             MOVE SPACES                 TO DL10-YY               37200000
372100             MOVE SPACES                 TO DL10-DASH1            37210000
372200             MOVE SPACES                 TO DL10-MM               37220000
372300             MOVE SPACES                 TO DL10-DASH2            37230000
372400             MOVE SPACES                 TO DL10-DD               37240000
372500             MOVE SPACES                 TO DL10-HH               37250000
372600             MOVE SPACES                 TO DL10-COLON            37260000
372700             MOVE SPACES                 TO DL10-MI               37270000
372800          END-IF                                                  37280000
372900             MOVE PV-STATUS-USERID       TO DL10-STATUS-USERID    37290000
373000             MOVE PV-SHPUNT-SRC-ID       TO DL10-SHPUNT-SRC-ID    37300000
373100                                                                  37310000
373200             MOVE PV-PO-NBR              TO DL10-PO-NBR           37320000
373300             MOVE PV-RCVR                TO DL10-RCVR             37330000
373400             IF PV-PO-NBR = SPACES AND                            37340000
373500                PV-RCVR   = SPACES                                37350000
373600                MOVE SPACES   TO DL10-PO-DASH                     37360000
373700             ELSE                                                 37370000
373800                MOVE PV-DASH1 TO DL10-PO-DASH                     37380000
373900             END-IF                                               37390000
374000                                                                  37400000
374100             IF PV-OTBD-TRIP-ID          > ZEROES                 37410000
374200                MOVE PV-OTBD-TRIP-ID        TO DL10-OTBD-TRIP-ID  37420000
374300             ELSE                                                 37430000
374400                MOVE SPACES                 TO DL10-OTBD-TRIP-ID  37440000
374500             END-IF                                               37450000
374600                                                                  37460000
374700             MOVE PV-DEST-OPER-UNT-ID    TO DL10-DEST-OPER-UNT-ID 37470000
374800             MOVE PV-TRIP-STATUS         TO DL10-TRIP-STATUS      37480000
374900                                                                  37490000
375000             ADD +1                         TO PV-LINE-COUNT      37500000
375100             WRITE REPORT-RECORD FROM DL-DETAIL-LINE-10           37510000
375200             INITIALIZE DL-DETAIL-LINE-10                         37520000
375300          END-IF                                                  37530000
375400       END-IF.                                                    37540000
375500                                                                  37550000
375600                                                                  37560000
375700 8500-PRINT-SUMMARY.                                              37570000
375800     ADD 1                        TO PV-PAGE-COUNT.               37580000
375900     MOVE PV-PAGE-COUNT           TO DP132O-PAGE-NUMBER.          37590000
376000                                                                  37600000
376100     MOVE ZERO                    TO PV-LINE-COUNT.               37610000
376200     MOVE PC-2                    TO DP132O-REPORT-NUMBER.        37620000
376300                                                                  37630000
376400     WRITE REPORT-RECORD                                          37640000
376500       FROM DP132O-STANDRD-HEADER-132-COLS                        37650000
376600         AFTER ADVANCING PAGE.                                    37660000
376700                                                                  37670000
376800     WRITE REPORT-RECORD                                          37680000
376900       FROM SUMMARY-HEADING-LINE1                                 37690000
377000         AFTER ADVANCING 2 LINES.                                 37700000
377100                                                                  37710000
377200     WRITE REPORT-RECORD                                          37720000
377300       FROM SUMMARY-HEADING-LINE2                                 37730000
377400         AFTER ADVANCING 1 LINE.                                  37740000
377500                                                                  37750000
377600     WRITE REPORT-RECORD                                          37760000
377700       FROM PC-BLANK-LINE                                         37770000
377800         AFTER ADVANCING 1 LINE.                                  37780000
377900                                                                  37790000
378000     MOVE SU019-FCLTY-ID          TO SL3-FCLTY-ID                 37800000
378100     MOVE SU019-FCLTY-NME         TO SL3-FCLTY-NME                37810000
378200     WRITE REPORT-RECORD                                          37820000
378300       FROM SUMMARY-HEADING-LINE3                                 37830000
378400         AFTER ADVANCING 1 LINE.                                  37840000
378500                                                                  37850000
378600     MOVE SU019-AUD-CNTL-NBR      TO SL4-AUD-CNTL-NBR             37860000
378700     MOVE SU019-AUD-TYP-CDE       TO SL4-AUD-TYP-CDE              37870000
378800     MOVE SU019-AUD-STAT-CDE      TO SL4-AUD-STAT-CDE             37880000
378900     WRITE REPORT-RECORD                                          37890000
379000       FROM SUMMARY-HEADING-LINE4                                 37900000
379100         AFTER ADVANCING 1 LINE.                                  37910000
379200                                                                  37920000
379300     MOVE SU019-AUD-STRT-TMST     TO PV-DB2-TIMESTAMP             37930000
379400     MOVE PV-TMST-MM              TO SL5-STRT-MM                  37940000
379500     MOVE PV-TMST-DD              TO SL5-STRT-DD                  37950000
379600     MOVE PV-TMST-CC              TO SL5-STRT-CC                  37960000
379700     MOVE PV-TMST-YY              TO SL5-STRT-YY                  37970000
379800     MOVE PV-TMST-HH              TO SL5-STRT-HH                  37980000
379900     MOVE PV-TMST-MI              TO SL5-STRT-MI                  37990000
380000                                                                  38000000
380100     MOVE SU019-AUD-STP-TMST      TO PV-DB2-TIMESTAMP             38010000
380200     MOVE PV-TMST-MM              TO SL5-STP-MM                   38020000
380300     MOVE PV-DASH1                TO SL5-DASH1                    38030000
380400     MOVE PV-TMST-DD              TO SL5-STP-DD                   38040000
380500     MOVE PV-DASH2                TO SL5-DASH2                    38050000
380600     MOVE PV-TMST-CC              TO SL5-STP-CC                   38060000
380700     MOVE PV-TMST-YY              TO SL5-STP-YY                   38070000
380800     MOVE PV-TMST-HH              TO SL5-STP-HH                   38080000
380900     MOVE PV-COLON                TO SL5-COLON                    38090000
381000     MOVE PV-TMST-MI              TO SL5-STP-MI                   38100000
381100                                                                  38110000
381200     IF SL5-STP-DATE = '09-09-9999' AND                           38120000
381300        SL5-STP-TIME = '09:09'                                    38130000
381400        MOVE SPACES               TO SL5-STP-MM                   38140000
381500        MOVE SPACES               TO SL5-DASH1                    38150000
381600        MOVE SPACES               TO SL5-STP-DD                   38160000
381700        MOVE SPACES               TO SL5-DASH2                    38170000
381800        MOVE SPACES               TO SL5-STP-CC                   38180000
381900        MOVE SPACES               TO SL5-STP-YY                   38190000
382000        MOVE SPACES               TO SL5-STP-HH                   38200000
382100        MOVE SPACES               TO SL5-COLON                    38210000
382200        MOVE SPACES               TO SL5-STP-MI                   38220000
382300        MOVE SPACES               TO SL5-AUD-DURATION             38230000
382400     ELSE                                                         38240000
382500        PERFORM 4050-CALC-AUDIT-DURATION                          38250000
382600        IF  PV-CARTON-DURATION  > 0                               38260000
382700            DIVIDE  PV-CARTON-DURATION                            38270000
382800                BY  60                                            38280000
382900            GIVING  PV-CARTON-HOURS                               38290000
383000            REMAINDER  PV-CARTON-MIN                              38300000
383100        ELSE                                                      38310000
383200            MOVE  ZEROES  TO  PV-CARTON-HOURS                     38320000
383300                              PV-CARTON-MIN                       38330000
383400        END-IF                                                    38340000
383500        IF  PV-CARTON-HOURS   >  0  OR                            38350000
383600            PV-CARTON-MIN     >  0                                38360000
383700            MOVE  PV-CARTON-HOURS      TO  PV-DISPLAY-HOURS       38370000
383800            MOVE  PV-CARTON-MIN        TO  PV-DISPLAY-MIN         38380000
383900            MOVE  PV-DISPLAY-DURATION  TO  SL5-AUD-DURATION       38390000
384000        ELSE                                                      38400000
384100            MOVE  SPACES               TO  SL5-AUD-DURATION       38410000
384200        END-IF                                                    38420000
384300     END-IF                                                       38430000
384400                                                                  38440000
384500     WRITE REPORT-RECORD                                          38450000
384600       FROM SUMMARY-HEADING-LINE5                                 38460000
384700         AFTER ADVANCING 1 LINE.                                  38470000
384800                                                                  38480000
384900     MOVE SU019-ORIG-TRLR-SER-NBR TO SL6-ORIG-TRLR-SER-NBR        38490000
385000     MOVE SU019-DEST-TRLR-SER-NBR TO SL6-DEST-TRLR-SER-NBR        38500000
385100     MOVE SU019-DEST-TYP-CDE      TO SL6-DEST-TYP-CDE             38510000
385200     WRITE REPORT-RECORD                                          38520000
385300       FROM SUMMARY-HEADING-LINE6                                 38530000
385400         AFTER ADVANCING 1 LINE.                                  38540000
385500                                                                  38550000
385600     MOVE SU019-ORIG-TRIP-ID      TO SL7-ORIG-TRIP-ID             38560000
385700     MOVE SU019-DEST-TRIP-ID      TO SL7-DEST-TRIP-ID             38570000
385800     MOVE SU019-DEST-OPER-UNT-ID  TO SL7-DEST-OPER-UNT-ID         38580000
385900     WRITE REPORT-RECORD                                          38590000
386000       FROM SUMMARY-HEADING-LINE7                                 38600000
386100         AFTER ADVANCING 1 LINE.                                  38610000
386200                                                                  38620000
386300     MOVE SU019-AUD-INITIATED-BY  TO SL8-AUD-USR-ID               38630000
386400     MOVE SUOBTS-DOOR-ID          TO SL8-DOOR-ID                  38640000
386500     WRITE REPORT-RECORD                                          38650000
386600       FROM SUMMARY-HEADING-LINE8                                 38660000
386700         AFTER ADVANCING 1 LINE.                                  38670000
386800                                                                  38680000
386900     WRITE REPORT-RECORD                                          38690000
387000       FROM PC-BLANK-LINE                                         38700000
387100         AFTER ADVANCING 1 LINE.                                  38710000
387200                                                                  38720014
387300*    MOVE PV-AUD-CRTN-CNT     TO SL9-AUD-CTN-QTY                  38730014
387400*    MOVE PV-AUD-CRTN-ERR-CNT TO SL9-AUD-CTN-ERR-QTY              38740014
387500*    WRITE REPORT-RECORD                                          38750014
387600*      FROM SUMMARY-HEADING-LINE9                                 38760014
387700*        AFTER ADVANCING 1 LINE.                                  38770014
387800                                                                  38780000
387900     WRITE REPORT-RECORD                                          38790000
388000       FROM PC-BLANK-LINE                                         38800000
388100         AFTER ADVANCING 1 LINE.                                  38810000
388200                                                                  38820000
388410     MOVE ZERO TO PV-TOT-ERROR-CNT                                38841014
388420     ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT            38842014
388430         GIVING PV-TOT-ERROR-CNT                                  38843014
388431     IF  SUNAUD-AUD-TYP-CDE = '01'                                38843128
388432         MOVE 'MANIFESTED CARTONS.:' TO SL10-CTN-DESC             38843228
388433     ELSE                                                         38843328
388434         MOVE 'AUDITED CARTONS....:' TO SL10-CTN-DESC             38843428
388435     END-IF                                                       38843528
388440     MOVE SU018-MFST-CRTN-CNT     TO SL10-MFST-CTN-QTY            38844014
388450     MOVE PV-TOT-ERROR-CNT        TO SL10-MFST-CTN-ERR-QTY        38845014
388500                                                                  38850000
388600     EVALUATE TRUE                                                38860000
388700*WHEN 100% AUDIT TYPE                                             38870000
388800        WHEN SUNAUD-AUD-TYP-CDE = '01'                            38880000
388900           IF SU018-MFST-CRTN-CNT     > ZERO                      38890000
388910               MOVE ZERO TO PV-TOT-ERROR-CNT                      38891014
389000               ADD PV-AUD-CRTN-ERR-CNT TO SU018-MFST-NOT-AUD-CNT  38900000
389100                   GIVING PV-TOT-ERROR-CNT                        38910014
389200               DIVIDE PV-TOT-ERROR-CNT BY SU018-MFST-CRTN-CNT     38920014
389300                   GIVING PV-DIVIDEND ROUNDED                     38930000
389400               MULTIPLY PV-DIVIDEND BY 100                        38940000
389500                   GIVING PV-AUD-CRTN-ERR-PRCT                    38950000
389600                                                                  38960000
389700               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             38970000
389800                   GIVING PV-AUDIT-ERROR-PRCT                     38980000
389900                                                                  38990000
390000               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           39000000
390100                  MOVE PC-0   TO SL10-TOT-ACC-RATE                39010000
390200               ELSE                                               39020000
390300                  MOVE PV-AUDIT-ERROR-PRCT                        39030000
390400                              TO SL10-TOT-ACC-RATE                39040000
390500               END-IF                                             39050000
390600           ELSE                                                   39060000
390700               MOVE PC-100 TO SL10-TOT-ACC-RATE                   39070000
390800           END-IF                                                 39080000
390900                                                                  39090000
391000*WHEN SPOT CHECK AUDIT TYPE                                       39100000
391100        WHEN SUNAUD-AUD-TYP-CDE = '02'                            39110000
391200           IF PV-AUD-CRTN-CNT > ZERO                              39120000
391300               DIVIDE PV-AUD-CRTN-ERR-CNT BY PV-AUD-CRTN-CNT      39130000
391400                   GIVING PV-DIVIDEND ROUNDED                     39140000
391500               MULTIPLY PV-DIVIDEND BY 100                        39150000
391600                   GIVING PV-AUD-CRTN-ERR-PRCT                    39160000
391700                                                                  39170000
391800               SUBTRACT PV-AUD-CRTN-ERR-PRCT FROM 100             39180000
391900                   GIVING PV-AUDIT-ERROR-PRCT                     39190000
392000                                                                  39200000
392100               IF PV-AUD-CRTN-ERR-CNT = PV-AUD-CRTN-CNT           39210000
392200                  MOVE PC-0   TO SL10-TOT-ACC-RATE                39220000
392300               ELSE                                               39230000
392400                  MOVE PV-AUDIT-ERROR-PRCT                        39240000
392500                              TO SL10-TOT-ACC-RATE                39250000
392600               END-IF                                             39260000
392700           ELSE                                                   39270000
392800               MOVE PC-100 TO SL10-TOT-ACC-RATE                   39280000
392900           END-IF                                                 39290000
393000     END-EVALUATE.                                                39300000
393100                                                                  39310000
393200     WRITE REPORT-RECORD                                          39320000
393300       FROM SUMMARY-HEADING-LINE10                                39330000
393400         AFTER ADVANCING 1 LINE.                                  39340000
393500                                                                  39350000
393600     WRITE REPORT-RECORD                                          39360000
393700       FROM PC-BLANK-LINE                                         39370000
393800         AFTER ADVANCING 1 LINE.                                  39380000
393900                                                                  39390000
394000     WRITE REPORT-RECORD                                          39400000
394100       FROM SUMMARY-HEADING-LINE11                                39410000
394200         AFTER ADVANCING 1 LINE.                                  39420000
394300                                                                  39430000
394400     WRITE REPORT-RECORD                                          39440000
394500       FROM PC-BLANK-LINE                                         39450000
394600         AFTER ADVANCING 1 LINE.                                  39460000
394700                                                                  39470000
394800     WRITE REPORT-RECORD                                          39480000
394900       FROM SUMMARY-HEADING-LINE12                                39490000
395000         AFTER ADVANCING 1 LINE.                                  39500000
395100                                                                  39510000
395200     WRITE REPORT-RECORD                                          39520000
395300       FROM SUMMARY-HEADING-LINE13                                39530000
395400         AFTER ADVANCING 1 LINE.                                  39540000
395500                                                                  39550000
395510     ADD PV-AUD-EXC-ERR-CNT TO SU018-MFST-NOT-AUD-CNT             39551031
395520         GIVING PV-AUD-TOT-ERR-CNT.                               39552031
395530                                                                  39553031
395540     MOVE PV-AUD-TOT-ERR-CNT TO SL13A-NBR-ERRORS.                 39554031
395541                                                                  39554131
395542     WRITE REPORT-RECORD                                          39554231
395543       FROM SUMMARY-HEADING-LINE13A                               39554331
395544         AFTER ADVANCING 1 LINE.                                  39554431
395550                                                                  39555031
395600     MOVE PV-MISLOAD-COUNT TO SL14-NBR-CRTNS                      39560000
395700                                                                  39570000
395800     IF PV-MISLOAD-COUNT    > ZERO AND                            39580000
395900        SU018-MFST-CRTN-CNT > ZERO                                39590000
396000         DIVIDE PV-MISLOAD-COUNT BY SU018-MFST-CRTN-CNT           39600000
396100             GIVING PV-DIVIDEND ROUNDED                           39610000
396200         MULTIPLY PV-DIVIDEND BY 100                              39620000
396300             GIVING PV-AUD-CRTN-ERR-PRCT                          39630000
396400             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL14-PRCT-ERROR      39640000
396500     ELSE                                                         39650000
396600         MOVE ZEROES  TO  PV-DIVIDEND                             39660000
396700                          SL14-PRCT-ERROR                         39670000
396800     END-IF                                                       39680000
396900                                                                  39690000
397000     WRITE REPORT-RECORD                                          39700000
397100       FROM SUMMARY-HEADING-LINE14                                39710000
397200         AFTER ADVANCING 1 LINE.                                  39720000
397300                                                                  39730000
397400     MOVE PV-NOT-MFST-COUNT TO SL15-NBR-CRTNS                     39740000
397500                                                                  39750000
397600     IF PV-NOT-MFST-COUNT   > ZERO AND                            39760000
397700        SU018-MFST-CRTN-CNT > ZERO                                39770000
397800         DIVIDE PV-NOT-MFST-COUNT BY SU018-MFST-CRTN-CNT          39780000
397900             GIVING PV-DIVIDEND ROUNDED                           39790000
398000         MULTIPLY PV-DIVIDEND BY 100                              39800000
398100             GIVING PV-AUD-CRTN-ERR-PRCT                          39810000
398200             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL15-PRCT-ERROR      39820000
398300     ELSE                                                         39830000
398400         MOVE ZEROES  TO  PV-DIVIDEND                             39840000
398500                          SL15-PRCT-ERROR                         39850000
398600     END-IF                                                       39860000
398700                                                                  39870000
398800     WRITE REPORT-RECORD                                          39880000
398900       FROM SUMMARY-HEADING-LINE15                                39890000
399000         AFTER ADVANCING 1 LINE.                                  39900000
399100                                                                  39910000
399200     MOVE PV-CONTENTS-UNKNOWN-COUNT TO SL16-NBR-CRTNS             39920000
399300                                                                  39930000
399400     IF PV-CONTENTS-UNKNOWN-COUNT > ZERO AND                      39940000
399500        SU018-MFST-CRTN-CNT       > ZERO                          39950000
399600         DIVIDE PV-CONTENTS-UNKNOWN-COUNT BY SU018-MFST-CRTN-CNT  39960000
399700             GIVING PV-DIVIDEND ROUNDED                           39970000
399800         MULTIPLY PV-DIVIDEND BY 100                              39980000
399900             GIVING PV-AUD-CRTN-ERR-PRCT                          39990000
400000             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL16-PRCT-ERROR      40000000
400100     ELSE                                                         40010000
400200         MOVE ZEROES  TO  PV-DIVIDEND                             40020000
400300                          SL16-PRCT-ERROR                         40030000
400400     END-IF                                                       40040000
400500                                                                  40050000
400600     WRITE REPORT-RECORD                                          40060000
400700       FROM SUMMARY-HEADING-LINE16                                40070000
400800         AFTER ADVANCING 1 LINE.                                  40080000
400900                                                                  40090000
401000     MOVE PV-DUPLICATE-SCAN-COUNT TO SL17-NBR-CRTNS               40100000
401100                                                                  40110000
401200     IF PV-DUPLICATE-SCAN-COUNT > ZERO AND                        40120000
401300        SU018-MFST-CRTN-CNT      > ZERO                           40130000
401400         DIVIDE PV-DUPLICATE-SCAN-COUNT BY SU018-MFST-CRTN-CNT    40140000
401500             GIVING PV-DIVIDEND ROUNDED                           40150000
401600         MULTIPLY PV-DIVIDEND BY 100                              40160000
401700             GIVING PV-AUD-CRTN-ERR-PRCT                          40170000
401800             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL17-PRCT-ERROR      40180000
401900     ELSE                                                         40190000
402000         MOVE ZEROES  TO  PV-DIVIDEND                             40200000
402100                          SL17-PRCT-ERROR                         40210000
402200     END-IF                                                       40220000
402300                                                                  40230000
402400     WRITE REPORT-RECORD                                          40240000
402500       FROM SUMMARY-HEADING-LINE17                                40250000
402600         AFTER ADVANCING 1 LINE.                                  40260000
402700                                                                  40270000
402800     MOVE PV-INACTIVE-COUNT TO SL18-NBR-CRTNS                     40280000
402900                                                                  40290000
403000     IF PV-INACTIVE-COUNT   > ZERO AND                            40300000
403100        SU018-MFST-CRTN-CNT > ZERO                                40310000
403200         DIVIDE PV-INACTIVE-COUNT BY SU018-MFST-CRTN-CNT          40320000
403300             GIVING PV-DIVIDEND ROUNDED                           40330000
403400         MULTIPLY PV-DIVIDEND BY 100                              40340000
403500             GIVING PV-AUD-CRTN-ERR-PRCT                          40350000
403600             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL18-PRCT-ERROR      40360000
403700     ELSE                                                         40370000
403800         MOVE ZEROES  TO  PV-DIVIDEND                             40380000
403900                          SL18-PRCT-ERROR                         40390000
404000     END-IF                                                       40400000
404100                                                                  40410000
404200     WRITE REPORT-RECORD                                          40420000
404300       FROM SUMMARY-HEADING-LINE18                                40430000
404400         AFTER ADVANCING 1 LINE.                                  40440000
404500                                                                  40450000
404600     MOVE PV-NOT-FOUND-COUNT TO SL19-NBR-CRTNS                    40460000
404700                                                                  40470000
404800     IF PV-NOT-FOUND-COUNT  > ZERO AND                            40480000
404900        SU018-MFST-CRTN-CNT > ZERO                                40490000
405000         DIVIDE PV-NOT-FOUND-COUNT BY SU018-MFST-CRTN-CNT         40500000
405100             GIVING PV-DIVIDEND ROUNDED                           40510000
405200         MULTIPLY PV-DIVIDEND BY 100                              40520000
405300             GIVING PV-AUD-CRTN-ERR-PRCT                          40530000
405400             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL19-PRCT-ERROR      40540000
405500     ELSE                                                         40550000
405600         MOVE ZEROES  TO  PV-DIVIDEND                             40560000
405700                          SL19-PRCT-ERROR                         40570000
405800     END-IF                                                       40580000
405900                                                                  40590000
406000     WRITE REPORT-RECORD                                          40600000
406100       FROM SUMMARY-HEADING-LINE19                                40610000
406200         AFTER ADVANCING 1 LINE.                                  40620000
406300                                                                  40630000
406400     MOVE PV-MFST-NOT-AUD-COUNT TO SL20-NBR-CRTNS                 40640000
406500                                                                  40650000
406600     IF PV-MFST-NOT-AUD-COUNT > ZERO AND                          40660000
406700        SU018-MFST-CRTN-CNT   > ZERO                              40670000
406800         DIVIDE PV-MFST-NOT-AUD-COUNT BY SU018-MFST-CRTN-CNT      40680000
406900             GIVING PV-DIVIDEND ROUNDED                           40690000
407000         MULTIPLY PV-DIVIDEND BY 100                              40700000
407100             GIVING PV-AUD-CRTN-ERR-PRCT                          40710000
407200             MOVE PV-AUD-CRTN-ERR-PRCT    TO SL20-PRCT-ERROR      40720000
407300     ELSE                                                         40730000
407400         MOVE ZEROES  TO  PV-DIVIDEND                             40740000
407500                          SL20-PRCT-ERROR                         40750000
407600     END-IF                                                       40760000
407700                                                                  40770000
407800     WRITE REPORT-RECORD                                          40780000
407900       FROM SUMMARY-HEADING-LINE20                                40790000
408000         AFTER ADVANCING 1 LINE.                                  40800000
408100                                                                  40810000
408200*    WRITE REPORT-RECORD                                          40820030
408300*      FROM SUMMARY-HEADING-LINE22                                40830030
408400*        AFTER ADVANCING 1 LINE.                                  40840030
408500                                                                  40850000
408600*    MOVE PV-CRE-NON-MFST-DC-COUNT TO SL23-NBR-CRTNS              40860010
408700                                                                  40870010
408800*    IF PV-CRE-NON-MFST-DC-COUNT > ZERO AND                       40880010
408900*       SU018-MFST-CRTN-CNT      > ZERO                           40890010
409000*        DIVIDE PV-CRE-NON-MFST-DC-COUNT BY SU018-MFST-CRTN-CNT   40900010
409100*            GIVING PV-DIVIDEND ROUNDED                           40910010
409200*        MULTIPLY PV-DIVIDEND BY 100                              40920010
409300*            GIVING PV-AUD-CRTN-ERR-PRCT                          40930010
409400*            MOVE PV-AUD-CRTN-ERR-PRCT    TO SL23-PRCT-ERROR      40940010
409500*    ELSE                                                         40950010
409600*        MOVE ZEROES  TO  PV-DIVIDEND                             40960010
409700*                         SL23-PRCT-ERROR                         40970010
409800*    END-IF                                                       40980010
409900                                                                  40990000
410000*    WRITE REPORT-RECORD                                          41000010
410100*      FROM SUMMARY-HEADING-LINE23                                41010010
410200*        AFTER ADVANCING 1 LINE.                                  41020010
410300                                                                  41030000
410400*    MOVE PV-NOT-AUD-CRE-NM-DC-COUNT TO SL24-NBR-CRTNS            41040010
410500                                                                  41050010
410600*    IF PV-NOT-AUD-CRE-NM-DC-COUNT > ZERO AND                     41060010
410700*       SU018-MFST-CRTN-CNT        > ZERO                         41070010
410800*        DIVIDE PV-NOT-AUD-CRE-NM-DC-COUNT BY SU018-MFST-CRTN-CNT 41080010
410900*            GIVING PV-DIVIDEND ROUNDED                           41090010
411000*        MULTIPLY PV-DIVIDEND BY 100                              41100010
411100*            GIVING PV-AUD-CRTN-ERR-PRCT                          41110010
411200*            MOVE PV-AUD-CRTN-ERR-PRCT    TO SL24-PRCT-ERROR      41120010
411300*    ELSE                                                         41130010
411400*        MOVE ZEROES  TO  PV-DIVIDEND                             41140010
411500*                         SL24-PRCT-ERROR                         41150010
411600*    END-IF                                                       41160010
411700                                                                  41170000
411800*    WRITE REPORT-RECORD                                          41180010
411900*      FROM SUMMARY-HEADING-LINE24                                41190010
412000*        AFTER ADVANCING 1 LINE.                                  41200010
412100                                                                  41210000
412200     WRITE REPORT-RECORD                                          41220000
412300       FROM END-OF-REPORT-LINE                                    41230000
412400         AFTER ADVANCING 1 LINES.                                 41240000
412500                                                                  41250000
412600     MOVE SPACES TO REPORT-RECORD.                                41260000
412700     WRITE REPORT-RECORD                                          41270000
412800         AFTER ADVANCING 1 LINE.                                  41280000
412900                                                                  41290000
413000     ADD +18             TO PV-LINE-COUNT.                        41300000
413100                                                                  41310000
413200                                                                  41320000
413300*CLOSE FILES.                                                     41330000
413400 9000-END-PROCESS.                                                41340000
413500     IF PS-CURSOR-OPEN                                            41350000
413600         PERFORM 1650-CLOSE-USERID-CSR                            41360000
413700     END-IF.                                                      41370000
413800                                                                  41380000
413900     WRITE REPORT-RECORD                                          41390000
414000       FROM PC-BLANK-LINE                                         41400000
414100         AFTER ADVANCING 1 LINES.                                 41410000
414200                                                                  41420000
414300     IF PS-END-OF-EXTRACT1 AND PS-END-OF-EXTRACT2                 41430000
414400           WRITE REPORT-RECORD                                    41440000
414500             FROM END-OF-REPORT-LINE                              41450000
414600               AFTER ADVANCING 1 LINES                            41460000
414700                 IF PS-DETAIL-WRITTEN                             41470000
414800                    PERFORM 8500-PRINT-SUMMARY                    41480000
414900                 END-IF                                           41490000
415000     END-IF                                                       41500000
415100                                                                  41510000
415200     IF PS-END-OF-EXTRACT1                                        41520000
415300        CONTINUE                                                  41530000
415400     END-IF                                                       41540000
415500                                                                  41550000
415600     CLOSE CARDIN-INPUT-FILE                                      41560000
415700           AUDIT-EXTRACT-FILE                                     41570000
415800           CRTN-MFST-FILE                                         41580000
415900           REPORT-FILE.                                           41590000
416000                                                                  41600000
416100                                                                  41610000
416200 9100-SQL-ABEND.                                                  41620000
416300     MOVE SQLCODE                     TO SQLCODE2.                41630000
416400     MOVE SQLERRD(3)                  TO SQLERRD3.                41640000
416500                                                                  41650000
416600     DISPLAY '** ABEND **         ** = SQLERROR'.                 41660000
416700     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME.        41670000
416800     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              41680000
416900     DISPLAY '** OPERATION ** = ' PV-DB2-FUNCTION.                41690000
417000                                                                  41700000
417100     DISPLAY '** SQLCODE          ** = ' SQLCODE2.                41710000
417200     DISPLAY '** ROWS PROCESSED   ** = ' SQLERRD3.                41720000
417300     DISPLAY '** SQLERRM          ** = ' SQLERRM.                 41730000
417400     DISPLAY '** SQLERRMC         ** = ' SQLERRMC.                41740000
417500                                                                  41750000
417600                                                                  41760000
417700     MOVE +4013                       TO ABEND-CODE.              41770000
417800     CALL 'ILBOABN0' USING ABEND-CODE.                            41780000
